{
    "description": "NTS Map: 092G07The Cypress XC ski area is a very well groomed 16 km of skate and classic ski trail network that is available during the day and during the evenings with it's lit trails.  XC skiing here is not free, however, you won't find a better winter XC escape so close to Vancouver. The branches of large fir and cedar trees are usually heavy with snow, a lot of it.  You really feel like you've escaped into another world. Make no mistake, however, although the trails are easy to get to, they twist up and down and provide plenty of thrills, if not spills. To get to Cypress Bowl from Vancouver, proceed over the Lion's gate bridge (or 2nD Narrows) and take highway 99 as if you were going to Horseshoe Bay (or Whistler) however, while on the upper levels Highway, just North of West Vancouver, you will see signs for Cypress Bowl on the right.  Take the turnoff and when up top, be careful to take the XC ski area turnoff instead of driving a little further to the downhill area.  Our 3D rendering make the trails look flat but they aren't.  Hollyburn lodge has quite a history and its quaint original structure is still open to visitors much as it was in the twenties or thirties.  These days however you can buy lunch or dinner, and they'll even sell you a beer!  Check out the schedule of live entertainment and special meals, like fondue night!  A great group outing. In the lodge itself, you'll get a sense of local ski history as you check out the old pics of skiers in their swell outfits.   Vancouver area skiers are lucky indeed that they can enjoy such a first class groomed ski area with awesome views of Georgia Straight and Vancouver.  Try a warm sunny afternoon in early Spring when everyone else is at the office.  You'll find yourself soaking up the sun, and enjoying the views all around. Turn around and ski another loop, then head into the lodge for some chilli. If you are really ambitious, ski up towards HollyBurn Peak (the peak is really only accessible by snowshoe (another great activity on Cypress) and stop off at the upper warming hut on the way.",
    "directions": "See description and / or GPS",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/1/3D_Cypresski.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1/reg_DCP_0016.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1/reg_HollyburnLodge.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1/reg_Kurt1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1/reg_PICLodge1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1/reg_PIClodge2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1/reg_lodge1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1/reg_map.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1/reg_sun3.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/cypress-mountain-xc-near-vancouver-bc-1",
    "stats": {
        "Activities": "ski-xc",
        "From": "",
        "Seasons": "winter",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "20 km",
        "Town": "Vancouver, BC",
        "Type": "out-and-back"
    },
    "title": "Cypress Mountain XC",
    "trail_id": "1"
}