{
    "description": "The Grouse Grind is probably Vancouver's most popular hike, especially for the fitness oriented crowd.  Most regulars know exactly how long it takes them to get to the top, and, what their PR is! There is even a bi-annual race. It's a very steep climb that may be described as a more natural version of stair-masterfor the after-work crowd. It was originally used as a training climb for those planning on longer hikes. These days, at the top, you can buy a snack, shop, hike some more, or grab a burger & coke, um, make that a beer. The view from the patio is awesome on a summer evening. You can hike down, or, take the gondola for $10.  Imagine a Gondola full of sweaty hikers.  The Grind is well marked, and has signs marking each quarter of the hike, so you have a rough idea of how much more to do. It's never a question of where to go (the trail is as worn in like the steps of St. Peters) but of how much longer. Cardio!   Singles!   Sweat! Nature? The start of the hike is easily found after driving or taking the bus up Capilano Road (stay right after crossing the Lion's gate bridge in Vancouver) to the base of the mountain, the road goes no further.  On the way, you will pass the Capilano Suspension Bridge - another popular tourist destination.  After parking in one of several areas (now pay, read as ripoff), make your way to the right of the road, opposite the Gondola, and look for a notice board, clock, and even a vending machine with water? you'll want water.  Make sure you start before it gets too late (the region will help you in this way by locking a small gate at curfew time, which varies during the summer but is usually 7 p.m. or so).  If you like the proximity of the Grouse Grind but are ready for some variety, there are a number of North Shore hikes nearby - such as Black Mountain (Eagle Bluffs), Cypress falls, Brothers Creek, Deek's Bluffs, and so on, they are all on trailpeak - but you will have to forgo some of the conveniences of the Grind and you won't have the easy way down!  Note that there are a few less crowded routes branching off of the Grouse Grind, but we'll leave you to discover those, hint BCMC.  Map of the Grouse Grind: NTS Map 92G06",
    "directions": "See description and / or GPS",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/10/3D_grouseHike.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10/narrown725825433-3024964-6210-15244.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10/reg_IMG-4215-47620.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10/reg_IMG-4218-47620.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10/reg_View-from-Grouse-top-3-22048.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10/reg_view-from-Grouse-top-2-22048.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10/narrow_Grouse-Grind-22048_best1_.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/grouse-grind-near-vancouver-bc-10",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "2 km",
        "Town": "Vancouver, BC",
        "Type": "out-and-back"
    },
    "title": "Grouse Grind",
    "trail_id": "10"
}