{
    "description": "Trail starts on an old road and is fairly level at the start then starts to climb. Pretty constant climb and connects with the High Rim Trail going to the repeater tower. Far shorter than taking the trail from the Kalamalka Lake Park gate.",
    "directions": "From the Kalamalka Lake Park gate & parking lot, travel 3.4km on the gravel road. You will see a small parking area on your left with three large boulders blocking an old skid road. There is room for 3-4 cars to park and as it is off the road, is OK for parking. There are two ways to travel the first part of the route. The first is on the old skid road which is what is shown in the GPS file. If you are going to hike up to the High Rim trail you may want to take that as the Twisted Sister trail is a climb. The second is to take the Crash of 08 trail which you will see on the right about 75 meters up the old road. The two join again further up. Taking the road, when you join up again with the Crash of 08 trail, about 15 meters on the left past the junction, you will see the Twisted Sister trail. continue up the trail and you will join up with the High Rim trail which is also an old skid road. This takes you towards the repeater tower. From the parking area to the junction of the High Rim Trail and the Twisted Sister Trail is 2.03km.\nWarning: There is an older gentleman that hikes this area nude. Loves hiking, hates clothes but is safe and friendly.",
    "geohash": "c2gj",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/10018/reg_DSC00007-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10018/reg_DSC00008-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10018/reg_DSC00025-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10018/reg_DSC00026-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10018/reg_DSC00027-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10018/reg_DSC00028-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10018/reg_DSC00029-5599.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/twisted-sister-near-vernon-bc-10018",
    "stats": {
        "Activities": "hike mtn-bike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "4 km",
        "Town": "Vernon, BC",
        "Type": "out-and-back"
    },
    "title": "Twisted Sister",
    "trail_id": "10018"
}