{
    "description": "The following is a description of a hike I did into the woods and along the main branch of the Armstrong River near Martock.  The highlights of the hike are a series of wide waterfalls on the Armstrong River and 60foot cliffs suitable for rock climbing located on a smaller tributary of the river.\r\rFrom my parking location, I followed the old roadbed for a few hundred feet and then headed due south into the forest.  I really liked walking in this forest.  It was mainly composed of mature conifers and the forest floor was covered by Labrador tea shrubs.  In some spots, there were holes in the canopy above and large areas were covered by moss and lichens.  Overall, the walking is very easy with very little downfall to navigate through.  In about 700m, I had made it to the Armstrong River and to the first of about five major falls on this river.  The first fall cascades into an area of the river where there were rock walls on either side?not high enough to be called a gorge but still picturesque.  Moving downstream from this point, I followed the river?s edge and travelled on a well established game trail from time to time.\r\rAt one of the final waterfall before you get to a large lake, there was this massive (20ft high) boulder on the side of the river, climb to the top of it to a magnificent view of the waterfall located downstream from it.  At the time of my visit, the water was running fairly high and I tried a few times to cross the river without success.  I actually made it across the river right before it enters the lake by jumping across well positioned stones in the river.  Following the western edge of the lake, you will come up to a tributary that flows into the lake within about 200m from the Armstrong River.  Follow this stream up the mountain to see some more cascades and one fall of about 20ft.  Right beside this fall, I saw some strange marking on trees and some numbers that had been painted on some trunks as well.  This leads me to believe that there might be another way to access this place.  From my car to this point I had travelled about 4km without seeing any other signs of human activity.\r\rI retraced my steps back to the Armstrong River and then re-crossed the river.  I then followed a small tributary located just east of the Armstrong River which will lead you back to the dirt road and your starting point.  The tributary has some fairly smallish fall and the walk is more difficult due to smaller trees growing on its banks.  However after leaving the lake and travelling less than one kilometer, you will come up to some cool cliffs on the left side of the stream (looking upstream).  These cliffs are about 60ft high and have everything a climber would want; solid rocks (granite), not much vegetation to clean off, nice cracks going up, lots of decent size boulders close by, some overhangs.  There is even a large boulder that fell off the cliff in such a way that it has created a kind of cave.\r\rFrom then on, I followed the tributary alongside some massive boggy areas.  There were lots of signs of beaver activities and overall this was the least interesting part of the hike.  The upside, there is only about 1km of this to navigate until you intersect the dirt road you started on so persevere or take a more direct line over the hills instead of following the tributary.\r\r\r",
    "directions": "Highway 14 towards Chester.  Turn on Armstrong Lake east Rd and stay on this main road until a dirt road comes up on your right at (44° 49.542'N, 64° 10.764'W).  Travel down this dirt road until it becomes so narrow that it is really more of an ATV trail at approximately (44° 47.739'N, 64° 9.755'W).  Head due south from here?\r",
    "geohash": "dxfq",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/10027/20110415034.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10027/ArmstronRiverFallIII.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/armstron-river-loop-near-windsor-ns-10027",
    "stats": {
        "Activities": "hike climb",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "9 km",
        "Town": "Windsor, NS",
        "Type": "out-and-back"
    },
    "title": "Armstron River Loop",
    "trail_id": "10027"
}