{
    "description": "Johnson Cove Sea Caves\r\rThis is a short hike on the shores of Minas Basin.  You need to check the tide tables before heading out because the places I describe are only accessible at low tides.  The main attraction of this short but cool hike are a series of sea caves formed into a large limestone cliff set on the shore of the Bay of Fundy.\r\rFrom the nice park by the waters edge, make your way to the seafloor and start walking along the shore in a northeast manner.  It?s about 400m from the parking area to the cliff which remains hidden until you practically get to it.  And then what a surprise, this tall limestone cliff face materializes out of nowhere.  Interspersed throughout the cliffs are a series of sea caves.  There is a major one that probably stays dry most of the time and it?s fairly deep (20-30ft) and high enough that you can stand in it most of the way.  Right beside it is another sea cave that is set really close to the ground and will require you to make a belly crawl to get inside.  The water has created more than one access point in this particular cave.  Right around the corner is the highest portion of the cliff and some large blocks have fallen down and created a large pile of boulders.  There is another, smaller, cave like opening by these large boulders.  There is another great hike to do just around the corner from this one and I have described it in the post called Cheverie Keyholes; www.trailpeak.com/trail-Cheverie-Keyholes-near-Windsor-NS-9999\r\r",
    "directions": "Take highway 215 towards Cheverie and park at 45° 9.627'N, 64° 10.118'W\r",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/10028/reg_DSC-0069-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10028/reg_DSC-0072-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10028/reg_DSC-0081-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10028/narrow_DSC-0078-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10028/narrow_DSC-0085-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/johnson-cove-sea-caves-near-windsor-ns-10028",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "2 km",
        "Town": "Windsor, NS",
        "Type": "out-and-back"
    },
    "title": "Johnson Cove Sea Caves",
    "trail_id": "10028"
}