{
    "description": "A scenic hike that covers a range of trail conditions, from wide access-road to well-trodden trail to off-the-beaten path.  The trail is in pretty good shape in general, though even in late April there are some pretty muddy sections that made me glad I wore my waterproof hikers.  I was also glad I had my gps, but then I'm a novice.  \r\r",
    "directions": "From Hwy 1 take exit 10, or from Old Island Hwy, head for Burnside Rd W to Watkiss Way and turn left.  Follow Watkiss around a hard right where it becomes Highland Rd.  As you stay on Highland you will see an \"Entering Thetis Lake Park\" sign... don't be fooled... this is also the road home for some people, so though you will see few cars, they may be traveling at lightening speed.  You will see a few small pull-outs, but continue on until you see a more significant parking area on the left; this is the Trillium trailhead.  Be sure to park completely off the pavement!\r\rIn general, if you see a fork in the road, keep right.  You'll first start heading off the main trail at a marking for \"Seaborn Trail; To McKenzie Creek\".  At the next fork, someone kindly painted arrows on a couple of trees encouraging you to go right... good idea!  When you first come to McKenzie creek you'll wonder if you should ford the river or risk using the log.  But stay on the trail with the creek on your right, and soon you'll come to a bridge across the creek... less exciting but safer!  At the foot of the bridge another fork... stay right again (someone hung some flagging ribbon, but will it last?).  Eventually you'll come back out onto Highland road, and a short walk to the right will take you past Prior Lake and back to your car.",
    "photos": [],
    "source_url": "https://trailpeak.com/trails/thetis-lake-mckenzie-cr-prior-lk-near-victoria-bc-10039",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "4 km",
        "Town": "Victoria, BC",
        "Type": "out-and-back"
    },
    "title": "Thetis Lake; McKenzie Cr & Prior Lk",
    "trail_id": "10039"
}