{
    "description": "Okanagan Mountain Park when you look at the Parks map, doesn't seem that large and a relatively easy hike to the other side. Nothing could be further from the truth. The park is huge and is a lot further to the camp sites on the other side from the Kelowna end. One work around to reduce the distance is to use a shortcut that isn't shown on the map. I would estimate that this route would cut about 2/3 of the first part of the hike to Horse Creek crossing. The park it's self and the hike would be more interesting but, due to all the forest fires, it is not what it used to be. The route I have show is 8.5km and took me two hours at a pace averaging over 4km/h. 3 Hours would make it more enjoyable.",
    "directions": "Travel along Lakeshore from Kelowna as you normally would from Kelowna and when you get to the main parking lot, drive a further 1.7km. Look for a iron gate with two rock pillars on a driveway on the right and a large single tower pole. The entrance to the park is on the left about another 10 meters further. There is room on the left side of the road to park several vehicles (right side facing town). You will see a metal gate at the entrance. (see pictures). The trail most of the way is an old skid road and easy to follow. Once you get back on the level, you will come to an intersection of trails. It is about 1.9km from the parking area to this intersection. The one on the left is the one that comes from the main parking lot. The trail to the right is the one you want to take. There is a small bridge which crosses Horse Creek. From there just follow the old road. Be aware there was a black bear about 1 1/2 to 2m further on from the end of the track I have marked. This was on April 26,2011. There is an area further on that has thick brush and on the other side, a rock slide. I also saw a bear (maybe same one) in this same area (rock slide) last year. The bear moved off as I make noise as I hike.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/10040/reg_DSC00104-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10040/reg_DSC00105-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10040/reg_DSC00106-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10040/reg_DSC00107-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10040/reg_DSC00108-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10040/reg_DSC00109-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10040/reg_DSC00110-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10040/reg_DSC00111-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10040/reg_DSC00112-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10040/reg_DSC00113-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10040/reg_DSC00114-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10040/reg_DSC00115-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10040/reg_DSC00116-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10040/narrow_OK-Mountain-Park-5599.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/okanagan-mountain-park-near-kelowna-bc-10040",
    "stats": {
        "Activities": "mtn-bike hike snowshoe",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 2,
        "Time": "3 hrs",
        "Total Distance": "9 km",
        "Town": "Kelowna, BC",
        "Type": "out-and-back"
    },
    "title": "Okanagan Mountain Park",
    "trail_id": "10040"
}