{
    "description": "This track travels the outside trail of the upper Ellison Park. It is a pleasant and relatively easy hike for the whole family. There are a few steep spots on the South decent but, the rest is a gradual elevation gain & loss. Total distance traveled, 3.7km.",
    "directions": "Driving south on OK Landing Road, continue out to just before the entrance to Ellison Park's campground. About 200 meters before the campground entrance, there is a gravel parking area on the left. There is a yellow barricade which is just about always left open. Park and on the right you will see a trail. \r\rWalk up the old road to the left and in about 270 meters you will see a trail going to the right. You can stay on the road if you wish and when you see an old truck body, go right and be within about 50 meters of where the trail rejoins the road but, the trail is a lot more pleasant. If you do continue on the road and go left, in a short distance you will come to a golf course and can't go any further. Once the trail rejoins the road, turn right up the road and follow it to the level area. In about 1 1/2km you will come to the trail that leads back down to the parking area. This is a well used trail with bikes so watch your back.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/10048/reg_DSC00030-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10048/reg_DSC00096-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10048/reg_DSC00169-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10048/reg_DSC00170-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10048/reg_DSC00171-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10048/reg_DSC00172-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10048/reg_DSC00173-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10048/reg_DSC00174-5599.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/ellison-park-3-near-vernon-bc-10048",
    "stats": {
        "Activities": "mtn-bike hike snowshoe",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "4 km",
        "Town": "Vernon, BC",
        "Type": "out-and-back"
    },
    "title": "Ellison Park #3",
    "trail_id": "10048"
}