{
    "description": "This track is a combination of Pond Loop, 36DD, Twista and the High Rim trails. I have labeled it difficult mainly because of 36DD. The Pond Trail is very easy but, the 36DD is very steep in places and at one point,scales a rock face. There are many steep and rocky places and is a challenge to a hiker and any mountain bikes should only attempt it if in the Expert range. Some people have spent a lot of time towards the upper area in building technical ramps & paths. Twista has some steep stretches but, is more reasonable for the average person. I would expect a person on a bike would travel up High Rim and then down 36DD or Twista. From the parking area to the top of 36DD is 1.59km. To the end of Twista where you come out on is about 2.75km.\r",
    "directions": "Take the road to the main gate & parking lot for the Kalamalka Lake Park. From the gate & parking lot, travel 2.9km on the gravel road to the start of the trail on the left. The first path you will come to is the High Rim Trail and you used to be able to park there but, they have now posted it \"No Parking, Evacuation Route\". The Pond Loop Trail is about 150 meters further up the road and there is room to park one small vehicle if you are careful. You can park here or go to the 3.4/3.5km marker which is the Crash of 08 trail, which has room for at east 3 vehicles and walk down the road to the trail start unless you have someone to drop off & pick up.\r\rThe Pond is about 1/2km from the the trail start and when you get to it, take the right path. About 100 meters along the path you will come to the 36DD trail head. Proceed up the trail and when you get to the area where the technical jumps & ramps are, you may have to search a bit for the path but, if you follow the jumps, you shouldn't have a problem. When you get to the top, it intersects with the High Rim trail. Go left and in about 50 meters you will see the trail head for Twista. Once you reach the other end of Twista, you will come to the intersection of Twista, High Rim and South Park. Go left on the High Rim trail and continue to the Pond. If you want to go behind the pond again, take the trail to the left just before the pond. If you want to go back a little further on, just past the pond you will see a post with \"HRT\" and an arrow to the right. About 3-4 meters before that post is the Pond trail on the left. It is a bit hidden. Take that left and you will go past the end of the pond and join onto the trail you came up on.\r\rWarning: There is an older gentleman that hikes this area nude. Loves hiking, hates clothes but is safe and friendly.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/10051/reg_DSC00117-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10051/reg_DSC00118-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10051/reg_DSC00181-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10051/reg_DSC00182-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10051/reg_DSC00183-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10051/reg_DSC00184-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10051/reg_DSC00185-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10051/reg_DSC00186-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10051/reg_DSC00187-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10051/reg_DSC00188-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10051/reg_DSC00189-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10051/reg_DSC00190-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10051/reg_DSC00191-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10051/reg_DSC00192-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10051/reg_DSC00193-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10051/reg_DSC00194-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10051/reg_DSC00195-5599.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/pond-loop-36dd-twista-near-vernon-bc-10051",
    "stats": {
        "Activities": "mtn-bike hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "4 km",
        "Town": "Vernon, BC",
        "Type": "out-and-back"
    },
    "title": "Pond Loop, 36DD, Twista",
    "trail_id": "10051"
}