{
    "description": "The following hike will take you into the hardwood hills of the southern side of the Cobequid Hills near Economy to see three distinct waterfalls.\r\rFirst off, I started my hike on the wrong trailhead and added about 4km to my journey by walking instead of driving on a new and improved logging road.  I will skip the narration of the logging road since it was boring but fore the many deer tracks I saw in the mud and will begin the description as I headed off into the woods in the pursuit of the waterfalls.\r\rFrom the starting point at , I followed the stream in a boggy area with small clusters of evergreen trees to travel through interspersed with some hardwood stands.  On my right, I could hear and sometimes see the evidence of active logging.  Finally, the terrain started to get some elevation and the stream produce it?s first waterfall of about 20ft.  Continuing on from this point, in through a small gorge like setting, you remerge into the forest that is nearly overcrowding the stream.  After a few hundred metres of effort, you are rewarded by a muli-tier waterfall with a total drop equal to about 100ft (but not ever in a single drop).  At the top of the waterfall, you have a magnificent view of the hills below and off in the distance the Bay of Fundy as well as the opposite shore in Hants County.\r\rFollowing the edge of the hill, I made my way west and met up with a trail running north-south.  I took it in a southern direction and down a hill until it met up with another road running to the west.  This old road is slowly being smothered by alders but is easy to follow.  Looking down I saw a large bear scat at some point which made me aware of my surroundings more than ever.  I crossed a first brook and then a second.  I decided to follow the second, larger, brook upstream and in about a minutes time, I  was pleasantly surprised to see a fall of about 50ft dropping in a single drop.  The base of the fall is surrounded by some evergreen but the majority of the forest is the beech/birch combination  you expect in the top of the Cobequid Hills.  Hiked back to the road which eventually linked up with the main logging road I had started on.\r\r\r",
    "directions": "Highway 2, turn on the Economy River Rd and follow until the logging road that leads to the top of McLellan Mtn.  I parked at  45° 25.557'N, 63° 54.215'W but I think the strat of the new and improved logging road is at  45° 25.752'N, 63° 54.089'W.  the first stream I followed is at; 45° 26.361'N, 63° 54.498'W and the second stream with the 50ft waterfall is approximately at; 45° 26.823'N, 63° 54.659'W\r",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/10065/reg_2011-05-13-045-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10065/reg_2011-05-13-059-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10065/narrow_2011-05-13-037-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mclellan-mountain-falls-near-parrsboro-ns-10065",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "8 km",
        "Town": "Parrsboro, NS",
        "Type": "out-and-back"
    },
    "title": "McLellan Mountain Falls",
    "trail_id": "10065"
}