{
    "description": "This is a description of a hike that will lead you to two different streams in the Economy River Wilderness Area.  This hike is geared towards people who have already hiked \rthe Kenomee Canyon trails and are looking to add more exploration in this wilderness area.  Ultimately, you will see five waterfalls during the course of the hike.\r\r\rAs you leave you car at the Y intersection, you begin to follow an old established road that only sees some ATV use anymore.  The forest canopy fully encloses the trail and you feel like you are in a tunnel.  The forest is composed of a mixture of beech and birch and is a fairly mature stand (for NS anyways).  You can see some old and big stumps covered by moss in the woods which makes you wonder how big the trees were in this area in the first place.  The road was built really well and is still very good to travel on.  You could definitely bring your mtn bike if you wanted to explore even more of this area.\r\rI followed the road for a while and then headed east into the woods to meet up with a stream that drains the Simpson Lake (which you drove by earlier).  Following this brook downstream, I saw a relatively long cascade flowing into a narrow gorge and then a short while later a waterfall of about 10 ft.  Immediately downstream of this fall is an interesting geological feature on the western side of the stream.  Up about 20ft in a solid rock cliff is what I thought at first a cave entrance.  It?s round and big enough for you to enter.  Unfortunately as you make your way up the scree slope towards this opening, you realize that it?s only about 4-5ft deep.  Not sure what created this but it was interesting to see.  On some old map from 1905, someone posted a feature called the pothole in this section of the stream.  This could be it?  One of the reason, I travelled down this section of the stream was to look at this ?Pothole? and figure out what it was.  I am unsure if this was it and if someone reads this and knows about the origin of the pothole feature?.please let me know.\r\rFrom then on, I made a bee line for the upper reaches of the Western Branch of the Economy River.  I travelled though the same birch/beech forest and though some very water logged section.  There was so much standing water around the trees,  that it almost looked like some bayou country.  Once I reached the river, I followed it downstream, and saw two more waterfalls of about 6-8ft.  Once I finished taking a few pictures, I returned to my car by following back the old logging road.  I then jumped into my car and made my way east until I crossed a bridge over the chain Lake Stream.  Immediately after the bridge, there is a road leading south.  Park you car here and follow this road, re-entering the wilderness area.  After about 800m, you will end up in a clearing which looks like an old quarry.  Bushwack your way to the edge of the stream and follow it downstream to see 3 waterfalls located about 500m and 1000m distant.  The first fall is a twin fall type of settings, where a large rocky outcrop separates the stream into two waterfalls of about 6ft each.  The two last waterfalls are located one on top of each other.  The last waterfall is also called ?Fine? waterfall on the 1905ish map.  It?s broad and it seems you could have a lot of fun sitting in the kind of large pool located between the two sets of falls.  If you have time on your hands and have never hiked the Kenomee Canyon trail, you can follow the chain Lake Stream for about another 1-1.5km to see another fall of about 30ft which is located on a spurt of this trail.  There is a designated camping location not far from this fall on the Kenomee Canyon trail.\r\r",
    "directions": "In Bass River, head north on Maple Ave. Turn right on old Economy Rd and drive for a while onto a suprinsgly good road until the turn off towards Simpson Lake (45° 31.538'N, 63° 56.060'W).  Continue on the road on the west side of Simpson Lake until a Y intersection (45° 30.641'N, 63° 56.986'W) Park and follow the east-heading road.  The Chain lake stream portion of the hike begins at (45° 30.617'N, 63° 54.968'W).\r",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/10064/reg_2011-05-13-013-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10064/reg_2011-05-13-001-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10064/reg_2011-05-13-017-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10064/reg_2011-05-13-019-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10064/reg_2011-05-13-035-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10064/narrow_2011-05-13-003-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10064/narrow_2011-05-13-007-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10064/narrow_2011-05-13-025-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/economy-river-wilderness-area-near-parrsboro-ns-10064",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 3,
        "Time": "3 hrs",
        "Total Distance": "9 km",
        "Town": "Parrsboro, NS",
        "Type": "out-and-back"
    },
    "title": "Economy River Wilderness area",
    "trail_id": "10064"
}