{
    "description": "This is an undeveloped trail that overlooks Castlegar, BC and the Kootenay and Columbia Rivers. The trail is 1.7 km and 210 m of vertical elevation gain the first lookout mapped. The trail is 2.5 km and 400 m of vertical elevation gain to the third lookout mapped.\nThe trail starts out following a gravel road which turns into quad trails then eventually literally goat trails. The trail is moderate most of the way to the first lookout with moderate grades but it is easy to take a wrong turn and a GPS is recommended as there are a number of ATV and animal trails that can be followed but you could just generally follow the creek and keep heading up hill.\nAbove the first lookout the trail steepens and there are a number of goat trails that can be followed. Also look outs 2 and 3 have been mapped but there are many other lookout points to the west or further up slope.",
    "directions": "From the bridge over the Kootenay River on Highway 3A near Castlegar, turn west on Robson/Broadwater Road towards towards Brilliant and Robson and drive 1.7 km and turn right on Terrace Road. This is also the turn off to Verrigan's Tomb that is signed. Travel 1.6 km on Tarrace Road passing the entrance to Verrigan's Tomb. Turn left on a gravel road which immediately ends at a gate. This is the trail head.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/10075/reg_IMG-0632-34592.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10075/reg_IMG-0635-34592.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10075/reg_IMG-0645-34592.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10075/reg_IMG-0651-34592.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10075/reg_IMG-0652-34592.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10075/reg_IMG-0658-34592.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/brilliant-terrace-near-castlegar-bc-10075",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 3,
        "Time": "3 hrs",
        "Total Distance": "5 km",
        "Town": "Castlegar, BC",
        "Type": "out-and-back"
    },
    "title": "Brilliant Terrace",
    "trail_id": "10075"
}