{
    "description": "One day, I was travelling through the Wentworth valley and stopped to see the magnificent waterfall on Higgins Brook (which is well worth the stop). Then as I  continued on the highway, I could see how Higgins Brook has carved a large valley into the Wentworth hills above.  This is a description of a hike into this beautiful hardwood valley located above the fall.\r\rThere is a post already on trailpeak about the waterfall (Wentworth Fall ice climb) so I wont put more details on the part leading to the fall. As you are looking at the waterfall, take the well established path on the left and go up the relatively steep hill to the top of the waterfall.  You will be travelling through a somewhat mature evergreen forest with a few large specimens.  At the top of the fall, you will see a tunnel which was bored into the rock in order for Higgins Brook to past underneath the rail line located upstream of the fall.  Continue following the path to the railroad and then carefully cross them.  \r\rThe rest of the hike is basically following Higgins Brook to its humble beginnings on the top of the Wentworth Hills.  From the railroad, you can either follow the same contour line you are on before dropping back to the brook?s edge or you can immediately go down the scree slope to the water?s edge.  The forest in the rest of the hike is very easy to travel through in most parts as it?s fairly mature.  There are some small stands of deciduous trees from time to time to push through but overall, it?s an easy walk.  From time to time, I swear I could see some section of old road in the woods.\r\rThe hike will gradually climb to the top of the hills above you.  From the highway to the top of the hills, it?s approximately a 220m elevation gain?not bad for Nova Scotia.  The slopes facing northward are usually covered by evergreen while all the other slopes are covered by a mixture of maple, beech and birch.  There are a few spots where the divide between deciduous and evergreen is quite evident and beautiful.  There is a 25ft waterfall to see on a tributary of the brook located on the south side at approximately (45° 34.605'N, 63° 34.691'W).  This tributary is quite small and might be ephemeral in nature.  Towards the top of the valley, you might notice logging activity and looking at a map on google earth, you can see the headwaters of this brook are surrounded by roads.  Total trip length is about 7.25km.\r\rBack at my car, I decided to explore the next valley to the south of Higgins Brook.  This valley was carved by Harty Brook.  Although this is a smaller brook and valley, it is also quite beautiful.  From the highway, you will go through an area with some apple trees before entering the evergreen forest.  There are some really nice, although small, waterfalls between the highway and the railroad tracks.  It?s not a single drop waterfall but a series of two major and a few minor falls.  This brook is quite small so I would try to look at it after some significant rain event.  Getting passed the waterfalls, you will then cross the railroad track and slowly go to the top of the Wentworth hill by following the valley floor carved by the brook.  Yet again, the forests in this valley are quite mature and a mixture between evergreen and deciduous stands.  I only made my way about 1km up the valley before having to return.\r\r",
    "directions": "In the Wentworth valley (Highway 4), follow the road at  45° 35.304'N, 63° 33.640'W  to get to the fall  on Higgins Brook.  Harty Brook can be reached by parking and following the old road at 45° 34.688'N, 63° 33.490'W\r",
    "photos": [],
    "source_url": "https://trailpeak.com/trails/valleys-of-wentworth-hills-near-truro-ns-10072",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "10 km",
        "Town": "Truro, NS",
        "Type": "out-and-back"
    },
    "title": "Valleys of Wentworth Hills",
    "trail_id": "10072"
}