{
    "description": "This is an 8 k moderate hike starting at Brandywine Falls Provincial Park, approx 10 kms SOUTH of Whistler BC, 120 kms NORTH of Vancouver. It is a loop, with 2 principal features, spectacular Brandywine Falls 300 metres east of the trail head (see photo) and the suspension bridge at the north end of the hike (see photo).\r\rFrom the TH, go east and north (right) after crossing the covered bridge over Brandywine Creek, go the 300 m, take a look at the falls, and then continue north on the CalCheak trail. Signs say the trail is unmarked, however, it is marked. The reason to do the trail counterclockwise is that the first part (south to north) is rougher and a bit slower, leaving the way back (north to south) much easier as the trail is much smoother and nicer. In fact, the route back (counterclockwise) could be cycled in summer, but not the route north.\r\rThe north end has a campground and a suspension bridge over Callaghan Creek to the campground, just north of the confluence of the creek and Cheakamus River.\r\rThe east side (northward on the counterclockwise route) is a rougher trail, somewhat rocky, a bit muddy from time to time. Wear proper hiking boots.\r\rBEWARE: this is BEAR country, make noise, be bear aware and prepared.",
    "directions": "Approx 120 kms north from Vancouver, on Highway 99 , park at Brandywine Falls Provincial Park.",
    "geohash": "c2bk",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/10079/reg_CalCheak556-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10079/reg_CalCheak560-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10079/reg_CalCheak562-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10079/reg_CalCheak565-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10079/reg_CalCheak568-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10079/narrow_CalCheak552-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10079/narrow_CalCheak554-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10079/narrow_CalCheak557-7359.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/whistler-calcheak-near-whistler-bc-10079",
    "stats": {
        "Activities": "mtn-bike ski-xc hike snowshoe",
        "From": "",
        "Seasons": "summer winter",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "8 km",
        "Town": "Whistler, BC",
        "Type": "out-and-back"
    },
    "title": "Whistler CalCheak",
    "trail_id": "10079"
}