{
    "description": "Everyone's been talking about it, but I had never visited the Winter River Trail system. It was finalized in 2010 through the efforts of \"PEI Trails\", and with the Victoria day weekend, I took a morning to visit and GPS the system.They are set up as  a set of integrated loops with the exception of the yellow trail. Nearly 8K in total. An unofficial stream hugging trunk joins it to the rest without going back to the parking lot, but it's not flagged, and uses private land.For the most part, the trail is relatively flat, and runs through mixed forest. Further along things get more hilly, but the main visual feature is the Winter River, and the Hughes' Cabin. Given that it was May, and we recently experienced a lot of rain, the river was a smooth but fast flowing 20 foot wide waterway.There are still two connector paths that I have yet to hike or track on the GPS, and besides those indicated on the map, I came across several other trail junctions. They're waypointed in the GPS track.I would suggest that 70% of the trail could be mountain biked with the right skillset. The paths are narrow, so not really intended for cycling. Certainly the yellow route is easily ridable with the family as it's mainly a cart path. Everything else is single track that goes through both wet and dry regions. None of the bridges (and there are several) are bike friendly, but hey, if they build a bridge, I say Thank-you regardless.I also have marked a few spots where one could pitch a tent or bivy. Cell phone coverage is les than spotty, but I did get a couple of bars at one spot. Worthy to note if ever there was an emergency.In all, it is a great relatively new trail, and rooty like always. Besides the winter River itself, one other great highlight is the Hughes' log cabin. It's likely a historical spot for the area. That was my initially draw to the area. I hope it's yours  as well.Shannon BurtEast coast editor",
    "directions": "Off Route 2 heading from Ch'town to St. Peters, drive until you see the Suffok Road on the left. (rt 222) Take it, and drive until you see Suffolk Road East on your right. Drive the paved road ends, and dirt begins. A small parking lot will be visible on the left with signage.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/PE/10080/reg_winter-River-001-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/10080/reg_winter-River-003-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/10080/reg_winter-River-015-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/10080/reg_winter-River-026-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/10080/narrow_winter-River-002-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/10080/narrow_winter-River-008-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/10080/narrow_winter-River-013-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/10080/narrow_winter-River-020-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/10080/narrow_winter-River-057-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/10080/narrow_winter-River-062-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/10080/narrow_winter-River-064-6702.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/winter-river-trails-near-charlottetown-pe-10080",
    "stats": {
        "Activities": "mtn-bike hike snowshoe",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "8 km",
        "Town": "Charlottetown, PE",
        "Type": "out-and-back"
    },
    "title": "Winter River Trails",
    "trail_id": "10080"
}