{
    "description": "Dinosaur Ridge (also more correctly known as Dakota Ridge) was sliced in half with the construction of the I70 freeway. This trail extends along the top of the northern portion of that ridge.\nAfter a short trek up to the top of the ridge from the trailhead, the trail reaches the base of a high-voltage transmission tower and continues northwards along the ridgeline. \nMeandering between short and gnarled pines, this section of the trail unfortunately runs parallel to the I70 freeway, is within eyesight of a law enforcement shooting range, a popular dirtbike track and a mining facility. \nNeedless to say, it is NOISY, and almost completely destroys the atmosphere. Fortunately however, the geology of the area is quite interesting - rocky outcroppings and immense boulders scatter the ridgeline, and a few excavation sites from old clay mines and dinosaur removal sites expose some of the truly unique features that give this ridge its name: an immense wall of fossilized ocean bottom ripples can be quite distinctly seen in a massive cut leftover from an old mining site. the wildflower population is quite colourful as well: wild penstemon, wild rosebushes and a number of other varieties of wildflower scatter the hillside.\nThe Ridge unfortunately is higher at the southern end than the northern end, so the return trip is something of an uphill battle. The grade however is quite light. An easy hike.\nOne warning of note: Because this ridge was extensively mined, there are pitfalls which at times border the trail's edge. If your children or pets are prone to darting off suddenly, it may be a good idea to keep them on a short leash. In addition, in the large excavation site where the large wall of ripple formations can be found, there is an old mine shaft which has been covered over by a massive metal grille. I highly recommend \navoiding that area for no reason other than due prudence. \nThere is also an interpretive boardwalk at this site with designated 1-\nhour parking, however, at the time of this writing there has been some \nsevere vandalism of the first four interpretive signs. Several have been \nspray painted with graffiti a few layers thick, and a couple have been \npunctured. I still recommend checking out the path; its only a few \nhundred meters and you really get to see some interesting formations. \nThe asphalt path has also been poorly maintained and has been layered \nover in places by mud eroded from the hillside.",
    "directions": "Heading west on I70, take exit 259 and proceed right at the first intersection. A large parking lot for commuters has been established there, and the trailhead for the hike departs from the parking lot as well. Look for a small yellow hatched triangle near the trailhead.\nThe interpretive boardwalk is on the same side as the freeway, whereas the trail is on the side facing away from the freeway.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/CO/10084/reg_grad-dinoridge-020-20033.jpg",
        "https://trailpeak.com/storage//content/trails/US/CO/10084/reg_grad-dinoridge-021-20033.jpg",
        "https://trailpeak.com/storage//content/trails/US/CO/10084/reg_grad-dinoridge-022-20033.jpg",
        "https://trailpeak.com/storage//content/trails/US/CO/10084/reg_grad-dinoridge-024-20033.jpg",
        "https://trailpeak.com/storage//content/trails/US/CO/10084/reg_grad-dinoridge-026-20033.jpg",
        "https://trailpeak.com/storage//content/trails/US/CO/10084/reg_grad-dinoridge-027-20033.jpg",
        "https://trailpeak.com/storage//content/trails/US/CO/10084/reg_grad-dinoridge-030-20033.jpg",
        "https://trailpeak.com/storage//content/trails/US/CO/10084/reg_grad-dinoridge-031-20033.jpg",
        "https://trailpeak.com/storage//content/trails/US/CO/10084/reg_grad-dinoridge-032-20033.jpg",
        "https://trailpeak.com/storage//content/trails/US/CO/10084/narrow_grad-dinoridge-028-20033.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/north-dinosaur-ridge-near-morrison-co-10084",
    "stats": {
        "Activities": "hike mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "12 km",
        "Town": "Morrison, CO",
        "Type": "out-and-back"
    },
    "title": "North Dinosaur Ridge",
    "trail_id": "10084"
}