{
    "description": "This trail traverses the southern portion of the Dakota Hogback (known as Dinosaur ridge) and is notable for the fossilized dinosaur remains discovered here. This is an excellent hiking trail and a popular mountain biking destination. the difficulty rating selected is for the Hiking. This is one of the most technically challenging mountainbike trails in the area, and riders comment that one rarely departs without losing a little skin.\r\rThe initial ascent is fairly steep, but upon reaching the summit of the ridge, levels out with only a modicum of elevation variation. The trail runs initially through a small forest of pine and giant junipers (enough berries to make gin for an army) and has a drastically distinct feel compared to its kin on the north of the I70 freeway that bisects it. The soil is sandier and there are relatively fewer wildflowers, however, this trail is far superior in its distance from the noise of the freeway. \r\rThe trail has been prepared for mountainbiking, with wooden rail 'steps' in steep areas and accompanying stone risers for the hikers. The views are good all along the ridge, and the trail actually connects with the red rocks park trail at the far end, however, the dinosaur ridge interpretive project crosses the trail near the end, and it is possible to examine some truly fascinating dinosaur footprints and the like there. Its tempting to take a detour there before continuing on to the end (which is an anticlimactic pause at the roadside before converting to the RedRocks trail). For those that wish to continue further into Red Rocks, this is a great option since there is a cafe at the visitor centre where you can recharge before turning back.\r\rThere is also an interpretive boardwalk along the I70 cut, however this strech of boardwalk has suffered greatly. None of the signs remain - all removed due to vandalism, and you can hardly tell that the route was paved due to the layers of eroded mud which have coated the path.",
    "directions": "Heading west on I70, take exit 259 and proceed left under the freeway. There is parking adjacent to the trailhead that is shared by commuters.\r\rMore parking can be had across the street in the main park parkinglot.",
    "geohash": "9xj1",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/CO/10085/reg_grad-dinoridge-034-20033.jpg",
        "https://trailpeak.com/storage//content/trails/US/CO/10085/reg_grad-dinoridge-035-20033.jpg",
        "https://trailpeak.com/storage//content/trails/US/CO/10085/reg_grad-dinoridge-036-20033.jpg",
        "https://trailpeak.com/storage//content/trails/US/CO/10085/reg_grad-dinoridge-038-20033.jpg",
        "https://trailpeak.com/storage//content/trails/US/CO/10085/reg_grad-dinoridge-041-20033.jpg",
        "https://trailpeak.com/storage//content/trails/US/CO/10085/reg_grad-dinoridge-042-20033.jpg",
        "https://trailpeak.com/storage//content/trails/US/CO/10085/reg_grad-dinoridge-043-20033.jpg",
        "https://trailpeak.com/storage//content/trails/US/CO/10085/reg_grad-dinoridge-044-20033.jpg",
        "https://trailpeak.com/storage//content/trails/US/CO/10085/narrow_grad-dinoridge-039-20033.jpg",
        "https://trailpeak.com/storage//content/trails/US/CO/10085/narrow_grad-dinoridge-040-20033.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/south-dinosaur-ridge-near-morrison-co-10085",
    "stats": {
        "Activities": "mtn-bike hike",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "10 km",
        "Town": "Morrison, CO",
        "Type": "out-and-back"
    },
    "title": "South Dinosaur Ridge",
    "trail_id": "10085"
}