{
    "description": "Kinuseo Falls is a 60 metre waterfall park situated on the Murray River in the Hart Ranges of the Rocky Mountains. The park is located 65 kilometres south of the community of Tumbler Ridge, British Columbia, Canada. The falls is one of the bigger attractions in the area attacting people of all ages and physical abilities to the park. \r\rThe waterfall park is located in one of BC's remote provincial parks - Monkman Provincial Park. A very well maintained and signed park located at the end of a beautiful, scenic drive along gravel roads. At the north entrance of Monkman Park is the Kinuseo Falls park entrance. \r\rFrom the RV friendly gravel parking lot is a series of trails to various points in the park. The Lower Viewpoint Trail is a short 200 metre walk to a large wooden viewing platform looking down onto the falls, up Murray River and out over the whole valley. It is an amazing view with amazing sounds. \r\rThe lower viewing platform is fenced and benched. There are interpretive signs all around the viewing area explaining the details of the surrounding environment. The trail leading to the platform is covered with bark mulch, pine neddles and is very wheelchair accessable. In the parking lot is more information signs about the park, plus some outhouses and picnic tables. \r\rThe Upper Viewpoint Trial starts from the opposite side of the parking lot. It is a narrow trail with tree roots and uneven ground. The route is only 250 metres long but it goes straight up along a pine needle cushioned, hard packed earthy trail. From the upper viewpoint you view the falls straight on. The viewpoint is on a cliff with a parameter fence to protect people from the canyon below. \r\rThe upper viewpoint trailhead entrance is also the beginning of the Murray River Trail. The trail is 1.5 kilometres from the trailhead to the banks of the Murray River at the bottom of the falls. the trail continues from the upper viewpoint and goes down the mounatin. Again the views of the falls can be seen. \r\rFrom the Kinuseo Falls parking lot is another trail that follows the Murray River south to the day use parking lot in Monkman Provincial Park. The 3.5 kilometre hiking trail connects the falls with the park and with Monkman Trail. A 72 kilometre wilderness backpacking adventure visiting over 11 remote waterfalls. \r",
    "directions": "How to Get to Kinuseo Falls: The park is located 65 kilometres south of the community of Tumbler Ridge, British Columbia, Canada. From the Heritage Hwy (Hwy 29) turn off it is 51 kilometres traveling on mostly gravel roads to the falls. There are signs along the highway and gravel roads clearly pointing the way to Kinuseo Falls and to Monkman Park. The route is very well signed and you should have little problems finding the park. Although the gravel road can be rough at times.",
    "geohash": "c39zd",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/10087/narrow_247274-203808726329220-100001002810128-572583-723964-n-11997.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10087/narrow_248296-203895076320585-100001002810128-573693-6021844-n-11997.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/kinuseo-falls-near-tumbler-ridge-bc-10087",
    "stats": {
        "Activities": "hike river-raft river-canoe river-kayak",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 5,
        "Time": "1 hrs",
        "Total Distance": "3 km",
        "Town": "Tumbler Ridge, BC",
        "Type": "out-and-back"
    },
    "title": "Kinuseo Falls",
    "trail_id": "10087"
}