{
    "description": "Nice, freshly paved, off (just beside) the highway, scenic, 13km Trail (one way) from Banff Park Gates to Banff.  There are sections of it that continue west (coming soon, search \"Legacy\" in trailpeak.com).  Also connects to Canmore/Harvie Heights paved trail on N side of Hiway 1 from the Banff park gates going further East.  (Note you have to *CAREFULLY* cross hiway 1 at the Banff East gates).\nThis paved multi-use trail, completed in 2010 to commemorate the 125th anniversary of the establishment of Banff National Park, allows users to travel between Canmore and Banff without having to use the Trans-Canada Highway. \nA segment of the Trans Canada Trail, the Legacy Trail runs along the highway right-of-way and is especially popular with cyclists and in-line skaters. \nWhere the Legacy Trail enters Banff at the north end of Banff Ave, you can follow pavement bike markings and signage in two different directions through town: one route connects to Vermilion Lakes Drive, from which a paved trail extension leads to the Bow Valley Parkway; another route extends the Trans Canada Trail through town to the Spray Trailhead. \n.",
    "directions": "The East end is at the East Park Gates on the South side of Hiway1, I didn't personally get to the West end(s).\nYou can also get onto it all through Banff and there is a Tee to the trail to Cascade Ponds / Lake Minnewanka",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/10089/reg_IMG-0062-7279.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/10089/reg_IMG-0063-7279.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/10089/reg_IMG-2328-7279.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/10089/reg_IMG-2329-7279.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/10089/reg_IMG-2330-7279.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/10089/reg_IMG-2333-7279.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/10089/reg_IMG-2335-7279.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/legacy-trail-east-of-banff-near-banff-ab-10089",
    "stats": {
        "Activities": "snowshoe hike ski-xc mtn-bike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "13 km",
        "Town": "Banff, AB",
        "Type": "out-and-back"
    },
    "title": "Legacy Trail - East of Banff",
    "trail_id": "10089"
}