{
    "description": "Thrill Me Kill me is a classic Whistler technical cross country mountain bike trail that will have your tongue hanging out for more. This twisty single track starts right off working you harshly and never lets up.\nBe prepared for a full hour long workout, so bring your sports drink and leave the body armour behind.\nNear the end you can test your nerves on the steep rock faces.\nThis trail is what cross country riding is all about.  The trail itself is around 7km, with a 4.5km road ride back to the start.\nA common longer loop for those with energy to spare is to do Thrill Me Kill Me, then North Secret (the northern section of comfortably numb).",
    "directions": "Drive or cycle north through Whistler on the highway towards Pemberton. Just past Green Lake on the left hand side is the Cougar Mountain Forest Service Road. Turn onto the road and park. Ride your bike about 150meters towards Pemberton and on the left you will see the marked start of the trail.  The trail will spit you out on the highway, so allow a half hour to ride back to your vehicle.",
    "geohash": "c2bt",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/1009/reg_IMG-2641-15290.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1009/reg_IMG-2647-15290.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1009/reg_IMG-2649-15290.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1009/reg_IMG-2660-15290.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1009/reg_IMG4301jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1009/reg_IMG4304jpg.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/thrill-me-kill-me-near-whistler-bc-1009",
    "stats": {
        "Activities": "mtn-bike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 5,
        "Time": "3 hrs",
        "Total Distance": "7 km",
        "Town": "Whistler, BC",
        "Type": "out-and-back"
    },
    "title": "Thrill Me Kill Me",
    "trail_id": "1009"
}