{
    "description": "This is a hike that will take you to a couple of different locations where iron ore mining use to occur in the last part of the 19th century in the iron ore belt near Londonderry.  In no particular order, you will see good examples of adits, open cuts and mine openings.  It?s hard to believe that Londonderry used to have a population of over 5000 persons.\r\r\rFrom the logging road at  N45.491022°, W-63.509854°, you will immediately notice a large area looks like a small quarry.  On the other side of the road, a large pile of loose material has been artificially placed along the road to hide the deep cuts that are located close by.  Or maybe they put up these large piles of material to prevent people from driving into (or worse, dumping) into the large cuts.  Walk to the top of the 8ft pile and you will immediately see a large man made pit that is flooded.  On the opposite end of this pit is the beginning of a somewhat long and narrow cut into the rock face.  Walking at the bottom of this cut and looking up is pretty impressive as the cliffs over your head are at least 100ft high.  I also saw a very large nest on the southern cliff which would be big enough for a predator type species of bird (i.e. eagle or osprey).  I didn?t linger there long in the case the bird would take me for some sort of intruder or threat.  Continuing in line with this open cut, you will descend into the small ravine created by slack brook.  Follow it downstream to an adit located at approx  N45.490565°, W-63.513460°.  The adit has been filled in but for a small opening on the top of about 20cm.  The forest all around these sites is mostly composed of conifers with some open areas that look like some sort of meadow.  The area around Slack brook is very dense with trees and some bushwack is required.\r\rAnother site close by is probably the most impressive one.  Starting in a recently logged field  N45.492885°, W-63.500596° make your way in a western direction and cross the small brook.  Hike to the top of the opposite side of the brook and walk another 100ft traversing a recent logged area and you will be in front an ancient mining cut. At the bottom of the cut is a very large opening that was once the start of a mine opening which lead to the mine tunnels (N45.492746°, W-63.497152°).  The size of opening is huge, probably a good 25 ft wide and high and it?s as large inside the opening for a good 75ft.  Once inside, the ground gently slopes down to finally end in water where the mine tunnel used to start.  Climbing the scree slope opposite of where you entered the cut will take you back to the forest floor.  If you follow the same heading as the cut, you will come up within about 100m of another large cut/adit.  Unfortunately, this one is filled with discarded junk?people are such pigs!  I didn?t hike down into this one to look at some possibilities of mine openings ?but there might be some there as well.\r\r",
    "directions": "Take highway 4 from Glenholme into the Folly Lake direction (north).  Turn right on Plains Rd and then left on Reid Rd (towards the Debert golf course).  Drive on this road until it crosses the E Folly Mtn Rd.  the two starting points are given in the trail description.\r",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/10097/reg_DSC-0002-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10097/reg_DSC-0006-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10097/reg_DSC-0008-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10097/reg_DSC-0010-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10097/narrow_DSC-0004-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10097/narrow_IMG-1428-43788.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/acadia-mines-near-truro-ns-10097",
    "stats": {
        "Activities": "snowshoe hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "3 km",
        "Town": "Truro, NS",
        "Type": "out-and-back"
    },
    "title": "Acadia Mines",
    "trail_id": "10097"
}