{
    "description": "This is a short but somewhat difficult hike to see three 20 ft plus waterfalls in a gorge carved by the Village River near Londonderry.  I had seen some white patches in the google earth maps and that piqued my interest to see if they would be waterfalls at those spots.  The difficulty resides in the path I choose to follow to the falls.  Another and easier way would be to follow the river upstream from the bridge in the town of Londonderry.Right after the elbow turn on the dirt road (7060Rd on google maps), start walking on the dirt road in a north manner and enter the woods. Crossing a small cleared area, the main trail turns to the right.  This trail is used by ATVs for a hundred metre or so until a sharp right hand turn.  At this point the ATV tracks turns to the right.  You will turn left and continue on what looks like an old road/path alongside the Village River valley.  From that sharp turn, walk another 150m and then, here come the hard part, carefully negotiate your way down to the river?s edge.  The first part of the descent is easy enough as the soil is stable and there are numerous trees to hold on to.  There is a little ledge and then you need to go down what I can only describe as some kind of scree slope that is interspersed with some large deciduous trees,,.  There are not enough trees to hold on the whole way but if you are careful, you will make it down?no problem.At the river?s edge make you way upstream for about 50m and you will be rewarded by three waterfalls that are close together.  In times of high water, you might have a hard time to reach the first waterfall as I had to scramble over rocks located in the river to make my way there.  After a big rain event, these rocks might be submerged.  Unfortunately, there are large cliffs alongside the three waterfalls that would prevent you from reaching them some other way?except maybe going more upstream first before descending the ravine?s slopes to the river?s edge.After gazing at the first waterfall for a while, tackle the rocks wall to your left (facing upstream) by climbing the natural ledges.  By going upward on these natural ledges, you will be able to go over the side of the first fall and see the two others.  There is a rope at somepoint to aid you in a 6ft drop by the side of the first waterfall.  I would caution anybody about using a rope left out in the element.  I didn?t use it and was fine by using the small cracks and dents in the rock to carefully make my way down that small portion of the rock cliff.  Be careful as this rock is somewhat smooth and therefore can be slippery during wet spells. PS, I now see some more of these white spots located further upstream (passed the powerlines), I would appreciate a shout from anybody that explores them.",
    "directions": "Drive to Londonderry and take the Westchester Rd.  Turn right on 7060Rd (located just before you get to the Manager?s Park on the left).  Park at the left turning elbow in the road and walk due North.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/10098/39.Rockland.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10098/reg_DSC-0014-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10098/narrow_DSC-0018-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10098/narrow_DSC06767-43788.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/rockland-brook-gorge-near-truro-ns-10098",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "2 km",
        "Town": "Truro, NS",
        "Type": "out-and-back"
    },
    "title": "Rockland Brook Gorge",
    "trail_id": "10098"
}