{
    "description": "There are some very nice single track mountain bike trails near the Bedford Rifle Range in Bedford, Nova Scotia.  This is a description of some of these trails and most importantly how to access them.\r\rGo under the metal gates of the NS Power access Rd (sometimes called Riffle Range Lane) and continue on this road with the power lines as it goes up a long steady climb.  Before you start the major climb, you will come up to a large flat area and see a fairly high grassy hill with an ATV track in the middle of it.  All of the trails (except a small one) described in this post are on the left hand side of the major gravel road with the power lines.  There is a significant ATV trail that starts on the right hand side of the large field.  This is the track which I will refer to further in my posting.  The ATV track is very handy to access the upper portion of the trails so you don?t have to go uphill in the single tracks dedicated to being taken downhill (plus it?s safer if people are others on the trail at the same time)  \r\rOnce at the top of the NSPower access Rd gravel hill, find a small trail on your left.  Since this was my first time on these trails, I continued on the gravel road a bit too far going down a hill and back another until I could see the NSP power station.  There might be some trails after this but I didn?t explore that way.  Instead, I retraced my steps and got on the small trail, I saw  at the top of the hill.  Immediately I saw some flagging tape and I knew I was on something good. \r\rThis first trail is kind of a connector trail.  While you stay on the main trail going in a South heading, you will see some trails on your right and some on your left.  The ones on your right are meant to be downhill trails so don?t start going up them (there will be other ways to access them described later).  The trails on your left are good to go on as they are all going in a downhill pattern.  If you stay on the main trail or take the left hand side trails (downhill trails), you will eventually reach a large ATV track. Head uphill on this ATV track and you will be able to access (by turning on your right) the upper part of the single tracks that you saw coming on your right hand side on the first trail you took.  \r\rAlternatively, if you follow the ATV track, you should see a trail on your left at a 90 degree turn (just passed a clearing that affords you a view of highway 102).  Take this trail (there is a small sign indicating that it?s the boars back trail I think) and head for a sweet, smooth downhill.  If you do not take this small trail, continue heading uphill on the ATV track (as you might have done already) but this time find a flagged trail on your left.  Taking this trail on your left, you will immediately be offered two choices.  These two trails will take you downhill and meet up at pretty much the same spot where the Boar?s Back trail ends.  Both of these trails are fairly smooth with a few roots to go over but nothing very technical.  Once there, there is a small track that will take you to a nicely built see-saw, over a bridge and out to an access road in about a minute.\r\rAs you are getting out of this area to your car, there is a one last small trail between the NSPower access Rd and the DND fence line (it?s on your left if you are facing the 102).  This is a nice and smooth downhill trail that takes you down to the side of highway 102.\r\r\r",
    "directions": "Take River Lane off the Beford highway and follow it to its conclusion at a series of condos.  Park here and take your bike on a small trail that follows the Sackville River and goes under highway 102.  Once under, head to the left by the side of the highway until you come to the NS Power access Rd (or called Riffle Range Lane).  Alternatively, you could park by the side of Highway 102 at the NSPower Access Rd.\r",
    "geohash": "dxfw",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/10103/reg_bedford-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/bedford-single-tracks-near-halifax-ns-10103",
    "stats": {
        "Activities": "mtn-bike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 5,
        "Time": "2 hrs",
        "Total Distance": "8 km",
        "Town": "Halifax, NS",
        "Type": "out-and-back"
    },
    "title": "Bedford Single Tracks",
    "trail_id": "10103"
}