{
    "description": "The coyote song trail is the main trail through the South Valley Park in Jefferson County's Open Space system. It is a multiuse trail that permits cyclists as well as hikers, and offers some beautiful views of the unique sandstone formations characteristic of the park as well as great views of the valley and the Lockheed Martin facility that adjoins the park area.\r\rCoyote Song is a there-and-back trail for cyclists, however hikers only may take the Swallow trail (which splits off near the end and rejoins near the beginning) back down the valley.\r\rThis trail is popular with families, since the gentle incline is easy for all ages, and deer and other wildlife can often be seen grazing near the path.\r\rIn the late summer and fall the grasses in the fields turn a beautiful golden colour, making this trail beautiful throughout the year. Late afternoon Riders may find the sun in their eyes as they ascend the slope however.",
    "directions": "From the denver Metro area, travel south / clockwise on C470 and exit south on Wadsworth st. Take the First Right onto W Deer Creek Canyon Rd (many road cyclists gather and park at the intersection here to take advantage of the beautiful road riding opportunities here) and follow it uphill to the south parking area.",
    "geohash": "9xj1p",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/CO/10109/reg_south-valley-004-20033.jpg",
        "https://trailpeak.com/storage//content/trails/US/CO/10109/reg_south-valley-005-20033.jpg",
        "https://trailpeak.com/storage//content/trails/US/CO/10109/reg_south-valley-007-20033.jpg",
        "https://trailpeak.com/storage//content/trails/US/CO/10109/reg_south-valley-009-20033.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/south-valley-park-coyote-song-near-littleton-co-10109",
    "stats": {
        "Activities": "mtn-bike hike climb",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "5 km",
        "Town": "Littleton, CO",
        "Type": "out-and-back"
    },
    "title": "South Valley Park: Coyote Song",
    "trail_id": "10109"
}