{
    "description": "This is a classic for day hikers who don't mind a long day with excellent views all along the trail, and one that finishes with an easy summit scramble to the top of Mt. Bourgeau where a 360 degree vista includes the Bow River Valley, the town of Banff, Sunshine Village ski resort and even Mt. Assiniboine 30+km away!  And if weather conditions or time constraints dictate, there are two destination points along the way where you could turn back and still have had a great hike.The first section is an easy to follow trail sometimes used by horse mounted park rangers that leads 7.4 km to Bourgeau Lake with an elevation gain of 750 m (2460').  The north end of the lake is a boulder field that makes a great lunch spot to watch the various rodents popping in and out of the rocks.  Drag your binoculars out of your pack to check the slopes surrounding the lake for sheep.    Follow any of the several trails through the trees that take you to the west end of the lake and follow a narrow trail that switchbacks up a steep scree field and across avalanche paths along the north side of the inlet creek.  Circle around the glacial cirque to the south and east past several tarns and tiny Harvey Lake until you have reached Harvey Pass (2.3 km, 285 m).  Watch for ptarmigan along this route.  Here you can look south and East over Healey Creek to Sunshine Village.  If you look north you will see the wide ridge of Mt. Bourgeau which is the final 2.7 km section of this trail that takes you ?a pleasant walk ? to the broad summit 400 m higher? as accurately described in Alan Kane's ?Scrambles of the Canadian Rockies?.  From here you can wander around the summit plateau (2930 m) that you share with a weather station complex to view Bourgeau Lake 685 m below, look north up the Trans-Canada Highway past the Vermillion lakes to Banff or look south and east past Sunshine Meadows to see Mt. Assiniboine standing tall on the horizon. Total one way trail length is 12.4 km with a 1435 m elevation gain. NTS Map: 082O05Elevation Gain: 1435 m (2,460 ft).",
    "directions": "The trailhead parking lot is located on the south side of the Trans-Canada divided highway off the eastbound lanes 11.6 km west of Banff and 2.9 km west of the overpass to Sunshine Village.  If you are in the west bound lanes travelling from Banff there is a cross over lane to take you to the east bound lanes to access the trailhead.  There is lots of parking, a washroom and map kiosk at the trailhead.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/1011/reg_BourSmtj.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1011/reg_BourToBanffj.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1011/reg_HarvToAssij.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1011/reg_Mt-Bourgeau-Banff-Aug-9-2013-25--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1011/reg_Mt-Bourgeau-Banff-Aug-9-2013-9--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1011/topo_BourgLkj_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1011/narrow_Mt-Bourgeau-Banff-Aug-9-2013-20--44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mt-bourgeau-near-banff-ab-1011",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 3,
        "Time": "12 hrs",
        "Total Distance": "25 km",
        "Town": "Banff, AB",
        "Type": "out-and-back"
    },
    "title": "Mt. Bourgeau",
    "trail_id": "1011"
}