{
    "description": "These are not your fathers XC (ski) trails at COP, these are way too cool.  A \nlarge network of very twisty, tight, well built, and F U N cross country trails \nall packed into under 1 square mile (1.6 square kilometers).  And \nunusually, have a great Eastward view including downtown Cowgary.\nThere is nothing too difficult there, a couple steepish downhills, one \nfreaking covered in loose, golf-ball sized rocks that was a little hairy, some \ncreek crossings with 10cm wide skinny bridge across it, a few downed trees \nleft as featres.  All totally rideable by an intermediate rider, the only \ndifficulty is the pace you try and do it at.\nNamed Big Rock (in honour of a big rock there, not the beer), Slim Shady, \nBig Ring, and a host of other less rememberable names, there is a plethora \nof trails that are adjustable for different events.  The trackloag attached \nwas a very fun 6km loop we got around in 33 minutes without working too \nhard, stopping to figure out where to go and admire the views.\nThese trails are used for Xterra races, coaching and lessons.  You may have \nto pay to use them?  Didn't notice any fine print on the signs (but my eyes \nare getting bad).\nCan be combined with a trip along Side Show Bob / Bowmont Natural Area \n/ even Tuscany Ravine (aka 12 Mile Coulee), then ride across the valley \nand cross 16th Ave.",
    "directions": "16th Avenue aka Highway #1 aka The Trans Canada - go west to  you see \nthe ski jumps.  Doesn't get any easier then that.  Trails are to the East of \nthe ski jump towers (East of the main road you drive in on.).",
    "geohash": "c3nf9",
    "photos": [],
    "source_url": "https://trailpeak.com/trails/eastlands-xc-mtb-at-canada-olympic-park-cop-near-calgary-ab-10117",
    "stats": {
        "Activities": "mtn-bike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "6 km",
        "Town": "Calgary, AB",
        "Type": "out-and-back"
    },
    "title": "Eastlands XC MTB at Canada Olympic Park ( COP )",
    "trail_id": "10117"
}