{
    "description": "This loop traverses several trails in Rocky Mountain National Park, and attempts to cover as much of the varied terrain options available in the park as possible in one day. It begins at the Glacier Basin campground, crosses through the Park and Ride station for those that may not need or want to spend the night, and ascends to Bierdstadt lake before crossing over to to Cub lake and Fern Falls before turning towards the lowlands and the prime flyfishing grounds before returning back up to the Campgrounds.\r\rThis Loop is primarily designed for snow-free seasons, however, this area is prime snowshoeing terrain in the winter, and often hosts snowshoe competitions.\r\rA free shuttlebus runs from many of the trailheads to the park and ride beginning june 11th, so it is not absolutely necessary to hike the entirety of this trail... the lower half of the trail can be omitted as the trailhead south of Fern Falls is a prime pickup location.",
    "directions": "From the Denver Metro Area, take highway 36 north through boulder to Estes park, and directly to the entrance of Rocky Mountain National Park. There is a 20$ USD entrance cost, however, it will cover admissions for up to 7 days, so its best to make the most of it.\r\rOnce through the Entry station, take the first right towards Bear Lake and proceed until you reach the Glacier Basin Campgrounds (on the left) or the Park and Ride (on the right).\r\r",
    "geohash": "9xhv",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/CO/10110/reg_P6080046-20033.jpg",
        "https://trailpeak.com/storage//content/trails/US/CO/10110/reg_P6080050-20033.jpg",
        "https://trailpeak.com/storage//content/trails/US/CO/10110/reg_P6080054-20033.jpg",
        "https://trailpeak.com/storage//content/trails/US/CO/10110/reg_P6080066-20033.jpg",
        "https://trailpeak.com/storage//content/trails/US/CO/10110/reg_P6080079-20033.jpg",
        "https://trailpeak.com/storage//content/trails/US/CO/10110/reg_P6090081-20033.jpg",
        "https://trailpeak.com/storage//content/trails/US/CO/10110/reg_P6090091-20033.jpg",
        "https://trailpeak.com/storage//content/trails/US/CO/10110/reg_P6090102-20033.jpg",
        "https://trailpeak.com/storage//content/trails/US/CO/10110/reg_P6090107-20033.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/rocky-mountain-national-park-glacier-cub-loop-near-estes-park-co-10110",
    "stats": {
        "Activities": "mtn-bike hike snowshoe",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 5,
        "Time": "8 hrs",
        "Total Distance": "25 km",
        "Town": "Estes Park, CO",
        "Type": "out-and-back"
    },
    "title": "Rocky Mountain National Park: Glacier-Cub loop",
    "trail_id": "10110"
}