{
    "description": "April 2015 Update;We followed the directions below (following the logging road).  FYI;It did work but was not that scenic at all and the first 1.5hrs was on logging road.  If you take the path to the left of the first green gate and follow it to the first intersection (trail to the right).  Take this trail and follow it all the way up.  You will cross the creek with a beautiful little waterfall and head up towards the summit passing small lakes on the way.  You can come back the same way or complete the loop by coming down the logging road.___________________________________________________________________(Original comments) This hike was done in early June so there was still lots of snow on the ground.",
    "directions": "Walk (or cycle) up the road from the gate. Ignore the first left turn (goes to Woodland Walk, Coquitlam Lakeview and can be used to gain Burke Ridge further up - check the map), but at the next junction go left on the main road. Stay on this road as it winds its way up to a flat area. Here the road splits. Take the right more obvious route. (There used to be a gate here but only the posts remain.) The road rises, curves to the right and then flattens out for a bit.After a while it curves to the left and starts rising more steeply. The road is also in poorer shape. Stay on the main route ignoring branches on either side (Village Trail is one branch on the right). Eventually you will reach an open area where there is not much left of the old ski village area.At the top of the road take the flagged trail. This will take you to Ted Kay Lake in about 35 minutes (passing two other lakes on the way). From here one trail goes to the summit and the other goes back down to Harper Road via Hourglass and Lily Pad Lakes (Sterling Loop Trail) - the junction is well marked, pointing the direction to Hourglass Lake [via Sterling Loop Trail] or on to the summit. The summit trail winds its way along to the summit, about 50 minutes from Ted Kay Lake. A trail coming up from Dennett Lake will come in from the right (east) about five minutes after the Sterling Loop junction. Beyond the summit, the trail continues on to Widgeon Slough.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/10113/reg_IMG-0082-44987.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10113/reg_IMG-0083-44987.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10113/reg_IMG-0086-44987_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10113/reg_IMG-0091-44987.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10113/reg_IMG-0092-44987.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/burke-summit-via-burke-ridge-trail-near-coquitlam-bc-10113",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "winter summer",
        "Stars": 3,
        "Time": "7 hrs",
        "Total Distance": "22 km",
        "Town": "Coquitlam, BC",
        "Type": "out-and-back"
    },
    "title": "Burke Summit (via Burke Ridge trail)",
    "trail_id": "10113"
}