{
    "description": "If you are a small group of mountain hikers (with more than one vehicle) that like to cover long distances in a day and get high into the alpine in the company of glaciers without retracing your path, this the trail for you.  You will hike around Yoho National Park's Emerald Lake, climb over the Yoho Pass, follow the classic Iceline Trail past the Stanley Mitchell Hut as you descend the Little Yoho Valley to the Yoho Valley and complete your hike of 30 km at Takakkaw Falls, one of the highest waterfalls in Canada.  Or you can break this hike up with overnight camping at Yoho Lake, the Little Yoho campground or staying at the Alpine Club of Canada Stanley Mitchell hut.\r\n\r\nLeave one vehicle at the Takakkaw Falls parking lot and start your hike from the Emerald Lake parking lot.  Pack your hiking poles, your foot repair kit (just in case) and a water treatment kit to refresh your water supplies along the way.  This is a long but very satisfying day.  \r\n\r\nFollow the Emerald Lake nature trail along the west shore to cross the glacial alluvial Emerald Fan.  Turn on to the Yoho Pass Trail (1.5 km) and continue crossing the fan until you begin your steady ascent to the Yoho Pass  (7.3 km) and shortly after the Yoho Lake Campground. \r\n\r\nFollow the Upper Iceline Trail to the Iceline Trail.  By this point you will have come out of the trees above the Yoho Valley and be able to see Takakkaw Falls and its source, the Daly Glacier above it.  At this point you could bailout and head down the Lower Iceline past the Hostel to Takakkaw Falls.\r\n\r\nFrom here you will be on rock and cairn trails across the terraces and moraines below the Emerald Glacier for 10.9 km.  The trail is often marked with margins of rock and an oversupply of cairns.  You will also cross several glacial melt streams whose flows will vary depending on the warmth of the day.  The route includes crossing a series of moraines to the Celeste Lake Junction.  This is another option to cut down the total distance and follow this route down past Laughing Falls and out the Yoho Valley to Takakkaw Falls.\r\n\r\n If you continue you will eventually descend to the Little Yoho River and campground and the Stanley Mitchell Hut.  Follow the Little Yoho trail 5.3 km east to Laughing Falls, and then south 5 km to Takakkaw Falls.  \r\n\r\nFinish your day with a hot shower and then a well deserved supper at the Truffle Pig Cafe in Field at the bottom of the Kicking Horse Pass.\r\n\r\nIn winter please check the Avaluator\r\n(Online Trip Planner) rating is: \r\n Complex.  \r\nSee more trip planner route details here.\r",
    "directions": "In Yoho Park follow the Trans-Canada Highway to the Yoho Valley Road 3.7 km east of Field at the bottom of the Kicking Horse Pass.  Follow this road north 14 km and leave one vehicle at the Takakkaw Falls day use parking area (with spare shoes, clothes and a reward snack in the trunk).  Return to the Trans-Canada and travel 2.6 km west of Field to the Emerald Lake Road and follow this road north to the Emerald Lake parking lot.  The trailhead is at the north end of the parking lot just past the washroom.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/1012/reg_Iceline.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1012/topo_EmeraldGlacier.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1012/narrow_TakakkawFallsCampgrnd.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/emerald-lake-to-takakkaw-falls-via-iceline-near-field-bc-1012",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 4,
        "Time": "10 hrs",
        "Total Distance": "30 km",
        "Town": "Field, BC",
        "Type": "out-and-back"
    },
    "title": "Emerald Lake to Takakkaw Falls via Iceline",
    "trail_id": "1012"
}