{
    "description": "This is a very cool mountain bike trail near Spryfield in Halifax Regional Municipality.  I?m describing one loop that I went on but there are many other mountain bike trails in the same area.  The highlights of this trail are the solid granite ridge to ride on or drop from, the many constructed features and lastly the awesome views you get of Halifax Harbour.The start of the trail is an old road so it?s quite large and unremarkable.  However on the right hand side there are some nice single tracks to follow.  The single tracks are numerous and you will come up to numerous crossroads.  All in all the majority of them lead you to a wide area (located on the aforementioned old road) that has a big fire pit.  From this location, there are two major routes. One is to the right and the other one is to the left.  The one to the right has a very large boulder that people rode on and then a 2m drop to a spot where a wooden bride has been constructed.  Drop from the boulder, cross the bridge and then head up the hill.  At this point there are a few different ways to get up.  I choose the trail to the far right has it seem the easiest to climb?and it was.  As you progress up the hill you will see on your right a large development with new houses/logged area/bulldozers etc (Governors Brook subdivision). Once you hit the top of the hill the super sweet ride begins.  This is the area where you will ride on some very long and somewhat narrow granite ledges.  You can see these granitic outcrops in goggle earth.  At times, there will be small bridges for you to use to get across to some outer outcrops of granite.  There are significant areas where all the tall trees have been burned to death and all that?s left are these kind of dark toothpicks all over the place?.its eerily beautiful.  In this area you can see far ahead and in all directions so pause a moment to admire those views.  There is some flagging tape from time to time and he route described here is following the pink tape.After a while on top of these granitic outcrops, I descended some hills to the edge of Colpitt Lake.  The trail continues on the far side of the lake but I think from the lack of usage and because of some large boulders that come in the middle of the trail, this section sees a lot less mountain bike activity.  I would probably not go back on that section next time but if you do and persevere like me, it will eventually go around Colpitt Lake, over a bride on the stream that empties into Williams Lake and ultimately back to the area where the large firepit was located.",
    "directions": "From the rotary, turn on Herring Cove Rd and continue until you turn left on Williams Lake Rd.  Turn right on Colpitt road and then take another left at the Y intersection.  The trail begins at the end of the street where you will see some large boulders.Another entrance is on Mica Crescent off of Alabester Way.",
    "geohash": "dxfv",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/10126/reg_colpittt-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/gords-gold-near-halifax-ns-10126",
    "stats": {
        "Activities": "hike mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 5,
        "Time": "2 hrs",
        "Total Distance": "8 km",
        "Town": "Halifax, NS",
        "Type": "out-and-back"
    },
    "title": "Gord's Gold",
    "trail_id": "10126"
}