{
    "description": "This is a short hike located within HRM that you can easily do in less than an hour.  The main feature of this hike is a cave like structure in the middle of the woods called Deadman?s cave.The hike starts on a fairly wide old woods road.  Continue on this main road and don?t go off on the smaller trails you will see from time to time on either side.  These are mtn bike single tracks and I have described some of them in the post called Gord?s Gold.  After less than 15 minutes you will come up to an area where there is a large fire pit.  From this area try to follow the path that veers to the left.  There is also one or two that are going to the right.  Follow this path as it slowly descends through a mixed forest.  You will the come up to a bridge on a stream which empties Colpitt Lake into Williams Lake.  Take the nice wooden bridge across and veer to your left.  There is a path on the right and one going straight.  From this point on, follow the path as it meanders by the side of the stream.  At some point you should be able to see a large outcrop of boulder size rocks on the other side of the stream.  The pile of rocks sits amid a nice combination of birch and beech trees.  Cross the stream (in June it was bone dry for the most part) and head towards the rocks.  At the base of the rocks, there is a small opening but the real cool spot is located at the top of the rock pile.  Navigate your way to the top, you will notice a fire pit and then immediately next to it, a small opening.  Peer inside the small opening, and you will see a large opening just beyond.  It looks like the chamber is about 10ft long and 4-5 ft wide.  The drop from the opening to the floor would be about 6ft.  The opening is small but a skinny person should be able to squeeze though for a better look.  However be careful that you are able to get out again.",
    "directions": "Take Herring Cove Rd to Williams Lake Rd.  From Williams Lake Rd, turn right on Colpitt Rd and left at the Y intersection.  The trail begins where large boulders have been placed across the wood rd.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/10127/reg_dead-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/halifax-prisoner-cave-near-halifax-ns-10127",
    "stats": {
        "Activities": "snowshoe hike mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "3 km",
        "Town": "Halifax, NS",
        "Type": "out-and-back"
    },
    "title": "Halifax Prisoner cave",
    "trail_id": "10127"
}