{
    "description": "Behind Maskwa Aquatic Club are some hiking trails in the Provincial Crown Lands and Wilderness Area. These are all designated as hiking and snowshoeing only....No Mountain Biking is allowed on these trails. They are also used by athletes for training.From the parking lot, you immediately come to a y intersection.  Taking the trail on the right will take you on a mostly boring trail alongside of Kearney Lake.  This trail is wide and has lots of exposed roots. I think this part is probably popular with hikers and families, dog walkers and continuing on it will eventually lead you to the subdivision located on the eastern part of Kearney Lake (Collins Rd).  From the path alongside the lake, you will see numerous single tracks leading to the left.  Take any of them and the fun and uphill begins. The easiest way to go up the hills behind Kearney Lake is probably on the path I took closest to Collins Rd (the eastern most path).  This single track climbed up the hill with some sections quite steep.  Once at the top, you come out on a nice granite ridge and then going down through a nice mixed forest.  On the most part, the trail is well groomed with only a few larger rocks.The route can be confusing so go with someone who knows the route.If you continue in a western direction, you eventually come out by Charlies Lake and on to a long granite ridge.  The trail seem to end there so I retraced my steps and went down a path I had seen maybe 100m back from the deadend.  Now to come down the high ridge and down some makeshift steps. This area is under review for official trail planning so watch for a public event to give your feedback on next steps.",
    "directions": "From Kearney Lake Rd, turn left on Hamshaw Drive and then right on Saskatoon ave.  Drive to the end of this street and into the boat's club parking lot.  The trail begins in the back of the parking lot.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/10128/reg_kear-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/kearney-lake-trail-near-halifax-ns-10128",
    "stats": {
        "Activities": "snowshoe hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "5 km",
        "Town": "Halifax, NS",
        "Type": "out-and-back"
    },
    "title": "Kearney Lake Trail",
    "trail_id": "10128"
}