{
    "description": "I decided to dub this little hill \"Biffy Peak\" because of an outhouse-like structure that sits at the top of it. I didn't actually know what \"biffy\" meant until I read Gillean Daffern's description of this trail, in which she describes a \"biffy shaped hut.\"We parked along the highway, next to the Quaite Creek logging road gate. I didn't read about this trail until I got home, so I wasn't sure where to start. We entered the trees right from the get-go and expected some pretty thick bushwhacking, but it wasn't too bad. We did find a faint hiking trail about halfway up, followed it to the summit and on the way down. This is the best way to go, because making your own trail will almost certainly have you scrambling up some steep slabs. The trail is marked along the Quaite Creek logging road with several rocks.The trip was pretty relaxing. We were up to the summit fairly quickly and spent almost as much time relaxing at the top. There were a ton of mosquitos! Fortunately, at the summit, we were able to kill a whole bunch and the wind dispersed the rest.The \"biffy\" at the top provided some amusement. We were trying to figure out its function. There was some sort of equipment attached to one of its walls and the rest were used by people as a register. The smell of rodents was fairly strong, but I suppose that's better than the smell of an outhouse. Around the structure were several strong anchors nailed into the ground. We couldn't help but wonder what they were used for.We thought about continuing on to the Barrier Lake Lookout, but the mosquitos persuaded us to head back down.",
    "directions": "We parked along the highway 1, next to the Quaite Creek logging road gate.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/10133/long_IMG-1905-Edited--55273.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/10133/reg_IMG-1901-55273.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/10133/reg_IMG-1950-55273.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/biffy-peak-near-canmore-ab-10133",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "4 hrs",
        "Total Distance": "4 km",
        "Town": "Canmore, AB",
        "Type": "out-and-back"
    },
    "title": "Biffy Peak",
    "trail_id": "10133"
}