{
    "description": "This is a description of a short hike but to a rather cool little place not visited by many people?the Georgeville iron ore adits.\r\rFrom the Oceanside Drive dirt road, I climbed down the small slope, and climbed over some evergreen deadfalls.  Most of the forest in this part is a mixture of evergreen and birch/beech trees.  The walking is easy as there are very few shrubs but there are some sections with more deadfalls than others.  After a short time, I heard and saw the small brook.  I followed this brook for about 200m and then saw some flagging tape.  Usually flagging tape is a sign that something is worth checking out.  I could see a large rocky outcrop about 25ft high just by the side of the stream.  In the middle of the outcrop and facing the stream and sitting about 6ft from the stream level are two mine adits.  Adits are different than mining shaft since adits are usually gently sloped openings instead of shafts which tend to be more vertical in nature.  One of the adit seemed a bit low to get in but the other, you can easily can inside and crawl for about 12ft before it ends.  I have to marvel at the hard work someone(s) put in here to mine this iron ore out.  Also, the amazing thing about this location is there are no reminders of the bustling activity that occurred here.  There are no easily spotted roadway that will lead you here but you can be sure that at some point there was probably a major road going to that spot.\r\r",
    "directions": "Drive on highway 337 to Georgville and turn on Oceanside Drive,  Park you car in the S curve of the road at approximately  45.833084°, -62.016577°.  Head south from that point until you spot the stream.  The adits should be downstream of that point. \r",
    "geohash": "f85us",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/10136/reg_DSC-0088-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10136/reg_DSC-0093-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10136/reg_DSC-0095-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/georgville-adits-near-antigonish-ns-10136",
    "stats": {
        "Activities": "hike snowshoe",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "1 km",
        "Town": "Antigonish, NS",
        "Type": "out-and-back"
    },
    "title": "Georgville adits",
    "trail_id": "10136"
}