{
    "description": "The many stream running on the North Mountains toward the Bay of Fundy usually have some kind of waterfall located on them?the trick is to know where to look.  Here is a description of a hike that will take you to two waterfalls on Healy?s Brook.\nSetting off from the small bridge over this brook, I made my way upstream.  The terrain around the stream is not very steep but the vegetation is quite low and dense which makes for some hard bushwack from time to time.  There are long stretches of really dense evergreen on the east side of the brook so I usually spent my time on the other side of the brook.  After about 1km, I could hear the sound of a waterfall.  It?s not located on the main branch of Healy?s Brook but rather on a tributary that literally falls into Healy?s Brook forming a 15ft fall.  \nPushing my way to the top of the bank where the tributary falls from, I traversed some more evergreen/deciduous mixed forest but this time staying on the top of the ridge.  I could hear the brook down below and eventually heard a roaring sound close by.  I followed that sound and came out to a very nice, broad, multi-tier waterfall on Healy?s Brook.  You can see from old maps that a road used to cross the brook a this point some time ago. I couldn?t see the old road but I didn?t look for it very hard either.\nTo get back to my car, I re-climbed  the western side of the ridge and followed it passed the fall on the tributary and eventually came out into a gravel pit.  From then on, there is a road that is in good shape and will take you back to the bridge.  Also you could easily drive on this road so you could park closer to the falls now that you know where they are!",
    "directions": "Highway 1 in Middleton, head west and turn right on Mt. Hanley Rd.  Continue on Mt Hanley Rd, up the North Mountains and then turn left at the T intersection (you are now facing the Bay of Fundy). \nContinue through the village of Port George and turn right on the dirt road at  44.999530°, -65.138351°.  Park at the bridge and start walking upstream.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/10135/reg_DSC-0028-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10135/reg_DSC-0037-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10135/narrow_DSC-0040-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/nealy-brook-waterfalls-near-middleton-ns-10135",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "3 km",
        "Town": "Middleton, NS",
        "Type": "out-and-back"
    },
    "title": "Nealy Brook waterfalls",
    "trail_id": "10135"
}