{
    "description": "The hills located west of Hillsborough are packed with mountain bike trails.  Word of warning; some of those trails are currently used by ATV?s while others are super sweet single tracks.\r\r\rThere are many ways to access these trails. The trailheads are not clearly marked except for the one located close to the clubhouse of the golf club.  There is actually a barrier blocking the road that runs to the immediate north boundary of the golf club.  Follow this road for 600m.  At that point, cross the bridge on your left and continue on the major road.  From time to time, you will see some smaller trails on either side.  Take those trails for some fun single track trails.  If you stay on the main road, you will eventually come out to a lake on your right after about 1.5km.  Right before the trail hits the lake, there isa major intersection in the road with one road leading to the north and going uphill.   There is some nice single track trail on the eastern side of that road leading to the north.  There is also a nice single track beginning at the north end of the lake and goes due south for about 1.6km (on the gps map, it?s the westernmost track).  At the end of the single track, you are facing a 4-way intersection (45.894621°, -64.683976°).  I choose to go straight and up a small hill.  If you go left, the trail is wide and has seen some ATV uses.  This wide trail will eventually lead you back to the lake aforementioned.  I made it out to another 4 way intersection (45.896821°, -64.680596°) and this time, I turned left, down the hill and then in and out of some single track trails that run along the major road back to the lake. \r\rOn another occasion we parked our car at (45.896698°, -64.666181°) which is due south of the golf course.  From here, go in a western direction on the main road as it goes up a hill.  Pretty soon, you will see all kinds of single track trails on your right and left.  There is a large area to your left that has been cleared of trees to exposed limestone.  There are many tracks that criss cross that section as well as some crazy downhill sections for those who like these sort of things.  On the most part, the single tracks are very fun since they are underlain by limestone, the trail is packed hard and very ?very smooth.  Such a change from riding in Nova Scotia?s rocky and rooty trails.  If you go north on the old logging road/trail which begins at  45.898917°, -64.676229°, my track will lead you to a cool limestone solution cave.  There are way more trails then the ones posted in the gpx file but I broke my chain within 45minutes of getting there so I will need to go back at some point to navigate all of them.  There is also a very large limestone cave located near where we parked our car on the south side of the golf course.  From getting into it, it seems that this was a mine at some point.  There is a large square tunnel that runs right underneath the main dirt road. The  mine opening is approximately at 45.896306°, -64.668671°.\r\r",
    "directions": "Highway 114 south from Riverview to Hillsborough,  Turn on golf club road and park at  45.909495°, -64.661166°.\r",
    "geohash": "f84j0",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NB/10142/reg_hills-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/hillsborough-trails-near-hillsborough-nb-10142",
    "stats": {
        "Activities": "mtn-bike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 5,
        "Time": "3 hrs",
        "Total Distance": "12 km",
        "Town": "Hillsborough, NB",
        "Type": "out-and-back"
    },
    "title": "Hillsborough Trails",
    "trail_id": "10142"
}