{
    "description": "This was a lot of work and a lot of fun.  ~16km PLUS the ~30km of  Flat Creek Trail  you need to also do to get to this trail. But more importantly, over 900m of cumulative climbing in addition to the 300-350 on Flat Creek.  Eastcott says Sullivan Pass and High Rock Ridge is for the adventurous and determined rider and I'd concur with that.  But the views make up for it.\nMost of it is not what I'd call buffed.  The surface is OK but it is fairly overgrown, if you're expecting Slickrock or even Tom Snow amount of clear sailing (and clear trails), ride elsewhere.  Unless you are Hiawatha, do not attempt this without a good map, probably one better than the one in Eastcott's book (Sorry Doug).  Even better, download the attached GPS track, it is correct as of July 2011.\nThere are a few washouts, nothing too  unusual or difficult, just walk across the nastier ones, ride the ones that look doable.  There are miles & miles of trail where the Alder shoots will be whipping your knuckles, wear full finger gloves.  Bring lotsa water, 2L or more on a hot day.  There is ~900m of cumulative climbing and even more descending thanks to coming back onto Flat Creek down stream a bit.\nSome really funky trails through the trees, over interesting geology.  Especially Sullivan Pass, it has a very interesting texture, a thin, coal, shale, 80 degree thrustblock (I'm not a geologist, this is going to get me laughed at).  \nThe ride (OK, push for me) up the 21% grade for the ~800m approaching Sullivan Pass was tough (though one of our posse, rode the whole stinking thing.. atta boy JohnB) \nThe downhill, over 425 meters in 3.75km, and just before that, another 102m in 1.1km.  It's crazy, my wrists and fingers were getting sore.  There were loose sticks and baby heads, nothing scary to this XC-not-DH rider, all ride-able.  My brake rotors didn't even sizzle when I dribbled some water on them.\nOnly about 500m of nasty, choppy cow-tromped-upon dried mud, not bad by Southern K-Country trail averages.\nA great, tough ride.  Do It !",
    "directions": "Drive to Longview (75km SW of Calgary on Hiway 22). At North end of Longview there is Secondary hiway 541 going West. Follow it 21.0 km. You're there. It is just a gated road, not a big parking lot. Park on the allowance or possibly in the ditch.\nRide  Flat Creek Trail  in 17km to the cabin.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/10155/reg_IMG-1322-Medium--6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/10155/reg_IMG-1326-Medium--6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/10155/reg_IMG-1329-Medium--6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/10155/reg_IMG-1330-Medium--6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/10155/reg_IMG-1333-Medium--6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/10155/reg_IMG-1335-Medium--6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/10155/reg_IMG-1336-Medium--6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/10155/reg_IMG-1337-Medium--6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/10155/reg_IMG-1338-Medium--6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/10155/reg_IMG-1340-Medium--6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/10155/reg_IMG-1343-Medium--6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/10155/reg_IMG-1345-Medium--6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/10155/reg_IMG-1346-Medium--6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/10155/narrow_IMG-1325-Medium--6828.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/sullivan-pass-and-high-rock-ridge-near-longview-ab-10155",
    "stats": {
        "Activities": "mtn-bike hike",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 4,
        "Time": "5 hrs",
        "Total Distance": "47 km",
        "Town": "Longview, AB",
        "Type": "out-and-back"
    },
    "title": "Sullivan Pass and High Rock Ridge",
    "trail_id": "10155"
}