{
    "description": "Walton Glen Gorge is an incredibly deep and awe inspiring canyon located about an hour south of Sussex, New Brunswick. It was formed millennia ago by a glacier that flowed into the Bay of Fundy. Through the bottom of the gorge flows Walton Glen brook, which terminates at its junction with Little Salmon River (also surrounded by a gorge) which flows south into the Bay of Fundy. The Fundy Foot Path, as described by Trailpeak's east coast editor, Shannon Burt  (writeup) crosses over the Little Salmon River near its mouth.\nWalton Glen gorge has been called by some the \"Grand Canyon of New Brunswick\", and this less well known destination certainly lives up to its name. Sides of the gorge rise vertically several hundred feet from the riverbed below, and parts of the gorge become very narrow.  It is home to at least two waterfalls. The gorge is part of the Little Salmon River protected area, which is bordered on all sides by crown land. I was truly amazed that such an epic and compelling terrain had existed all this time in the province I grew up in: New Brunswick.\nThis entry details a hike (July 2011) down part of the Fundy Trail hiking system and onto one of its offshoots, a side path that leads to the edge of Walton Glen brook and travels southeast along the precarious edge of the gorge past Walton Glen Falls (the \"extreme\" part of this trek, hence the rating I give it) and down into the lower part of the gorge to what is called \"the eye of the needle\" - the most spectacular part of the trip: an insanely narrow, towering, exposed-rock part of the gorge just before the end of Walton Glen brook where it empties into Little Salmon River (were the gorge continues).\nFor most of my way-finding I relied on information I got from a geocaching website (http://www.geocaching.com/seek/cache_details.aspx?guid=46903838-6485-41fe-ab17-32744ebd5afc) but my route diverges from it slightly, which I attempt to describe here.\nThe trailhead is marked by a burgundy colored sign reading \"McCumber Brook 1.0 km / Walton Glen 4.2 km / Little Salmon River 11.0 km\" (see photo at this address: http://img.geocaching.com/cache/a18027ee-98b7-4669-a2d3-d436dc30c9d6.jpg).\n We hiked up the trail from this point going north (roughly). For the first several hundred meters this is a single lane road with a drivable surface, though no vehicles are permitted here. We past where the trail turns sharply to the left (marked by an arrow turn sign) and then came to a major fork in the trail. We kept right (the fork that leads to the left goes steeply down hill and I assume is a way to McCumber Brook, which flows into Walton Glen brook). A little while thereafter we came to another fork marked by pink flagging tape (both trails are visibly narrower than the one we were on until then). Assuming (not confirmed) that the one to the right lead to the gorge look-off (the photos of which I have seen look gorgeous) we instead went left because we were headed for the gorge bottom and it appeared to go downhill. A short while thereafter we noticed a smaller trail on the left marked by flagging tape so we took it, and our hunch was right because this path lead us down the slope to Walton Glen brook. There is a small clearing in the woods there beside the brook where a blue sign annouces the protected area status of the region. \nAfter that we followed the trail along the side of the brook (trail is marked by pink flagging tape - follow the direction the water is running) until we came to the first sight of the true gorge - towering cliffs rising along the northeast side of the brook just before Walton Glen Falls. This location is a spectacular chain of slide falls that run several hundred feet downhill into the deeper part of the gorge, over humungous bolders. At this point the trail is its most treacherous as it passes precariously close to the edge of the cliff-side overlooking the slide falls but the trail itself is the safest route as the rock slope flanking either side of the falls is extremely steep and when wet could easily cause a fall.\nAfter passing this, the most demanding stretch of our journey we continued down the trail along the southern side of the brook until it became too steep and was no longer marked by tape. At that point we started rock hopping down the middle of the brook and eventually came to the main event: \"the eye of the needle\", a very narrow yet extremely deep part of the gorge just before where Walton Glen brook empties into Little Salmon River. At the end of the eye of the needle there were no more exposed rocks to walk on to pass the narrowest part of the gorge, and considering we were already mostly soaked by the torrential rain we had experienced that day I decided I didn't want my still-mostly-dry-boots to get waterlogged like the rest of me by wading the river, so at that point we turned around and backtracked our route to the car.\nWe could have continued all the way down into the Little Salmon River gorge but that will have to wait for another (hopefully drier) day.",
    "directions": "***/ \nTAKEN FROM http://www.geocaching.com/seek/cache_details.aspx?guid=46903838-6485-41fe-ab17-32744ebd5afc\nMy additions marked between square brackets [].\nGet to Sussex, then to Waterford (follow the blue signs to the Poley Mountain ski area) [take exit 198 off route 1 and follow signs to Sussex Corner/St. Martins via Post Road / route 111, then turn left/south onto Needle Street and drive south until you see the Dutch Valley Road / Waterford Road veering to the left and take it]. Drive past Poley Mountain and follow the signs to Martin Head and/or Adair?s Wilderness Lodge. This will put you on Creek Road. Follow Creek Road and go past Adair?s. At the intersection of Creek Road and the Shepody Road turn left onto the Shepody Road. Just after passing Crawford Lake go onto the Little Salmon River Road at N45 34.737 W65 18.023. Stay on this road for 10.7 kms. At N45 30.192 W65 19.263 go straight onto the McCumber Brook Road. This road is rough for a few hundred meters but improves after that. Folllow this road for 2.4 kms then park at N45 29.064 W65 18.437. \n/***",
    "geohash": "f81d",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NB/10156/long_295872-10150337292252763-505617762-8305317-1814208092-n.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/10156/reg_310933-10150337307472763-505617762-8305579-170520751-n.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/10156/reg_Walton-Glen-011-27121.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/10156/reg_Walton-Glen-014-27121.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/10156/narrow_300910-10150337307217763-505617762-8305573-1427453586-n.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/10156/narrow_307284-10150337299642763-505617762-8305460-347957117-n.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/10156/narrow_312669-10150337291647763-505617762-8305304-1681762013-n.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/10156/narrow_Walton-Glen-003-27121.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/10156/narrow_Walton-Glen-012-27121.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/10156/narrow_Walton-Glen-024-27121.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/10156/narrow_Walton-Glen-042-27121.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/10156/narrow_Walton-Glen-048-27121.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/10156/narrow_Walton-Glen-052-27121.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/walton-glen-gorge-near-sussex-nb-10156",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 5,
        "Time": "4 hrs",
        "Total Distance": "5 km",
        "Town": "Sussex, NB",
        "Type": "out-and-back"
    },
    "title": "Walton Glen Gorge",
    "trail_id": "10156"
}