{
    "description": "There is a very nice waterfall located in a magnificent hollow near the Town of New Germany.  This nice fall is visited by locals but is not widely known beyond that.  It?s not very far from the road and apart from the descent into the ravine, it would be suitable for all.  The best part of this hike is that from the road, you wouldn?t expect to see a waterfall in this location.***This trail is entirely on private property. It is an excellent idea to ask permission at the north slope Farmhouse.*** The farmhouse also is a wood working shop, there is a mowed path that goes from the farmhouse to the entry point in the woods. I suggest asking permission too but it is not necessary to take the bottom of the field and get your legs chewed up by thorn bushes. Also note the ladder and catwalk over to the right where you enter the woods.I set off from my car and followed the stream?s edge.  Right after entering under the tree canopy and just above the main waterfall are two small cascade that are fairly picturesque but not as nice as the main fall.  From there I climbed on the south side of the river bank and then made my way to the bottom of the ravine to the base of the Lantz fall.  On the north side of the stream, there are large cliffs that need to be circumvented in order for you to go down to the base of the ravine.  As I was going down the south side slope to the base of the fall, I noticed a very peculiar rock formation.  It?s made of slates that are perpendicular to the ground.  There has been large sections of slates that fallen down over the years and this has created two small cave like features.  There is evidence of people having a camp fire by this unique rock formation.  The Lantz fall is about 20ft tall and the base of the fall would make a suitable swimming spot in the summer.  I made my way back to my car by going up the north slope.  this will lead you to an agricultural field and then to the main road (see GPS track).",
    "directions": "Highway 10 North from Bridgewater.  Turn right on Barrs corner Rd and then left on Farmington Rd.  Park at the bridge on Lantz stream at  44.602512°, -64.672017°.  Walk downstream to the fall",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/10171/reg_DSC-0091-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10171/reg_DSC-0095-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10171/reg_DSC-0096-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10171/reg_DSC-0099-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10171/reg_DSC-0103-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10171/narrow_DSC-0094-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10171/narrow_DSC-0098-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/lantz-fall-near-bridgewater-ns-10171",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "1 km",
        "Town": "Bridgewater, NS",
        "Type": "out-and-back"
    },
    "title": "Lantz Fall",
    "trail_id": "10171"
}