{
    "description": "There is a very picturesque hike located on the shore of the North River which flows into the LaHave River.  I had seen a map showing a waterfall on this river and decided to have a better look after looking at the google earth imagery of the river and seeing a long white section in the river (usually a good sign of a waterfall).\r\rImmediately off the main highway, I noticed a nice parking spot and then a small trail leading towards the river.  Following this trail for about 100m, you will come up to a small waterfall of about 4-5ft.  There are very large boulders and granite ridge in the river at this point.\r\rReturning to the path in the forest, you continue to follow the North River in an upstream manner.  Less than 1km from your car, you should come up to the Apron Fall.  This waterfall is really unique for Nova Scotia.  There is a large granitic piece of rock that blocks the whole width of the river.  This large rock must be at least 60ft across and maybe 30ft high.  In times of high water flow the water must go over the whole rock ?wall? but at the time when I was exploring, there was only a trickle of water.  However, the trickle of water has carved a 3-4ft deep meandering channel into the rock wall?the pictures will do this feature more justice than these words.\r\rAs you made your way to the Apron fall, you will see from time to time these large boulders in the forest which some would be perfect for some bouldering.  There are also small crevice features all around these boulders created by falling slabs of rocks onto each other.  On the other side of the Apron fall, the river has carved another channel and there are more smaller falls to be seen.  By the way, I notices that the map showed another waterfall (Whalesback fall) located upstream of the Apron fall.  I walked to this area only to find a set of very small rapids.  Unless this waterfall wasn?t mapped correctly, I would venture that there is no real ?whalesback waterfall?. If someone knows differently I would appreciate an email.\r\r",
    "directions": "Take highway 10 North from Bridgewater and turn right on North river Rd.  Park at the bridge (44.608349°, -64.763319°) and walk upstream\r",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/10170/7.ApronFall.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10170/reg_DSC-0071-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10170/reg_DSC-0065-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10170/reg_DSC-0069-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10170/reg_DSC-0076-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10170/reg_DSC-0082-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10170/reg_DSC-0085-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10170/reg_DSC-0088-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10170/reg_DSC-0089-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10170/narrow_DSC-0078-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/apron-fall-near-bridgewater-ns-10170",
    "stats": {
        "Activities": "snowshoe hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "3 km",
        "Town": "Bridgewater, NS",
        "Type": "out-and-back"
    },
    "title": "Apron Fall",
    "trail_id": "10170"
}