{
    "description": "There are some really cool rock formation near the village of Rocky Mountain.  It?s mountain in name only but the rock formations are unique enough to make the trip worth it.  By the looks of things, this spot is regularly use as a swimming spot by locals.\r\r\rFrom the highway, I followed the main logging trail into the wood.  The first part of the trail has been used by machinery recently and is in good shape.  As soon as you see some trails heading out to the right, take it.  There are at least two different trails that I could see that spurred off in that direction.  I took the second one and although, no machinery have been on this part of the trail recently, it?s easy to follow through the ferns that have overgrown it.\r\rAfter a while you will come out of the evergreen forest and by the side of a large blueberry field (which should be on your right).  Follow the trail as it located beside the field and then ends in a T intersection with a well used wood road/trail.  At this point turn to the right and walk about 100m.  Then turn to the woods on our left (or if you look closely enough, find a faint trail).  You will then come out after 50m of bushwhack by the side of the river.  There are two small rapids of about 5ft but the river has basically carved out a channel though some pretty thick rocks on either side.  Sometimes the rocks look like some portals beside the river.  I?ll let the pictures talk for themselves.  There is also a small cave that has been carved out by the river.  It?s located just downstream of the upper most set of rapids.  The cave is about 10ft deep.\r\rTo make it back to my car, I returned via the ATV track by the side of the blueberry field which was a good way to go as well.\r\r",
    "directions": "Drive on highway 347 until a metal guard rail begins at approximately 45.395622°, -62.233718° .  Park at the start of the guard rail and look out for a dirt road leading into the woods with a chain blocking access to vehicles.\r",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/10184/reg_DSC-0014-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10184/reg_DSC-0017-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10184/reg_DSC-0019-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10184/reg_DSC-0022-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10184/narrow_DSC-0026-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/rocky-mountain-falls-near-new-glasgow-ns-10184",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "3 km",
        "Town": "New Glasgow, NS",
        "Type": "out-and-back"
    },
    "title": "Rocky Mountain Falls",
    "trail_id": "10184"
}