{
    "description": "This is a good hike to do on days you do not have time to get out of the city.  A short hike through woodlands just outside of Dartmouth will bring you to some old mine workings.  A lot of the workings have been in filled but there remains one 20m plus adit that you can explore.\r\rAt first, you will follow a small river on an old road.  You will notice at some point a structure that had been built into a tree with a swigging rope attached above.  After a few minutes, turn on the first trail to the left. This trail will go up a small hill.  The whole hike is doable by mountain bike and there are many signs of people using ATVs to access the trails in this area.  Going up the hill, you will notice at least one trail on the right and then another on the left.  Continue on the main trail as it goes uphill.  There is some small wet areas in the trail which can be easily circumvented.\r\rWhen the trail levels off, you are very close to the adit.  The adit is located on the right hand side of the trail and is too obvious to miss.  The entrance might be about 5ft tall and the tunnel continues more or less in a straight manner right into the small hill behind it for about 20 meters or so.  You can see some light at the end of the tunnel/adit but there is not enough space to get out on that end.  I think the other end might have been infilled on purpose.  Unfortunately, some people have dumped a lot of garbage at that other end so don?t bother too much going over there?stay close to the main entrance and enjoy!\r\r\r",
    "directions": "Highway 107 towards lake Echo.  Take Lake Echo/Mineville exit.  Turn right at the stop and drive for about 2.5km on the Minneville Rd until you cross a bridge.  Immediately after the bridge turn right where you will see an intake for the fire service.  Don?t block the intake or you will be towed.\r",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/10183/reg_DSC-0267-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10183/reg_DSC-0259-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10183/reg_DSC-0262-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10183/reg_DSC-0264-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10183/reg_DSC-0268-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10183/reg_IMG-1799-58041.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/a-is-for-adit-near-halifax-ns-10183",
    "stats": {
        "Activities": "snowshoe hike mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "2 km",
        "Town": "Halifax, NS",
        "Type": "out-and-back"
    },
    "title": "A is for Adit",
    "trail_id": "10183"
}