{
    "description": "Here is an interesting small hike to a beautiful waterfall of about 25ft.  What makes this waterfall particularly attractive is a natural land bridge that has been created by one of the waterfall.  Although the land bridge is only about 2ft from the water it is still a very cool place to go explore.\r\r\rFrom where you left your car, you follow an old wood road.  It seems some people drive this section but the hike to the waterfall is short so why would you drive to it when you can enjoy the walk through the woods.  The forest is a nice mixture of hardwoods with a few large specimens.  There are some sections of evergreen a swell.  The whole walk on the old road is under canopy?perfect for hot days.  After only a short hike, you will first hear the roar of the water and then notice some yellow rope on your right.  Follow the rope to the base of the waterfall. \r\rSomebody was nice enough to put up the rope to help people go down to the base of the fall which is probably useful on rainy days where the dirt must be very slippery.  This place is accessible for all ages which is another great feature.  There is a fire pit at the base of the fall and probably enough water to swim in.  Just above the main waterfall, you will see the natural land bridge?hopefully it will remain there for a long time for people to enjoy its sight or you might want to hurry over there so you don?t miss it!\r\r\r",
    "directions": "\rHighway 347, turn on Greenevale Rd and park at 45.507546°, -62.487562°.  Follow the old wood road going by the side of the river.  The main road will instead turn sharply to the left and into a S ascension of the hill.\r",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/10185/reg_DSC-0030-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10185/reg_DSC-0037-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10185/reg_DSC-0040-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10185/reg_DSC-0044-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10185/reg_Fa-Fa-Fa-Falls-012-38765.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10185/narrow_December-31st-2011-043-38765.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/sutherlands-river-natural-bridge-near-new-glasgow-ns-10185",
    "stats": {
        "Activities": "hike snowshoe",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "2 km",
        "Town": "New Glasgow, NS",
        "Type": "out-and-back"
    },
    "title": "Sutherlands River Natural Bridge",
    "trail_id": "10185"
}