{
    "description": "I was looking at some old maps from the 1900s in an area of Nova Scotia located to the south of Antigonish.  There was a place marked as a gorge on the map on the Callahan Brook.  That piqued my interest enough to make me go out and explore this little known feature.\r\rYou start off by crossing a fallowed field.  At the end of the field and to your left, you will see Callahan Brook.  Follow this brook for about 700m to the gorge.  The walk there is relatively easy but there are some section that have some deadfall to cross.  The brook is small enough that you can easily jump back and forth over it.  The forest on the slopes of the brook is populated by beech and birch trees.  Walking on the slope or maybe on the top of the ravine might be easier that trashing through some of the deadfall.  Regardless after about 15 minutes of walking you will see a large rock outcrop in the middle of the brook.  Over time, water has carved out a small gorge into this rock outcrop.  The opening of the gorge might be about 2-3ft wide and as soon as you enter the wall on either side recede even more.  To the back of the small gorge is a waterfall cascading over some moss.  At this point the gorge might be about 10ft wide.  The rock walls on either side are only about 25ft high.  This is another truly unique feature that you seldom come across in the woods of Nova Scotia.  Although the gorge is not as impressive as some of the other gorges in the Cobequid Hills (George Fraser slot canyon for example), it is still beautiful enough to warrant a visit.\r\r",
    "directions": "Take highway 7 south from Antigonish and turn right on Ohio East Rd.  Follow this road for a while and park at ; 45.453700°, -62.061525°.  At the end of the road, you will need to knock at the door of a house to ask permission of the land owners to cross their land to see Callahan gorge.  I told them what I was looking for and they were very nice about it.  \r",
    "geohash": "f85fe",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/10190/reg_DSC-0008-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10190/narrow_DSC-0004-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10190/narrow_DSC-0012-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/callahan-brook-gorge-near-antigonish-ns-10190",
    "stats": {
        "Activities": "snowshoe hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "2 km",
        "Town": "Antigonish, NS",
        "Type": "out-and-back"
    },
    "title": "Callahan Brook Gorge",
    "trail_id": "10190"
}