{
    "description": "The Brent Mountain trail is a very well marked trail that leads you up into the alpine/sub-alpine regions through a protected area rich with small fauna and mountain flora.\nAfter a somewhat rough road access to the trail-head, you follow a very well marked trail for 5.2km (one way) to an old fire watch tower at the peak.  From this peak you are offered views of Apex Ski Hill, Summerland and Kelowna in the far distance.  The hike has some steeper sections at the beginning and end. It starts at an elevation of 5900 feet and reaches an elevation of 7200 feet.  I would recommend packing 3 essential items: a windbreaker as the exposed peak can be quite windy at times, some bug spray (the bugs aren't bad when you're moving or once you're at the peak, but rests on the hike up they will move in on you) and last but not least, a camera, the views are amazing.  The old fire watch tower at the top is unmaintained, so please don't vandalize it.  We packed a bag of garbage out on our last trek to make the visit more enjoyable for the next visitors.\nThis hike is 5.2km one way (roughly 2 hours up, 1.5 hours down) so plan accordingly.",
    "directions": "Driving directions from Penticton:\nCross the channel and head west on Green Mountain Road. After driving for about 20km, turn right onto Apex Mountain Road. Take a right at N 49 25.305 W 119 51.637. This is the beginning of the decommissioned road - take your time and watch out for the ditches.  There are approximately a dozen or so of them, some better marked than others.  At one point you will have to drive around a dirt mound, but if you drive slow you shouldn't have a problem. Turn left at N 49 26.850 W 119 50.840. There is a parking lot by the trailhead. However, the last 200 metres can get a little rough. You could also park at N 49 27.867 W 119 51.801 to avoid this last section.\nI have seen a variety of vehicles drive this road from trucks to cars, just take your time and chose your path around obstacles carefully.",
    "geohash": "c2f",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/10196/reg_DuskAtTheTop-11639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10196/reg_IMGP0496-11639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10196/reg_IMGP0537-11639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10196/reg_IMGP0549-11639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10196/reg_Trail-11639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/brent-mountain-near-penticton-bc-10196",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 5,
        "Time": "3 hrs",
        "Total Distance": "5 km",
        "Town": "Penticton, BC",
        "Type": "out-and-back"
    },
    "title": "Brent Mountain",
    "trail_id": "10196"
}