{
    "description": "Relatively untouched and pristine, the ?footpath? running from L?Anse Au Clair to Forteau is an intricate and varied journey through time that evokes the spirit of pioneer days amongst hikers trekking from town-to-town along the Southern Labrador Coast.The start of the trail is nestled in cove of L'Anse Au Clair just beyond the shore of the town?s sandy beach and directly below the layered rock plateaus that perch dramatically against the sub-arctic tuckamore  and crowberry vegetation.  Wildflowers abound.  Photographers will be happy - and your hike time will extend as you take it all in.The trail head, which is just beyond two grave yards heading northeast out of town, is marked by a sign warning All Terrain Vehicle (ATV) operators to be careful of walkers on the trail; but fortunately, once past the first kilometer or so of ATV trail, the single track begins and it's all footpath and somewhat technical.  Sturdy hiking boots are required.The first five kilometers of the hike are extremely interesting as the stony shoreline changes to steep layers of prehistoric rock formations before changing to thick beds of crowberry (pillow soft vegetation underfoot) and moss-laden rock ? all overlooking the Strait of Belle Isle.A key selling feature for this footpath is the fact that it is barely used, presenting a fun challenge for the intermediate hiker who is conscious at all times of the footpath signage (the trail is fairly well marked but signposts can be missed and we missed a few turn offs easy to back track) and for the hiker who is conscious of his or her footing (dips in vegetation and gaps in the rocks could twist an ankle).  You can't really get lost, there is a ridge line above you to the left the whole way, and the ocean on the other side.  At times the old footpath has been lost to regrowth, and at other times you feel as if you are walking a path worn in over the centuries.  Footpaths such as this that hugged the shoreline were often-times the only way to get from town to town.Signs of the footpath?s history are evident by two abandoned sleds found along the way. More interactive highlights from the trek included a sighting of dolphins, a seal (in the distance) and several marmots that will chirp at you and possibly stand their ground in defiance as you pass.Rolling tundra-crowberry atop 30 or 40 foot seaside cliffs makes up the majority of the hike past the five kilometer mark; however there are some technical sections along the way.  For those with extra energy,  there are opportunities to scramble up the ridge line plateau above you for views. The remaining walk into town provides a pretty waterfall (Overfall Brook Falls) and some rolling trail along the steep banks leading into the town of Forteau.  There is a high narrow route climbing a steep grade alongside the cliffs with a sharp dropoff to the beach.  Be careful at the one point requiring a careful step around a corner with a very steep dropoff.  This could be shored up by local trail crews, a slip here could result in injury. Overall this trail is fantastic (a highlight of our 7 day discovery trip along the coast), delivering a combination of rarely walked scenery, and pristine ocean side landscape.  The primordial feel of the rocks and landscape were confirmed for us as we encountered two Memorial University grad students (originally from Scotland) out for a hike who told us that these were some of the oldest rocks with fossil-like lifeforms on earth. Weathered over millenia and seemingly untouched even by the footpath, this hike will appeal to those who want the less crowded experience and shoreline wilderness. At hike's end, it's a beach walk leading to the trailhead parking area, and not much further, the Grenfell Louie A. Hall B&B was very close by and a relief for tired feet.  Breakfast the next day was fantastic. The home itself is steeped in history from its day as a International Grenfell Association nursing station, originally built in1946.  The present owner Peggy Hancock has integrated lots of period memorabilia, antiques, and furniture into the home decor.Note: The attached images are not in order.  The bridge, cemetery, and, rocky slope are initial.  The flat trail along ocean-side cliffs (in some cases 2 or 3 feet to the edge as this yielded the best berries for locals) are in the middle sections, and the waterfall is at the end, in the direction towards Forteau.  Hopefully the images convey the experience, at times I felt I was walking on pillows.For those interested in history, the attached GPS (GPX) has waypointed locations such as the old seal factory, shipwrecks, cabins and other points of interest along the way.",
    "directions": "From our Beachside Hospitality Home (B&B run by Gloria and Norm Letto), we simply walked towards the beach and along a dirt road to the grave-site areas, where you will see a sign at the trailhead, aimed at ATV users, however, it is the start of the footpath.  A Labrador Pioneer Footpath trail marker would also be helpful here, as these are the trail markers you will see every 100m or so.",
    "geohash": "f9p",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NL/10210/long_a2-start-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10210/reg_a-start-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10210/reg_a1-start-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10210/reg_c-early-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10210/reg_d-early-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10210/reg_e-early-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10210/reg_g-middle-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10210/reg_h-middle-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10210/reg_h1-middle-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10210/reg_i-middle-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10210/reg_i2-middleend-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10210/reg_j-end-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10210/reg_l-ending-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10210/reg_z-falls-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10210/narrow_w-falls-5_best1_.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/labrador-pioneer-footpath-lac-to-forteau-near-lanse-au-clair-nf-10210",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 5,
        "Time": "5 hrs",
        "Total Distance": "15 km",
        "Town": "L'Anse-au-Clair, NF",
        "Type": "out-and-back"
    },
    "title": "Labrador Pioneer Footpath - L.A.C. to Forteau",
    "trail_id": "10210"
}