{
    "description": "1.6km each way or about 3km round trip, extend with a trail to the Boney Shore (whale bones from the Basque fishing days).  I hiked close to 700 steps in relative easy pausing only for shots of Red Bay.  However, at stair 300 or so, icebergs!!  Lots of them, coming down the coastline like airplanes stacked up for landing at a busy airport.  One after another \"cleared for viewing\".  I met one other savvy hiker using the hill hikes to spot icebergs. \nThis is an interpretive \"hike\" with several signs about local history.  The stairs became popular across Newfoundland and Labrador and may not be every hiker's idea of a hike, however, I will say this, they are easy to spot from anywhere in town -- no question where the hike is.  And it does make for the most direct line up the hill, adding some great cardio if you near run it.\nAlong the way, you get an excellent view back on historic Red Bay, first visited in the 1500's by Basque Whalers.  Parks Canada runs a national historic site here with boat trips over to Saddle Island, and two interpretive museum like halls for learning all about the Basque fisherman, and the British, French, Irish, and Newfoundlanders who followed.  Of course, first nations history factors into the region, excellent harbours always have been a favourite amoungst seafarers.\nThis harbour however has an impressive metal wreck of a large ship built in the early 1900's.  The interpretive signs tell the whole story.  As you gain altitude (or stairs), the trail levels off, and you look over to the rugged barrens and the \"pole path\", a pond, and finally the peak.  At the top you've got a full view of the coastline, and can look over to the mountainous terrain south of Red Bay which will one day form the terminus of the Labrador Pioneer Footpath.\nAll in I was probably hiking (stairmastering) for about 30-40 minutes, but you should spend more time here, as there are picnic table rest stops and a nice breeze, not likely you'll have a black fly problem here.",
    "directions": "Just before you enter Red Bay, you'll see a well marked and large sign on the right with the two trail names (Boney Trail and Tracey Hill).  Take this turn off on the right and drive up 100m or so and park in the designated area.  Sign the guest register, just follow the stairs!",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NL/10221/long_icebergs-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10221/long_wide1-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10221/long_wide2-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10221/reg_miniberg-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10221/reg_more1-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10221/reg_morestairs-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10221/reg_nearshore-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10221/reg_saddle-dock-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10221/reg_sideview-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10221/reg_top-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10221/reg_wreck-5.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/tracey-hill-near-red-bay-nf-10221",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "3 km",
        "Town": "Red Bay, NF",
        "Type": "out-and-back"
    },
    "title": "Tracey Hill",
    "trail_id": "10221"
}