{
    "description": "Caribou Island is a pristine and essentially untouched gem for hikers situated directly across from Battle Harbour ? a tiny but flourishing historical fishing village that was once known as the socio-economic hub of Labrador due to its location in ?cod-rich? waters.\nHikers visiting the Battle Harbour Historic Site can request a five-minute boat ride from site staff and travel across to Caribou Island to explore its 12 km shoreline or walk inland to discover ?ferry holes? (caves), valleys, coves and remnants of historic buildings  ? all steeped in history.\nFor our visit, we were treated to two local guides who led us from the shoreline across from Battle Harbour over a hill to Trap Cove and then onward towards Mathews Cove. The scenery along the footpaths on Caribou Island mirrors the Labrador landscape with soft crowberry and moss-laden rock at the peak of hills with more grass and tuckamore throughout the valleys. Waterproof footwear is highly recommended.\nA few occupants of Caribou Island still visit in summertime near some of the coves and may be seen picking berries during the summer months.\nMonuments from the past are likely of great interest to hikers along this trek. For example, as part of our shortened walk, we were led past two cemeteries where we discovered headstones from Irish fisherman and settlers from as far back as the 1840s.\nWe also encountered a collapsed building, noted by the locals as a school, which is now occupied by seemingly content arctic foxes. During a short break, we were greeted by about four of them who were curious and followed us for a few minutes along the trek.\nThe landscape also boasted a large pond which was noted by the locals as the primary source of drinking water for Battle Harbour; its existence reminds us that there are still places on earth where people can consume water directly without any filters and one of our guides did just that.\nWhile our walk was short, hikers could customize their walk to travel the circumference of the island ? 21 km in total along the ridgeline ? and can ask local guides for radios to ensure their safety.\nOf note, there is an old Loran station on the far side of the island, in a cove (see Loran on the Google map).  This was manned in WWII by the US military.  There was a failed PT boat landing (US sub hunter in WWII possibly dropping off service personal) resulting in a crash and explosion with loss of life near Battle Harbour Island.  Recent dive efforts by officials have been made on this flying boat.  \nHistory on Caribou dates back to first nations who prized this area for all the same reasons the early fish merchants did, and continues through to today's recreational  sailors who drop in on their transatlantic journeys.  You may even see one come in to Battle Harbour in the fog at night as we did.\nCaribou is a great workout, the slopes are steep, and there are many hill repeats and ridge walks possible.  Our cold wet foggy day limited our enthusiasm stay out all day, however, we did see a lot in our morning hike.",
    "directions": "Get to Battle Harbour via the ferry from Mary's Harbour.  Once on the island, simply ask (Nelson Smith or guest services at the general store) to arrange for a 2-5 minute boat ride over to Caribou.  Best to take Nelson with you, or a map / GPS just in case it gets foggy.  The main routeoff the dock  is marked with sticks/markers, however, it would be a bit confusing in the fog.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NL/10237/reg_-DSC0235-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10237/reg_-DSC0236-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10237/reg_-DSC0238-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10237/reg_-DSC0241-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10237/reg_-DSC0242-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10237/reg_-DSC0243-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10237/reg_-DSC0282-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10237/reg_-DSC0285-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10237/reg_-DSC0310-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10237/reg_-DSC1235-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10237/reg_-DSC1236-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10237/reg_-DSC1237-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10237/reg_-DSC1238-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10237/reg_-DSC1239-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10237/reg_-DSC1240-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10237/reg_-DSC1249-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10237/reg_-DSC1250-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10237/reg_-DSC1256-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10237/reg_-DSC1259-5.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/caribou-island-near-marys-harbour-nf-10237",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "5 hrs",
        "Total Distance": "10 km",
        "Town": "Mary's Harbour, NF",
        "Type": "out-and-back"
    },
    "title": "Caribou Island",
    "trail_id": "10237"
}