{
    "description": "You will see a sign with full history of Bouquet?s trail and fur trading past quite close to the highway in a covered kiosk.  Follow the boardwalk which is mostly flat for a few hundred metres then begin your ?stairmaster? workout to the top of the plateau, a good 20 to 30 minutes of uphill on wooden stairs with guardrails.  I am not sure the purist hiker likes this kind of constructed trail, but it does have two or three advantages.  Firstly, you can spot the wooden steps and viewpoint from anywhere in town there's no guesswork.  Second, those without proper hiking shoes can do this, in fact, anyone can.  Lastly, the delicate tundra and environment gets preserved without trail brading or erosion.  The picnic table rest stops at the halfway point and the top (very windy) are also a plus and I'm surprised more locals aren't using this for a sunny lunch break.  We saw no one.  Without question though, the view at the top is incredible as you gain the final plateau and view the cliffs that form the crusty edge of the plateau.  The views are fantastic, over to Pinware Provincial park and the mountains in behind.  It gets mountainous from here to Red Bay and one day the Labrador Pioneer Footpath will extend to Red Bay over these mountains.  From the flagged vantage point at the top, you can see down to the historic fishing wharf and lighthouse of West St. Modeste.  \nThe mayor of West St. Modeste, Agnes Pike, gave an interview to trailpeak crew while visiting in the summer of 2011.  The reprint of that interview describing the coastal trail system that goes back 100?s of years is included at the very bottom of this write-up.  The Labrador Pioneer Footpath as it is known today was the only way for people to get from community to community (usually anywhere from 6km to 15km) especially when the sea was too rough for boat travel.  The Bouquet?s Hill Trail gives an excellent panoramic view of the Labrador Pioneer Footpath and coastal terrain.\nElsewhere on trailpeak.com are the legs of the footpath from L?Anse Au Clair to Forteau, Forteau to the historic lighthouse at Point Amour, the L?Anse au Loup to Battery cliffs and on to West St. Modeste, as well as the West St. Modeste to Pinware legs.  Each description has images, downloadable GPS/GPX, and directions and detailed accounts of the trail sections as hiked by trail peak editors in August 2011.",
    "directions": "Opposite the Oceanview resort (roadside motel) in West St. Modeste, you cross the road and head in behind and to the right of the resource/community centre.\nInterview with Agnes Pike, mayor of West St. Modeste, by Kurt Turchan:",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NL/10235/reg_-DSC0092-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10235/reg_-DSC0093-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10235/reg_-DSC0095-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10235/reg_-DSC0099-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10235/reg_-DSC0103-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10235/reg_-DSC0104-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10235/reg_-DSC0111-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10235/reg_-DSC0114-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10235/reg_-DSC0116-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10235/reg_-DSC1217-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10235/narrow_-DSC1211-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10235/narrow_-DSC1214-5.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/bouquet-hill-trail-west-st-modeste-near-west-st-modeste-nf-10235",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "3 km",
        "Town": "West St. Modeste, NF",
        "Type": "out-and-back"
    },
    "title": "Bouquet Hill Trail - West St. Modeste",
    "trail_id": "10235"
}