{
    "description": "Battle Harbour has it's own 45 minute to 1 hour walk around the Island on a trail that visits several points of interest (cemetery, plane wreck/memorial, marconi station, old community, hill views) but is also a short (2 min) drop off to Caribou Island where one can hike all day (8 hours).  This trail entry mostly describes Battle Harbour loop, an important National Historic location that has been fully restored and is a must see when traveling in Labrador because of it's remote yet complete historical fishing industry and northern location.  \nWe arrived in the fog, as the community buildings dating back to the early 1800s began to appear.  A narrow passageway between Battle Harbour Island and Caribou Island (a tickle) had us safely at the wharf, the large expanse of the Atlantic ocean on the other side of this small Island. I?ve never seen an old fishing village so well preserved, but Battle Harbour is more than pretty scenery. Dr. Grenfell?s coastal medical mission started here.  A quick hike of the Island after communal dinner  - featuring homestyle cooking  - takes you up the small hill to get a 360 degree view of the ocean.  Scanning the horizon, I saw two icebergs in the distance. This walk is a good 30 to 45 minute tour of the Island, ending with a walk back past the historic buildings.  Battle Harbour was a significant fishing asset and communications hub, Peary returned here to use the Marconi station to broadcast his news of reaching the north pole in 1909.\nNext Day - Caribou Island and historical tour of Battle Harbour\nWe got word that Nelson Smith, the historical tour guide for Battle Harbour  (who is also a ranger, and a restoration carpenter) would give us a special guided tour of Caribou Island.  A small hop across the tickle, and we were quickly scrambling steep rock and tundra slopes to see several abandoned communities, coves, and old cemeteries. The old Irish cemetery with it?s headstones fallen in the tall grass held each of us in quiet reflection. A family of arctic foxes decided to make an appearance and I was glad to have my camera handy.  You can hike all day on Caribou, it would take several hours of ridge walking with descents into valleys, historic settlements, and coves.  The Island will be all yours (you are given a radio to summon your 2 minute boat ride back) save for a few summer inhabitants who choose to spend a few weeks here in summer.  We saw one lone hiker out gathering bakeapples.  Afternoon featured the full tour of the Battle Harbour buildings. Nelson gives an excellent tour on how they caught, salted, and prepared cod for the fish merchants.  Battle Harbour astounded me, I?ve never seen anything like it.  Fortunately the entire village, old tools, and buildings are preserved here.  Don?t be surprised if a steel hulled two masted sailboat arrives from France or elsewhere, Battle Harbour is still a lifeline for transatlantic   The comparison to Fogo Island is not a far stretch for this much tinier Island, it was Fogo Island fish merchants that first expanded here.\nNote:  The attached GPS (downloadable), see Google map to the right, shows the small loop on Battle Harbour (Island), as well as the actual path we walked on Caribou Island, and a projected (map drawn) GPS track showing as an example, the kind of all day hike you can do on Caribou Island.  Caribou Island is a separate entry on trailpeak.com in order to isolate the imagery and provide a better description of just that hike.  Caribou is a much larger Island and represents the most interesting hiking potential on a typical 2 day visit to Battle Harbour.\nDetailed Historical Account of Battle Harbour (knowing this helps make the hiking / walking more interesting):\nBattle Harbour, once known as the ?Capital of Labrador? is a thriving architectural restoration of a fishing village that flourished during the last three centuries.\nSet on a small, remote island, the village is comprised of restored historic buildings including a hotel, general store, walkways and work areas that commemorate the glorious fishing community that was once the socio-economic hub of Labrador.\nBattle Harbour was formed through the lucrative mercantile saltfish industry when the firm of John Slade & Company of Poole expanded its Fogo Island operations to Labrador in 1770. The village also served as the gateway for Newfoundlanders seeking to fish in the resource rich waters of Labrador.\n \nBattle Harbour's location allowed the village to become a major base for the region's cod and seal fisheries and for the commercial trade that led to the formation of a permanent community.\nThe local population increased rapidly after 1820 when Newfoundland fishing schooners adopted Battle Harbour as their primary port of call and made it the recognized capital of the Labrador floater fishery.\nThe community's amenities and communications services also made Battle Harbour a port of call for polar explorers. In 1909, Commander Robert E. Peary called a press conference using Battle Harbour's Marconi Station wireless services to share details of his reaching the Pole to the outside world.\nBattle Harbour was operated by three fishing companies until the decline in the inshore fishery at the start of the 1990s, shortly after which restoration work began with 18 carpenters and restoration experts, many of whom go back generations on the Island.  Three restoration experts remain on the job today, adding more buildings and projects to the trust each year.  Visitor traffic is increasing, for obvious reasons.  This is one of the most exceptional points of interest in Labrador.",
    "directions": "From Mary's Harbour, take the passenger only ferry (1961 fisheries inspection vessel) over to Battle Harbour.  You make a reservation to stay on Battle Harbour first, and use the dockside reservation and information office (and museum) as your check-in, you can't miss it.  Battle Harbour has several restored buildings that now serve as cottages / Inn, with communal dinner being served above the General store (rebuilt in the 30's after a fire).\nOn the Labrador South Coast -- drive from Blanc Sablon along the coast up to L'Anse Au Clair and stop in at the visitor centre.  Hopefully, you'll take in some hikes along the southern coast, these are on trailpeak.  You can hike from town to town, and, finally at Pinware, end your B&B to B&B trekking, and driving to Mary's Harbour.  Or drive straight to Mary's Harbour, but most people take in a few hikes along the way, stop at Point Amour lighthouse as well as Red Bay National Historic site.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NL/10236/reg_-DSC0158-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10236/reg_-DSC0161-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10236/reg_-DSC0163-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10236/reg_-DSC0168-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10236/reg_-DSC0169-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10236/reg_-DSC0173-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10236/reg_-DSC0176-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10236/reg_-DSC0189-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10236/reg_-DSC0200-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10236/reg_-DSC0207-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10236/reg_-DSC0213-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10236/reg_-DSC0218-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10236/reg_-DSC0223-5.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/battle-harbour-walk-near-marys-harbour-nf-10236",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 3,
        "Time": "8 hrs",
        "Total Distance": "3 km",
        "Town": "Mary's Harbour, NF",
        "Type": "out-and-back"
    },
    "title": "Battle Harbour Walk",
    "trail_id": "10236"
}