{
    "description": "One of the highlights of our several days of hiking the Labrador Pioneer Footpath, the 6km journey from Forteau to the Point Amour Lighthouse is similar terrain (but tamer) to the route into Forteau from L'Anse Au Clair. This hike leads up to one of the top destinations in Labrador, the Point Amour lighthouse, the tallest in Atlantic Canada.  Since the heritage to the area (place names) was French, the original name was Point a Mort -- and understandably so -- the waters and rocky shore here are treacherous. \nThe hike itself runs along the seashore, it's easy, there's more crowberry underfoot and you can detect the centuries old footpath, it's more pillow soft walking on a thin layer of close to the ground crowberry and tundra vegetation.  As you round the cliffs, you then have a choice to heading into the dunes, or, following a beach route on red sand.  We chose this route, it's always nicer close to the shore and the breeze is good for keeping black flies at bay.  We took our shoes off to cross a shallow small brook, and then gained the road for a small stretch before dipping back down to the shoreline, one final corner to turn before you get a glimpse of the lighthouse.  Signposts every few hundred meters will guide you past H.M.S Raleigh wreck and right to the base of the lighthouse.  \nLocated on the Strait of Belle Isle, this was the preferred route for transatlantic shipping  to save time. This route required a series of very tall lighthouses to assist seafarers.  Unfortunately for the British Navy, they didn?t do so well in the Strait of Belle Isle where the current is swift and the fog thick.  In 1922, the flagship battleship of the North Atlantic fleet ran aground here, literally steering right into shore not 300 meters from the lighthouse (like a moth to flame).  There is still controversy today as to why this happened.  Some say (the official story) an iceberg was spotted, and the cruiser, after swerving to avoid the iceberg was steaming too fast to avoid a collision with the shoreline. However, with a lighthouse dead ahead, you?d think a hard turn not unlike the previous one would have worked.  Others claim the ship?s officers were drinking (on their way to Salmon fishing in Forteau) and the Captain asleep elsewhere on board. They simply misjudged.   The piano from H.M.S. Raleigh (it sat there for several years before the ship was blown up) is in one local's home today, no doubt, the stories are still floating around the community.\nA full account of the grounding (with pictures) is inside the Point Amour lighthouse, including imagery of the ship on the rocks when it first happened.  It took the British Navy several years to return and blow it to pieces, as a result, hikers and visitors will see only trace evidence, some large hull pieces and machinery.  Unfortunately, the British were in such a hurry to blow it up (it must have been embarrassing, the captain court martialed) that cordite and other explosives were left in the shallow waters.  The Canadian Navy has returned recently to demolish and recover some of the shells and cordite, as the fusing gets more fragile over the years.  Visitors are advised not to pick up anything along the shore.\nBack to the lighthouse, there are many other displays, covering local fishing, history, lighthouses, and Labrador itself.  It's mostly self-guided. We enjoyed the sunset and took lots of pictures, wondering what it would have been like to have been a lighthouse keeper.  The original lighthouse keeper?s residence is on display, complete with artifacts.  Visitors may also climb up the lighthouse on a guided tour.  It?s a long way up, but the views are incredible.  A more recent lighthouse keeper?s residence (dating to the 1950s/60s) is adjacent and kept immaculately clean and has had it?s bedrooms turned into hostel styled housing.  Check with organizers / planners of the Labrador Pioneer Footpath (Gateway to Labrador Visitor Centre in L?Anse Au Clair) as it has the potential open as a hiker?s hostel one day in the future, one can only wish.  \nHow amazing would it be to hike into the lighthouse premises.  Sunsets are nice here, keep an eye out for whales.  A barbeque, a glass of wine, and low key evening at this historic venue is a hiker?s perfect ending (or midway rest) to a few days of coastal trekking.  The lighthouse is active and may feature a fog horn at night if it's foggy.\nCheck in with Gateway to Labrador visitor staff to inquire about the status of staying on premises.  We saw campers (RVs) in the parking lot as we lingered through the sunset before heading off (we were driving, and doing a combination of B&B to B&B hiking with luggage transport as arranged by the B&B?s and visitor centre) to our next ?base camp?, the Oceanview Resort at West. St. Modeste. \nNote:  it?s possible  to continue on the Labrador Pioneer Footpath from the lighthouse at Point Amour down and into L?Anse au Loup (5km) and Dot?s bakery for Soup and sandwich at lunch and then do the next long leg, the Battery.   The next leg for us was ?the Battery? (leaving the other side of L'Anse Au Loup). The  trailhead (will also be marked by a large sign) is at the bottom of the highway that heads up the Battery, just off Brook road on the right.",
    "directions": "Start from the other side of town (coming from L'Anse Au Clair) and park at English Point (or just walk through town from the Grenfell B&B) which is just at the base of the hill that the road climbs leaving town (look for the parking turn off on the right).  If you climb too high above town on the road, you've gone too far (as we did).  The parking area is not as yet signed, however, it will be soon (possibly on your visit), and, the trail heads down out of the gravelled parking area through a cut in the forest, it resembles ATV trail for a while, but you'll see the Pioneer Footpath signposts with the logo (foot) before long.  Follow the seashore, this one is easy.",
    "geohash": "f9ps",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NL/10232/reg_-DSC0700-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10232/reg_-DSC0704-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10232/reg_-DSC0706-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10232/reg_-DSC0707-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10232/reg_-DSC0710-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10232/reg_-DSC0714-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10232/reg_-DSC0720-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10232/reg_-DSC0721-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10232/reg_-DSC0723-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10232/reg_-DSC0749-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10232/reg_approachinglighthouse-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10232/reg_jodie-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10232/reg_sunsetlighthouse-5.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/labrador-pioneer-footpath-forteau-to-point-amour-lighthouse-near-forteau-nf-10232",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "6 km",
        "Town": "Forteau, NF",
        "Type": "out-and-back"
    },
    "title": "Labrador Pioneer Footpath- Forteau to Point Amour Lighthouse",
    "trail_id": "10232"
}