{
    "description": "The LaCloche Silhouette trail in Killarney Provincial Park is one of the most rugged trails in Ontario.  This is a 100km loop starting and ending at the George Lake campground.  The terrain varies greatly, from dense forest to swamps, stream crossings, rockslides and ridges with some very steep sections.  The gleaming white quartzite rock of the LaCloche range is very smooth and treacherous when wet, and is likely to be wet for at least a couple of the 7-10 days required to thru hike the trail.  Situated near the shores of Georgian Bay, the weather is quite variable.  I have experienced an all night thunderstorm on all but one of the seven trips I have done on this trail so pack a good tent!\n     A good quality topographic map detailing the park and the trail are essential for planning a trip and is available from the Friends of Killarney Park online store You may also contact the park directly with the information listed below.  Park staff will have detailed information on trail conditions and are invaluable when planning a route, especially if you are unfamiliar with the terrain.\n     The most popular route is to hike the trail clockwise, starting at the small bridge in the western part of the George Lake campground.  I have hiked the trail in the opposite direction once, there are ups and downs to both routes(literally?).  The usual route, starting from the bridge takes you through some mixed forest, stream crossings, beaver dams and some farily rough terrain.  The first 30km or so are a bit demanding, but are actually easy compared to the rest of the interior.  Expect the terrain to get very rugged from days 2-8 on a ten day trip.  On the upside a hard and rugged hike also means beautiful scenery and spectacular views.  This trail does not disappoint.  \n     Hiking from the opposite direction will get you into the rough interior and picturesque ridges the very first day!  It also means that you will be climbing up and down some steep, rocky slopes when you are just starting out and your pack is the heaviest.  On the upside, hiking this way means that you will take on the steepest climbs uphill, which is much easier and safer when carrying a heavy pack.\n     The trail is marked mostly with little blue plastic arrows, but in some places rock cairns are used.  This can be confusing, especially at the end of the Hansen Township section near Silver Peak where a lot of canoeists day hike along the trail.  Over the years, many have seen the rock cairns and decide to build one of their own, the result is that there are cairns everywhere and being on a long rocky ridge the trail is not obvious.  I have been frustrated several times on this section with cairns leading off in every direction. Keep to the southern side of the ridgeline and there is less chance of missing the sharp turn in the trail.\n     The view from the top of Silver Peak is great, but getting there involves a detour of about 2 hours each way.  The turnoff from the main trail is also 2 hours from the nearest campsite, so it's important to plan ahead if you want to hike up to the top.  \n     Near the end of the trail, about 5-6 hours hike from the George Lake campground, there is a great view of the interior.  It's the last good vantage point before descending through ?the crack?,  a boulder filled split in the rock face.\n     Aside from the views of the landscape, there is no shortage of wildlife.  I have seen hawks, osprey, grouse, bears and even had a close encounter with a pair of moose.  Make sure you know how to hang your food bag properly.  I once had to rescue a couple who had gotten theirs stuck up in a tree at the mid point of the trail.  The map from the Friends of Killarney Park has more info and lots of tips for anyone planning to hike this trail.\nContact:  \nFriends of Killarney Park Killarney Ontario\nPOM2A0\n(705)-287-2800\t    www.friendsofkillarneypark.ca\nKillarney Provincial Park Killarney Ontario\nPOM2A0\n(705)-287-2900  www.ontarioparks.com",
    "directions": "Take the turnoff for Hwy. 637, about 40km south of Sudbury on Hwy. 69.  The park gates are on the right hand side about 60 km from the 69/637 turnoff.",
    "geohash": "f0n",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/ON/1023/reg_killarney1jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/1023/reg_killarney2jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/1023/reg_killarney3jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/1023/reg_killarney4jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/1023/reg_killarney5jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/1023/reg_killarney6.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/lacloche-silhouette-trail-near-killarney-on-1023",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 5,
        "Time": "56 hrs",
        "Total Distance": "100 km",
        "Town": "Killarney, ON",
        "Type": "out-and-back"
    },
    "title": "LaCloche Silhouette Trail",
    "trail_id": "1023"
}