{
    "description": "This listing describes two trails that are distinct but together form two important legs of the Labrador Pioneer Footpath in and out of West. St. Modeste (our basecamp for a few days staying at Oceanview Resort just above the historic waterfront).  Our local guide Bob Hancock gave us a guided tour of the trail lovingly designed and built by Stuart Pike and crew.  Contact Agnes (owner of Oceanview Resort in West St. Modeste, Bob, or Stuart for more information).A pull out on the highway to Capstain Island meanders from the highway to the shoreline and marks the beginning of a two-part trail along the Labrador Pioneer Footpath that hugs the Atlantic Ocean and leads hikers from West. St. Modeste to Pinware. Part I - Capstan Island to West St. ModesteMirroring some of the earlier terrain seen on the footpath (L?Anse Au Claire to Forteau) but with more stark contrasts between blue ocean, crowberry, lichen and red rock, the trail is both exceptionally well-marked and well-maintained adding to the hiker?s enjoyment of the scenic Labrador Coast.  Part I of the trail, which is 2.6 km in total, is easy to navigate thanks to the frequent footpath markers and the occasional ?footprint and whale logo? painted on the trail?s rocks. Crushed shells and pebbles dot the soft vegetation underfoot (crowberry) to make this section of the Labrador Pioneer Footpath possibly the most manicured portion of the trek. The trail?s outstanding condition along with its relatively low grade and shorter distance make it a perfect day hike for both travelers and hikers.  A family can easily hop out of the car to do this trail.  A through hiker doing all of the Labrador Pioneer Footpath will simlpy hike these in sequence on their way up the coast.The trail also boasts a number of pretty tarns amidst the green foliage which beautifully reflect the sky as well as the ripe orange bakeapple (cloudberry) plants which grow frequently at this time of year (mid August). There are some moderate changes in grade during the walk that lead the hiker along the shoreline and up to the larger rock formations and keeps the hike interesting from start to finish.The trail ends at a pull out just down the road and hikers who do not wish to return to the trail head may wish to arrange for a second vehicle.Because private land and a growing town now occupy some of the traditional footpath real estate close to the seashore, part II is best done by driving (or walking) down the highway to West St. Modeste.  If \"basecamped\" at the Oceanview resort (as we did, and the beds are good!) you can simply make the hotel your destination for a small break or lunch.  The restaurant here is very good.  Wireless internet works. Start Point Trailhead - Capstan IslandNon-descript parking spot just past the Church and before the Capstan Island sign on the other side of the road; with a few wooden planks/pallets (at time of our hike) in the clearing. See GPS/Google map.End Point Trailhead - West St. Modeste welcome/exit sign\"Thank you for visiting our town\" and on flip-side \"Welcome\" sign for West St. Modeste, also signage for Oceanview Resort at this location.  South of town (in direction of Forteau). Part II - West. St. Modeste to Pinware (outskirts) Part II of this 4.5 km trail begins approximately 300 meters past the Ocean View Resort at a parking area on the right.  Or, hike right from your room.The exceptional condition and markings along the trail continue from Part I but this part of the route also includes several newly-constructed foot bridges to help hikers navigate through slightly more forested terrain and over several brooks encountered at the mid- and end-points of the trail.Much of the landscape along Part II mirrors Part I but with more grade changes which provides slightly more challenge to hikers (but the trail would be considered beginner). Part II also offers hikers the option to walk the Pinware Beach to complete the trail along with the option to follow the marked trail through treed areas and over the Pinware Brook. Both options will end at a second parking area at the Pinware Community Centre.However, the beach option is highly recommended both for its scenic view of the ocean as well as its wildlife (we woke up a seal) and bug scattering breeze.  Bring a bug net and wear it if you take the forested finale to the end.In mid-August, you will most likely encounter black flies along the route (depending on the wind) so it is highly advised to wear bug spray and carry a bug jacket at all times but the thick forest presents the most problems so try to stick to the shore.The beach route (with brook crossing) is recommended by this hiker if possible.  Brook hopping was the practice of the day when the traditional footpath was used.  If you do not take the beach option into Pinware, you'll have a forested detour and wooden bridge crossing -- good luck!End Point Trailhead (park car here if doing as shuttle)Napoleon Arthur Town Centre: Town Hall and Fire HallPast cemetery along road up to town centre.Start Point - West St. ModesteCrushed stone walkway/garbage can/circular drive. 200m from Ocean View Resort in West St. Modeste (and opposite the Bouquet's Hill trailhead and stair hike to the top of the hill).",
    "directions": "See description and / or GPS",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NL/10234/reg_-DSC0015-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10234/reg_-DSC0017-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10234/reg_-DSC0019-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10234/reg_-DSC0021-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10234/reg_-DSC0022-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10234/reg_-DSC0024-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10234/reg_-DSC0028-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10234/reg_-DSC0034-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10234/reg_-DSC0039-5_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10234/reg_-DSC0043-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10234/reg_-DSC0046-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10234/reg_-DSC0048-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10234/reg_-DSC0052-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10234/reg_-DSC0062-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10234/reg_-DSC0074-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10234/reg_-DSC0080-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10234/reg_-DSC0084-5.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/labrador-pioneer-footpath-capstan-islandto-pinware-near-west-st-modeste-nf-10234",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter summer",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "8 km",
        "Town": "West St. Modeste, NF",
        "Type": "out-and-back"
    },
    "title": "Labrador Pioneer Footpath - Capstan Islandto Pinware",
    "trail_id": "10234"
}