{
    "description": "A delightfully short outing to some super-fine alpine lakes. Everything you could want from a hike: varied terrain, snowy peaks, gut-punch blue water... awesomeness!\r\rThe first 20 minutes of this hike is along an old road, the grade is almost non-existent, and the road is overgrown enough to provide lots of shade and bear hiding places. It then transforms into a standard packed-earth trail, but the grade remains exceedingly gentle for another 20 minutes to a widening in a creek you could almost call a pond. Great place to stop, water the dogs, and think \"this is the easiest hike ever\" - but it does get more challenging, worry not.\rShortly after the \"ponds\" the trail spits you out onto a scree slope and becomes way less distinct. Rule of thumb is basically stick close to a creeklet on your left and follow the stones that have been crushed and de-mossed by the passage of boots. You are soon on the highest spine of scree and there is little doubt about which way to go. The trail now becomes steeper, and as you return to packed-earth forest it becomes even more so. \rAfter about 40 minutes of climbing you will find yourself popped out just shy of the lakeshore, but in plain view of some of the bluest water you'll ever set eyes on. I was running out of daylight and could only linger here for 30 minutes, but the trail continues skirting the lower lake and after what I was told is some serious boulder scrambling, a second lake can be reached a little less than 1km beyond.",
    "directions": "From Radium take Forster Frntg Rd at the flashing 4-way until it turns to dirt road, turn left at Horsethief FSR (which is a high-traffic logging road -be careful!). Shortly after the bridge, stay straight at the first junction. 9km in you'll arrive at a large 4-way, continue straight. After the 13km mark, stay right at the next jct. Continue straight after the Forster Watershed sign and then stay left at the next option. There are, of course, other spurs, but remain on what is clearly the main road at all options.\rAt exactly the 36km mark there is a spur rd to the left - take it. You can drive the ~2km road to the trailhead, but there are some sketchy sections of narrow, steep road with largish rocks... just when you think it's getting really bad, it flattens out and is lovely right to the parking area. If you have a low-clearance vehicle, there is a parking pull-out about 200m along.\r\r\rUp until the Forster Watershed, the road is wide and smooth and fast going, afterward it is still in great shape, but may require some clearance, has several wet spots, and has been chewed into strange shapes by ATVs.",
    "geohash": "c",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/10244/reg_welsch-rd-dogs-1287.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10244/reg_welsh-lake-blue-1287.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10244/reg_welsh-lake-rock-1287.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10244/reg_welsh-scree-1287.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/welsh-lakes-near-radium-hot-springs-bc-10244",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 5,
        "Time": "3 hrs",
        "Total Distance": "9 km",
        "Town": "Radium Hot Springs, BC",
        "Type": "out-and-back"
    },
    "title": "Welsh Lakes",
    "trail_id": "10244"
}