{
    "description": "Another great hike into a seldom visited gorge near Londonderry, NS. There are about 6-7 main waterfalls to see on this hike and numerous smaller waterfalls and rapids to see as well. There are no marked trails on this hike and you will need to bushwack your way to see these hidden gems. Walking down the main logging road, I turned to my left (at 45.507243°, -63.610239°) and into a clearing that had been logged a few years ago. Luckily, there is still some large sections in the logged area that are covered by tall grasses and only a few evergreen trees evenly spaced apart. This section is quite easy to walk through considering it has been logged recently. After only a few minutes, you should enter the mature leafy forest located next to the logged area. Immediately in front of you is the ravine that has been carved by an unnamed brook. I chose to call it Benoit Brook to help out in the narrative and on my picture posts in Google Earth. Following Benoit's Brook downstream you will see 4 good size waterfalls within about 100m from each other. The first is a twin waterfall where a large rocky outcrop separates the brook into two cascades. Immediately downstream is a true fall with a drop of about 25ft or so. The third fall and fourth falls are pretty spectacular as well. The terrain around the falls is extremely steep so watch your footing. Below the fourth fall is the main river that you will follow downstream; Rockland Brook.\nFollowing Rockland Brook downstream, you will need to either go back up the ravine slope or sometimes skip across the river to make your way around large rocky outcrop that jut out into Rockland Brook. After seeing a few rapids and 3-4ft high falls, you will finally enter the upper gorge of Rockland Brook (I have put in another post on waterfalls located lower on Rockland Brook). This gorge starts with the highest of three waterfalls. This first fall (most upstream) is approximately 20ft and plunges into a large and deep pool. I made my way into the gorge by dropping on the right side of the river and fall (looking upstream). The other side of the fall is composed by a high rock cliff and it would be hard to take a good picture of the fall by going that way. Just downstream of the main waterfall was a small stream that had a small waterfall flowing into the gorge on the eastern wall. I made my way over this small stream and then jumped across Rockland Brook. Now on the western side of the brook, I climbed back up into the forest to be able to go around the second fall. The second fall is about 10 ft tall and it is really hard to get right to the front of it. Once you have seen this second fall, carefully make your way down to the water's edge and boulder yourself to the large rocks sitting downstream of the second fall. The third fall are spilt into two or three different stream that drop about 5-6ft. There is also a large hole created in the rock cliff just below the fall on the western side of the brook. I decided to go back to my car by going up the ravine at the third fall location. The ascent is steep but easy in the sense that the trees are widely distributed apart. However once you make it to the top of the gorge, the area has been logged lately. The trees have grown very very close to each other and it makes travelling extremely slow. You eventually make it out to a logging road and you follow it back to your car.",
    "directions": "In Londonderry, turn on Westchester Rd and then turn right on a smaller dirt road at 45.487246°, -63.611724°. Follow this unnamed road to a turn off at ; 45.509254°, -63.617539°. I parked my car at a Y intersection located 45.508168°, -63.611606° and walked to the south from there.",
    "geohash": "f84fb",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/10240/reg_2011-08-19-028-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10240/reg_2011-08-19-009-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10240/reg_2011-08-19-014-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10240/reg_2011-08-19-016-1-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10240/reg_2011-08-19-037-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10240/reg_2011-08-19-039-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10240/reg_2011-08-19-048-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10240/reg_2011-08-19-060-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10240/reg_2011-08-19-066-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10240/reg_PA260099-49385.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10240/reg_PA260116-49385.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10240/narrow_2011-08-19-065-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/benoits-falls-near-truro-ns-10240",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 5,
        "Time": "2 hrs",
        "Total Distance": "5 km",
        "Town": "Truro, NS",
        "Type": "out-and-back"
    },
    "title": "Benoit's Falls",
    "trail_id": "10240"
}