{
    "description": "Admiral Lake Loop is wilderness trail located off the Musquodoboit Trailway in Musquodoboit Harbour, about 45 minutes outside Halifax. It is a challenging hike that combines a strenuous workout with rewarding panoramic views of Admiral Lake and the surrounding area. \r\rThere are two trail heads for Admiral Lake Loop along the Musquodoboit Trailway, at approximately 1.8 and 2.7 km from the parking lot. Both have signage with a large trail map. If you take the second, farthest trail head, you will pass by Bayer Lake and a covered picnic area with bike rack, and will find an outhouse and bench at the trail head. Biking in to one of the trail heads is a great way to quickly complete the Trailway section at the start and end of your hike while still enjoying the beautiful scenery along this part of the Trans Canada Trail. \r\rOnce you head into the forest from the Trailway and start the Admiral Lake Loop, you'll encounter numerous steep climbs, rugged terrain including narrow forest paths and rocky areas, frequent large granite boulders, and four stunning lookouts (five if you add a side trip up to Skull Rock). The hike is tiring and demands careful footwork and good preparation - wear solid sneakers or hiking boots and bring plenty of water and a snack. We completed this trail in August 2011, and found some sections to be grown in with low-level bushes and ferns -  long pants were helpful to avoid scratches. Insect repellent will come in handy, particularly for the forested sections that come with rather persistent mosquitos. \r\rWhile the trail is rarely easy going, the ascents and descents tend to balance each other off and there are few sections where you can catch your breath on more level and obstacle free ground. The trail also offers several opportunities for rest stops and photo breaks, from Eunice Lake, which you'll pass directly by, to the high, open areas at the various lookouts. Many of the views you will experience would be particularly impressive in the Fall when the leaves are changing colour - much of what you will see is the surrounding forested area, with the water views being more distant. \r\rNear the end of the loop by the first trail head, you'll find a sign for Skull Rock. The side trail of approximately 0.5km return will take you up a steep incline to a lookout with lake views below. You can see the Skull Rock lookout high above you when coming in on the Trailway. \r\rBe advised that unless you are an expert hiker, the 5.5 km distance is deceptive. Expect a slower than normal hiking pace and leave yourself 2.5-3 hours, not including breaks, to complete the trail and return to the Trailway, where you will have another (though much easier) walk back to the parking lot.",
    "directions": "From Dartmouth or the McKay bridge, take Highway 107 east, then Highway 7 to Musquodoboit Harbour. You'll pass the Twin Oaks Memorial Hospital. Turn left onto Highway 357 just after passing the Musquodoboit Harbour Railway Museum and Visitor Information Center, then turn right at the trail sign shortly after. You'll find a large parking lot on the left a short distance in. Note there is a second parking lot at the opposite end of the Trailway, approximately 15km down the road. From there you can access other trails such as Gibraltar Rock Loop, but would be quite a distance from the start of Admiral Lake Loop.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/10255/long_AdmiralLake-AdmLakeLookoff-37129.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10255/long_AdmiralLake-EuniceLack-37129.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10255/long_AdmiralLake-Jessies-37129.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10255/long_AdmiralLake-RocksRoots-37129.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10255/long_AdmiralLake-TrailSample-37129.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10255/reg_AdmiralLake-BigGranite-37129.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10255/reg_AdmiralLake-CaveSign-37129.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10255/reg_AdmiralLake-HarbourLookoff-37129.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10255/reg_AdmiralLake-Map-37129.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10255/reg_AdmiralLake-RollingStone-37129.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10255/reg_AdmiralLake-SkullAbove-37129.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10255/reg_AdmiralLake-SkullRockSign-37129.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10255/reg_AdmiralLake-Stairs-37129.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10255/reg_AdmiralLake-StartMusTrailwa-37129.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10255/reg_AdmiralLake-TrailheadBench-37129.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10255/reg_DSC-0003-48348.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10255/reg_DSC-0114-48348.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10255/reg_DSC-0156-48348.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10255/narrow_AdmiralLake-CaveRocks-37129.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/admiral-lake-loop-near-halifax-ns-10255",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "6 km",
        "Town": "Halifax, NS",
        "Type": "out-and-back"
    },
    "title": "Admiral Lake Loop",
    "trail_id": "10255"
}