{
    "description": "This is a hike for the truly adventurous.  The terrain is extremely steep and the location is one of the most remote in Nova Scotia.  The reward of this hike is the highest waterfall in Nova Scotia.  Although I believed for years that the highest fall was one the east branch of the North River, the waterfall on Rocky Brook is significantly taller (but has less volume of water).  You can actually see the fall on Google Earth (long white streak).Do not try to follow the stream as it crosses the dirt road.  The stream gets tangled up in a very large alder patch which will be very difficult to traverse.  Instead just go up on the ridge on the south side of the brook. Heading into the woods on the south side of the brook, you traverse the typical forest of the highland plateau.  Trees are widely spaced apart which makes traveling fairly easy.  There is a mixture of hardwoods and evergreen trees and the forest floor is littered by ferns and other shrubbery.  Lots of moose tracks and droppings.  Within about 800m you come out to the edge of the ravine created by Rocky Brook.  There are very straight and tall rock walls on either side of the fall so proceed on a southerly route a little past the fall.  At some point, you will need to start your descent into this gorge.  The ground is very slippery and treacherous.  There are some small cliff sections throughout the forest to navigate around.  There are enough trees to hold on to help you on your way.  I made it down to an area where a large apron of rock juts out towards the fall.  This is a very good vantage point.  It sits about 2/3 of the way down the fall and you can see the whole length of the fall.  Someone hs previously estimated the length of the fall to be over 300ft.  The reason I think its not names the highest waterfall of NS is that it is cut into three main portions (see picts).This was not a place where I could proceed down any further as it was straight down rock walls to the bottom of the gorge.  To make it down all the way to the base of the fall, I suggest to look at the track on this post, and proceed a little more south than I did to see if a better way to come down exists.",
    "directions": "Cabot Trail in St Joseph du Moine (near Cheticamp), turn on Pembroke Lake Rd (or Grand Etang Rd) and go up the highlands.  After Pembroke Lake turn left at the major Y intersection.  The road will go down a wide valley and go back up on the other side.  The worst part of this road is in this valley especially when you are going back up to the highland.  A 4x4 is your only option or your mountain bike.  Park approximately at 5155749.03 m N, 661700.88 m E.  The brook in front of you crossing the road is Rocky Brook and the fall is located about 1km from your car.  The bridge is out over that brook as of August 2011.",
    "geohash": "f8k8w",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/10270/narrow_DSC-0179-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10270/narrow_DSC-0180-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10270/narrow_DSC-0181-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/rocky-brook-highest-waterfall-in-ns-near-cheticamp-ns-10270",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 5,
        "Time": "2 hrs",
        "Total Distance": "3 km",
        "Town": "Cheticamp, NS",
        "Type": "out-and-back"
    },
    "title": "Rocky Brook (Highest Waterfall in NS)",
    "trail_id": "10270"
}