{
    "description": "\rAnother great hike to discover a seldom seen 100ft+ fall is located close to the ?highest waterfall? trail I posted previously.  The  bonus of this hike is that it is relatively easy to get to the bottom of the ravine to see the fall in its entirety.  \r\rThe walk to the fall begins higher up on the plateau instead of close to the brook.  Walking by the brook is too hard because of the alders and there is no way for you to get down to the base of the fall from the top of the waterfall since there are huge cliff walls on either side of the fall.  Instead just walk on the edge of the (western side) ravine created by the brook.  Walking is fairly easy as the trees are widely spread apart and the ground is mostly covered by ferns.   \r\rAfter only about 500m, you will arrive near the top of the fall, proceed to the west a little bit more until the forest on the slope of the ravine opens up to a mature deciduous forest.  If you try to cut to early to the slope, the forest will be thick with small evergreen that are hard to traverse.  Once on the slope of the gorge, proceed carefully down the slope.  It?s a steep slope but not too bad top go down.  There are lots of trees to hold on to.  Once at the brook?s edge, you can proceed downstream to see a couple of minor falls or proceed upstream to see the 100ft+ beauty.  Just below the main fall is a small gorge that you need to circumvent.  I went up the western side of the brook to go above the narrow gorge.  There is ample space below the main fall that you could potentially put up a tent if you move a couple of rocks.\r\r",
    "directions": "Cabot Trail in St Joseph du Moine (near Cheticamp), turn on Pembroke Lake Rd and go up the highlands.  After Pembroke Lake turn left at the major Y intersection.  The road will go down a wide valley and go back up on the other side.  The worst part of this road is in this valley especially when you are going back up to the highland.  A 4x4 is your only option or your mountain bike.  Park approximately at 5152805.47 m N, 659429.01 m E.  \r",
    "geohash": "f8k8td",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/10271/narrow_DSC-0199-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10271/reg_DSC-0185-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10271/narrow_DSC-0189-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10271/narrow_DSC-0194-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/turner-brook-fall-near-cheticamp-ns-10271",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 5,
        "Time": "1 hrs",
        "Total Distance": "3 km",
        "Town": "Cheticamp, NS",
        "Type": "out-and-back"
    },
    "title": "Turner Brook Fall",
    "trail_id": "10271"
}