{
    "description": "I?ve spent my fair share of hiking time bushwacking to the numerous waterfalls around Londonderry.  This short hike will instead take you to an old iron mine adit located just a few minutes off of a dirt road.  I consider this hike highly suitable for children.\nBecause I didn?t know where the adit was located, I entered the forest where a stream crosses.  I bushwacked my way up by the stream and eventuially saw what looked like a road to my right (see GPS track).  As I climbed the steep bank, I saw the road.  This road is in good shape and you could definitely shorten the trip by taking your car closer.  Anyways, after only a minute on this road, I could see a sharp turn to the left that was overgrown.  Following this overgrown track, I could see some signs that people had used this trail in the summer.\nYou come up after maybe 150m to a flatish area that extends to your right.  You may also notice how a small path has been beaten back by foot traffic.  The forest in these parts is a mixture of immature hardwood and evergreen.  There are multiple adits in these parts but I only found one where you can actually still enter.  It?s located to the right of the flatish area, immediately next to a large rocky outcrop.  The entrance might be 6ft by 6ft and as you go inside it gets refreshingly cooler.  I went in only about 10-15ft.  There is a lot of water left standing in the adit.",
    "directions": "In Londonderry, turn right on Upper Road Branch",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/10283/reg_DSC-0227-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10283/reg_DSC-0228-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10283/reg_DSC-0232-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/martin-brook-adit-near-truro-ns-10283",
    "stats": {
        "Activities": "snowshoe hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "2 km",
        "Town": "Truro, NS",
        "Type": "out-and-back"
    },
    "title": "Martin Brook Adit",
    "trail_id": "10283"
}