{
    "description": "This is a very unique area to visit that is located close to Halifax.  A stream has carved a smallish gorge into limestone rock.  There are multiple caves located throughout the gorge with one that is particularly large.  \nI had seen a picture of this cave but had no location except that they had called it Dollar Lake cave.  According to topos in Nova Scotia, there are only two Dollar Lakes.  I pulled some geological mapping and found that one of the stream draining the Dollar Lake (the one in the provincial park) was lined by limestone for about 700m on each side of the stream.  \nI parked by the bridge over the Dollar Lake stream I had highlighted in my map searches.  I had high hopes at that point because I could see that on the side of the road were large limestone boulders.  I went through some thick and very dusty alders by the side of the stream.  Immediately I noticed a well worn path through the forest which usually means that this area is well known by locals.\nThe trail winds its way from the side of the stream to high up on the slopes and through a mature evergreen forest.  The canopy is fully grown over your head and the forest is dark by the lack of light.  Immediately, you will notice some large cliffs with some smallish space carved out at their base?.this is not the main cave.   After just a few minutes, you will follow the trail back down to the side of the stream on a fairly steep slope.  Go down to the side of the stream early since the cave is located in such a way that you can only access it downstream or by going a few hundred feet more upstream and tracking back.\nI noticed a somewhat large opening of about 5ft and thought maybe this was the cave.  It was full of water and as I shined a light inside I could see it ended in about 10ft.  Hugging the cliff wall, I then felt a very cool draft on my skin?.Sweeeeeeeeeeeeet this indicated the entrance to a cave.  Surely enough, you round the corner and there it was.  The opening is at least 6-7ft tall but strangely large?maybe 25ft.  Inside there is basically two levels.  One you can stand in and the other you need to crouch down.  The cave is approximaley 30-40ft deep.  At the back end on the right there is another tunnel that leads to outside of the cave.\nIn front of the cave is a very cool rock formation.  Imagine an inverted toblerone piece about 7ft tall.  It?s wedged in front of the cave entrance between two rock cliffs.  You can easily pass by the opening that left on its side and the tip of the inverted toblerone doesn?t even touch the ground!  From then on, you can follow the stream up for a while and have a look at the other small cave being created by the water.  There are also three waterfalls of about 6-10ft located upstream.",
    "directions": "Highway 212 to Dollar Lake Provincial Park.",
    "geohash": "dxfzxv",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/10282/reg_DSC-0299-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10282/reg_DSC-0302-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10282/reg_DSC-0308-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10282/reg_DSC-0327-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10282/reg_DSC-0331-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10282/reg_DSC-0341-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10282/narrow_DSC-0325-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10282/narrow_DSCF9547-40974.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/dollar-lake-cave-near-halifax-ns-10282",
    "stats": {
        "Activities": "snowshoe hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 5,
        "Time": "1 hrs",
        "Total Distance": "3 km",
        "Town": "Halifax, NS",
        "Type": "out-and-back"
    },
    "title": "Dollar Lake Cave",
    "trail_id": "10282"
}