{
    "description": "This is truly one of Nova Scotia?s hidden gem.  There is technically no hiking to get to this site but once there, you will be amazed by the viewpoints over the Highlands and the northeast Margaree River Valley.  I?ve heard of people using the cliffs around Cape Clear for rock climbing.  Some of the cliffs around Cape Clear are probably over 300ft.  Cape Clear is designated as a protected wilderness area.\r\rJust before the end of the road, there is a small access trail to the side of Cape Clear.  Someone even built a small wooden barrier.  It?s a proper thing too, because if you crash though that barrier it?s at least a 200ft fall to the valley below.  Towards the cul de sac of the road, there are many tracks that lead you to the tip of Cape Clear.  Cape Clear is formed by large granitic outcrops which are largely devoided of vegetation.  This affords you a most spectacular view towards the Margaree Valley, the sugarloaf and the highlands in general.  There are multiple short trails in and around the little shrubbery that lives in the crevasses between the rocky outcrops. Be careful, there are numerous steep cliffs all around the Cape.   I?ve put up a video since that medium does this place more justice.\r\r",
    "directions": "Near Lower Middle river take the Highlands Rd (also known as Crowdis Mtn Rd) and follow it for a long while until a secondary roads turns to the left.  Turn left at 5146968.50 m N, 669636.73 m E and follow this secondary road until you turn right again at 5149161.72 m N, 664198.70 m E.  There are some signs for Cape Clear but look at a map before heading out or better yet bring some topos or GPS.  Cape Clear is approximately at 5148595.85 m N, 662034.51 m E.\r",
    "geohash": "f8k8q",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/10281/reg_DSC-0155-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10281/reg_DSC-0156-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10281/reg_DSC-0158-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10281/reg_DSC-0171-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10281/reg_DSC-0174-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10281/narrow_DSC-0165-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/cape-clear-near-cheticamp-ns-10281",
    "stats": {
        "Activities": "climb hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 5,
        "Time": "1 hrs",
        "Total Distance": "1 km",
        "Town": "Cheticamp, NS",
        "Type": "out-and-back"
    },
    "title": "Cape Clear",
    "trail_id": "10281"
}