{
    "description": "There is a deep adit located about 100m from a dirt road in the community of New Lairg, Nova Scotia.\r\rFrom the dirt road, you cannot seen any evidence of the mine workings that use to occur in the hillside beside you.  However there are multiple adits and at least on shaft located in this hillside.  Most of them have been infilled but there is still one that completely open and you can walk inside for a good 15m.\r\rClimb the small scree slope and you will immediately come to an adit that has been infilled but for two small openings used for bats to hibernate.  The open adit is a bit more uphill.  If you look closely to the ground, you should be able to pick up a faint trail that leads you to the open adit.  The hillside is covered by evergreen trees of which a few have been blown down in recent years.  There is even a large tree that has partially blocked the front of the entrance of the adit and basically hides it from plain view.  You can see the amount of effort it took to chisel out this adit when you walk inside.  The air inside is refreshingly cool in the summer time heat.\r\r",
    "directions": "Highway 289 from New Glasgow towards Brookfield.  Turn right on Lairg Rd.  Park approximately at 5034019.02 m N, 514225.23 m E.  The adits are located on the hillside on your right.\r",
    "geohash": "f856de9",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/10287/reg_DSC-0269-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10287/reg_DSC-0272-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10287/reg_DSC-0273-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10287/reg_DSC-0275-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/new-lairg-adit-near-new-glasgow-ns-10287",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "1 km",
        "Town": "New Glasgow, NS",
        "Type": "out-and-back"
    },
    "title": "New Lairg adit",
    "trail_id": "10287"
}