{
    "description": "Nice short trail leads under the forest, then the side of the lake to reach Tenquille Cabin. \nIt goes about 100m on old logging road and soon becomes a nice foot trail.  It is a fast trail that goes beneath some BC Interior alpine old growth forest.  Windfalls were cleared neatly as of Sep 2011.  The incline is fairly gentle and soon reaches the lake.  Along the lake this scenic trail goes along the shore of the lake till arches the Tenquille Cabin.",
    "directions": "From Vancouver, past Pemberton, go STRAIGHT AT at Mt Currie intersection instead of to the right, then in 17km from the reserve you will TURN OFF LEFT TO OLD PORTAGE RD. Immediately past BC rail crossing, there is a Birkenhead FSR sign. Within 1k, TURN LEFT again here.\nThe road goes uphill steep very soon. There are small branchouts but stay in main road till past 17k or so. Then you see a fork. Main road goes down towards Tenqhille Creek. Keep going straight here(FORK LEFT) to this small road(Tenquille branch). You are already in the high country with beautiful mtns on both sides of Tenquille Valley. \nAs of Sep 2011; From here there are waterbars, creek crossing and occasional Willow/Cottonwood/Alder overgrown sections for about 6k till the trailhead. \nBut 80% of section especially latter half is well trimmed off. I thank you for those who is doing this. If you have a front wheel drive with high departure and approach angles with the skill, you can make it till the end. \nThis finak 6k section is rather flat, so if you don't have much to carry, you might select to bike or just run instead. Trailhead has about 10 car parking space.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/10296/reg_1trail-head-11896.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10296/reg_2-trail-starting-11896.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10296/reg_2trail-lakelong-11896.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10296/reg_DSCN1092-11896.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/tenquille-lake-near-pemberton-bc-10296",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "4 km",
        "Town": "Pemberton, BC",
        "Type": "out-and-back"
    },
    "title": "Tenquille Lake",
    "trail_id": "10296"
}