{
    "description": "One of the best kept secrets of Wells Grey Park. You can actually walk behind these falls which are created as Grouse Creek plummets 35m into the canyon below.  There is a thin slippery trail that leads you behind the falls and ends in a spectacular cave made by the erosion of the lava rock that is the basic make up of the canyon.  \nThe trail is a fairly well kept descent, with some rather steep sections but would be easy enough for even the beginner hiker. There is also a rugged stair case to help hikers through the steepest part. The pool of water at the base of the falls would be lovely to swim in on a hot day. \nGoing behind the falls is also a great way to cool off, just keep in mind that the beginning part of the hike back is a rather steep up hill climb, not entirely pleasant in wet clothing\n*Note* Near the falls there is evidence of recent rock slides, and although it would be pretty in the spring, the locals say the Creek is too high to be able to go behind the falls.",
    "directions": "The trail head is at km 20.5 on Clearwater Valley Road and is clearly posted.The first part of the trail is an abandoned road. \nApprox 30 min into the hike there is a sign on the right pointing to a thin trail through the forest of birch and pine. \nThe property to either side of the trail is privately owned land, so it is best to keep solely to the path and not go wandering off through the woods.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/10294/reg_IMG-6633sm-37359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10294/reg_IMG-6634sm-37359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10294/reg_IMG-6648sm-37359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10294/narrow_IMG-6606sm-37359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10294/narrow_IMG-6623sm-37359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10294/narrow_IMG-6645sm-37359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10294/narrow_IMG-6653sm-37359.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/moul-falls-near-clearwater-bc-10294",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "5 km",
        "Town": "Clearwater, BC",
        "Type": "out-and-back"
    },
    "title": "Moul Falls",
    "trail_id": "10294"
}