{
    "description": "A steep, rough trail up to a great viewpoint at the top of Anvil Island.\r\rOn September 11, 2011, I took a group of 12 seniors on a water taxi to Anvil Island (I had been here before on September 11, 2001, so it was a 10th anniversary hike for me).  Everyone enjoyed the day, although a common comment was \"I bet the author of the description in '103 Hikes' had never been here\".  \r\rThe reason is that the hike is considerably more difficult than the 5 hours he or she described in the popular hiking book.  The terrain is indeed steep, with rocks, roots and slippery sections to contend with.  There are ropes to assist you on the worst sections, but mysteriously, the rope was missing in the hardest section near the top.  Also, the vertical rise is more like 900 meters, as there are a few \"downs\" during the way up.  So be warned!\r\rHaving said that, the hike definitely has its rewards.  After a fine boat ride from Lions Bay, you walk through the bible camp along with grazing deer.  After an hour and a quarter, you take a short detour to the \"White Spot\".  No hamburgers here, but a wonderful view over Gambier Island and Howe Sound.\r\rAnother hour gets you to a small lake at 620 meters - very pretty with its water lilies, but too shallow to swim.  You will likely be hot after the stiff climb!  Then a small uphill to a knoll, then 70 m down into the saddle before starting to climb to the main peak.\r\rThe final climb leads you through a ravine to the west of the main peak, around to its north side, then up a steep, rocky section to the top of Leading Peak at 760 m.  While there was nothing but rock on top in 2001, now we have a heli pad, solar cells and a communications tower.  They do not detract appreciably from the wonderful 360 degree views, and the heli pad is a convenient place to sit for lunch.\r\rI suggest returning to the bible camp the way you came, but some people take a very steep trail from the saddle to the east shore of the island.  The water taxi can be persuaded to pick you up at one of the beaches there. \r",
    "directions": "A water taxi is needed to get to the Bible Camp at the south end of the island.  We used Cormorant Marine, 604-250-2630, who charged $40 per person return.  It can leave from any of the wharves between Horseshoe Bay and Porteau Cove on Highway 99, and takes about 25 minutes.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/10305/reg_P1100397-521.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10305/reg_P1100399-521.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10305/reg_P1100404-521.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10305/reg_P1100407-521.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10305/reg_P1100409-521.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10305/reg_P1100410-521.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10305/reg_P1100411-521.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/leading-peak-anvil-island-near-vancouver-bc-10305",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 3,
        "Time": "7 hrs",
        "Total Distance": "9 km",
        "Town": "Vancouver, BC",
        "Type": "out-and-back"
    },
    "title": "Leading Peak, Anvil Island",
    "trail_id": "10305"
}