{
    "description": "Height: 1743 m (5719 ft) Prominence?: 478 m 48 km from Tumbler Ridge there is a road to the right.\n After nine km it crosses Honeymoon Creek, followed by a junction. Straight leads to a pleasant rustic campsite on Kinuseo Creek after one km. Left leads for a further eight km up the lower slopes of Mt Clifford. Stop just before the road is gated, and head up the old ditched road to the right (west). This climbs steadily, reaches an old gas pad site, and then climbs some more via an old exploration road. The ATV route onto Mt Clifford branches sharply off this to the left, and rises above the tree line. From the top of the ridge simply follow the ATV route west, along a succession of summits and ridges at or above the tree line. The views of the Rockies are magnificent, with Bone Mountain in the foreground and the Monkman and Bulley Glaciers in the distance. Below is the wide valley of Kinuseo Creek, the route of the Monkman Pass of the 1930s. Return the way you came.\nMt Clifford also provides a tough but rewarding mountain biking trip ? please stick to the trail in the alpine areas to avoid damage to the fragile tundra",
    "directions": "Height: 1743 m (5719 ft) Prominence?: 478 m \n48 km from Tumbler Ridge there is a road to the right.\n After nine km it crosses Honeymoon Creek, followed by a junction. Straight leads to a pleasant rustic campsite on Kinuseo Creek after one km. Left leads for a further eight km up the lower slopes of Mt Clifford. Stop just before the road is gated, and head up the old ditched road to the right (west). \nThis climbs steadily, reaches an old gas pad site, and then climbs some more via an old exploration road. The ATV route onto Mt Clifford branches sharply off this to the left, and rises above the tree line. From the top of the ridge simply follow the ATV route west, along a succession of summits and ridges at or above the tree line. The views of the Rockies are magnificent, with Bone Mountain in the foreground and the Monkman and Bulley Glaciers in the distance. Below is the wide valley of Kinuseo Creek, the route of the Monkman Pass of the 1930s. Return the way you came.\n Mt Clifford also provides a tough but rewarding mountain biking trip ? please stick to the trail in the alpine areas to avoid damage to the fragile tundra",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/10329/narrow_MT-CLIFFORD-11997.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mt-clifford-near-tumbler-ridge-bc-10329",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 3,
        "Time": "4 hrs",
        "Total Distance": "11 km",
        "Town": "Tumbler Ridge, BC",
        "Type": "out-and-back"
    },
    "title": "Mt. Clifford",
    "trail_id": "10329"
}