{
    "description": "This is one of the most spectacular hike to do in this province.  The terrain is difficult (butt not extreme) and the rewards are too numerous to count.  You will see some 6-7 large waterfalls as well as be rewarded by some of the higher viewpoints on the mainland (Cape Clear in Cape Breton being the highest).  Funny thing about this post is that I have been on numerous occasions at the base of the largest waterfall located on the East Moose river but I had never taken the time to explore the waterfalls located above this one (see posts on East Moose River and McCallum Gultch).\r\rI started off on a logging road and left my car where the vegetation had overgrown the road.  I followed this road for a little while as it descended a slop and turn to the right.  At some point, I headed into the wood to the left.  Right now you can easily travel through the recently planted forest but in a few years these evergreen trees will have grown together leaving little place for hiking.  After a short stint into the newly planted forest, I came about the old forest and immediately walked down a steep slope to the river?s edge below.\r\rAt first I wasn?t sure if I should head upstream or downstream.  I picked the winner by going downstream.  I was rewarded after a short hike to a nice 15ft two-tier waterfall that has carved a notch into solid granite.  I liked this fall but I was in for some larger surprises!  Only a few minutes later I came up to a three tier waterfall with the second waterfall being the tallest and prettiest of the three.  The second fall is a good 30ft and has a straight drop while the two others are ?sliders? type of falls.  Below the third fall, the water enters a canyon with straight rock walls on either side.  Near the Third waterfall, you will find a small path that takes you to a good viewpoint of all the falls.  \r\rA few minutes later?you guessed it! Another great waterfall!!!  This one is a two tier waterfall with the first fall being a good 60ft drop and the second one another 15ft.  You can easily approach these falls for pictures but the spray was overwhelming on the day UI was there.  It was at that point that I noticed a faint path by the side of the river.  There has been enough people visiting these sites that there is now an unofficial trail that leads you to the falls.\r\rContinuing downstream, I came upon another long slider kind of fall maybe 80ft long.  By the side of this fall, there is some flagging tape that will lead you out of the ravine and back to the logging roads.  I didn?t follow them to their conclusion as but I am sure they flagging tape route must take you out somewhere on the logging road.  Another few minutes walking by the stream?s edge, you come out to a fall that has carved a deep canyon and when the water exits this canyon, it enters the final waterfall which is the biggest fall of them all and that I have described in another post (east Moose River fall).  \r\r\r",
    "directions": "Highway 2 to Moose river and then turn on dirt rd at  45.419232°, -64.193286°.  Continue on dirt road as it climbs into the Cobequids.  Turn right at road intersection located at  45.455285°, -64.198222°.  Drive on this road until you see a small hill to your lweft that really stands out.  The lower part was logged but not the top.  Turn left on the dirt immediately after this small hill and park at; 45.450395°, -64.181391°\r",
    "geohash": "f846e",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/10338/reg_DSC-0020-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10338/reg_DSC-0010-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10338/reg_DSC-0012-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10338/reg_DSC-0037-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10338/narrow_DSC-0026-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10338/narrow_DSC-0035-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10338/narrow_DSC-0047-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/the-upper-falls-of-the-east-moose-river-near-parrsboro-ns-10338",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 5,
        "Time": "2 hrs",
        "Total Distance": "4 km",
        "Town": "Parrsboro, NS",
        "Type": "out-and-back"
    },
    "title": "The Upper Falls of the East Moose River",
    "trail_id": "10338"
}