{
    "description": "This hike into the Cobequid Mountains will lead you to a unique site; an old mine adit on the side of a cliff located on the Bass River of Five Islands.  \r\rSetting off from your car, you traverse an old blueberry field.  There are remnants of blueberry plants that I avoided trampling on but most of the fields are filled with tall grasses and some shrubs.  At the end of the field, you enter the forest and immediately drop down a steep incline of about 60ft.  The forest is quite easy to navigate as there are very little small trees to impede your way.  There are some large stands of evergreen trees and the forest floor is sometimes covered by a thick layer of bright green moss.\r\rAs you get close to the river?s edge, I suggest you try to find your way down to the water by going to the left (if facing the river).  I came down in a narrow ledge that had some trees to hold on but there is a gradual descent to the left (see the gps track).  At the river?s edge, make your way across using either waders in the early season or barefoot in the summer.  The river does not run deep in this section and may even run dry enough sometimes that you could cross using the boulders that were underwater at the time of my visit.  The river might be 25ft across at this point.  On the other side of the river, you will notice a large scree slope.  The adit is to the left of the scree about 20ft up from the river.  It?s approximately 20ft deep and you an easily enter it.  There was water on the floor at the time of my visit.  This is such a remote area to have a mine site that I wanted to share this unique spot with as many people as possible.\r",
    "directions": "\rHighway 2 to Five Islands.  Turn on New Brittain Rd and continue to approximately 45.442559°, -64.036224°.  Park and cross the blueberry field on your left.\r",
    "geohash": "f846w",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/10337/reg_DSC-0002-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10337/reg_DSC-0005-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10337/reg_DSC-0009-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/eureka-adit-near-parrsboro-ns-10337",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 5,
        "Time": "1 hrs",
        "Total Distance": "3 km",
        "Town": "Parrsboro, NS",
        "Type": "out-and-back"
    },
    "title": "Eureka Adit",
    "trail_id": "10337"
}