{
    "description": "Time and distance are for a return trip via the loop section.\nWestern Brook Pond fjord in Gros Morne National Park provides a dramatic setting for a boat tour. The Long Range Mountains, the northernmost extent of the Appalachians, contain numerous glacially-carved fjords. One of the most spectacular is the Park's largest lake, Western Brook Pond. This 16 km lake with a depth of 165m is home to Atlantic Salmon, Brook Trout and Arctic Char, as well as an unusual colony of cliff nesting gulls.\nThe trail crosses coastal bogs and low forested limestone ridges over gentle terrain and boardwalks. The view alone is worth the hike, even if you are not able to take the boat tour (price is $56/adult - 2011). There is a very large parking area at the trailhead, which indicates the popularity of the hike (partly) and the boat tours (mostly). In reality, the hiking trail is the only way to get to the pond and the boat tour, although I believe there may be a golf cart shuttle available for those unable to walk that far.\nAn interesting side trip (loop back to main trail) can be followed just west of the boat dock (signed). On this loop is the start of the the trail to Snug Harbour. Photo 12 shows the crossing point to Snug Harbour across Western Brook with the cable to assist you in high water times. \nThis is one of Gros Morne's premier hiking trails (by volume, at least). As such, there are plenty of interpretive signs along the trail and at the boat dock as well as a few benches for those who need them. Take the time to read the signs, there's a lot going on in the bogs that you might not be aware of. There are also plenty of lilies (in season) and the largest bog orchids I've ever seen.\nIf you do plan to take the boat tour, it's wise to purchase your tickets in Rocky Harbour before you go. Located at dockside, one can find a sheltered waiting area, indoor washroom facilities, canteen services, gift shop as well as several picnic areas.",
    "directions": "Trailhead is on Rte 430 about 27km north of Rocky Harbour. Lots of parking available.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NL/10333/reg_bw1-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10333/reg_bw10-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10333/reg_bw11-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10333/reg_bw12-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10333/reg_bw13-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10333/reg_bw2-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10333/reg_bw3-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10333/reg_bw4-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10333/reg_bw5-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10333/reg_bw6-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10333/reg_bw7-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10333/reg_bw8-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10333/narrow_bw14-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10333/narrow_bw15-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10333/narrow_bw16-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10333/narrow_bw9-7064.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/western-brook-pond-near-rocky-harbour-nf-10333",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "6 km",
        "Town": "Rocky Harbour, NF",
        "Type": "out-and-back"
    },
    "title": "Western Brook Pond",
    "trail_id": "10333"
}