{
    "description": "The Morell River is a narrow and occasionally fast running course that is famous for its fly fishing as well as its paddling. It's most common to let in at Leard's Pond (Leard's Mill) near Riverton unless the way is too choked by downed branches. (bring a folding saw and hip weighters!) The alternative is to let in at the bridge on highway 320, or take an afternoon, and scout it first.\nFor a quick fix, you can run the Morell to Indian Bridge Road, but if you want to have some \"post fast-water relaxing\", you can continue on to Morell proper. (the town) The terrain gets flatter and the water, more calm and open. This is a North flowing river that empties into Saint Peter's Bay, but one can always paddle from Morell and go upstream inthe wider calm portion.\nIn the Summer months, the water is pretty shallow upstream, so paddling is restricted to the north end. Keep the full run for the spring, or after heavy rains in the fall.\nShannon Burt\nEast Coast Editor",
    "directions": "Leard's Pond enterence: Drive to Mount Stewart, and take route 22 and cross the Hillsborough river bridge. take the first right (following route 22) to Peakes. Turn left and take Peake's Road (highway 320) The bridge is one of the let ins. If you want a bit more fast water from upstream, continue on the 320 and take the 355 to your right. Drive this section (veers right 90 degrees) and runs 4K then veers left. Look for a slippery when wet sign and a gravel road before it on the right.",
    "geohash": "f8",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/PE/10347/reg_morell-001-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/10347/reg_morell-002-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/10347/narrow_morell-003-6702.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/morell-river-near-morell-pe-10347",
    "stats": {
        "Activities": "river-kayak river-canoe",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "17 km",
        "Town": "Morell, PE",
        "Type": "out-and-back"
    },
    "title": "morell River",
    "trail_id": "10347"
}