{
    "description": "ENGLISH: (french follows)\r\nLooking for a quiet afternoon in the woods? This is a very nice trail located 15min from downtown montreal (if there is no traffic that is).\r\n\r\nThe trail is located in the Parc du Bois de L'ile Bizard which mission is to preserve a typical humid ecosystem. We are talking about marshes here so there is a lot of bugs in the summer.\r\n\r\nThis trail is for bird watchers. \r\nEspecially in spring and Fall as there is a 500m boardwalk that crosses a marsh! This plunges you right in the middle of a rich ecosystem with beavers, turtles, ducks and many more to observe.\r\n\r\nThe trail is more than easy as it's been designed to give access to wheelchairs but still it's worth the walk to breathe good air and to watch the autumn leaves!\r\n\r\nAnd at 15min from downtown, can who can afford not to go???\r\n\r\nFRENCH:\r\nVous recherchez un après-midi silencieux dans les bois?  Voici un joli petit sentier situé à  15min du centre ville de Montréal (s'il n'y a aucun trafic bien sur).  \r\n\r\nLe sentier est situé dans le Parc du Bois De L'ile Bizard qui a pour mission de préserver un écosystème humide typique de la région.  Nous parlons ici de marais ce qui fait qu'il y a beaucoup d'insectes l'été.\r\n\r\nCette sentier plaira tout beaucoup aux ornitologues. Particulièrement au printemps et l'automne puisqu'il offre, entres autres, un trottoir de 500m qui traverse un marais!  Ceci vous plonge droit au milieu d'un écosystème riche avec des castors, des tortues, des canards et beaucoup plus à observer.\r\n\r\nLe sentier est terriblement facile pour un marcheur aguerri puisqu'il a été concu pour donner accès aux fauteuils roulants mais il vaut tout de même la peine d'y aller ne serait-ce que pour respirer du bon air et y contempler les feuilles d'automne!\r\n\r\nEt à 15min du centre ville, pouvez vous vraiment ne pas y aller?",
    "directions": "ENGLISH:(french follows)\r\nFrom Montreal, take the 40 west exit boulevard Saint-Jean. Go until boulevard Pierrefonds, turn left for 1,4 km until boulevard Jacques-Bizard, turn right and do 2,8 km until boulevard Chèvremont, turn left until you reach De l'église. Turn right on De l'église and roll until you reach chemin Bord du Lac, turn right and do 1km. Parc entrance is on your left.\r\n\r\nFRENCH:\r\nDe Montréal, prendre l'autoroute 40 Ouest, sortie boulevard Saint-Jean. Se rendre jusqu'au boulevard Pierrefonds, tourner à gauche et faire 1,4 km jusqu'au boulevard Jacques-Bizard, tourner à droite. Filer 2,8 km jusqu'au boulevard Chèvremont, tourner à gauche, rouler jusqu'à De l'église. Prendre De l'église à droite et filer jusqu'au chemin Bord du Lac, tourner à droite et faire un kilomètre. L'entrée du parc est à gauche, le marais est à droite au bout du sentier. Stationner dans le parc.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/QC/1034/reg_6421gif.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/1034/reg_best1_boardwalkjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/1034/narrow_forestjpg.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/bois-de-lile-bizard-near-montreal-pq-1034",
    "stats": {
        "Activities": "hike ski-xc mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "10 km",
        "Town": "Montreal, PQ",
        "Type": "out-and-back"
    },
    "title": "Bois de L'Ile Bizard",
    "trail_id": "1034"
}