{
    "description": "Along the Musquodoboit trailway, you can find numerous loops that take you to the top of the granitic ridges that run on the side of the old railway bed.  The shortest and more family friendly loop is the Bayers Lake Loop because it is only about 1.2km (plus the railway part).  We undertook this loop with a 3 and 6 year old and it went very well.\r\rSince we were hiking with the little ones, I parked at a secondary parking spot to shave off about 1km in total distance (it counts when you have small legs).  At first you follow the old railway bed for about 1.2km.  The scenery to your right are the granitic ridges similar to the ones you will be climbing later.  To the right, there is a small lake at the beginning, followed by evergreen forest.  After about 1.2km you will come up to a large trail sign and the beginning of a real wood trail to your right.   This trailhead is the beginning of both the Admiral Lake loop and the Bayers Lake loop.   Do not attempt the Admiral Lake loop with a 3 year old because you will be carrying him/her for most of the trail.\r\rWithin a few hundred metres from the trailhead, the trail splits in two.  Take the right hand side trail (Bayers Lake Loop Trail).  There is signage at this conjuncture to help you out.  From the trailhead to this point, you are more or less in an open area.  This used to be forested but I think the wind knocked down most of the trees and they were subsequently removed.  Immediately after turning on the Bayers Lake Loop, the climbing begins.  There are a few steep parts but overall nothing too scary or difficult.  The trail alternated between running on the forest ground or on hard granite.  After only a few minutes effort, you come out to the best view of this loop.  This area is a wide granite ridge that has been fenced off at the edge.  It affords a nice view point to Bayers Lake as well.\r\rGetting back to the trail, there are some small up and downs to negotiate in the evergreen forest.  Moss covers a good portion of the forerst floor and the rest ios covered by small bush usually Labrador Tea.  The contrast in colors are fantastic.  At the end of the loop, you will descend back to the old railroad trail.  There is a small cave like feature at the middle point of your descent on your left.  A small wooden bride finishes the trail and gets you back to the old railroad trailway.  Hiking back to the starting point, you will see on your left a large rocky cliff where giant boulders have fallen off to a small ravine.  Right after that section, there is another cave like structure for the kids to explore on the left hand side.\r\r",
    "directions": "Highway 107 to Musquodoboit Harbour.  Turn left on highway  357 towards Middle Musquodoboit.  Turn right on Bayers Mill Rd, cross the bridge and park at the end of the road (4960453.76 m N, 488115.02 m E).\r",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/10356/reg_DSC-0006-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10356/reg_DSC-0007-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10356/reg_DSC-0014-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10356/reg_DSC-0033-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10356/reg_DSC-0034-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10356/reg_DSC-0035-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10356/reg_DSC-0047-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10356/narrow_DSC-0009-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10356/narrow_DSC-0065-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/bayers-lake-loop-near-halifax-ns-10356",
    "stats": {
        "Activities": "hike snowshoe",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "5 km",
        "Town": "Halifax, NS",
        "Type": "out-and-back"
    },
    "title": "Bayers Lake Loop",
    "trail_id": "10356"
}