{
    "description": "A trail approx 12 kms return through mainly deciduous trees (Big Leaf Maples and Alder) in the Fraser Valley.Has some fairly steep and slippery sections in the first 2 or so kms to the view point which has fantastic views of the Fraser Valley and Cascade Mtns to the east and south. Continue on through the forest, eventually arrive at an old logging road, go west approx 1/2 km, turn right at the fork in the road and keep going up the trail.Because we did this late November 2011, had snow on the trail (beautiful). A few of us had Yaktrax, the others slipped and slid. Good shoulder season hike, apparently snow free most of the winter.Didn't quite make it to the summit due to early sunset and fear of being caught in the dark.A good trail, good workout. Tim Hortons at Whatcom Road (exit 95) has ice cream for a treat in the summer (coffee year round of course).",
    "directions": "Hwy #1, take the Whatcom Road exit, (Exit 95), and cross over the Highway going north. Go east after turn right at the Strip Mall on North Parallel Road. It is now Eldridge Road as it starts to bend. There will be 1 more intersection, turn right onto Atkinson Road and then cross over a bridge. Atkinson Road changes back into North Parallel Road as it bends. Still going east ward on Parallel you will see McDermott Road. Turn left on McDermott. McDermott Road will change to Lakemont Lodge Road just before crossing over another bridge. Follow it as it turns to the right and soon you will drive beside a  fence for the Gun Club on your left. Just past the end of the fence is a open pit. Park on the east side of it and the trail goes up that side of the pit.(Eastern Approach) From the East on Highway #1 take No.3 Road exit, (Exit 104), and turn right onto No.3 Road and in a short distance turn left onto North Parallel Road going west. Follow it to No. 4 Road and turn right. Follow No. 4 Road and turn right onto Lakemont Lodge Road. It goes over a bridge, then go right heading east ward after the bridge and soon you will drive beside a fence for the Gun Club on your left. Rest is as per above.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/10355/reg_IMG618-46010.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10355/reg_IMG619-46010.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10355/reg_TaggartP1010618-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10355/reg_TaggartP1010627-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10355/reg_TaggartP1010633-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10355/reg_TaggartP1010644-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10355/reg_TaggartP1010646-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10355/narrow_IMG605-20min-rest-rock-46010.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10355/narrow_IMG606-40min-up-46010.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10355/narrow_IMG607-60min-lookout-46010.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10355/narrow_TaggartP1010588-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10355/narrow_TaggartP1010656-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10355/narrow_TaggartP1010686-7359.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/taggart-peak-glen-ryder-trail-near-abbotsford-bc-10355",
    "stats": {
        "Activities": "snowshoe hike",
        "From": "",
        "Seasons": "winter summer",
        "Stars": 4,
        "Time": "6 hrs",
        "Total Distance": "12 km",
        "Town": "Abbotsford, BC",
        "Type": "out-and-back"
    },
    "title": "Taggart Peak (Glen Ryder Trail)",
    "trail_id": "10355"
}