{
    "description": "In the Cobequid Hills near Earltown, Nova Scotia, a fantastic set of trails have recently been constructed to showcase the beauty of the Acadian Forest.  There are two major loops and at least 3 major spur trails in this system.  \r\rFrom the dirt road, I followed the wide gravel road down the hill.  This first part is kind of boring but a necessary evil to access the trails on the other side of the Salmon River.  At the time of my hike, water in the river was flowing over the top of the culverts and had to carefully make my way across 4-5inches of water.  Immediately after crossing the bridge, you will see a sign on your right. Take this side trail.  This is one of the loops and it?s called the Sandy Cope Trail.  This trail will lead you to a massive waterfall on Whites Brook.  But because I have seen this waterfall before by bushwacking in previous years, I only took a small portion of this trail.  At the first Y intersection, I turned to the right and followed a nicely built boardwalk over some wet spots.  I followed part of the Sandy Cope Trail until a spur trail appeared on my right.  If you travel on the Sandy Cope Trail just a bit further you will see Donald?s Fall.  I then retraced my steps and took the spur trail (Wllard Kitchener MacDonald Trail).  At the end of the spur trail begins the large loop called the Gully Lake trail and it?s about 10km.\r\rThe spur trail crosses the main road that you took at first.  It reappears across this dirt road and continues into the forest towards Gully Brook and ultimately Gully Lake.  What a beautiful trail, the ground is fairly soft, rocks are not that common in the trail and the scenery is mesmerizing.  The mature hardwood forest that you hike through has a high canopy and not that many small trees or shrubs.  Because of this, you are left to see quite a ways in distance over the rolling feature of the terrain.  Mostly you will be going uphill but certainly not at a high elevation rate.  Once the trail starts to descend it means you are very close to the Gully brook.  Where the trail crosses the brook, a nice waterfall cascades down a steep rock wall.  Across the brook, the trail branches off in two.\r\rI decided to continue upstream of the Gully Brook.  There is a smaller fall within a few minutes after you cross the Gully Brook.  Afterwards it mainly flatish until you get to the Gully Lake.  At this time there is a spur trail on your right to take you back to the major dirt road you travelled on in the first place.  Continuing on to the right instead, you fiollow the edge of the lake for maybe 200m and then renter the dense forest.  This time, you are going up for a while before again descending back to another brook.  Once you get to the other brook, there is small bridge that leads to a spur trail (Juniper Head Trail) that eventually get to an alternative parking spot for this trail system.  Instead, I followed the main trail as it hugs the side of the valley where the brook flows downstream to meet the Salmon River.  Again I had to marvel at all the hard work that was put into the trail building.\r\rOnce you come down the Gully Lake Hills and are back close to the Salmon River the trail becomes wider in some sections since you are on an old logging road.  After a while the trail leaves the old logging road and cuts across back to the biggest fall on Gully Brook and where the trails crosses Gully Brook.  After crossing the brook and instead of getting back on the spur trail I took to get there at first, I decided to follow the old logging road as it follows the side of the Gully Lake Brook ravine.  Once I got down to the level where the brook almost meets the Salmon River, I continued following the old logging road eventually back to the main dirt road almost to the point where the water was overflowing over the culvert.  All in all, this trip was about 21km and well worth it.  I had a blast, the trails are awesome, the forest is majestic.\r",
    "directions": "Drive to Earltown on highway 311.  Turn right on Kemptown Rd.  Park at 5042807.05 m N, 491084.43 m E",
    "geohash": "f85",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/10352/reg_008-38765.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10352/reg_012-38765.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10352/reg_015-38765.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10352/reg_016-38765.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10352/reg_DSC-0007-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10352/reg_DSC-0010-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10352/reg_DSC-0017-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10352/reg_DSC-0019-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10352/reg_DSC-0020-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10352/reg_DSC-0025-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10352/reg_DSC-0026-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10352/reg_overview-map-large-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10352/narrow_017-38765.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10352/narrow_DSC-0015-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10352/narrow_DSC-0018-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10352/narrow_DSC-0024-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/gully-lake-near-truro-ns-10352",
    "stats": {
        "Activities": "snowshoe hike ski-xc mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 5,
        "Time": "4 hrs",
        "Total Distance": "21 km",
        "Town": "Truro, NS",
        "Type": "out-and-back"
    },
    "title": "Gully Lake",
    "trail_id": "10352"
}