{
    "description": "These trails were developed for mountain bike downhill. The north part of the loop is Blindside and the south part of the loop and the trail that continues is 49er.\nBlindside is an easy hike. 49er is moderate hike due to a few steeper grades. I would assume the trails would be advanced for mountain biking.  The trails are mostly treed and there is not much of a view at the top. 49er is 2.9 km one way with 290 m of vertical. Blind side is a pretty flat trail that parallels below a forest service road and make a good option of a different route back.\nThe trail heads are a bit hard to find and the lower portion of 49er has a bunch of dead falls and it possible to take other old trails so a GPS is recommended. I found it sometime difficult in the snow to find the trail but the dog seemed to know. I would imagine it is much easier to navigate without the snow. 49er ends next to a forest service road so it is likely possible to drive to the top and mountain bike down.",
    "directions": "A bit of a warning. The forest service roads can be a bit confusing and various maps don't seem to be very accurate. Also, the trail heads are not marked so a GPS is recommended.\nIf starting from Nelson, take Granite Road off of Highway 6. After 6.5 km turn onto Bedford Road near the Kootenay River. Take Bedford Road for 2.3 km and turn right on Blewett Road. After 400 m turn left onto May Jenny Road. May Jenny Road turns into a forest service road.\nIf coming from Castlegar, turn right onto Blewett Road 2.6 km after the Slocan Valley junction. Travel 9.8 km and turn right onto May Jenny Road. May Jenny Road turns into a forest service road. \nI parked at an intersection of roads at km 2.1 from Blewett Road. The trail heads to 49er and Blindside are a bit further from here down different roads.\nThe trail heads between 49er and Blind side are connected by forest services roads as mapped there are a few different roads in this area so they might be hard to find. In addition the forest service road to 49er was blocked by a holiday trailer at the time of mapping so access was on foot.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/10354/reg_IMG-0830-34592.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10354/reg_IMG-0831-34592.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10354/reg_IMG-0832-34592.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10354/reg_IMG-0835-34592.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10354/reg_IMG-0839-34592.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10354/reg_IMG-0840-34592.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10354/reg_IMG-0842-34592.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10354/reg_IMG-0845-34592.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10354/reg_IMG-0847-34592.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10354/reg_IMG-0857-34592.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10354/reg_IMG-0858-34592.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10354/reg_IMG-0863-34592.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/49er-and-blindside-near-nelson-bc-10354",
    "stats": {
        "Activities": "snowshoe hike mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "6 km",
        "Town": "Nelson, BC",
        "Type": "out-and-back"
    },
    "title": "49er and Blindside",
    "trail_id": "10354"
}