{
    "description": "Français:Comme son nom l'indique le sentier le fjord nous laisse apprécier toute la beauté du fjord. Les montée succède les descentes et la vue est à couper le souffle. Vous pouvez le faire en refuges ou en camping. la distance varie de 17,16 et 9 km en refuge et 12, 8 et 9 km en camping.\r\n\r\n\r\n\r\nEnglish:Beautiful trail that follows the Fjord. Days will be around 17, 16 and 9 km. Along the road you will experience numerous views of the different forests and even belugas! (small white whales). \r\n\r\nVery nice trail, lots of up and downs, some quite steep. I started in tadoussac and did the first 18 km then turned around and came back to tadoussac. This made the trip three nights long. The views are fantastic when you get to lookout points over the fjord. Lots of small wildlife; snakes, grouse, beaver, groundhogs, etc. Platforms are in good condition with very nice covered cooking shelters. Water sources are available every 5-6 km but of course it needs to be treated. Some very nice water falls, especially the one at the first set of platforms(when starting from Tadoussac). It falls into the fjord, there is a side trail and a set of stairs leading to the bottom although the side trail seemed to be ill maintained if not intentionally blocked off.\r\n\r\nIf you choose to do the entire trail then there is an available shuttle service for your vehicle from the other end of the trail, it costs around 50$.\r\n\r\n\r\nThere are 3 small refuges to sleep and 2 camping zones.\r\nThe section in camping can be done in 3 days at 9km a day.\r\nYou will also find interesting the fact that there are buses that will bring you to the different starting point from the youth hostel of Tadoussac (418-235-4372) (The bus passes twice a day.\r\n\r\nInformation : Parc national du Saguenay \r\nT?l. : (418) 272?1556 et 1 877 272-5229.\r\nwww.SEPAQ.com \r",
    "directions": "From route 138 East, take the 172 west\r\nOr\r\nFrom route 175 North, Tale route 172 East \r\n\r\nThen follow the instructions for Parc National du Saguenay.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/QC/1039/reg_best1_lefjord038.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/1039/reg_lefjord009.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/1039/reg_lefjord028.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/sentier-le-fjord-parc-du-saguenay-near-tadoussac-pq-1039",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 4,
        "Time": "21 hrs",
        "Total Distance": "42 km",
        "Town": "Tadoussac, PQ",
        "Type": "out-and-back"
    },
    "title": "Sentier le Fjord (Parc du Saguenay)",
    "trail_id": "1039"
}