{
    "description": "Mount Adams, situated in the eastern Cascade range, east of Mount Saint Helens and north of Mount Hood, is the second most massive and the third tallest volcano in the Cascade range. It's eruptive volume is about 48 cubic miles and only Mount Shasta is larger in volume in the Cascades. During an early summer weekend, the Mount Adams Ranger Station recently issued Cascade Volcano Passes for over 350 people. Be careful of rockfalls, especially on the headwall routes - there's a reason why most Mount Adams headwall routes remain unrepeated.\r I've climbed in in October.",
    "directions": "The South Spur Route (aka South Climb, South Side, or South Rib), which initially follows the South Climb Trail #183, is the easiest and most popular route on the mountain. This straight-forward snow climb is easily done in 1 or 2 days with crampons and a mountaineering axe. During late spring and early summer (typically through July), this route also happens to lead to the thousands of vertical feet of intermediate-level crevasse-free corn skiing/snowboarding and chute glissading. While climbing is better earlier in the day on harder snow, on the descent skiers and glissaders will appreciate waiting a bit until the snow is softer. The trailhead for the South Spur Route is at the Cold Springs Campground at 5,600' and while the trail is only 5.7 miles, it climbs 6,676' to the summit in that short distance, not counting dip in the saddle after Piker's Peak.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/WA/10396/reg_6260130396-ceb7247c53-o-38909.jpg",
        "https://trailpeak.com/storage//content/trails/US/WA/10396/reg_IMG-8769nnn-38909.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mt-adams-near-trout-lake-wa-10396",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 3,
        "Time": "14 hrs",
        "Total Distance": "10 km",
        "Town": "Trout Lake, WA",
        "Type": "out-and-back"
    },
    "title": "Mt. Adams",
    "trail_id": "10396"
}