{
    "description": "Glebe Road Ice Climb\nSussex, and more specifically, the Poley Mountain area, has become a hotbed for ice climbers. First there is the main attraction of Parlee Brook, with its 60m ice walls and 270 degrees of climbing. Next is Cedar Camp (to be added soon), Hulhomes Falls, and now, the ice walls off of Glebe Road. Park yourself on Friday night, and you?ve got yourself a long weekend?s worth of ice spots!\nWhat?s nice about Glebe Road is that access is a short walk (less than 20 minutes) with about half that along an icy log road. With a bit of bushwhacking, (it?s a logging area, so that could change!) you?re on your way to not one, but three ice havens. An easy wall with WI 2s and 2+, a harder one with three distinct lines in the 2-3 range, and then a mini Parlee Brook, with WI 4-5 lines. As of 2012, few of the routes had been FA?d so the lines and names are being created this season.\nThis is a great spot to take learners, with plenty of  harder lines to show them where the sport takes you. Travel between ice walls is easy, and if you can climb out of the mini Parlee Brook site, getting back to the car is really simple. Got a larger group in your party? This spot?s got plenty of room, and no lineups at the belay.\nWarning: do not drink the ground water, as there is a program underway to \"kill certain plant species\" with chemicals.\nShannon Burt\nEast Coast Editor",
    "directions": "Coming off Highway 1 near Sussex, turn onto route 114 at exit 198, (crossing the highway) and head toward the Poley Mountain Ski resort.  Just before the ski resort, turn right onto the Glebe Road. We parked past the intersection of Glebe and Parlee Brook Road and hiked in from there as the road was icy. The area is run through with active logging roads. See the GPS map.",
    "geohash": "f81e",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NB/10392/glebe.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/10392/narrow_glebe-6702.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/glebe-road-ice-routes-near-sussex-nb-10392",
    "stats": {
        "Activities": "climb hike",
        "From": "",
        "Seasons": "winter",
        "Stars": 5,
        "Time": "6 hrs",
        "Total Distance": "2 km",
        "Town": "Sussex, NB",
        "Type": "out-and-back"
    },
    "title": "Glebe Road Ice routes",
    "trail_id": "10392"
}