{
    "description": "Cathedral Rock is an iconic landmark in Sedona, AZ. This is not a trail to view Cathedral Rock. This trail climbs up to the saddle between spires for an up close and personal look at the Rock. For some in Sedona, this would probably be a spiritual experience.  This trail is a fairly difficult scramble over a lot of slickrock. Cairns are numerous, so you should have no problem finding your way. There is 630' of elevation gain in 0.7 miles (one way).  Those who experience vertigo will quickly find the climb up to the saddle too difficult.  There are other ways to experience Cathedral and make the hike longer.  Follow the trail that (almost) circumnavigates Cathedral rock.  When I say almost, this means there is no circumnavigation that would suit a beginner / moderate hiker.  You can however hike around Cathedral (along the river) and connect with Baldwin trail, which forms it's own loop around nearby Buttes *but not Cathedral*. For guided hiking options check out Arizona Outback Adventures.",
    "directions": "The trailhead is on Back O' Beyond Road off Hwy 179, south end of Sedona. Parking is limited and there is no parking allowed on the road, so arrive early.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/AZ/10407/reg_cath2-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/10407/reg_cath3-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/10407/reg_cath4-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/10407/reg_cath5-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/10407/narrow_cath-jodie-5_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/10407/narrow_cathedral1-5.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/cathedral-rock-near-sedona-az-10407",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "1 km",
        "Town": "Sedona, AZ",
        "Type": "out-and-back"
    },
    "title": "Cathedral Rock",
    "trail_id": "10407"
}