{
    "description": "This is a trail that has recently been contracted near Elmsdale.  There are two loops currently open and three more in development.Immediately after starting off from the parking lot, there will be a spur trail to your left.  This trail goes in a circle and will meet up with the main trail way at about 650m distance.The main trail is mostly under forest canopy with some parts in either blow down areas or in small bog like setting.  There are a few occasions were the trail enters some very nice stands of Hemlock.  There are multiple small bridges and built up trail areas that will ensure this trails does not become muddy.  After about 3.6km, I came up to another spur trail to the right.  I took it as it went around a large bog and through some more hemlock stands.  This spur trail come back into a loop to rejoin the main trail near a moderate size lake.  Unfortunately,the trail does not go near the Nine Mile river except for a brief moment.  the other spur trail under construction will help in that endeavour  There are some old tav trails that come across the trail from time to time but the signage is excellent and there is no chance to be confused by them.",
    "directions": "Drive on highway 102 to Exit 8.  Take highway 14 towards Rawdon.  Turn left on Enfield Rd and drive to the parking lot of the nine mile river trail system (on the right). There is a good parking lot, but the sign is only visible when you are very close to the entrance.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/10409/reg_DSC-0108-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10409/reg_DSC-0109-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10409/reg_DSC-0111-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10409/reg_DSC-0113-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10409/reg_DSC-0114-27177_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10409/reg_DSC-0115-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/nine-mile-river-near-halifax-ns-10409",
    "stats": {
        "Activities": "snowshoe hike ski-xc mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "10 km",
        "Town": "Halifax, NS",
        "Type": "out-and-back"
    },
    "title": "Nine Mile River",
    "trail_id": "10409"
}