{
    "description": "From the parking area, climb over the logs and walk along the old section of gravel road past the logged hillsides. Already there are great views of the surrounding mountains and the snow-covered Mount Baker in Washington State can be seen in the distance.\r\rAfter a 15-minute walk, you reach the end of the old logging road and a trail begins off to the left. It descends slightly into a meadow which is generally lush with colourful wild flowers in August. Cross the small creek and continue to Spoon Lake. From this point on, the steep uphill trail begins. Follow the trail and go right at the junction as the path cuts between the beautiful flowers and tall grass.\r\rAs you make your way up the trail, don't forget to look back to admire the changing view while you catch your breath. After 40 minutes or so, the trail levels as you reach the upper pond. Depending on the time of year, this can either be an empty rock bed or a small pond on the left of the trail. Continue along the trail as it begins to ascend once again, going through a series of switchbacks as it hugs the side of the mountain. As you climb, the vegetation begins to thin utnil you reach the point where the trail and sides are loose rock. A worn path marks the route to the summit.",
    "directions": "he access point to Mount Cheam is located along the highway to Chilliwack Lake. From Vancouver, take Highway #1 (Trans Canada Highway) east for about 90km to Exit #119 Sardis. Turn right and follow Vedder Road southbound until you reach a 3-way intersection at Chilliwack Lake Road. Turn left and zero your odometer. At 28km, turn left onto the Foley Creek Forestry Service Road and drive for 2km. After crossing the bridge, turn left at the junction and drive another 2km and then turn right onto the Chipmunk Creek Forest Service Road. There will be a gravel pit at this location. From this location, continue on the narrow road as it becomes very rough and follow it for about 8km to the end parking area. There are several turnoffs along the route, however stay along the most obvious road and it will take you to the trailhead.",
    "photos": [],
    "source_url": "https://trailpeak.com/trails/mt-cheam-near-vancouver-bc-10416",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 4,
        "Time": "5 hrs",
        "Total Distance": "10 km",
        "Town": "Vancouver, BC",
        "Type": "out-and-back"
    },
    "title": "Mt Cheam",
    "trail_id": "10416"
}