{
    "description": "This is a nice hike that you can do with a family and is approximately 10-15 minutes from downtown halifax.  The bonus of this hike is a somewhat long man-made tunnel bored into the granite.The hike starts within the redoubt where you can spot a few of the artillery pieces that still face the entrance to Halifax Harbour.  Follow those in a south direction and then climb up the 70 steps or so to get to the highest point of the redoubt.At the summit of the stairs you will see a bunker.  Maybe in the summer you can access the inside but in February all the doors are locked.  There is a nice view point in front of the bunker overlooking the islands of the Harbour.At the base of the stairs you climbed up, you can follow an unofficial trail to the left.  If you follow it for about 15m you will be able to access a staircase going into the ground.  There is a small tunnel at the base of the stairs and some small slot windows in the rock wall at its far end.From the bunker at the top of the stair, you can follow a main road that leads towards the ocean.  Follow this gravel road down for a while.  It is very wide and suitable for all ages.   The road does a couple of different lace type turns as it goes down the steep hill towards the ocean.  Once you are close to the ocean, there is one last u shape curve with a bench.  Instead of following the main road at this point, skip over the small ditch being the bench and follow an unofficial trail (2-3 m wide) to the main fork redoubt tunnel. At the end of this trail lies the tunnel.  The entrance is about 5-6ft high and you can proceed to three different chambers inside of which the last two have openings to the outside which afford some daylight into the tunnel.  I didn't have my flashlight and it was ok.Getting back to the road, you can follow it to its conclusion at a fenced off area.  Beyond the fence lies a bunch of old buildings and bunkers deemed to dangerous to let the public wander into them.  BTW, the whole of the york redoubt site is peppered with old bunkers and buildings that for the most part you can still enter.  At this point, all you have to do is to get back up the hill and back to the main redoubt part where your car is parked.",
    "directions": "Take Purcell Cove Rd (highway 253) just up from the rotary .  York redoubt is a national historic site located just past the Purcells Covey yacht club",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/10410/reg_DSC-0125-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10410/reg_DSC-0119-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10410/reg_DSC-0130-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10410/reg_DSC-0135-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10410/reg_DSC-0136-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10410/reg_DSC-0378-48348.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10410/reg_DSC-0388-48348.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10410/reg_DSC-0402-48348.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10410/reg_DSC-0467-48348_best1_.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/york-redoubt-and-tunnels-near-halifax-ns-10410",
    "stats": {
        "Activities": "snowshoe hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "2 km",
        "Town": "Halifax, NS",
        "Type": "out-and-back"
    },
    "title": "York Redoubt and Tunnels",
    "trail_id": "10410"
}