{
    "description": "NTS Map: 92G7. The first 5km of the trail are, literally, a walk in the park. The old logging road is slowly being reclaimed by the forest, but rarely does the greenery get close enough to brush your shoulders. In late May (2004) the berries were already out along the trail - a nice distraction. Many people don't like the logging road experience, but you would never know this was a road - and I much prefer its openness to the dark, cloistered, meandering paths of the local rainforests.There is an optional aside to a waterfall 40 minutes from the camp, take the fork right for this option, stay left to continue on. Even if you stay left, there is an impressive cascade another 20mins along the road, and an even nicer one at the 5km mark. For many, this second waterfall will be plenty - especially as a day trip for those who need to get back across Pitt Lake same day. For the more intense, the trail here begins to get narrower and steeper, and you must pay close attention to the flags in many places. The rest of the way to the lake is sheer uphill. It probably isn't a big deal with a day bag, but with an overnight pack the climb seemed eternal. It is also very difficult to move quickly with a large pack, as the trail is 90% root grabbing and boulder-scrambling (very Chief-esque). There were many, many 'are we there yet?' moments. You aren't there until you see the lake. The trail pops you out about 50m above the shore, which makes for a lovely view. There are several camping spots along the shore, and you are guaranteed no crowds (I met two people coming down, but none at the lake).I recommend an overnight trip, even with the hassle of hauling a bag, b/c it is a challenging grind to do in a day.",
    "directions": "Follow directions to Pitt Lake (Widgeon Creek hike directions) and take canoe to the Widgeon Slough and the group campsite therein. Hopefully you have your own boat, or an overnight trip b/c unreasonably expensive. It is about an hour's paddle from the parking lot - a lovely one at that, amongst quiet waterways with creeklets and countless birds (the area is a wildlife sanctuary). From the campsite, the trail is very obvious, leading north, and speckled with signs for the waterfall. At the first real fork, stay left. The 92 G/7 topo map makes it seem as though the main road continues north indefinitely, and a spur runs NNE at approx 4km from camp. The road has long since disappeared, and instead of a spur, there is just a sharp bend in the trail. I lost the trail on the way home, immediately after crossing a creek beyond the waterfall (with the hand-hewn bridge). Several creeklets and clearings can distract you from the overgrown trail in this area - pay close attention on your way up. I followed the main creek downhill for a short while, and luckily came across a more obvious portion of the main trail.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/1041/long_Widgeon-Lake-Photo-3-56764.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1041/long_Widgeon-Lake-Photo-5-56764.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1041/reg_DSC02877-19708.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1041/reg_DSC02884-19708.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1041/reg_DSC02902-19708.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1041/reg_DSC02917-19708.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1041/reg_DSCN3626-30698.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1041/reg_DSCN3686-30698.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1041/reg_DSCN3716-30698.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1041/reg_Widgeon-Lake-01-23814.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1041/reg_Widgeon-Lake-Photo-2-56764_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1041/reg_widgeonfallsupperjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1041/reg_widgeonlkjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1041/narrow_DSCN3727-30698.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/widgeon-lake-near-vancouver-bc-1041",
    "stats": {
        "Activities": "river-canoe hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 3,
        "Time": "10 hrs",
        "Total Distance": "16 km",
        "Town": "Vancouver, BC",
        "Type": "out-and-back"
    },
    "title": "Widgeon Lake",
    "trail_id": "1041"
}