{
    "description": "This is a nice hike that takes you two two different cave structures in sandstone \r.  One of the caves has a nice rock pillar in the middle of it's  opening.\r\r\rStrating from the highway, jump over the guardrail and follow the brook as it \rempties into Clements cove.  The brook is 6-8ft wide and shallow enough that \ryou can skip across as needed.  Once you get to the cove, if you go over to the \rright, and just outside the cove (to the east), you will find the pillar cave.  \ralthough it' only 15ft deep, it's big enough for you to stand in and the best \rfeature is the rock pillar in the middle of the entrance.\r\rCross the cove to the west and you will see just another fairly large cave \rstructure in sandstone.  This one does not have a pillar but it's bigger in depth \rand height.  There was a nice ice pillar when I visited in early March (see utuve \rvideo).\r\rComing back towards the brook you took down from the highway, there might \rbe another large ice pilar close to the brook.  the ice pillar forms off an 20ft \roverhand and must form every winter...very spectacular sight and may be \rclimbable in the coldest months...again see the pictures and or video for a \rbetter idea.",
    "directions": "Take highway 215 towards Walton.  East of Walton lies Clements cove.  The \rbrook you need to follow to get to shore is approximately at;  45°15'19.39\"N,  \r63°56'51.42\"W",
    "geohash": "f8492",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/10422/reg_DSC-0127-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10422/reg_DSC-0140-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10422/reg_DSC-0143-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/pillar-cave-near-windsor-ns-10422",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "2 km",
        "Town": "Windsor, NS",
        "Type": "out-and-back"
    },
    "title": "Pillar Cave",
    "trail_id": "10422"
}