{
    "description": "Time Killer is a DH race practice course.\r\nNatural with few ladders and a 80foot bridge takes you into the canopy . Down down down.\r\nA mtn bikers small log cabin complete with ladders over top to drop you into the seating area for a break in the ride.\r\nFlowing with fast lines and a couple of tough gaps as well as a few jump spots where you either jump or set your bike over. This is not a begginers course.\r\nBig Bikes rule here\nA natural flowing, with some big berms and a rock which depending on your expertise you can go big or not.\r\nFreeway Bob is a fast section where you can go as fast as you dare. The trail is not that long and the locals use it as a shuttle trail, doing it as many times as four or five, depending on your tolerance of adrenaline.\r\nThe whole of Sumas Mtn. where this is located is full of  mtn bike trails, which rock!!\r\n\"Knob Gobbler\" (recently had it's ladders taken out) and now is more of a XC natural trail. It starts at the top of the Mtn. besides the telecommuncation tower. approx. 1 hour long.\r\n \"Noah Fear\"  twenty min approx. Starts just below the  Time Killer another DH course.\r\n\r\nUPDATE:\r\n\r\nTimeKiller has a new exit  called \"TimeOut\"! \r\n\r\nshort ,windy and pretty. Cedar bridging, lovely lines with a log ride,till you go through a little wet area and exit right besides the waterfall,Bakstad parking area.\r\n\nTo get to the new exit:\n\r\nNear the end of TimeKiller you come out to a logging slash. \r\n\r\n- Short, it takes you onto a gravel logging road. \r\n\r\n- Turn Left go approx. 250 feet on the gravel road, just before the creek. \r\n\r\n- Look Right which is S. and enter this small trail. \r\n\r\n- It goes down and winds its way under a beautiful canopy, get a little scrubby as it exits just above the waterfall. \r\n\r\n- You are now at the BAKSTAD parking area.\r\n Directions to Time Killer:Sumas Mtn road  take Batt. road up to \r\nthe  first parking lot (has a gate which is locked after 9pm). We either ride up 45min by pig bike to the Time Killer and go in or take an hour twenty to go to the top to do Knob Gobbler, then go back up and finish on the Time Killer ... Or we shuttle.\r\nTime Killer exit is on Bakstad road which is just below the Batt. road parking lot. Note any sat/sun there are usually always riders, hook up with someone and this will make your first time experience of this mtn so much better.\r\nSumas can be a bit of a maze.\r\nThe locals are used to helping riders out, so don't be shy, it will be worth it.\r",
    "directions": "See description and / or GPS",
    "geohash": "c29p",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/1042/reg_100-100-10050.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1042/reg_100-3578-13509.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1042/reg_100-3590-13509.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1042/reg_102-102-10050.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1042/reg_22.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1042/reg_IMGP0811.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1042/reg_discoplum.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1042/reg_sumas-2-10050.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1042/reg_timekiller.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1042/reg_winter-10050.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1042/topo_11.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/sumas-time-killer-near-abbotsford-bc-1042",
    "stats": {
        "Activities": "mtn-bike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 5,
        "Time": "2 hrs",
        "Total Distance": "1 km",
        "Town": "Abbotsford, BC",
        "Type": "out-and-back"
    },
    "title": "Sumas - Time Killer",
    "trail_id": "1042"
}