{
    "description": "Initiated in 1992 as a project to celebrate Canada?s 125th year, the  Trans Canada Trail is the world?s longest network of multi-use  recreational trails. When completed, it will stretch 22,500 kilometres  from the Atlantic to the Pacific to the Arctic Oceans, through every  province and territory, linking over 1000 communities and all  Canadians.\n                          Visit www.tctrail.ca\nThe Trans Canada Trail is made up of close to 400 individual trails, each with unique and varied features. This contributes to the diversity and grandeur of Canada?s national Trail. For day trips or multi-day adventures, the Trail offers countless opportunities to explore and discover.\nTo date, more than 16,500 kilometres of the Trail are operational which is more than 73 percent of the proposed route. Today, four out of five \nCanadians live within 30 minutes of completed sections of the Trail.Explore the Trail: Use our interactive map to highlight specific activities or points of interest, mark points or sections of the Trail you have visited and upload your own photos and stories. You?ll also find printable maps and downloadable GPS coordinates for all operational trail sections.\nYou can download a map for a specific trail section, or maps for an entire province or territory. \nGuidebooks and maps: Trans Canada Trail has seven Official Trans Canada Trail guidebooks for Newfoundland, Nova Scotia, P.E.I., New Brunswick, Quebec, Manitoba and British Columbia. We also offer three stand-alone maps, particularly helpful for planning longer trips on the Trail in Atlantic Canada, Quebec, and Ontario. \nFor more information, contact them or get in touch with your local  bookseller or travel supply store. The Trail inspires Canadians of all ages to get active and keep fit.",
    "directions": "Explore the Trail: Use our interactive map to highlight specific activities or points of interest, mark points or sections of the Trail you have visited and upload your own photos and stories. You?ll also find printable maps and downloadable GPS coordinates for all operational trail sections.\n \nYou can download a map for a specific trail section, or maps for an entire province or territory. Guidebooks and maps: Trans Canada Trail has seven Official Trans Canada Trail guidebooks for Newfoundland, Nova Scotia, P.E.I., New Brunswick, Quebec, Manitoba and British Columbia. We also offer three stand-alone maps, particularly helpful for planning longer trips on the Trail in Atlantic Canada, Quebec, and Ontario. \nFor more information, contact us or get in touch with your local bookseller or travel supply store. Visit the websites of the provincial and territorial partners. They offer a wealth of information about the Trail in every province and territory.",
    "geohash": "c3x",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/10436/narrow_Edmonton-24-11997.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/trans-canada-trail-near-edmonton-ab-10436",
    "stats": {
        "Activities": "snowshoe river-kayak river-canoe river-raft hike ski-bc ski-xc mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 5,
        "Time": "7000 hrs",
        "Total Distance": "16500 km",
        "Town": "Edmonton, AB",
        "Type": "out-and-back"
    },
    "title": "Trans Canada Trail",
    "trail_id": "10436"
}