{
    "description": "This is a hike that exemplifies the sandstone formations along the upper Cobequid Bay.  There are no particular start or end but the whole peninsula hike with return to your car is about 7km.\nI went to the Salter Head in search of a natural arch.  I was hoping for a spectacular sandstone arch but either the tides have destroyed it or there is another Salter Head somewhere in Nova Scotia where this natural arch actually exists.  Anyways the search for the arch was a bust but there is still a lot to see on this hike.\nI started by an old abandoned church (perfect for an horror flick backdrop), and followed the edge of the wood to the north of it.  I then crossed a large open field and entered the forest to the north of it.  Two hundred meters later, I made it to the shoreline of the Shubenacadie River where it empties into the Minas Basin.\nImmediately, you come across a tall cliff with some cavities in them.  Unfortunately these cavities are topo small to get yourself in?.but patience there is more to this hike.  I did the hike in early March and there were spots where ice debris was a few meters thick and very soft.  This hike should only be attempted in low tides.\nAfter 25 minutes or so from leaving your car, you should come up to the first of many cavities that are big enough to enter.  This first one is across from a flower pot like structure.  This might have been the spot where the natural arch was located?between the shoreline and the flowerpot perhaps.  There was an eagle couple on the flowerpot at the time of my hike?.what an amazing site.\nContinue past the flowerpot to some more sea caves in sandstone formations.  At that point you can either retrace your steps or go completely around the Salter Head?which I did if you look up the gps track.",
    "directions": "Highway 215 to Maitland.  Drive north to Selma and park approximately at 5018862.40 m N, 459419.94 m E (where the old abandoned church is located)",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/10430/reg_DSC-0109-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10430/reg_DSC-0114-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10430/reg_DSC-0115-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/salter-head-near-truro-ns-10430",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "7 km",
        "Town": "Truro, NS",
        "Type": "out-and-back"
    },
    "title": "Salter Head",
    "trail_id": "10430"
}