{
    "description": "This is a small hike that rewards the bold (but careful) hiker with two beautiful waterfalls. From the parking lot at Grande Falaise in the Cape Breton Highlands National Park, follow the brook that runs to the side of the lot and towards the hillside.  You should notice some steps leading you down to the stream?s edge.  To the left of the steps, there is an unofficial trail.  Follow this trail as it pushed through a small alder stand and then either goes up the scree slope (not recommended) or turns right and drop to the stream?s edge.  Follow the stream and small fait trail for a few hundred metres.  You should pass by a small 6ft waterfall.  The trail at this point is on the left hand side of the brook (looking upstream).  On top of this small waterfall, jump across the 6ft wide stream and continue alongside the brook.  Bypass a large rock outcrop on the stream?s edge (if the water is low, you should not have to get your feet wet). \r\rRight above this outcrop are the two waterfalls.  The most downstream fall is a straight drop of about 25ft.  The fall has carved itself almost into a cave?really neat rock structure that surrounds the fall on almost all sides.  What a spot for a quick soak in the summer!!!  Now above this first fall is another one but it is very difficult to reach.  You basically have to climb up the really steep hill on the right of the first fall.  Once you hit the stunted trees at the top, you have to kind of make your way along a very narrow rocky ledge to view the second fall.  If you just push through the stunted trees you will be above the second fall which is also a nice viewpoint.\r\r",
    "directions": "Drive into the Cape Breton Highlands National Park (Cheticamp entrance) and park at the Grande Falaise interpretive parking lot.  The stream to the right of the clearing is the one where the falls are located.\r",
    "geohash": "f8k9",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/10457/reg_DSC-0041-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10457/narrow_DSC-0038-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/righwash-brook-falls-near-cheticamp-ns-10457",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 5,
        "Time": "1 hrs",
        "Total Distance": "1 km",
        "Town": "Cheticamp, NS",
        "Type": "out-and-back"
    },
    "title": "Righwash Brook Falls",
    "trail_id": "10457"
}