{
    "description": "Near Louisbourg is one my favorite costal hikes in NS.  This little gem of a place is filled with small inlets, rocky crags and breaking waves and barrens to explore at your own leisure.\r\rFrom the highway, you can drive the dirt road all the way to the pebble beach.  Once you are there, park your car and go either to the right or left?. it doesn?t matter as there are no ?official? trails but plenty of unofficial ones.  Facing the ocean, if you go to the right, the only thing you will be missing out a lot on is the barrens located on the left.  \r\rMy preferred route is to the left and basically follows the shoreline.  There are numerous high points in the barrens that afford beautiful views of this coastline.  I?ve also dived right of the main pebble beach where you park your car and there is a metal wreck in the middle of the bay as well as too many lobsters to count.  On days with high waves, you also will hear the rattling of the rocks on the beaches.  Also when the sun hits at a certain angle, the water is somewhat turquoise in some of the inlets.\r\r",
    "directions": "Drive on the road  from Louisbourg to Little Lorraine.  Park or drive down the dirt road located at ; 45°56'45.63\"N, 59°52'54.38\"W\r",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/10474/reg_Cranberry-Cove-Cape-Breton-Island-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10474/reg_Scan10006-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10474/reg_Scan10007-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10474/reg_Scan10008-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/cranberry-cove-near-sydney-ns-10474",
    "stats": {
        "Activities": "hike snowshoe",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "5 km",
        "Town": "Sydney, NS",
        "Type": "out-and-back"
    },
    "title": "Cranberry Cove",
    "trail_id": "10474"
}