{
    "description": "The Great Divide Trail, or GDT, is a wilderness hiking trail in the Canadian Rockies. The trail closely follows the Continental Divide between Alberta and British Columbia, crossing the divide no fewer than 30 times. It begins in Waterton Lakes National Park at the Canada-US border (where it connects with the Continental Divide Trail) and ends in Kakwa Provincial Park north of Jasper National Park.\r \rThe route south of Palliser Pass was originally mapped in 1974 by a group of 6 people funded by an Opportunities for Youth Grant. This group included Mary Jane Cox, Jenny Feick, Chris Hart, Dave Higgins, Cliff White, and Dave Zevick. White was the project coordinator and used the data from the project as the basis of an undergraduate thesis.\r \rThe Friends of the Great Divide Trail are dedicated to maintaining the original 100 km-long section of the GDT running through unprotected Alberta Crown Forest Reserve lands, from North Fork Pass to Fording River Pass, that was constructed in the 1970s and 1980s.\r \rThe GDT is not officially recognized by Parks Canada and therefore is not signed and not always even an actual trail, sometimes merely a wilderness route. The GDT passes through five National Parks: Waterton Lakes, Banff, Kootenay, Yoho and Jasper; seven Provincial Parks: Akamina-Kishinena, Elk Lakes, Peter Lougheed, Height of the Rockies, Mount Assiniboine, Mount Robson and Kakwa; four wilderness areas: Beehive Natural Area, Kananaskis Country, White Goat Wilderness and Willmore Wilderness Area; and five forest districts: Castle, Bow/Crow, Cranbrook, Golden and Robson Valley.\r\rLength\r \r1,200 kilometres (700 mi)\r \r\r\rLocation\r \rAlberta and British Columbia, Canada\r \r\r\rUse\r \rHiking\r \r\r\rHighest point\r \rUnnamed pass, 2,590 m (8,497 ft)\r \r\r\rLowest point\r \rOld Fort Point trailhead, 1,055 m (3,461 ft)\r \r\r\rTrail difficulty\r \rStrenuous\r \r\r\rMonths\r \rJuly to September\r \r\r\rSights\r \rCanadian Rockies, Waterton Lakes National Park, Banff National Park, Kootenay National Park, Yoho National Park, Jasper National Park, Kakwa Provincial Park and Protected Area\r",
    "directions": "many",
    "geohash": null,
    "photos": [],
    "source_url": "https://trailpeak.com/trails/great-divide-trail-near-jasper-ab-10470",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 5,
        "Time": "490 hrs",
        "Total Distance": "1200 km",
        "Town": "Jasper, AB",
        "Type": "out-and-back"
    },
    "title": "Great Divide Trail",
    "trail_id": "10470"
}