{
    "description": "The East Beach hike follows the eastern shoreline of Graham Island on Haida Gwaii from just north of Tlell to Tow Hill near Masset.  It is best to do the hike from south to north, as the prevailing winds come from the south.  Better to have the wind and rain at your back than in your face.  \nThe hike takes aprox 4 to 6 days and is almost 90km long.  The hike is not difficult technically, but the distances between each camp are often far.  On the second day of the hike from Cape Ball River north, there is a stretch of the hike (about 16km) that must be done on the receding tide as the beach in this section is bordered by cliffs where the high tide comes right up to, and leaves no escape routes.  There are supposedly \nthree rustic shelters along this hike, but we only found two of them.  The first one just south of Cape Ball is unusable, other than as a cooking area.  The Cape Fife shelter is much nicer and newer, with four beds and a fireplace.  Mice live in here so protect your food at night.  A tent is required for the hike as well as a water filtration system.  Don't let the color of the freshwater throw you off.  It is quite red with tannins from all the organic material in the forest.  Our water filter did a pretty good job with making it taste clean, although I had to clean it more often.  \nSometimes there was an \"earthy\" taste leftover, but it was good clean water.  Water is hard to find on the second day of the hike also.  \nBlack bears are plentiful on the island, so proper precautions must be taken in camp to ensure your safety, such as hanging your food and cooking away from campsite.  There are three rivers (Mayer, Cape Ball, Oeanda) and numerous streams that must be crossed so waterproof footwear and gaiters are highly recommended.  The rivers can be crossed at their mouths at low tide, unless you want to swim.  The Oeanda River was the most difficult and deepest to cross, as we had to take off our footwear and pants to cross, the water reaching above our knees, even at low tide.  All this being said, it is important to have a tide chart with you to plan the cliff section and river crossings.  We got stuck one day at the Oeanda River as we were a couple of hours too late to cross.  Luckily there is an amazing camp spot 4km south of the river where we stayed for two nights.  \nThe last stretch of the hike goes from Cape Fife to Tow Hill.  One can either take the Cape Fife Trail from the shelter through the forest to Tow Hill, about 10km, or follow the shoreline across Rose Spit (about 20km).  \nThe forest trail is shorter, but there are numerous marshes, and boggy sections, as well as many fallen trees that need to be climbed over or under.  This trail hike in the forest was the most difficult section of our hike.  \nMore info at\nhttp://www.env.gov.bc.ca/bcparks/explore/parkpgs/naikoon/hiking.html",
    "directions": "This trail begins at Tlell River day use site just north of the Tlell River Bridge.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/10487/reg_IMG-0271-34928.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10487/reg_IMG-0282-34928.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10487/reg_IMG-0321-34928.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10487/reg_IMG-0354-34928.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10487/reg_IMGP7315-34928.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10487/narrow_IMG-0372-34928.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10487/narrow_IMGP7300-Edit-34928.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/east-beach-hike-haida-gwaii-near-sandspit-bc-10487",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring summer",
        "Stars": 4,
        "Time": "35 hrs",
        "Total Distance": "90 km",
        "Town": "Sandspit, BC",
        "Type": "out-and-back"
    },
    "title": "East Beach Hike Haida Gwaii",
    "trail_id": "10487"
}