{
    "description": "This trail is, at times, an easy one with long gentle grades and at other times very steep. It generally parallels existing roads and, except for the occasional veteran the forest along it is second growth, that is, what has grown up since the original forest was logged. However there are several areas where the trail goes through young plantations. It is a long trail, 15 kms in length.\nThere are many bridges along the way. Some of them are very sturdy, and others are not. Some of the bridge \"stringers\", the beams that support the decking, are made from hemlock and even alder. This means that they will rot very quickly. I would say that some of them could be giving way as early as in 2013. In other places the construction crew has \nmade little ladders, steps and cookies made from rounds from logs. You can use them. But be careful, they can be very slippery.\nAlthough there are a few signs, they are not very helpful for direction finding. However they hung yellow ribbons the entire length of the trail, so that if you are uncertain if you have taken the right fork, look for them. Sometimes, these ribbons will lead you down, or up to the road. Don't follow them. These were hung for the construction crew.\nAll in all this is not a trail for an inexperienced hiker. The trail is not always obvious, and some of it has to be hiked carefully to avoid a fall.",
    "directions": "From the South end of Port Alberni, follow the Bamfield Road for 32 km until you arrive at a turnoff to the right just before a bridge. On a post there is some vertical white lettering that says Headquarters Bay. Follow this road a little over 3 km to the trail head. I recommend following the your GPS to the waypoint marking it.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/10484/reg_002-16063.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/runners-trail-near-port-alberni-bc-10484",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 3,
        "Time": "6 hrs",
        "Total Distance": "15 km",
        "Town": "Port Alberni, BC",
        "Type": "out-and-back"
    },
    "title": "Runner's Trail",
    "trail_id": "10484"
}