{
    "description": "A ride that I've wanted to do for a while, this 9-10km trail has great views back across to the Toe and Tunnel Mountain Loop, and some funky, sandy, rolling, cruising, bliss along it.  You get to ride to the Water Tower that I've seen from the hiway 100 times and past it for another km to the Johnson Lake parking lot.  You can return the way you came, or on the road to Johnson Lake.  Or you can park at Johnson Lake and do this West then East.    It has a total of about 100m of elevation change along it, plus the 40-50m climb at the West end (more on this later).\nNear the West end is a set of 5-6 steps that get bigger the more West you go, pretty tough to ride up them, but riding down is doable, just stay off that front brake or you'll auger in good.  yo ucan avoid them by riding the West bit on the road and watching for the entrance to WT trail.\nWe did about 10km of pavement East and North along Tunnel Mountain Drive down to Banff Avenue (much more fun an a road bike than a 26 lb MTB with 2.2\" tires) and turned North and under Hiway 1 to Cascade Ponds and the WaterTower trail on the N side of hiway 1.  \nAnd by the way, technically it's not a water storage tank, it's a surge tank for the small hydro station penstock.  \nCascade ponds were completely dry for some reason so you may not want to follow my track log exactly as your ponds may differ.  When leaving the parking lot for the trip back to town (on my bike), I found a cool little horse / elk / ? trail through the trees that got me to the N edge of the cattle guard.  Can ride to here from Banff or Canmore with virtually no dodgy busy roads thanks to the Legacy Trail.\nThis and 6 other trails (Hoodoos, Tunnel Mountain Loop Singletrack, Star Wars, The Toe, Snake and Water Tower) form a buncha new mountain bike trails within Banff Park.  In the past, there were *very* limited options for riding in the woods of National Parks.  But thanks to a philosophy change by Parks Canada and some *VERY* hardworking volunteers at the Bow Valley Mountain Bike Alliance (BVMBA), we now have these to enjoy.  And you WILL enjoy them, they're good!.  And even better, there are more coming, the BVMBA tells me late spring 2012 should have another new, technical trail open near Star Wars.  Support you local MBA, BVs trail building night is Wednesdays, bring boots & gloves, they have a Pulaski with your name on it.",
    "directions": "North side of Hiway 1, take the Lake Minnewanka Exit and got slightly North to the Cascde Ponds parking lot.\nOr Drive all the way up the same road to Johnson Lake.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/10491/reg_gopher-6828.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/water-tower-trail-near-banff-ab-10491",
    "stats": {
        "Activities": "mtn-bike hike snowshoe",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "10 km",
        "Town": "Banff, AB",
        "Type": "out-and-back"
    },
    "title": "Water Tower Trail",
    "trail_id": "10491"
}