{
    "description": "5-6-7ish km - A-MAY-ZING, well built, (sculpted even), flowey trail with some fantastic views  It rivals Upper Porcupine Singletrack in Moab for crusing through Alpine pine trees (but this is unfortunately shorter).  Lake Minnewanka is said to be the best legal singletrack in Banff Park, this gives it a run for it's money, so let's go with calling this the best singletrack in Banff under 10km long.  Maybe about 200m total climbing / descending tops, probably closer to 150m.\r\rThe far SE end has an extension (hereinafter called the Toe Nail by me).  It can be bypassed with a couple Tees in it that can be used to shorten up the trail by 1.3km or so if anyone is dragging, but seriously, just do it.\r\rThis and 6 other trails (Hoodoos, Tunnel Mountain Loop Singletrack, Star Wars, The Toe, Snake and Water Tower) form a buncha new mountain bike trails within Banff Park.  In the past, there were *very* limited options for riding in the woods of National Parks.  But thanks to a philosophy change by Parks Canada and some *VERY* hardworking volunteers at the Bow Valley Mountain Bike Alliance (BVMBA), we now have these to enjoy.  And you WILL enjoy them, they're good!.  And even better, there are more coming, the BVMBA tells me late spring 2012 should have another new, technical trail open near Star Wars.  Support you local MBA, BVs trail building night is Wednesdays, bring boots & gloves, they have a Pulaski with your name on it.",
    "directions": "\rYou can park in the Surprise Corner / Point parking lot and ride East and up to Tunnel Mountain Drive, or park in one of the spots along TMD to ride back towards SP.  \r\rTo get to Surprise Corner parking, drive all the way along Banff Avenue and turn left just before (at N side) of the Bridge to the Park Admin building/Banff Springs onto Buffalo Street. Take Buffalo to where it turns into Tunnel Mnt Drive at a sharp left corner and there is free public parking there.\r\rTunnel Mountain Drive runs from Buffalo Street (as above) to the far North end of Banff Avenue\t(900m South of Hiway 1 overpass).\r",
    "geohash": "c3jg",
    "photos": [],
    "source_url": "https://trailpeak.com/trails/the-toe-near-banff-ab-10495",
    "stats": {
        "Activities": "mtn-bike hike",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "6 km",
        "Town": "Banff, AB",
        "Type": "out-and-back"
    },
    "title": "The Toe",
    "trail_id": "10495"
}