{
    "description": "A nice woodland bushwack to 5 waterfalls?my specialty!\r\rI had hiked to some spectacular waterfalls on the lower part of Jeffers Brook a few years ago.  I knew there were more falls in the upper reaches of this brook and I wasn?t disappointed.  Starting off at the end of a logging road, you have to make your way through some new growth.  The walking is ok right now but will be pretty hard in a few years when the thickness of the trees will impede your passage.\r\rOnce you get to the edge of the ravine, the logging stops.  Get down through the evergreen forest to the brook.  Immediately upstream of my gps track lies the first 20ft waterfall.  Walk downstream from this point and be prepared to see two more waterfalls (10ft and 35ft).  The second and largest on must be impressive in times of high water which unfortunately wasn?t at the time of my visit.\r\rOnce you get to the confluence of the two brooks, another waterfall awaits you at the bottom of a narrowing of the brook.  This time there is a deep poll at its base perfect for swimming.  Come back upstream and follow the other branch of the brook upstream for about 500m.  There are signs throughout of an old road on the bank of the brook but you mostly follow the brook?s edge and through the mixed forest until you arrive to a spot where two branches of the brook meet.  There are two falls at this spot one of which is actively carving the crevasse it sits in.  From then on, you can notice from my gps track that I be-lined through the logged area to shave some time on my return to my vehicle.\r\r\r",
    "directions": "From Parrsboro, take the beaver dam rd which becomes Newville Rd.  turn right on dirt road leading to cell tower at  45°26'40.97\"N, 64°19'48.16\"W.  Follow this road turning as required and park at  45°27'57.35\"N, 64°17'38.43\"W\r",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/10506/reg_DSC-0025-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10506/reg_DSC-0027-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10506/reg_DSC-0037-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10506/reg_DSC-0041-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/upper-jeffers-brook-falls-near-parrsboro-ns-10506",
    "stats": {
        "Activities": "hike snowshoe",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "4 km",
        "Town": "Parrsboro, NS",
        "Type": "out-and-back"
    },
    "title": "Upper Jeffers Brook Falls",
    "trail_id": "10506"
}