{
    "description": "This is a hike that takes you unto the circumnavigation of Cape Sharpe in search of a local legend called Maiden's cave.  The legend was described in a 1937 book called Down in Nova Scotia by Clara Dennis.  The short of it was that a British Maiden was captured by pirates and stashed in a sea cave.  The cave entrance was subsequently filled in.  Afterwards, Micmacs could hear a cry in the cliff and opened up the entrance to find her squeleton.  Locals say that at certain times of the year you can still hear her cries!\r\rWell that was enough for me to make me seek out the cave!  I only had the vicinity of Parrsboro at Black Point to go on.  Cape Sharpe is located near a place called Black Point so I decided to go around the whole cape to see if I could find the cave.  I started on the east end and made my way west. This hike needs to be done in the absolute lowest tide to make sure you can go around the tip of Cape Sharpe.  I cross the mud flat of West Bay towards the towering cliff of the eastern end of Cape Sharpe.  These rocky cliffs are very impressive up close and a couple of hundred feet in height.  Rounding off the point is difficult due to the huge amount of rockweed you have top go through.  You basically have to scale to the base of the cliff to make the eastern point of the Cape.  At all time you have a magnificent view of Cape Blomidon and Cape split in the distance.  \r\rOnce you've rounded the corner, the walking becomes easier and you can spot one large opening in the rock wall before you get to the lighthouse.  Right beneath the lighthouse you should spot another opening.  Following the lighthouse and heading west, the geology changes for a little while and in this area you find a lot of fissure cave with the deepest one maybe about 4m.  There are signs of rockfalls over openings which lead you to believe in the legend.  Further on, the geology changes again and this time around you come up to an area where only a thick layer of rock remains on a 60 degree angle and you can enter basically a rocky lean-to.  Almost to the end of the western end of Cape Sharpe you come up to an area that has two natural arches and another cave like opening that has a secondary entrance.\r\rAll in all this area has multiple openings any of which is probably the basis for the legend.  Consider this case ?closed.  Now I just need to come back on a high tide day to hear the cries!\r\r\r",
    "directions": "From Parrsboro, Take Whitehall Rd, which becomes West Bay Rd and park at 45°22'18.94\"N,  64°23'40.14\"W.  Strike east from here down along a secondary dirt road.  Follow it straight down to West Bay.\r",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/10505/reg_DSC-0009-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10505/reg_DSC-0012-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10505/reg_DSC-0013-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10505/reg_DSC-0015-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/maidens-cave-near-parrsboro-ns-10505",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "5 km",
        "Town": "Parrsboro, NS",
        "Type": "out-and-back"
    },
    "title": "Maiden's cave",
    "trail_id": "10505"
}