{
    "description": "They call Dartmouth the city of lakes and this is a description of a paddle in one of its largest lakes; Morris Lake.\nThere is a public boat launch at the northern end of the lake just off the Portland estates blvd.  From the launch, paddle straight down the lake or approximately 3.5 km to the opposite end. \nIn the first km, there are houses on both the eastern and western banks of the lake.  At the 1km mark, you will come across a small island which has a camping site in the middle. After the island, both banks become devoid of houses since the lake is on the border of Shearwater lands on the west bank and there are no streets running close to the eastern bank.  After another 500m after the island, there is a long spit of land that juts from the eastern bank into the lake.  \nAgain there is another camping spot on this spit.\nRight after the spit, you come out to the widest portion of the lake... probably a good 1km across.  From here you have two branches of the lake that you can explore.  If you follow the western bank, you will come across a small playground and beach.  This is a beach thats sits inside the Shearwater base and holdings. \nIf you follow the eastern bank instead, you will see another smaller island and then follow a nice rocky wall.  On top of this wall , there is an unofficial trail and people are sometimes seen jumping off these small cliffs into the lake.  At the end of this portion of the lake is the Kiwanis Beach where you could launch your boat as an alternative. \nWatch carefully for ospreys and the loons that inhabit this hidden urban gem.",
    "directions": "Portland St to Portland Estates blvd.  At the end of the blvd, turn left and \nthen immediately right (just past the tennis courts)",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/10502/reg_2011-06-07-035-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10502/narrow_2009-10-30-149-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/morris-lake-near-halifax-ns-10502",
    "stats": {
        "Activities": "river-canoe sea-kayak",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "7 km",
        "Town": "Halifax, NS",
        "Type": "out-and-back"
    },
    "title": "Morris Lake",
    "trail_id": "10502"
}