{
    "description": "Mount Boucherie is what is left of a stratovolcano created approximately 60 million years ago. The summit offers a 360 degree view of the Central Okanagan Valley.\nThis trek can be done as a loop or a straight up and down. Parking is available at different areas which all have access to the trail head, but I would recommend starting at Eain Lamont Park.\nIf you are wanting a short but intense 1km hike to the top, take the path from the parking lot to the right and meander along the flat, well worn trail behind the residential areas for approximately 15 minutes where you will come to the trail head to the left on the Northeast side of the mountain. This path starts out steep and just gets steeper. I would not recommend ascending on this side for the faint of heart. There are a lot of heavy, rocky and shaky areas which you must climb up and over, sometimes using your hands for balance and leverage. Rock slide areas and loose gravel made footing unstable in parts. That being said, the unobstructed views from this side of the mountain are spectacular.\nAt the summit you receive the reward for your efforts with some incredible views of downtown, Lower and Upper Mission, West Kelowna and Shannon Lake.\nWe ascended on the opposite side of the mountain which was also steep in parts but much more manageable. Some views on the descent were obstructed by trees. It was approximately 2kms down the opposing side of the mountain lending towards a full 3k loop in total.",
    "directions": "Travelling South from Kelowna: Take Hwy. 97S across Bennett Bridge; turn left at Hudson Rd.; turn right on Guidi Rd.; turn right on Trevor Rd.; this road becomes Lakeview Cove Rd. Entrance to park is on left across from a pullout on right.\nTravelling North from Peachland: Take Hwy. 97N; turn right at Hudson Rd.; from here directions are same as above.",
    "geohash": "c2fgx5",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/10511/long_IMG-4230-40902.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10511/reg_IMG-5445-40396.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10511/reg_IMG-5452-40396.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10511/reg_IMG-5458-40396.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10511/reg_IMG-5470-40396.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10511/narrow_IMG-5448-40396.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mount-boucherie-near-kelowna-bc-10511",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 5,
        "Time": "1 hrs",
        "Total Distance": "3 km",
        "Town": "Kelowna, BC",
        "Type": "out-and-back"
    },
    "title": "Mount Boucherie",
    "trail_id": "10511"
}