{
    "description": "This is a small description of a hike I took with my family in Sir Sandford Fleming Park (aka the Dingle).  The park offers woodland trails, a playground and a small sandy beach.\r\rFrom the main parking lot, strike for the northwest arm.  This is where playground and the small beach and wharf are located.  There is also a public boat launch at this spot.  From the playground, aim towards the stone tower (The Dingle).  It?s under renovation until August  2012 but usually you can access to it?s viewpoint at the top.  Continue heading into a NW direction as the trail follows the water?s edge.  At some point you should be able to spot a small woodland stream cascades down a small?..make that very small waterfall (2ft).  The trail enters the wood at this point and you are faced with many different loops.  We headed again more into a NW direction as the official and some unofficial trail started to climb into the forest.  There are large erratics everywhere and the forest is a nice mixture of semi-mature evergreen and deciduous trees.  Lots of ground cover in the form of Labrador tea and pitcher plants.  \r\rWe ended climbing through an unofficial but easy to follow trail for a while until we met again the large trail.  At some point you will see the roadway you came down to the parking lot with.  Basically this road bisects the park into two halves.  Follow the road down towards the parking lot and there will be two trails that intersects it on your right hand side.  One is a set of steps that if you take up will lead you to the Frog pond (Described in another trailpeak posting).  The other trail will eventually lead you to the parking lot if you follow my gps track.  The forest in this part is mostly mature evergreen with again lots of small boulders scattered throughout.\r\r",
    "directions": "Take the Purcells Cove Rd until you turn left on Fleming Drive and/or Dingle Rd.  Drive all the way down the hill to the parking lot.\r",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/10514/reg_DSC-0071-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10514/reg_DSC-0073-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10514/reg_DSC-0075-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10514/reg_dingle-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/the-dingle-near-halifax-ns-10514",
    "stats": {
        "Activities": "hike snowshoe",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "3 km",
        "Town": "Halifax, NS",
        "Type": "out-and-back"
    },
    "title": "The Dingle",
    "trail_id": "10514"
}