{
    "description": "This lower-elevation hike looks across Golden Ears Provincial Park. The great part of this park is that there are so many trail options to enjoy in  this area, however only two trails to reach the same endpoint are  described here. The two trail options--one counter-clockwise loop and  one linear trail option--lead to a viewpoint looking west to the Fraser  delta and beyond. The loop trail, though slightly longer, takes you  through the plateau northwest of the summit with a series of attractive  little lakes. The linear route is a less scenic option if reaching your  destination quickly is your preference. \nOne thing to consider with this hike is that the trail follows an old logging  road that is shared by mountain and dirt bikes, though I have yet to  encounter other visitors on these trails. \nBecause this area is used by mountain bikers, there is an abundance of  trails intersection throughout this described trail and many markers are  placed which can make the path somewhat confusing. The correct  trail for  the loop option is marked by green marking tape, which sets it apart from  many of the orange and blue markers placed elsewhere in this park. \nPass the yellow gates and begin up the Blue Mountain Forest Service Road, There are many return options from the loop trail that intersect on the left of this road. Continue up the road to cross the power lines and about 5 minutes above the lines is an older road on the left with a rusty culvert (the turning point for the linear ascent), however you continue straight for another 10 minutes to a junction where you go left, following the green markers and rock arrows. This is a lesser road and is straightforward hiking for the next 30 minutes to a junction where you go left, uphill to another junction 50m farther where you go left again (still following the green markers). This is now the plateau area where you must cross a few creeks and pass a couple of lakes before singing around to the west of Blue Mountain`s summit to a viewpoint. the valley of the Alouette River, the Pitt River lowlands, Burnaby Mountain and even Burrard Inlet and Gulf Islands are all visible. To return, descend the trail through a rutted gully marked with pink and orange tape, then  turn left at the intersection. Descend a very worn road with intruding bedrock to a downhill junction where you swing left to cross a major creek (be careful, the log is slippery!!). This road can be followed back to your ascent road at the rusty culvert. If you happen to continue descending rather than turning left, not to worry...you will meet up with the Service road at some point :)\nFor a linear ascent, turn left at the rusty culvert 5 minutes above where the power lines are. This lesser road consists of plenty of rock surrounded by running water. You will cross several minor creeks until you reach a major creek (described above); cross with caution as the log is somewhat slippery. Immediately turn right uphill and follow the road. The road will \nbend here and there until you reach a fork, which you turn right. Continue on this path until you see a small dirt path on the right named `San Fran42`...you will also notice a green marker and rock arrow pointing you in the right direction. This is the gully described above marked with pink and orange tape that leads steeply uphill until you reach the viewpoint. \nReturn the way you came. \nThere are tons of other excellent trails in this area. \nLOOP TRAIL:\nRound trip 15.5kms\nElevation gain: 620m\nAverage grade: 8%\nAllow: 6hrs (4hrs linear)\nHigh point: 890m\ngood from June-Oct \nEnjoy :)",
    "directions": "Turn north off Highway 7 (Lougheed) onto 272 Street. Go north for just less than 6km to turn left onto Dewdney Trunk Road and, 0.7km west, turn right onto McNutt Road. Just before McNutt Road's intersection with 128 Ace, 1.5km from Dewdney Trunk Road, park on the right close to the mailboxes. Walk north on McNutt road, until you reach two yellow gates--this is the trailhead.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/10528/long_Untitled-Panorama1-35773.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10528/reg_IMG-7730-35773.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10528/reg_IMG-7754-35773.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10528/reg_IMG-7763-35773.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10528/reg_IMG-7788-35773.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10528/reg_IMG-7791-35773.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10528/reg_IMG-7811-35773.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10528/narrow_IMG-7729-35773.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10528/narrow_IMG-7782-35773.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/blue-mountain-near-maple-ridge-bc-10528",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 3,
        "Time": "6 hrs",
        "Total Distance": "16 km",
        "Town": "Maple Ridge, BC",
        "Type": "out-and-back"
    },
    "title": "Blue Mountain",
    "trail_id": "10528"
}