{
    "description": "A short trail leads through pine forests and wetlands to 8 metre high Babcock Falls. The wet sections have wooden boardwalks. Some unique wetland flowers arefound along the trail.\nThe trailhead is 200 metres before the Core Lodge. The parking lot is on the left side of the road at km 13.8. The trail crosses a small creek, crosses the mine access road (watch for truck traffic), descends through swampy willow thickets, then joins a reclaimed exploration road and passes into wet subalpine meadows. The tree and plant species found here contrast with those on the drier slopes of the Boulder Gardens.\nThe developed trail ends overlooking the falls, but a short steep path leads to the pool right at the base of the falls, which are formed from a lip of resistant sandstone. Fossilized logs can be found in these rocks, especially around one small overhang with agood view of the falls.\n© 2011 Wolverine Nordic and Mountain Society",
    "directions": "Directions to the Core Lodge From Tumbler Ridge, drive south on Highway 52 (the Heritage Highway; the section heading south from town is known locally as the Boundary Road). The paved road passes the turnoff to Kinuseo Falls at km 12.7. Keep going straight on the Heritage Highway for 6.8 km to a right turn onto the Core Lodge road. This road is radio controlled - watch for industrial traffic. At 12.5 km, there is a fork. Take the right fork, following the sign saying ?all other traffic?. The left fork is for mine traffic only. From the Heritage Highway, it is 14 km to the Core Lodge.",
    "geohash": "c3cbr",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/10524/narrow_IMGP0681-11997.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10524/narrow_IMGP0686-11997.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/babcock-falls-near-tumbler-ridge-bc-10524",
    "stats": {
        "Activities": "snowshoe hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 5,
        "Time": "1 hrs",
        "Total Distance": "2 km",
        "Town": "Tumbler Ridge, BC",
        "Type": "out-and-back"
    },
    "title": "Babcock Falls",
    "trail_id": "10524"
}