{
    "description": "The top of Elk Mountain offers a spectacular view of Chilliwack, Cultus Lake, and the surrounding Fraser Valley area. The hike itself begins with a steady incline up the mountain through a beautifully forested area. The trail is wide and easy to navigate but the top section is very steep and the loose dirt is very slippery. Be very careful on this section of the trail. Make sure you bring lots of water with you on this hike as there are no creeks and hiking up this mountain on a hot day will make anyone very thirsty.The first viewpoint comes 1 hour and 20 minutes after hiking uphill. It is one of the most scenic with a view of Cultus Lake on the left and the Chilliwack region on the right. Catch your breath and have a snack beforeattempting the peak. The last part that takes you up to the peak is steep so take your time. Once at the top, you will be treated to a beautiful view of the Border Peaks as well as being able to see the Chilliwack River below and the United States off in the distance.Relax here for awhile before making the final descent back to the parking lot. Make sure to leave enough time for the hike back down as some of the steeper sections at the top can take longer to traverse.",
    "directions": "Driving to the start of Elk Mountain can take over an hour and a half but it is very easy to find. Take Highway #1 eastbound and turn off at Exit #123, Prest Road. After exiting, turn right and head south for approximately 4km.Turn left on Bailey Road and after just 1km, the road will split. Go right and head up the hill along Elk View Road. and continue for 8km of paved road. The road will turn into gravel and continue another 2km until there is a clearing on the left. Park here and start the trail at the far end. There is an outhouse at the start of the trail.See an earlier post of Elk Mountain (to Thurston Mountain) added  here   on trailpeak for GPS and an alternate description.",
    "geohash": "c29r",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/10523/reg_208391-5509132189-5977-n[1]-45621.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10523/reg_208727-5509142189-6515-n[1]-45621.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10523/reg_216122-5509182189-4278-n[1]-45621_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10523/reg_216386-5509137189-6248-n[1]-45621.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10523/reg_217156-5202422189-5675-n[1]-45621.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10523/reg_Elk-Wedding-35233.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10523/reg_IMG-5002-40365.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10523/reg_IMG-5020-40365.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10523/reg_image-50106.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10523/reg_image-50797.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/elk-mountain-near-chilliwack-bc-10523",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 4,
        "Time": "4 hrs",
        "Total Distance": "7 km",
        "Town": "Chilliwack, BC",
        "Type": "out-and-back"
    },
    "title": "Elk Mountain",
    "trail_id": "10523"
}