{
    "description": "A nice set of single tracks were resurrected  in the Portland Estates neighborhood.   This set of single tracks used to be in pristine conditions until Juan came through.  Afterward for a few years only the main passages were cleared of the debris with most single track unusable.  Fast forward to 2012 and luckily some individuals ahave been working hard to get these trails back into shape.\r\rThere are some trails marked with some yellow or red flagging tape to get you along. What you need to know is this.  Most of the climbs/descents occur parallel to the eastern side of Russell Lake.  There are at least 3 or 4 main routes down this slope.  There is a trail that runs the periphery of the lake.  The new housing development on the western side of Russell Lake is slowly encroaching some of those trails.  On the other hand they have created a brand new hard pack trails complete with a small wooden bridge. It?s not a long section but you can really get some speed in that section.\r\rTo the south of the trails lies the Shearwater helicopter base.  You might find yourself popping in from time to time in a large grassy field lying between Portland Estates and the base.  There are a series of dirt jump in this section.  Most of the trails have a lot of roots showing as well as some rocky section so it?s not the smoothest trail around but typical of NS terrain.  Overall you can probably log a few km without repeating some sections making it a good spot to go explore when you do not have much time.\r\r",
    "directions": "Drive to the End of Portland Estates blvd and park at 44°39'33.33\"N, 63°30'59.33\"W\r",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/10522/reg_russell-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/russell-lake-near-halifax-ns-10522",
    "stats": {
        "Activities": "mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "4 km",
        "Town": "Halifax, NS",
        "Type": "out-and-back"
    },
    "title": "Russell Lake",
    "trail_id": "10522"
}