{
    "description": "Here is an easy trail to do with your family or when you may not have a lot of time on your hands.  The turn around point is a moderate cliff cavern near Blomindon Provincial Park.\nFrom the lower parking lot in the provincial park, aim for the trail that takes you down to the sea level.  Come down two long sets of stairs to the seafloor.  \nTiming for this hike is imperative unless you want to get caught by the tide.  Once you are the seafloor, look to the left to the majestic cliffs of Blomindon.  To the right, is another set of very veinal sandstone cliff.  about 1km from the stairs lies a cavern.  Set forth from the stairs and find a small waterfall immediately.  In front of the waterfall it looks like the remains of an old whack.  \nThe water in the waterfall disappears in cobble stone only to reappear 100m downstream as a strong spring a mist the sand.\nOnce you have past the old wharf, you should be able to take off your shoes as the sand is soft but not too muddy in the upper reaches.  If its sand you're after there is lots of that too but more towards the sea.  Lots of clam holes in some sections as well.  The sandstone cavern is nice and large so that you can enter.  \nOnce inside the opening of the cavern lends itself very well as it frames nicely the scenery.",
    "directions": "From Wolville follow the indications to Canning.  Once in Canning, continue straight through the village and turn left once you see a sign for Blomindon provincial park.. The trail starts at the lower parking lot in the provincial park",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/10534/reg_DSC-0173-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10534/reg_DSC-0176-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10534/reg_DSC-0177-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/blomindon-cave-near-wolfville-ns-10534",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "2 km",
        "Town": "Wolfville, NS",
        "Type": "out-and-back"
    },
    "title": "Blomindon cave",
    "trail_id": "10534"
}