{
    "description": "More of a walk than a hike, with only 400 m total elevation gain over 12 kms. But a very pleasant walk on a new trail, with a lot of fine gravel surface, no roots, no rocks, very little mud.\r\rThis part of the trail often parallels the highway, the railroad and the power line, but they are generally inconspicuous, with several areas sufficiently far from the highway where you don't hear the traffic. There are several creek crossings, including the Cheakamus River. At Calcheak campground, you will cross Callaghan Creek on a suspension bridge just before it flows into the Cheakamus River. Excellent place to have lunch on one of the campground tables. \r\rApprox 600 m south of the suspension bridge, you will arrive at \"McGuire\". At this point, you can either cross the railroad track and continue on the Sea to Sky trail, or continue on the real hiking trail, running east of the railroad track. It is the same distance to Brandywine Falls, 3.5 kms.  For this other trail, and more photos, see Whistler CalCheak trail # 10079 (on this website).\r\rIf you go the Sea to Sky trail, walk approx 500 m and turn left at the yellow gate, along the power line.",
    "directions": "This is a 2 car hike, or a 24 km return hike. Leave 1 car at Brandywine Falls and head north to Whistler in the other car.\r\rOn arriving at Whistler, the first traffic light is at Function Junction, with  Cheakamus Lake Road on the right. Set your odometer to 0, turn right on Cheakamus Lake Road, keep right onto Legacy Way, and immediately right onto Jane Lakes Road. At 1.2 kms, you will see the Sea to Sky trail sign on your right. You can park on the left side just ahead, where the road widens.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/10541/long_DSC08212S-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10541/long_DSC08228S-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10541/reg_IMG-0146S-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10541/narrow_IMG-0151S-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10541/narrow_IMG-0153S-7359.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/sea-to-sky-function-junction-to-brandywine-falls-near-whistleralta-lake-bc-10541",
    "stats": {
        "Activities": "mtn-bike hike snowshoe",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 4,
        "Time": "4 hrs",
        "Total Distance": "12 km",
        "Town": "Whistler/Alta Lake, BC",
        "Type": "out-and-back"
    },
    "title": "Sea to Sky, Function Junction to Brandywine Falls",
    "trail_id": "10541"
}