{
    "description": "A good work out for a whole day, as you have to boat over to Gambier Island by private boat or water taxi. You can also find a description of part of this trail in 103 Hikes in SW BC. You'll find some very large old growth cedars, and possibly the tallest ferns you'll ever see, up to approx 6 ft tall.\r\rThe book has the trail start at the dock at Halkett Bay Prov Park. We started sw of there at the dock at Camp Fircom (see the map and GPS data).\r\rFrom the dock, it's approx 2 kms on gravel road to the trail. Follow the blue/white signs to \"Mt Artaban Trail\". You will rise approx 150 m on the roads (of 610 to the summit).\r\rThe trail is both good and bad, some areas very good, others somewhat overgrown, not too much roots and rocks. Its approx 2.5 on the trail to the summit, 450 m up, so quite steep in several areas. \r\rOn the summit, take a break and view the scenery, with excellent views of Howe Sound and the Coast mountains, including Harvey, Brunswick, the west Lions, etc.... Cross the summit lengthwise (south to north) and you'll find the trail down and north. It's another 2.5 kms to the end of the trail, to the road running north/south along part of the east side of  the island. This part of the trial is rougher than the up trail, but well marked. Unfortunately, there is no public area nearby, we walked further north along the road, found a clear lot with views of Howe Sound and the Coast mountains and had lunch at the edge of the cliff, in some shade.\r\rWe walked back south along this road, appros 2 kms to the end (a dead end). At the major fork, keep right (the left fork is marked \"Private Property\") and go to the end. At the end, there are no markers indicating the trailhead, but here is an obvious trail heading into the forest. After approx 100 m, you'll see orange/grey markers. You're on the right trail. Keep heading south, following these markers. Its's approx 2 kms to Halkett Bay dock and beach, a great place for another break. \r\rKeep heading south on the same trail approx 3 kms to the . At a major intersection, turn left to Fircom Camp. At the Camp property line, there is a sign saying it's private proerty asking not to enter. We just proceeded through, met some staff of the camp, they were very frindly and even guided us along. They have a pie and pastry market on summer weekend days, we indicated we were interested, that may have made the staff more friendly (Our group probably spent $100 at the market)..\r\rFrom the market, it's a few steps down the hill to the dock where we started.",
    "directions": "Get to Horseshoe Bay ferry terminal. You can either drive along the Upper Levels Highway to Horsehoe Bay. There's lots of parking, make sure you pay for the whole day, they check like hawks and try to collect ridiculously high charges if you haven't paid enough. Or, take the 257 Express bus westbound on West Georgia, at Pacific Centre in downtown Vancouver.\r\rIf you don't have a boat, contact Cormorant Water Taxi and enquire about schedules and prices to Fircom Camp dock on Gambier Island (we left at 8:30 am on a Saturday and rode back at 5 pm, cost was reduced as we were a large group (17 persons).  They launch from the long government wharf, at the end by the dock house with the red roof. The dock starts just before (east side) of the Boathouse Restaurant.\r\rSee: http://www.cormorantwatertaxi.com/index.htm",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/10562/reg_Img164S-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10562/reg_P1030262S-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10562/reg_P1030268S-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10562/reg_P1030275S-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10562/reg_P1030276S-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10562/reg_P1030316S-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10562/reg_P1030319S-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10562/reg_P1030323S-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10562/reg_P1030324S-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10562/narrow_Img162-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10562/narrow_Img163S-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10562/narrow_P1030260S-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10562/narrow_P1030263S-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10562/narrow_P1030277S-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10562/narrow_P1030309S-7359.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mount-artaban-gambier-island-near-bowen-island-bc-10562",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 4,
        "Time": "7 hrs",
        "Total Distance": "15 km",
        "Town": "Bowen Island, BC",
        "Type": "out-and-back"
    },
    "title": "Mount Artaban, Gambier Island",
    "trail_id": "10562"
}