{
    "description": "A new, new trail (2011), we rode it a couple times in early 2012.    4km with about 270m of cumulative descending (and only 20m of climbing once you're at the top).  GRRRREAT FLOW, a couple fun short but steep sections, lotsa trees to avoid, a couple bridges over some bogs, a really nice trail down from Ranger Summit.\nA well built, singletrack trail brought to you by the *very* hard working Greater Bragg Creek Trails Association (GBCTA) who are a purely volunteer group (and who would be happy to have your help on a trail build day).\nIf you're biking, it is rideable in either direction and has pretty good flow.\nIn addition to the old standbys' Iron Creek and Elbow trails, SB also ties into a number of other open and under-construction trails such as Ranger Summit, Strange Brew, Sugar Momma, Fullerton Loop, and in the future, BobCat, Snakes and Ladders.  It can also use these and the newer Snagmore Hill and Boundry Ridge trails to make a longer circuit.\nCAUTION!  It is open to hikers, bikers, horse-ers and snowshoers, so make sure you ride in control and don't spook the other users.",
    "directions": "Take Hiway 22 (or hiway 8 from Calgary west) to Bragg Creek. Cross the only bridge and turn left at the T. Follow that all the way out (9km) to the Provincial Recreation area (road turns into gravel at rec area gates). Follow the gravel to the parking lot at the end. Trail starts from the middle of the Sorth side of parking lot.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/10566/reg_image-53856.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/strange-brew-near-kananaskis-ab-10566",
    "stats": {
        "Activities": "snowshoe hike mtn-bike",
        "From": "",
        "Seasons": "winter fall summer",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "4 km",
        "Town": "Kananaskis, AB",
        "Type": "out-and-back"
    },
    "title": "Strange Brew",
    "trail_id": "10566"
}