{
    "description": "This here is the BIG LOOKOUT trail, not the touristic look out trail that starts at the discovery center! The view at 612m is AWESOME and you will see north up to cow head, see the table lands, gros morn mountain and very far south! (I think I even saw blow me down prov. park) It's supposed to be the BEST view in the gros morn national park!",
    "directions": "This trail is far less used and not an official trail of the park, though you can find the trail.You can start either by climbing the regular look out trail at the discovery center and from there heading directly to the big look out peak (you already see it from far!) and go down the way I did go up or climb from the point I did and return the same way or at the look out trail, either way, you got many choices!The big lookout trail I did starts at woody point. Go the water tower on the top of woody point, right there is an ATV trail at the right side of the water tower that crosses a small creek. Only a few meters after this creek on the left hand the trail starts. Or you use my GPS coordinates, that is much easier.I included the descent trail and not the climbing because when returning I found a much better way then when going up. On the plateau on the top it's hard to find the trail.On the plateau are supposed to be many moose although we didn't see any. Be aware of bad weather conditions, I can imagine that you won't find back if you don't have a GPS and you have a bad view when going back!The trail itself is pretty steep for the first part, then on the plateau again pretty flat and at the end again pretty steep going to the peak. It took me about 3h going up and little bit more than 2h of moving time going down.",
    "geohash": "f8yc",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NL/10569/long_D77-7638-MINI-40676.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10569/long_D77-7697-MINI-40676.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10569/reg_D77-7713-MINI-40676_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/10569/narrow_D77-7627-MINI-40676.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/big-look-out-near-rocky-harbour-nf-10569",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 5,
        "Time": "5 hrs",
        "Total Distance": "11 km",
        "Town": "Rocky Harbour, NF",
        "Type": "out-and-back"
    },
    "title": "Big Look Out",
    "trail_id": "10569"
}