{
    "description": "A small hike near Tantallon brings you to some impressive 40-80ft rocky cliffs in the middle of nowhere.  From the ball field, go left and start hiking north on the ATV trail.  You will hike about 1.2km on this well maintained trail.....you could also men bike it to save some time.\nThe trail slowly goes downhill and eventually leads you to a swampy area.  the old trail traverses a section that you will sink to your thighs pretty quickly (as I did).  There is a secondary trail just a bit further that traverses the area at a higher elevation keeping you high and dry.  You should come up to a small wooden bridge at this point.  Follow the stream upstream from this point.  a faint trail appears from time to time but the ferns and small shrubbery get in the way.  \nAt some point the stream will have a few cascades and the ferns and  shrubs will dissapear and leave you in a mature evergreen forest that's heavily carpeted by a thick layer of moss.  The cliffs should materialize to your left and are very impressive.  The rock is solid, lots of cracks and other features and the are straight as an arrow.  I think this area is probably already used by climbers as there is a well maintained path along the bottom and some at the top of the cliffs",
    "directions": "Highway 3West  from Tantallon towards Boutillier's Point.  Turn right on Island View Dr and then right again at the sign to the ball field.",
    "geohash": "dxfw0",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/10561/reg_DSC-0001-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10561/reg_DSC-0002-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10561/reg_DSC-0005-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10561/reg_image-45360.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/otter-marsh-cliffs-near-halifax-ns-10561",
    "stats": {
        "Activities": "climb hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 5,
        "Time": "1 hrs",
        "Total Distance": "4 km",
        "Town": "Halifax, NS",
        "Type": "out-and-back"
    },
    "title": "Otter Marsh Cliffs",
    "trail_id": "10561"
}