{
    "description": "This trail climbs to the top of Mount Tammany, which is the mountain overlooking the Delaware River on the New Jersey side of the Delaware Water Gap.  There are great views of Mount Minsi (on the PA side of the river), and Pennsylvania mountain ridges in the background.  You can also see people rafting in the Delaware if it's a nice summer day.  The hike is in the book 50 Hikes in New Jersey hike #5).  By itself, it is only 4 miles long (6.437 km).  We combined this hike with hike #6 in that book, which goes to the top of the Kittatinny Ridge (Sunfish Pond).  When hiking down from Tammany, you will intersect the Appalachian Trail (AT).  If you make a right on the AT, it will take you to the top of the Kittatinny Ridge.  If you include the hike to Sunfish pond, the total mileage ends up being 11 miles (17.7km).  On the day we hiked, we encountered a black bear ambling across the trail near Sunfish Pond!  He looked us over, and went on his way fortunately.",
    "directions": "From NJ, take I-80 west to the Delaware Water Gap.  Take the exit for the last rest stop before the bridge to Pennsylvania.  The trailhead leaves from the rest stop.  There is also a parking area about 50 yards down the road for the Appalachian Trail.  That trailhead goes to Sunfish pond, but you can easily walk to the Tammany trailhead from that lot as well.  If you miss this exit, take the last NJ exit before the bridge, and it will take you to the NJ Delaware Water Gap visitor center.  From there, you can go back under I-80 and find these 2 parking areas.",
    "geohash": "dr69",
    "photos": [],
    "source_url": "https://trailpeak.com/trails/tammany-trail-delaware-water-gap-near-allamuchy-nj-10577",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 5,
        "Time": "3 hrs",
        "Total Distance": "6 km",
        "Town": "Allamuchy, NJ",
        "Type": "out-and-back"
    },
    "title": "Tammany Trail Delaware Water Gap",
    "trail_id": "10577"
}