{
    "description": "A small hike up Church Vault Brook (or Canada Creek) will lead you to a series of beautiful waterfalls. There are two main falls of about 15-20ft but do not let the height fool you these are well worth the trip up to them\r\n\r\n\r\nFrom the bridge, keep to the western side of the brook, Beat your way through the small underbrush until you come under the canopy of trees. You should be able to spot a faint trail. Follow this trail or if you do not find it, follow the stream upstream for about 5 minutes to the first fall. The next few waterfalls upstream are no more than few minutes more.\r\n\r\n \r\n\r\n\r\nThe forest near the falls is a mixture of evergreen and deciduous and easy to travel through. The main section that is difficult is near the road but doesn?t last very long. This is a nice little stroll to do when you are passing in the area and do not have enough time to venture out for a longer period.\r\n\r\n\r",
    "directions": "\r\n\r\n \r\n\r\n \r\n\r\n \r\n\r\n \r\n\r\n \r\n\r\n \r\n\r\n\r\nHighway 101, exit 15 turn right on highway 360 and up the North Mountain. Turn right on Russia Rd and then left on Black Rock Rd. Church Vault Brook or Canada Creek is located at approximately 45.170093°, -64.743467°. Park near here and hike the brook upstream.\r\n\r\n \r\n\r\n \r\n\r\n ",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/10571/reg_DSC-0026-edited-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10571/reg_DSC-0033-edited-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10571/reg_DSC-0041-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10571/reg_DSC-0043-edited-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10571/narrow_DSC-0019-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/church-vault-canada-creek-falls-near-greenwood-ns-10571",
    "stats": {
        "Activities": "snowshoe hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "2 km",
        "Town": "Greenwood, NS",
        "Type": "out-and-back"
    },
    "title": "Church Vault (Canada Creek) Falls",
    "trail_id": "10571"
}