{
    "description": "National trail can be acended or decended and you can add many more miles more than I rode in this review.  Most people ride an up and down on the east side, but you can actually ride National all the way up from the east side of the mountain and then down to the west side which would make it more like a 20-30 mile out and back or you could take other trails such as Desert Classic for an easier return.  You can ride the trail in either direction but both require expert skills and fitness. You cannot and will not find a climb this technical, challenging and fun in AZ.You will find a lot of DH'ers shuttling up the road and starting at Buena Vista then heading down National to the east.  There is a local company that does shuttle but you'll have to find them on the internet because i don't think it is official.Riding down the upper and lower waterfall is probably the most technical and committing section of the trail but if you are not comfortable with it you can easily walk it.  In the attached GPS file I rode up National from the east to the waterfall, made some successful rides down the falls then headed back down National.  I also hopped onto Mormon trail a little bit as well because there is a point where the trail splits then meets back up.Depending on your skill level and how much you want to ride, you can be up there for 2 hours or 5 hours, as there are lots of trails and technical sections to mess around on.For bike rentals: We rented in Scottsdale (near Phoenix) at AOA-adventures for great weekly rates on GIANT and Specialized, allowing you to ride nearby McDowell Preserve or South Mountain.",
    "directions": "1-10 to Baseline Road go right (west) to 48th street. Take 48th street 1/4 mile past Euclid and turn right (sign indicating park entrance). Go 400 feet and turn left head to parking lot/trailhead.",
    "geohash": "9tbm",
    "photos": [],
    "source_url": "https://trailpeak.com/trails/phoenix-south-mountain-national-near-tempe-az-10598",
    "stats": {
        "Activities": "mtn-bike",
        "From": "",
        "Seasons": "spring winter fall",
        "Stars": 5,
        "Time": "2 hrs",
        "Total Distance": "12 km",
        "Town": "Tempe, AZ",
        "Type": "out-and-back"
    },
    "title": "Phoenix South Mountain - National",
    "trail_id": "10598"
}