{
    "description": "The Three Ecosystems\r1) Pasture Spruce - The original forest at the opening to the park would have been a tolerant hardwood stand of maple, beech and birch. The earliest settlers cleared the land to create pasture for livestock. After the pastures were abandoned, the pasture slowly grew up in mostly white spruce trees, which is what is evident today. Overtime the spruce stand that grows today in the former pasture will eventually revert to hardwood climax forest.\r2) Wetland - Beaver Mountain Park has a wetland situated in a natural valley where the remains of a series of beaver dams and flowage can be seen. The beaver moved on to the stream and built their dams which in turn flooded the stream banks and margins cr eating a wetland habitat. \r3) Hardwood Ridge - The back of the park is host to a tolerant hardwood stand, which is in the mature climax stage. There are several species of maples, beech and yellow birch in this stand. In some areas, older trees that have fallen down have created an opening to allow young trees to become established. \r",
    "directions": "Located in Antigonish County near the Trans-Canada Highway 104. After taking Exit 30, turn south, and a very short distance later you will see a service road leading past Riverside Speedway. After turning onto the service road, continue 3 kilometers and you will arrive at the Park's main entrance, where you will find ample parking.",
    "geohash": "f85g1",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/10599/reg_001-41535.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/beaver-mountain-park-near-antigonish-ns-10599",
    "stats": {
        "Activities": "mtn-bike ski-xc hike",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 5,
        "Time": "2 hrs",
        "Total Distance": "6 km",
        "Town": "Antigonish, NS",
        "Type": "out-and-back"
    },
    "title": "Beaver Mountain Park",
    "trail_id": "10599"
}