{
    "description": "A short hike on the outskirts of Fredericton into the UNB woodlot takes you to some dolomite or limestone  outcrop which has been carved out by the Small Corbett Brook into all kinds of weird shape including a small fissure type cave.\r\rThis is a well known local spot as there is an unofficial trail leading you the whole way to the cave site.  There is some flagging tape to aid you from time to time as well.  The bulk of the hike is on a dirt road turned into a multi recreational trail.  Once you cross the brook you enter the forest to the left and more or less follow Corbett Brook downstream for about 200m to the cave.  The forest is dense but a nice path is established.  There are numerous outcrops to look at and or jump over.\r\rThe cave site was a bit abused on the day I was there with some signs of a firepit and discarded clothes.  A large chunk of rock is perched on a smaller one making a nice overhang.  Behind the large stone is a series of small cracks you can enter and explore\r\r",
    "directions": "Vanier Highway.  Take Allison blvd exit and turn right on Knowledge Park Dr.  Parking lot is at 45.922496°, -66.645310°.  Turn to the left and seek the Brook.  Head downstream of the brook\r",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NB/10601/reg_DSC-0012-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/10601/reg_DSC-0013-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/10601/reg_DSC-0015-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/10601/reg_DSC-0019-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/10601/reg_DSC-0021-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/10601/reg_DSC-0023-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/corbett-brook-cave-near-fredericton-nb-10601",
    "stats": {
        "Activities": "mtn-bike hike snowshoe",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "2 km",
        "Town": "Fredericton, NB",
        "Type": "out-and-back"
    },
    "title": "Corbett Brook Cave",
    "trail_id": "10601"
}