{
    "description": "This is a ?walk? as it is a flat walk along the ocean to the Dungeness Lighthouse, but as it is an 18 kms return ?walk? along a beach, we considered it to be a ?hike?. We were 5 hours return, and quite tired when we reached the car.\rObserve the Strait of Juan de Fuca, with Vancouver Island on the north shore, 30 kms across. In fact, from the lighthouse, you can actually see buildings in Victoria. On a clear day, you can see Mt Baker and the Cascades looking east,  Hurricane Ridge looking southwest.\rThe surface of the beach is generally quite firm, with some soft areas, and a bit of slope down towards the water, such that ankles do get tender after a while. Wonderful volunteers greeted us at the lighthouse, and you can climb to the light at the top.\rThings to see along the hike are different types of gulls, Bald Eagles, Harbour Seals, black tailed deer, logs ?sculpted? by the sea, rocks, etc....\rFootwear:  Low cut hiking shoes or sneakers, ?sport? sandals, bare feet(???).\rOther: sunscreen, wide brimmed hat, drinking water (there is water at the lighthouse), food, camera. Even in summer, it was quite cool, I wore light gloves on the return trip facing the breeze.\rWashrooms and water at located only at the trailhead and at the lighthouse.\r",
    "directions": "Approx 10 kms EAST of Port Angeles, WA, probably closer to Sequim than Port Angeles, take the oddly called ?Kitchen-Dick? road north and follow the signs to Dungeness Recreation Area (approx 8-10 kms). Drive all the way in the to parking lot for the DS trailhead. Day charge is $3, unless you have one of several passes allowed, including the 1 week National Parks pass.",
    "geohash": "c28",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/WA/10609/narrow_Dungeness-Spit-2012sm-7359.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/dungeness-spit-near-port-angeles-wa-10609",
    "stats": {
        "Activities": "hike sea-kayak",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 4,
        "Time": "5 hrs",
        "Total Distance": "18 km",
        "Town": "Port Angeles, WA",
        "Type": "out-and-back"
    },
    "title": "Dungeness Spit",
    "trail_id": "10609"
}