{
    "description": "Klahhane Ridge, from Hurricane Ridge to Victor Pass.\rThe trail starts at the east end of the parking area and you should initially go up to Sunrise Ridge. Then, take the Klahhane Ridge trail and head NW over generally open terrain. Lots of flowers, Avalanche Lilies, Glacier Lilies, Lupins, Tiger Lilies, and many more, plus black tailed deer and even a black bear (in the distance).\rAt the foot of Mt Angeles, there will be 2 ?trails? going off to the left. Keep right both times along the Klahhane Ridge trail (not marked). \rAt the ?Switchback Trailhead? sign, take the one on the left (the one on the right is a 2.5 km (1.6 mile) 500 m. trail down to the road). The ?Switchback Trail? on the left has 13 switchbacks, and 240 m, and 1.7 kms to the top at Victor Pass, where the sign of the 5 directions is located. That?s where we had lunch in the company of a well fed marmot, and then came back down. It appears this is the south end of a loop starting near the park entrance Visitors? Centre.\rWeather was excellent, slightly overcast in the morning, sunny in the afternoon, above the clouds, as we drove through the clouds both on the way up and on the drive back down.\r(On the GPS data, ignore the long 16 km straight line from Hurricane Ridge to Port Angeles, I just couldn't figure out how to get rid of it.) \r",
    "directions": "Drive south on Race St in Port Angeles, stop at the visitors? centre just as you enter Olympic NP, and get info and a map. Then drive 17 miles (32 kms) and up from 140 m to 1600 m to Hurricane Ridge. \r",
    "geohash": "c28",
    "photos": [],
    "source_url": "https://trailpeak.com/trails/klahhane-ridge-near-port-angeles-wa-10611",
    "stats": {
        "Activities": "ski-xc hike snowshoe",
        "From": "",
        "Seasons": "summer winter",
        "Stars": 4,
        "Time": "6 hrs",
        "Total Distance": "14 km",
        "Town": "Port Angeles, WA",
        "Type": "out-and-back"
    },
    "title": "Klahhane Ridge",
    "trail_id": "10611"
}