{
    "description": "This is the southern 1/3 of Klahhane Ridge / Heather Park trail that goes all the way to Hurricane Ridge in Olympic NP (see Klahhane Ridge trail). It starts on the right immediately BEFORE the ranger check point on the road up to Hurricane Ridge.There are 2 trailheads here, the Lake Angeles / Klahhane Ridge trailhead on your left and the Heather Park / Klahhane Ridge trail at the far end of the parking lot. Both are 6.2 miles (10 kms) to Victor Pass and 10 miles (16 kms) to Hurricane Ridge.Taking the Lake Angeles trail, it is 6 kms and 700 m up to Lake Angeles, through open forest with large coniferous trees far enough apart to allow light through. The trail bed is excellent, hard packed earth with very few rocks and roots.  Lake Angeles itself was generally fogged in when we got there, with moments of light allowing us to see the small island in the centre of the lake and the huge rock wall on the east side of the lake. Lake area has nice camp sites, but NO facilities (no water, no outhouses). Lots of trout in the lake, 1 group of approx 10 kids said they caught 18 trout the previous day (Aug 1, 2012).  Round trip was 13 kms, ascent was 700 m.Continuing trail to Klannane Ridge / Hurricane Ridge is on the right just before the lake.It is 16 kms (10 miles) from trail head to Hurricane Ridge, so this could be done as a crossover or 1 way trip with vehicles at both ends. It appears the Heather Park trail might be easier, ie, not such a steep climb beyond Lake Angeles, yet climb regardless, as the 2 trails meet at Victor Pass at 1800 m elevation.",
    "directions": "Drive south on Race St in Port Angeles, drive approx 5 kms past the visitors? centre just as you enter Olympic NP. IMMEDIATELY before the ranger check in station, turn right on the road that says ?Trailheads? and park in the 2nd parking lot.",
    "geohash": "c281",
    "photos": [],
    "source_url": "https://trailpeak.com/trails/lake-angeles-near-port-angeles-wa-10621",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 4,
        "Time": "5 hrs",
        "Total Distance": "12 km",
        "Town": "Port Angeles, WA",
        "Type": "out-and-back"
    },
    "title": "Lake Angeles",
    "trail_id": "10621"
}