{
    "description": "The trail starts at the northern end of the parking lot, at 1550 m altitude. Despite a climb of approx 200 m over the first 3 kms to the summit of Hurricane Hill, this is possibly one of the easiest hikes you?ll ever do, as the trail is paved to that point. From the summit of Hurricane Hill, you?ll get a 360 degree panorama, including Mt Baker, Victoria, the San Juan Islands, the BC Coastal Range, the Strait of Juan de Fuca, and many mountains to the south, including the tip of Mt Olympus in the distance.Coming back down approx ½ km, go west on the Elwha Trail. This is where you?ll see incredible flowers, including Indian Paintbrush, Magenta Paintbrush, Columbines and many more. We went approx 1.5 kms to the area where the trail starts to drop quite significantly. We had lunch at that point and headed back, with views from the other direction. The Olympic Peninsula Day Hike book states that you can go all the way to the Elwha River ranger station, with a ?dropping like a dead goose? 4000 ft (1250 m) and 3 mile descent to the station. It?s a cross-over possible hike, but just hope you don?t lose the coin toss and have to come up from the ranger station.",
    "directions": "Drive south on Race St in Port Angeles, stop at the visitors? centre just as you enter Olympic NP, and get info and a map. Then drive 17 miles (32 kms) and up from 140 m to 1600 m to Hurricane Ridge. Drive through the parking lot, drive by the lodge (avoid the deer in the parking lot), and keep going at the west end of the parking lot 1.5 miles (2.5 kms) to the far end, the Hurricane Hill parking lot.",
    "geohash": "c28",
    "photos": [],
    "source_url": "https://trailpeak.com/trails/hurricane-hill-elwha-trail-near-port-angeles-wa-10624",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "10 km",
        "Town": "Port Angeles, WA",
        "Type": "out-and-back"
    },
    "title": "Hurricane Hill, Elwha Trail",
    "trail_id": "10624"
}