{
    "description": "Naramata Creek Park: Elevation 604 meters (1976 feet) Approximately 15.3 KM (9.5 miles) from Penticton, British Columbia. Hiking time round trip- 1 to 1.5 hrs. Round trip roughly 2.4 KM (1.5 miles), elevation gain-158M (518 feet). Best time is usually May to October.",
    "directions": "From Penticton drive north on the East side of Okanagan Lake towards Naramata. The entrance to Naramata Creek Park is approximately 9.5 KM (5.9 miles) from where Reservoir Road intersects N. Naramata Road. The entrance is a narrow gravel road on the right side which leads to a parking area. This very pleasant trail parallels a creek and climbs up though a gulley past some waterfalls. At the top of the gulley it intersects the Trans Canada Trail which follows the rail bed of the Kettle Valley Railway which ceased operations many years ago. One can extend the hike as long as wanted by following the Trans Canada Trail which will provide very scenic views of Okanagan Lake. Be sure to note where the Naramata Creek Trail intersects into the Trans Canada Trail as it can be easily missed on the return trip.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/10630/reg_487677-428153057228118-1893391637-n-11997.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10630/reg_526583-428153493894741-1849300645-n-11997.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10630/reg_549053-428153750561382-2060855353-n-11997.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10630/narrow_376950-428153650561392-647956720-n-11997.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10630/narrow_396018-428153227228101-1835621292-n-11997.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/naramata-falls-near-penticton-bc-10630",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "1 km",
        "Town": "Penticton, BC",
        "Type": "out-and-back"
    },
    "title": "Naramata Falls",
    "trail_id": "10630"
}