{
    "description": "From Obstruction Point, take the trail on the right (in fact, straight ahead) upwards somewhat, but it levels off after the first hill. You will have spectacular views of Mt Olympus on your right, and eventually of Mt Baker and the Cascade Range to the east. At km 4, there is a sign that reads ?Trail ->? encouraging you to keep going east towards Grand Lake and Moose Lake. But there is a trail going south at this point. Did not go that way, but friends did and walked approx ½ hour along the ridges to the point where it gets dangerous to continue. They said the views up there are spectacular.We continued eastward on the main trail towards Grand Lake, with the goal of reaching the point where the trail starts to drop quite abruptly, switchbacking down 400 m to Grand Lake, however, we diverted south to a peak on our left where we had lunch, and eventually returned. We had views of Grand Lake and another little lake from that point, and of course Mt Baker and the Cascade Range.Total hike was 9 kms, approx 250 total ascent, including side trips to tops of ridges.",
    "directions": "Drive south on Race St in Port Angeles, stop at the visitors? centre just as you enter Olympic NP, and get info and a map. Then drive 17 miles (32 kms) and up from 140 m to 1600 m to Hurricane Ridge. Immediately on the left on arriving at the Hurricane Ridge parking lot, turn sharp left onto the gravel road marked ?Obstruction Point?. The drive rises from 1600 m to 1860 m over 13 kms (8 miles) and you arrive at Obstruction Point. 4WD and AWD vehicles are best, but there were a few ?regular? cars at the trailhead.",
    "geohash": "c282",
    "photos": [],
    "source_url": "https://trailpeak.com/trails/lillian-ridge-moose-lake-near-port-angeles-wa-10632",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 4,
        "Time": "4 hrs",
        "Total Distance": "9 km",
        "Town": "Port Angeles, WA",
        "Type": "out-and-back"
    },
    "title": "Lillian Ridge, Moose Lake",
    "trail_id": "10632"
}