{
    "description": "0.0 Penticton 11.3 - The Summerland Agricultural Research Station is now labeled  the Pacific Agri-Food Research Centre. They do not do regular tours of the main facility anymore. The tourist attraction lies at the Summerland Ornamental Gardens (the research garden is run by a non-profit society) which  has created an interpretive centre in the historical Superintendent?s House. Admission is by donation. (April 1, 2000 Sherril Foster, KVSR, Admin Assistant )11.7 - The Trout Creek bridge is the highest bridge on the original Kettle Valley Line and the third largest of its type in North America.  (April 1, 2000 Sherril Foster, KVSR, Admin Assistant ) 12.3 -  Cyclists do walk across the Trout Creek bridge but many prefer not to subject their bikes to the ties (nor are really crazy about walking 73 metres over the Trout Creek Canyon!) and seek an alternate route (9.8, pg. 109) I?m not sure how well-marked this access road is but this would be one way of skirting the bridge and heading down to the highway. Therefore this requires directions as to how to get to the Canyon View Steam Train siding from Highway 97.  Leave Highway 97 at Johnson Street west (left at traffic lights) and head west to Fir Avenue (actually street becomes Fir at corner),  north (right) on Fir which as you climb becomes Gartrell Road; after a fair distance, take  a left hand turn (south) on to Happy Valley Road.  At a corner turning west again, Happy Valley Road becomes Hilborn Street and from Hilborn, another left (south again) is made at Canyon View Road. This road meets up with the southern terminus of the Kettle Valley Steam Railway.  ?An even better idea is to take the train from Canyon View Siding (NOT Summerland Station) to Prairie Valley Station then cycle the road to Faulder....? Hikers and cyclists may board the Steam Train at Canyon View or coming from the other end, at Prairie Valley as well. 2000 fares are $7 and $2 for freight.  Reservations should be made so room may be saved for extra passengers and bikes. (1-877-494-8424, toll-free within BC) Just before Victoria Road South intersects with Simpson Road is the site of the original station, West Summerland. Although there is still (1999) a coach, a few other cars, speeders and the locomotive shed at the West Summerland site, the Steam Train operations are now run from the Prairie Valley Station. (We are presently starting the work on a locomotive shed at the Prairie Valley Station.)  (April 1, 2000 Sherril Foster, KVSR, Admin Assistant ) Bike shop / rentals: Freedom Bike Shop Accomodations: Summerland Resort",
    "directions": "Per above.",
    "geohash": "c2fc",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/10631/reg_179963-428459290530828-106721639-n-11997_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10631/reg_185850-428459397197484-522035595-n-11997.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10631/reg_427220-428860317157392-760226708-n-11997.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10631/reg_487201-428459167197507-1337781362-n-11997.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10631/reg_559218-428459660530791-560400731-n-11997.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10631/reg_599628-428457617197662-1039591067-n-11997.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10631/reg_600137-428459110530846-1095799107-n-11997.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10631/reg_8017-428458953864195-376646151-n-11997.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10631/narrow_375739-428863157157108-1087983001-n-11997.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/kettle-valley-railway-penticton-to-west-summerland-station-near-penticton-bc-10631",
    "stats": {
        "Activities": "hike mtn-bike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 5,
        "Time": "2 hrs",
        "Total Distance": "12 km",
        "Town": "Penticton, BC",
        "Type": "out-and-back"
    },
    "title": "Kettle Valley Railway-Penticton to West Summerland Station",
    "trail_id": "10631"
}