{
    "description": "This is a great few hours that follows an old pipeline for a while, splits off into uphill trail that turns into scrambling up the Peden Bluff side, then picking your way back down towards Peden Lake, where there is a communal cabin, canoe, and fishing.  After canoeing the lake you return steadily downhill, crossing the pipeline, with a stop at a nice waterfall, then back to start.We did the scramble during fairly dry conditions; it would be tough in wet weather.  If you don't want to scramble up, you can continue north and double back towards the bluff on a more gradual incline.  We saw a bear near the point where the trail splits off to the right to head up the bluff; he was off pretty fast, as soon as he heard us.  After some time atop the bluff, you make your way down the NE side - this could be greasy if wet weather, but just take it slow.  It is easy to lose the trail down on this side - we lost the flags on numerous occasions, but knew where we were headed, so always picked up the trail again.  At the south side of Peden Lake there is a stream running out and you have to step over very slippery rocks to get across - this would likely be difficult in the winter/spring.  The trail continues north of Peden Lake and hooks up with Empress Mtn, I think.  We took a wrong turn at the end of this, and ended up at a nice waterfall.  Coming back, cross the piepline, you come to a T, turn right for about 50 mtrs to the waterfall, then double back to take the other side of the T to continue back to the road.",
    "directions": "Drive to Sooke, turn right at Sooke Potholes Prov Park and follow Sooke River north.  drive through gate and park about 1.5 km later.  Gate doesn't open until 0800, so if you're early, park at the gate and walk 1.5 km up the road.",
    "geohash": "c285",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/10646/reg_DSCF0002-40127.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10646/reg_DSCF0009-40127.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10646/reg_DSCF0016-40127.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10646/reg_DSCF0020-40127.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10646/narrow_DSCF0034-40127.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/peden-bluff-peden-lake-near-sooke-bc-10646",
    "stats": {
        "Activities": "climb hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "4 hrs",
        "Total Distance": "10 km",
        "Town": "Sooke, BC",
        "Type": "out-and-back"
    },
    "title": "Peden Bluff, Peden Lake",
    "trail_id": "10646"
}