{
    "description": "This is a great trail for after work or for those that want to feel closer to an urban environment.  Much of the trail crosses streets and is close to residences while the middle part goes through a forested section that feel secluded yet is still surrounded by neighborhoods.  I usually start the trail at Pacific and Guilford in Coquitlam.  The trail starts on the North side of Guilford and continues north.  Eventually you get to a T where you go right and continue down White Pine Place.  Cross the street and go up the stairs.  Continue until you get to David and cross the street and the trail continues a bit West on David.  Once you get to Pinetree Way, turn left and the trail starts just a few meters up the street on the same side you came out.  Stay on the less traveled part of the trail that branches left and down the hill and follow it until you reach Waterford Plc.  Cross the street and continue.  You will cross Cliffrose and eventually get to Johnson St. Turn left and walk 1/2 a block and go up the stairs on the North side of the street.  You will see a trail map here.  Continue up the next set of stairs and you will see the gravel trail.  Continue up the trail all the way until you see an entrance in to the forest.  Keep going up and enter the forest at the next entrance.  It switches back a couple times and at one point you get to a fork in the trail.  Stay to the right which continues up and you will eventually exit the forest briefly before switching back in.  Stop and admire the view from here.  Once you get to the next switch back, stop and take the trail the is less traveled and leads to a stream that has a steel cable that you can hold while you cross.  You will see another trail map but basically you continue forward and to the right.  You will be going downhill for parts of this section until it comes around and now gets steep and tougher.  This is where the map and GPS could be handy as the trail does branch off in sections.  Eventually you will get around to the west side and you should come out on Parkway Blvd.  Cross the street and enter the trail to the North and you will come to Eagle Mountain Park which always seems deserted.  Follow the gravel road sound back down the mountain and you will get to Eagle Mountain Road.  Continue until you get to the top of the 'Coquitlam Crunch' trail which is under some power lines.  Follow this trail all the way down until you reach Landsdown Drive or keep going until you get to Guildford Way.  Now you are heading back to where you started which is a few blocks East on Guildford.  Keep in mind that it gets quite dark in sections sooner than when the sun sets.  Parts of the trail are quite steep both in the forest section and the Coquitlam Crunch trail coming down.  The forest section can get quite muddy in winter and when it's wet.  It is easy to take a wrong turn but you are never far from anything and pretty much impossible to get lost.  Overall it is a great workout.  Occassionally I will just take the bus back down from the top if I don't want to walk.  It drop me off right by the starting point.  Hope you enjoy.",
    "directions": "There is usually vehicle parking on Pacific St and there is a bus stop at Johnson and Guildford.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/10668/reg_trail1-42161.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/coquitlam-urban-hike-near-coquitlam-bc-10668",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "12 km",
        "Town": "Coquitlam, BC",
        "Type": "out-and-back"
    },
    "title": "Coquitlam Urban Hike",
    "trail_id": "10668"
}