{
    "description": "On the shore of Lochaber Lake a small stream exits the hill.  What you don?t know and probably very little people know is that if you follow this brook upstream, you will be rewarded by a series of small but beautiful waterfall in a narrow gorge.I chose to walk up the old woods road or you could probably drive it.  When you see a small pond to your left it?s time to enter the woods.  A very steep but shore slope brings you back to the stream?s edge.  Follow the stream as it flows in a mixed forest with a high canopy.  After only a few minutes you enter the small 30ft high gorge.  The rocks here are very different a mixture of different types.  I saw some limestone rocks with a nice leaf fossil on it.  There are approximately 5 different falls within the small area of the gorge.  The falls were flowing with water in August and I think would be even more spectacular at times of high water",
    "directions": "Highway 7 south of Antigonish.  Turn to drive on the West Side Lochaber Road.  The brook flows under this road at 45 24.088N, 62 02.488W",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/10666/reg_DSC-0037-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10666/reg_DSC-0021-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10666/reg_DSC-0032-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10666/reg_DSC-0033-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10666/reg_DSC-0034-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10666/reg_DSC-0039-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/lochaber-gorge-near-antigonish-ns-10666",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "2 km",
        "Town": "Antigonish, NS",
        "Type": "out-and-back"
    },
    "title": "Lochaber Gorge",
    "trail_id": "10666"
}