{
    "description": "I was looking at some old geological maps of Nova Scotia when I saw the word ?gorge? in the middle of nowhere in the Eastern part of Nova Scotia.  This place is not associated with the Cobequid Mtns or Highlands so I knew I had to check this out for myself.Setting off from the car, I followed an ancient logging track for a few hundred metres.  There seems to be a large spot in there that would be a good camping spot as it is nice and level and surrounded by 40ft evergreens.  Afterward I made a beeline into the woods, passing through some planed evergreen that are now old enough so you can somewhat easily go through their under branches.  Popped out into some recently logged area and beat my way through some raspberry and blackberry patches on my way to the gorge.  I could finally hear some running water.  The last leg of the trip to the stream is the most dangerous.  The rocks on the slope of the ravine are loose and have lots of holes under the moss to wedge your feet so be careful.   All this to see at first a meager 2ft drop with some rocks on the opposite side.  I then pushed my way further downstream but again only a small drop and nothing to construed as a gorge.  Finally went upstream for maybe 200m and then saw what I think was the place  where the gorge origin came from. The stream has carved a small notch into a small rocky outcrop.  On the opposite side there is a larger rock cliff but nothing compared to what we can see in the Cobequids or Highlands",
    "directions": "Highway 348 south.  Turn or continue straight on the Sunnybrae Eden Rd.  Turn on woods rd at N45 24.063, W62 22.449.  Keep driving to approx; 45° 25.708'N, 62° 22.311'W.  I?ll make it easy for you the so-called gorge is at ; 45° 25.757'N, 62° 21.997'W",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/10665/reg_DSC-0013-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10665/reg_DSC-0010-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10665/reg_DSC-0019-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/little-river-gorge-near-new-glasgow-ns-10665",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer spring",
        "Stars": 2,
        "Time": "1 hrs",
        "Total Distance": "2 km",
        "Town": "New Glasgow, NS",
        "Type": "out-and-back"
    },
    "title": "Little River Gorge",
    "trail_id": "10665"
}