{
    "description": "In the hills south of River Denys lies an abandoned mill located beside a very picturesque waterfall?this is how you get there?.Starting off you follow an old woods road on a gentle uphill.  The brook sits to your right as you are walking upstream.  The alders are stating to close in on this path and will disappear in a few years.  Once past the old abandoned trailer you will notice the path turning to the left.  At this moment I decided to follow the brook upstream instead of trying to find a path to the old mill.  Big mistake, the rocks are slippery and you will probably find yourself with a soaker or two.Anyways the path in the stream lets you come into the first waterfall when the stream exits a moss covered ravine. The lower fall is only about 6ft but it has a small opening between huge boulders on the left hand side.  Get back on the slope of the ravine and climb carefully.  At the top you come into the second and largest waterfall.  The stream has carved a narrow channel in a 50ft of solid rock.  Impressive at times of low water, I will return to see this place after a rain event!Now I nearly missed the old mill altogether as it doesn?t sit on the edge of the stream but farther back in between the two waterfalls.  The rock walls that are still standing look like Inca ruins as they are very straight and have no mortar holding them in place.  There is still a window in one of the walls and part of the original grinding mill stone as well.Once you see the old ruin, you will also see the established path that will lead you back to the exact spot where I left the trail in the beginning of this narrative.  It always seems like you find the easiest path on the way back.",
    "directions": "From TCH 105, drive towards Orangedale and then towards Valley Mills.  The path to follow sits approx at  45° 50.864'N, 61° 6.205'W",
    "geohash": "f8hsc",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/10678/reg_DSC-0033-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10678/reg_DSC-0030-27177_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10678/reg_DSC-0035-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10678/reg_DSC-0038-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10678/reg_DSC-0043-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/valley-mill-fall-and-ruin-near-port-hawkesbury-ns-10678",
    "stats": {
        "Activities": "snowshoe hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "2 km",
        "Town": "Port Hawkesbury, NS",
        "Type": "out-and-back"
    },
    "title": "Valley Mill Fall and Ruin",
    "trail_id": "10678"
}