{
    "description": "A small hike near Port Hastings will take you to some gypsum cliffs, a small cave and waterfall.Starting on the TCH, descend the steep slope through the evergreen and link up to an old pathway on the other side.  Follow the pathway past the ?waterfall? sign.  Follow the old woods road as it meanders and jumps over a small brook.  This small brook is the one actively carving out the gypsum cliffs downstream.  Once you reach the start of Plaster Cove, turn to the right and you should see the gypsum cliffs.  Some large (house size) pieces have become loose and crashed into a pile.  This has formed a small cave-like structure underneath the largest piece.  Squeeze in and then crawl to the opening you will see to your left.  Some sort of chimney has formed where daylight enters this structure.  But this is it for passages.  The gypsum cliffs continue from this point towards the straight and there might be some more areas to explore for passages down that way.  There is also waterfall on the opposite side of plaster cove where a second stream enters the cove.Park off the TCH at 45° 38.928'N, 61° 23.961'W.  Cave like structure is at 45° 38.994'N, 61° 23.759'W.",
    "directions": "Park off the TCH at 45° 38.928'N, 61° 23.961'W.  Cave like structure is at 45° 38.994'N, 61° 23.759'W.",
    "geohash": "f8h7dy",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/10679/reg_DSC-0044-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10679/reg_DSC-0046-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10679/reg_DSC-0049-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/plaster-cove-cave-near-port-hawkesbury-ns-10679",
    "stats": {
        "Activities": "hike snowshoe",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "1 km",
        "Town": "Port Hawkesbury, NS",
        "Type": "out-and-back"
    },
    "title": "Plaster Cove Cave",
    "trail_id": "10679"
}