{
    "description": "A beautiful hard packed earth trail with very few rocks, roots or mud.This trail rises approx 675 m. over 7 kms, usually gradually on a well defined path.The Lillooet Naturalist Society's Canyon to Alpine hiking book (2nd edition, 2012) suggests you drive up the access road, but it is quite rough, and only approx 700 m, so we parked at the road and walked up to the trailhead. Look for the sign on the far side of the hydro lines.You travel through open Ponderosa and then lodgepole pine forests, and later through slightly thicker fir and spruce forests. The forests are generally open, but sufficiently shaded to make this one of the few trails around Lillooet to be cooler than the usual wide open, sun seared hikes.Lots of different flowers depending on the season, with many mushrooms and fungi, as well as the bright green Wolf lichen and dark brown horsehair lichen, on occasion both on the same tree.We reached the lake in approx 2.5 hours (including some doddling for photos). The lake is pretty, with beautiful reflections, but quite small with limited access. The maps show 2 other small lakes slightly farther ahead, but trail seems to end. We picnicked approx 1/2 hour at the lake, and took 1 3/4 hours to return, mostly downhill.BEWARE, this is BLACK BEAR country, especially in late summer and early fall when the berries are ripe. Make noise all the time to alert them. We did not see any bears or scats, but saw quite a bit of what we were told were probably coyote scats (like dog poop, but black???)",
    "directions": "From the Hwy 99 / 12 intersection on the east side of the 23 Camels bridge leading east out of Lillooet (ie, on the east side of the Fraser River), drive north approx 10kms to Fountain Flats. A few hundred meters north of the Fountain Flats Trading Post, turn right on Fountain Valley Road. Reset your odometer to 0, and drive 10 kms (watch for horses on the road). At 10 kms, look for hydro pole # 101 (on the west (right) side of the road). Approx 50 m. farther, you will see the 1 lane dirt road on your left, with a bunch of yellow and pink flags on the tree.You can either drive the 700 m to the parking area under the hydro tower, or park at the road and walk up the 700 m. We walked it.At the hydro tower, walk east across the open area, look for flags, but more importantly, look for the \"Trail\" sign across the clear cut area, by the edge of the forest. That's the trail head. Enjoy.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/10687/reg_Lillooet-Hiking-Guide-2012sm-7359.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/peanut-lake-near-lillooet-bc-10687",
    "stats": {
        "Activities": "hike snowshoe",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 4,
        "Time": "5 hrs",
        "Total Distance": "15 km",
        "Town": "Lillooet, BC",
        "Type": "out-and-back"
    },
    "title": "Peanut Lake",
    "trail_id": "10687"
}