{
    "description": "Elevation Gain - 1100 m (3736 ft).The Tamarack trail which forks and leads to Lineham Ridge or Lineham Peak takes off from the Upper Rowe Lake trail.  The descent was a reverse scramble (more of a scree ski adventure actually) down the South slope.  This descent route shaves off 3.8 km from the otherwise 9.1 km trip back down.  And who can pass up a premo scree descent like this.From the trailhead return was 14.4km & took us a little over 6 hours.After crossing the creek  (5km from trailhead) just past Rowe Meadow start up the Upper Rowe Lake trail.  A few meters past the creek ther is a signed junction.  Turn right at the junction and begin the seemingly long and moderatly steep ascent up from the meadow across the headwall of Rowe Valley to the ridge above. Near the top of the ridge, there is a metal ground stake indicating where the trail forks  west or east. West (left), would take you to Lineham Ridge.  East (right), will lead to the lower portion of the Ridge, from there continue east along the ridge and up to Mount Lineham.  The lave rock and upper alpine flora provide a wonderful splash of color.At the summit you are rewarded by unobstructed views of Mt Blakiston across the valley to the North, and Mt Hawkins to the left of Mt Blakiston.  Across the valley to the South you see Rowe Lakes with  Cameron Lake and the Akamina Ridge just beyond Rowe Peak.After enjoying the views and a bite of lunch, continue east along the ridge a few meters and turn South (right) you will be able to make out a slight trail heading down the scree.  About 250 meters down the scree you will have to maneuvre across to a notch in the rock band that looms just below you.  Continue the decent down the scree slope as it breaks into the water shed.  Keep following this down to the tree line where you should pick up a very faint trail through the trees.  After about 150 meters of near bushwhacking you will come across the main trail on which you made your ascent.",
    "directions": "Trailhead is the Rowe Lakes/Tamarack trailhead on Cameron Lake Road in Waterton Lakes National Park.",
    "geohash": "c2wz",
    "photos": [],
    "source_url": "https://trailpeak.com/trails/mt-lineham-near-waterton-park-gate-ab-10709",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 4,
        "Time": "7 hrs",
        "Total Distance": "15 km",
        "Town": "Waterton Park Gate, AB",
        "Type": "out-and-back"
    },
    "title": "Mt Lineham",
    "trail_id": "10709"
}