{
    "description": "This is one of my favourite hikes within HRM.  You will see some barrens and bold ocean frontage and all of it within 15min of downtown.Starting off in the barren, the trail quickly descends a small hill and passes by a dammed brook.  Once you hit the ocean front, just follow the coastline and trail as it go up and down some headlands.  There are some large fissures that have opened in the cliffs and some boulders have become wedged inside. I almost wanted to go stand on them but I had the kids with me and probably not the best example to set.  If the wave action is strong, the wave enters this fissures and the resulting sight and sounds are impressive.  Towards the end of the hike, there are also some old WWII concrete bunkers to explore.It must be stressed, that the Duncans Cove trail is on a nature reserve.  (for more info, see: http://www.novascotia.ca/nse/protectedareas/naturereserves.asp ). This is not a park. The trails are NOT managed. There are no facilities and no signs. It is protected under Nova Scotia?s Special Places Protection Act.This means that the habitats and species here are vulnerable to disturbance and damage.  All fires, camping, hunting, and trapping; motorized and non-motorized vehicle access (that means no ATVs, motorcycles, or mountain bikes) are prohibited.You should remind hikers to stay on the main trails and follow LEAVE NO TRACE principles.- Use area at own risk- Wear sturdy footwear- Bring water and clothing for changes in weather- Bring a cell phone, whistle, and first aid kit- Pack out what you pack in (that means take your trash, including your doggie poop bags)- Respect private propertyThe \"dirt road\" at the beginning of the described trail, is actually a private driveway - please respect private property.",
    "directions": "Highway 349 towards Portugese cove.  Turn left on Duncans Cove Rd.  Park at 44°29'56.07\"N , 63°31'40.18\"W.  Follow dirt road past gate.  At the top of the hill look for a sign indicating trail starting to the right.",
    "geohash": "dxfv4",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/10703/reg_20116878-10159043835525253-458313206875574387-o-29682.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10703/reg_DSC-0036-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10703/reg_DSC-0046-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10703/reg_DSC-0059-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10703/reg_DSC-0062-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10703/reg_DSC-0063-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10703/reg_DSC-0065-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10703/narrow_DSC-0033-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/duncans-cove-near-halifax-ns-10703",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 5,
        "Time": "3 hrs",
        "Total Distance": "6 km",
        "Town": "Halifax, NS",
        "Type": "out-and-back"
    },
    "title": "Duncans Cove",
    "trail_id": "10703"
}