{
    "description": "Lots of fun features on this trail.  For those of you regularly going on some of the trails I?ve posted you might be disappointed as there is almost no bushwacking involved.  On this trail, you will see some small crevasse type cave structures, a huge scree slope, an uninterrupted 180 degree view of the Annapolis Valley and two waterfalls.  Setting off, you gradually go up a small hill in the mixed forest on an old logging road.  This road is only used by walkers and ATV?s these days.  The mixed forest soon changes over to some very nice hardwoods.  The trail is mostly dry with some large puddles to be avoided.  Once at the top of the small hill, you will start to descend towards the edge of the North Mountains.  At one point you will see a major trail coming in to your left (east).  Takes this trail for another 300m or so and you will end up at the top of the scree slope.  The forest edges of the scree slope are open with a high canopy and covered by ferns.  The viewpoint here is gorgeous as there aren?t any trees to block your view of the valley.  Down in the scree slope and on top of the scree slopes are a couple of small openings to crawl into.  There wasn?t cold air escaping any of those so probably not very long passages but fun nonetheless to crawl in and out of.Back on the trail, if you continue instead of turning east to the scree slope, you can continue on the ATV trail.  There are two main intersections where new wood roads have been cut for the windmill projects coming soon to this area.  Past the second intersection and keeping on the atv trail, the trail will start to descend the north mountain.  At this point, turn to your right and down a steep incline to the base of two waterfalls.  These would be gorgeous in time of spring freshet as they do not drain a large area.",
    "directions": "From Bridgetown, drive up the North Mountains to Valleyview Provincial Park.  Continue past the park and turn right on Arlington Rd.  Turn right on Lakelands and park at 4974288.35 m N, 320040.01 m E",
    "geohash": "dxcx6",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/10720/reg_DSC-0028-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10720/reg_DSC-0021-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10720/reg_DSC-0024-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10720/reg_DSC-0026-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10720/reg_DSC-0031-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10720/reg_DSC-0035-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10720/narrow_DSC-0037-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/scree-fun-near-bridgetown-ns-10720",
    "stats": {
        "Activities": "mtn-bike hike snowshoe",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 5,
        "Time": "2 hrs",
        "Total Distance": "6 km",
        "Town": "Bridgetown, NS",
        "Type": "out-and-back"
    },
    "title": "Scree fun",
    "trail_id": "10720"
}