{
    "description": "A long slow climb up Frisbee ridge which ends in a beautiful view overlooking lake Revelstoke and the Monashees to the west.  Inaccessible until late summer once the snow melts, it's one of Revy's more beautiful rides.  It's 11 km in and the same back and the ride down is a fun flowy ride.It's a 6 or 7 % grade and virtually none of the trail is technical, if you have the lungs and legs, you can ride the whole thing without stopping.When you get to the top, go over the backside and down to the lake.  If the bugs aren't too bad go for a dip or have a pic-i-nic.  This makes it about 12.7 km each way and 715 m of cumulative climbing plus another ~100 m to get back out of the lake and it's an equally nice, flowy addition to the trail.Look for info on Ultimate Frisbee, the difficult DH trail coming down.  It starts in a clearing / logging area below the main lot, not sure exactly how to describe but is mostly quite steep and loose and is going to drop about an additional 700-800 meters.",
    "directions": "At the traffic lights on the #1 just west of the columbia river bridge, head north (this is Westside Road).  Head north and drive about 8 km until the pavement ends in 3 gravel roads.  Take the road on the left, it will have a sign that says \"Caution\" and indicates it is the Frisbee ridge access road.  Follow this road right to the parking lot.  You will have to climb quite high on a rough logging road so go slow.   Just keep following the main road (there will be a couple smaller roads branching off, follow the road most travelled).  Eventually the road will end at the Frisbee parking lot.",
    "geohash": "c35f",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/10730/reg_IMGP0702-1-42632.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10730/reg_IMGP0712-2-42632.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10730/reg_IMGP0713-3-42632.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/frisbee-ridge-near-revelstoke-bc-10730",
    "stats": {
        "Activities": "hike ski-bc mtn-bike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 5,
        "Time": "6 hrs",
        "Total Distance": "22 km",
        "Town": "Revelstoke, BC",
        "Type": "out-and-back"
    },
    "title": "Frisbee Ridge",
    "trail_id": "10730"
}