{
    "description": "This trail is cross country oriented and acts as a climbable trail to access other downhill trails or to do a ?summit-and-down? ride. The width of the trail and flow are designed with an XC bike in mind.  It should be a fun challenge for the beginner and be a blast for the expert.  As a climb, it starts mellow and twisty and climbs its way to steeper, more physically and technically demanding terrain.  There are very few man-made technical features but lots of flow, up or down, with a few spectacular views thrown in.  Keep an eye out for riders going the opposite way.  Right-of-Way goes to the downhill rider since it is harder for her to stop.  Lastly, yield right-of-way to trails that Pneuma crosses, in particular, Race of Spades.",
    "directions": "Pneuma follows the Moose Mountain road for much of the climb up the mountain which lends itself to having multiple entrances and exits to the the trail. The most popular starting points for Pneuma would be from the intersection with Sulfur Springs where riders have the option to park at the 2k lot or Station Flats. If parking at the 2k lot, riders will have to travel down Sulfur Springs a short distance (around 200 meters) before intersecting with Pneuma. Riders choosing to park at Station Flats will have to pedal up Sulfur Springs until the intersection with Pneuma. Sulfur Springs has a few steep sections, and while not being overly difficult to ride, it does provide a challenging aerobic workout. Riders may also choose to park at the bottom of the Moose Mountain Road and enter Pneuma from the trail head there. Pneuma provides the opportunity to leave and enter onto the road across from SLF as well as right before crossing Race of Spades. After crossing ROS riders will be forced to stay on the trail until the top of Special K, or if they decide to continue on past Special K, the top of Moosepackers. Please note that the trail becomes more technical after crossing Race of Spades.",
    "geohash": "c3n3",
    "photos": [],
    "source_url": "https://trailpeak.com/trails/pneuma-near-kananaskis-ab-10754",
    "stats": {
        "Activities": "mtn-bike",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 5,
        "Time": "1 hrs",
        "Total Distance": "5 km",
        "Town": "Kananaskis, AB",
        "Type": "out-and-back"
    },
    "title": "Pneuma",
    "trail_id": "10754"
}