{
    "description": "There are a few moderately steep, short pitches on this trail, but it is generally low-angle, windy, and flowy single track through tight forest.  This trail is suitable for intermediates to rippers. Start at the trailhead parking lot and roll down the road.  You will see the single track cross the ditch on your left and run parallel to the road for about 30m before it drops into the trees.  The trail bobs-and-weaves through the tight pine forsest, generally traversing down-right.  There are a series of small-medium drops and a couple of skinny features (aka TTFs, or Technical Trail Features); all with easy ride-arounds.  The trail continues with very little braking, some pedalling, some pumping, and impressive TTFs of increasing size and difficulty. You?ll come to a long skinny feature with a teeter in the middle that dumps you onto a cut line.  Follow the trail left along the cut line and up the hike-a-bike back into the woods on your right.  From the top of the hike-a-bike the trail weaves along the ridge before making a hard left into the woods.  More corners, berms, and TTFs eventually bring you to the bottom of the single track and onto double track through mixed forest / cow pastures.  Keep right at the junctions, cross the bridge, up the mini hill, and follow the double track out to the Station Flats parking area. Additional Trail Info: This trail is on the east aspect of Moose Mountain, so it takes a little longer to dry out than some of the others.  Many of the TTFs are for experts only, so look before you leap and ride within your ability.  There is a cattle gate on your way out? be sure to close it behind you.  Watch for cow patties and be courteous to any other trail users.  As always, don?t dust-out hikers/bikers on the road on your shuttle up.  Enjoy!",
    "directions": "East side of Moose Mountain Road at approximately 6.5km.  This is a couple hundred metres downhill and on your left from the roadside parking across from the guard rail.  The trail exits at Station Flats. At approximately 6.5km up the Moose Mountain road, the road widens and the grade flattens.  There is a guardrail on the right (east) and ample parking on the left (west).  On a clear day you can see all the way to Buffalo.. well, it?s actually Calgary.  If you are shuttling, leave a retrieval vehicle at Station Flats, where the trail exits.",
    "photos": [],
    "source_url": "https://trailpeak.com/trails/race-of-spades-near-kananaskis-ab-10757",
    "stats": {
        "Activities": "mtn-bike",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "7 km",
        "Town": "Kananaskis, AB",
        "Type": "out-and-back"
    },
    "title": "Race of Spades",
    "trail_id": "10757"
}