{
    "description": "Although Brakeless is classified as a beginner trail, it provides the opportunity for a high speed downhill run with minimal technical features that ever rider will be able to enjoy.  The trail starts out with a slightly steep slope but quickly transitions into a more moderate grade for the remainder of the trail.  There are few turns to minimize the use of brakes, making this a great trail for riders to develop confidence in high speed riding, and to develop the skills necessary to ride some of the more advanced trails on the mountain.  There are no technical trail features, only uninterrupted fast singletrack from top to bottom.  The trail is 1.65 km long with an elevation drop of just over 200 m.  The short distance and ease of access from the road allow for multiple quick shuttle laps or an easy hike and bike option.  As well, the majority of the trail is South facing, allowing for earlier snow clearance in the spring.Beware of crossing the Sulphur Springs trail, as well as traffic at the bottom of the trail at the highway 66 roadside.  This trail offers an option for less skilled riders to take while others are riding the more advanced west side trails, with the ability to be picked up by the shuttle vehicle on its way back to the Ing?s mine lot.",
    "directions": "To access the Brakeless trailhead, park in the 2 km parking lot and follow the trail approximately 30 m up the hill to the South.  The trail then parallels the Moose Mountain fire road until meeting with the Sulphur Springs xc trail.  Brakeless crosses this trail and starts to turn away from the fire road and down towards highway 66.  The trail exits into a meadow, approximately 600 m from the start of the Moose Mountain fire road, approximately 50 m from highway 66.  Riders can either ride along the highway back to the fire road, meet up with shuttle vehicles at the Ing?s Mine parking lot to the West, or be picked up at the meadow where the trail exits.",
    "photos": [],
    "source_url": "https://trailpeak.com/trails/brakeless-near-kananaskis-ab-10759",
    "stats": {
        "Activities": "mtn-bike",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "2 km",
        "Town": "Kananaskis, AB",
        "Type": "out-and-back"
    },
    "title": "Brakeless",
    "trail_id": "10759"
}