{
    "description": "Difficulty level: (More difficult (blue) to most difficult (black)) Moderate technical difficulty, although it?s the most physically demanding of the downhill trails on the mountain due to length and elevation gain at the end. Downhill shuttle.Trail length: As downhill trails go, Special K is fairly long and meandering ? it?s likely the most time consuming shuttle run on the mountain.  Expect to spend around an hour on this one, unless you?re in training mode for the next SuperD race.Features: Special K is a classic trail, and the original downhill-specific trail built on Moose Mountain. There?s no time to ease into this one, as the trail begins with a few steep pitches and you?re quickly met with the biggest man-made drop on the trail.  Don?t worry?there?s a ride around if necessary.  The trail grade begins to mellow out and you?re treated to flowy turns as the trail criss-crosses a stream bed over a number of bridges, while throwing in a couple of nice steep challenges to keep you on your toes.  The trees begin to thin out and the speed increases as the trail flies through some meadowlands and tricky sidehill sections.  After a short climb, you?ll wind through the tight pine forest singletrack, then emerge onto an old cutline.  Navigate your way down two technically challenging pitches, and you?ll find yourself out in a grassy (and sometimes a little boggy) cutline.  This trail is best enjoyed during the drier parts of the year.  Follow the trail eastward, make a creek crossing, and you?ll find yourself in the middle of the Tom Snow trail.  Time to raise the saddle and pedal south (to your right) to the Station Flats parking lot.  Don?t forget to save some legs for the climb!  While this trail can be ridden on most any bike you can find, you?ll probably enjoy it most on a mid-travel all-mountain type of bike, making the best out of the techy descents and yet not punishing you too much on the pedal out!",
    "directions": "To ride this trail as a shuttle, park in the main parking area at the top of the Moose Mountain road.  Pedal down the road a few hundred meters until you see a small road branching off to the east for a pipeline station.  The trail drops in immediately to the right of the small shack located there.  You?ll finish your ride at Station flats day-use area, so leave your retrieval vehicle in the parking lot there.",
    "geohash": "c3n3",
    "photos": [],
    "source_url": "https://trailpeak.com/trails/special-k-near-kananaskis-ab-10755",
    "stats": {
        "Activities": "mtn-bike",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "5 km",
        "Town": "Kananaskis, AB",
        "Type": "out-and-back"
    },
    "title": "Special K",
    "trail_id": "10755"
}