{
    "description": "Billy Dog starts off on a steep pitch where a healthy dose of benching and berms will keep you in line and on track as a warm up for the steep, tight, and narrow portion that?s to come.  TTF?s are not part of the first half of this trail and any manmade features come in the form of short bridges and benching to help sustain the line.  Brake levers bent and shoulders bruised you?ll pop out into an opening that will give you a nice mountain view to enjoy while you bandage your knuckles from the abuse they?ve taken from those trees that just seem to pop out from nowhere.  At this point the trail starts to ease into a more open and faster part of the forest.  A few more somewhat tight turns through the forest and you?ll be able to open the throttle and catch some sweet air out of the trees and into the light of the cutline.  Back into the trees the steeps are over and you?ll be able to step on the gas for a dozen or more TTF?s in the ending part of the trail.  One more pitch requires respect as it is steep and a fall over the berm here will put you much too far away from your bike than you would like.  One more switchback, a few more TTF?s, twists and turns, and you?re done.  Cross Canyon Creek, hit the road and turn left!Watch for continued buffing and additional trail features on Billy Dog throughout 2009!Billy Dog is one of the older trails on Moose Mountain, but has seen a revival at the end of 2008 and early 2009 that will blend the old with the new via a steep and tight upper section and a fast and flowy lower section. Billy Dog can be ridden on any mountain bike, but would be best enjoyed on a long travel all mountain machine or a shorter travel downhill bike.  There are no chronically wet areas on the trail so it can be enjoyed all season long but be sure to check the water level in Canyon Creek early in the season as it makes for a chilly ride out if it?s running high!",
    "directions": "Drive or pedal to the crest of the hill just after the 4km mark on the Moose Mountain road.  If driving, it will be safest to park on the branch road around the 4km mark as there is no decent pullout for vehicles at the crest of the hill.  Be conscious to not block access to the Shell lease and of your hot exhaust in the deep grass!  Once you crest the hill, continue another 50-75 meters further up the road and watch for the trailhead on your left.  Billy Dog ends at the Canyon Creek road, where you turn left towards the Ing?s mine parking lot to complete your loop or meet up with your vehicle. Billy Dog will take the average rider around 25-35 minutes complete from vehicle to vehicle if ridden straight through from top to bottom.",
    "photos": [],
    "source_url": "https://trailpeak.com/trails/billy-dog-near-kananaskis-ab-10760",
    "stats": {
        "Activities": "mtn-bike",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "2 km",
        "Town": "Kananaskis, AB",
        "Type": "out-and-back"
    },
    "title": "Billy Dog",
    "trail_id": "10760"
}