{
    "description": "This is a good place to explore on days where you don't have time to get out of the city.  The prize at the end of the hike is a series of man-size cracks in granite that you can easily enter.Setting off from the small parking, you soon cross the railroad and then start to head uphill.  Most of the hike is spend on the tav trail that runs underneath the power poles.  However I was able to follow numerous off shoots from that trail one of which seemed to continue for a while.  The trail itself is a mixture of loose gravel and cobbles interspersed with large granite outcrops.  There are numerous \"steps\" of granite as you follow the trail.  Basically the trail levels off until you hit the next step of rock.  Where these steps are located is also where you will find the cracks of doom.  The water infiltrates the rock and is actively carving out thin slices of rocks outward.   Most of the time you will see one or two slices but if you persist under the power lines, you will find the cracks of doom just beyond the second tower.the cracks are loads of fun as you can squeeze your way between large slabs or go underneath some others.  there are some place where you need to brace on both sides of the crack to make your way down?all my bouldering is finally paying off.  All in all a great place to explore. the side spurs are worth a second look too but with my mtn bike. I can't really describe well the cracks so have a look at the picts and video.",
    "directions": "In Bedford, take the Rocky Lake Drive.  Park at the power lines just pass the underpass for highway 101.",
    "geohash": "dxfw",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/10769/reg_DSC-0138-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10769/reg_DSC-0143-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10769/reg_DSC-0152-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10769/reg_DSC-0154-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10769/reg_DSC-0161-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/cracks-of-doom-near-halifax-ns-10769",
    "stats": {
        "Activities": "snowshoe hike ski-xc mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 5,
        "Time": "1 hrs",
        "Total Distance": "2 km",
        "Town": "Halifax, NS",
        "Type": "out-and-back"
    },
    "title": "Cracks of Doom",
    "trail_id": "10769"
}