{
    "description": "Reclaimer is a popular downhill shuttle run that requires advanced bike handling skills and features loose rocks, tight corners, and jumps. Located minutes from town, the trail tends to be busy on weekends during the height of summer. This trail starts off steep and combines a few short flat sections that you can coast through when carrying your speed, flowing all the way to the bottom. The first few corners are technical and lined with rocks. After that you?ll be able to open her up a bit as you rip down the straight away into another banked corner and out the other side. Switchbacks are the name of the game at the beginning, with the lower part of Reclaimer becoming windier and less elevated. The trail ends at the Grassi Lakes parking lot.Reclaimer is usually one of the first trails to dry up in the spring and typically stays open until the end of October. If you?re out shuttling for the day, consider combining Reclaimer with a shuttle on Riders of Rohan. Riders is just up the road from Reclaimer and also loads of fun.Distance: 1.5 kmTime: 5 - 25 minutesElevation Gain: 0 mElevation Loss: 191 mMin Elevation: 1,141 mMax Elevation: 1,634 mTechnical Rating: AdvancedPhysical Rating: ModerateSeason: June - OctoberPermit Required: No",
    "directions": "The trailhead is located off of Highway 742 (Smith Dorrien) above Grassi Lakes and is clearly marked. Drive up Spray Lakes Road ? which turns into Smith Dorrien ? from town past the Nordic Centre until you hit the gravel road. If you?re shuttling, you will want to drop off a vehicle in the Grassi Lakes parking area, left before the dirt road. Continue up the dirt road and look for the trail entrance on the left hand side, across from the pull-out located on the right ? a good place to park if you?re shuttling.",
    "geohash": "c3jf",
    "photos": [],
    "source_url": "https://trailpeak.com/trails/reclaimer-near-canmore-ab-10764",
    "stats": {
        "Activities": "mtn-bike",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 5,
        "Time": "1 hrs",
        "Total Distance": "2 km",
        "Town": "Canmore, AB",
        "Type": "out-and-back"
    },
    "title": "Reclaimer",
    "trail_id": "10764"
}