{
    "description": "Top to bottom trail description. Very tight twisting turns with many berms to bring you the flow.  Feeling of being in a tree tunnel that progresses to the very bottom. Approximately 2mins down the trail watch for a small jump (use caution and keep slow) that throws you up and in to the start of the steep ??  section of the trail. There is an optional ride around for this technical trail feature (TTF). The steep section is very steep and knarly with jagged rock and loose dirt so use caution! When the trail begins to open up a little bit be aware of a small 1 foot dirt step-up that puts you up and over a large tree root and into a hard right berm launching you into a fast straight away. Trail gets snakelike once more and loams through very vibrant green soft mossy area. The trail opens up once more as you launch down a steep ridge like section to which you prepare for a blind quick right berm to a 2 foot drop, it is possible to roll this drop but keep way back over your rear tire. Trail speed increases through the wide open section and while nearing the bottom, prepare for a monster double right berm. Shortly there after, you will find you?re self at the creek bed and ready for the 1-2km ride out to Ing?s mine parking lot!This is a technical trail which incorporates quick tight turns with trees just millimeters from the end of your handle bars.  There is one very steep section approximly 2min from the trail head and it is the crux of the trail and the section that gives the trail it?s name.",
    "directions": "Trail head is on the left side of the road going up moose mt access road. The trail head is approx 300meters down from parking spot at SLF. Trail ends on Ing?s mine side .",
    "geohash": "c3n3s",
    "photos": [],
    "source_url": "https://trailpeak.com/trails/toothless-near-kananaskis-ab-10761",
    "stats": {
        "Activities": "mtn-bike ski-bc",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "4 km",
        "Town": "Kananaskis, AB",
        "Type": "out-and-back"
    },
    "title": "Toothless",
    "trail_id": "10761"
}