{
    "description": "There's gold in them that hills?.or they used to be anyways.  Waverley was basically build up because of the gold deposits found in a few of the hills surrounding the town.  I looked up the old mine database and seemed out some of the old trenches and shafts of the Waverley gold mines.From the Waverley Rd, I followed a brook upstream and soon found my way on an old logging road that paralleled the stream.  Once near the top of the first hill I could see an old borrow pit on one side of the stream?I was getting close to the gold.Once at the top of the first hill, I hit some kind of old road or new Atv trail. Pushing forward and up I soon saw some large outcrops of rocks.  My gps was bouncing all over the place trying to find the exact shaft locations.  Possible the metal concentration in the rocks playing havoc with the gps or more likely batteries that needed to be changed which I did a few minutes later.  I did find some old rock piles and some holes that had been flooded which could have been the entrance to these shafts. Regardless of my lack of finds in terms of mining adios or shafts, the forest tat he top of the hill is spectacular.  It's made up of birch and beech with little undergrowth which makes for a very plea ant stroll in the woods.  I'll have to continue to seek out some gold in another location?.",
    "directions": "Waverley Road, the stream crosses at approximately (near the irving stn);  44°47'7.62\"N,  63°35'50.62\"W",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/10770/reg_DSC-0116-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10770/reg_DSC-0117-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10770/reg_DSC-0120-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/waverley-gold-near-halifax-ns-10770",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "2 km",
        "Town": "Halifax, NS",
        "Type": "out-and-back"
    },
    "title": "Waverley Gold",
    "trail_id": "10770"
}