{
    "description": "By combining two signature trails surrounding the Sparkling Hill Resort, hikers get a 2 to 2.5 hour hike with all the attributes of a great hike.  Starting at the Sparkling Hill Resort (a world class wellness resort overlooking Okanagan lake on the ridge of a mountain), one starts at the well marked main trailhead and map just under the entrance.  You are at the peak here, so you start with sweeping views out over grasslands and a long valley to distant peaks.  Take the Sparkling loop to the left and under the parking lot, then dip down on a switchback (marked black on the handout map) just a few meters into your journey.  Descend some steep singletrack, taking in the views, and reach the Deer trail turning left briefly until the start of the Bobcat trail, which is about 1 km itself in some complete forest and singletrack.  I noted the aggressive chipmunk chirping away and laughed, but then around the next corner, a white tailed deer stood staring at me, not nearly as worried about my presence.  After a few turns on rock saddled singletrack that traverses the hill, you descend out of Bobcat onto the Deer trail again.  Now reach and follow the Falcon Point trail (the resort will hand you a good map that's easy to follow and signage exists at trail intersections) about a kilometer and a half towards Birdie lake and connect with the Okanagan Loop traill. This is the jewel of this trail network and an example of a trail that delivers on all fronts.  It has some excellent and at times technical singletrack with cardio ascents, twists, and superb views up and down Okanagan lake and distant mountains -- this segment is about 3 km long.  I wish it continued along the ridge that Sparkling Hill Resort owns -- and if they do, they've got tons of terrain to work with -- I'd take it down towards  the lake and back again for an epic loop for those hikers who want to be out all day.As I continued, the trail exits at some paved trailway -- at the end of the lookout loop trail, you really aren't that far from the resort it's a short walk uphill now to where you started.  Just in time for a massage, steam room, or spa treatment and there isn't a larger spa in Canada as Sparkling Hill Resort has 48 treatment rooms.  A stay at the resort is not a bad way to take in a combination of wellness, nature, and trails.  Your jaw will drop as you enter your room, each features panoramic wall windows with un-matched views (and lots of crystal) but don't limit yourself to the room view, get out on the trail, and do this combination hike. You won't have any bear encounter issues or other wilderness worries, but the trail is remarkably appealing along the Okanagan Lake Lookout trail and it will appeal to the photographer as well for many reasons.",
    "directions": "Sparkling Hill Resort -- Vernon area, see turnoff just before Vernon coming from Kelowna, and proceed to the very end of the road. Look for the signs as you approach Vernon on Hwy 97 from the South.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/10779/reg_-DSC0005-471-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10779/reg_-DSC0010-476-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10779/reg_-DSC0011-477-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10779/reg_-DSC0014-480-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10779/reg_-DSC0016-482-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10779/reg_-DSC0023-489-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10779/reg_-DSC0029-495-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10779/reg_-DSC0035-501-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10779/reg_-DSC0036-502-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10779/reg_-DSC0037-503-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10779/reg_-DSC0040-506-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10779/reg_-DSC0043-509-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10779/reg_-DSC0048-514-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10779/reg_-DSC0057-522-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10779/narrow_-DSC0003-469-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10779/narrow_-DSC0031-497-5.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/sparkling-hill-bobcat-lookout-trails-near-vernon-bc-10779",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "7 km",
        "Town": "Vernon, BC",
        "Type": "out-and-back"
    },
    "title": "Sparkling Hill - Bobcat & Lookout Trails",
    "trail_id": "10779"
}