{
    "description": "Mt Conkle (reached from the Trans Canada Trailhead off Fyffe Rd. and finally Fenwick, in Summerland) has some decent singletrack which takes one up to some great views over the lake and surrounding peaks.  The wineries and pastures below make for some great views and the singletrack here is all about the climb and spending some time along the top ridgeline before descent.  Again, the original trails here are likely the result of dirt-bikes but generally it's non-motorized traffic only including mountain bikes.One can start with a warmup along the Trans-Canada Trail for a short while, and there is a critical fork or turn-off heading up into the singletrack and the climb up Conkle.  If you pay attention you will see the trail turn-off that is obviously going up off the TCT and look for a small orange arrow on a tree.  Max 5 or 10 minutes of the TCT -- further than that you've gone too far on the TCT but it's an easy ride that some may like.Unfortunately I missed this and plodded along the TCT overlooking the KVR (when you can see it).  I stayed on the TCT too long and ended up on the back-side of Mt. Conkle.  I was now on old jeep road or utility trail - no riders using this area.  I kept going -- climbing more looking for an access point to the peak -- and almost found myself circumnavigating Conkle (which would be a great addition if this ever gets opened up for more recreational use and trail building).  The map to the right shows the long ridge-line up top which would be ideal for long flowy descent and ridge riding.I reversed and back-tracked until I could get on the actual Conkle trails and found the singletrack.  I was on grassland slopes (the pics) with switch-backs and great views, the ridge-line and peak above me.  I wanted to finish it off but I was out of time.This is a good area for some variety (once you've done Summerland Bike Trails ) -- and if it gets some trail maintenance and development, could be a prime bike area.What makes all this possible it seems are the access points off the Trans-Canada trail / KVR that exist at various trailheads in Summerland.  Should someone have a more complete GPS track for these trails - please use the contact us at the bottom.Bike shop / rentals: Freedom Bike Shop Accomodations: Summerland Resort",
    "directions": "Fenwick trail access point of the Trans-Canada trail off Fyffe road, off Fenwick (a short drive to the trailhead and sign) road, which is off Victoria Road (in behind Giant's head) in Summerland.  It's really close to town, so it makes for a good ride area.  If you drive along Fyffe too far, you'll go under the train bridge (KVR -- and the touristic steam train ride still runs on these tracks so they are still there) and eventually into private driveways -- so keep an eye out on the left for the Trans Canada Trail signage at the side of the road before u go under the tracks. On Fenwick, continue just one hundred meters or so to the sign and parking area. There is a map / sign.  Take the trail at first, then just up the first major steep climb, you'll see you can continue on the TCT (as I did) or go left and up as per a small orange arrow you may spot on the tree.  Otherwise, take any opportunity to climb rather than continue along the TCT.  There are other steep climbs and opportunities to get back onto the Conkle trails if you miss the first one, and that's what I found on my way back to at least sample some of the singletrack.  Once on the grasslands facing up the slope, take whatever trails seem fun going up.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/10781/long_offTCThikebike-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10781/long_panorama-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10781/long_wide-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10781/reg_conkle2-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10781/reg_conkle5-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10781/reg_fenwick-5.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mt-conkle-singletrack-near-summerland-bc-10781",
    "stats": {
        "Activities": "mtn-bike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "15 km",
        "Town": "Summerland, BC",
        "Type": "out-and-back"
    },
    "title": "Mt Conkle Singletrack",
    "trail_id": "10781"
}