{
    "description": "The Summerland singletrack network just past the KVR trestle on the highlands above the KVR (just past Giant's Head Winery and Summerland Sweet) is a hidden gem for B.C. that rates with the best singletrack networks anywhere.  The terrain is dry interior singletrack in pine forest, with two hills / mountains to shape the trails and one deep Canyon defining two sides.There are no trail names (that I know of) and certainly no signage within the trail network, and this may be because the land is private or somehow allows for tolerated non-motorized use (locals please correct me here).There are two loops that locals tend to ride with options that hit the main trails and features, I was lucky to pretty much circle the trail network and then run into a local on the far side (on a needle peak overlooking the golf course across the canyon).  At this point on the peak, I felt a resemblance to some Fruita canyon rim riding which is worldclass, and this trail to the peak (see the jagged rock pics and views across the Canyin) had singletrack just 2 or 3m meters off the Canyon edge - so be careful.  It was exhilarating to reach the peak, however, in the direction I had come to get there, I had to hike-a-bike up some steep ramps from way down low on the canyon bench, to higher benches, and then finally get on the singletrack trail leading to the peak.  Once at the peak, I'd advise returning on the trail you came to then connect with the main trail -- and you can see where that is in the map as it follows a contour line.  Many of the trails may have initially been formed by motor-cross or dirt bikes, with more recent trails being placed by mountain bikers.  On my way down from the peak, I ran into a local and I followed him on some of the most fun and flowiest descents I have ever ridden.  I had gained most of the elevation climb before this point, so the second half of the ride was joy.  Ponderosa pine, wild horses, flow, and singletrack traverses across steep dry slopes keeps ones focus.The attached GPS map (downloadable) shows a great loop with what I'd call a pretty good tour of the trail network.  Once into the network, however, you can choose any number of trails and ideally after a few days, you'd have a pretty good idea on how to create the best loop for you.In my case, I started by taking the KVR across the train trestle (large trestle) from the main trailhead towards Penticton as my warmup, and just to see some of the KVR.  For non-mountain bikers, this is easy trail and you can send them out on the KVR for a few hours while you do the good stuff.  Circle back to the trestle. Now, on the trestle as if you were crossing it for the first time (or if you have just crossed it for the first time) head to the right up the hill right after you get off the trestle - u should see bike tracks.  From here, follow the fence line (and research station boundary) which rolls and dips along a dusty trail for a few hundred meters until the fence line ends and you appear to have two choices (left and up, or right and flat - alongside the Canyon).You should veer left and up the hill (up and into the trail network until you reach the main \"wide\" trail that seems to act as the main access corridor to get to the trails.I made the mistake of not veeering left (and up) and ended up on some singletrack along the Canyon edge and you can see that in the map to the right (play my GPS track forward). It's clear  that some bikers go this way (or return), and I enjoyed the canyon slope side trails that have you on narrow singletrack.  However, you will gradually be presented with trail choices that lead you down further into the canyon - and this can trap you.  Again, not a huge problem if you are prepared at a certain point to hike-a-bike back up (on game trails) up to the benchlands, as I did.I then found myself on some flat wide (jeep) trail (likely what I should have been on had I started out correctly) which took me to the rear of the canyon and some great views over to the golf course.  Now, after a stop for few pictures, I noticed old dirt-bike trails going straight up (non bikeable) the grass ramparts.  I switchback hike-a-biked myself up one of these, then another.  After a bit more hunting, I found the rim trail going to the peak and this turned out to be amazing, I took a few more pics then realized the way down was very steep -- so I traversed a bit of gentler sloped field (that you can see on the map well if you click Expand +) more or less in the direction of where I had come from and sure enough -- found myself on \"official\" or desireable biking singletrack and this is where I met another biker climbing from the other direction.  He said he had never been to the peak (I recommended it) but offered to take me on a tour.I gladly accepted and we began by finishing the climb and then some downhill side-slope traverses and switchbacks down until we hit some very fun flowy singletrack and up again (then down again and so on)  -- what a find -- I love these trails and would be out here weekly if I was in the area.  I can't really describe the rest, I was just following, but the GPS track to the right gives you the idea, and, again, with some general sense of where the lake, peaks, and canyon are -- I think you are fine in here exploring the trails. Bike shop / rentals: Freedom Bike Shop Accomodations: Summerland Resort",
    "directions": "Get to Summerland Sweet and the KVR (Trans-Canada Trail) on the road just past the Giant's Head Winery.  Another thing to ask for in town is the area near the research station.  There is parking on the side of the road and signage for the KVR and the trestle that crosses the canyon. Immediately after you ride over the trestle, go right up a slope, following other bike tracks.  Now climb, and follow a fence line along the research station, as it dips and rolls.  At the end of this connector, begins your ride.  Keep left and climbing into the trail network, rather than to the right and along the canyon wall.  See above or the GPS map to the right and perhaps ask at the local bike shops including Feedom Bike Shop in Penticton (where I rented).  The people there are very friendly, and will direct to other trails in the area as well.",
    "geohash": "c2fc",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/10780/long_rimcanyon-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10780/reg_bikeonrim-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10780/reg_lowerbenchback-5_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10780/reg_start-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10780/reg_trestleview-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10780/reg_typical-5.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/summerland-singletrack-bike-trails-near-summerland-bc-10780",
    "stats": {
        "Activities": "mtn-bike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 5,
        "Time": "4 hrs",
        "Total Distance": "30 km",
        "Town": "Summerland, BC",
        "Type": "out-and-back"
    },
    "title": "Summerland Singletrack Bike Trails",
    "trail_id": "10780"
}