{
    "description": "The Canyon Nature trail close to the Manning Park lodge is a simple, well maintained, groomed trail that just about anyone can do.  It's not entirely flat, as it does switchback a few times and has a bridge over the Similkameen (these are the headwaters), but it's downright easy and a short hike.  The hike is good for fall colours, a river walk that the entire family can do, or that after-dinner stroll while staying at the lodge, it's 75km either way to the nearest town.The trailhead is just past the bridge over the Similkameen River after following the road to the Manning ski area (i.e. turn right off HWY 3 just past the cabins of the lodge).  The trailheads for several other great (all day) Manning Park hikes are also nearby, so while some in the group enjoy an easy hike and perhaps a long lunch at the lodge, you can go tackle Windy Joe, Frosty Mountain, Poland Lake, Heather trail and others.",
    "directions": "Manning Park Lodge off Hwy 3 in Manning Park, take a right as if going to the ski area (just past the lodge parking area) and drive 500m or so over the bridge, and immediately on the right is the Canyon Nature trail.  I didn't see any signage, however, you won't find a better groomed and easier trail, just stay close to the river at the start, the end will have you cross and emerge on the other side of the river and also at the bridge.  You can also get a map of local hikes in the lodge office.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/10786/reg_canyon1-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10786/reg_canyon2-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10786/reg_canyon3-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10786/reg_canyon6-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10786/reg_canyon7-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10786/reg_canyon8-5.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/canyon-view-nature-trail-manning-near-hope-bc-10786",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "4 km",
        "Town": "Hope, BC",
        "Type": "out-and-back"
    },
    "title": "Canyon View Nature Trail - Manning",
    "trail_id": "10786"
}