{
    "description": "This is a good short hike that will lead you to a couple of sea arches and sea caves in Scots Bay, Nova Scotia.Setting off from my usual endeavors of finding waterfalls, I stumbled out of the Pineo Vault Ravine a bit dejected.  Two kilometres of bushwacking to see a 2m fall.  After spotting some tall rock formations in the distance and since the tide was low, I decided to explore the nooks and crannies off Caroline Beach.  What a pleasant surprise to find after a few minutes walk heading west the first of a series of sea caves.  Walking down toward the second sea cave, I spotted a natural arch.  This arch can be walked through upright but is probably partly submerged at high tides.  Again heading west from the Pineo Vault brook, I came across a headstone commemorating a sea disaster that happened closeby.  Travelling further west there was some more sea caves, sea crevasses (roof of the cave fell down) and another natural arch.  This one you had to duck to pass under.  Overall a great place to explore, easy to walk, good for all ages BUT look at your tide charts before setting off as most of the features will be blocked off at high tides.",
    "directions": "In Canning, take North Ave towards the Lookoff (top of North Mountains).  Turn left on Gospel woods Rd and then immediately right on Bennets Bay Rd. Drive to the end.  Access the beach and head west towards Caroline beach (third coove to the west).  First sea cave and arch are located at ; 5010320.68 m N, 383305.21 m E",
    "geohash": "f841k",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/10795/reg_DSC-0058-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10795/reg_DSC-0039-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10795/reg_DSC-0042-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10795/reg_DSC-0055-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10795/narrow_DSC-0043-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10795/narrow_DSC-0054-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10795/SeaCavesD610TWO6757.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10795/SeaCavesD610TWO6786.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10795/SeaCavesD610TWO6790.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10795/SeaCavesD610TWO6814.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10795/SeaCavesD610TWO6821.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/caroline-cove-arches-and-caves-near-wolfville-ns-10795",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 5,
        "Time": "1 hrs",
        "Total Distance": "5 km",
        "Town": "Wolfville, NS",
        "Type": "out-and-back"
    },
    "title": "Caroline cove (Arches and Caves)",
    "trail_id": "10795"
}