{
    "description": "A nice hike through a somewhat undisturbed watershed to a couple of waterfalls one of which looks like a waterslide.  Note to self; come back with an inner tube for this one.Because the upper portion of the watershed of Allens brook is dedicated for the drinking water of Falmouth, the forestry operations are few and the stands of trees close to the brook are in the mature mixed forest category.  The first three falls are actually on some tributaries of the brook.  The first two you will notice from the gpx file are located close to the road.  Unfortunately a while ago it seemed like a good place to dump some vehicles.  So you have the beauty and the beast effect here with a gorgeous waterfall beside an old wreck of a car.  Pushing further upstream you follow the brook to yet another fall on a tributary and then to the slider fall mentioned above.  Ok it?s not a fall at all but it?s really cool to look at.  I have to wonder what is underneath the water?probably a big slab of rock.  The water just runs evenly over the top mimicking perfectly a natural waterslide.  Upstream of the waterslide you will see two abutments made of boulder size rocks on either side of the stream .  I was thinking they were part of an old bridge maybe?  That is until I came up a little more upstream to find a dam constructed of the same material right across the whole stream.  Not sure what these dams would have been using for but I have heard that there used to be a whole community here  called Eldridge.",
    "directions": "Take Falmouth Back Rd to Eldridge Rd.  follow Eldridge Rd until falls 1 and 2 @ 4982810.65 m N, 403281.06 m E.  the other fall, natural water slide and dams can be access from this side rd; 4982437.20 m N, 401552.28 m E",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/10797/reg_DSC-0081-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10797/reg_DSC-0082-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10797/reg_DSC-0086-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10797/narrow_DSC-0077-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10797/narrow_DSC-0085-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/allens-brook-natural-waterslide-and-falls-near-windsor-ns-10797",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "3 km",
        "Town": "Windsor, NS",
        "Type": "out-and-back"
    },
    "title": "Allens Brook Natural Waterslide and Falls",
    "trail_id": "10797"
}