{
    "description": "A short hike to a series of falls on Ells Brook, Kings County.  These falls were mapped out in the 1890s but since then very little attention has been given to them since.  The locals seem to know about them because there is some kind of unofficial path beside the brook.  Although the falls I saw were nice there were smaller than the 50ft I was hoping to see.  After looking at my tracks and overlaying the location where I thought the fall might be, I saw that I didn?t travel the right branch of the brook?that will have to be for another day.  The 50ft I was hoping for was on the branch to the south.  I did see one fall on that second branch but it was 15ft at best?.although it wouldn?t be the first time these old maps have steered me wrong.   The series of falls are located in a nice mature evergreen forest.  There is a deep carpet of moss covering everything but you have to be careful of the barbed wire which used to be strung parallel to the brook but is now in disrepair.",
    "directions": "Drive on highway 358 towards Scots Bay/ Cape Split.  Turn on dirt road located at 20 T 390725 5015007  and park at 20 T 391405 5014877;  The brook is to the south of the dirt road.",
    "geohash": "f841wf",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/10796/reg_DSC-0063-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10796/reg_DSC-0066-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10796/reg_DSC-0069-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10796/narrow_DSC-0071-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/ells-brook-falls-near-wolfville-ns-10796",
    "stats": {
        "Activities": "snowshoe hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "2 km",
        "Town": "Wolfville, NS",
        "Type": "out-and-back"
    },
    "title": "Ells brook Falls",
    "trail_id": "10796"
}