{
    "description": "Hike or bike up the south face of Skirt Mountain, and be rewarded with a jaw-dropping view south over the Western Communities of Victoria, BC, sweeping from Race Rocks to the Observatory in North Saanich.",
    "directions": "From the north end of the new (2012) Leigh Road overpass over the Trans Canada Highway in Langford, head north on the logging road.  You can park on Savory Road.  If you are a strong mountain biker, it is just possible to cycle up this road.  If you cycle up, I'd recommend cycling back down through Bear Mountain resort area due to the loose rock on the logging road (for a total of about 9 km back to the trailhead).After about 2 hours of easy-paced, viewless slogging uphill, look for a cardboard sign on your right marking the lookout trail, and follow the side trail to the right for about 5 minutes for a jaw dropping view of the South Island.  If you miss the sign and the readily-apparent side trail, you will reach the rough logging road's summit in another 15 minutes or so and begin to head down the other side on a better-groomed gravel road.  Either retrace your steps back down the logging road that you came up (for a total of 4 km), or keep following the gravel road uphill, keeping to the left as you begin to descend and come out on an area of currently-halted development.  This route sweeps around the outer perimeter of the Bear Mountain golf course and comes out in the Bear Mountain townsite where you can either call a cab or cycle back via Bear Mountain Parkway, rt onto Goldeneye Way, rt onto Setchfield, left onto Florence Lake Rd, rt onto Brock Ave, thence to your parked vehicle on Savory Rd.",
    "photos": [],
    "source_url": "https://trailpeak.com/trails/skirt-mountain-lookout-near-langford-bc-10809",
    "stats": {
        "Activities": "hike mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "4 km",
        "Town": "Langford, BC",
        "Type": "out-and-back"
    },
    "title": "Skirt Mountain Lookout",
    "trail_id": "10809"
}