{
    "description": "This is a nice little hike to explore the Kniffen hollow and its many waterfalls.  I was in the Bear River area and looking at a map, the hollow immediately drew my attention.  The contours on the topo and the name of the place suggested many rewards for the waterfall seeker.Setting off from the old entrance to the quarry, I headed into the old pile of slate materials.  Right tat the far end, I followed a small ATV trail and then headed into the woods.  The forest is mainly coniferous on the slope of the hollow and a nice beech forest surrounding the quarry.  Once in the woods, the terrain got very steep.  I followed a dry branch of the brook, stumbling upon the many cobbles and boulders hidden under the leaves.  At the end of the branch I had to hold on to trees and slide part of the way until I made it to the beginning of the Kniffen Brook Hollow.This is a spectacular place  hidden in plain sight.  The brook has carved a deep channel right into slate.  The slate on either side of the brook rises in times to fifty feet or more.  There are numerous falls and they do get bigger as you hike upstream.  One of the most striking aspect of this hike are the numerous large boulders in the stream.  The boulders are nothing strange except that there are so different from all the slate geology surrounding you.  It?s almost like the brook is the meeting place of two geological units.  Sometimes, I wish I knew more about geology.",
    "directions": "In Bear River, Take the chute Rd and then right on Purdy rd. Park at  4942290.89 m N, 290645.37 m E which is the entrance to an old slate quary and is located 750m from its convergence to Dunn Rd.  alternatively follow the chute Rd to where Kniffen brook crosses the road and hike upstream.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/10804/reg_DSC-0006-2--27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10804/reg_DSC-0024-2--27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10804/reg_DSC-0025-2--27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10804/narrow_DSC-0011-2--27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10804/narrow_DSC-0015-2--27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10804/narrow_DSC-0021-2--27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/kniffen-hollow-falls-near-digby-ns-10804",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "3 km",
        "Town": "Digby, NS",
        "Type": "out-and-back"
    },
    "title": "Kniffen Hollow Falls",
    "trail_id": "10804"
}