{
    "description": "This is one of a few popular routes hikers use to reach the peak of Mt. Katahdin in Baxter State Park. Easier than Cathedral, It's often used to create a loop that includes reaching the peak, as well as traversing the Knife's Edge, and descending the Helon Taylor trail.Saddle was originally a rock slide, and the path at times, goes through some pretty narrow, choked sections. Unlike Cathedral, however, it can be descended if weather conditions and brevity are not on your side when you reach the Knife Edge. I've always done this hike in October, and in the fall, expect to see fog, mist, even snow. Wind is common. You may think it odd to see people at the parking lot dressed in Balclavas, but if you're not wearing the gear, pack it along. Our last recent trip of 2012 found us in -7 degrees C and 5 cm of snow at the base, and 10cm at the peak with a gale! The smart ones toted MicroSpikes for their boots. It made some of the descents an easier affair.The trail-proper starts at the warden's cabin at Chimney Pond, but ultimately, the start of any hiking is at Roaring brook Campground, along the east end of the park.The hike gives you a 2,357 feet of elevation gain from Chimney Pond, to reaching the peak of Katahdin (5,267 feet) but is not the scramble like Cathedral route. The views looking back are spectacular. The vast plains to the east show you New Brunswick and a few minor peaks in the mid-ground. More dramatic are the views of Hemlin Ridge to the left and Pamola peak and the Knife's Edge ridge to the right that are part of most people's loop plan.After climbing the choked out ascent, things begin to level off to a scree field marked by cairns. Signage directs you to Hamlin Ridge to the right, and Katahdin's peak to the left. As you continue to climb through the vast bolder field of the table lands, take a moment to look behind you. The views of the surrounding peaks are reminiscent of Quebec's Chic Choc range.Seeing the summit sign from a distance will feel a bit underwhelming, but as you get closer, you'll see the drop offs and the Knife's Edge. For some, the feelings will flip flop to overwhelming.Depending on how many cars your party brought, your options for descent are to head back from where you came, descending back through Saddle, and Roaring Brook Trail, or as most people strive to do, continue along the Knife's Edge, and descend either Helon Tayor or Dudly trails. The former gets you back to the Roaring Brook parking lot directly, while the later puts you back to Chimney Pond at the base of the mountain. If you have a 2nd car, and positioned it on the West end of the Mountain, descending the Hunt Trail is the easier but long way to get back down without doing the Knife Edge.Shannon BurtEast Coast editor-A note about access to the park. There is an on line registration used to book parking at the trailhead. If you are a non Maine resident, you can only book 2-3 weeks (check that) prior to your planned trip. It cost me $19 for a car, and included the access fee. This is not determined by the number in your party, but by the vehicle.",
    "directions": "Drive 30 minutes North from Millenockett and follow the signs for Baxter State Park.",
    "geohash": "f2nvp",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/ME/10805/reg_150394-10151078414522038-1872889484-n-6702.jpg",
        "https://trailpeak.com/storage//content/trails/US/ME/10805/reg_293759-10151078412732038-1632581485-n-6702.jpg",
        "https://trailpeak.com/storage//content/trails/US/ME/10805/reg_398339-10151078415412038-950100406-n-6702.jpg",
        "https://trailpeak.com/storage//content/trails/US/ME/10805/reg_425777-10151078413347038-32049274-n-6702_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/US/ME/10805/reg_430169-10151078414147038-136998639-n-6702.jpg",
        "https://trailpeak.com/storage//content/trails/US/ME/10805/reg_524968-10151078413717038-304800047-n-6702.jpg",
        "https://trailpeak.com/storage//content/trails/US/ME/10805/reg_535875-10151078413927038-1097817275-n-6702.jpg",
        "https://trailpeak.com/storage//content/trails/US/ME/10805/reg_576514-10151078413827038-1619810586-n-6702.jpg",
        "https://trailpeak.com/storage//content/trails/US/ME/10805/reg_579233-10151078415242038-1378925586-n-6702.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/saddle-route-baxter-state-park-near-millinocket-me-10805",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "winter fall summer",
        "Stars": 5,
        "Time": "2 hrs",
        "Total Distance": "3 km",
        "Town": "Millinocket, ME",
        "Type": "out-and-back"
    },
    "title": "Saddle Route, baxter state Park",
    "trail_id": "10805"
}