{
    "description": "A nice short adventure on the south shore near Meteghan, Nova Scotia.  Nestled on the coastline is a picture perfect little cove called smugglers cove.  On one end of the rocky cove is a natural cave that used to be a hiding spot for smugglers.  On a dark and stormy day, I set off to see this hidden gem and perchance find some contraband rum stashed away in the cave. From the provincial park on the top of the cliffs, find the staircase that leads to the cove.  Do not follow my example and just bushwhack your way down there.  There is a nice and solid staircase on the northern end of the park.   Once at the cove, you will see on the opposite bank, a large opening? the smugglers Cave!!!!  To be able to walk inside the cave, you will need to consult a tide table.  You can only access (without getting a soaker) the inside at 1hr pre and post low tide.  The cove is made of a large cobble beach and then you have to navigate over seaweed covered boulders.  Move carefully and you will make it to the cave.  I had to shimmy on the side wall because the tides wasn?t low enough for me to access it from the seafloor.  ?Once inside, the cave continues for a few meters and then branches off into  two smaller leads.  Unfortunately someone  got a hold of the treasure before I got there.  The ceiling of the cave at the entrance if quite impressive.",
    "directions": "Drive on old highway 1 towards Meteghan.  Pass through the village heading towards Yarmouth.  The park is located about 2km away with signage for Smugglers Cove.",
    "geohash": "dxbg",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/10832/narrow_DSC-0005-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/smugglers-cove-cave-near-yarmouth-ns-10832",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 5,
        "Time": "1 hrs",
        "Total Distance": "1 km",
        "Town": "Yarmouth, NS",
        "Type": "out-and-back"
    },
    "title": "Smugglers Cove Cave",
    "trail_id": "10832"
}