{
    "description": "A ski route that offers some sloping terrain through very nice forest in the Ottawa NCC greenbelt.  A loop on trail #20 after parking off Corkstown at the parking lot (P3) -- on the other side of the Queensway from P3 means this area is less visited, and in my opionion, much nicer.Trail #20 is not as frequently used, possibly because it requires taking the 417 underpass (rail underpass) to access the loop. I find the trail 20 and it's back-country off-piste options to be a great opportunity for those looking for snow-laden cedar and evergreen forest, with sloping Canadian shield rock and ledge type terrain.  In summer, this area can hold water and be very wet but in winter, it's a mini-paradise. I was glad to add it to my winter favourites.  There are connections to more trails across Tim road, and, the other parking lot at P4 which provides access to trails 21 and 22.  At the far end of the #20 loop, you'll see a sign indicating these options, the whole route is well signed and partly consists of trans-Canada trail.Trail 20 all on it's own makes for a pleasant hour of skiing (head off trail for more fun).  In heavy snowfall years, it's going to give you enough protection from the rock slabs and outcrops that are frequent.  I like the terrain, and with back-country skis, one can explore the power line slope in open terrain or bush whack through forest (until you run into the Canmet facility). In winter 2012/2013 there was a lot of snow.No real worries of getting lost, you've got roads on all sides, however, as it gets dark and in thick bush, it can be disorienting off trail. I used my GPS at dusk to locate myself back to trail 20 as it got dark (Magellan 610). I promptly then lost said GPS in the dark, but was able to return the next day and uncover it in the snow, what luck!  A great area that is highly recommended for NCC greenbelt enthusiasts.  One other advantage to the trails; they are free.  A great PDF is available from the NCC showing the Greenbelt trails here.",
    "directions": "Take Corkstown road (off Moodie drive on the north side of the 417),  drive a few kilometers past the Nepean Equestrian area, and park either just short of P3 near the train tracks and look for the underpass (opposite)  that you'll take under the 417. Or park directly at P3 and walk back a short distance to the underpass. The open segment (about 1km) that runs along the 417 and the adjacent corn field can be very windy and cold -- dress in layers. P3 offers a shorter loop on the north side of the 417 right from the parking lot, it's also popular with snowshoers and is mostly flat except for the back-side.",
    "geohash": "f241c",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/ON/10855/reg_DCIM59[N4532015W07585996T3E0F4BBDH006F24]-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/10855/reg_DCIM45[N4532631W07585987T3E0B51B1H0069E6]-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/10855/reg_DCIM53[N4532832W07586079T3E0B5316H007099]-5_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/10855/reg_DCIM56[N4532816W07586195T3E0CBC36H006B46]-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/10855/reg_DCIM64[N4531827W07586137T3E0F50A8H007919]-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/10855/reg_DCIM65[N4531827W07586137T3E0F50AEH007909]-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/10855/reg_DCIM66[N4531827W07586137T3E0F50B6H0078E8]-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/10855/reg_DCIM67[N4532125W07585842T3E0F5449H00781E]-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/10855/narrow_DCIM42[N4532627W07585975T3E0B519BH006766]-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/10855/narrow_DCIM55[N4532840W07586083T3E0B533FH006C80]-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/10855/narrow_DCIM57[N4532794W07586183T3E0CBC60H006568]-5.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/ncc-greenbelt-trail-20-ski-near-ottawa-on-10855",
    "stats": {
        "Activities": "snowshoe ski-bc ski-xc",
        "From": "",
        "Seasons": "winter",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "10 km",
        "Town": "Ottawa, ON",
        "Type": "out-and-back"
    },
    "title": "ncc greenbelt trail 20 ski",
    "trail_id": "10855"
}