{
    "description": "This is a great classic 13.4km XC ski loop that is a figure 8 shape using the Gatineau Park parkway (groomed and wide) as warmup. Then taking to the wooded groomed trails (twisty and more advanced) for the climb to pink's lake (instead of the parkway) on trail #15.  It's a much more scenic route. The google map to the right shows the loop, starting with rolling cardio and easy breezy ski tracks with double sets of tracks and skate ski room in the middle. You get a good warmup during the first 45 minutes after which you reach the main trail intersection (waypoint X in the attached GPS data) where you will likely see other skiers pausing.  Take a right and immediate left here up a small rise, then you are back in the valley skiing parallel to the parkway for a while.  Skiers who remain on the parkway are in for a long steepish climb to Pink's lake -- and your climb will also be a long one, but at least you'll be in the woods on narrower twisty groomed trail (for classic only) with the occasional respite from the climb as the trail levels, turns, and climbs again.  You have some level trail along ridgetop, which is very nice, followed by a large \"downhill\" and then level out to the Pink's parking lot (waypoint pinks-plot).  After this, you re-connect with the parkway and do a small climb to the Pink's lake viewpoint, it's about a half-kilometer of flat terrain at this point, enjoy it you worked for it.Now prepare for a thrilling downhill ski in tracks to the bottom of the parkway and not long after, the point where you were before to turn off the parkway.  Take the same turn-off to begin the final leg of your figure 8 on trail #29, again taking narrower trail in the woods with some variety.  You'll see signs to Asticou and the final part of #5. A great way to sample parkway skiing and groomed trail skiing in the woods.  The lower area of the figure-8 intersection point provides access to a number of \"flat\" ski trails that intersect in various ways -- this route is fairly direct back to the Asticou parking lot.  Note: there is a trail fee for Gatineau park users.",
    "directions": "The Asticou parking lot is a large parking lot that works well when other parking lots are full -- and provides one of the main access points for Ottawa skiers who are short on time (don't have to drive to Old Chelsea or further). Gamelin is another such starting point however because Asticou doubles as a training / convention centre, parking is ample.  Turn into the Asticou centre off Du Lac Des Fees Prom which one can reach from 148 and 105 as per the map, near the old Hull Armoury.  Drive the promenade along the creek from Lac Des Fees and basically stay on it as you pass a few intersections, until you see Astocou centre on the left and the signs for various P lots, just stay left the whole time, driving to the back-side of the centre, park where you see other XC skiers and you'll note the small NCC shack and trail map.",
    "geohash": "f244",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/QC/10858/reg_DCIM68[N4547478W07579633T3E13505EH00C0EB]-0.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/10858/reg_DCIM70[N4547446W07579887T3E135111H00C4F8]-0.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/10858/reg_DCIM72[N4547272W07581515T3E13554EH00EA2F]-0.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/10858/reg_DCIM76[N4546602W07581243T3E13581DH00BFA5]-0.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/10858/reg_DCIM77[N4546596W07581217T3E135846H00B766]-0.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/10858/reg_DCIM78[N4546606W07578850T3E135AD0H007DE8]-0.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/10858/reg_DCIM79[N4546605W07578850T3E135AD6H007E73]-0.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/10858/reg_main-back-5_best1_.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/asticou-pinks-xc-loop-near-gatineau-pq-10858",
    "stats": {
        "Activities": "ski-xc",
        "From": "",
        "Seasons": "winter",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "14 km",
        "Town": "Gatineau, PQ",
        "Type": "out-and-back"
    },
    "title": "Asticou-Pinks-XC-loop",
    "trail_id": "10858"
}