{
    "description": "From the winter parking area outside of Greenville, this is the easiest route in to Gorman Lodge, one of the AMC wilderness lodges in Maine's 100 mile wilderness.Once we deposited our duffle bags at the kiosk, We followed Katahdin Ironworks (KI) road, which, come winter, is groomed for skiing (faster) or snowshoeing (slower). Passing Hedgehog Gate, we continued on until we reached Gorman Lodge Trail, a narrower and equally well groomed but more attractive rolling path which took us the rest of the way.It's an easy run with xc skis, though the majority of us used some flavor of a Backcountry setup. Gear can be rented back in Greenville if you don't have your own. Skins are not necessary unless you have other ambitions among the glades of 3rd Mountain. On a normal winter day, we may not have been fighting a foot of fresh snow, so the groomers narrowed our options down to one. Otherwise a nicer yet longer route in takes you south along Long Pond (Trout Brook and Long Pond Trails) As Winter wears on, yet another alternative emerges once the lake ice freezes enough for a more direct route though exposed to the elements.We set off at 1:50 and arrived for check-in at 4, following the well marked route; a mini adventure to get to our main adventure.The lodge offers both cabins and a bunkhouse. There are showers, bathrooms and a sauna in the maine lodge building, as well as outhouses near the bunkhouse. Meal plans are available along with lodging as a package with discounts for AMC members. In all, it's a pretty posh setup they run. Winter dates start on December 27th and run until late March (20's) After that, they switch over to summer operations, where it's possible to drive in to the lodge and surrounding trails.Map of trails in the area:http://www.outdoors.org/pdf/upload/2012-MWI-Rec-Map.pdfShannon BurtEast coast editor",
    "directions": "(From outdoors.org's website (AMC's webpage)Upon arriving in the center of Greenville via Rt. 15 North, proceed north one block.Turn right onto Pleasant Street after about a mile the road's name changes to East Road.After 2 miles the road becomes gravel and its name changes again to the KI Road.Proceed for 11 miles to the Winter Parking Lot.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/ME/10859/long_IMG-8669-copy-6702.jpg",
        "https://trailpeak.com/storage//content/trails/US/ME/10859/long_IMG-8682-copy-6702.jpg",
        "https://trailpeak.com/storage//content/trails/US/ME/10859/reg_IMG-8663-copy-6702.jpg",
        "https://trailpeak.com/storage//content/trails/US/ME/10859/reg_IMG-8664-copy-6702_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/US/ME/10859/reg_IMG-8666-copy-6702.jpg",
        "https://trailpeak.com/storage//content/trails/US/ME/10859/reg_IMG-8673-copy-6702.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/gorman-lodge-amc-100-mile-wilderness-near-greenville-me-10859",
    "stats": {
        "Activities": "ski-xc",
        "From": "",
        "Seasons": "winter",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "12 km",
        "Town": "Greenville, ME",
        "Type": "out-and-back"
    },
    "title": "Gorman Lodge, AMC 100 mile wilderness",
    "trail_id": "10859"
}