{
    "description": "This is one of the trail options available from Gorman lodge, one of the AMC winderness lodges near Greenville Maine. It connects on to the Appellation trail if you prefer. We took it down the other side near to where there is a set of ponds (indian and boot pond) and a shelter at the water's edge.Setting out from Gorman lodge, after the required day trip sign-in, we headed east and then South getting onto the Long Pond trail. This was a wide swathed trail groomed for xc skiing that parallels Long Lake. Paralleling that is Chairback Mountain Road, a route we took by accident on our return)Soon after hitting Long Pond Trail (10-15 minutes snowshoeing), we arrived at a trail sign indicating 3rd Mountain trail to our left. The path narrows to a foot path, and intersects Chairback Mountain road, which is a service road for the area. From there, 3rd Mountain trail heads into the woods, and slowly begins to gain elevation.We arrived a day after a big storm, but to our advantage, a crew of seven had cut a new snowshoe path up past the Appellation Trail junction. We decided to continue on and cut a fresh path down the other side with hopes of seeing some new sights. It was steep in places with stream crossings to make things interesting. The blue markers were hard to see at times, and rogue blue ribbons sometimes diverged from the real path.The actual trail takes you from 1100 feet to over 1950 feet at the highest route point. The climb would go higher if you take the AT route to the peak proper (to the east). Our route took us down the other side toward a shelter at Indian Pond. We think we got to less than a Kilometer from the end, but decided to turn back based on perceived time restraints. It did take us about an hour or more shorter to get back, so in hind sight, we should have gone for it.One notable feature is the presence of glacier erratics; huge cabin-sized rocks set in among the forest trees. If you're a boulderer, you'll be all set with alternative distractions along the way.In all, we traveled over 15km, but took a detour along Chairback mountain road where we went for a spell and turned around to set our route a-right. Without that, we would have traveled about 14K.A link to AMC's trail maps can be found here:http://www.outdoors.org/pdf/upload/2012-MWI-Rec-Map.pdfShannon BurtEast coast editor",
    "directions": "3rd Mountain trail starts on the south side of Long Pond, a few hundred meters from Gorman lodge, off of the Chairback Mountain Road.",
    "geohash": "f2nd",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/ME/10860/reg_IMG-8686-copy-6702.jpg",
        "https://trailpeak.com/storage//content/trails/US/ME/10860/reg_IMG-8687-copy-6702.jpg",
        "https://trailpeak.com/storage//content/trails/US/ME/10860/reg_IMG-8712-copy-6702.jpg",
        "https://trailpeak.com/storage//content/trails/US/ME/10860/reg_IMG-8715-copy-6702.jpg",
        "https://trailpeak.com/storage//content/trails/US/ME/10860/reg_IMG-8720-copy-6702_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/US/ME/10860/reg_IMG-8724-copy-6702.jpg",
        "https://trailpeak.com/storage//content/trails/US/ME/10860/reg_IMG-8725-copy-6702.jpg",
        "https://trailpeak.com/storage//content/trails/US/ME/10860/reg_IMG-8727-copy-6702.jpg",
        "https://trailpeak.com/storage//content/trails/US/ME/10860/narrow_IMG-8684-copy-6702.jpg",
        "https://trailpeak.com/storage//content/trails/US/ME/10860/narrow_IMG-8717-copy-6702.jpg",
        "https://trailpeak.com/storage//content/trails/US/ME/10860/narrow_IMG-8722-copy-6702.jpg",
        "https://trailpeak.com/storage//content/trails/US/ME/10860/narrow_IMG-8726-copy-6702.jpg",
        "https://trailpeak.com/storage//content/trails/US/ME/10860/narrow_IMG-8734-copy-6702.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/gorman-lodge-to-3rd-mountain-near-greenville-me-10860",
    "stats": {
        "Activities": "hike snowshoe",
        "From": "",
        "Seasons": "summer fall winter",
        "Stars": 4,
        "Time": "5 hrs",
        "Total Distance": "14 km",
        "Town": "Greenville, ME",
        "Type": "out-and-back"
    },
    "title": "Gorman lodge to 3rd Mountain",
    "trail_id": "10860"
}