{
    "description": "Although many Winter visitors to Maine's 100 mile wilderness choose the lodge to lodge tour, we for our first foray, decided to stay at one and treat it as a base camp for three nights, giving us two full days to explore the geography around the area. It also meant we didn't have to pack our things each morning. With three very fancy square meals and the perk of leaving a messy cabin every morning, that spelled stress-free in our books. I think we're on to something!Since our stay was at Gorman Lodge, (sometimes called Gorman Chairback because of the Chairback mountain range) on our first full day we snowshoed 3rd Mountain trail, so on this, our second day, we wanted to switch it up and ski tour. Now that the groomers had a full day's go at the trail system after the snow storm, we knew things would be easy going.They have over  90Km of trails, plus snowshoe routes, and their website (outdoors.org) shows seasonal maps with distance markers and level of difficulty, so you know what you're getting yourself into for what ever adventure you choose. On top of that, there is the Appellation Trail that cuts through the territory. With its shelters and camp spots, winter camping is certainly an option.They have one designated trail system to convey you from lodge to lodge. It is known as the Camp to Camp Trail. (C2C) When we did the trip, Medawisla lodge was closed for renovations, so we didn't venture beyond Little Lyford. A true hut tour would involve traveling between all three huts over at least a four day period. Our trip to Little Lyford was to see how the other half lived.To get to Little Lyford from Gorman Lodge, the trip down was almost 11K, and for most of it, considered intermediate. The route was groomed, like they groom skate ski trails. It's not tracked. There were some fun and twisty descents along the way that extended a fair bit. I hooted and hollered my full share! The last mile or so was flat and only tracked by previous skiers. One of the groomers told us that there needs to be a ton of snow there before they groom it, due to the rocks underneath. It runs along the aptly named Pleasant River, and provides a nice change in soundtrack, elevation, and scenery.  Little Lyford lodge is a beautiful spot, with its large dining area, and a intimate little lounge upstairs. Log structures are everywhere, harking back to its logging camp history. We appreciated the crackling fire, complementary cookies, coffee and m&m laced gorp as we dug into our bagged lunches. Many who base there, take on the snowshoe route to Indian Mountain, or go to explore Golf Hagas, a natural gorge and water fall system. (The Grand Canyon of Maine) It draws ice climbers as well. The trek was on our list, but just too far away to do by snowshoe from Gorman.Returning to Gorman, we took a slightly modified route. I had been skiing on a badly sprained or possibly broken big toe, but didn't want to be stuck in the cabin all day. By the time we reached Little Lyford, my foot was beginning to complain. I never got a go at the hills we descended, but given my condition, that was a good thing. The return was slightly longer, but easier from fewer hills. The weather was also a factor with strong winds, and blowing snow. Luckily, when we were exposed to it, it was a tail wind. (the Winter Gods were kind to us!)In all, our total distance was 22k that day. None of the trails we skied were that challenging, but the fresh snow in the trees, and the freshly groomed trails made it a true winter wonderland.Back country touring skis are a great way to travel, though you could get by with narrow classic skis, and if you want a real blast, spend part of a day thrashing it out on skate skis. (get them shipped with your bag) In some research I'd done before hand, they said skins were required. We didn't ski the one advanced level trail, but from what we'd experienced between Gorman and Little Lyford, and the parking lot, your skins can be left at home. We've skied much of the the hut to hut system in Quebec's Gaspesie National Park's Chic Chocs where the elevation gain and ungroomed conditions can challenge you. Here, you can be challenged by the distances you choose and by the mode you do them. There's lots out there, you just have to decide what you want to do.Here is one of their on-line  maps. It's funny, another couple were there from Nova Scotia, writing a travel piece for the Chronicle Harald, a Halifax newspaper.  Here's the article.",
    "directions": "From Gorman, take the camp to csmp trail system to Little Lyford. It's well marked, and unless storming, well groomed. Daylight in December fades soon after 4pm, so plan accordingly.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/ME/10861/reg_IMG-8738-copy-6702.jpg",
        "https://trailpeak.com/storage//content/trails/US/ME/10861/reg_IMG-8742-copy-6702.jpg",
        "https://trailpeak.com/storage//content/trails/US/ME/10861/reg_IMG-8743-copy-6702.jpg",
        "https://trailpeak.com/storage//content/trails/US/ME/10861/reg_IMG-8747-copy-6702.jpg",
        "https://trailpeak.com/storage//content/trails/US/ME/10861/reg_IMG-8748-6702.jpg",
        "https://trailpeak.com/storage//content/trails/US/ME/10861/narrow_IMG-8739-copy-6702_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/US/ME/10861/narrow_IMG-8744-copy-6702.jpg",
        "https://trailpeak.com/storage//content/trails/US/ME/10861/narrow_IMG-8749-copy-6702.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/gorman-to-little-lyford-amc-lodges-camp-to-camp-c2ctrail-near-greenville-me-10861",
    "stats": {
        "Activities": "ski-xc",
        "From": "",
        "Seasons": "winter",
        "Stars": 3,
        "Time": "6 hrs",
        "Total Distance": "22 km",
        "Town": "Greenville, ME",
        "Type": "out-and-back"
    },
    "title": "Gorman to Little Lyford AMC lodges Camp to Camp (C2C)Trail",
    "trail_id": "10861"
}