{
    "description": "Kayak the coast of Vancouver Island starting at Port Hardy and ending in Ucluelet. The most difficult water is rounding Cape Scott - we cut the point to miss very windy conditions. The next problem is the Brooks Peninsula. You need calm weather for an long paddle.  (editor's note: upon receiving this submission, we asked the author for a few more details, and other users who have completed this portion of open Pacific sea kayaking are encouraged to add a review / edit).The author has kindly provided this link to full trip details (in the form of an online Book with images and details) here.  This \"book\" contains almost 40 pages of details with references to other books / planning resources. The author also answered  the following questions.- best / worst campsites? Most if not all the campsites were good. You pay for the ones in Cape Scott. - best / worst stretches (most dangerous - vs more sheltered)? Most dangerous is rounding Cape Scott and Brooks but most of the trip is open to the Pacific [treat as advanced level]. At the Brooks we met another kayaker who had been waiting 9 days for weather calm enough to paddle around it. We met another single kayaker on his first trip paddling around the whole island. He paddled only on calm days. He spent 2 weeks on one beach. I don't know if he completed his plan. - any tips for starting / ending? Port Hardy is a good starting point for any trips in the area. Ucluelet is good as well but Tofino will do. - who should consider this (who shouldn't)? It depends on how much time you have [i.e. can you wait a week in one place for calmer water]. There are other places to get off the coast and there are boats that will pick you up or drop you off at some locations. There is usually good paddling in calm waters in the morning. Although in 2009 there was a lot of wind.(editor's note: open ocean paddling with the possibility of beach landings in surf can be dangerous, as can sudden weather changes, cold water & hypothermia risks, fog, and other hazards.  This would be advanced paddling with the requirement for thorough route planning, use of Marine radio, boat repair if required, clothing including wetsuit-drysuit (for bad days) / gloves / spray-skirts, extra paddle, tide planning, and so on.)  Tipping in bad weather without the ability to get back in one's boat and keep warm can be deadly.  The author is sharing this GPS data however anyone considering this trip should be fully prepared - no warranties are given on the accuracy of the GPS data or the repeatability of it as conditions change by season, weather, and tide).",
    "directions": "The start is the beach of the Port Hardy docks. The end is a boat ramp in Ucluelet.",
    "geohash": "c",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/10893/reg_DSC04965-43411.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10893/reg_DSC04966-43411.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10893/reg_DSC04979-43411.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10893/reg_DSC04989-43411.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/port-hardy-to-ucluelet-near-port-hardy-bc-10893",
    "stats": {
        "Activities": "sea-kayak",
        "From": "",
        "Seasons": "summer",
        "Stars": 5,
        "Time": "147 hrs",
        "Total Distance": "400 km",
        "Town": "Port Hardy, BC",
        "Type": "out-and-back"
    },
    "title": "Port Hardy to Ucluelet",
    "trail_id": "10893"
}