{
    "description": "L.C. Gunn Park is an easy grade walkway exploring the bluffs above the Fraser River located in the community of Prince George, British Columbia, Canada. The forested 3.5 kilometre trail follows the same route traveled by the early surveyors when planning out the railway line for the railroad companies.The hiking and biking trail follows a mostly pine needle cushioned route through a thinly spaced forest. The trail meanders through the trees leading to various viewpoints looking out over the city and out over Fraser River. The public access viewpoints located along the cutbacks are fenced keeping people from the edge. Please do not wander off the trail for views as the bluff is dangerous and sometimes unstable.This trailhead starts east of the Yellowhead Bridge and follows the cutbanks of the Fraser River to Hwy 97. At a casual walk the trail should take no longer than a half day on foot. The route is used also by dog walkers, joggers and mountain bikers.Please be aware of each other on the trail and respect each others right to be on the trail. It is a good idea to keep your head up too for the odd crazy rider. It is also good to remember that once out of the trees and near the river's edge that the wind sometimes can be strong coming down the valley.Luther Colins Gunn (LC Gunn) was a survey engineer who had done work for the Grand Trunk Pacific Railway and the Pacific Great Eastern Railway when he arrived in Prince George. Born in 1876 LC was considered one of the best in surveying land for the railroad. The trail follows the same route used by LC when surveying the rail routes in the Prince George area.",
    "directions": "Follow Highway 16 to the foot of the Yellow Head Bridge on the east side of Prince George, B.C., Canada. On the east side of the bridge take a right onto Guay Road from the highway. Follow the road to some gates. Take a right at the gates onto a gravel road and continue driving until the trailhead appears on your right.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/10907/reg_8701-10151442364550563-896330114-n-45506.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/lc-gun-near-prince-george-bc-10907",
    "stats": {
        "Activities": "mtn-bike hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "4 km",
        "Town": "Prince George, BC",
        "Type": "out-and-back"
    },
    "title": "LC Gun",
    "trail_id": "10907"
}