{
    "description": "I have previously hiked in this area finding two waterfalls described in another post (Oldham falls).  This time I returned because I read a report which mentioned a cave?..not only a cave but it was known to be used as a bear hibernaculum.  I know the geology of this area fairly well and there is no gypsum or limestone outcrops at all which would lead to the formation of cave?so I looked up old mine locations in the area of a lake mentioned in the report.  The report mentioned the bear cave near a lake named Rockhead Lake.  I immediately saw there was 3 abandoned mine sites in the vicinity of the lake and a bunch more close by since Oldham was a big gold mining area in Nova Scotia.Setting off from the road, you follow the old gold mining road.  There are a lot of crevasse or adit type opening on either side of the road or trail.  Lots of alders, some large evergreen trees as well.  Two hundred metres from the road, you cross a good size bridge.  Hike upstream for 50m and you'll see a nice 10ft fall.Continue on the main rod or trail until about 1.3km where the main road will turn to the right and head uphill.  You'lll need to carefully look at the gps track from this point on.  I made my way up some hill past some old mining activities and the ever present orange signs pointing to the fact that there are open holes in this area and that you should be careful.I headed into some wood on the right of the trail.  After trashing into some small shrubs and getting some snow in my boots?I saw a sharp drop off in front of me?.my heartbeat got faster as I made my way down in front of the drop off?.Exposed rock face?..lots of icicle hid an entrance into the rock??yahoo!!!!!!! I mistakenly thought?I got it!Unfortunately what I was faced with was  an old mine adit?..but way too small for a bear to ever get in there.  The adit is only about 10 inches wide but seem to go on for a ways into the rock.  More exposed rock face are close by but no obvious opening could be found.  So I was down one out of three options.  Little did I know then but my first discovery was the best.  The two others old mine openings were a bit further out but didm not amount to much.All in all, this is a nice exploration into an area seldom visited by non locals. The waterfall at the start of the trail and the numerous gold mine openings throughout the area makes thous a nice place to explore within 20km of hrm.",
    "directions": "Exit the 102 after the airport, and take highway 2 towards Elmsdale. Turn right on Oldham Rd and follow it to a 90degree bend. Continue straight in the bend and take Mine Rd.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/10906/reg_DSC-0082-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/rockhead-adit-and-fall-near-halifax-ns-10906",
    "stats": {
        "Activities": "hike mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "6 km",
        "Town": "Halifax, NS",
        "Type": "out-and-back"
    },
    "title": "Rockhead adit and fall",
    "trail_id": "10906"
}