{
    "description": "A short hike on the South Shore lead you to some very impressive erratic blocks in the middle of a birch forest.  The entrance is unassuming to the Port l?Hebert Pocket Wilderness.  However has soon as you set off from the parking lot, you enter the birch forest and see some of the lonely giants.  The trail is a loop of about 2.2km and takes you downhill to the coastline where there are a few picnic tables and then back up the hill towards your starting point.  Trees are mostly deciduous and the forest ground is covered by shrubbery such as Labrador tea.  At the starting point, I went to the left hand side to do the loop.  Went down a small hill, an then was face with a huge boulder.  Couldn?t resist going on top of it.  From this vantage point, I spotted another giant to the right of the trail (facing downhill)..about 75m off trail.  This giant looked promising for another reason?it looked like there was a crevasse type cave on its side.  Bushwhacked to it and saw for myself the small cave created by the huge blocks of rocks that flacked off the main boulder?.pretty impressive sight for being just off a trail.Made it all the way down to the harbour front where you could have a meal on the grass overlooking the water and then back up to my car again going through another ?field? of erratics.",
    "directions": "Highway 103 towards Shelburne.  The park is located to the south of the highway close to the community of Granite Village.  Parking is allocated at;  43°52'27.19\"N, 64°57'48.54\"W",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/10912/reg_DSC-0091-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10912/reg_DSC-0092-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10912/reg_DSC-0093-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10912/reg_DSC-0097-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/port-lhebert-pocket-wilderness-near-shelburne-ns-10912",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "2 km",
        "Town": "Shelburne, NS",
        "Type": "out-and-back"
    },
    "title": "Port l'Hebert Pocket Wilderness",
    "trail_id": "10912"
}