{
    "description": "Manic 5 Part 22011  part 1 = 70 km2012 ?part 2 = 61 km 2013 ? part 3 = planning to be done in march 2013Complete tour = 290 km Manic 5 reservoir looks like a big donut of 290 km perimeter.  We (Syvlie and I, Martine and Michel)  have as a target to paddle the complete tour.  As we are all 4 working,, we need to spilt  the tour into long week end feasible portions. One week end a yea;, the Canada confederation week end.  In 2011 we did the first 80 km. In 2012 we did the second portion, a 60 km ride.Starting from the 2011 ending point at Le refuge du prospecteur,  we paddle to Le relais Gabriel the first day.  The second day  we paddle from le relais Gabriel to the exit point on the 389 road.Lucky again; generally nice weather; no strong wind; wonderful  scenery.   presence of caribou.  We experienced a one hour   storm. We decided to pass the nigh at le Relais Gabriel instead of using the tents.  Big mistake, it was so hot in the rooms that we could not sleep.These two sections (Part 1 and Part 2) were the easy part. They are located on the east side of the reservoir having a public road all along the reservoir. The road gives access to three drop points and two points with services .To continue the tour, starting from 2012 ending point, it would be necessary to drive about 280 km to drop a car at the arrival point.  We are exploring others alternatives. One  of them being ?should I take my retirement and take  10 days  to do the remaining distance in once.   Work if definitively impacting too much my outdoor activity.",
    "directions": "From Baie-Comeau, take the 389 road. Le relais Gabriel est located at Kilometer 315.",
    "geohash": "f3p",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/QC/10915/reg_trailpeak-003-8318.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/10915/reg_trailpeak-005-8318.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/10915/reg_traipeak-002-8318.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/10915/reg_traipeak-004-8318.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/10915/reg_traipeak-006-8318.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/manic-5-part-2-near-fermont-pq-10915",
    "stats": {
        "Activities": "sea-kayak",
        "From": "",
        "Seasons": "summer",
        "Stars": 4,
        "Time": "98 hrs",
        "Total Distance": "61 km",
        "Town": "Fermont, PQ",
        "Type": "out-and-back"
    },
    "title": "Manic 5 Part 2",
    "trail_id": "10915"
}