{
    "description": "This trail works for short walks or longer hikes and skis.  Only a hundred meters or so from the parking lot is some *amazing* views into a narrow, deep little canyon.  Walk up past the canyon and you've got a gateway to the Tokumm Creek Trail and 20km of scenic, Rocky Mountain Valley.  It makes a great day trip or the start of something longer.There was a very large forest fire in this area in ~2003 or so and you will be walking through a lot of dead trees.  Early summer has amazing displays of colourful Fireweed and new, small trees are in-filling well.  The circle continues.There *used* to be an ACC hut at the top in the valley, but they've had a string of bad luck in keeping them fireproof.  There are still some backcountry campgrounds, lakes and other attractions up the valley.We did a winter b/c ski up the valley for 4 km or so then came back and looked around the valley and checked out the other trail leaving from the same parking lot.  We also watched some ice climbers in the canyon, there is serious opportunities for that there as well.An interesting side note is we had front row seats for an avalanche control that was taking place only 1km N of the parking lot.  The wardens closed the highway and we could see the helicopter dropping charges and triggering slides.  Mostly we only saw billowing snow though, but the sound will be remembered.Just barely in BC, this trail is about 15 km S. of Hiway 1 down Hiway 93 towards Radium.  Just passed the Stanley Glacier Parking lot.NOTE: This is prime bear, cougar, wolf and sasquatch country, TRAVEL PREPARED",
    "directions": "West of Calgary, past Banff, go 17km South on Hiway 93 towards Radium Hot Springs just passed the Stanley Glacier parking lot.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/10934/reg_IMG-20170115-142125-58271.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10934/reg_P1020258-Custom--6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10934/reg_P1020259-Custom--6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10934/reg_P1020260-Custom--6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10934/narrow_12647000-10153219333561338-4619017225472886805-n-53148.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10934/narrow_Familiy-Hike-at-Marble-Canyon-Paint-Pots-Kootenay-Aug-22-2014-10--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10934/narrow_Familiy-Hike-at-Marble-Canyon-Paint-Pots-Kootenay-Aug-22-2014-2--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10934/narrow_Familiy-Hike-at-Marble-Canyon-Paint-Pots-Kootenay-Aug-22-2014-4--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10934/narrow_P1020261-Custom--6828_best1_.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/marble-canyon-near-radium-hot-springs-bc-10934",
    "stats": {
        "Activities": "snowshoe hike",
        "From": "",
        "Seasons": "winter fall summer",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "5 km",
        "Town": "Radium Hot Springs, BC",
        "Type": "out-and-back"
    },
    "title": "Marble Canyon",
    "trail_id": "10934"
}