{
    "description": "Cerise Creek is a relatively short hike through pristine forest in the Joffre Group a short way along the Duffy Lake Road. Elevation gain is only 305m, as the trail head is just past the highest point of the Duffy Lake Road. The trail takes you to the beautiful Keith Flavelle Hut, a memorial cabin near the headwaters of Cerise Creek. \"Keith's Hut\", also known as the Cerise Cabin, adds a welcoming rest spot, especially in colder weather.Views of Joffre Peak, Mount Matier and Vantage Peak can all be seen above the cabin. The Anniversary Glacier can be seen falling down towards the cabin between Joffre Peak and Mount Matier.  From the pass between Mount Matier and Vantage Peak there are awesome views of Mount Hartzell, Mount Howard, Twin One Glacier and, in the distance to the south, Snowspider Mountain.  This area offers miles of exploring, whatever the season.Be warned, a late season thaw can still see a lot of snow up here, even as late as July.  The area is a mecca for mountaineers and back-country skiers.  There are many technical rock and mounaineering routes on Mounts Joffre, Matier, Slalok and Spetch.  The winter skiing options are numerous, from the mellow meadows below Vantage Col, to steep chutes off Joffre and Matier.  The area is highly popular in all seasons, and you are unlikely to be there alone.  In mid winter it's not uncommon to have more than 20 people sleeping in the cabin, more on the front veranda, and still more camped nearby in tents.  If in doubt, bring a tent as there are no guarantees of sleeping space, let alone a good nights sleep.There are three different routes into Keith's hut, a summer route, a winter route, and a route that starts on the winter route, then switches to the summer route.In summer, the winter route has many creek crossings and much marshy ground.  In winter, the summer route is a little steep and too long.  In the fall and the spring it's sometimes easier to start on the winter route then take the bypass trail to the summer route. This avoids crossing the top of Cerise Creek, and may be preferable if the start of the trail is clear, but the high section is still under snow.Winter Route Description:From the pull-out, drop down south off the embankment.  Head down SE for a couple of hundred metres until you come to a large log with a rope rail and 2 by 4's nailed across it to make a wide stable bridge.  Climb up from the creek, then head SE through the trees.  At the big log cut, keep to the right (east) of the clearing.  Turn right onto the road (Cerise Creek Main) at the top of the log cut, heading down a gentle hill for a couple of hundred metres until you see the sign posted winter trail heading left into the trees.  If you get to a creek crossing, where a bridge used to be, you've gone too far.  Head into the trees at the sign post.  The trail stays east of Cerise Creek, passing through three small meadows.  In one of these meadows (I think it's the 2nd one) there's a posted trail on your right that will cut you across the creek and climb up to the summer route.  This may be a good choice in late spring or early fall.  After the meadows, the winter trail angles slowly down until it runs along side of the creek.  Cross to the west side when snow bridges make it possible.  In the fall and late spring the creek can force you to have to take alternate routes higher up the hill side through tight trees on either side.  Eventually the valley opens up near the moraine wall at the foot of the Anniversary Glacier.  Follow the moraine wall around to the right (west) until an obvious opening in the trees on your right.  This will take you up to a bench with a small lake on it.  Keith's Cabin is just above and NE of the lake.Summer Route Description:Once you've found the trail head, this route is fairly straight forward, and well marked.  The trail contours along the side of the steep eastern slopes of Mount Chief Pascall.  Before crossing the obvious boulder field, the trail climb steeply past many blueberry and huckleberry bushes.  Once across the boulder field, you climb to a small bench before dropping down behind the cabin.NOTE: the lake near cerise creek is not potable.  This water will need to be filtered and/or treated before you can drink it.Keith Flavelle Hut: The cabin is a memorial cabin run by donations (envelopes are available in the cabin) and through a family trust set up in memory of (you guessed it) Keith Flavelle, who died in a mountaineering accident.  The cabin's got an outhouse, a wood shed (wood is helicoptered in each summer) a pot belly stove with a large stainless steel pot for melting water, a large kitchen table, and a mezzanine for sleeping in.  It sleeps 20 (officially) but gets very busy, so if you're coming in late, plan to sleep outside.NTS Map: 92J8  (National Topographic System - Canada)",
    "directions": "There is a summer route and a winter route.  Both routes now start at the Duffy Lake Road.Trail Head AccessFrom Lake Lillooet, drive up the Duffy Lake Rd.  Pass the Joffre Lake trail head (provincial park), cross the bridge across Cayoosh Creek, and pass the road work sheds on your right.  Shortly after you pass the road works (\"Salt Shed\") lot you will see a \"no stopping avalanche zone\" sign.  This marks the beginning of the run-out zone for the south-facing Rohr avalanche slide paths that rise up on your left.  The Cerise Creek TH is the pull-out past the end of this no-stopping zone on the right hand side, where you'll see a valley open up on your right.  This is the Cerise Creek watershed.  Just before the pull off, there's a difficult-to-see sign for the Cerise Creek Trail head (this sign may be gone as of 2013).  Park here.  Note that the TH is in between two different avalanche run-out zones from Rohr.  If you enter a second no-stopping zone, you have gone too far.  Note this TH is very busy in the winter so have a \"Plan B\" objective for if there is no room to park as is often the case.  The road is on a curve here so you shouldn't obstruct the traffic lanes.  Joffre, the Cayoosh basin, Marriott Basin (inc Wendy Thompson Hut) are all in the near vicinity (you just drove past them)Summer Route AccessThe Cerise Creek FSR was deactivated years ago now (2007 or 2008) and is not passable by vehicles.  Culverts were dug up and bridges removed, alder has grown up everywhere  Instead the new route uses the existing winter trail head (pull out on the Duffey Lake Road, just after the 1st Rohr avalanche path no-stopping zone).  Start along the trail and cross the first bridge which crosses Cayoosh Creek, after which you will see a fork off to the right.  Take the trail to the right.  If you find yourself crossing a 2nd bridge (which some might also call a \"log\", with rope handrails) you've gone the wrong way!  The trail is flagged, joins the old logging roads for a bit and then starts into the old summer trail as described above.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/1093/long_cerise4.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1093/regAUT-4421-Mt-Joffre-6103.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1093/reg_108-0812-6103_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1093/reg_AUT-4420-6103.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1093/reg_AUT-4540-Mt-Matier-and-Anniversary-Glacier-6103.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1093/reg_AUT-8206-6103.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1093/reg_best2_Tet0364-6103.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1093/topo_cerise_creek_map.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1093/narrow_AUT-4501-North-Ridge-of-Mt-Joffre-6103.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1093/narrow_AUT-4504-6103.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1093/narrow_AUT-4514-6103.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1093/narrow_AUT-6205-6103.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1093/narrow_cerise2.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/cerise-creek-near-pemberton-bc-1093",
    "stats": {
        "Activities": "climb snowshoe hike ski-bc",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "7 hrs",
        "Total Distance": "8 km",
        "Town": "Pemberton, BC",
        "Type": "out-and-back"
    },
    "title": "Cerise Creek",
    "trail_id": "1093"
}