{
    "description": "Here is a short hike close to the airport to two waterfalls...one of which I would care to guess is probably the tallest in HRM.I was looking at some old geological maps of the area around the airport when I saw some small words that made my heart skip a beat or two;  waterfall 10 and waterfall 50.....I had never heard of those falls and a quick look in panoramio or google earth didn't reveal the mystery either.   I set off from the road and immediately heard the first fall which is really more of  road side attraction.  the brook here falls about 10 ft and it  looks like there is some remnants of a dam.I skipped across the stream and into the woods.  the second fall is on a tributary of the brook located on its south side.  My gps showed some kind of a track on either side of the brook but since the tributary and the fall was on the south side, I decided to hike on that side.  The first part is through some mixed forest with a few deadfall.  I made my way towards the track but that was a mistake on top of the bluff, the forest was logged a few years ago and its the land of the small sticks and whipping branches t your face.  Next time stay in the mature forest by staying on the side of the ravine will make a better hike.After 15minutes or so I heard the roar of the waterfall and I was truly impressed by its sight.  The water cascades down at least 60ft over the rocks so its not s straight plunge but its impressive nonetheless.  the forest around the fall is a mature deciduous type and very open.  There is some kind of a tree stand next to the fall and you can see another stand down by the main brook a distance away....so this is a hike I definitely would not do in the deer hunting season . I crossed the main brook downstream of the fall and made my way to another large tree stand.  Right behind he tree stand is a major logging road.  If you turn right on it it ill lead you back to the main highway.  This track passes through some old alder stands and some old cars rusting away in the woods.",
    "directions": "Irving big stop exit at Enfield.  Turn on Oldham Rd.  The first fall is located at  44°54'45.75\"N, 63°30'33.91\"W",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/10938/reg_DSC-0015-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10938/reg_DSC-0009-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10938/reg_image.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/sandy-cole-brook-falls-near-halifax-ns-10938",
    "stats": {
        "Activities": "snowshoe hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "3 km",
        "Town": "Halifax, NS",
        "Type": "out-and-back"
    },
    "title": "Sandy Cole Brook Falls",
    "trail_id": "10938"
}