{
    "description": "An outstanding place to explore, high cliffs has it all, breathtaking viewpoints, high cliffs, caves, sea caves, bouldering opportunities and of course some waterfalls.At the end of the road, you can set off in either directions around Gullivers Cove.  If you go east, you will see about 500m away one waterfall that is descending a cliff face  into the ocean.  You can access the bottom of the fall at low tides only while the upper part can be accessed with an ATV trail.  The ATV trail passes through some deep alder patch before entering a coastal evergreen forest.  Everywhere there are large boulders to look at.  There are at least two more waterfalls to see if you keep following the shore on the eastern side of the cove.If you set off to the western side of the cove, you will see the high cliffs in the distance.  Before reaching them, you walk through some pasture land with some clumps of evergreens.  There is a couple of benches and table set up right before the cliffs which offer a nice viewpoint.  From the benches, descend the steep slope using the faint trail to the beach.  Low tide is paramount to access the toe of the cliffs where you will find one talus cave and one sea cave.  Both are about 4m deep at best.  There is another small cave just before you arrive at the benches.  It is located to the left of the trail.  There is a trail leading to it but you have to look for it?or follow my gps track.  Once you've seen the last sea cave, you can boulder up a 30ft section of rock to the plateau that is just above your head.  The rocks are pretty solid but you still have to be very careful.  Once on top of the bluff you can look down the coastline to the west.  I then went up the meadow that sits on top of the high cliffs.  This part is spectacular as there are only a few trees to block off your view.  Again be careful as you are very high and you cannot afford to make mistakes as you walk the top of the cliffs. I saw and took a small trail down a steep part of the cliffs that was well grassed and had a few trees to hold onto.  This led me back to the cave above the benches mentioned before.",
    "directions": "Take the highway towards Digby Neck and turn right at Gullivers Cove Rd.  There might even be a sign for high cliffs viewpoint",
    "geohash": "dxcj",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/10946/reg_DSC-0029-27177_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10946/reg_DSC-0020-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10946/reg_DSC-0021-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10946/reg_DSC-0024-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10946/reg_DSC-0031-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10946/reg_DSC-0033-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10946/reg_DSC-0034-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10946/reg_DSC-0040-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/high-cliffs-near-digby-ns-10946",
    "stats": {
        "Activities": "hike hike",
        "From": "",
        "Stars": 5,
        "Time": "2 hrs",
        "Total Distance": "5 km",
        "Town": "Digby, NS",
        "Type": "out-and-back"
    },
    "title": "High Cliffs",
    "trail_id": "10946"
}