{
    "description": "I've rated this trip 'difficult' as it seems like the right rating compared with the rest of the trips on Trailpeak.  That being said, it is a good trail with easy access and the only thing particularly difficult about it is that it gains 6000ft in 9km. \r\n\r\nThe trailhead is in Manning Park but most of the trail isn't. You start off on the Manning Park Engineers Trail but quickly hang a left onto the BCFS Mt. Outram trail.\r\n\r\nThe trail is well graded all the way up to the meadows. There was quite a lot of deadfall across the trail when I did it but I expect that it will be cleaned up in time for summer hiking. \r\n\r\nThe trail switches back through the forest, crossing a creek at around 4900ft and switching back a little further before coming out into beautiful alpine meadows. A few more switch backs brings you to a rocky bluff and then a small lake at the base of the ridge. This is a good place to camp if you're spending the night.\r\n\r\nThe final 1000 feet to the summit are fairly steep and involve climbing up what is mostly a scree slope. Don't give up though as the view from the top is spectacular. There is little exposure other than the steepness of the slope. \r\n\r\nSilvertip is the most predominant mountain. Redoubt is a little behind it. The one with the big glacier to the left of Silvertip is Custer. To the left of Custer is Spickard. Rahm, with its narrow glacier is in font of Spickard. Mount Baker & its neighbours are also visible. You can see the Chilliwack range to the west too.\r\n\r\nDoable as a day trip but make sure you leave early to leave time to enjoy the meadows and the views.\r\n\r\nMore pics here: http://www.mountaingirl.net/outram04/\r\n\r",
    "directions": "Drive East on Hwy 1. Take the Hwy 3 exit towards Manning Park. Park at the Manning Park sign.\r",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/1094/reg_023-11335.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1094/reg_042-11335.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1094/reg_IMGP4606jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1094/reg_IMGP4609jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1094/reg_IMGP4623jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1094/reg_Mt-Outram-10559.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1094/narrow_IMG-9859-10559.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1094/narrow_IMGP4613jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1094/narrow_IMGP4614jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1094/narrow_IMGP4646jpg.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mount-outram-near-hope-airport-bc-1094",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 4,
        "Time": "9 hrs",
        "Total Distance": "18 km",
        "Town": "Hope Airport, BC",
        "Type": "out-and-back"
    },
    "title": "Mount Outram",
    "trail_id": "1094"
}