{
    "description": "An 8 foot wide trail for the most part that begins at the Bell Rock parking lot and Trailhead and takes the hiker or rider to the Bell Rock Climb trail.  The pathway you are on however continues for several kilometers along (but mostly out of sight) of highway 179 towards Sedona, ending at the Little Horse Trailhead area.  You have options now, as you will see the Llama trail which is a crescent trail (a fantastic trail for intermediate to advanced mountain bikers) off Bell Rock Pathway.  I took a part (smaller loop) of Llama on this day, opting to let my girlfriend return to the parking lot (and our Bike Rental location -- Bike & Bean, just down from the parking lot on 179).  This seems to be a common occurrence on the Bell Rock Pathway, couples with one rider more advanced than the other, and Bell Rock Pathway is the answer, allowing the rider looking for an easy ride to enjoy themselves while the other takes Llama back.  What a great trail, and great views along the way.  On the other side of Highway 179, Slim Shady offers another parallel route of intermediate to advanced riding levels.  This whole area provides many options for riding and hiking.   Bell Rock Pathway has some elevation drops and gains, but they are gradual and anyone can do them.  Riders should be cognizant that hikers are on the pathway also, and, that it's a shared trail.For bike rentals: We rented in Scottsdale (near Phoenix) at AOA-adventures for great weekly rates on GIANT and Specialized, allowing you to ride nearby McDowell Preserve or South Mountain before heading to Sedona.",
    "directions": "Off HWY 179 as you enter Oak Creek Village from Sedona, as you pass Bell Rock on your left, look for the parking area (large) on the left for access to the pathway.  If getting to the trail from the Bike & Bean (a wonderful bike shop with hard tail and full suspension bikes like Santa Cruz) bike shop then it's just up HWY 179 for a few hundred feet, the parking area and trail-head immediately on the right.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/AZ/10958/reg_DCIM202[N3480346W11176637T3E984192H053D4C]-5.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/bell-rock-pathway-llama-near-sedona-az-10958",
    "stats": {
        "Activities": "hike mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "10 km",
        "Town": "Sedona, AZ",
        "Type": "out-and-back"
    },
    "title": "Bell Rock Pathway - Llama",
    "trail_id": "10958"
}