{
    "description": "The Narrows should be on everyone?s bucket list.  The trail is mostly in and out of the Virgin river inside Zion Canyon so proper gear is required. Starting off at the temple of Sinawava, you follow the highway?paved trail for about one mile.  The trail is set to the side of the Virgin River and follows the base of the cliffs.  Tall cottonwoods provide much needed shade from time to time.  Lots of boulders in the river provide some secluded spots for swimming as well.  At the start of the trail there is a last chance for a bathroom and to fill up your water bottle at the provided taps.At the end of the paved trail we changed into our dry suits (mid April) and entered the river.  In only a few hundred feet the river narrows to about 50ft across and the cliffs tower over you approximately 1700ft.  Truly spectacular!!!  The whole walk in the Zion Canyon for the next 1.5 miles or so to the confluence of Ordenville Canyon is set into small rapids, waist deep pools and interspersed with sand bars and boulders.  Trees set on the high cliffs above you are the only things that give you some perspective on the scale of this place.  Ordenville Canyon is a smaller canyon which you can follow for a while upstream.  We choose to follow the Virgin River into a place called the Narrows which are just upstream of the confluence with Ordenville Canyon.  The next mile is probably the most jaw dropping scenery of the park.  The canyon here is very very narrow and the walls that tower over you gave this place another well deserved name; Wall St!  There are numerous small waterfalls throughout the canyon and one of them is hidden behind a curtain of rock?so you can only hear the burbling sound it makes.",
    "directions": "Take the shuttle inside ZNP to the last stop.  Walk on the paved trail to its end.  Enter the river and walk upstream for a few hours?.",
    "geohash": "9qxs",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/UT/10957/reg_DSC-0002-2--27177.jpg",
        "https://trailpeak.com/storage//content/trails/US/UT/10957/reg_DSC-0004-2--27177.jpg",
        "https://trailpeak.com/storage//content/trails/US/UT/10957/reg_DSC-0009-2--27177.jpg",
        "https://trailpeak.com/storage//content/trails/US/UT/10957/reg_DSC-0023-2--27177.jpg",
        "https://trailpeak.com/storage//content/trails/US/UT/10957/reg_DSC-0036-2--27177.jpg",
        "https://trailpeak.com/storage//content/trails/US/UT/10957/reg_DSC-0041-2--27177.jpg",
        "https://trailpeak.com/storage//content/trails/US/UT/10957/reg_DSC-0048-2--27177.jpg",
        "https://trailpeak.com/storage//content/trails/US/UT/10957/reg_DSC-0069-2--27177.jpg",
        "https://trailpeak.com/storage//content/trails/US/UT/10957/reg_DSC-0078-2--27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/the-narrows-near-springdale-ut-10957",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 5,
        "Time": "6 hrs",
        "Total Distance": "12 km",
        "Town": "Springdale, UT",
        "Type": "out-and-back"
    },
    "title": "The Narrows",
    "trail_id": "10957"
}