{
    "description": "From the Bike and Bean bike shop in between Oak Creek Village and Sedona (closer to Oak Creek), ride out of the shop across parking lots and through a gate at the Red Agave chalets / resort.  There is a partnership between the resort (ideal spot for bikers) and the trail starts in front of the resort (to the right). See note below for best rental options.Ask anyone as you approach.  Now you are on Slim Shady an intermediate bike trail which has some technical aspects combined of steeps, wash crossings, some rock gardens, and, some slick rock.  The trail initially climbs, as you get closer to the red rock slopes and hills before levelling off. It's a great trail, I really enjoyed it, and it also has an entrance to Highline trail which I took briefly (you'll see the fork on the GPS map) just to show it's entrance.  As you continue on Slim Shady, a wonderful trail, it dips, climbs and winds on single-track and slick rock. You will eventually meet the Templeton trail.  For the intermediate rider, this will give you some great views and riding nirvana and perhaps  some of the feeling that riders get on Highline as it sweeps around Cathedral Rock on a slick rock bench.   But when you first get on Templeton, you are on flowy singletrack, which has fewer of the technical challenges you found on Slim Shady.  Super fun.  Templeton winds around Cathedral and then you continue to ride down to the Oak Creek floor and over to loop Baldwin (a popular choice) or you can ride down the Cathedral Rock access trail to the parking lot (watch for hikers and get off your bike if it's busy).  Immediately but before the parking lot, follow a trail to the right which follows a dry creek bed and weaves back and forth I believe this trail is called easy breezy.   I came across a USFS trail crew happily laying in some stone for riders and hikers out of a wash area.  What a wonderful area Sedona is, lots of hiking and biking trails, it's set to become a trail mega-hub and no wonder why.  Now I eventually met up with HT trail, which takes you under HWY 179 and connects with the Bell Rock Pathway.  I followed this down (towards Oak Creek) a small distance towards (you'll see a sign for it) the Little Horse Trail, and you take that trail to find the start of Llama.  Little Horse is a bit technical, generally rising on terrain that takes you closer to the rocks / mountain.  In about a kilometer, you will see the start of Llama.Take Llama to complete a trail not unlike Slim Shady on the other side of 179.  There are again some up and down climbs, all short in distance.  Great views back on the valley and back to the Sedona area and of course, Bell Rock and the Courthouse, which you now approach.  Llama continues for quite a while (30 / 40 minutes), and it is somewhat technical so it's not for beginners unless they plan to walk at times. But what a great trail, it gets up close to the mountains for views, and then comes to a Bell Rock Pathway Cut off for those who wish to exit early.  I only had to get off my bike once for a climb out of wash on a rock armoured segment. I continued, eventually reaching the Bell Rock area and now rejoining the pathway to get to the trailhead.  From here roll down HWY 179 a short distance to return your bike to Bike & Bean on the other side of the road.All in all -- I spent no more than 2.5 hours on this mini-epic loop, it will give the rider a great overview of the intermediate trails and options in between Sedona and Oak Creek.  The advanced rider may consider Highline, or the trails off Schnebly like Hangover, however be warned, there is extensive exposure on these higher elevation rides on steeplyslanted red rock aprons. If a rider makes just one mistake and falls in the wrong direction can lead to serious injury or even death.  No such worries on the Slim Shady, Templeton, East Brezy, HT, Little Horse, and Llama, a few challenges yes but lots of riding joy.For bike rentals: We rented in Scottsdale (near Phoenix) at AOA-adventures for great weekly rates on GIANT and Specialized, allowing you to ride nearby McDowell Preserve or South Mountain before heading to Sedona.",
    "directions": "From the Bike & Bean bike shop in Oak Creek Village, ride across parking lots to the Red Agave Chalets / Resort, where a trail entrance exists (gate).  It's marked, and, once you begin, you may find the Sedona Core Trails MAP (available at Bike & Bean) handy, use the attached GPS, or just go for it using the description above and look for the trail signs, they are all marked.  You will likely encounter other riders here and there, and certainly the bike shop is a great place to get extra information.",
    "geohash": "9w0",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/AZ/10959/reg_DCIM249[N3481686W11177301T3E9AFD92H04F715]-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/10959/reg_DCIM251[N3481703W11176178T3E9B07CBH053919]-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/10959/reg_DCIM252[N3481690W11176151T3E9B07F4H0538B3]-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/10959/reg_DCIM253[N3481642W11176122T3E9B082CH0539E6]-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/10959/reg_DCIM255[N3480556W11176088T3E9B0E0BH053712]-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/10959/reg_DCIM256[N3480556W11176088T3E9B0E13H053824]-5_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/10959/reg_DCIM257[N3480562W11176128T3E9B0E38H0539CC]-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/10959/reg_DCIM258[N3480562W11176128T3E9B0E44H053AB6]-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/10959/reg_DCIM259[N3480517W11176178T3E9B0E68H053354]-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/10959/reg_DCIM260[N3480517W11176179T3E9B0E74H05358C]-5.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/slim-shady-templeton-llama-near-sedona-az-10959",
    "stats": {
        "Activities": "hike mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "22 km",
        "Town": "Sedona, AZ",
        "Type": "out-and-back"
    },
    "title": "Slim Shady - Templeton - Llama",
    "trail_id": "10959"
}