{
    "description": "Hangover is an extreme mountain bike trail that doubles as an excellent hike for a few reasons.  First, it's great singletrack that follows grades that aren't all that difficult (but then again, some very steep slick-rock terrain that will make you wonder what kind of rider can do it).  The steep slick rock aprons are scary enough for hikers, but for mountain bikers even more so -- as one error can lead to serious injury or death.Now for the upside, you will have unbeatable views (except of course if you hike Bear Mountain) with mountainous rocks and buttes above you.  This trail is up close and personal on a non-vortex (meaning less crowds) and the trail is obviously constructed very well and follows what must be the only passable ribbon of slick-rock and trail around the pillars and butte above you.  It's incredible really, the trail just keeps delivering great views and for those not accustomed to heights, possibly some vertigo.  It's a challenge for riders, I debated coming back to ride it, but as it would be my second ride of the season, I made a decision towards personal safety instead.  Sure, I could likely ride the ribbon of rock that affords you the trail, but a slip in the wrong direction on the dozens of exposed sections could send you hurtling down hundreds of feet -- in many cases I couldn't identify anything that would stop you.We did come across about a dozen riders on this busy Friday in peak season, most walking the difficult sections, but certainly enjoying the rideable sections.  Views, views, and more views -- mostly for when you are stopped and on safe gound.  As you wind around the pillars and rock above you, you eventually hike over a slick-rock saddle, then begin your descent, making your way over to more slick-rock and the cow pies trail.  This in turn connects with the Munds Wagon Trail, or the Jeep road, for your ride back to town (down).  What fun.For bike rentals: We rented in Scottsdale (near Phoenix) at AOA-adventures for great weekly rates on GIANT and Specialized, allowing you to ride nearby McDowell Preserve or South Mountain before heading to Sedona.",
    "directions": "Park off Schnebly road (out of downtown Sedona, off the roundabout east of the Y intersection) and drive up Schnebly to the USFS parks parking lot (day pass required).  Ride Munds wagon trail from here, until you see the sign for Hangover, or, follow the attached GPS (GPX).  Some may prefer to ride / up down the actual Jeep road, or, even drive it with a four wheel vehicle to a parking area about 4km up the Jeep road.  The Sedona Core Trails Shaded Relief Trail Map is a nice addition showing all of the local trails, you can get this at the Bike & Bean (great shop) bike shop in town, and otherwise, download the accompanying GPS information from this page.",
    "geohash": "9w0w3",
    "photos": [],
    "source_url": "https://trailpeak.com/trails/hangover-near-sedona-az-10961",
    "stats": {
        "Activities": "hike mtn-bike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 5,
        "Time": "2 hrs",
        "Total Distance": "10 km",
        "Town": "Sedona, AZ",
        "Type": "out-and-back"
    },
    "title": "Hangover",
    "trail_id": "10961"
}