{
    "description": "Both a hiking / biking trail around Sedona red rock peaks and bluffs, it provides great views of Cathedral Rock, likely Sedona's most famous Vortex and red rock formation. We started by parking at the Cathedral parking lot and climbing part of the scramble trail up to the peak saddle (it's also a popular climber's area, you'll see them descending sections you have difficulty with as if they are on a footstool).  Note, while the hike up the Cathedral Rock is short, it's very steep for the casual hiker and there is a rock crevice which one must scramble up in order to continue. This will be a challenge for many.  However, once up on the plateau just above, it gets easier and one can hike to the saddle.After doing some of the Cathedral apron, we proceeded west on Templeton trail (which also goes in the other direction).  Templeton winds partly around Cathedral (no trail actually circles it closely, so don't get fooled by the Vortex!) Great views as you walk away from the base of Cathedral as it winds part way around red rock formation, and upon reaching the creek floor, a sandy trail that follows the creek in shade allows the hiker to pass by a number of swimming  holes and sand bars.  The more lush vegetation and shade contrast to the cactus laden trail above.Before long, the trail comes to a fork, on the Baldwin trail.  One can begin the loop here, as it winds (undulates) gradually up (again a  great mountain bike trail as well and you may see the odd rider).  As Baldwin climbs you will encounter the terminus of Highline trail, a  double-black diamond trail for mountain bikers.  Passing this turn-off, one circles on Baldwin until the parking lot / trailhead is seen.  Washrooms are here.  Continue on the trail, now 3/4 done your Baldwin loop (or perhaps you have started here) and re-connect with the  trail along Oak Creek and reverse your steps on Templeton, and back to the parking lot under Cathedral.For bike rentals: We rented first  in Scottsdale at AOA-adventures> for great weekly rates on GIANT and Specialized, allowing you to ride nearby McDowell Preserve or South Mountain before heading to Sedona.",
    "directions": "Cathedral Rock Parking Lot.",
    "geohash": "9w0",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/AZ/10963/reg_cath2-5.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/baldwin-templeton-near-sedona-az-10963",
    "stats": {
        "Activities": "hike mtn-bike",
        "From": "",
        "Seasons": "spring winter fall",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "10 km",
        "Town": "Sedona, AZ",
        "Type": "out-and-back"
    },
    "title": "Baldwin - Templeton",
    "trail_id": "10963"
}