{
    "description": "Moderate to somewhat difficult at times, this is my favourite by far Sedona hike that delivers views, changing terrain, and hiking wonder.  On a clear day we set out opposite the Doe Mountain Parking lot. You traverse a small meadow and then the vertical begins.  This warms you up and before you know it, you have a view, and, some great pics already.  A bit further, you reach a rock wall and overhang with picture moment, and a plateau.  More views, and buttes above you and mountain wall.  More pics.  You wander around the butte on non-technical terrain and now the climb begins.  You wonder how you are going to go up the wall in the distance and where the trail leads, and it does in fact go to the first real rim via some steep switchbacks.  Incredible, and your heart will pick up it's pace.  Some almost scrambling (just steep) and now you gain the expansive plateau with different vegetation and rock striata formations, a visual feast.  More great views.  The trail climbs now more gradually, but always up.The views are now uncomparable, and, you feel you've already had a great hike, and for some, turning around wouldn't be out of the question the trail has delivered, but you keep going, for another hour or two as the trail climbs to some promentories, then dips, and finally climbs some challenging terrain again to the peak which delivers uncomparable 360 views.  This trail is a must do for the hiking enthusiast.  The pictures give you an idea.  We (ourselves) didn't do the final push to the top, some of the terrain / drop-offs created a bit of vertigo for one of our members, and while no major exposure occurs, it can be a challenge for those with heights issues towards the top.  Altogether, a great hike, one of Sedona's best and most rewarding in terms of views, hiking terrain and changing elevation grades to give you a break so that it's not all vertical.For guided hiking options check out Arizona Outback Adventures.",
    "directions": "Opposite the Doe Mountain Trailhead (also a great hike -- shorter -- less elevation).",
    "geohash": "9w0qw",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/AZ/10966/reg_DCIM136[N3489641W11186760T3E970BC4H0581CC]-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/10966/reg_DCIM137[N3489641W11186760T3E970BCEH058158]-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/10966/reg_DCIM146[N3489727W11186807T3E970CE9H05A503]-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/10966/reg_DCIM147[N3489727W11186806T3E970D0AH05A3CC]-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/10966/reg_DCIM164[N3489882W11186894T3E970FEFH05EE64]-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/10966/reg_DCIM182[N3490075W11187138T3E97124DH061A66]-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/10966/reg_DCIM193[N3490714W11187615T3E971B9CH06BACC]-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/10966/reg_DCIM196[N3490753W11187619T3E971BDEH06B5CC]-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/10966/reg_DCIM199[N3490788W11187601T3E971C5AH06B836]-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/10966/narrow_DCIM194[N3490730W11187619T3E971BBAH06B84C]-5.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/bear-mountain-sedona-near-sedona-az-10966",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 5,
        "Time": "4 hrs",
        "Total Distance": "15 km",
        "Town": "Sedona, AZ",
        "Type": "out-and-back"
    },
    "title": "Bear Mountain - Sedona",
    "trail_id": "10966"
}