{
    "description": "I marked this as 10km although it can be all day and much further, likely because 5km (3 miles) in either direction out of the parking lot (it can be a very long loop if you connect with Hot Loop trail) is likely either too boring or too long for most.  The actual trail is marked as 22 miles.  But as a shortened pleasant hike with few people around, you can walk through a meadow in one direction out of the trailhead with views over to the red rocks, the Rabbit Ears (Rabbit Ears no longer accessable from the same parking lot), the Courthouse and so on. On the other side, the high mesa's above you.  The wildflowers and meadow alone are worth it and I did a small loop into the meadow to snag a few pictures before returning to the trail.I only had time to hike a portion of Jacks, and I wish I had more time to explore the back-country in the opposite direction as it climbs the Mesa on \"Hot Loop\" trail. Jacks Canyon begins easily enough, it's in a pretty meadow  that has been used for cattle grazing in the past.  Unfortunately, it follows too closely to the road and housing to get a higher rating; but each trail in Sedona is different, and, I enjoyed the wild-flowers and meadow here.  You shortly reach a sign warning of the dangers of continuing on Jack's Canyon trail as it eventually gives way to isolation and wilderness. I wish I had time for that, but I could only wonder after reading the warnings about lost hikers every year requiring the efforts of search and rescue.  A picture of that sign is on the right.  In the hiking guide books, Jack's Canyon trail is described as continuing all the way up the Canyon to higher elevation and with many un-marked trail spurs, it could be a 9-10 hour hike (or longer if you get lost).  A loop is possible, however, this makes for more of an all day outing.  Leaving the parking lot off Jacks' Canyon road (it has equestrian facilities), I wish I gone in the other direction for an hour or two, I would have been climbing the mesa for a view as well as hiking away from the road.  If you have only a short-time consider an out and back hike towards the mesa on the trail, and, if you have a bit more time, do the \"Hot Loop\".  If you are in the area, and it's a weekend, this could be the answer for a quick trail fix while ditching the crowds but it's no 5-star hike.For guided hiking options in Arizona check out Arizona Outback Adventures.",
    "directions": "Parking area (dirt) on the right as you see what can only be described as a Mediterranean villa on the left, after following Jacks' Canyon Rd. (see map right).",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/AZ/10962/reg_DCIM267[N3478496W11173206T3E9DCCC8H051D80]-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/10962/reg_DCIM268[N3478563W11173136T3E9DCD21H051BE6]-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/10962/reg_DCIM269[N3478586W11173126T3E9DCD40H051933]-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/10962/reg_DCIM270[N3478591W11173127T3E9DCD4AH051B19]-5_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/10962/reg_DCIM271[N3478645W11173074T3E9DCD91H051E00]-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/10962/reg_DCIM272[N3478674W11173013T3E9DCDE0H051E0A]-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/10962/reg_DCIM273[N3478681W11172946T3E9DCE15H051F4C]-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/10962/reg_DCIM275[N3478693W11172866T3E9DCE67H052790]-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/10962/reg_DCIM277[N3478767W11172682T3E9DCF1EH052CEA]-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/10962/reg_DCIM283[N3478860W11172133T3E9DD1EAH053BE6]-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/10962/reg_DCIM284[N3478913W11172209T3E9DD2C4H053807]-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/10962/reg_DCIM285[N3478914W11172227T3E9DD2D6H0537CC]-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/10962/reg_DCIM286[N3478927W11172270T3E9DD2F9H0537B3]-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/10962/reg_DCIM289[N3481128W11180976T3E9DDF0AH04B700]-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/10962/narrow_DCIM278[N3478766W11172682T3E9DCF2DH052F40]-5.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/jacks-canyon-trail-near-sedona-az-10962",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 2,
        "Time": "2 hrs",
        "Total Distance": "10 km",
        "Town": "Sedona, AZ",
        "Type": "out-and-back"
    },
    "title": "Jack's Canyon Trail",
    "trail_id": "10962"
}