{
    "description": "This is a description of a nice canyoneering trip in the Yankee Doodle Canyon located in the Dixie National Forest. It's a beginner type canyoneering experience set in a breathtaking slot canyon.The entrance to the slot canyon is only about 200 ft of the dirt road.  There is an established trail to the top of the canyon from the road which is set into some evergreen trees and small bushes.  There are no signs pointing to the head of the canyon.The entrance is a narrow elongated hole which has a tall evergreen set to its right hand side which acts as the anchor for the short 30ft rappel.  After this first rappel, a short walk of 20 seconds brings you to the second rappel.  this one is the longest and the last of this section of the canyon.  I would estimated the rappel to be probably 60 ft.  It is set in beautiful curved and red colored sandstone.  At the base of the rappel there were a few trees in full bloom in mid-april.The rest of the canyon offers at least 5 technical down climbs and a couple of narrow pools which you will have to scuttlebutt over.  One of which is a good 30ft long.  There is also a nice natural slide which you can easily run down instead of ruining the seat of your pants.The yankee doodle canyon stops at its confluence with the larger Heath Canyon.  We came back topside and back to the road in an area just before the two canyons joined together.  My gps track shows the start of the canyon and the part where we came back up as signal was non existent in this narrow canyon.  We did this trip with an awesome outfitter; Jeremy from Red Desert Adventure!",
    "directions": "Highway 15 to Leeds.  Take the silver Reef Rd to the North and enter the Dixie National Forest.  Start of the canyon is approximately at  37°14'11.09\"N, 113°27'10.36\"W",
    "geohash": "9qx7f6",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/UT/10965/reg_DSC-0053-27177.jpg",
        "https://trailpeak.com/storage//content/trails/US/UT/10965/reg_DSC-0121-27177.jpg",
        "https://trailpeak.com/storage//content/trails/US/UT/10965/reg_DSC-0156-27177.jpg",
        "https://trailpeak.com/storage//content/trails/US/UT/10965/narrow_DSC-0063-2-27177.jpg",
        "https://trailpeak.com/storage//content/trails/US/UT/10965/narrow_DSC-0092-2-27177.jpg",
        "https://trailpeak.com/storage//content/trails/US/UT/10965/narrow_DSC-0114-2-27177.jpg",
        "https://trailpeak.com/storage//content/trails/US/UT/10965/narrow_DSC-0147-2-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/yankee-doodle-canyon-near-la-verkin-ut-10965",
    "stats": {
        "Activities": "climb",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 5,
        "Time": "2 hrs",
        "Total Distance": "2 km",
        "Town": "La Verkin, UT",
        "Type": "out-and-back"
    },
    "title": "Yankee Doodle Canyon",
    "trail_id": "10965"
}