{
    "description": "I marked the distance as 15km return, but you can hike all day up the canyon on the old road to Flagstaff.  Eventually cresting the canyon walls and the mesa above, where you will have the company of Pink Jeeps.The trail described here more or less follows or is parallel to the wagon trail (now the Jeep Tour road and gold mine for local companies) but is surprisingly pleasant and off the road so that for the most part, you don't see them.  You may hear the tour guide first, but you can take a certain satisfaction in hiking what others are Jeeping.  The views back to town, below you, and then above you to the rocks and high buttes are fantastic.  Suitable for mountain bikers also, in fact, it's the access trail to Hangover (also a good option for hikers).Follow Munds out of The Schnebly Hill parking lot which shares a trailhead with Huckaby, also a popular and easy hiking trail.  The trail intially climbs for some great views back on Sedona in the valley, then descends from a high-point into a valley / creek bed that may have some water pools along the way as it then winds it's way up the canyon and generally parallel to Munds Wagon Trail, which is the  original road to Flagstaff.  You will hear (and see) the Jeep tours, notably Pink Jeep tours, driving the hordes of visitors to the outback of Sedona -- but you are hiking and seeing the desert up close.  Generally, the trail snakes away from the road and it's nice single-track. As it climbs and about 3 or 4km into the hike, you get to a trail intersection for \"Hangover\".   We decided to take this for a while, climbing up and out of the valley, and, again, what views.  Then, we met some hikers coming down from Hangover who convinced us to do the whole thing for great views from high up on the cliffs and buttes.  However, other hikers may decide to continue on Munds, gaining access to the wilderness section of the park and better views as the trail eventually climbs the long canyon.  NOTE: That the attached GPS data is actually showing only a portion of Munds from the Schnebly hill trail followed by the Hangover trail loop.  If someone would like to replace this GPS data, please use contact us (bottom).For bike rentals: We rented in Scottsdale (near Phoenix) at AOA-adventures for great weekly rates on GIANT and Specialized, allowing you to ride nearby McDowell Preserve or South Mountain before heading to Sedona.",
    "directions": "Schnebly Hill USFS Parking lot.  Take the Round-a-bout heading away from the Sedona Y intersection between 179 and 89A (towards 179) and your first round-a-bout just a few hundred yards away, take the well marked Schnebly Hill Road, and continue a mile or so until you see the very obvious USFS parking lot area just short of the where the road turns to dirt.  If you hit the Jeep road, turn around, it is quite rough -- although the Jeep tours take this road and you will more or less parallel it on your trail, but skirting the oh so unecessary switchbacks that vehicles have to take.  Your trail is much more scenic and eventually provides access to the Hangover trail which is also a great hike, but a very advanced bike ride (so much so you won't see many riders).",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/AZ/10960/reg_DCIM263[N3487085W11172671T3E9C7D63H0594BC]-5.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/munds-wagon-trail-near-sedona-az-10960",
    "stats": {
        "Activities": "hike mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "3 hrs",
        "Total Distance": "15 km",
        "Town": "Sedona, AZ",
        "Type": "out-and-back"
    },
    "title": "Munds Wagon Trail",
    "trail_id": "10960"
}