{
    "description": "Easy hike but you have to look at a tide chart before setting off.  The trail is set in Minas Basin near Falmouth and only accessible at low tide.From the parking lot, follow the old road into a nce mature hardwood grove.  some of the trees are huge!  After a minute or two the trail descends to the sea floor and the reason for hiking here begins.  From wikipedia;Fossils are found near Parrsboro, Blue Beach and other areas along the Avon River.[7] Rarely, fossils have been found at Evangeline Beach, Burntcoat Head, and other locations. These fossils include various shells (brachiopods, molluscs), sponges, trees, fish, amphibians, reptiles, and dinosaurs. Trace fossils include vertebrate footprints, fish fin-tracks, invertebrate trackways (ex. scorpions at Blue Beach), raindrop inprints, and wave ripples. They range from the beginning of the Carboniferous to the Jurassic. They were deposited when the region was warm and tropical, later when it was covered by a shallow sea, and later still when it was a desert.So here you have it....the hike is as long or short as you want you can go in either direction at the beach and within a few moments you will pot some fossils.  the most common and easy to spot are the wave ripples.  We think we may have spotted a turtle but it could be anything fossilized which had the same shape as a turtle's shell",
    "directions": "Exit 8A off the 101.  Turn left on Evangeline Trail and then right on Martin Rd.  Then left on Bluff Rd and then right on Blue Beach Rd.  Park right after railroad underpass.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/10974/reg_DSC-0166-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10974/reg_DSC-0170-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10974/reg_DSC-0173-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10974/reg_DSC-0177-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10974/narrow_DSC-0176-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/blue-beach-near-windsor-ns-10974",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "4 km",
        "Town": "Windsor, NS",
        "Type": "out-and-back"
    },
    "title": "Blue Beach",
    "trail_id": "10974"
}