{
    "description": "Whyte lake trail to Baden Powell connecter, to Eagle Bluffs and down to Cypress Lodge at the ski area.",
    "directions": "Park in the Whyte lake parking lot. Hike to Whyte Lake and then around West side of lake. Follow colored markers up. Trail becomes more obvious as the terrain steepens.The main Baden Powell Trail is fairly well marked when you come across it as its an old logging road. Turn right again uphill and follow the trail to Eagle Bluffs. Watch for the orange triangles. Shortly after ascending the first steep climb you will come to a fairly level patch. You will see a pile of rocks on a larger rock. You will stop and take a photo. You will take a photo of your friend standing next rock pile. Your friend will take a picture of you next to the rock pile. You will wish there was someone to take a picture of you and your friend next to the pile of rocks. You will settle for adding a rock to the rock pile. But you will cause the rock pile to partially collapse. You will finally, finally get bored and move on. Keep right. Don't head uphill. That leads to Donut Bluffs - lots of tree fall and poorly marked. But follow the orange triangles and another 500 metres and you should see the first rock slide-follow the trail through that. Through more woods uphill and you come to the the boulder patch up to Eagle Bluffs.  From Eagle Bluffs head up a bit and then mainly downhill past Black Mountain. Look for the signs to the ski area. I recommend the trail to Cabin Lake (left fork) and Lodge. The easier trail is to the parking lot (right fork). You will need snow shoes up until end of June at least for the latter part.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/10987/reg_Greater-Vancouver-A-20121208-00005-43012.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10987/reg_West-Vancouver-20121208-00007-43012.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/10987/reg_West-Vancouver-20121208-00014-43012.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/baden-powell-whyte-lake-to-cypress-near-vancouver-bc-10987",
    "stats": {
        "Activities": "snowshoe hike",
        "From": "",
        "Seasons": "fall",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "10 km",
        "Town": "Vancouver, BC",
        "Type": "out-and-back"
    },
    "title": "Baden Powell Whyte lake to Cypress",
    "trail_id": "10987"
}