{
    "description": "This is a small hike to a beautiful waterfall that most people don't know about.  I always thought I had exhausted my waterfall quest in this part of Hants County but I was pleasantly surprised.It all started when I was looking at an old mining activities map.  I immediately spotted a couple of waterfalls symbols on the streams located in the mining tracts.  I had never seen any other indication of falls in this area and looking at the topography?it looked like I was going to be deceived.   However, I am a waterfall nut so one day I decided to seek out those falls.  The road to the stream is in good condition and the bridge upstream of the falls left me under the impression that I had travelled far for nothing.  The stream is a good size waterbody (about 3-4m wide) but the topography didn?t look good for waterfalls.I set off on the woods road running north of the stream and parked where I thought a waterfall could be located (the topo indicated a small change in elevation at this point).  I bushwacked my way to the stream and immediately dropped good 10m down a steep evergreen/moss covered slope to the stream below.  No waterfall at this point.  Now I can either go downstream or upstream.  Both way look unpromising.  The area where I am right now has some rocky exposure right into the river and I am wondering if the river has carved out the rocky feature over time and I am left with the small 2 foot cascade in front of me as ?the waterfall?.I decided to hike upstream for a few minutes.  The rocky outcrops and width of the stream prevented me from following it on its side so I had to go up and down the steep slope a few times.  At last I saw some more rocky outcrops on both sides of the stream and then the first five footer flowed by the main waterfall which I would estimate to be about 20ft or more with a third small fall located just above.  It?s a fun one to seek out because you would never expect this fall to be there.  It looks a lot like Burnside Falls located east.  BTW I hiked for another 90min there and back to another fall on the Greenfield Brook located close by?that was a bust?all that time for a 5 ft waterfall?.although the forest in those parts was a spectacular hardwood making it worthwhile nonetheless?..I won?t post a hike on the latter one.As I was going up the slope by the fall, I noticed a lot of garbage?Why would you dump anything in the woods in the first place and why do it in the most beautiful spot around is a mystery.  Above the waterfall is a cabin and a smaller track that will lead you back to the main woods road where I set off on this hike.  As always you get the benefit of not searching for the fall as it is clearly indicated in the gps track (the fall are located at the most eastern point along the river where my track leaved the river?s edge).Drive to Valley station (near Truro).  Take the Old Greenfield Rd.  turn left on Greenfield Rd which will become Lilyvale Rd.  Woods rd and stream are located at  45°19'31.64\"N, 63° 5'17.21\"W",
    "directions": "Drive to Valley station (near Truro).  Take the Old Greenfield Rd.  turn left on Greenfield Rd which will become Lilyvale Rd.  Woods rd and stream are located at  45°19'31.64\"N, 63° 5'17.21\"W",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/10985/reg_DSC-0013-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10985/reg_DSC-0017-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10985/reg_DSC-0023-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/10985/reg_DSC-0029-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/rutherford-brook-falls-near-truro-ns-10985",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "1 km",
        "Town": "Truro, NS",
        "Type": "out-and-back"
    },
    "title": "Rutherford Brook Falls",
    "trail_id": "10985"
}