{
    "description": "\r\n\r\nNTS Map: 092G07Deep Cove is a quaint town on the Burrard Inlet, and the launching point for kayaking into Indian Arm.  Kayaks and Canoes can be rented at the waterfront in Deep Cove for some great day kayaking, or, for an overnight trip up Indian arm.  \r\n\r\nWe have two suggestions for you if looking for some more challenging alternatives to day kayaking.  Consider camping at the Marine Park just West of Croker Island, or, combine with a bike adventure to go all the way to Squamish by following the route of the Sea2Summit adventure race, which takes you along the Stawamus logging road.  We'd suggest you do this route by participating in the Sea2Summit race. This is wild country, and you are otherwise on your own if you have bike problems.  It is also bear country.  If the journey to Squamish sounds like too much for one day (yes you must paddle, bike, and run all day long), then consider doing it with your own group, over a couple of days, as we did. Have one group start in Squamish by mountain bike, and the other group (same number of people or someone is walking) starts in Deep Cove.  Both groups meet at the far-end of Indiam Arm, possibly camp (where is up to you, and part of the challenge ? we stayed on a friend's private property), gorge on pasta, spend the night, and, then switch gear to complete the journey the next day. If that all sounds like too much, just go for a day paddle out of Deep Cove, sunning on the rocks of nearby Islands, very pleasant.\r\n One caution is the significant yacht traffic also making it's way up Indian Arm.  Make sure they see you, and try to hug the shoreline.  There can also be significant winds along Indiam arm; so, it is wise to hire a guide if you are not an advanced paddler with rescue training.",
    "directions": "See description and / or GPS",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/11/reg_DeepCoveShop1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11/reg_DeepCoveShop2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11/narrow_DeepCove1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11/narrow_hex1.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/deepcove-near-vancouver-bc-11",
    "stats": {
        "Activities": "sea-kayak",
        "From": "",
        "Seasons": "summer",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "5 km",
        "Town": "Vancouver, BC",
        "Type": "out-and-back"
    },
    "title": "DeepCove",
    "trail_id": "11"
}