{
    "description": "When I set off on this hike, I was going with a faint evidence of some rapids on the East River.  The topi maps were not showing very much terrain  conducive to waterfalls but I was chasing some other falls in this area so I took a chance...risk big, win big!And it did...but first things first.   I plowed through a logging area and then bushwacked through some very very thick evergreen...I wasn't very happy at his point!  Made it to the edge of the ravine and finally to some decent mature evergreen forest.  I found myself following and criss crossing a lot of old tracks in the woods that at one point probably lead all the way down to he river's edge.At the river, there was no sign of anything worthwhile.  I had to make a decision on which way to go up or down.  I went up for a while but apart from some small rapids there wasn't much to see....I was getting a bit discouraged but decided to follow the river downstream.Finally a first 20 foot wide fall and then..........a 100 feet or more slider with a terminal fall of similar height!!!!!   What a cool place to discover.  The slider part is hard to describe and the fall...although not a true drop is magnificent...the pictures and video do it more justice that I ever could have.  If this was in the tropics somewhere people would pay to spend a few hours in the fall.  All in all I was very happy to make a new discovery in the gorgeous Cobequid Mountains.  And as always, I wanted to share this unique place with like minded individuals so happy exploring!",
    "directions": "Highway 2 to Gerrish Valley Road. Go north on Gerrish Valley Rd and turn lefton logging road at;  45°27'14.43\"N, 63°58'57.72\"W.  Continue on logging road and park at  45°27'3.47\"N,  63°59'37.82\"W. From here head due west...or look at gps track",
    "geohash": "f846x",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/11004/reg_DSC-0046-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11004/reg_DSC-0022-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11004/reg_DSC-0025-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11004/reg_DSC-0033-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11004/narrow_DSC-0041-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11004/narrow_DSC-0068-27177_best1_.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/bens-paradise-falls-near-parrsboro-ns-11004",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 5,
        "Time": "2 hrs",
        "Total Distance": "4 km",
        "Town": "Parrsboro, NS",
        "Type": "out-and-back"
    },
    "title": "Ben's Paradise Falls",
    "trail_id": "11004"
}