{
    "description": "Strat climbing down the steep rock slope to the sea floor and witness one of the large sea flower pots in front of you.  The hike follows the coastline to the west.  Only ATTEMPT AT LOW TIDE AS THERE ARE VERY FEW EXIT POINTS !.  The visual rewards are instant, the red sandstone, the green bladder wrack algae are in contrast all the way.  You can hike all the way to the provincial park and then back if you time it properly.  Along the way you will see various sea caves some are fairly deep at least 20ft or more and the ceilings are quite high.  Lots of stand alone sandstone islands...some you can climb some I wouldn't try.One of the best secret is a sea cave that open ended on each side.  One side is at the sea floor level while the other is set about 2.5m off the ground but its an easy climb.  The cave is narrow but it has enough space to travel through.    There are some nice waterfalls along the way but judging the amount of water they probably go dry in the summer.  Sea cave is approx at ;  45°23'15.48\"N,  64° 0'10.71\"W.  Enjoy!",
    "directions": "Highway 2 towards Five Islands.  Turn left on Soley Cove Rd and park here ;  45°23'32.78\"N,  63°59'44.79\"W.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/11005/reg_DSC-0086-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11005/reg_DSC-0090-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11005/reg_DSC-0098-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11005/narrow_DSC-0093-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11005/narrow_DSC-0097-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/soley-cove-sea-caves-near-parrsboro-ns-11005",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "5 km",
        "Town": "Parrsboro, NS",
        "Type": "out-and-back"
    },
    "title": "Soley Cove Sea Caves",
    "trail_id": "11005"
}