{
    "description": "A most interesting hike in the Red Deer river valley up to the Dry Island and then returning through the badlands east of the Dry Island and back to the valley floor.  The Dry Island is a small patch of prairie that was left behind as the glacier covering this area melted away and washed out the valley that we now see here.Only visit this area on a dry day as the ground here is extremely slippery when wet.  This hike starts and ends at the picnic place at the bottom of the valley near the river.  We head out eastward along the valley floor for about 1.25 Km and turn north when the Dry Island is directly north.  An easy ascent to the top, take some time to kook around, and then continue north at the western edge gradually heading right and into the badlands.  Follow the GPS track since the trail is not that distinct in this area.  Pretty soon you will leave the badlands and see the Red Deer river nearby on your return trip to the picnic place.",
    "directions": "13 Km north of Trochu, on Highway 21 take Township Road 344 east for 19km to the park.  There is a gate at the top of the hill which will be closed off season and when conditions require this.  (road too wet)  Do not hike here when the ground is wet as it is very slippery.",
    "geohash": "c3px",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/11007/long_IMG-6103-10632.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11007/reg_2013-06-06-GoogleEarth-10632.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11007/reg_IMG-6097-10632.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11007/reg_IMG-6105-10632.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11007/reg_IMG-6109-10632.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11007/reg_IMG-6110-10632.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11007/reg_IMG-6125-10632.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11007/reg_IMG-7698-10632.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/dry-island-provincial-park-near-trochu-ab-11007",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 4,
        "Time": "5 hrs",
        "Total Distance": "8 km",
        "Town": "Trochu, AB",
        "Type": "out-and-back"
    },
    "title": "Dry Island Provincial Park",
    "trail_id": "11007"
}