{
    "description": "Another great coastal hike on the south shore of Cape Breton Island.  Again there will be no sign of human disturbance along the whole length of the hike albeit some flotsam from the sea.  The highlights of this  hike are two cove, one small with cobble and the other quite large with a beautiful sandy beach.Setting off from near Framboise (Lower Mary Joseph Lake) the path meanders on the breaker of the lake and the Ocean (making this lake a barachois) through the barrens and close to the sea shore.  There are views of the atlantic everywhere as there is little forest.   The area can be boggy but the sights are impressive.  After a km you will get to the first smaller cove called Fox cove.  Waves often break on a piece of granite in the middle of the cove for impressive sights and sounds.  after the Fox cove you are left with about 5km of barren walk towards your ultimate goal; Capelin cove.Capelin cove is a perfectly shaped half-moon sandy beach.  I saw some seals when I was there in april.  The only draw back of Capelin cove is that a rough road can be taken to it so you might have to share this secret spot with someone else but more likely you will be on your own to admire the scenery.  The walk from Joseph Lake to Capelin cove is about 6.5km.",
    "directions": "In St Peters, turn right on Pt Michaud Rd and then left on St Peters- Fourch Rd.  Drive on this road towards the village of Framboise and turn right on Crooked Lake R and then a last right before the ocean towards the Mary Joseph Lake.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/11022/long_EPSON005-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11022/long_EPSON006-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/capelin-cove-near-st-peters-ns-11022",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 4,
        "Time": "5 hrs",
        "Total Distance": "12 km",
        "Town": "St. Peter's, NS",
        "Type": "out-and-back"
    },
    "title": "Capelin Cove",
    "trail_id": "11022"
}