{
    "description": "I was looking at some satellite imagery the other day and saw these white spots on a stream near the village of Upper Musquodoboit.  The topo maps weren?t showing a big drop in elevation and old maps were not describing anything exciting either.  But I am a waterfall seeker so I knew I had to check this out someday.That day was yesterday and I was very pleasantly surprised.  After walking from a dirt road through a mature sugar maple forest (there is actual syrup production across the road), I entered the ravine where the river has carved a deep ravine.  The slopes are fairly steep and covered with mature evergreens.  The carpet of moss is thick and the sound of the fall resonate throughout the ravine.  The lowest part of the ravine has approximately 7 waterfall in a row with the largest ones at the top being about 6ft.  These are the white spots I saw on the imagery.  However being an explorer, I decided to continue up the ravine and was rewarded with three more, larger, falls.  The last one at time of high water would flow over a straight edge rockwall but was going around the wall at the time of my visit.  I went up the ravine and found the old logging road and retraced my steps back to my car.In upper Musquodoboit, continue towards Dean and turn on dirt road immediately before the Lemon Hill Rd.",
    "directions": "In upper Musquodoboit, continue towards Dean and turn on dirt road immediately before the Lemon Hill Rd.Continue on dirt road as it goes towards the river (on your right)....",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/11033/reg_DSC-0260-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11033/reg_DSC-0262-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11033/reg_DSC-0267-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11033/reg_DSC-0270-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11033/reg_DSC-0276-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11033/reg_DSC-0283-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11033/reg_DSC-0286-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/north-branch-musquodoboit-river-waterfalls-near-stewiacke-ns-11033",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "2 km",
        "Town": "Stewiacke, NS",
        "Type": "out-and-back"
    },
    "title": "North Branch Musquodoboit River Waterfalls",
    "trail_id": "11033"
}