{
    "description": "This is an adventure both for you and your car.  Deep in the woods on the west side of Lake Charlottle lies a stream and multiple waterfalls.  The things that got me interested in going to this particular remote spot was the mention of a gorge and waterfalls on the stream by Fletcher in the early 1900s, no one had pictures of the waterfalls and you can clearly spot some white spots in satellite imagery.  From the end of the dirt road, you begin to follow a skidder track because the rest of the area is densely packed with new growth of raspberries and other prickly shrubs.  After 500m or so you enter the forest.  I was lucky enough to follow a cut line of some sort marked with bright orange tape.  That led me to the stream.  I had mapped out all of the falls and gorge upstream of this point.  The forest is mainly evergreen but the trees are not very old but the walking for the most part is easy.  There are a few deadfall areas to traverse but all in all pretty easy travel.  The gorge turned out to be a dud.  The stream enters a narrow area with rocky ledge on both side?.but the rocky ledges are only about 6ft tall.  Pressing on I did see some more waterfalls and the white spots turned out to be foam from the stream.  The last waterfall 9most upstream) is the largest and pretty scenic.  Big mistake afterward.  I tried to cut across a logged area and was miserable for the 10minutes it took me to make about 200m distance.  I decided to head back into the woods and follow some game trails which were plentiful.  After a while a rocky ridge appeared to my right and I went up to see some glimpse of Lake Charlotte in the distance.   That was a lot of effort since the top of the ridge is covered by shrubbery and travelling is difficult at best.  It reminded me of the forest in the trails near Lake Echo.   Came back down and happened by chance to fall upon an old atv trail which ultimately lead me back to the logged area traversed at first during the trip.",
    "directions": "Take highway 357 towards Meaghers Grant and turn on Lays Lake Road.  At the Y intersection if front of the lake turn right and then hold on for dear life.  This road is in very bad shape except for the middle section.  There are lots of deep holes and loose cobble size rocks everywhere.  Take your GPS, sat imagery and paper map and head to a point located at;  44° 52.854'N, 63° 0.642'W",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/11035/reg_DSC-0208-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11035/reg_DSC-0213-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11035/reg_DSC-0218-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11035/reg_DSC-0226-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11035/reg_DSC-0235-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/lake-charlotte-waterfall-near-halifax-ns-11035",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "5 km",
        "Town": "Halifax, NS",
        "Type": "out-and-back"
    },
    "title": "Lake Charlotte Waterfall",
    "trail_id": "11035"
}