{
    "description": "A short hike on the beautiful coastline of the Bay of Fundy leads you to a waterfall and a narrow sea cave.  Setting off from Hall?s Harbour turn to the east and follow the coastline all the way to the fall and cave.  At first you traverse a pebble/cobble beach and spot some long staircases on the horizon.  Just after you pass the staircases, you will some small shallow sea caves..not really caves but rather a large overhang.  Of course the most important thing here to consider is the tide because the next spot has a large outcrop of rock that you can carefully walk on or if the tide is low just walk in front of it.  The rocks on the large outcrop are covered by seaweed and are especially slippery.  After rounding off the corner you will look down the eastern coastline to some massive cliffs bordering some of the vaults.   You could potentially see the fall in the corner closest to you as well if there has been rain lately.  The next part of the hike is easier to do close to the low tide water level as the upper beach is covered by boulder size rocks that are extra slippery.   After a while the bigger rock make way to smaller stone and easy walking is achieved anywhere.  You might spot a small dirt road coming to the water level which is another way to see the cave/waterfall.  Right at the corner the small cave opens up behind the fall.  It?s narrow and probably about 20ft long.",
    "directions": "Kentville to Hall?s Harbour.  Park at the wharf ; 45° 12.056'N, 64° 37.185'W",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/11049/reg_DSC-0209-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11049/reg_DSC-0215-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11049/narrow_DSC-0212-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/halls-harbour-cave-and-waterfall-near-kentville-ns-11049",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "2 km",
        "Town": "Kentville, NS",
        "Type": "out-and-back"
    },
    "title": "Hall's Harbour Cave and Waterfall",
    "trail_id": "11049"
}