{
    "description": "This is the trail to the Biggest Tree in Canada. It is not the tallest, but it is the most massive. It is recorded in the Big Tree Register of British Columbia, bigtrees.forestry.ubc.ca . Although the trail isn't long it is a long distance from anywhere. It's 2:30 hours to the village of Bamfield, and  2:45 hours to the town of Port Alberni. It can conveniently be done as a side trip to visiting the giant spruce of the Carmanah Valley. But I'd recommend an overnight trip if you were to do both. But it is possible to combine them into one long day. The trail itself is downhill through thick west coast rainforest with a couple of steep pitches. The trail is fairly well marked with loggers ribbon. But I would definitely keep an eye on your GPS.",
    "directions": "The road to the trail is long and gravel with plenty of bumpiness. However it is all 2WD. Give way for loaded logging trucks.In Port Alberni From the corner of Highway 4 and Gertrude Street, drive  south down Gertrude, which changes to Stamp Avenue which changes  again to 3rd Avenue. But do not turn for 4.0 km. the take the left fork  onto Ship Creek Road. 6.2 km later you come to Franklin River Road. This is the Bamfield Road. Turn right and drive 36 km on this road following the  powerlines. Turn right. The road will become paved for a while. Drive  another 31 km on this road until you come to a large bridge over the  Caycuse River. Around 28 km you will pass the native village of Nitnat.  After crossing the bridge, turn right. Then drive another 18 km over some  very bumpy road with great views of Nitnat Lake and an incredible hairpin  turn. Watch out for logging trucks here. Turn on your GPS near km 17.",
    "geohash": "c0xm1",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/11063/long_P1020563sm-16063_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11063/reg_CheewhatSign-16063.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11063/reg_Chewhat-trailhead-16063.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11063/narrow_2011-06-13-0461sm-16063.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/cheewhat-cedar-near-port-alberni-bc-11063",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer spring",
        "Stars": 5,
        "Time": "2 hrs",
        "Total Distance": "1 km",
        "Town": "Port Alberni, BC",
        "Type": "out-and-back"
    },
    "title": "Cheewhat Cedar",
    "trail_id": "11063"
}