{
    "description": "This is a short hike, less than half an hour one way. And it goes to one of the most spectacular falls in the Alberni Valley. It is not very well known. and thank God for that, because it is a gem and too many people would spoil it. You'll feel alone in a grotto. The last time I was there my buddy who forgot his swim suit thought nothing of skinny dipping. It's a great place to cool off on a hot summer day or to to take a little detour on your way to Tofino... or back from Tofino. The trailhead is only 5 minutes off the highway and the hike is 15 minutes.",
    "directions": "Start from the Visitor Information Centre at the bottom of the hill as you drive west into Port Alberni. Continue past it on Highway 4 toward Tofino until you arrive at the Somas River. Stay on Highway 4 and turn right following the river upstream. You will cross the river at a metal bridge painted grey. Still stay on Highway 4 for another 11.1 Km to the turn off.  It is opposite a bay in Sproat Lake and a place Called Sproat Lake  Landing. Turn right off the highway and then right immediately afterward  onto a gravel road. About 100 meters later turn left and proceed about 600 meters to a right turn shortly before a bridge. The Trailhead is less than 300 further under a powerline. The trail parallels the powerline but in the shade. Start looking for a trail to your left after about ten minutes of hiking. You arrive at the top of the falls a minute or so later. A few meters downstream you will find some ropes to help you down into the canyon below the falls.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/11076/reg_14-May-2009-027sm-16063.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11076/reg_2011-07-11-0944sm-16063.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11076/reg_2011-07-11-0948sm-16063.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11076/narrow_2011-08-14-1665sm-16063.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11076/narrow_Fossli-Winer-019sm-16063_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11076/narrow_Jeff-Schaafsma-16063.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11076/narrow_P1010018-1-16063.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/weiner-falls-near-port-alberni-bc-11076",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer spring",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "1 km",
        "Town": "Port Alberni, BC",
        "Type": "out-and-back"
    },
    "title": "Weiner Falls",
    "trail_id": "11076"
}