{
    "description": "This portion of the East Coast Trail has trail heads in Bay Bulls and Witless Bay. The linear trek takes approximately 3 hours at a leisurely pace meandering the coast line of the peninsula that separates the two bays.We hiked this route on July 1st and was so fortunate to see lots of minke whales along the way. As we rounded the point you could see the Witless Bay Ecological Reserve as well where many species of sea birds nest. I'm told folks will often pair this hike with a boat tour which also departs from the same area. I have done the boat tour on a separate occasion, it's a great experiencing for locals and visitors alike with professional operators. The trail is the same high quality as one would expect from the East Coast Trail, well maintained, dry with log/wooden steps where need be. Some small elevation changes but nothing too serious. Be mindful around edges.Overall a great little hike. For those interested in a longer trip I would also recommend pairing this hike with The Beaches Path, Tinkers Point Path or La Manche Village Path. Details can be found at: http://eastcoasttrail.ca/",
    "directions": "Bay Bulls: Entering Bay Bulls you descend into the commercial portion of the town and see a Foodland (Grocery Store). Take the left just before heading towards the ocean. At the fork in the road keep right and take that road traveling along the shoreline until you meet a second fork in the road - keep left and go until the end.Witless Bay: As soon as you enter Witless Bay turn left onto Dean's Road. Go all the way to the end where you'll find a 'T' intersection in the road. Right is a tourist info center. Park here and walk back to the intersection taking the left route (not back up Dean's road). This is a residential area with no place to park that's not in the way. You'll find a 'Bus Turn Around' area and on the right hand side of the road is the trail head.",
    "photos": [],
    "source_url": "https://trailpeak.com/trails/mickeleens-path-east-coast-trail-near-bay-bulls-nf-11078",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "7 km",
        "Town": "Bay Bulls, NF",
        "Type": "out-and-back"
    },
    "title": "Mickeleens Path (East Coast Trail)",
    "trail_id": "11078"
}