{
    "description": "This is a magnificent trail that winds along the most productive salmon river on Vancouver Island. It combines a wild river, groves of huge old Douglas Fir, tall second growth forest, and salmon in the river. Really, this is an iconic west coast gem of a trail, all 8 kms of it. The only downside is that it isn't a loop trail. So if you plan on hiking it, use two vehicles. Park one at the far end and drive back in the other vehicle to the first trailhead. At the end of the day you'll have to do that again in reverse. Or you could arrange to have someone pick you up at one end. Or you could find someone who will do the trail in the reverse direction and trade keys in the middle and arrange to meet to return vehicles. Ya, it's a bit of a hassle. But so worth it! Go in September or October when the biggest species of salmon, the Chinook, is running. And don't miss the falls and fish ladder near the south trail-head. Wow!",
    "directions": "I'll give directions to both the north and south trail-heads. The South first. Travelling west on Highway 4 into Port Alberni you will see the Visitor Information Centre in the crotch of a fork in the road. From there stay on the highway for another 4.3 km until you come to the Somass River. Turn right and drive 0.3 km until you see a fork to the right just before a Petro Canada gas station. This is Beaver Creek Road. Follow this road 12.6 km to the turnoff to Stamp Falls Provincial Park on your left (the name of the park is now Stamp River Provincial Park, but the sign is still the old name). The trail-head is 1.6 km down this road. Drive past it and park in the parking area and walk back up about 500m to it. The original trailhead was wiped out in a small slide several years ago.the North Trailhead. Drive back to the entrance of the park and turn left. Drive 3.9 km until you come to a fork in the road. Take the left fork onto the Comox Trail. Follow this road 1.2 km and take the first left onto Barker Road. Go another 0.8 km and turn left onto an old logging road. Careful! There are two sharp dips in the gravel where a low-slung vehicle could bottom out. The trail head is at the end of this road, about 400 m in.",
    "geohash": "c0z0",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/11070/reg_14-07-09-Sylvia-026sm-16063.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11070/reg_2013-06-08-0396sm-16063.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11070/reg_2013-06-08-0414sm-16063.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11070/reg_Stamp-River-in-June-054-edited-2-16063.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11070/narrow_2011-05-29-0301sm-16063.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11070/narrow_IMG-0156sm-16063.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11070/narrow_IMG-0195sm-16063.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/anglers-trail-near-port-alberni-bc-11070",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 5,
        "Time": "4 hrs",
        "Total Distance": "8 km",
        "Town": "Port Alberni, BC",
        "Type": "out-and-back"
    },
    "title": "Angler's Trail",
    "trail_id": "11070"
}