{
    "description": "A long, potentially quite difficult, back country, mountain bike ride.  There is no cell coverage and limited access if things go wrong, so BE PREPARED (I took my SPOT beacon, it was quite reassuring).  Expect  a long day and wet feet.  Be READY for broken derailleurs, chains, tires and more.  You will have 40-60 difficult kilometers AND about 600+ meters of cumulative climbing, some up quite technical terrain.  On the plus side, you'll see things your friends will envy AND likely not see another soul.The valleys it gets you into are worth it!  Serious peaks all around you, confluences of different valleys, chasms and such to see up close.Once you enter into Banff National Park, there are a few signs, but in general you want to be well-acquainted with Maps and/or GPS.  This is not a trip for beginners or anything less than higher than average personal fitness, bike quality, and technical bike handling skills.  Helmets are a must (like I have to tell you guys that), but occasionally strapping on XC armour and armoured gloves wouldn't be a bad idea if you plan on riding the more technical bits.About 7 km in from the Ghost River there is a Canal / stream between the 2nd and 3rd (from the East) Ghost Lakes that must be forded.  It can be from shoelace deep to boobie deep but doesn't typically flow fast enough to be a problem from that perspective.  We were lucky and it was under knee-deep and a few of us actually rode across it (next week's lesson:  how to replace a bottom bracket on a 2013 Giant Anthem 29er X0).At the Ghost River, this was the first time we've seen any water to speak of there, usually it is flowing under the surface of the rocks.  This time we had just above the knees and moving fairly fast, though we got through with minimal problems.There is a lot of fun but technical riding with some moderate exposure (exposure to falling 20-30 meters that is).  The East end is riding through mossy valley bottoms.  Portions are a rooty, rocky trail running along the valley and moderately up and down the hill sides above Lake Minnewanka.  We rode it 2 weeks after the June 2013 monster rain storms and several places were washed out and far wider than in the past, trails and cairns were missing or hard to see.  It required some route finding and some walking / riding through 15 cm of water.  There were several washouts where we had to pick our way down 2-3 meter cliffs of gravel.After 36 or so km, you will get to the familiar Ranger Cabin that many people will reach from the Lake Minnewanka Parking lot side.  It is about 16 or so km back to the parking lot and is quite a fun, flowey trail (post 2013 flood not so much).  Read the trailpeak entry for a review and notes on that section of the trail.An Epic ride that I'm glad I did.  Once is enough for now, but maybe after some reflection... maybe again.  What I'd like more in the short-term is to 4x4 in as far as possible and explore that area, poke around the chasms and fissures and take lots more photos.Our shuttle service was waiting for us in town so we rode the road down to town and had a fabulous Prime-Rib dinner at Melissa's Missteak.  Our total distance was 62 km, but if you need more kms, you could tie-in a jaunt to Johnson Lake and come down on Water Tower trail and back to town thataway.",
    "directions": "West of Calgary, get to Cochrane on highway 1A (note the A, eh!).  Go 13.1 km West from the hiway 22/1A lights to Hiway 40 (Forestry Trunk Road).  Go North 24.3 km (past Benchlands, Waiprous, and just past Bar-Cee) to Range Road 74B, there will be a largish, double-posted sign board there.  You can start riding there, or if you have a high clearance, reliable vehicle (and are lazy), drive 16.6 km further along this road (called variously Township Road 270A, 270, 265C, 270B, etc.) to the Ghost River.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/11074/reg_P1020865-Custom--6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11074/reg_P1020868-Custom--6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11074/reg_P1020870-Custom--6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11074/reg_P1020874-Custom--6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11074/reg_P1020877-Custom--6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11074/reg_P1020882-Custom--6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11074/reg_P1020900-Custom--6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11074/reg_P1020908-Custom--6828_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11074/reg_P1020932-Custom--6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11074/narrow_P1020905-Custom--6828.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/minnewanka-full-shuttle-near-banff-ab-11074",
    "stats": {
        "Activities": "snowshoe hike mtn-bike climb",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 3,
        "Time": "8 hrs",
        "Total Distance": "50 km",
        "Town": "Banff, AB",
        "Type": "out-and-back"
    },
    "title": "Minnewanka Full Shuttle",
    "trail_id": "11074"
}