{
    "description": "This is a short hike to a series of waterfalls ranging from 3-10ft.  What they lack in size, the unique location and geology of this site makes this a worthwhile trip.Setting off into the woods by the railroad track, you quickly descend through a mature forest to the river?s edge.  Once at the river just downstream of the railroad bridge, turn around and look at the height of this bridge?for Nova Scotia it?s impressive.  At the end of the hike, for those who don?t fear height, a side trip on the bridge is awesome!  Right downstream of the bridge is the main fall and right after the fall is a unique geological setting. One side of the river is a long and continuous wall of rock set at about 55 degrees.  Lots of cracks to step into so it only rate as something like a 5.1 bouldering problem for adults but for kids it would be a great traverse.  Just below the wall of rock, the stream looks quite deep. After the main rock section, there are two smaller set of falls with somewhat good pools to refresh yourself on a hot and sunny day.  At then end of the second set of waterfall lies the old foundation of a dam.  There seems to also be an unoffcial trail from this point back to the main rd.",
    "directions": "Drive to St Croix (near Windsor) and turn on  Hartville Rd and park where the rd crosses the railroad.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/11087/reg_DSC-0016-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11087/reg_DSC-0011-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11087/reg_DSC-0015-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11087/reg_DSC-0018-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/hartville-canyon-near-windsor-ns-11087",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "2 km",
        "Town": "Windsor, NS",
        "Type": "out-and-back"
    },
    "title": "Hartville Canyon",
    "trail_id": "11087"
}