{
    "description": "This is an easy one hour loop past two ponds that are home to a family of beavers and, in the winter, a nice variety of ducks. The beautiful Wood Ducks can be found there throughout the year. In June the lower pond is especially beautiful because it is lined with masses of yellow irises. The trail head is at a Yellow Gate on Burde Street. A short walk over a little bridge will take you to a little detour where there is an excellent view of the lower pond. Coming back you continue along the trail to a brown Post in the ground on the right. It indicates the way to the upper beaver pond. turn right and follow the trail up a little slope. It will come out into a younger forest and eventually you will see the pond ahead. At the top of the slope is a second, larger pond. look carefully and you will see the beaver lodge. Turn right here and follow this road back to Burde Street. When you get to it, follow it  right down to where you parked.",
    "directions": "Driving Weston Hwy 4 into Port Alberni, you will see the Visitor Information  Center in the middle of a fork in the road. Take the left fork and drive 3.2 Km to 17 th Avenue. Turn left onto 17th and drive two block south to Burde  Street. Then drive 0.5 km through a 4-way stop sign to the trailhead on the  left.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/11090/reg_12-04-Dad-s-Memorial-001sm-16063.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11090/reg_2013-04-09-0582sm-16063.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11090/reg_IMG-0314-16063.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11090/reg_IMG-0318-16063.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11090/reg_silver-threads-022-16063.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11090/narrow_IMG-0310-16063.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11090/narrow_IMG-0313-16063.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/burde-street-ponds-trail-near-port-alberni-bc-11090",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "2 km",
        "Town": "Port Alberni, BC",
        "Type": "out-and-back"
    },
    "title": "Burde Street Ponds Trail",
    "trail_id": "11090"
}