{
    "description": "A short hike to some natural sea caves and some man made tunnels as well as some gold panning are the main attractions of this hike.  First the hike is on private property so you will need to pay an  entrance fee.  Once that is done you are free to either begin gold panning at the beach in front of the parking lot or turn to the left and enter the sea cave trail. The trail is short and hugs the coastline affording dramatic views of the Ocean and cliffs where the sea caves are actively being carved.  The first sea cave is entered by following an old gold mining shaft right through solid rock and into the sea cave.   Back topside, the trail is mostly in a black spruce forest on one side and the cliffs on the other.  There is a fence running alongside most of the trail but it is more of a visual deterrent than a physical one.  The main attraction is a long concrete set of stairs that will take you down to the edge of the water to see the entrance of the sea cave and again a short man-made tunnel to enter the aforementioned cave.  The inside is very colorful with bright reds, orange and yellows.  A bit further along is another set of stairs which are set off from the cliffs so you have a small feeling of floating off from the edge.",
    "directions": "Lunenburg, take highway NS332, turn on Feltzen south Rd and then turn right on Ovens Rd.  Go right to the end and enter the Ovens Park",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/11104/reg_oven1-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11104/reg_oven2-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11104/reg_oven4-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11104/reg_oven5-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11104/narrow_oven3-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/ovens-near-lunenburg-ns-11104",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "2 km",
        "Town": "Lunenburg, NS",
        "Type": "out-and-back"
    },
    "title": "Ovens",
    "trail_id": "11104"
}