{
    "description": "An easy canoe trip down the Dee Bank River. This is a nice easy kayak with a few small portages.  You can put in at the small park on Northshore Rd.  From the entry point you will kayak towards Lake Rosseau and onto Windemere where we had a shuttle arranged.  Alternatively you can backtrack to your starting location.  If you continue onto Windemere keep an eye on the winds as Lake Rosseau can get rough.There is lots of small wildlife to be seen - turtles, herons, birds, beavers, butterflies, loons, and some cool dragonflies.  There are three portages if you continue the full way.  The first is a beaver dam - just a quick up and over is all that is necessary.  Then depending on the water level there is a small portage (50m) if the water levels are low, or if they are a bit higher you can walk along the egde and guide your kayak down the very small falls with a bow line.  This brings you into Clark Pond.  From here you cross the pond to a dam ... the portage is to the right and is about 150m but not too difficult.  You are now in Lake Rosseau head to the left and you will come to Windemere in 2km.",
    "directions": "From Windemere House take Windemere Rd east.  Turn left onto Dee Bank Rd then cross the bridge and turn right onto Northshore Rd.  There is a small park on the right about a km up the road.  Put in before the park (or you have an extra portage).",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/ON/11110/reg_IMG-4354-42792.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/11110/reg_IMG-4360-42792.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/11110/reg_IMG-4363-42792.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/11110/reg_IMG-4364-42792.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/11110/narrow_IMG-4359-42792.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/11110/narrow_IMG-4361-42792_best1_.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/dee-bank-river-canoekayak-near-bracebridge-on-11110",
    "stats": {
        "Activities": "river-kayak river-canoe",
        "From": "",
        "Seasons": "spring summer",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "6 km",
        "Town": "Bracebridge, ON",
        "Type": "out-and-back"
    },
    "title": "Dee Bank River Canoe/Kayak",
    "trail_id": "11110"
}