{
    "description": "Completed in August 2013 & again on March 25, 2019 (loop this time, new GPS available) ? Mostly dry with snow-ice patchesEdwards Rating: II (II) M L5 to 8 hoursElevation of 1356 m NET, 1382 m TOT & max 2669 m Gear: Cleats, hiking poles and GPS.*****The steepness of this scramble makes it for a painful day for the legs/knees but the ridge walk is interesting and it is a nice early/late season scramble. We had mud, ice and snow patches so cleats were very helpful to go down faster on that steep terrain. Going up under the summit and down the west ridge makes it for an interesting loop.From the road, we started on the obvious trail going up a little hill. At the first sign, we turned right losing some elevation. Second sign, right again (Grotto Mountain trail) loosing some more of elevation and reaching the creekbed. On the other side of the creekbed, we turned left and followed it until it naturally went up to the right as we were getting closer to that huge cliff band surrounding the canyon. You?ll also come across a wooden sign and will need to keep right. The trail then follows that cliff and gets steeper. Some easy scrambling is involved on rock bands with some light exposure. We kept going straight up and reached the scree and rubble slope. We went up to the false summit and then reached the true summit. Going down, we followed the west ridge all the way to the end staying on the ridge and avoiding cornices going slightly down to the left when necessary. Towards the end of the ridge, we saw an obvious trail going down the scree to reach the treeline and followed that trail down to the car. We came across 3 signs and stayed on the main trail all the time. I like the loop counter clockwise as you can enjoy the views to the west while going down.*********",
    "directions": "From Highway 1 in direction to Canmore, take exit 91 from Trans-Canada Hwy/AB-1 W and turn left at the intersection. Drive for 1 km on AB-1A east then turn left on Indian Flats Rd. Follow this road for 500 m and turn left again. The trailhead is about 130 m away from there and you must park on the left side of the road. Arrive early, this is very popular as climbers also park here.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/11117/long_Grotto-Mountain-Loop-Kananaskis-Osprey,-3-Sisters-to-Rundle-Mar-25-2019-900x444--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11117/long_Grotto-Mountain-Loop-Kananaskis-Summit-Panorama-Mar-25-2019-900x204--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11117/long_Grotto-Mountain-Loop-Kananaskis-Welcome!-From-Three-Sisters-Parkway-Mar-25-2019-900x385--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11117/long_IMG-20140807-111337-48903.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11117/long_IMG-20140807-121154-48903.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11117/reg_Grotto-Mnt-Canmore-Aug-13-10--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11117/reg_Grotto-Mnt-Canmore-Summit-Aug-13-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11117/reg_Grotto-Mountain-Loop-Kananaskis-Marry-on-West-Ridge,-Dangerous-Cornices-Mar-25-2019-900x675--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11117/reg_Grotto-Mountain-Loop-Kananaskis-Summit-Selfie-Osprey-Mar-25-2019-900x675--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11117/reg_IMG-0644-55273.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11117/narrow_Grotto-Mountain-Loop-Kananaskis-Huge-Bowl-Cliffs-Caves-Mar-25-2019-675x900--44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/grotto-mountain-summit-loop-near-canmore-ab-11117",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 3,
        "Time": "7 hrs",
        "Total Distance": "10 km",
        "Town": "Canmore, AB",
        "Type": "out-and-back"
    },
    "title": "Grotto Mountain Summit Loop",
    "trail_id": "11117"
}