{
    "description": "A short trail, 3km one way, from a logging road up to Serpentine Lake.  The first km is along a cross ditched logging road and the last two are through a steep treed trail where you can snack on blueberries the entire way if the season is right.",
    "directions": "The turnoff point for the logging road is along the Coquihalla hwy heading north bound.  About 600 metres past the Sowaqua Creek exit 192, there is a logging road that goes through a yellow gate and crosses the pipeline.  Turn off the highway and head up this road, I think there was some flagging tape marking the place to exit the highway.  At the first junction turn right and follow the gravel road in a westerly direction.  At the park and walk waypoint you should see pink and black striped flagging tape.  There is a small pullout here and you can turn around and park there with no problem.  Next walk up the road that is deeply trenched (a quad could get up this part though) and keep to the right while walking through the newly planted area.  You will reach the end of the road and see a good line of flagging tape leading you through some newly planted logging slash.  Take care not to step on the baby trees and head towards a large tree with lots of flagging tape.  This is the TH and where the old Serpentine Lake trail begins.  From here is it a steep hike that will take around an hour up to the lake.   Follow the trail that is blazed and marked with pink tape.  You will get to a small pond, and the lake is about 200 metres beyond the pond.  The trail was easy enough to follow in May, but I wonder as the huckleberries leaf out, if the trail will be harder to follow.Waypoints:Turn off Coquihalla here: N 49° 28.010 W 121° 15.249 Keep right: N 49° 28.012 W 121° 15.144 Park and walk:  N 49° 27.251 W 121° 14.949 End of Road:  N 49° 27.044 W 121° 14.659 Serpentine Lake TH:  N 49° 26.994 W 121° 14.645",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/11112/reg_20130727-164134-26531_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11112/reg_20130727-191144-26531.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11112/reg_20130727-192525-26531.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11112/reg_20130728-094400-26531.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11112/reg_20130728-094411-26531.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11112/reg_20130728-104529-26531.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/serpentine-lake-near-hope-bc-11112",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "6 km",
        "Town": "Hope, BC",
        "Type": "out-and-back"
    },
    "title": "Serpentine Lake",
    "trail_id": "11112"
}