{
    "description": "The Chapel Gully Trail is a 5.0 km loop.  From the parking area you will enter the trail traveling through a small stand of spruce trees. Here you can record your name in the trail registry.  The trail does return via the same route so you may want to save that for at the end of your hike as to provide comments on the trail.  Soon after the registry you will encounter a fork in the trail. This marks the beginning of the loop so you can choose either direction and still cover the entire trail.  Choosing the fork to the right will take you over a board walk section through a stand of speckled alder trees and along side of a salt marsh (the end of Chapel Gully). The tread here is generally a 1 metre wide gravel/natural duff surface. Soon the tread narrows to a footpath of natural cover. The trail continues across a barren area covered by scotch pine trees. Here you will also find the shortcut loop and the observation tower.  Take the shortcut loop if you want a shorter hike (though you will miss most of the coastal walk).  The remainder of the loop takes you through areas of mixed forest containing mountain ash and spruce.  You will skirt the coastline and pass the site of the old Pest House which was designated for those infected with Small Pocks during the epidemic in the late 1800's and early 1900's.  Finally, you reach the bridge spanning Chapel Gully; a nice spot to see crabs and other sea life found in the waters here.  From here it is a short walk back to the original trail fork and the trail registry.The Chapel Gully Trail is a wilderness hike and does a nice job of preserving a natural experience.  There are a number of bird and squirrel feeders along the way along with rest benches and viewing stations.  Pit toilets can be found at the start of the trail near the fork in the trail.  Fresh water can also be found here during the spring, summer and fall.Bicycles and motorized vehicles are prohibited on the trail.  All amenities can be found in nearby Canso.  The nearest phones are in residences near the trailhead.",
    "directions": "Take highway 16 (from highway 104 or from highway 316) into the town of Canso in Guysborough County.  Highway 16 turns into Main St.  Follow Main St. to Union St. Turn right onto Union St. and continue for ~1.2km, then turn right onto Wilmot Drive. If you follow the blue Marine Drive Ecotour signs to \"Gully Trail\" you should not get lost. There is a parking area located on the top of a hill. The parking area includes garbage cans, a picnic table and interpretive signage.",
    "geohash": "f8h9u",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/11128/reg_IMG-20190801-125318945[1]-63338.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11128/reg_IMG-20190801-130106530[1]-63338.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11128/reg_IMG-20190801-130723741[1]-63338.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11128/narrow_IMG-20190801-125153074[1]-63338.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/chapel-gully-coastal-trail-near-canso-ns-11128",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 5,
        "Time": "3 hrs",
        "Total Distance": "5 km",
        "Town": "Canso, NS",
        "Type": "out-and-back"
    },
    "title": "Chapel Gully Coastal Trail",
    "trail_id": "11128"
}