{
    "description": "Francais: On traverse toute l'estrie, durant cette rando on a l'occasion de croiser plusieurs autre parc et sentiers. Cela signifie que vous pouvez faire seulement une partie du sentier si vous ne voulez pas le faire en un seul coup.\nLe sentier vous mène à travers les plus beau sommet des appalaches. Le sentier débute près de la frontière des Ã?-U, près de Sutton et se termine à la riviere St-Francois a Kingsbury.\n Le sentier est entretenue par un organisme à but non-lucratif. Ils ont négocié des droits spéciaux pour laisser le sentier suivre son cours même sur des terrains privés. Assurez-vous d'avoir pris toute les information avant de partir.\nInfo\nEnglish:This trail crosses the whole Eastern Townships region. During this trip youwill cross many other parks and trails. This means that you can do parts ofthe trail if you don't want to do it in one shot.\nThe trail will bring you through the best summits of the Appalachianmountains.\nThe trail starts near the us border, near Sutton and ends near theSt-Francois river at Kingsbury.\nThe trail is being maintained by a non-profit organization. They havenegotiated special rights with private owners to let the trail follow it'scourse. This means you need to make sure that you are properly registered with the organization before taking the hike.\nYou can get more instructions at http://www.lessentiersdelestrie.qc.ca\nNOTE The attached track log only covers 6km, from Mt. Megantic summit South.",
    "directions": "Near Sutton, you can drive on the 139 until you reach the us border. You can ask permission to park your car at the customs.\nAnother option is to park your car at the Altitude 400 or 520 parking of Mont Sutton skiing facility.",
    "geohash": "f2j6",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/QC/1112/reg_sentierest3.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/1112/reg_sentierestjpg.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/sentier-de-lestrie-near-sherbrooke-pq-1112",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "70 hrs",
        "Total Distance": "150 km",
        "Town": "Sherbrooke, PQ",
        "Type": "out-and-back"
    },
    "title": "Sentier de l'Estrie",
    "trail_id": "1112"
}