{
    "description": "This is a one way chained collection of trails that allows you to do a one way traverse around the Calabogie Peaks Resort (closest main town is Arnprior but trails are at Calabogie ski resort area).It is a collection of:- Little Pine Path that takes you to the Eagles Nest (there's a GPX for this specific portion on the site)- Manitou Mountain Trail- Ascent- Portion of the Skywalk LoopDoing the trail in this manner requires two vehicles such that one of them can park to the trail head at the North West and another parks near the South East.  In this way you don't have to double back on yourself.  There is another GPX on this site that discusses Manitou Mountain Trail; however, that is is also a collection of trails that involve Bear Claw, Lost Valley Loop, Manitou and Wendigo Way.  Reference the PDF above for further clarifications.This trail will bring you to the Eagles Nest Lookout, Skywalk Loop Lookout, Manitou Mountain Lookout and a optional Red Arrow Rock Lookout if you follow the Long way instead of Short Way.More information:http://www.ottawavalley.travel/docs/manitoumountaintrailmap.pdf",
    "directions": "Two trail heads are involved with this hike.  One near the about 2Km from the Calabogie Peaks Resort on Calabogie road.  Parking the can handle several cars.  The second trailhead is located on Barrett Chute Road.  Trail head can accommodate approx three cars but there is additional parking along the road.  For the days trail conditions I'd recommend a quick chat with any of the local hikers at the Calabogie Peaks Resort on route.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/ON/11125/reg_DSC-23531-iPad-44684.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/11125/narrow_DSC-23595-iPad-44684.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/manitou-trails-near-arnprior-on-11125",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 3,
        "Time": "4 hrs",
        "Total Distance": "12 km",
        "Town": "Arnprior, ON",
        "Type": "out-and-back"
    },
    "title": "Manitou Trails",
    "trail_id": "11125"
}