{
    "description": "Mount Cochrane is one of the prominent peaks in Granby Provincial Park. No trail exists but it's relatively easy to navigate through the lower clearcuts into the alpine. Many views are available on the way to re-orient yourself. Cell service was also available for most of the hike. Good views with great wild flowers in early August. We started out through a short clearcut and descended down into Cochrane Creek. Note the return trip on the GPS takes you past a cool waterfall swimming hole. The creek was easily crossed on rocks and logs. From there you head generally up hill and will soon arrive at the first of many logging roads. If you don't have a GPS a printout of Google Earth maps would suffice to navigate up to the base of Cochrane. Several of the wooded areas between clearcuts were very thick brush with lots of blow-down. We opted to walk through the logged patch up the valley south of Cochrane. At the end of this clearcut just as you begin to start the real ascent is the last spot we found to easily get water. This stream was flowing at a good rate in early August and I'd be surprised if it dried up completely later in the summer. From this point on the walk thought the steep forest is spectacular. Huge old growth forest makes for nice shade  as you ascend the col with patches of beautiful grassy flowered areas interspersed. We saw signs of an old trail and markings on trees in this forest but any trail that may have been there had been reclaimed by nature and certainly wasn't necessary to find your way. Upon reaching the top of the saddle on the south slope of Cochrane you're rewarded with views of thick untouched forest and what I assume is Granby River valley below. One last steep push to the summit and that's it. The summit has a cairn with a sealed container to log your accomplishment. Our decent back into the valley was equally beautiful forest and rather uneventful. We were a bit too far northwest on one part and got back into some very thick forest so best to stick with the uphill path on the GPS with the exception of the swimming hole we stumbled upon near the truck. Our original plan was to also summit Mount Tanner but because of the gate blocking the road (read Directions to Trail Head) we were forced to improvise. This would be a very long hike and considering that you would likely need to pop back down into a valley for water would mean an overnighter would probably be best. Saw a moose, deer but no bear or bear sign. The area is known to be grizzly habitat. We did the trip in just over 6 hours with about 30 minutes in breaks on the ascent and 1 hour up top. We just had day trip packs.The GPS route includes 3 tracks. A shortcut over the mountains from Hwy33 to Christian Valley, Grano Creek FSR which takes you to 'trail head', and the hike itself.",
    "directions": "The obvious route to drive in to the start of the hike is easily navigable in a 2wd truck. 25.8km. Just follow Grano Creek FSR and stay on the main drag. We were forced to stop at a locked gate at Cochrane Creek (marked on GPS) and find an alternate route. The alternate route took us onto a logging road on the south side of Cochrane Creek which had several deep culverts dug out for drainage. If you can't cross these you'd be adding about an extra 1km of relatively flat terrain to either end of the hike. If you're coming from the Okanagan you may consider cutting off hwy 33 early at Trapping Creek and skipping the southerly trek to West Bridge. This route is included in the GPS track. It also offers some great Forest Service Rec Sites to camp at around Lassie and Cup Lake (free). Semi parallel to this route is Barth rd to the north which is worthy of a 2wd drive truck. It's slightly shorter but also rougher. Again it offers some great camp spots too.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/11120/long_Mount-Cochrane-East-Pano-with-Rainbow-small-35968.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11120/reg_2013-08-03-at-15-59-41-35968_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11120/reg_2013-08-03-at-16-01-27-35968.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11120/reg_2013-08-03-at-16-13-09-35968.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11120/reg_2013-08-03-at-17-00-39-35968.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11120/reg_2013-08-03-at-17-01-08-35968.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11120/reg_2013-08-03-at-18-55-39-35968.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11120/reg_2013-08-03-at-19-14-47-35968.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11120/reg_2013-08-03-at-19-18-01-35968.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11120/reg_2013-08-03-at-19-28-59-35968.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11120/narrow_2013-08-03-at-17-23-43-35968.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mount-cochrane-near-kelowna-bc-11120",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 4,
        "Time": "6 hrs",
        "Total Distance": "15 km",
        "Town": "Kelowna, BC",
        "Type": "out-and-back"
    },
    "title": "Mount Cochrane",
    "trail_id": "11120"
}