{
    "description": "This is a beautiful trail on Sunshine coast going through old forest. The overall grade for this trail is Moderate but you will go through a number of steep sections and lots of switchbacks. Our Trails app showed around 4KM to the top but according to the Sunshine Coast Trail markers (SCT), you'll be hiking about 6k each way. The trail is well marked and easy to follow with no snow on. Once at the top, you'll find an old shelter. You can continue and follow Cabin signs to see the new cabin (not sure how far it is from the shelter though).Unfortunately we've run into lots of fog and couldn't see all the beautiful views this trail has to offer, especially at the top where it opens up full 360 degrees!",
    "directions": "Once you are at the Saltery Bay ferry terminal, take first right on to Rainy Day Lake grovel road. Stay on it for about 7-7.2 kilometers and at the fork where main road will go left, take a right up the hill. You'll see trail entrance on your left, park your car just a few meters passed it where you can turn around. 4X4 with high clearance required to reach this spot!",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/11129/reg_IMG-6309-32434.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11129/reg_IMG-6310-32434.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11129/reg_IMG-6338-32434.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11129/reg_IMG-6353-32434_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11129/reg_IMG-6393-32434.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11129/reg_IMG-6395-32434.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mt-troubridge-near-campbell-river-bc-11129",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 4,
        "Time": "5 hrs",
        "Total Distance": "8 km",
        "Town": "Campbell River, BC",
        "Type": "out-and-back"
    },
    "title": "Mt Troubridge",
    "trail_id": "11129"
}