{
    "description": "Near Port Hawkesbury and a short bushwack lies a 40 foot waterfall seldom visited.  I wasn?t sure where the waterfall was located so I set off from a bridge over the stream and worked my way downstream.  The first few hundred metres are best to do away from the stream as the forest closest to the stream is a densely packed bunch of evergreens.  If you follow instead the boggy area, your feet will get wet but at least you will be clear of the brush.  The boggy area drains at the first waterfall ?a whopping 5 footer.   I was hoping for something bigger so I continued? After this first fall, the forest becomes more thin and easier to walk through although the slope can be steep at times.  You reach some kind of flat plateau and then you should be able to spot some flagging tape?if not just follow the sound of the roaring stream to the magnificent 40+ waterfall.  The river has carved a big chunk of rock on one side of the plunge pool and at times of low water it is easy to climb up and down the one side of the fall.On my way back I followed the flagging tape and it was an easy walk but it was leading me away from my truck so at one point I decided to cut across back to my vehicle and only had to navigate one small section of densely packed evergreen.    So either find the flagging tape route from the road or just follow my gps track?the one well away from the stream side?you?ll miss the five footer but it will be an easier bushwack",
    "directions": "Trans Canada highway from Port Hastings turn left on MacIntyre Mtn Rd and drive almost to the bridge over the Rough Brook",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/11138/reg_P1010004-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11138/narrow_P1010006-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/rough-brook-waterfall-near-port-hawkesbury-ns-11138",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "4 km",
        "Town": "Port Hawkesbury, NS",
        "Type": "out-and-back"
    },
    "title": "Rough Brook Waterfall",
    "trail_id": "11138"
}