{
    "description": "The hike to Welcome Pass is doozy: 2800 feet of elevation gain in 2.5 miles. And talk about switchbacks. There are more than sixty of them. But once you make the grade, Welcome Pass extends a warm benvenuti and a sincere invite to poke around on the wide open slopes of the divide, drinking fine views and savoring precious alpine moments.Consider the first mile a mere warm-up. Using an old logging road, the trail gently wanders out of the valley, gaining a leisurely 400 feet. Real trail then brings real work. Under a cool canopy of old growth, the way steeply switches and backs, gaining over 2300 feet in 1.5 miles. Once the daunting march is complete, daylight, spectacular alpine views, and dazzling floral show greet you at Welcome Pass",
    "directions": "From Glacier, travel east on the Mt. Baker Highway SR 542 approximately 11.5 miles from the Glacier Public Service Center at Milepost 45 and Forest Service Road #3060. Turn left (north) onto Road #3060. This road is not signed and is easy to miss. If you drive past it, continue to the Department of Transportation station, turn around and Road #3060 will be your first right. Welcome Pass trailhead and parking are 1.5 miles from the highway, at the end of Road #3060.",
    "geohash": "c29qq",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/WA/11132/reg_IMG-0131-s-9505.jpg",
        "https://trailpeak.com/storage//content/trails/US/WA/11132/reg_IMG-0186-s-9505.jpg",
        "https://trailpeak.com/storage//content/trails/US/WA/11132/reg_IMG-0187-s-9505.jpg",
        "https://trailpeak.com/storage//content/trails/US/WA/11132/reg_IMG-0196-s-9505.jpg",
        "https://trailpeak.com/storage//content/trails/US/WA/11132/reg_IMG-0199-s-9505.jpg",
        "https://trailpeak.com/storage//content/trails/US/WA/11132/reg_IMG-0203-s-9505.jpg",
        "https://trailpeak.com/storage//content/trails/US/WA/11132/reg_IMG-0204-s-9505.jpg",
        "https://trailpeak.com/storage//content/trails/US/WA/11132/reg_IMG-0210-s-9505.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/welcome-pass-near-sumas-wa-11132",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 5,
        "Time": "5 hrs",
        "Total Distance": "10 km",
        "Town": "Sumas, WA",
        "Type": "out-and-back"
    },
    "title": "Welcome Pass",
    "trail_id": "11132"
}