{
    "description": "This is a good little hike to a lesser known waterfall near Cheticamp.  Setting off on the Platin Rd?it quickly becomes rougher and wetter and better suited for either SUVs or ATVs or mountain bikes.  The trail will punch out of the forest and you will see the Fiset Brook on your right.  Continued uphill and then the trail become marked as a snowmobile/ATV trail.  The main branch of the trail goes to the left.  There are two fainter trails that turn right and towards the mountains.  Take the one on the left of the two trails?.the other one goes up steeply into the mountains.  Setting off on that trail you are immediately into an Acadian type deciduous forest?what a beauty with a high canopy and deep lush ferns all over the forest floor.  Soon the trail ends and you are left travelling beside the stream.  There is the remnant of an old mill of some kind and right afterward the falls begins.  Couple of true falls and a large cascading section makes this a wonderful place to visit.  At the top of the falls and into the rocky cleft are the remains of an old dame that  probably helped drive the mill you saw previously.  You will see from my GPS track that I decided to scale up the sheer walls of the valley attempting to get access to the other trail that was going up steeply.  Not for the faint of heart as it is very very steep.  I did make it up to the old trail and I wanted to see another fall on Fiset Brook which was probably along the same fault line as the one on Aucoin brook.  Unfortunately I ran out of time so I will have to get back to this area on another day.",
    "directions": "Cabot Trail to Cheticamp.  Turn on Cheticamp Back Rd and turn on Platin Rd.  Park where it becomes smaller and continue on it.",
    "geohash": "f8k9h",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/11141/reg_P1010029-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11141/reg_P1010034-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11141/reg_P1010036-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/aucoin-brook-waterfall-near-cheticamp-ns-11141",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "4 km",
        "Town": "Cheticamp, NS",
        "Type": "out-and-back"
    },
    "title": "Aucoin Brook Waterfall",
    "trail_id": "11141"
}