{
    "description": "This is a short hike on an established trail/ ATV track that leads you to a beautiful, secret swimming spot near Cheticamp.  The first part of the hike was on old roadway but it seems that in August 2013, they are building a brand new section of the trail from the Cheticamp Back Rd.  Either way take the trail towards the foot of the Highlands.  At the T intersection, you will see big outcrops of gypsum, you will kind of go straight through the intersection as the secret spot you want to get to is behind the sheer gypsum cliffs.The trail will ascend gradually and you will soon be rewarded with views of the gulf of St Lawrence.  There is no canopy cover for most of the trail so bring a hat.  At the top of the ridge you go in between two small hills and into the secret swimming spot: an old gypsum quarry.  There are sheer walls of gypsum on some side of the man-made lake and best of all a zip line in the middle of it when you want to go swimming.  The best aspect of this spot is that people leave it in pristine condition?.pack it in?pack it out.  Enjoy!  BTW I didn?t locate any openings (i.e. caves) ?let me know if you see something that looks promising!  also on a really sunny day, the gypsum outcrops in the water gives a turquoise color to the lake.",
    "directions": "Cabot Trail to Cheticamp.  Turn on Cheticamp Back Rd and park at trailhead ; 46° 37.782'N, 60° 58.864'W",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/11140/reg_image-49408_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11140/reg_P1010022-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11140/reg_P1010023-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11140/reg_P1010024-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11140/reg_P1010025-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11140/reg_P1010026-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11140/reg_P1010028-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/cheticamp-gypsum-quarry-near-cheticamp-ns-11140",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "4 km",
        "Town": "Cheticamp, NS",
        "Type": "out-and-back"
    },
    "title": "Cheticamp Gypsum Quarry",
    "trail_id": "11140"
}