{
    "description": "Two different hiking and biking trail in the National Forest just a mile or two North of Thompson Falls, MT.  This is a nice area and the trails are there but they ain't getting much love (or use).  There were multiple trees down and it was getting worse and worse, so I tried the other trail and it was kinda the same, so I pulled the plug.  I was on a mountain bike, hiking might've been more fun.Both trails were quite nice other than the downed trees, good tread and rideable in both directions (if you have the lungs, they were on the steep side (I climbed over 3300' (1000 m) in the 12 miles (20 km) I rode).  Lotsa switchbacks, especially on Mt. Silcox.If you look at the topos for the area, there are dozens of trails and many little lakes up there past Mt. Silcox so I think it would make a great multi-day backpacking trip and/or a point-to-point trip with a shuttle.Mount Silcox - Takes you up to some alpine lakes and potentially beyond.Sqaylth-Kwum - follows up Squaw Creek.Thompson Falls is a very nice town with a historic dam and power plant on the river immediately South of the town.  Cross the arch bridge onto the Dam lands.  There are biking trails and interpretive signs on the power plant 'island' and the trails are supposed to continue after you cross the second bridge onto the South shore of the river (I didn't get there).",
    "directions": "Cross the tracks on the North side of the highway in the middle of town and follow the signs up to the Forestry Office.  Keep going North to the Weber Gulch trail head (well signed).",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/MT/11159/reg_P1030294-Custom--6828.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/11159/reg_P1030296-Custom--6828.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/11159/reg_P1030297-Custom--6828.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/11159/reg_P1030302-Custom--6828.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/11159/reg_P1030395-Custom--6828.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/11159/reg_P1030403-Custom--6828.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/11159/reg_P1030411-Custom--6828.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/11159/reg_P1030419-Custom--6828.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/11159/reg_P1030420-Custom--6828.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/11159/narrow_P1030298-Custom--6828_best1_.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mount-silcox-headley-sqaylth-kwum-near-thompson-falls-mt-11159",
    "stats": {
        "Activities": "snowshoe hike mtn-bike",
        "From": "",
        "Seasons": "winter fall summer",
        "Stars": 2,
        "Time": "6 hrs",
        "Total Distance": "12 km",
        "Town": "Thompson Falls, MT",
        "Type": "out-and-back"
    },
    "title": "Mount Silcox - Headley / Sqaylth-Kwum",
    "trail_id": "11159"
}