{
    "description": "CBT Mainline is a newish trail in Golden that provides a totally rideable entry into the huge Moonraker trail system.  It is a buff, flowey route with enough technical features to make it interesting to advanced riders while still being suitable for beginners.  Well built bridges, berms and other bits of wood make it interesting, fun and safe.  There are some cliffs in the area and bright warning signs point out the places to watch.The entire Moonraker system is a great place to go and ride for as many hours as you wish.  There are miles and miles of well-signed, interlocking trails in there, you will likely want a local cycling map or a GPS to find your way out.  Parking at the CBT trailhead lets you stick to all paved roads with the car and is very easy to find.By the way: Columbia Basin Trust (CBT) was created in 1995 to support efforts by the people of the Basin to create social, economic and environmental well-being in the Canadian portion of the Columbia River Basin - the region most affected by the Columbia River Treaty.",
    "directions": "Take the road to Kicking Horse Resort, 400m past the single lane bridge across the river,  park in the lot on the West side of the road.  The trail leaves between the concrete blocks on the South end of the lot, cross the road and there is a trail maker right there.",
    "geohash": "c3hg",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/11158/reg_P1030541-Custom--6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11158/reg_P1030542-Custom--6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11158/reg_P1030545-Custom--6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11158/reg_P1030546-Custom--6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11158/reg_P1030549-Custom--6828.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/cbt-mainline-near-golden-bc-11158",
    "stats": {
        "Activities": "hike mtn-bike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "7 km",
        "Town": "Golden, BC",
        "Type": "out-and-back"
    },
    "title": "CBT Mainline",
    "trail_id": "11158"
}