{
    "description": "La station propose plus de 25 km de sentiers peu accidentés près du Lac St-Joseph.There is hiking in the summer (attached GPS), but it's also famous for it's exceptionally well maintained XC ski network totalling almost 50KM of classic and skate ski trails, including a new summit trail (3.5) km.  There are 4 warming stations on the ski network, a 4-star resort (pool for the kids), XC ski rentals, and if staying at this fantastic resort, the XC ski passes are free.I skied there after returning from Quebec Carnival, you get there heading back east from Quebec city towards Montreal, then it's just 30 minutes or so to Sainte-Catherine-de-la-Jacques-Cartier and the resort.  The attached GPS shows a hiking trail, which multiplies in winter to be an awesome ski network in pine highlands overlooking the lake.  These trails are very well groomed and maintained by SEPAQ.This is a first rate ski resort with exceptionally well maintained / groomed trails, where you've got a fairly good guarantee of having great snow as Quebec city gets a fair amount, certainly more than Ottawa, Toronto, and even Montreal.  I'd love to return and ski the whole ski network, including the new Summit trail, and, report on the XC skiing and snowshoeing.",
    "directions": "À partir de l'autoroute 40, il faut prendre la sortie 295 vers Sainte-Catherine-de-la-Jacques-Cartier. Après Sainte-Catherine, il faut prendre la montée et tourner sur la route Duchesnay, première à gauche. Continuer 2 km jusqu'à la Station à droite.Returning from Quebec city, take #40 towards Montreal, and, then take exit 295 and head to  Sainte-Catherine-de-la-Jacques-Cartier. It's not more than an hour from Quebec city, a great place to stop in for a day ski or a few days if in the Quebec city area.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/QC/11157/long_resort-over-lake-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/11157/long_widelake4-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/11157/reg_junction4-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/11157/reg_number4tolake-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/11157/reg_skitrail4-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/11157/reg_xcskicenter-5.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/duchesnay-lac-jaune-near-quebec-pq-11157",
    "stats": {
        "Activities": "hike ski-xc",
        "From": "",
        "Seasons": "summer",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "50 km",
        "Town": "Quebec, PQ",
        "Type": "out-and-back"
    },
    "title": "Duchesnay - Lac Jaune",
    "trail_id": "11157"
}