{
    "description": "Donna's Rating - Moderate to Difficult Scramble/RidgewalkModerate valley hike to a difficult scramble/ridge walk in Kananaskis, but so rewarding with views of Spray Lake, Shark Lake, Commonwealth Lake, creeks, valleys, etc. We loved it, albeit the scramble sections were pretty intense, especially if one is afraid of heights! Elevation is about 1000 metres, for a 10.8 km total loop from the parking lot. Recommend taking the trailhead about 100 m before the pull out/parking area. To go the other way would be super scary coming down the steep and narrow cliffside scramble past the weather station.You have maybe 3 km in the forest before you start to see Spray Lake reservoir and some peaks. The flowers were fantastic! Then, you get to the ridge and scramble up a narrow, steep section to the first peak. Take very good care - a fall would be fatal. You'll then walk up to the weather station and up 'n down the ridge for most of the rest of the hike. It was wonderful with many stellar viewpoints all around!Exposure on the ridge can be extreme -- we got caught in a summer storm (July 13, 2015) high winds and temperature dropped to 3C so be prepared.  There is a little bit of scrambling on the horseshoe on the way down (heading north on the west side). Then, the trail switch backs down to the valley floor and more stellar wild flower displays on the way back to the parking area. Stay on the main trail keeping left down into the valley. When you get to the fire road, go right and follow back to the main road and parking area. Bring bear spray -- saw two clumps of fresh scat on the trail.Took us 5 hours but we were slow over the scrambles and stopped for a lunch at the summit. Would recommend that trail to anyone who is a fairly experienced hiker, it's very accessible and so beautiful!!!*note*This hike is not easy, those in great shape and advid hikers may call it easy but there are sections of this hike that can be quite dangerous depending on your skill level. If planning on traveling ridge east to west, the route coming down on the west has multiple trails -- keep to the well traveled path to get back to the road.",
    "directions": "From Canmore, you take Spray Lake Rd (742) and go pass the reservoir, then, you have few km to do and there will be a road on you're right, where the Mt Engadine lodge is located, turn there and keep going about 1-2 km, until you see that roadside who's an improvised parking lot. Take the first trailhead was just before the parking  It's about 50-60 minutes from Canmore.",
    "geohash": "c3jc",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/11151/long_Spray-Lakes-Valley-24991.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11151/reg_IMG-0060-52444.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11151/reg_IMG-0063-52444.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11151/reg_IMG-0064-52444.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11151/reg_IMG-0066-52444.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11151/reg_IMG-0067-52444.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11151/reg_IMG-0069-52444.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11151/reg_IMG-0072b-24991.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11151/reg_TentRidge-Kananaskis-Aug13-3--44639_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11151/reg_TentRidge-Kananaskis-Aug13-4--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11151/reg_TentRidge-Kananaskis-Summit-Aug13-4--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11151/reg_TentRidge-Kananaskis-Summit-Aug13-6--44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/tent-ridge-near-kananaskis-ab-11151",
    "stats": {
        "Activities": "snowshoe hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 5,
        "Time": "5 hrs",
        "Total Distance": "11 km",
        "Town": "Kananaskis, AB",
        "Type": "out-and-back"
    },
    "title": "Tent Ridge",
    "trail_id": "11151"
}