{
    "description": "The Wave. It's gorgeous - A hiking permit is a must. Once you get a permit, you will get an excellent guide how to go to \"The Wave\". The guide is given by Grand Staircase-Escalante National Monument Visitor Center in Kanab, 745 E. Highway 89, Utah. If it was open for all tourists, the delicate stone would be worn away within a couple of years. Every nature photographer wants to shoot \"The Wave\".  The Wave is located on the Colorado Plateau, near the Utah and Arizona border.For guided hiking trips in Arizona: See AOA-adventures.",
    "directions": "From Kanab(Page), drive 40 miles east(west) on Highway 89. The turn onto House Rock Road is located on the right(left) side of the road. It is located between mile markers 25 and 26.(comming from Kanab)Continue House Rock Road 8.3 miles to the Wire Pass Trailhead parking lot, located on the right side of the road. Display your parking permit in your windshield.The Wave Route At wire pass, walk across the House Rock Valley road, to the east, and locate the hikers path. Soon the path drops into a wash. Walk down the wash (east) for .6 miles. Hiking becomes steep for the next few hundred yards. Most important landmark to locate the Wave : Vertical Crack or Notch.",
    "geohash": "9w86",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/AZ/11150/long_20120523-0952-The-Wave-CBN-06-40318.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/11150/long_20120523-1013-The-Wave-CBN-10-40318.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/11150/long_20120523-1031-The-Wave-CBN-18-40318.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/11150/long_20120523-1035-The-Wave-CBN-24-40318.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/11150/long_20120523-1309-The-Wave-CBN-59-40318.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/the-wave-near-page-az-11150",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "5 hrs",
        "Total Distance": "10 km",
        "Town": "Page, AZ",
        "Type": "out-and-back"
    },
    "title": "The Wave",
    "trail_id": "11150"
}