{
    "description": "Considered to be an 'easy' scramble but 'difficult' hike, depending on your skill or fittness level this trip will take roughly 6-9 hours (round-trip). Within half an hour from the trailhead, the Mount Sparrowhawk hike will afford you excellent views of the Spray Lakes valley.?Height: 3,121 m (10,240 ft)?Elevation Gain: 1,415 m (4,643 ft)?Distance: 10.0 km / Round TripFrom the trailhead, the trail is a steady and fairly steep climb through forest. About 10-15 mins into the hike the trail levels off slightly and you will reach a small clearing with two forks that is marked with a large pile of rocks, some scratched trees and possibly some blue ribbon-tape tied to the trees. From here, take the left fork. (The right fork leads to the Sparrowhawk Tarns which is an easier but very different hike). Continue climbing up fairly steep forested trail and begin to gain views of Read's Tower straight ahead. Eventually, at treeline, the trail levels off again as you reach the top of the spine you've been climbing and you are now immediately beneath Read's Tower*. Mount Sparrowhawk is now clearly visible up and to the left of Read's Tower. From here, you are now only 1.8km from the peak but you have many meters of elevation left to gain. The trail is now faint and lightly trod into the grass. Descend slightly to the left and then begin to follow the lightly beaten trail back up towards Mount Sparrowhawk. Very quickly you will leave the grass and from here you are scrambling and there is no longer an apparent trail, but the route is quite simply \"up\". Keep travelling up and generally toward the pass that is just right of the peak. Depending on the season you may begin encountering snow so gaiters are recommended. Reach a weather station in the pass and gain stunning views of the valley below. From here you can scramble up the rest of the way to the top of Mount Sparrowhawk. *You can opt to hike Read's Tower instead if you are feeling tired (or as well in the same day if you are feeling ambitious). Instead of descending down to the left towards Mount Sparrowhawk you can descend down to the right then follow the lightly beaten, fairly obvious trail up Read's Tower.",
    "directions": "From Canmore follow the signs to the Canmore Nordic Centre, up the hill. From the Nordic Centre turn off, reset your odometer to 0 and travel 22.7km along the Smith-Dorrien/Spray Lakes gravel road and park in the Sparrowhawk day-use area on the right. The trailhead is just across the road from the parking lot. You will see a well-trod trail (just north of the creek) leading uphill into the forest, though there is no \"official\" trailhead or signage for this hike.",
    "geohash": "c3",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/11160/long_20160813-095108-PANO-55837.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11160/long_20160813-114109-PANO-55837.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11160/reg_1149008-935881020977-1139611535-n-30551.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11160/reg_556325-935880621777-832899360-n-30551.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11160/reg_DSC05755-30551.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11160/reg_IMG-2788-PANO-47626.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11160/reg_Mt-Sparrowhawk-Kananaskis-Jul-20-2014-21--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11160/reg_Mt-Sparrowhawk-Kananaskis-Jul-20-2014-3--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11160/reg_Mt-Sparrowhawk-Kananaskis-Jul-20-2014-31--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11160/reg_Mt-Sparrowhawk-Kananaskis-Jul-20-2014-8--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11160/reg_Sparrow-30551.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11160/reg_Sparrow2-30551.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11160/narrow_Mt-Sparrowhawk-Kananaskis-Jul-20-2014-16--44639_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11160/narrow_Mt-Sparrowhawk-Kananaskis-Jul-20-2014-22--44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mount-sparrowhawk-near-canmore-ab-11160",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 5,
        "Time": "7 hrs",
        "Total Distance": "10 km",
        "Town": "Canmore, AB",
        "Type": "out-and-back"
    },
    "title": "Mount Sparrowhawk",
    "trail_id": "11160"
}