{
    "description": "Edwards Rating: III (III) M MExcellent scrambling trail to do, very steep and hard on the 2 scree slopes and a couple of walls beside the fall that are very accessible hands on scramble. Great elevation gain of 1130 m with max elevation of 2976 m. I made a mistake on my way up though and it could have been fatal, I was lucky as I am not a climber yet, just an intermediate scrambler. Instead of staying close to the right most of the way after the second scree slope (many websites and Alan's book explains that well), I climbed into a gully in the middle of the wall going all the way up to the col of Mt Whyte-Mt Niblock. After that gully, I looked down to realize it was too technical, with too much scree and big walls with loose rocks everywhere, but I felt like I could not down climb at this point. What took me 1h30 of \"climbing\" without equipment in the middle of the wall... took 25 minutes to go down the RIGHT path, an easy-moderate scree trail with 2 walls very easy to climb down... It is almost right under the base of the summit when looking up from the second scree slope and you have to go around a big rock (the base in orange, you should see it easily), it seems really obvious...now. Take your time, watch for the trail way before you get to the base of the col, so you can see where you're heading. There is some exposure as well from the col to the summit, but again, be careful and make sure you go to the summit using the right trail, on the other side of the mountain at this point. Some people seem to walk the ridge all the way up, but it can be extremely narrow sometimes.",
    "directions": "From Chateau Lake Louise, take the trail to Lake Agnes. Once you arrive at the tea house, take the path on the right side to go at the other end of the lake. Then, you'll see the scree slopes and the walls right in front of you with the col you gotta get to and with Mt Niblock summit on your right. Trail is not always obvious from there, so have a look to where you're heading from a great distance to better find your way up without unnecessary risk.CAUTIONARY NOTE; Attached GPS DATA shows the WRONG path DOWN to lake Louise, as I did Mt St Piran right after Niblock, cutting that second col horizontally in the grassy slope. Follow this GPS data to the peak at Niblock, then just retrace your steps (the way down is pretty much the same as up), by Lake Agnes trail so as to avoid the additional route up Mt. St. Piran (similarly on the way up -- take note).",
    "geohash": "c3jk",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/11169/reg_Mt-Niblock-First-walls-Lake-Louise-Aug-13-6--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11169/reg_Mt-Niblock-Summit-Lake-Louise-Aug-13-2--44639_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11169/reg_Mt-Niblock-and-St-Piran-Agnes-Lake-Louise-Aug-13-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11169/narrow_Mt-Niblock-Crazy-exposure-Lake-Louise-Aug-13-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11169/narrow_Mt-Niblock-First-Walls-Lake-Louise-Aug-13-3--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11169/narrow_Mt-Niblock-Lake-Louise-Jul-26-2014-1--44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mt-niblock-near-banff-ab-11169",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 5,
        "Time": "7 hrs",
        "Total Distance": "13 km",
        "Town": "Banff, AB",
        "Type": "out-and-back"
    },
    "title": "Mt Niblock",
    "trail_id": "11169"
}