{
    "description": "This is a long ride or hike of the Outer rim of Lac du Bois above Bachelor Heights in Kamloops. It uses a combination of little used and regularly used trails.",
    "directions": "Travel up Bachelor Heights and onto the Lac du Bois road. Between the 3km and 4km markers, you will find a road on the left in a large open area and dry pond. Park at Gate #1 and proceed up the road. Continue up the road and hill and enter through gate #2. Once you get to the top, you will travel along a flat area until you come to the intersection of another road. Go left on this road and enter through gate #3. Just past the gate you will see some fence posts in the ground. Just before that and to the right, there is a trail. Take that trail and continue up until it intersects a road. You can cross the road and continue on the trail, but is is covered in roads and not much used. I recommend continuing up the road and taking the trail to the left at this point. This is the same trail, but  in better condition.Continue up the trail staying mostly to the left. The trail ends at a road, take the road to the left. Follow the road for a short distance and then take the defined trail to the left. Go down this trail until you come to gate #4. At gate #4, you can continue down the trail, but if you are a hiker or non-technical biker, I recommend the road. The trail goes through several steep gullies and is very difficult for hikers to know when a biker is coming down. The trail and road join again further down. Look for a fence corner on the left with the trail going around it. This trail runs along the fence and you are heading in the direction of the Microwave Tower hill. Continue on this trail until it joins with the trail going around the Microwave hill.If you have reached the end of your endurance, take the left trail and you will shortly be back at your start. Otherwise keep going straight then take the right trail. This trail will join up with a road. Go left and continue until you come to an intersection of roads. Stay right and the road goes down a hill. Just about the bottom of the hill you will see the trail on your left. You can take either the road or the trail, but the trail is more interesting. Continue on the trail which crosses the road several times. Eventually the trail starts to climb and you cross 3 ravines. Keep going until you see the rock quarry.  Take the trail to the left which climbs towards the hill. The trail connects with the road so keep going straight up the road. At the second left trail, proceed down it.You will now be heading towards the microwave tower. Continue on this trail until just before the cattle guard. This is your last chance to phone someone for a ride before heading up the hill. To continue take the trail to the left and continue to the road. Take a left on the road and then a right when you get to the trail. Continue up the hill to the top then take the trail to the right to go down the other side. When you get to the bottom go right to get back to your car.My stats:Total hike time: 3 hoursTotal Ascent: 404 metresTotal descent: 406 metersAverage pace: 4.5 km/h",
    "geohash": "c342",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/11162/reg_DSC00030-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11162/reg_DSC00031-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11162/reg_DSC00032-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11162/reg_DSC00033-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11162/reg_DSC00034-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11162/reg_DSC00066-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11162/reg_DSC00067-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11162/reg_DSC00068-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11162/reg_DSC00069-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11162/reg_DSC00070-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11162/reg_DSC00071-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11162/reg_DSC00072-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11162/reg_DSC00073-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11162/reg_DSC00074-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11162/reg_DSC00076-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11162/reg_DSC00077-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11162/reg_DSC00078-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11162/reg_DSC00079-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11162/reg_DSC00080-5599.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/lac-du-bois-long-near-kamloops-bc-11162",
    "stats": {
        "Activities": "mtn-bike",
        "From": "",
        "Seasons": "winter fall summer",
        "Stars": 4,
        "Time": "4 hrs",
        "Total Distance": "13 km",
        "Town": "Kamloops, BC",
        "Type": "out-and-back"
    },
    "title": "Lac du Bois Long",
    "trail_id": "11162"
}