{
    "description": "Nice trail totalising 32.3km. The trail is muddy, has obstacles such as rocks and trees that need to be negotiated. Despite that it's not too technical.\r\n\r\nWhen it comes to evaluating difficulty, I am always a bit confused. I wouldn't bring kids on this hike because of the cliffs. And the elevation can be a bit hard for somebody with no experience. Despite that, I found the trip pretty smooth and really worth the effort!\r\n\r\nCamping site available.\r\n\r\nMaps available on site\r\n\r\nTo do the 32,3km, you need to follow the \"Mont 107\", \"Pinède\" and \"le Sommet\" trails.\r\n\r\nIf you don't have the time to complete the whole trail, you can do a shorter 1 day hike by doing the trail number 1 then number 6 and finally number 2 for a total of 7km.\r\n\r\nAttractions:\r\n Nice view\r\n Lakes\r\n Limes forest\r\n Windfallen wood\r\n\r\nJoli sentier boucles totalisant 32,3 km. La piste a offert plusieurs obstacles dont de la boue, des roches et des arbres tombés.\r\n\r\nJe suis toujours embêtté lorsque vient le temps d'évaluer la difficulté d'une piste. Sur ce sentier, je n'amènerais pas d'enfants en raison de l'escarpement du sentier ainsi que des falaises. De plus, la dénivellation peut demander un effort éprouvant pour un débutant. Malgré ceci, le sentier vaut l'effort en raison de la vue sur la forêt.\r\n\r\nPossibilité de camping rustique\r\n\r\nCartes disponibles à l'entrée du sentier.\r\n\r\nAfin de compléter les 32,3km, il faut suivre les sentiers suivants:le Mont 107, la Pinède et le Sommet. \r\n\r\nSi vous n'avez pas le temps de faire tout ce sentier, vous pouvez planifier une journée et faire une plus petite boucle de 7km en suivant le sentier 1, le sentier 6 puis le sentier2.\r\n\r\nAttraits : \r\n  Point de vue \r\n  Lacs \r\n  Forêt de tilleul \r\n  Chablis (foret écrasée par les vents).",
    "directions": "You can access the trail through either the Grande-Vallée entrance of the parc or the Entrelacs entrance.\r\nThe Grande Vallée entrance can be reached by taking the 31 then the 34, then the 348 to Rawdon. Then the 341, the 125 till Grande Vallée. The Parking is on Paquerette street.\r\n\r\n\r\nAccessibilité au sentier par les Entrées Grande-Vallée et d'Entrelacs. Prendre la 31 puis la 343 au travers de Joliette. Puis prendre la 348 vers Rawdon, la 341 puis la 125 jusqu'a Grande Vallée. Le stationnement est sur la rue Paquerette.",
    "geohash": "f25q",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/QC/1117/reg_grandevalleeJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/1117/narrow_grandevallee2JPG.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/sentier-grande-vallee-foret-ouareau-near-joliette-pq-1117",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "14 hrs",
        "Total Distance": "33 km",
        "Town": "Joliette, PQ",
        "Type": "out-and-back"
    },
    "title": "Sentier Grande-Vallée (Foret Ouareau)",
    "trail_id": "1117"
}