{
    "description": "This is a very short hike but what it lacks in distances makes it up in the destination; a gorgeous two tier waterfall with the lower one looking suitable for some jumping!Leaving the main dirt road, you enter the mature conifer forest on a well-established path.  It almost looks like people are using the path with some ATVs as well.  The trail is near the stream and looking at it you would not expect any significant waterfall nearby.  After only a few minutes you hear the waterfalls and then you enter a rocky outcrop with a view on the upper waterfall.  You can walk along the outcrop to its conclusion where you will spot the next waterfall which drops right into a large circular pool.  On the opposite side of the fall there is a large carved out area in the rock.  You can continue into the woods on a trail which will take you around the side of the pool and to an area where you can actually climb down to the water?s edge.  Lots of rocks at the bottom to take a break and admire this special place.  Not sure about the depth of the pool but there is a lot of rocky ledges bagging to be jumped from.",
    "directions": "Highway 105 in Woodstock, drive south towards Grafton and turn left on Upper Killmarnock Rd.  Drive a while until you get to a major river crossing at  46° 5.523'N, 67° 29.519'W.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NB/11175/reg_DSC-0082-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/11175/reg_DSC-0087-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/11175/reg_DSC-0091-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/11175/reg_DSC-0101-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/11175/reg_DSC-0103-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/11175/reg_DSC-0107-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/11175/reg_image.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/11175/narrow_image.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/gibson-creek-fall-near-woodstock-nb-11175",
    "stats": {
        "Activities": "snowshoe hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "1 km",
        "Town": "Woodstock, NB",
        "Type": "out-and-back"
    },
    "title": "Gibson Creek Fall",
    "trail_id": "11175"
}