{
    "description": "I set off on the old logging road across a rickety bridge, which takes you on the opposite directions of the falls but ultimately bring you around to the upper reaches of the stream where the falls are located.  As far as logging road goes this one is pretty typical.  Not a lot of shade and small trees on either side of you.  When you finally reach the stream, you can witness a 15ft high beaver dam..pretty impressive but don?t stand downstream the day it lets go!Travel downstream on the side of the stream and you come up to a series of waterfalls.  In August when I visited, the water was slow and so the falls were not as impressive.   This would be a better hike in times of high water.  Nonetheless I made my way down the stream and saw the moss covered waterfalls on my way.  Just when the stream flows back into the Philip River, I saw a well used ATV track.  I followed going upstream by the side of the Philip River and low and behold it actually brought me right back to my car.  ARGHHHHHH!  I had bushwacked and took a longer route to see those falls and all I had to do was to follow that ATV track that I did see in the beginning.  Lesson learned; I should have trusted my instincts and followed the ATV track which can be found on the right just before the rickety bridge?",
    "directions": "In Oxford, take Wyvern Rd towards Wyvern and continue up this road, up the cobequid Hills and turn right on a dirt road located at  45° 32.554'N, 63° 56.288'W",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/11176/reg_DSC-0112-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11176/reg_DSC-0117-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/wyvern-waterfalls-near-oxford-ns-11176",
    "stats": {
        "Activities": "snowshoe hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "5 km",
        "Town": "Oxford, NS",
        "Type": "out-and-back"
    },
    "title": "Wyvern Waterfalls",
    "trail_id": "11176"
}