{
    "description": "This route doesn?t have a lot of trails and was explored in an attempt to find a route down from Mara Mountain Cliffs South. The view from the summit is good, but not as ranging as from Mara Mountain Cliffs South. I was hoping to provide a route for bikers to do a loop from the cliffs, but there is a deep ravine between the two that would be hopeless to use a bike on. The route is a mid range sort of hike and the climb isn?t as extreme as it is on Mara Mountain Cliffs South. Because there isn?t a lot of trails and a lot of people haven?t been able to find their way, I have marked the route with orange ribbon and over time, I expect a trail will be established now that people will be following the same route.",
    "directions": "From North Kamloops, travel up Bachelor Heights up to Lac du Bois Rd. Just past the 5km marker, you will cross over a cattle guard. After crossing, take an immediate left turn. Travel 2.5km and you will come to a gate and sign warning ?No Trespassing?.  Parks have confirmed that the sign was Grandfathered from 1996 before the Park existed. The actual private property on the East side, doesn?t start for 600m up the road, so you are fine to go through the gate. As soon as you go through the gate, take the path to the left and look for the orange ribbons I have marked the trail with. There is a path for the first stage to just short of a pond. There are deadfalls on the trail and you will have to make your way around them.  The pond area is an old settlement area and used to have a building. Go to the left of the pond and continue to follow the orange ribbons. You will come to an open grass area and the ribbons continue about mid way and to the right. There is a bit of a trail to follow and then it disappears again. The ribbons continue up to the summit and allow you a view of the cliffs and some of the valley. Having said that, I encourage all persons to use caution when using the routes crossing these roads. Trailpeak assumes no liability for anyone accessing this area and each person should confirm their rights with BC Parks and the BC Forest Service.My stats:Total distance: 6.6kmTotal time: 3:03Moving time: 2:18Average pace with marking: 2.7kmTotal ascent: 386m",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/11184/reg_DSC00179-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11184/reg_DSC00180-5599_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11184/reg_DSC00181-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11184/reg_DSC00182-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11184/reg_DSC00183-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11184/reg_DSC00184-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11184/reg_DSC00185-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11184/reg_DSC00186-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11184/reg_DSC00187-5599.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mara-mountain-summit-east-near-kamloops-bc-11184",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 3,
        "Time": "3 hrs",
        "Total Distance": "7 km",
        "Town": "Kamloops, BC",
        "Type": "out-and-back"
    },
    "title": "Mara Mountain Summit East",
    "trail_id": "11184"
}