{
    "description": "This is a relatively flat route that visits 3 ponds in the Lac du Bois Grasslands. The first half is flat and about half way there is a steep hill, but it isn?t that long. After that it is gentle rolling hills. The best time to hike this route in in the spring and early summer. The ponds are filled with water and hundreds of ducks of a wide variety of types. Also because the last half doesn?t get that much traffic, the grass tends to get quite tall and hides holes in the path in later summer and fall. It is still useable, you just have to take your time and watch your step.",
    "directions": "From North Kamloops, travel up Bachelor Heights up to Lac du Bois Rd. Just past the 5km marker, you will cross over a cattle guard. After crossing, take an immediate left turn. Travel 2.45km and you will see a ?No Motor Vehicle? warning sign and a concrete barricade on your left.  Depending on the time of the year, the grass may be hiding most of the concrete barrier. You can either park here or continue down the road another couple of hundred meters and park at the gate where you are going to come out and walk back to the trail head.Most of the route is via old roads. Start down the road and you will come to the first pond on your right. Continue around the left side of the pond and over a small hump, where you will see the second pond below you. Continue on the road to the right of the pond. After a bit you will come to a fork in the road. Take the right up a short rise. Go through the gate and just on the other side, you will see several fence posts in a group. Between the posts and the gate you will see the trail going up the hill to the right. Continue up the steep path and when you get to the road, turn right up the road. You could continue across to the trail, but it is rough. Continue up the road a short distance and take the trail to the left. Follow the trail until a road on the right joins it. Continue on the trail/road until it splits again. Go straight and you will come to a gate. Go through the gate and continue on the road. As mentioned, the road is little used and is covered in tall grass (depending on season of the year) so take your time. Continue on the road until you see the third pond on your right. As you continue down the road, you will come to a large open area covered in very tall grass. Cut across the clearing at about a 45 degree angle upwards direction. You are heading for the bottom of a low hill on the right. Follow the contour of the hill to the North without climbing over or onto the hill. Eventually you will come to the road and gate as mentioned.  Go right on the road and in a short distance you will be back at the start.My statsTotal distance: 4.3kmTotal time: 1:05Moving time: 58 minsAverage speed: 4.3km/hAscent: 98m",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/11187/reg_DSC00189-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11187/reg_DSC00190-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11187/reg_DSC00192-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11187/reg_DSC00193-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11187/reg_DSC00194-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11187/reg_DSC00195-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11187/reg_DSC00196-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11187/reg_DSC00197-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11187/reg_DSC00198-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11187/reg_DSC00199-5599_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11187/reg_DSC00200-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11187/reg_DSC00201-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11187/reg_DSC00202-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11187/reg_DSC00203-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11187/reg_DSC00205-5599.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/3-pond-loop-near-kamloops-bc-11187",
    "stats": {
        "Activities": "snowshoe hike mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "4 km",
        "Town": "Kamloops, BC",
        "Type": "out-and-back"
    },
    "title": "3 Pond Loop",
    "trail_id": "11187"
}