{
    "description": "Starting from the junction at 4.6 km on Airplane Creek Road, hike up the side road to the right. Although it's possible for a rugged vehicle to drive this section, the road is beginning to become overgrown and may cause paint damage. As the road makes a sharp turn to the right 250 meters later, turn left on what remains of an ancient, extremely overgrown road. The junction is easy to miss. If you're heading down a narrow \"tunnel\" of slide alder growing over an old roadway, you're on the right track. Thankfully, the nasty mess growing over the road only lasts for less than one kilometer before conditions improve, opening up as the road gains in elevation and allowing for unrestricted travel.The trail is nicely marked so you should not have problems following the markers.",
    "directions": "Follow Highway #1 (Trans-Canada Highway) to Chilliwack, taking Exit  #119 South. Follow Vedder Road until a three-way stop just before a bridge over the Vedder River. Zero your odometer here and turn left at the stop sign onto Chilliwack Lake Road. At the 28 km mark and immediately after one of the Chilliwack River bridge crossings, turn left onto Foley Creek Forest Service Road. Zero your odometer again here.Follow the forest service road for 2.0 km to a T-junction, located immediately after a bridge over Foley Creek. Turn right here on to Foley  Creek Forest Service Road. Drive north-east another 2.4 km past the T junction and turn left on to Airplane Creek Forest Service Road, the start  of which is a gated bridge.Reset your odometer at the start of Airplane Creek Road and follow it  north, ignoring a branch road on the right a few hundred meters later. At  2.1 km, continue following the road straight and don't take the branch  road that curves sharply uphill to the left. After a total distance of 4.6 km from the gate another junction is reached, with the main road continuing straight to a dead end and a partially overgrown road leading uphill to the right. Park here, on the side of the road near the junction.",
    "geohash": "c29",
    "photos": [],
    "source_url": "https://trailpeak.com/trails/mt-laughington-near-chilliwack-bc-11197",
    "stats": {
        "Activities": "snowshoe hike",
        "From": "",
        "Seasons": "winter fall summer",
        "Stars": 4,
        "Time": "5 hrs",
        "Total Distance": "11 km",
        "Town": "Chilliwack, BC",
        "Type": "out-and-back"
    },
    "title": "Mt Laughington",
    "trail_id": "11197"
}