{
    "description": "The north coast of PEI is known for its beautiful sand dunes and beaches but there are a couple of spots where sandstone formations meet the sea and if you are really lucky a natural arch can be created under certain conditions.  This hike leads you past large sand dunes to such an area.I was told of this place by a local resident of Kensington.  They sent us to a place called Thunder Cove. Setting off from the road on the right hand side are magnificent sand dunes.  Cutting to the left, the sandstone cliffs begin immediately and within a few metres you start to see some carving of the sandstone into pillars and small sea caves.    The  prize of this hike is just beyond the furthest you can see along the cliffs.  At the corner there are multiple sea caves and I had to scale halfway up the cliff because the tide was reaching all the way to the base of the cliffs.  Right after the corner you will see the natural arch and right offshore is a lone sea stack.",
    "directions": "From Kensington, highway 20 towards Darnley . Turn left on Lower Darnley Rd and right on Thunder cove Rd.  Park at the 90 degree turn at the beach.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/PE/11192/reg_DSC-0018-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/11192/reg_DSC-0011-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/11192/reg_DSC-0014-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/11192/reg_DSC-0016-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/11192/reg_DSC-0025-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/thunder-cove-arch-aka-the-tea-pot-near-kensington-pe-11192",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "2 km",
        "Town": "Kensington, PE",
        "Type": "out-and-back"
    },
    "title": "Thunder Cove Arch; aka the tea pot",
    "trail_id": "11192"
}