{
    "description": "\"Located in the Promontory neighbourhood of Chilliwack, the steep hike up Mount Thom is rewarded with a scenic view of the region, including Cultus Lake and the Fraser Valley.There are 2 options for hiking up Mount Thom, including parking at the Sylvan Drive trailhead and completing the entire trail to the top. The other, more family-friendly option is to park near the top and just do the short Lookout Loop. While the trail climbs uphill for the most part, there are short ups and downs along the route. Continue to follow the narrow trail as it wraps around the mountain and eventually reaches a junction with the Lookout Loop Trail. Go right and continue walking uphill for another 10 - 15 minutes until you reach the viewpoint at the top of Mount Thom.",
    "directions": "From Vancouver, drive east and onto Highway #1 (Trans Canada Highway) heading eastbound. Continue driving through Burnaby, across the Port Mann Bridge, through Surrey, Langley, Abbotsford, until you reach Chilliwack. Take Highway Exit #123 and after exiting, turn right at the top of the off ramp onto Prest Road.Continue driving south along Prest Road as it turns into Teskey Way. Turn left onto Jinkerson Road and then make another quick left to stay on Jinkerson Road. Take the first right onto Thom Creek Road and drive to the stop sign at the top. Turn right onto Sylvan Drive and park on the road along the trees. The trailhead is on the other side of the street at the wooden stairs.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/11195/reg_MT-THOM--47054.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11195/reg_mt-thom-cultus-47054_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11195/narrow_mt-thom-me-47054.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mt-thom-near-chilliwack-bc-11195",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "3 hrs",
        "Total Distance": "10 km",
        "Town": "Chilliwack, BC",
        "Type": "out-and-back"
    },
    "title": "Mt. Thom",
    "trail_id": "11195"
}