{
    "description": "Coyote Crossing is a series of trails between Valleyview and Juniper. There is a varied bunch of trails you can take, but most are up higher and in a lot of cases, a steep climb up different hills. If you are riding and have poor balance or don?t like heights, you may want to try some of the lower trails as there are some drop offs along the trails higher up. There is a combination of grasslands and forest and even is also a platform higher up for the best view.",
    "directions": "From Kamloops travel on the Trans Canada East and take the Highland Dr. exit. This is the road to Juniper. After going through the four way stop, continue up about one block until you see the sign for the Valleyview Arena on the left. The lower road is the exit so continue up a bit to the entrance.Park in the lot and either take the trail to the left that has the big sign, or if you want a bit more gradual climb, go to the back of the arena and in the left corner go around the white gate. Travel up this path a bit then take the path to the right, that goes up the ravine. This is the easiest access for bikes as well, as the other path has some very steep hills to push your bike up. My GPS route shows only a small portion of the trails and there is lots to explore.  For the most part, the trails I hiked were well marked.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/11190/reg_DSC00206-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11190/reg_DSC00207-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11190/reg_DSC00208-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11190/reg_DSC00209-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11190/reg_DSC00210-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11190/reg_DSC00211-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11190/reg_DSC00212-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11190/reg_DSC00213-5599_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11190/reg_DSC00214-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11190/reg_DSC00215-5599.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/coyote-crossing-near-kamloops-bc-11190",
    "stats": {
        "Activities": "hike mtn-bike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "3 km",
        "Town": "Kamloops, BC",
        "Type": "out-and-back"
    },
    "title": "Coyote Crossing",
    "trail_id": "11190"
}