{
    "description": "Over the years I have visited a lot of waterfalls in the Cobequid Hills.  This is a description of one of the last one I had on my list to visit.  That being said, I still have some to visit but they are near or in Cape Chignecto Park.One of the cool things on this hike is actually driving to it.  From the TCH, I had often seen the 3  wind turbines  near Wentworth.  Well on the drive to the hike, you actually pass by all of them and what an impressive sight they are.  But I digress? Setting off from you care follow the old logging road and do it on the way back from the falls as well.  Don not attempt the straight line back like I did on the GPS track?big mistake it?s a very dense undergrowth and it doesn?t save you anytime at all.From the logging road, you should hear the first fall and cross the logged area which thankfully was done a short time ago so it?s easy to walk.  In the woodland near the stream, it?s just stunning.  The moss is a deep carpet but you have to be careful of the numerous deadfall since the area was logged right beside.  There are numerous small falls and rapids and two 10 footers.  I had marked these as 20 and 23ft??.not a chance unless I didn?t go downstream enough but I think these two falls might have become smaller over time as the data I used was from 1890?s.",
    "directions": "Wentworth Valley, Turn on Valley Rd and then turn on Higgins Mtn Rd.  Park at secondary logging road which begins at; 45° 33.667'N, 63° 37.430'W",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/11194/reg_DSC-0032-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11194/reg_DSC-0036-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/higgins-mountain-falls-near-truro-ns-11194",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "6 km",
        "Town": "Truro, NS",
        "Type": "out-and-back"
    },
    "title": "Higgins Mountain Falls",
    "trail_id": "11194"
}