{
    "description": "Westsyde Bench is the upper level above Westsyde Rd. and parallels it for a while. You can also access the upper hills above that contain Lac du Bois. The bench is fairly flat and has a multitude of old roads and trails.  The same can be said for the hillside going up into the hills, but it is a steep and constant climb.  I wouldn?t recommend this route up the hill for the beginner. The Bench gets the early morning sun so warms up fast, but a nice ride or walk morning or evening. The hills above are crossed with roads and a few trails and are mainly used for ATVs and accessed from Lac du Bois ATV area.",
    "directions": "Take Bachelor Heights road, turn right on Grasslands, right on Stagecoach and then right on Saddleback. Right now they are extending Saddleback and are putting in more building lots so depending on when you go there, you will either park outside the construction and walk to your left to follow the new chain link fence, then barb wire and cross over the cattle guard, or drive to the end and cross the cattle guard. I hiked down the road and when it started to go down hill, I took the trail you will see up to the left. This trail will go down a bit close to the road, but then go straight up the hill. After a bit it will join up with a road which I stayed on up to the top. There were other roads crossing it so I just stayed on the most traveled.I hiked North for a while to check out the pond, then I took the road at the south end of the pond (dried) and headed West to see if I could see Long Lake. I could not see it and my map showed it a fair distance to the North West. I hiked down to a bit of green valley and then followed on another road to my vehicle. Once again the road was steep and spent some time hiking beside it in the grass so I wasn?t sliding on my butt. Watch for cactus and snakes. Keep in mind that after the sun has been up for a bit, snakes head for the shade under bushes, so give the bushes a wide berth.  My stats:Total distance: 7.8kmTotal Ascent: 446m (1464ft)Total time: 2:09Moving time: 1:54Average Pace: 3.6km",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/11209/reg_DSC00276-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11209/reg_DSC00277-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11209/reg_DSC00278-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11209/reg_DSC00279-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11209/reg_DSC00280-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11209/reg_DSC00281-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11209/reg_DSC00282-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11209/reg_DSC00283-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11209/reg_DSC00284-5599_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11209/reg_DSC00285-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11209/reg_DSC00286-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11209/reg_DSC00287-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11209/reg_DSC00288-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11209/reg_Westsyde-Bench-5599.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/westsyde-bench-near-kamloops-bc-11209",
    "stats": {
        "Activities": "hike mtn-bike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 3,
        "Time": "3 hrs",
        "Total Distance": "8 km",
        "Town": "Kamloops, BC",
        "Type": "out-and-back"
    },
    "title": "Westsyde Bench",
    "trail_id": "11209"
}