{
    "description": "I had just completed the George Fraser Brook Slot Canyon hike and I decided to look at some of the other brooks nearby if I could find 1) some similar geology that produces slot canyons and 2)some waterfalls at the same time.  This is a description of a hike to two branches of Grant Brook that flows just east of George Fraser Book.  Setting off from the old logging road, we cut across a forest that was a mixture of hardwoods and softwoods.  Pretty soon we hit the ravine of the stream.  At this point the forest is mostly mature  deciduous and the forest floor is covered by ferns and not much else?i.e. easy travelling.  After a few minutes we hit a mini slot canyon?if you were like 5 year old you would be impressed but its got a few falls in it making it very scenic.  There are also two caves along the way set right next to the stream.  One is small but goes in for 3-4m and the other shallow but quite large in its entrance.  This wed the smaller of the two branches I wanted to see so I was pretty excited to see the larger one especially that it showed a 90 degree turn at the base of some pretty good densely-packed elevation lines.  We made our way further downstream and then cut across an old path taking us due east towards the other branch of the stream.    Again you are surrounded by a large mature forest with some evergreen measuring more than I could hug!   We finally made it to the 90 degree turn.  There was a nice fall at the top of about 10ft followed by 50ft of cascade due to the rocks being loose at the base of the fall.  Upstream from this there is another 12ft fall.  Once you have seen this last fall you can cut across the top of the plateau back to your car.",
    "directions": "Highway 209 towards Advocate Harbour.  Turn right on Bennet Hill Rd.  Drive to  the top of the Cobequid passed the blueberry fields and turn at the secondary logging rd at;  45° 24.844'N,  64° 40.503'W",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/11200/reg_DSC-0121-27177_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11200/reg_DSC-0123-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11200/reg_DSC-0131-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11200/reg_DSC-0139-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11200/reg_DSC-0156-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11200/reg_DSC-0165-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11200/narrow_DSC-0129-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11200/narrow_DSC-0159-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/grant-brook-waterfalls-near-parrsboro-ns-11200",
    "stats": {
        "Activities": "hike snowshoe",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "4 km",
        "Town": "Parrsboro, NS",
        "Type": "out-and-back"
    },
    "title": "Grant Brook Waterfalls",
    "trail_id": "11200"
}