{
    "description": "On the way to Advocate Harbour, you can pull off the highway and go explore the seashore in only a few areas?this is one of them.  The dirt road leads you right to the beach.  Set off on an easterly direction and just around the corner is a massive gypsum and other mineral outcrop.  This could be used for some top rope climbing with an amazing view of Cape split, Partridge island and Spencer Island.  There is enough space for tents and there is a trace of bonfires as well.  The reason is explored this area was that an old map showed a natural arch on the beach about 1km away from the dirt road.  So we set off in that direction and after 500m came to another outcrop of rock on the beach.  On one side it's a shale deposit and on the other the sea stack is a conglomerate of some sort.  Lots of cracks in it but a beauty to climb with some safety gear in place.  After this outcrop, 600m away are the rem ant of the natural arch?.two sea stacks that do not have the arch linking them together lie about 10m from the shore.",
    "directions": "Highway 209 toward Advocate Harbour.  Turn on Fraserville loop and turn on dirt road leading you to the ocean.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/11201/reg_DSC-0170-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11201/reg_DSC-0173-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11201/reg_DSC-0176-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11201/reg_DSC-0181-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11201/narrow_DSC-0175-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/fraserville-sea-stacks-near-parrsboro-ns-11201",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "2 km",
        "Town": "Parrsboro, NS",
        "Type": "out-and-back"
    },
    "title": "Fraserville Sea stacks",
    "trail_id": "11201"
}