{
    "description": "While driving back roads North of Lac le Jeune, I happened to spot a trail that looked well used and decided to try it. Within a short distance I was noticing ATV or motorcycles tracks. I soon came to a creek which I identified as Peterson Creek by my maps. The trail is fairly enclosed by brush, but was well used and I came to a narrow bridge. After hiking a short distance I crossed a road and then the trail ended at what appeared to be an old road, but was still mostly a single track trail.  After hiking a while further, I came to a trail splitting off the road and signs from the GKMA (Greater Kamloops Motorcycle Association).  It was now obvious why the tire tracks.I turned onto the trail marked ?Outter Inks to Connolly Lake? and was surprised what a pleasant trail it was. After hiking for a bit, I came to a split to ?Bite your Tongue?  trail. Knowing Connolly Lake was to the South West I continued on ?Outter Inks to Connolly Lake?  to trail expecting it to turn. I hiked down a long downhill trail and came to a Forestry road.  I didn?t see the trail continuing and expect I would have to go left on the road to reach the lake.I decided to go back and see if ?Bite Your Tongue? went to the lake. It went up a steep climb, crested the hill and the trees were to close to get a view off the hill. I continued on the trail and hiked downhill for a while and while it appeared to be going in the right direction, I decided to head back and see if I could find an ATV map. On the way back I followed the track to see if it connected with the road I parked on, but after a while it became obvious it was not going to and was going away from my vehicle and was possibly going to connect with ?Bite Your Tongue?. I drove up the road for a while, but didn?t see the path again. I have searched all over the Web and haven?t found any maps. I did find two links, one a PDF that showed the areas contained in the Greenstone/ Logan Lake Managed Area:   http://www.sitesandtrailsbc.ca/documents/Brochure-Tunkwa.pdfAnd one from BC Parks for Greenstone Park, but I believe the park is a considerable distance away:http://www.env.gov.bc.ca/bcparks/explore/parkpgs/greenstone_mtn/Regardless, I enjoyed the trails and will return to explore them further. A lot of the trails are bordered fairly close by brush and as much as I hate bear bells, I used on my hiking pole and recommend it as this is bear country.",
    "directions": "From Kamloops take the Lac le Jeune road and travel 15.1km. Look for a gravel road on the right just past Goose Lake road. There is a large sign for the Greenstone/ Logan Lake Managed Area. Travel up the main road, through the tunnel and continue 3.5km. Look for the orange and yellow ribbons I placed on both sides of the road, marking the trailhead. My stats:Total distance: 6.09kmTotal time: 1:37Moving time: 1:24Average pace: 3.6km/hTotal ascent: 208m (677ft)",
    "geohash": "c2frd",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/11203/long_Greenstone-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11203/reg_DSC00248-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11203/reg_DSC00249-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11203/reg_DSC00250-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11203/reg_DSC00251-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11203/reg_DSC00252-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11203/reg_DSC00253-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11203/reg_DSC00254-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11203/reg_DSC00255-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11203/reg_DSC00256-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11203/reg_DSC00257-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11203/reg_DSC00258-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11203/reg_DSC00259-5599.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/greenstone-managed-area-near-kamloops-bc-11203",
    "stats": {
        "Activities": "mtn-bike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "6 km",
        "Town": "Kamloops, BC",
        "Type": "out-and-back"
    },
    "title": "Greenstone Managed Area",
    "trail_id": "11203"
}