{
    "description": "Coal hill can be approached from a couple of directions. This hike heads south to approach the North face of the hill. Close to the top it joins the East face trail as there is basically only one route at the end.  A number of years ago I hiked the East face path and will have to check & see if it is still accessible. There is a huge number of trails and old roads on this hill and you could spend a couple of days hiking or riding them.",
    "directions": "Take Copperhead Dr. which is the road going past Versatile Truck Stop and head West. Turn right at Hugh Allan and drive almost to the end. Just before you get to the end of the street, you will see two concrete barriers with a cable between them on your left. This is the trail head. There is also another at the end of the street. For this hike I have traveled up the trail a bit then headed over to the natural gas line path and hiked parallel to it. This is a double track (road) for a large part of the hike.If you do the double track you will hike up until you are in a large open grassland, then it goes to the left and down a slope.  A bit down the slope you take the road to the right. Follow this road until you come to a tree hanging over the road ( you can walk under it). Originally going up, I saw a bit of a trail before the tree, but it disappeared and I ended up deadheading up until I hit the trail again. Instead of this route and if you don?t want to stay on the road, go under the tree, over the fence and on your right you will see a trail. It would be a push to get a bike up, but fine to hike. Just before the tower, the trail comes to another fence you have to climb over. The tower is posted Private Property so do so at your own risk, but there is a great view West.When I was ready to head down, I tried the road from the tower, but it curved around the hill and was heading West, so I climbed back up and went back over the fence. That is when I found the other trail after the tree. On the way down, I tried to stick to single track trails as much as possible. The trail I took weaved & looped all over. At a couple of places I could have walked straight 10 feet and cut out a big loop, but it goes through mostly forest and is a nice trail.  My stats:Total distance: 9kmTotal Ascent: 401m (1316ft)Total time: 2:32Moving time: 2:13Average Pace: 3.6km",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/11208/long_Coal-Hill-North-Slope-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11208/reg_DSC00260-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11208/reg_DSC00261-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11208/reg_DSC00262-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11208/reg_DSC00263-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11208/reg_DSC00264-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11208/reg_DSC00265-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11208/reg_DSC00266-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11208/reg_DSC00267-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11208/reg_DSC00268-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11208/reg_DSC00269-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11208/reg_DSC00270-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11208/reg_DSC00271-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11208/reg_DSC00272-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11208/reg_DSC00273-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11208/reg_DSC00274-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11208/reg_DSC00275-5599.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/coal-hill-north-slope-near-kamloops-bc-11208",
    "stats": {
        "Activities": "snowshoe hike mtn-bike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 3,
        "Time": "3 hrs",
        "Total Distance": "9 km",
        "Town": "Kamloops, BC",
        "Type": "out-and-back"
    },
    "title": "Coal Hill North SLope",
    "trail_id": "11208"
}