{
    "description": "The Log Train Trail Regional Park is a Linear Park leased to the Alberni-Clayoquot Regional District by the Ministry of Transportation and Highways and is located in the Alberni Valley. The Trail stretches for 20 kilometres along the foot of the Beaufort Range. It is accessible from many points along its serpentine route.The Log Train Trail is suitable for family outings by horse, bike or foot. The Trail is primarily for non- motorized use.This cycling report starts on the trail at Hwy-4 near Port Alberni and ends at Woolsey Road 20km northwest. The surface of this multi-use trail is quite rough in spots so mountain bikes are recommended. Because many creeks cross the trail it is rated summer-use only. Hal Creek crossing was washed out some years ago but a safe crossing of the dry, river bed can be made in the dry season. See Flickr photos at: http://www.flickr.com/photos/wjis21/sets/72157633358287207/DISCLAIMER: Check with the Alberni-Clayoquot Regional District Office before embarking on the Log Train Trail.N.B. Northwest bound on Alberni's Log Train Trail (LTT), after exiting Cold Creek turn right under the power-line to pick up LTT.",
    "directions": "West on Hwy-4 turn right on to Old Nanaimo Road at Coombs Country Candy Store. Southeast trailhead is located here with plenty of parking. There is a northwest trailhead at Woolsey Rd. This can be a pick up point or alternate starting point.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/11212/long_ltt-w570-1600-025-19432.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11212/long_ltt-xing-cpr-1-19432.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11212/long_ltt-xing-cpr-2-19432.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11212/reg_ltt-beaufort-800-19432.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11212/reg_ltt-w570-1600-002-19432.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11212/reg_ltt-w570-1600-003-19432.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11212/reg_ltt-w570-1600-012-19432.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/log-train-trail-near-port-alberni-bc-11212",
    "stats": {
        "Activities": "hike mtn-bike",
        "From": "",
        "Seasons": "summer",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "20 km",
        "Town": "Port Alberni, BC",
        "Type": "out-and-back"
    },
    "title": "Log Train Trail",
    "trail_id": "11212"
}