{
    "description": "My intent was to hike Middle Mountain. Many years ago I used to hike it from Uplands, but it has been over 9 years and I shouldn?t have been surprised, the trailhead was replaced with houses. I parked at the Uplands to Valleyview trail on McLeod and attempted to hike across to the East and meet up with the old trail I used before. The route was steep and the trail I was following eventually petered out. I back tracked and tried an old road that took me to the top of one of the mountains, but I think, the one to the West of Middle mountain. There is a road that goes across from this mountain to Pratt Road, but I hiked a bit of it and it is now very overgrown with windbreaks and the other end is also replaced by houses. I wouldn?t recommend the first part of the route to the East if you are following my GPS track. It is steep and pretty overgrown. Keep in mind this is bear country. Well I didn?t see any bears or fresh sign, I did see lots of old and in the past, I have seen bears. Make noise and carry bear spray. On this hike, coyotes were close and making themselves know though I didn?t actually see them. The last 30 minutes of the hike are marked with No Trespassing signs, but the last time I checked with the Forest Service, this is an Open Lease Grazing Permit area and is open to the public. Years ago I did met someone who said they were the rancher for this area and it was private property. I advised him that I had confirmed with the Forest Service that the area was a Open Grazing area and open to the public. He backed down when I advised him of this fact. I expect these are the same signs as he had posted before.",
    "directions": "Take the East Trans Canada from Kamloops and then the Barnhartvale exit. Stay right onto Todd Road. Turn right onto McLeod Road and travel to the end to the parking area. Take the path following the gas line. About a 10-15 min hike, you will see a trail going left, up and across the grasslands. The trail before it is in the forest and not the one you want. This will be the road you will follow to the top. The closer you get to the top, the steeper it will get and some will be able to do it on a bike and some not. A hike is not a problem if you are experienced.When you get close to the top, the road levels out and heads East. You want to deadhead up to the summit on your left and the trail is very faint. I have put some orange ribbons going up the start of the route so you can find it. The view to Barnhartvale is not that good, but towards the West is. You could go back down to the road and follow it a way and then deadhead up to the summit of Middle Mountain if that is your goal. If you are biking you can find trails to Valleyview, Rose Hill and Knuttsford  from here.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/11217/reg_Barnhartvale-Hills-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11217/reg_DSC00310-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11217/reg_DSC00311-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11217/reg_DSC00313-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11217/reg_DSC00314-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11217/reg_DSC00315-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11217/reg_DSC00316-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11217/reg_DSC00318-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11217/reg_DSC00319-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11217/reg_DSC00320-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11217/reg_DSC00321-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11217/reg_DSC00323-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11217/reg_DSC00324-5599.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/barnhartvale-hills-near-kamloops-bc-11217",
    "stats": {
        "Activities": "mtn-bike hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 3,
        "Time": "3 hrs",
        "Total Distance": "12 km",
        "Town": "Kamloops, BC",
        "Type": "out-and-back"
    },
    "title": "Barnhartvale Hills",
    "trail_id": "11217"
}