{
    "description": "Edwards Rating: III (IV) M MAlso called Squaw's t*t, it is a superb moderate-difficult scramble. Hands on, sometimes total exposure, but rocks-grips are fine, that's why I loved it! Lots of route finding though.ELEVATION gain (Net): 1104 m. max elevation 2431 m.TRAIL: Beginning from that parking lot beside the Highway and between Canmore and Harvie Heights, I took the obvious trail on the left for about 2km. At a certain point, it will split and I then kept going on the right one until I met a bed creek. Then, I crossed it and the \"fun\" began. I was so tired of trying to find the \"right\" path (some pink bands, but good luck to find them all) that I just went up until I finally got to the tree line. Now the real fun begins, steep walk with more obvious scree trails all over, but you can choose to climb up slabs if you prefer, such I did. When you reach the ridge, you walk on it up to the \"nipple\". You'll have sometimes to choose between climbing-down climbing with exposure on the ridge or going through scree slopes on your right. Once at the base of this famous \"nipple\", you should see a cairn on the left side. If it's dry, it's not a problem because you get great grips anyway, but slab could be dangerous otherwise. After that 1st part, you will easily see the trail up to the ridge. There will be exposure on the last portion where you have to step over a rock using the side of the ridge, but it's ok if you scrambled a few times before.CAUTION, YOU WANT TO GO DOWN THE EXACT SAME WAY. DO NOT take the left side of the ridge, which would brings you to a really bad gully. You stay on the ridge and go back West (right) to the forest.",
    "directions": "As you can or will get a ticket by parking in Harvey Heights, I would recommend that you use the parking along the Highway, on Harvie Heights Rd. It's located right between Harvie Heights and Canmore exits.",
    "geohash": "c3jf",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/11211/reg_Squaw-s-tit-Canmore-Sept-13-12--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11211/reg_Squaw-s-tit-Canmore-TIT-Sept-13-1--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11211/reg_Squaw-s-tit-Canmore-Welcome-Sept-13-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11211/narrow_Squaw-s-Tit-Canmore-Jul-25-2014-14--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11211/narrow_Squaw-s-tit-Canmore-Exposure-scramble-climbing-Sept-13-1--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11211/narrow_Squaw-s-tit-Canmore-Exposure-scramble-climbing-Sept-13-4--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11211/narrow_Squaw-s-tit-Canmore-Sept-13-17--44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/nipple-mountain-near-canmore-ab-11211",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 5,
        "Time": "5 hrs",
        "Total Distance": "10 km",
        "Town": "Canmore, AB",
        "Type": "out-and-back"
    },
    "title": "Nipple Mountain",
    "trail_id": "11211"
}