{
    "description": "A long time ago I had read about some potential caves on Owl's Head....with no other information as to location except it was in Nova Scotia.  There are only a few places in NS that have that name.  As I was setting off to explore on the Aspostagan Peninsula, I decided to check out Owl's Head Island to look for the cave(s).  There is a bridge to the island and once you have crossed it you head into the woods to hit the opposite shore of the island.  The woods were a bit thick but after 25m of bushwacking I ended up on a trail leading me to the opposite cove.  Once there there is a nice cobble beach and large rocky outcrop to explore on both side.  Heading south you have to skirt a couple of deep incisions and just before the lat bend of the headland, you will find the first cave (of about 10ft) which looks like you could only enter at low tide (see video) and then there is another cave or large overhand at the bottom of a large cleft in the rocky headland.  Once you have seen those, head back into the forest and find a small trail that will lead you back to the main dirt road.",
    "directions": "Highway 329, turn on South West Cove Rd which will become Owls Head Rd and park before getting to the bridge",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/11236/reg_GOPR0031-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11236/reg_GOPR0032-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11236/reg_GOPR0033-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11236/reg_GOPR0036-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11236/reg_GOPR0039-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/owls-head-sea-caves-near-chester-ns-11236",
    "stats": {
        "Activities": "climb hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "2 km",
        "Town": "Chester, NS",
        "Type": "out-and-back"
    },
    "title": "Owl's Head Sea Caves",
    "trail_id": "11236"
}