{
    "description": "These are two lesser known trails in Thetis Lake Park, but immensely scenic. The trail along Craigflower Creek is low-lying with lots of ferns & old Douglas Fir.  The creek is a salmon spawning creek in fall.  It gets slippery after rains and wouldn't be advisable during winter or early spring.  The Seymour Hill trail is the opposite: quite a climb up through Douglas Fir ecosystem, then Garry oak and arbutus meadows and even some maples on the way down, making for gorgeous colours in fall. The view from the top is great; the only downside is that Hwy. 1, while not seen, can be heard quite loudly in higher areas. Still - the ecosystem and views are worth the climb!At the summit of Seymour Hill is a post with a sun dial and distances to other mountains. From there, please try to follow the park map.  We ended up on another trail down which isn't official and has some very steep areas.  I wouldn't advise it, esp. after rains.You probably won't encounter many other hikers in this area.  I'd take lunch and enjoy!",
    "directions": "You can access the Craigflower Creek trail from Marler Drive, off Watkiss Way.  There is a small parking area at the trail head. Or access it from Riverside Drive, off Highland Road. Seymour Hill can also be accessed off the main trail around Upper Thetis Lake, which you can reach from the 'main parking lot' to Thetis Lake Park.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/11232/reg_Trimble-Outdoors-422908-45233_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11232/narrow_Trimble-Outdoors-422902-45233.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11232/narrow_Trimble-Outdoors-422909-45233.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11232/narrow_Trimble-Outdoors-422911-45233.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11232/narrow_Trimble-Outdoors-422917.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/craigflower-creek-seymour-hill-in-thetis-lake-park-near-view-royal-bc-11232",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 2,
        "Time": "3 hrs",
        "Total Distance": "7 km",
        "Town": "View Royal, BC",
        "Type": "out-and-back"
    },
    "title": "Craigflower Creek & Seymour Hill in Thetis Lake Park",
    "trail_id": "11232"
}