{
    "description": "This is a hike I revisited lately after about 6 years.  The coastline here is magnificent and apart from an old haunted hotel, there is little human activities to disturb the peace and quite of this place.   Yes you read correctly...the hotel was finished on the exterior and then just abandoned...it would make a great set for a Nova Scotia remake of The Shining!The hike is basically following the shoreline for as little or long as you wish.  there are a couple of large overhangs in the middle of my gpx track that are worth having a look at...very impressive.  Lots of boulders for the kids to climb on.  Lots of room to pitch a tent and go snorkeling as well!Once at the end of the bluff where it turns to the north, you should be able to spot a trail that leads you close to the house sitting high on a bluff.  There is a road there that meanders back to the old hotel if this is where you parked.",
    "directions": "Highway 329. Turn on Coleman Cove Rd and then it changes to Ocean Gate Drive and then turn right and down the hill to the old hotel.",
    "geohash": "dxfmp",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/11238/reg_DSC-0015-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11238/reg_DSC-0013-27177_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11238/reg_DSC-0017-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11238/reg_DSC-0019-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11238/reg_DSC-0021-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11238/narrow_DSC-0016-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/aspotogan-granite-and-overhangs-near-chester-ns-11238",
    "stats": {
        "Activities": "climb snowshoe hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 5,
        "Time": "2 hrs",
        "Total Distance": "6 km",
        "Town": "Chester, NS",
        "Type": "out-and-back"
    },
    "title": "Aspotogan Granite and Overhangs",
    "trail_id": "11238"
}