{
    "description": "Irwin Park, a pristine area located between Sooke Road and Highway 1, in Langford, BC, (above the new Westhills project) was once a privately owned campsite created and developed by Joe Pekter. Joe came to Canada during the Hungarian Revolution in the late fifties and acquired this 114 acre parcel in 1971. In 1991 the property was sold and now the City of Langford owns a large portion of the former campsite and it has been renamed Irwin Park. There is ample parking at the top of the hill on Langford Parkway. This is where the residential development currently ends and the road is blocked and designated Construction Zone. The pathway to Parklands Park is well marked with signs and the trail is approximately three metres wide -- it's hard to miss.Once through the playground area, turn right over the covered-bridge and on the other side of the soon-to-be road is the trailhead to Irwin Park. Just stay on the trail and view both the lower and upper lakes. Quite peaceful, really. One could then continue on to Irwin Road -- on the Humpback Reservoir side -- then backtrack to one's starting point through the construction zone.Easy walk or cycle on good trails and old roads.",
    "directions": "Langford Parkway is connected to Jacklin  Road in the City of Langford. Follow Langford Parkway northwestward to the top of the hill. There is ample parking at the top of the hill on Langford Parkway. This is where the residential development currently ends and the road is blocked and designated Construction Zone. The pathway to Parklands Park is well marked with signs and the trail is approximately three metres wide -- it's hard to miss.Once through the playground area, turn right over the covered-bridge and on the other side of the soon-to-be road is the trailhead to Irwin Park.GPS Coordinates Irwin Park Trailhead: 48°26'29.20\"N 123°32'10.50\"W",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/11248/reg_irwin-800-006-19432.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11248/reg_irwin-800-054-19432.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11248/reg_irwin-800-059-19432.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11248/reg_irwin-800-065-19432.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11248/reg_irwin-800-066-19432.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11248/reg_irwin-800-067-19432.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11248/reg_irwin-800-068-19432.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/irwin-park-near-victoria-bc-11248",
    "stats": {
        "Activities": "mtn-bike hike",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "3 km",
        "Town": "Victoria, BC",
        "Type": "out-and-back"
    },
    "title": "Irwin Park",
    "trail_id": "11248"
}