{
    "description": "I am lucky since I get to visit Cheticamp a few times of the year through work.  The obvious beauty of the national park makes any other exploring futile...until now.  I headed to the Cheticamp island to get a better view of the highlands behind the village.  On the southern edge of the island, I was pleasantly surprised to  discover some seriously cool bold ocean-front cliffs!The walk takes you basically along an established ATV path through a salt meadow.  The first part you will see the backdrop of the highlands which is a wicked view but come right to the end of the island and the high cliffs begin.  The first part would offer some bouldering opportunities while the rest looks like some loose conglomerate.  Lots of bird nest hang onto the vertical wall here.  You can follow the high cliffs for a while and then return to your vehicle.  There is also an old cemetery up in the meadow with a few headstones which are not legible anymore.",
    "directions": "Cabot trail almost to Cheticamp.  turn on Cheticamp Island Rd and continue on this road to the T intersection.  Turn left and continue on Cheticamp island rd to its conclusion by some house and a satellite dish farm up on the hill.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/11256/reg_DSC-0011-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11256/reg_DSC-0014-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11256/reg_DSC-0019-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11256/reg_DSC-0031-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11256/narrow_DSC-0025-27177_best1_.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/cliffs-at-cheticamp-island-near-cheticamp-ns-11256",
    "stats": {
        "Activities": "snowshoe hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "2 km",
        "Town": "Cheticamp, NS",
        "Type": "out-and-back"
    },
    "title": "Cliffs @ Cheticamp Island",
    "trail_id": "11256"
}