{
    "description": "This is a hike to  a couple of waterfalls in a pristine valley (except for the ATV path) near Margaree Centre, Cape Breton Island.  I had mapped a couple of potential falls in this valley but couldn't remember afterwards where I got the information.  I looked at the imagery from google earth and it showed some nice potential but the topi from the area wasn't showing much in the same area.  Worst was the bing imagery which did not show any potential (i.e. white spots in the stream) for waterfalls.  It was a beautiful fall day so I struck forth anyway unsure of what waterfall if any lied ahead.  The path is well established and a mountain bike would be the quickest way.  The forest is a mature acadian type with soaring canopy overhead.  I parked at some sort of snowmobile clubhouse and walked the rest of the way.  The trail does go uphill but very gradually so it's an easy walk.  At the furthest site I had mapped out there was a 3-4footer with a swing rope and a cabin set right by the river.  The owners are very lucky to spend some time in an ideal spot.  I made my way downstream to seek a couple of other potential.  The river got a bit narrower and soon there were more rocky outcrops so my hopes went up!   What I did end up exploring were a couple of 6 footers.  There are pretty picturesque and the walk is so easy to get to them (relative to my other adventures) that I find them worthwhile to go see.",
    "directions": "In Margaree Centre take the Big Intervale Rd and turn left on Marsh Brook Rd and park where the snowmobile club is located.  Right by the club is a fork with one headed straight uphill with a metal gate.   Take the other fork......",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/11258/reg_gallant1-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11258/reg_gallant2-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11258/reg_gallant3-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/gallant-brook-waterfalls-near-cheticamp-ns-11258",
    "stats": {
        "Activities": "mtn-bike ski-xc hike snowshoe",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "6 km",
        "Town": "Cheticamp, NS",
        "Type": "out-and-back"
    },
    "title": "Gallant Brook Waterfalls",
    "trail_id": "11258"
}