{
    "description": "Trail to the top of Half Dome in Yosemite National Park.  There is a another listing for Half Dome on trailpeak.com and it's extensive, describing the cable route shown here.  Hiking to the top of Half Dome needs a permission by the park authority. You may get such a permit either in advance via internet or by a lottery. Drive to Yosemite Valley. At the Visitor Center you can park a car. Drive with the bus shuttle to the trailhead of Mist Trail. Hike Mist Trail to the very end. You are going to pass Vernal Falls and Nevada Falls. After passing Liberty Cap the trail leads you to the east side of Half Dome. The area at the base of Half Dome is a restricted area and limited to a certain amount of people. In order to get there and doing the final ascent you need a permit. A ladder will bring you to the top of Half Dome. This is the most strenuous and challenging part of the trail. Now you need to be free from giddiness by taking safe steps. The top of Half Dome is flat and has enough room to fit all the hikers.",
    "directions": "Drive to Yosemite Valley. At the Visitor Center you can Park a car.",
    "geohash": "9q",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/CA/11254/reg_Half181-29178.jpg",
        "https://trailpeak.com/storage//content/trails/US/CA/11254/reg_Half185-29178.jpg",
        "https://trailpeak.com/storage//content/trails/US/CA/11254/reg_Half188-29178.jpg",
        "https://trailpeak.com/storage//content/trails/US/CA/11254/narrow_Half190-29178_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/US/CA/11254/narrow_Mist19-29178.jpg",
        "https://trailpeak.com/storage//content/trails/US/CA/11254/narrow_Mist39-29178.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/half-dome-near-groveland-ca-11254",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 5,
        "Time": "9 hrs",
        "Total Distance": "31 km",
        "Town": "Groveland, CA",
        "Type": "out-and-back"
    },
    "title": "Half Dome",
    "trail_id": "11254"
}