{
    "description": "I?ve always wanted to visit this ravine since it?s just a stone throw away from highway 104 and it looks deep and narrow as you go upstream.  Get down to the streams by carefully descending the man-made scree slope by the culvert.  Walk for about 200m to the first 90 degree turn and it is like you are in another world.  The highway noise dies down, the canopy overhead darkens the whole ravine.Right then you should be able to spot a massive rocky outcrop at the far end of the stream.  There is 3 different cascades at this place where the stream does two 90 degree turns within about 5m. If you decide at this point to push upstream, which I highly suggest, you will see two more cascade areas within the next 600m or so.  What is interesting is that the stream hits a lot of limestone.  One particular spot, the stream has gauged out a nice overhang by the edge of the stream.  If the stream would hit it straight on it might create a tunnel in a couple of hundred years!  A lot of limestone boulders have detached form the high sided ravine walls and slide down these natural chutes.",
    "directions": "Highway 104 to just passed the Salt Springs Exit.  Right after an overpass of the W River East Side Rd, there is a metal fence and the walk starts here",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/11269/reg_DSC-0038-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11269/reg_DSC-0044-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11269/reg_DSC-0052-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11269/reg_DSC-0058-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11269/reg_DSC-0064-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11269/reg_DSC-0065-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/graham-brook-cascades-and-limestone-near-new-glasgow-ns-11269",
    "stats": {
        "Activities": "snowshoe hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "2 km",
        "Town": "New Glasgow, NS",
        "Type": "out-and-back"
    },
    "title": "Graham Brook Cascades and Limestone",
    "trail_id": "11269"
}