{
    "description": "This is a hike to a beautiful and gnarly waterfall set into an outcrop of slate rocks.  It was actually my second time in this area.  The first time I followed this brook I saw a little fall of about 5ft and then the topography of the terrain became very flat.  I knew that this brook contained one fall but wasn?t sure of the size of it.  I figured at that time that the little fall I saw was the one I was looking for.  Big mistake!!!!Had I followed the brook a mere 300m downstream I would have explored a truly great area.  Anyways lesson learned?always push a little further!  The two tier waterfall drops a total height of about 50ft or so.  On either side of the waterfall and extending downstream are these really cool looking slate cliffs.  Most of the slate is set vertical and where some of the rock has fallen down you get these long and narrow crevasses into the rock wall.   The forest at the bottom of the ravine is a mature hardwood which is total different from the forest on top of the waterfall which is mostly softwoods.",
    "directions": "Highway 14.  Turn on Indian Rd at Cheese Factory Corner (name of the town so don?t look for a factory).  Turn left on Fraser Rd and park at the end of the road before the quarry.  O?Toole brook is to the right of the quarry ?follow it downstream.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/11279/reg_DSC-0089-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11279/reg_DSC-0091-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11279/reg_DSC-0093-27177_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11279/reg_DSC-0096-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11279/narrow_DSC-0094-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11279/narrow_DSC-0101-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11279/narrow_DSC-0104-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/otoole-brook-fall-near-halifax-ns-11279",
    "stats": {
        "Activities": "snowshoe hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "2 km",
        "Town": "Halifax, NS",
        "Type": "out-and-back"
    },
    "title": "O'Toole Brook Fall",
    "trail_id": "11279"
}