{
    "description": "I decided to go on this exploration hike because the old NS atlas showed a waterfall on Mitchells Brook.  The topography looked interesting to have such a feature and since I haven?t explored much in this area of the province it seemed like a good gamble. I set forth on a nice atv/ snowmobile trail for about 400m.  Then, unfortunately, I had to turn away from the trail and head into the woods towards the stream.  The first 100m was good as I was in an old conifer forest.  Afterward I had to bulldoze my way through some of the thickest 6ft high evergreen mass.  Luckily this part did not last long and then the rest of the way to the stream was pretty much an open area logged within maybe 2-3 years so the ground cover was still at a minimum.  Got to the edge of the ravine where the stream lied.  The descent was pretty scary as I later found out I chose the only area where there is a large rocky outcrop.  Had I chosen any other path the descent would have been pretty straight forward.  Anyways I was excited because of the height of the rocky outcrop could very well be the height of the fall?.Once I reached the bottom of the ravine I chose to go upstream where I did spot a fall of about 8ft.  I pushed up further but did not see anything else that looked appealing.  Then I thought to myself?the fall must be downstream so I pushed my way downstream for a while??.and nothing.  The only thing I can think is that I may have missed something ore upstream.  I am posting this in case someone reads this post and goes out there to explore further or may already know of that fall.",
    "directions": "Highway 347.  Turn on Siding Rd and then immediately left on the atv/snowmobile trail that is located right after the bridge.  Drive until you cannot anymore and start walking?.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/11270/reg_DSC-0026-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mitchells-brook-fall-near-new-glasgow-ns-11270",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 1,
        "Time": "2 hrs",
        "Total Distance": "5 km",
        "Town": "New Glasgow, NS",
        "Type": "out-and-back"
    },
    "title": "Mitchells Brook Fall",
    "trail_id": "11270"
}