{
    "description": "This is a four in one adventure post.  The area around West gore is chockfull of waterfall and karsty terrain!  I?ve posted on the waterfalls previously and now I will post some exploring of the gypsum features around the same area.  This is not about caving at all as there are no large features but the forest around these gypsum or karst area are so different from anything else in the province it is worth spending some time exploring them.Starting to the Northeast (see gpx file) I will describe the four features I explored.  The first one is between Bartlett?s brook and MacDonald Rd.  the forest overtop the gypsum mounds is so nice to travel through as all the trees are mature and there is no shrubs at all.  Some exposed mounds in the forest and an exposed cliff or two near the marsh are some of the features you will see here.The next spot, is off a logging road near West Gore.  The logging road looks like a Y.  There is a very linear valley of gypsum exposed in this part.  To the north of the valley you will find a lot of gruyere cheese like features.  One of them is a good 12ft down and about the size of your body so be very careful when travelling through the area.The nest area is the biggest and you can see it from the McInnis Rd.  On the east side of the Glen Brook you will see a very large gypsum outcrop.  Traverse the field and see it up close.  Lots of porcupine dens in there.  The top portion is full of holes as well but nothing to get into.  A small portion of the top of the cliffs has very large and mature pine trees as well.Lastly the last feature to visit is off a logging road off the McInnis Rd.  Travel 200m and then go to the left and into a giant sinkhole.  In front of you will see a small pond and a small gypsum cliffs with two small holes at its bottom.  Again the feature is very linear afterward as the water from the small and is dissolving the gypsum from underneath.  When I got to the small pond, I was very surprised to see a maintained trail.  I followed it a little bit as it went into a valley that had some mature beech tress.  Coming back to my car and heading back towards Glen Brook, I spotted a sign; Alabaster Spring Nature Park just beside someone?s house.  This is probably the trail I was on.",
    "directions": "Most of these features are either off highway 202 near West Gore or on McInnis Rd...see the gpx file",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/11284/reg_DSC-0115-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11284/reg_DSC-0158-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11284/reg_DSC-0162-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/west-gore-karst-near-halifax-ns-11284",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 3,
        "Time": "4 hrs",
        "Total Distance": "8 km",
        "Town": "Halifax, NS",
        "Type": "out-and-back"
    },
    "title": "West Gore Karst",
    "trail_id": "11284"
}