{
    "description": "One last fall to check out when you are near West Gore/ Clarksville, Hants County, Nova Scotia;  Old Sanford Brook Fall.   The other ones are;  Glen Brook Fall, MacInnis Brook Fall and a bit further away O?Toole Brook Fall.Again this is one of those hidden treasures.  Setting off from the logging road you wouldn?t even know there is a stream close by.  However only about 30m separates the road to a deep ravine where the stream flows.  Get by the mixed forest and you will be on the edge of a 60ft plus ravine.  The ravine is either very steep sided with slate rocks or scree slope type overburden.     You make your way to the stream by carefully picking a good route down.  Once don there it is another world!.  Lots of these massive beech trees?.some of the biggest I have seen in NS!  Make your way upstream and after a few hundred metres you come to the 30ft waterfall.  If you decide to walk the waterfall up there are a couple more 5ft upstream as you emerge from the ravine.",
    "directions": "Highway 14.  Turn onValley Rd.  Turn left on Glen Brook Rd.  Keep straight at four way intersection and keep going on same rd, pass the Glen Brook Fall, to a parking spot at approx. 45.083508°, -63.801299°",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/11282/reg_DSC-0156-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11282/reg_DSC-0141-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11282/narrow_DSC-0143-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11282/narrow_DSC-0152-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/old-sanford-brook-fall-near-halifax-ns-11282",
    "stats": {
        "Activities": "snowshoe hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "2 km",
        "Town": "Halifax, NS",
        "Type": "out-and-back"
    },
    "title": "Old Sanford Brook Fall",
    "trail_id": "11282"
}