{
    "description": "This is a very nice paddling route, inland, on one of the largest undisturbed lakes in Halifax Regional Municipality; Lake MajorLake Major is actually Dartmouth's drinking water supply but for a reason or another there are a couple of houses downstream of the pumping station and the regulation state that any boat with less than 10hp can use the lake.  The other rules are to do with swimming and boating close to the pump house.Setting off from the Lake Major Rd, you paddle close to a couple of homes on either side of the lake...but a few minutes later, you have the whole place to yourself.  The only other built up area you will see is the pumping station about 1km upstream.The lake is quite long at about 8km one way and is wide in most areas except a the head and tail ends.  There are numerous large cliffs that are exposed at the water's edge making for some nice sights along the way.  There are also a few small islands in the lake one of which would be big enough to camp on while the others are more or less suitable for one or two person to stand on. There is one split rock in the water where you can  paddle through the rock with risk walls on either side for about 10ft.  There is also a big overhang you can get right under with your boat.....see the video!You basically go as far as you want and if you are lucky as me on the day I was there the wind was in my face the whole way in and for once it didn't shift on the way back making the return journey faster and easier.  My turn around point was a brook flowing from Spider Lake to Lake Major.  there are numerous waterfalls on this brook and they are all within 250m of the lake.  I will post these falls as another trail called Spider Lake Falls as you can access them overland with a little bushwhacking and lots of patience.",
    "directions": "Main St in Dartmouth as it becomes highway 107. Turn on Lake Major Rd and continue until you come to Old German Rd on your left.  Park at the pull out area where there is a guard rail.  A small 10m trail to the lake awaits you behind the guard rail.",
    "photos": [],
    "source_url": "https://trailpeak.com/trails/lake-major-near-halifax-ns-11293",
    "stats": {
        "Activities": "river-kayak sea-kayak",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "14 km",
        "Town": "Halifax, NS",
        "Type": "out-and-back"
    },
    "title": "Lake Major",
    "trail_id": "11293"
}