{
    "description": "(French description follows)\r\n\r\nThis beautiful trail is part of the Parc d'Environnement Naturel de Sutton (Natural and Environmental Park of Sutton).\r\n\r\nThe park is being maintained by a non profit organisation who have worked very hard to preserve a large part of the Sutton mountain.\r\n\r\nThis trail was very easy in the beginning. Stairs have been built at critical points during the trail. Nevertheless, the closer you get to the roundtop, the harder the trail becomes. I suggest you make a detour by the Spruce lake to either take a short swim or take a quick break.\r\n\r\nAt the top, 968meters, you get a splendid view of the surroundings.\r\n\r\nNote that starting this year (2004) camping sites have been build at altitude 840m. You can also rent the ski shack for a ridiculous amount per person.\r\n\r\nFor more informations:\r\n\r\nwww.parcsutton.com\r\n\r\n\r\nFrancais:\r\n\r\nCe joli petit sentier fait partie du Parc d'Environnement Naturel de Sutton.\r\n\r\nLe parc est entretenu par un organisme a but non-lucratif qui ont travaillé très fort à la conservation d'une bonne partie du mont Sutton.\r\n\r\nCe sentier était réellement facile au début. Des escaliers ont été aménagés à des points critiques tout au long du sentier. Néanmoins, plus l'on se rapproche du sommet et plus le degré de difficulté augmente. Je vous recommande fortement de faire un détour par le lac Spruce afin d'y faire une petite baignade ou tout simplement pour faire une pause.\r\n\r\nAu sommet, 968meters, Il y a une vue splendide des alentours.\r\n\r\nNotez qu'à compter de cette année(2004) des sites de camping ont été aménagés à altitude 840m. Vous pouvez également louer le chalet de ski pour une somme ridicule par personne.\r\n\r\nPour plus d'informations:\r\n\r\nwww.parcsutton.com",
    "directions": "From Montreal:\r\n\r\nTake the Champlain Bridge and continue on highway 10 following indications for Sherbrooke.\r\nExit to take the 241 south. Then take the 104 East until you see indications for the 139 south.\r\nTake the 139 south until you reach sutton then follow the instructions for the ski center. You can park your car at altitude 400m or 520m.\r\n\r\nDe Montréal:\r\n\r\nPrendre le pont Champlain et continuer sur la 10 vers Sherbrooke. Sortir pour prendre la 241 sud. Ensuite prendre la 104 est jusqu'à la 139 sud. Prendre la 139 sud jusqu'au centre de Sutton. De là, suivre les indications jusqu'au centre de ski. Vous pouvez vous stationner à altitude 400m ou 520m",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/QC/1130/reg_000-0114-18734.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/1130/reg_RoundTopjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/1130/reg_terra-026-18734.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/1130/topo_copyofcarte2jpg.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/round-top-pens-near-granby-pq-1130",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 4,
        "Time": "4 hrs",
        "Total Distance": "4 km",
        "Town": "Granby, PQ",
        "Type": "out-and-back"
    },
    "title": "Round Top (P.E.N.S.)",
    "trail_id": "1130"
}