{
    "description": "This is a hike to some old gold mining work and some pretty good rapids on the Gold River, Nova Scotia.  The first part of the hike is on some ATV trails which you will eventually have to give up and start bushwacking to the Gold River.  There is a small stream to cross and lots of rocks there to help you.  The forest is mostly conifers and where it hasn?t been logged there is a deep carpet of moss.  Lots of small shrubs too which sometimes make travel a bit slow.  Once you hit the Gold River you should be able to spot an old gold mine adit about 5m from its bank?it is now fully flooded.  All the way from your car to the Gold River you will also see some old mine shafts that are now  flooded as well.  The gold river upstream from this point is very spectacular for this part of the province.  The river has carved for the lack of a better word a canyon through solid rock on either side.  Access down to the river?s edge becomes spotty at best as you travel on top of the cliffs.  There are some large rapids and a few fall of about 4-5ft along the way.  I stopped when I spotted some houses upstream on the opposite bank.  Along the cliffs edge I was able to travel on a game trail which was easy to follow and took me where I wanted.This section of the river has some good potential for river kayaking.  It's not a long section but on days of high water there  lots of big rapids, drops and eddies to plat around in",
    "directions": "Exit 9 on the 101.  Turn on  highway 12 north and then turn on Lacey Mine Rd and park at; 44.570586°, -64.331342° .  An atv trail goes in the general direction of the river",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/11309/reg_DSC-0089-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11309/reg_DSC-0094-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11309/reg_DSC-0101-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/gold-river-near-chester-ns-11309",
    "stats": {
        "Activities": "river-kayak hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "6 km",
        "Town": "Chester, NS",
        "Type": "out-and-back"
    },
    "title": "Gold River",
    "trail_id": "11309"
}