{
    "description": "NOTE: from user RespectfulBob (see comment below). The following description is out of date; I know the situation first hand because I have been there, sometimes daily for months, over the last decade.  The cliff face has fallen away at several places recently and has become very difficult to get down and back up. The route described is now sheer and I was unable to do it. The access route is also not available.  The road, Rose Ridge, is a private road developed and maintained by the owners of the properties along it.  The road does not lead to any public land; there is a sign at the head of Rose Ridge stating \"Private Property\".  All of the properties along the cliff are privately owned as is the property in which Bell's Tunnel is situated.  The property owners are not open to granting access because of liability issues.I do hope that most Trailpeak members have a respect for private property and would not behave in the manner which Crankywitch did.*** private property: this hike is no longer accessable.A short hike to a piece of history near Lunenburg, Nova Scotia.  This hike will take you to what is called Bell?s Tunnel;  this is a gold mine adit set at the bottom of some pretty vertical cliffs near the sea ovens nature park.Setting off from the dirt road, you enter a white spruce forest and quickly navigate a gentle slope down to the cliff?s edge.  Close to the cliff, you will hit some game trails running parallel to the cliff.  You can spot  an old rock wall set up at the edge of the cliff with lots of quartz material close by.  I ended up going down the cliff to the left of this rock wall.  There is an area where the whole cliffs is about 6ft lower than the rest of the forest but is wide enough to accommodate a couple of people.  At this point if you look don the cliff, you should be able to spot a few large rocky and square looking outcrops that will act as giant steps.  A bit of bouldering is required here as you are at least 25 ft off the ground.Once you hit the sea floor, turn to the right and follow the bottom of the cliffs and you might not need to get your feet wet if you go at all times other than high tide.  There is one sharp corner to jump across about 3ft of water but that?s it.  Looking down the cliff sides you will not see the tunnel entrance until you are right in front of it.  It goes in about 6m and branches into a Y of only a few feet each.i've put this hike as difficult because of the cliff...but you could also paddle there and then it would be easy!",
    "directions": "Highway 332 towards Rose Bay.  Turn on Feltzen south Rd and turn right on Ovens Rd and then turn right on Rose Ridge Rd.  Park approximately at  44.315765° , -64.271101° and head downhill?..",
    "geohash": "dxfk17r",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/11307/reg_2-27177_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11307/narrow_1-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11307/narrow_3-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/bells-tunnel-near-lunenburg-ns-11307",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 5,
        "Time": "1 hrs",
        "Total Distance": "1 km",
        "Town": "Lunenburg, NS",
        "Type": "out-and-back"
    },
    "title": "Bell's tunnel",
    "trail_id": "11307"
}