{
    "description": "This great hike on Gambier Island is low elevation (844m) and easy to get to from Horseshoe bay. Once on the actual trail it is extremely well marked and easy to follow. Great viewpoint about 20 minutes before the summit that is better than the summit itself.",
    "directions": "turn left at red mailboxes when you exit boat . Left again at major junction ~20-30mins in (sign \"To Lakes\".   Right at next major junction.  Follow main road till you see obvious \"Mt. Killam\" sign on tree  and go right (there will be logging road 2-3 mins before from right, ignore.  Look for trailhead at LEFT side just before you enter gravel pit (obscured).****** Update August 17, 2014 *******Logging in the area has changed the initial route substantially.- Exit ferry and take left at Canada Post mailboxes- Continue on this road for about 2.5 km and take a right on the new logging road. There is a sign that says \"lakes\" and to go left but go right- Continue for about 800m.  There will be a junction with another logging road.  The trailhead is on the right and behind some logs that you will have to climb over.  You should be able to see a trail marker from the road.*** This shortcut should save you about 30 mins *** as we went on the original route and had to spent substantial time 1) first finding trail head at quarry which we never did.  We just climbed up the quarry and connected to the trail 2) The trail eventually comes out on to the new logging road mentioned above which led to some confusion.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/11302/long_IMGP0693-9687.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11302/long_IMGP0697-9687.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11302/narrow_IMGP0694-9687.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mt-killam-near-gibsons-bc-11302",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "6 hrs",
        "Total Distance": "16 km",
        "Town": "Gibsons, BC",
        "Type": "out-and-back"
    },
    "title": "Mt Killam",
    "trail_id": "11302"
}