{
    "description": "This is a short hike to a couple of cascades on Whitford Brook,.  Setting off from my car, I only knew the falls were located downstream.  The contour lines did not look great on the topo map and when I got there I could see why?the place looked really flat.  Anyways I charged ahead and soon was cursing the many branches and thick evergreen patches I had to plow through.  Luckily, I decided to see what the other side of the brook had to offer and was pleasantly surprised to find an established trail.I followed it and it was a pretty good trail with just a few deadfall and some branches in the way but so much easier than the other side.  Then I got to thinking that since there was a trail, the falls must be awesome!  After passing under a cleared patch where some power lines went through, the terrain changed and I began to see some elevation changes and some boulders.  I knew I was getting close to the falls!I could hear them at this point as I was under a canopy of evergreen.  Finally after a last bend in the trail?I was finally there.  There is a series of drop at this location which are quite scenic and a big boulder in the middle of the stream covered by fern that looks like a chi pet!  The total drop of the stream here is a good 25ft but all in a series of cascades instead of one true drop.  The trail continued along the now wide stream so I suspect this may be a good fishing hole too!",
    "directions": "Highway 3 in East River.  Turn on Mersey Connector Rd and pass underneath the 103.  Continue on this road as it becomes rougher and park at the bridge where there is also a metal gate.  Walk downstream on the right hand side of the stream if you are looking downstream",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/11310/reg_99589202-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11310/reg_99589209-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11310/reg_99589214-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/whitford-brook-falls-near-chester-ns-11310",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "2 km",
        "Town": "Chester, NS",
        "Type": "out-and-back"
    },
    "title": "Whitford Brook Falls",
    "trail_id": "11310"
}