{
    "description": "I don?t use the word epic very often but it describes perfectly this hike!  Here it goes, this hike offers, but not limited to, sea caves, sea stacks, 300ft cliffs, frozen waterfalls (at the right time of the year), 50ft tides, disappearing land bridges, 10ft narrow clefts between 300ft stacks, semi-precious minerals,  awesome views everywhere you look.  This hike is the circumnavigation of the base of Cape Split.I?ve thought often about doing this hike but I was pulled into exploring other parts of the province.  I had hiked and mtn biked this trail a few years ago and was wondering if it was a waste of time to return and do the sea  floor walk.  The answer is hell no!  My wow factor has dulled a bit in the last few years after visiting some...make that a lot of the hidden gems of Nova Scotia.  Although this one is different because it is in plain view of all the people who do the traditional hike.After about 5.3km on the traditional hike, you should be able to spot a spur trail to your left leading to a place called Little Split Rock Cove.  It?s well defined and has orange or pink flagging tape.  The descent is not too steep and ends up in a stream gulley with some loose rocks and alders on either side.  After leaving the traditional trail it will only take about 5min to get to the shoreline.The only but most important thing you need to remember is that to get to the pinnacles of Cape Split, you need to look at tide charts.  A land bridge appears on the western end of Little Split rock cove between the edge of the cove and the stack called Little Split Rock.  This land bridge gets you access to the base of the cliffs that from Cape Split.  After rounding off the Little Split cove, you will have the 300ft cliffs on your right hand side and practically nowhere to hide if the tide goes up.  The land bridge stays open for about 3 hours on either side of low tide.  There was nice 50ft frozen waterfall right on the corner of the cove.  There is also a pretty big sea cave near this point.  To get to the end of the pinnacle from this point is about 1km.On the cliffs face, there are numerous smaller cracks that look promising from afar but are usually only a few feet deep.  Higher on the cliffs and especially at one particular point there is a series of openings running straight up the cliff face that looked very intriguing.  As soon as you rounded the corner of the cove, you will see the two  main stacks as well as the four other smaller stacks in between them.Once you get closer to the sea stack, you will come to a giant cleft in the cliff.  300ft cliffs narrow down to about 10ft across where you can walk through and get to the northern side of the peninsula to get a view of the Diligent River area.  There are all kinds of semi-precious minerals everywhere you look.  Although most people will tend to look up towards the cliffs and stacks instead of looking for rocks.  You can walk around all the sea stacks but you have to be very careful as the area is covered by knotweeds and can be slippery.  Side note; I was there when the weather was about -5c and once the algae freeze, they do not slip - but exercise caution in any case!  You retrace your steps to get back until Little split Rock Cove.  At this point instead of going up back on the trail, follow the coastline for a few minutes to Big Cove.  Right before Big cove is a crevasse kind of opening  which is  quite long and narrow that finished in the ocean.  There are also vein of minerals in the rock itself.  Once you round the corner and you see the Big Cove head towards the woods there is another trail there.  Peer down and you should be able to spot a giant sea cave on the corner of Big Cove (I might need to return to look at this one another time).  From there I followed the trail a bit but it seemed to turn to the east side of the cove.  Instead, I cut into the woods and met up with the spur trail.  Words cannot do justice to this place so please go see for yourselves being mindful of the tides!",
    "directions": "Highway 358 to Scots Bay.  Park at the end of the trail and walk 5.3km to the spur trail on your left.  A  few minutes before the spur trail appears, you should be able to spot an L shaped tree covered by markings.  Also if you walk another 700m from the spur trail, you will arrive at the tip of Cape Split.",
    "geohash": "f841",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/11317/reg_DSC-0032-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11317/reg_DSC-0036-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11317/reg_DSC-0052-27177_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11317/reg_DSC-0080-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11317/reg_DSC-0102-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11317/reg_DSC-0106-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11317/reg_DSC-0113-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11317/narrow_DSC-0063-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11317/narrow_DSC-0127-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11317/narrow_little-cape-split.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/pinnacles-of-cape-split-near-kentville-ns-11317",
    "stats": {
        "Activities": "climb hike mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 5,
        "Time": "5 hrs",
        "Total Distance": "18 km",
        "Town": "Kentville, NS",
        "Type": "out-and-back"
    },
    "title": "Pinnacles of Cape Split",
    "trail_id": "11317"
}