{
    "description": "The trail starts out on x-country ski run, so it is wide, well-maintained and has a moderate but steady climb to the top of the ski hill. For those that like their climbs more no-nonsense, there is an option to follow the main road to the ski area and huff straight up the slope.\r\nThe only real scenery comes from the area along the ski hill - and that's of the lovely hike across the valley (Skyline west) that you might find yourself wishing you had done instead. The true highlight of this hike, however, is the wildflowers. With nominal elevation gain after the ski run, you'll find yourself able to enjoy the many, many species of flora along the way. With the heat of this summer (2004) the trail was snow-free in early July, even though it sits at about 2000 meters. \r\nThe lake itself is unspectacular, but clean... and hosts a plague of very intrusive mosquitos and some weird form of dragonfly-like bug that likes to perch on anything synthetic.",
    "directions": "Take HWY #3 to Manning Park. Take the turn-off for Strawberry flats/Gibson ski area (just along the east side of the resort)and continue to follow signs for the ski hill (approx 10km). \r\nIn the summer the road is gated about 2km from the ski area - the trailhead for Poland Lake can be found on the North side, while those for the Skyline trails are on the South Side. For those taking the road option, once at the ski hill follow under the first orange lift (heading NNW) and after a short grind you will meet up with the trail proper.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/1131/reg_DSC6295JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1131/reg_deerJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1131/reg_kileyspondJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1131/topo_polandlakejpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1131/narrow_PolandLakeShelterJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1131/narrow_lupinesjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1131/narrow_mountainflowersJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1131/narrow_polandlakeJPG.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/poland-lake-near-princeton-bc-1131",
    "stats": {
        "Activities": "hike ski-xc mtn-bike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 3,
        "Time": "6 hrs",
        "Total Distance": "14 km",
        "Town": "Princeton, BC",
        "Type": "out-and-back"
    },
    "title": "Poland Lake",
    "trail_id": "1131"
}