{
    "description": "I decided to revisit this place in May 2020.  I bushwcked my way to it but on my return found a well worn trail all the way back to the powerlines.  On the map below, you can actually see the trail leading from the powerline to the top of Melancholy Mountain....this is definitely the easier way to get there!  I will see if I can change the gps rack to the new one and I will add a screen grab of the new track in the pictures.\r\n\r\nThis is a short hike with some minimal bushwhack to get to the top of Melancholy Mountain in Dartmouth. The explanation for the name can be read at the end of this post and is quite tragic.\r\n\r\nThe trail is mostly an old woods road for about 1.2km and then its straight bushwhack towards the mountain. Setting off you can notice that the whole hike is within the Lake Major Drinking Water Watershed Protected Area. You can be in there as long as you follow the simple instructions on the sign such as no OHV, no camping etc....after about 500m you come back under some power lines and the last of the quarry is behind you.\r\n\r\nCross under the power line and the woods road continue. Now you should be able to spot more and more granite ridges where very few plants are able to grow on. Another 500m or so and then you should be able to spot a small hill on your right; that?s Melancholy Mountain.\r\n\r\nThe traverse is through some small shrubs, alders, labrador tea, black spruce and then as you get closer to the mountain (not really a mountain but more of a small hill), you will see Mountain Lake (a small pond) and also some long and somewhat narrow rocky ridges which are great to travel on.\r\n\r\nThere is some flagging tape near the base of the hill and once you get to the top you have a good 180 degrees viewpoint towards Dartmouth. the flagging tape continues towards the east at this point and although I didn't follow it, it must come back on a logging road which starts at the water treatment plant.\r\n\r\n\r\nFrom the GCH6WQ Melancholy Cache Logs of CasheKicker & Vege\r\n\"Tragedy struck on April 11, 1842. John Meagher was in bed with the measles. His wife was tending a newborn baby. The two sisters, Margaret, aged 4, and Jane Elizabeth, just 6, wandered off into the deeply forested woods near Lake Loon. By late afternoon when the children had not returned, a hired hand went to look for them. The father got out of his sick bed and joined neighbours in a frantic search for the little girls. Their bodies were found April 17, just over three kilometres from their home. They had huddled together, trying to protect each other from the elements and wild animals, but they died of exposure. The hill on which they were found is known as Melancholy Mountain and is situated not far from Lake Major. The two girls are buried side by side in Dartmouth's Woodlawn Cemetery.\" As excerpted from \"One City, Many Communities\", by Alfreda Withrow.\r\n \r\n\r",
    "directions": "\r\n\r\nI started at the end of Burnhope Drive which is of off the Montague Rd which you can access from Main St.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/11336/long_DSC0174-panorama-1388507648-stitched-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11336/reg_DSC-0159-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11336/reg_DSC-0162-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11336/reg_DSC-0164-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11336/reg_DSC-0184-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11336/ScreenShot20200526at9.09.13PM.png",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11336/DJI0413.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11336/DJI0415.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11336/DJI0417.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/melancholy-mountain-near-halifax-ns-11336",
    "stats": {
        "Activities": "hike snowshoe",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "4 km",
        "Town": "Halifax, NS",
        "Type": "out-and-back"
    },
    "title": "Melancholy Mountain",
    "trail_id": "11336"
}