{
    "description": "De Miles Lake: Moisie River entrance pointLac de Miles, Minoustouc Lake, Opacoppa lake and Moisie river, an ancestral water route  linking the Labrador Atlantic  hydrographic basin to the  St-Laurewnce river north shore (arrival point at Sept-Iles).   A 400 km canoe trail with over 500 m elevation drop.I am travelling  a lot by plane between Wabush and Montreal via Sept Iles.  I always take a window seat. I am fascinated to look at these waterways and lakes that populate the area and other North features:. So many of them : Esker, the Mon-Groulx,  the Manic 5 reservoir, the Petite Manicouagan reservoir, the Moisie river canyon , the junction with the Carheil river.  Doing the ride on de Lac De Miles was not with the intention to go down to Sept-iles; I am still working and have not enough time to do that; and the sea kayaks are not the right equipment neither.  But to follow a trail that was used for thousands of years by the natives was giving a sense to the effort. A 23 km ride, easy, with a 2.2 km walk to change hydrographic basin, over Quebec-Labrador border.",
    "directions": "The access to the  lake is at KM 51 on road 500 from Labrador City going to Goose Bay.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NL/11331/reg_trail-1-01-8318.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/11331/reg_trail-7-01-8318.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/11331/reg_trailpeak-2-01-8318.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/11331/reg_trailpeak-3-01-8318.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/11331/reg_trailpeak-4-01-8318.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/11331/reg_trailpeak-5-01-8318.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/11331/narrow_trailpeak-1-01-8318.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/de-mile-lake-near-wabush-nf-11331",
    "stats": {
        "Activities": "sea-kayak",
        "From": "",
        "Seasons": "summer",
        "Stars": 3,
        "Time": "6 hrs",
        "Total Distance": "23 km",
        "Town": "Wabush, NF",
        "Type": "out-and-back"
    },
    "title": "De Mile Lake",
    "trail_id": "11331"
}