{
    "description": "The Monk Environmental trail system and Trillium woods are a mix of small hills (small but fun) in Canadian shield rock and forest of the South March Highlands / Kanata.  Long a favourite of Kanata residents, this area is now being encroached by housing but still has a lot of terrain to get lost in (figuratively) and enjoy.  Here's why it's a new (re-discovered) favourite in winter-time for me.With the new  recreation complex off Innovation drive (great 8 lane pool / sauna, gym, spinning) you've got a combination workout possibility.  I like to snowshoe for an hour or so -- then warm up at the recreation complex later with a swim / sauna.  The snowshoeing is first class.  You park at the facility, and cross the street on the west side, near the Hydro cut. Then head South, parallel to Goulbourn Forced road -- yes -- at one time this whole area felt primitive and ancient with deep woods that this road was aptly named for, long before the Terry Fox extension came to be. I first came across (cycled) this road in the mid-90s thinking how wild and remote the area felt.  Housing and development are closing in on this ancient gem where 300 year old maples still exist.In winter, there are no bugs to worry about as you explore this enclave of old growth.  Well, now you have a gym and pool next to it, so I've made a point of combining my swims with my snowshoeing.   Easy access to this great highlands which were islands at the time of the Champlain sea, with a 12,000 year old history of first nations use.  Move up the terrain and climb small clefts and ridges in the deep snow.  Feel the leg burn. You've got some short climbs, and lots of terrain to move about in. Stop next to some old growth pine or maple and look up.  You'll likely run into sections of the official trail system, the summer hiking trails are marked -- and others who live nearby trample the trail down for winter walks in the Trillium woods.But you've come to create your own path by breaking your own trail, exploring the interior of the forest ridges that few who whiz along the Terry Fox extension are aware of.  In the GPS map attached, my route took me through a combination of snowy climbs that spike the heart-rate, with occasional breaks on a groomed trail or two. You've got lots more room to explore (at least for now), but this is just a 45 min to 1 hour workout that gives you a break from the city.  Great combination workout -- and the woods -- you could make an afternoon out of it heading towards and along Terry Fox, or, in the other direction, the woods on the other side of Goulbourn Forced road (Monk trails).   Visit and see if you aren't similarly inspired to learn more about Ottawa's very own mini-Gatineau park that runs from here out to Carp Ridge. (UPDATE: After writing this I've learned that only a small pocket of this area inside the perimeter of the Terry Fox extension will survive i.e. the small woods called Monk / Trillium, see southmarchhighlands.ca). Specifically KNL Phase 8 will spell more demise for a great deal of the adjacent forest.  Take action and write your councillor. Terry Fox Drive split these woods and have allowed developers to fragment this great area that is unique in Ottawa.",
    "directions": "Go to Kanata Richcraft Recreation complex -- park closer to Forced Rd side of the lot (west).  Walk across the road, at the Hydro Cut and then orient yourself left, i.e. to move up the slope in the woods more or less parallel to Forced Rd.  You can't really get lost, you've got Goulbourn forced road on one side (and on the other side of this road -- many kms more of trails / forest to checkout), and Terry Fox on the other.  See attached map for a sample short trek.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/ON/11344/reg_DCIM326[N4533663W07593242T3FEC9246H0069EE]-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/11344/reg_DCIM327[N4533664W07593242T3FEC924FH006A51]-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/11344/reg_DCIM328[N4533672W07593240T3FEC9263H006B00]-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/11344/reg_DCIM329[N4533785W07593138T3FEC93A3H006C6D]-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/11344/reg_DCIM331[N4533789W07593144T3FEC93BEH006F91]-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/11344/reg_DCIM333[N4534155W07593225T3FF9B8ACH005E00]-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/11344/reg_DCIM336[N4534138W07593269T3FF9B8F1H0061CC]-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/11344/reg_DCIM337[N4534117W07593281T3FF9B918H005EB3]-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/11344/reg_DCIM339[N4534006W07593367T3FF9B9E9H006171]-5_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/11344/narrow_DCIM343[N4533928W07593098T3FF9C1FDH006189]-5.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/monk-mystical-trails-near-ottawa-on-11344",
    "stats": {
        "Activities": "snowshoe hike",
        "From": "",
        "Seasons": "winter fall summer",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "5 km",
        "Town": "Ottawa, ON",
        "Type": "out-and-back"
    },
    "title": "Monk Mystical Trails",
    "trail_id": "11344"
}