{
    "description": "This is a true adventure located in the backyard of Dartmouth.  This adventure is nothing like the candy ass trails I usually post where you can get in and out in one hour or two.  Start to finish on this one for me was 5 hours.  There trail is 20km return.  For the first and last 6km I highly suggest you do with a mountain bike to shave some time off.  The final destination is Lookout Hill in the middle of the Waverley Game Sanctuary via a place called the gullies!Starting off you will hike or bike a straight gravel road for 1.5km.  Nothing to report here and this will be the less interesting part of the hike.  Turn on the major trail appearing on your left.  It has a metal gate preventing vehicle access.  The next 4.5km is a dirt road which can be very soft after the rainfalls we just had.  There is little elevation gain or loss except towards the end when you descend into the gullies!Again here you will see mostly the aftermath of some logging but there are some large trees left to show you the size of these mature trees when you leave them grow.  After passing another metal gate (this time entering the lake major protected watershed), you soon do a long descent into the gullies.  Alright I hyped it u p but really I am not sure who came up with that name.  There are a few small stream in the woods with one or two footers but I didnèt see anything gully like down there.  Anyways since the gullies where not my final destination, I shrugged it off and biked to the end of the dirt road.  Now the real adventure begins.  From the end of the dirt road to the Lookout Hill, it is approximately 4km one way, al bushwhacking.  My first plan as to do this in winter so I could use the lakes to circumvent some of the bushwhack.  Soon after leaving the road you cross a small brook and then slowly make your way to a large hill overlooking Frying Pan Lake.  The forest is either thick with alders and brush and then all of a sudden very open and easy to walk.  There is a small brook which feed the lake on its northern end and where this brook flows are really cool features.  There are a few good rock walls lots of boulders, small crevasse caves all within 200m of each other...very neat area.Pursuing you climb up the other side of the brook and then once you reach the top of the next hill, you should be able to walk 100-200m on long granite ridge....this will be the last time for a while where walking will be easy.  From this point on and almost to the Lookout Hill, the walk will be a lesson in patience.  The forest around here are all small trees and shrubs and really hard to get through at some point without tripping and of douse cursing!  Down from the hill you will traverse a small brook.  I choose to go across near the lake (poor trout lake) since the upper reaches look very flat and wide in the sat imagery.  Really who comes up with these names for lakes?  Stay close to the shoreline made sense for me and I was able to get on some thin ice for a while.  The final push to the summit is from the corner of the lake up to the lookout Hill.  If you choose correctly or luckily you might be walking these long granite ridge all the way up.  But if you like cursing like me you will go through some more of the little shrubbery hell.Anyways after about 2 hours I was finally there...I reached the summit of Lookout Hill....expanses of granite running in all directions.  However like other trips I?ve done to mountains (Mt Marcy, Gros Morne Mtn, Mt Adam), the fog covered up all the viewpoints arghhhhhhhhhhhh!  I waited for half an hour expecting the sun to burn off the fog but no luck.  So the picts you see of the summit are pretty lame but the best at the time I was there.  There are too many other places to explore in NS for me to go back there some other time...but I would appreciate for people to post there own pictures of the summit when they go.",
    "directions": "Highway 118 to Exit 5 (Fall River exit).  Park in the metro transit bus parking and take the dirt road which has a metal gate.",
    "geohash": "dxfy",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/11347/long_Panorama-lookout1-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11347/reg_DSC-0003-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11347/reg_DSC-0010-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11347/reg_DSC-0012-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11347/reg_DSC-0033-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11347/reg_DSC-0039-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11347/reg_DSC-0046-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11347/narrow_DSC-0026-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11347/narrow_DSC-0040-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11347/IMG7701.JPG",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11347/IMG7714.JPG",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11347/IMG7725.JPG",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11347/IMG7727.JPG",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11347/IMG7729.JPG",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11347/IMG7738.JPG",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11347/IMG7733.JPG",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11347/IMG7736.JPG",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11347/IMG7746.JPG"
    ],
    "source_url": "https://trailpeak.com/trails/gullies-and-lookout-hill-near-halifax-ns-11347",
    "stats": {
        "Activities": "mtn-bike hike snowshoe",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 4,
        "Time": "6 hrs",
        "Total Distance": "20 km",
        "Town": "Halifax, NS",
        "Type": "out-and-back"
    },
    "title": "Gullies and Lookout Hill",
    "trail_id": "11347"
}