{
    "description": "This hike connects three shorter hikes together to create a great day trip. There is a lot of elevation loss and gain and amazing views. Some bush-whacking was used in the making of this GPS track.The trail up Mt. McDonald is well worn and straight forward. When you reach the building at the top of the hill, take the gravel road a few hundred meters, keeping a lookout for flagging tape indicating the start of the trail again. From here, you are following a faint trail and flagging tape to make your way over a few humps along the traverse.  You can see Mt. Braden ahead of you and start descending, almost to your starting elevations. Here you meet a dirt road. The GPS track may be a bit confusing here because we bushwhacked a bit before realizing we could take the road. When you meet the dirt road, turn left (not the road with the gate) and walk about 300 meters. There will be a trail to your right that starts steeply up the mountain. From here, you are taking a pretty obvious trail up and down the mountain, making sure on the way down that you take the right fork in the trail on the way down so you head towards the parking area. You will meet a larger, road-like trail. Chose to go right to hike Sugarloaf or turn left to get to the parking lot.",
    "directions": "Park one car at the Mt. McDonald trailhead and one at the Mt. Braden/Sugarloaf trailhead.How to get to the Mt. McDonald trailhead:The trailhead is hard to spot if you don't know what you are looking for but there are a number of large rocks on the west side of the road which are a good indicator along with a white CRD sign. From Trans-Canada highway, turn onto Westshore Parkway and turn right through the traffic circle. Follow the road until you get to humpback road where there will be large trees down centreline of the road. At the T-intersection, turn right and park in the Mount Wells parking lot or continue down the road to a pullout.From the Sooke highway, turn onto Humpback road and follow the road until you reach a pullout close to the trailhead. How to get to Mt. Braden/Sugarloaf trailhead:From Victoria, take the Colwood exit (Highway 14) out to Sooke. Right where Sooke Road goes from two lanes to one lane each way there will be a pull off with a mailbox (approx 14 km from when you take the Colwood exit).  Park here and walk back along the highway for 6 hydro poles (about 300 metres). Immediately past the 6th pole - at the point where the power lines cross the highway - you should find a path leading into the woods.",
    "geohash": "c285",
    "photos": [],
    "source_url": "https://trailpeak.com/trails/mt-mcdonald-mt-braden-and-sugarloaf-traverse-near-langford-bc-11351",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 5,
        "Time": "7 hrs",
        "Total Distance": "15 km",
        "Town": "Langford, BC",
        "Type": "out-and-back"
    },
    "title": "Mt. McDonald, Mt. Braden and Sugarloaf Traverse",
    "trail_id": "11351"
}