{
    "description": "The Cable Bay trail is a nice walk through rain forrest on a well maintained trail. It takes you out to Cable Bay and to a bridge. If you cross the bridge you are confronted by a sign that states that property beyond this point is private land. Well, if you want the best part of this trip you need to keep that in mind but keep going as the trail now follows the water all the way to Dodd Narrows which is a site to see. The trail from the sign on is more of a hike than walk so expect ups and downs with slippery rocks, take your time and most people will be able to do it. Dodd Narrows is an amazing spectacle as you see the rushing waters go through this narrow channel. The best time to be there is about an hour before high tide especially if it is a very high tide, wonderful. It looks like a river but it is the ocean! The trail continues from Dodd Narrows up the hill and then loops back through logging slash that has been replanted, this is the most uninteresting section of the trail so you may just want to double back along the way you came so you stay near the water. If you are in good shape it should take you about 2 hours with a few stops along the way to take a few pictures. Be aware that this is a well used trail for dog owners so you may encounter a few friendly dogs along the way.",
    "directions": "See description and / or GPS",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/11362/reg_IMG-1461-46817.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11362/reg_IMG-1462-46817.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11362/reg_IMG-1464-46817.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11362/reg_IMG-1465-46817.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11362/reg_IMG-1466-46817.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11362/narrow_IMG-1463-46817.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11362/narrow_IMG-1467-46817.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11362/narrow_IMG-1468-46817.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/cable-bay-to-dodd-narrows-near-naniamo-bc-11362",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "6 km",
        "Town": "Naniamo, BC",
        "Type": "out-and-back"
    },
    "title": "Cable Bay to Dodd Narrows",
    "trail_id": "11362"
}