{
    "description": "Prevost Island is a beautiful island that is accessible from many different directions in the Gulf Islands.  We accessed it from Mayne Island.  We caught the ferry from Tsawassen and drove off onto Mayne Island.  There is no convenient way to walk onto the ferry with your boat and access the water when launching from Mayne.  The boat launch is about 5 km away to the right of the ferry, it is visible in the same bay as the ferry terminal but the access is up and around so we decided to drive on and park the car.  When launching from Mayne Island do yourself a favor and try to time it with a high tide.  The launch ramp is at the head of a large tidal flat and we had to pack the boats a fair distance to get into the water.  Not too big a deal but all things being equal it would be nice to be able to drop the boats into the water right at the bottom of the concrete ramp and avoid having to pack them.  \r\n\nWe were in the water and padding in no time.  Prevost Island is pretty much due west of Mayne Island; you have to cross a channel that is pretty busy with ferry and recreational traffic so time your crossing wisely.  We had just gotten a VHF radio and were able to monitor the traffic and know when the ferries were coming through Active Pass or approaching from the Victoria side.  The crossing is not long, depending upon your exact path it ranges from 2-3 km.  We aimed at a prominent point just south of Hawkins Islets and this took us less than 30 minutes to get across.  We then paddled along the East shore to Hawkins Islets and meandered through the kelp beds and shallows of the islets.  They are teaming with life, small fishes, crabs; hundreds of colourful sea stars were visible too.  We also saw several moon snails and a number of their egg casings.  Their egg casings look like the top of a big ceramic pot that has been broken off and dropped on the ocean floor.  The large snails mix their eggs with sand and a secretion they create and the final product is a rubbery mixture that they form into these rings and deposit on the ocean floor to await the hatching of the eggs.  They look rather fascinating and feel very interesting, keep your eyes peeled for these when your out.  From Hawkins Islets we paddled towards Peile Point and around that into James Bay.  There is an old orchard at the head of the bay on the right hand side.  There are numerous tent sites in there and we were lucky enough to get the one on the point overlooking the sunset and the bay.  Watch out, as the bay is very shallow at a low-mid tide near shore.  There is a $5 per person per night fee for using the park that is payable into the lock box located at the information sign. There is an outhouse there but no fresh water so plan accordingly.\r\n\nThe next morning we headed out to circumnavigate the island.  We had calculated the tides for a counter clockwise circumnavigation and planned on riding the ebb tide until lunch time when the change occurred and letting the rising tide carry us back to the campsite.  It was great we rounded Selby Point and caught the current right away and we were off.  We pocked into the many bays along the way and explored as we went.  Past Annette Point and to the south side of Secret Island letting the tide assist our progress as we went.  We got to a group of islets just West of Point Liddell and stopped for lunch.  There was a beautiful sandy beach that we pulled up onto and had a shore lunch and enjoyed more shallow sea life as we ate.  We were also timing the turn of the tide so when we headed around the east end of Prevost the tide would now be flooding and then the current would push us along.  We stopped for a few minutes on Red Islets and checked out the camping situation as we had heard there were a few spots to pitch a tent there.  This would be a great little spot to camp if you didn't mind the ferry sliding by your tent flap every hour or so.  There are no facilities or fresh water on Red Islets.  From there it is a short paddle to the lighthouse on Portlock Point.  There are also a couple of little coves that are truly worth checking out, there are interesting rock formations and lots of marine life.  Rounding the point and paddling back up the East side of the island there is a rather large rock wall that is covered with many different anemones and a few little creatures that we couldn't identify.  We paddled back to the camp and it was a great day of paddling.  The circumnavigation was about 20 km +- depending on how deeply you head into the bays for exploration.  Certainly a nice day of paddling, especially if you calculate the tides and currents to work in your favor.  \r\n\nWe did this trip in three days and really enjoyed the pace and distances, the first and third days were both pretty short days as they were paddling to and from the island only, the second day was our circumnavigation paddle.   I'm sure you could use your imagination to make better use of those days and take in more sights, there are lots of those in the beautiful Gulf Islands.\r\n\n EDITOR'S NOTE:  Be careful of these waypoints in the text below, they do not plot to proper points according to MapSource & BlueCharts using NAD83/WGS84 datums.  I created the attached waypoint file from MapSource/BlueCharts and I believe them to be much more accurate. /EDITOR'S NOTE\nHere are the GPS Waypoints for various points of interest on Prevost Island.\r\n\nPeile Point - N 48 51.005  W 123 24.290\r\n\nJames Bay Campsite - N 48 50.411  W 123 24.003\r\n\nSelby Point - N 48 50.622  W 123 24.493\r\n\nAnnette Point - N 48 50.042  W 123 23.051\r\n\nPoint Liddell - N 48 48.504  W 123 21.791\r\n\nBright Islet - N 48 49.877  W 123 21.050\r\n\nPortlock Point (lighthouse) - N 48 48.877  W 123 21.265\r\n\nHawkins Islets - N 48 50.320  W 123 22.178\r\n\nVillage Bay on Mayne Island - N 48 50.537  W 123 19.492\r",
    "directions": "See description and / or GPS",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/1136/reg_oceanjewelryJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1136/reg_prevost.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1136/reg_trophawkinsJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1136/topo_hawkbeachjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1136/narrow_sunetmoonsetJPG.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/prevost-island-near-victoria-bc-1136",
    "stats": {
        "Activities": "sea-kayak",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "14 hrs",
        "Total Distance": "5 km",
        "Town": "Victoria, BC",
        "Type": "out-and-back"
    },
    "title": "Prevost Island",
    "trail_id": "1136"
}