{
    "description": "This is an area of the province that we have probably zoomed by on our way to or from the valley.  Heading towards Halifax, after the Ellerhouse overpass, you can spot two distinct valleys on your right that have brooks which flow into Dawson Brook (the one with the waterfall).Setting off you enter a mature, gorgeous, softwood stand.  The canopy is high overhead and soon you loose the sound of the highway closely.  Head downhill until you hit the Dawson Brook and find a good place to cross.  We ended up at a section which had a big hunting stand overlooking the brook.  Funny thing was we never saw it on the way in as we were looking for a good place to cross on the ice chocked brook.Once over the brook you will intersect a dirt road used by snowmobiles in the winter.  You cross two bridges.  The main valley is the second one and you will know you hit the right spot when 200m after leaving the dirt road you come up to a very big tunnel.  The railroad, now dormant, crosses a couple of hundred feet above and I guess they infilled the whole valley so the tracks would be straight.  The tunnel seem to be long as I couldn't see any light coming through.  This being winter and the water open in the tunnel I could not venture in  (but I will come spring time!).You have a steep ascent to the railroad track and then we followed the woods road into a clearcut leaving the valley to our left.  After a few hundred metres I descended into the steep valley to seek out...what else....waterfalls!  There are a couple of rocky features and some 5-10ft cascade but the geology does not offer a waterfall in this valley.  Pity but the forest is again a mature softwood and it is definitely worth the time to get onto this valley.",
    "directions": "Highway 101 to St Croix Exit.  Highway 1 to Ellerhouse Rd.  Turn on Williams Rd right after crossing the highway.  Turn left on dirt service road and park at the first quarry you see at approx N44 56.181 W63 59.366.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/11366/reg_DSC-0038-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11366/reg_DSC-0043-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11366/reg_DSC-0051-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11366/reg_DSC-0054-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11366/narrow_DSC-0046-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11366/narrow_DSC-0057-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11366/narrow_DSC-0058-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11366/narrow_DSC-0059-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/bog-brook-valley-near-windsor-ns-11366",
    "stats": {
        "Activities": "hike snowshoe",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "5 km",
        "Town": "Windsor, NS",
        "Type": "out-and-back"
    },
    "title": "Bog Brook Valley",
    "trail_id": "11366"
}