{
    "description": "This is more of a winter trailpost of a relatively new ice climbing destination in the area of Folly River. There are two known areas here to climb. The one we visited is called the School House, and the other is further upstream, and is called the Upper Pools. Many thanks to Matthew Peck for the beta and gps data, making for an easy find.According to the guidebook, the grade of waterfall ice ranges from WI 2 through WI 4. We didn't see much beyond WI 3 in the schoolroom area. The hike in is worthy of snowshoes, but we lashed them for the scramble out, as there is a steep bank travel through, and we used our crampons on our exit.If you're destined here to climb, you will need a 70m rope for the main ice formations, because decent anchor trees are higher up. We managed with a 60m but it made for a higher belay station off an ice screw.When you reach the School house, you will have to cross the river. We were there in February and there was enough ice for us to safely cross. There are three obvious ice flows along the East, banked by a high flowing but short waterfall which is pretty to look at, but not worth the climb.From right to left, the first requires a 70m rope to lead, and takes five or six ice screws depending on your skill level. It was pretty thin of ice but easy at the top, but you'll be hitting rocks and choss.  I think the easiest route would be WI 2+. The center flow is nice and flat, but is the shortest of the three, with no obvious anchors at the top, so we skipped that one. To the left, is a beautiful rounded flow with a log jammed at the top. It has three or four possible lines on it, with beautiful formations. Again, a WI 2 / 2+ depending on your route. On our day, it was thin at the top, but not so thin to be hitting rocks and choss. We didn't use the log for an anchor, but a tree to the right hand side. That climb has a nice belay station leaving you leaning against a rock.We were able to fill our day just with the climbs in the school house. 2 leads, and 5-6 climbs between the three of us. Next time, we'll head toward the upper pools to see what frozen gems lay in wait.",
    "directions": "To reach the Schoolhouse, park your car by the east side (as if headed to Amherst) of the highway bridge that crosses the train tracks. There is a Baseline road if you need to turn the car around) Descend the steep snow bank to the tracks below. Be cautious of oncoming trains. It's an active rail line.Walk North along the tracks. Some spots have rock croppings on either side, so if a train comes, you'll have room, but it gives you pause. After the tracks begin to straighten out, and after the rocks, you can veer right. Look for a culvert and stream on your right,  headed toward the river headed East. We paralleled the stream until the final descent. There, we veered right where we thought the slope was less severe. See my gps map. The ice flows will become apparent. Great spot!",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/11369/long_folly-river-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11369/reg_IMG-1878-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11369/reg_IMG-1921-6702_best1_.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/folly-river-ice-climb-near-oxford-ns-11369",
    "stats": {
        "Activities": "hike snowshoe climb",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "1 km",
        "Town": "Oxford, NS",
        "Type": "out-and-back"
    },
    "title": "Folly River Ice climb",
    "trail_id": "11369"
}