{
    "description": "This snowshoe is approx 100km east of Prince George in the Sugarbowl-Grizzly Den Provincial Park.The trail-head is on the left hand side of the highway (when heading East), right beside a small chain-up pull out area.The trail is an old logging road, and is nice and wide, then there is a river crossing (Kenneth Creek) where you will have to find a solid section to cross.  After that is another short section of bushwhacking until you reach the banks of the Fraser.  You turn left (North) follow the bank to the upper and lower narrows of the Canyon (approx 8km from the trail head).I'll be the first to agree that \"Grand\" Canyon is grandiose in the extreme when you consider the Fraser's winding path through southern BC.. But that's the moniker this treacherous section of the Fraser was given way back in the late 20th century, when river-runners in rickety scows would attempt to ferry their wares to Fort George from Tete Jaune (a now abandoned historic town). As many as 200 lost their lives before the arrival of paddle boats traveling up river to McBride necessitated the blasting of many of the more hazardous narrows.There is a summer route, but it is quite a bit longer.  You could take the same route as the winter one, but you'd need some way of crossing the creek.",
    "directions": "The trail-head is on the left hand side of the highway (when heading East), right beside a small chain-up pull out area, approx 100km east of Prince George.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/11378/long_111111111111111-0.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11378/reg_013-Large--0.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11378/reg_033-Large--0.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11378/reg_049-Large--0.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11378/reg_056-Large--0.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11378/reg_059-Large--0.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11378/reg_084-Large--0.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11378/reg_097-Large--0.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/grand-canyon-of-the-fraser-near-prince-george-bc-11378",
    "stats": {
        "Activities": "snowshoe",
        "From": "",
        "Seasons": "winter",
        "Stars": 3,
        "Time": "6 hrs",
        "Total Distance": "14 km",
        "Town": "Prince George, BC",
        "Type": "out-and-back"
    },
    "title": "Grand Canyon of the Fraser",
    "trail_id": "11378"
}