{
    "description": "The Acadian trails in Pomquet (not the one in the Cape Breton Highlands National Park) is a series of stacked loop trails that take you through woodlands and along bluffs overlooking St George Bay near Antigonish.We proceeded on the trails in February and you could discern some tracks from other users.  The road up to the house museum is not cleared in the winter so I suggest you park at the road entrance and go up the hill on foot.  Once at the top of the hill and by the house you have a superb view of the Pomquet Beach...a wide beach which I am sure would be popular in the summer time.There is a map describing the trails and there are subsequent maps at all intersections of the trails which makes navigation easy.  After a few minutes along the bluffs you enter the softwood forest.  The black spruce are a bit stunted close to the shore because of the spray and wind.  After a while you come up to t a small barrier beach and walk along it and then back into the forest.  If you are lucky or insane like me...you choose to go there in the winter and you can do the rest of the hike on the sea ice.  Why?  Well I had spotted some gypsum outcrops from some sat imagery and I wanted a closer look.  I could bring my kayak in summer or come here in winter.  Lots of seal tracks everywhere and big pans of ice to traverse.  There are three major outcrops but unfortunately none of them have any substantial sea caves...  nonetheless the geology of the outcrops and sea stacks are worth the detour.",
    "directions": "Highway 104 to Southside Harbour Rd.  Drive on it until you turn left on Monks Head Rd and then keep left on Monks Head Rd until you come up to Chez Deslauriers (museum)",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/11377/reg_DSC-0161-27177_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11377/reg_DSC-0165-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11377/reg_DSC-0169-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11377/narrow_DSC-0158-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11377/narrow_DSC-0170-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/pomquet-acadian-trails-near-antigonish-ns-11377",
    "stats": {
        "Activities": "snowshoe hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "6 km",
        "Town": "Antigonish, NS",
        "Type": "out-and-back"
    },
    "title": "Pomquet Acadian Trails",
    "trail_id": "11377"
}