{
    "description": "This next hike is into the barrens surrounding Dadies and  Shellbird Lake to an area known to climbers as Sorrow?s End.  The whole hike is on ATV trails which seem to be muddy or running on granite outcrops.  Travelling there in winter is awesome since everything is frozen solid.  The area is peppered with erratic blocs some of which are very large.  After about 20min walking you will come up to Shellbird Lake and see the towering cliffs of Sorrow?s End.  The cliffs are asset on the eastern side of the lake.  There is some flagging tape to a scrambling route to the top.  The scramble is easy as there is a big crack to follow?that is except when you go after a big ice storm where the scrambles is a bit more dicey.  At the top, you have a 360 degree view of the surroundings.   There are a couple of bolts set at the top that look relatively new.Down at the bottom of the cliffs are very interesting cave like features.  Super big slabs of rock have carved out of the cliff face and sit in a jumble pile.  There are many many place to crawl into.  One of which is a perfectly square passage open at each end.  I was lucky enough to be there when the lake is frozen since this passage sits in the water of the lake.",
    "directions": "Terrence bay Rd to Nice View Drive.  Continue on Nice View Dr until an ATV fork on your left.  Park here and follow the atv trail (see gps track)",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/11381/reg_DSC-0333-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11381/reg_DSC-0335-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11381/reg_DSC-0342-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11381/reg_DSC-0350-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/sorrows-end-near-halifax-ns-11381",
    "stats": {
        "Activities": "climb snowshoe hike mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "4 km",
        "Town": "Halifax, NS",
        "Type": "out-and-back"
    },
    "title": "Sorrow's End",
    "trail_id": "11381"
}