{
    "description": "This is a hike that crosses Soldier's Lake before ascending to Granite Lake and Granite Lake Mountain all within the Waverley Game Sanctuary.  This hike is more easily done in winter as you can cross Soldier's Lake.  All other season you will need to portage a boat about 400m to the lake to be able to cross.  There is a gravel road to start from the trailhead all the way to the control dam at Soldier's Lake.  That road is about 400m.  One at the dam, you can see to the right the Granite Lake mountain.  A bit to the left of it as more hills standing behind Granite Lake (your first destination).Cross the lake and find the stream which empties Granite Lake into soldier's Lake.  I was very surprised as I set into the woods to find a very well maintained flagged route all the way to Granite Lake.  The trail passes through some nice mature softwood forest all the time following the small brook as it cascades from one lake to the other.Once to Granite Lake I made my way to the middle of the lake as I had seen on sat imagery some white spots which I thought might had been some tall cliffs plunging into the lake.....I was wrong, its really just a large granite block which extends into the water.  Nonetheless I continued on the lake and then veered to the west to climb Granite Lake mountain.The uphill is quite easy as you can follow some granite ridge.  At the top the vegetation is pretty sparse and you have some views of the two lakes, the airport in the distance as well.  As I made my way back toward Soldier's Lake I stumbled upon another flagged route.  Just incredible same exact spot I was going...somebody all already flagged it!  What are the odds on that.  I would love to hear back from the person who's worked very hard on these routes!  The downhill passes through a hardwood forest which is pretty rare for the easter shore area.  Once back on the Soldier's Lake, I made my way back to the dam, going by a large island which had a trail in the middle...complete with markers on trees!....very mysterious area indeed!",
    "directions": "Highway 118 out of Dartmouth.  Exit 14 (Fall River).  Turn right on Perin Drive.  Park at the intersection of Guildwood as the dm road sits right across from it.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/11387/reg_DSC-0009-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11387/reg_DSC-0032-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11387/reg_DSC-0039-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11387/reg_DSC-0089-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11387/reg_DSC-0091-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11387/reg_DSC-0100-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11387/narrow_DSC-0010-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11387/narrow_DSC-0035-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11387/narrow_DSC-0101-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/waverley-game-sanctuary-near-halifax-ns-11387",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "3 hrs",
        "Total Distance": "8 km",
        "Town": "Halifax, NS",
        "Type": "out-and-back"
    },
    "title": "Waverley Game Sanctuary",
    "trail_id": "11387"
}