{
    "description": "This adventure is so easy and so close to Halifax, I am a bit ashamed I had not explored that area beforehand.  The Terrence Bay Wilderness Area is 20 minutes from HRM but it is a world away.  The area is covered by granite outcrops, cliffs, small talus caves, waterfalls, erratic blocs.  I visited this area in winter so I could walk on the lakes.  This made the journey easier as I didn?t have to bushwack all the time and also it is a great way to see features surrounding the lakes that you may not be able to see up close in other seasons.  I started on Little Lake  and found myself on a trail just east of the lake.  The trail ascends the larges outcrop located SE of the lake.  Once up there you have a 360 degree view of the surroundings and you start to see the many other outcrops as well as the erratic blocs.  I bushwacked my way from this area all the way to Quarry Lake.  Once on the lake I visited the very nice waterfall at the outlet of the lake.  There are signs of some camping right at this point.  The fall is a couple of drops of about 5 feet and then a slide of about 15ft.  Right beside the slide-fall there is a series of giant boulders that have created some cave like features one of which has running water in it.  By the top of the outlet of the lake, and on the south side, there is a large rectangular hole (see the video) that looks about 20 ft deep?.looks fun to explore another day.I crossed quarry lake and passed by another large 50ft plus granite outcrop overlooking the lake.  Found an ATV trail on the opposite side and climbed a hill to the north of Whale Cove Lake.  Again another spectacular 360 degree viewpoint.  I then followed the atv track down to the Whale lake and went to see two more large rocky outcroppings...one of which had nearly enough ice for some ice climbing.  I then ascended the southeast corner of the lake at a big outcrop.  From this point on it was some more bushwacking to a couple of unnamed lake to the east of Whale Cove lake before I got to Long Pond where I met up with an ATV trail.  There are a couple of small falls and slides on Brophy?s Run and I followed an ATV trail all the way back to my starting point.  I would do this hike again in winter.  If you can stand the sound of cracking ice underneath your footsteps, you will be rewarded with sights seldom seen.",
    "directions": "Terrence Bay Rd.  Turn on River Rd and park at Little Lake.  There is a trail starting north of the lake to take you into the wilderness.",
    "geohash": "dxft",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/11380/reg_DSC-0228-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11380/reg_DSC-0233-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11380/reg_DSC-0288-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11380/reg_DSC-0292-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11380/narrow_DSC-0280-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/terrence-bay-wilderness-area-near-halifax-ns-11380",
    "stats": {
        "Activities": "climb snowshoe hike mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 5,
        "Time": "5 hrs",
        "Total Distance": "8 km",
        "Town": "Halifax, NS",
        "Type": "out-and-back"
    },
    "title": "Terrence Bay Wilderness Area",
    "trail_id": "11380"
}