{
    "description": "This is just a short trail located in Terrence Bay.  I ended up there after visiting the Terrence Bay Wilderness Area and Sorrow?s end trails.  It?s a very short trail suitable for everybody.  It is made up of crushed material for the first part and then it becomes a long wooden boardwalk festooned with benches overlooking Terence Bay.  The trail goes by a pioneer cemetery before finishing at  a memorial on the sinking of the SS Atlantic.  There is a nice looking sandy beach close to the lighthouse as well.From Wikipedia (http://en.wikipedia.org/wiki/RMS_Atlantic) ; At 3:15 a.m. local time on 1 April 1873, the Atlantic struck an underwater rock off Marr's Head, Meagher's Island (now Mars Head, Mars Island), Nova Scotia.[1][2][3] Lifeboats were lowered by the crew but were all washed away or smashed as the ship quickly filled with water and flipped on its side. Survivors were forced to swim or climb ropes first to a wave-swept rock and then to a barren shore. Residents of the tiny fishing village of Lower Prospect and Terence Bay soon arrived to rescue and shelter the survivors, but at least 535 people died, leaving only 371 survivors.[4]",
    "directions": "Terrence Bay Rd to Sandy Cove Rd.  Continue on Sandy Cove Rd until the sign for the SS Atlantic Heritage Park and Trail.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/11382/reg_DSC-0374-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11382/reg_DSC-0380-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11382/narrow_DSC-0376-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/ss-atlantic-heritage-park-trail-near-halifax-ns-11382",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 2,
        "Time": "1 hrs",
        "Total Distance": "1 km",
        "Town": "Halifax, NS",
        "Type": "out-and-back"
    },
    "title": "S.S. Atlantic Heritage Park Trail",
    "trail_id": "11382"
}