{
    "description": "This is a fairly easy, quite short, but somewhat steep hike. You can just about drive all the way to the top with a good vehicle under the right conditions. The views of the South Thompson River valley are outstanding.The hike is about 30-40 minutes to the top.",
    "directions": "To get there, take the Trans Canada East from Kamloops. 8.2 km out of town look for the exit for Dallas Dr (signs for Dallas Drive/Barnhartvale Road/Kipp Road). At the roundabout, take the 2nd exit and stay on Dallas Dr. About a half km down Dallas the road splits?go to the right up Barnhartvale Rd and drive through the sandstone cutbanks. 7.8 km down Barnhartvale turn right onto Robbins Range Road. This is where it gets a bit tricky, because you have to make several turns to stay on Robbins Range Road. The first is a fork 1.8 km after the turn from Barnhartvale. Straight/left has a sign that says ?no through road? you turn right here. This is variously called Campbell Range Road or Robins Range Road. 0.9 km later you make a sharp left to stay on Robins Range Rd. You stay on this road for 5 km. On the left you will see a sideroad going up the hill, suitable for off-road vehicles. Park here and hike.The road curves up and around the hill. Stay on the right to get to the pinnacle. GPS track available.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/11398/reg_IMG-1426-26033.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11398/reg_reducedIMG-1423-26033.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11398/reg_reducedIMG-1424-26033.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11398/reg_reducedIMG-1425-26033.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11398/reg_reducedIMG-1426-26033.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11398/reg_reducedIMG-1427-26033.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11398/reg_reducedIMG-1428-26033.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/buse-pinnacle-near-kamloops-bc-11398",
    "stats": {
        "Activities": "snowshoe hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "3 km",
        "Town": "Kamloops, BC",
        "Type": "out-and-back"
    },
    "title": "Buse Pinnacle",
    "trail_id": "11398"
}