{
    "description": "There are two trails at Roche Cove - the Matheson Lake trail and the Cedar grove trail.  This description is for the Ceder Grove trail.The trail has rocky outcrops, up a moderate incline into lush temperate rainforest and down through large big-leaf maples. Look up into the canopy, where the limbs of these giants support a microcosm of licorice ferns, mosses and lichens. The viewpoint trail to the right (not included in the tracks) leads to a peaceful place to stop and have lunch, though trees have grown up to obscure the view of Roche Cove. From the main trail, keep right at the first fork and you will come upon a huge fallen cedar, one of several cedars in this grove that are over 500 years old. Past the Cedar Grove, an alder forest on your left is an excellent birding spot in the fall and spring. The trail emerges onto the Galloping Goose Regional Trail, where you can turn right to return to the Roche Cove parking lot. Along this abandoned rail line, you?ll find patches of stonecrop, a native succulent that blooms in late spring/early summer.The trail can get fairly wet in the winter, but it's still worrh a hike, especially if you don't mind slogging through the mud in places.",
    "directions": "Follow the Trans-Canada Highway from Victoria, and take the Millstream Road exit (Exit 14) to Langford. Follow Veterans Memorial Parkway, then turn right on Sooke Road. From Sooke Road, turn left on Gillespie Road, which leads to the park entrance on the left. Allow approximately 45 minutes driving time from Victoria. Roche Cove is also accessible from the Galloping Goose Regional Trail.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/11406/reg_C5B8A336-AE32-4AF5-BE7B-3FFF3BCA6240.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/roche-cove-ceder-grove-trail-east-sooke-near-sooke-bc-11406",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "2 km",
        "Town": "Sooke, BC",
        "Type": "out-and-back"
    },
    "title": "Roche Cove, Ceder Grove trail, East Sooke",
    "trail_id": "11406"
}