{
    "description": "The well defined, 4.5 km trail to Hornaday Pass climbs gradually up Norboe Creek, through a mixed forest of predominantly Douglas-fir; lodgepole pine; whitebark fir and trembling aspen. In many places it crosses fine talus slopes and avalanche chutes, which can hold snow into the early summer. Recreationists should be aware of the potential for avalanches at almost anytime of the year. At the pass there is a small cabin, and a rustic campsite, for the use of hikers and horseback riders. The pass is a good place for viewing goats and big horn sheep. Bear sightings are not unusual, so, be prepared. From the pass, skilled route finders can follow an indistinct and intermittent trail north up Brule Creek. For those heading down Brule Creek, the first part of the trail is indistinct.Follow the obvious route, and you will soon come upon a well defined trail, which continues east down Brule Creek to the Elk River valley. This section of the trail is about 9.5 km long.",
    "directions": "Commencing at Fort Steele Historic Park, proceed north on Hwy 93/95 for  300 metres. Turn right onto the Wardner ? Ft. Steele Road. Follow this  road for 22 km to the Power Plant Road. Turn left onto this road and  follow it over the birdge on the Bull River Canyon. On the east side of the  canyon, you will find yourself at the 22 km road marker on the Bull River Forest Service Road. Turn left and continue following the Bull River Forest Service Road to Norboe Creek, between the 74 km and 75 km road markers. There is a Forest Service Recreation Site on the southside of Norboe Creek. The Hornaday Pass Trail starts 70 m north of the Norboe Creek bridge. Park at the trail head sign, or at the recreation site.",
    "geohash": "c2y5",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/11418/long_Hornaday-47458.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11418/reg_DSCF4152-47458.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11418/reg_DSCF4153-47458.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/hornaday-pass-near-elkford-bc-11418",
    "stats": {
        "Activities": "snowshoe hike ski-bc mtn-bike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 5,
        "Time": "6 hrs",
        "Total Distance": "14 km",
        "Town": "Elkford, BC",
        "Type": "out-and-back"
    },
    "title": "Hornaday Pass",
    "trail_id": "11418"
}