{
    "description": "I was looking at the satellite imagery close to Meteghan when I spotted some cliff-like features that begged to be explored.  A dirt road leads you almost to the top of the cliffs so it?s a fast hike to some really rewarding vistas.   A metal gate blocks off a side road which on my topo they call Deerfoot Trail.  I will have to get back there to explore that portion further.The dirt roads ends at the top of the cliffs and then there is a beehive of smaller trail going everywhere.  Keep straight and head down the grassy slope.  Go through the conifer stand in front of you.  The trail appears to end on a 25ft drop but if you look closely you will spot a rope that helps you descend a narrow crevasse and get to the beach.  Really you do not need the rope if you are careful.Once on the beach the high cliffs surround you.  There are made up of various material and look pretty solid.  On the eastern side of the cove you can get into a large sea cave while on the other side there is a small trickle of water which has carved out a large opening straight into the cliffs which you can enter.  The rest of the place is just fun to walk around and maybe could offer some good sport climb routes.",
    "directions": "Highway 1 in a west direction from Meteghan.  Turn on Deveau Shore Rd and park at its conclusion on top of the cliffs",
    "geohash": "dxbgj9",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/11427/narrow_DSC-0190-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11427/reg_DSC-0180-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11427/reg_DSC-0192-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11427/reg_DSC-0196-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11427/narrow_DSC-0195-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/deveau-shore-sea-cave-near-yarmouth-ns-11427",
    "stats": {
        "Activities": "climb hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "2 km",
        "Town": "Yarmouth, NS",
        "Type": "out-and-back"
    },
    "title": "Deveau Shore Sea Cave",
    "trail_id": "11427"
}