{
    "description": "Kayaking is out of Ladysmith harbour, just 30-40 min South of Nanaimo. There are 3 options, paddle around the harbour for a few hours and try some Seaward kayaks (the plant is nearby. Paddle to Thetis as option number 2 (great pub for lunch).  Option 3 involves an overnighter and camping at Blackberry point on Valdes Island, a gorgeous 300+ foot beach with driftwood, shells, & a Robinson Carusoe feeling.\r\n\r\nThe Island Outdoor Centre is in Ladysmith, at the old historic railyards close to the public marina and docks.  Rent a kayak and go, paddling around Ladysmith Harbour, or, paddling out across Stuart channel (2 hour crossing) to Thetis to explore some awesome coastline, and, even a pub (in between Thetis and Kuper Island).\r\n\r\nSome old rich dude (Batman - as reported) owns a swack of land on Thetis and it so happens our crossing target (pretty much the shortest crossing - the red line shown on the map between Coffin Pt out of Ladysmith and half way between Fraser Pt Crescent Pt but closer to Crescent) took us close to this gorgeous shell beach and \"unofficial\" campground area complete with picnic tables, running water, and, some great seaside, and impressive arbutus and cedar forest in behind.  A related post on trailpeak for Gabriola Island has a great map showing Thetis and Valdes and Blackberry Pt. You can see it here.\r\n\r\nIt feels different on the Islands.  It's drier.  The vegetation very different, you are a half-days sailing (ferry trip) out of Vancouver, then a 3 hour kayak, but a world away.  Go further to Valdes (and Blackberry Point) and you are could just as well be in Hawaii, the beach at Blackberry very impressive.  THE CROSSING TO VALDES HOWEVER IS ANOTHER 2 to 3 HOURS and there is considerable boat traffic - and as we found, depending on the weather, some rather big waves and wind.  Blackberry Pt on Valdes is part of the Pacific Marine Trail - complete with a very cool solar/sawdust toilet and 400+ feet or more of gorgeous beach.  An unfortunate clearcut just in behind (between the beach and the towering cliffs - you can hike up - in behind) should not have been allowed, but the logging companies somehow have rights here.  More people need to go to ensure the area is protected, as is the northern half of the Island.  If you visit, be very careful NOT to paddle around Valdes into either narrows between Gabriola Island (to the North) and Galiano Island (to the South) unless you are a very competent paddler with tide table and current table reading experience, so you can paddle through at slacktide - least you get sucked into a whirlpool or deal with 6 knot current you cannot beat.  \r\n\r\nAnd generally, using the currents instead of fighthing them to get to your camp-spot or day paddle makes sense. \r\n\r\nSo, take it to Thetis and paddle to the pub between Thetis and Kuper, perhaps explpore the coastline.  More advanced paddlers can plan a trip to Valdes, where cougars are known to still roam, caves exist, and a strange but friendly fellow named Crazy Pete (who lives on a self-sufficient houseboat nearby) may well pay you a friendly visit and tell you the history of the Island (if you are nice, and if you have the right vibe, he may even offer you a tour!).\r\n\r\nThetis and Valdes, worth the outing.",
    "directions": "Take the Ferry over to Nanaimo from Horsehoe Bay and drive South 30-45 minutes to Ladysmith.  2nd lights (I believe) turn left down to the old Historic Railyards where the Outdoor Centre is that rents Seaward Kayaks.  Paddle straight off the docks in Ladysmith Harbour, and if you are comfortable - go for Thetis!",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/1142/reg_CHRIS4Shadowlgejpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1142/reg_Johncovelgejpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1142/topo_GLENN2Legendlgejpg.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/thetis-valdes-island-near-nanaimo-bc-1142",
    "stats": {
        "Activities": "sea-kayak",
        "From": "",
        "Seasons": "summer",
        "Stars": 3,
        "Time": "7 hrs",
        "Total Distance": "15 km",
        "Town": "Nanaimo, BC",
        "Type": "out-and-back"
    },
    "title": "Thetis & Valdes Island",
    "trail_id": "1142"
}