{
    "description": "This used to be an 8km hike on old woods road and ATV trail.  There has been some development in the area and now a logging road takes you most of the way there.  I didn?t have time to do the long hike so here is a description of the short hike.  The hike takes you to a feature called Grandmothers Head which is a giant outcrop of granite in the middle of nowhere.The area surrounding Grandmothers head is littered with giant granite boulders and outcrops.  Vegetation is composed mostly of conifers and low lying brush.  The part of the head or cliff facing the road is the steepest so there is a trail that goes around the side and to the back and takes you all the way up there.  At the summit there is a location marker from the geological survey and you can also see the numerous boulders all around as well as panoramas all around.  You can also see how much logging has occurred.  I would go back to this place with my climbing shoes as there is a lot of bouldering opportunities.",
    "directions": "Exit 11 on highway 103.  North on cornwall Rd.  Turn right on Newburne Rd and another right on Walburne Rd..past the Lunenburg Co winery, Turn left on Woodstock Rd and follow it.  You will need to look at satellite imagery as there are numerous new logging one of which will take you within a few hundred metres of this hike.  Alternatively you can start it on Woodstock Rd (google grandmothers head hike)",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/11432/reg_DSC-0122-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11432/reg_DSC-0135-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11432/reg_DSC-0140-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/grandmothers-head-near-mahone-bay-ns-11432",
    "stats": {
        "Activities": "hike snowshoe climb",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "1 km",
        "Town": "Mahone Bay, NS",
        "Type": "out-and-back"
    },
    "title": "Grandmother's Head",
    "trail_id": "11432"
}