{
    "description": "This is a hike at the back of the Sugar Moon Farm in Earltown.  There is the more traditional hike close by; Rogart Mountain but this one is shorter, prefect for the young ones and to burn off the pancakes.The trail starts at the back of the building and for a little while is set in an open field settings.  The climb is steady but not very steep.  At the end of the slope and before entering the maple forest, turn around and admire the 180 degree view offered to you.  Into the forest and across a small brook you will spot the old sugar shack.  Up above the shack lies the heart of the operation a stand of mature maple trees linked together with the tubing necessary to bring the sap all the way down to the farm.   Have a look at the building and then head a little bit more into the woods in a south direction.  Eventually the trail cycles back to the open, slopped, field you started on.",
    "directions": "Highway 311 to Earltown.  Turn on Alex MacDonald Rd and park at the Sugar Moon Farm.   This trail starts at the back of the farm while the Rogart Mountain trail starts upfront of the farm.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/11434/long_Panorama-erable-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11434/long_Panorama-sugar-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11434/narrow_DSC-0014-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11434/narrow_DSC-0026-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11434/narrow_DSC-0103-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/sugar-shack-near-truro-ns-11434",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "1 km",
        "Town": "Truro, NS",
        "Type": "out-and-back"
    },
    "title": "Sugar Shack",
    "trail_id": "11434"
}