{
    "description": "Prince Edward County isn't necessarily known for mountain biking, but Macaulay Mountain is a wicked spot with lots of technical single track in the heart of The County, just outside of Picton.So, if you're in the area for some of the better known tourist attractions - Sandbanks, wineries, galleries, antique stores, coffee shops, and a growing  number of fine restaurants - you'll seriously want to consider bringing your bike to hit this set of trails.   Part of a quirky conservation area that includes a birdhouse village, the mountain biking trails are challenging and well maintained.  Within a relatively small area, there are over 20 km of trails spanning everything from easy-cruising pathways to treacherous downhills to rock-hopping madness, with plenty of roots, stream crossings, and thick forest to keep things interesting.This place manages to pack it all in.  It draws riders regularly from across the region, as well as appealing to County tourists who need their mountain biking fix.",
    "directions": "On the south-east outskirts of Picton.  Take Union Street (#8) just past downtown, and you'll see a big sign for Macaulay Mountain Conservation  within a few hundred meters.   Turn right at the sign.  You can't miss it.",
    "geohash": "drc4",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/ON/11437/reg_2014-04-20-16.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/11437/narrow_15.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/11437/narrow_2014-04-20-15.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/macaulay-mountain-conservation-area-near-belleville-on-11437",
    "stats": {
        "Activities": "hike mtn-bike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "20 km",
        "Town": "Belleville, ON",
        "Type": "out-and-back"
    },
    "title": "Macaulay Mountain Conservation Area",
    "trail_id": "11437"
}