{
    "description": "MINE and MINE too are two newer unofficial trails built by volunteers. It has all the classic features a cross country mountian bike rider loves. I nice steady climb with some punching segments. Swooping berms on fast sections and technical rocky sections. Its a gem.",
    "directions": "Start out on the lac le jeune road leaving kamloops. Just past the truck scalesthere is a parking are to the left ( sugarloaf road turns to the right ). Park here. Take the double track up to the top. When you reach a fence, do not cross it but turn right and follow it approximately 500m. A fence crossing appears on the left. Do not cross the fence but turn 90 degree right on the double track. Follow the double track for about another 500m and then you will see the single track on your right. The single track will lead to a split, take 180 degree sharp turn here. Another split in single track just there after ( approximately 100m) keep left here and then you are on MINE TOO. the single track will eventually spit you out onto some grassy double track. If you follow the gps map you will now see two options. If you continue on the grassy double track you will reach the official start of the MINE trail and the technical drop that most intermediate riders will walk down, but is a great challenge. This loops eventually returns to this spot which is the start to the Mine's Tail. This is the jewel in the crown of this trail. It has little jumps with chicken runs past them. Short rocky technical little climbs and drops , but mostly fast swooping single track that leaves you wanting more!",
    "geohash": "c342",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/11442/reg_1-34667_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11442/reg_2-34667.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11442/reg_3-34667.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11442/reg_4-34667.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11442/reg_5-34667.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11442/reg_7-34667.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mine-near-kamloops-bc-11442",
    "stats": {
        "Activities": "mtn-bike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "12 km",
        "Town": "Kamloops, BC",
        "Type": "out-and-back"
    },
    "title": "MINE",
    "trail_id": "11442"
}