{
    "description": "This is a hike to the only fall...make that cascade on Fulton Brook.  There is also a huge amount of gypsum exposures, and resulting karst topography,  if you know where to look.I had bushwhacked my way on the lower part of this brook for about 15 km on either side of the brook a few years ago looking for some caving potential.  I had seen lots of big ass gypsum cliffs but only one to two small opening that may have caves if you are willing to squeeze yourself into small holes full of running water from the brook.This time I went back since I had spotted what looked like a fall on the upper reaches and also I was going to explore some more white spots I saw on the satellite imagery for the caving aspects.  The fall is easy to find and is only about 400m from the road.  The fall lies in a beautiful and untouched for a while hemlock grove.  the whole place is covered by a thick layer of moss and so is vibrant green!Onto the gypsum I went after.  I walked for a while and then chanced upon a nice ATV trail that took me to the first mounds of gypsum.  I ended visiting three of those mounds and two of them had a brook which flowed upstream from the exposure and slipped under the exposure before resurfacing on the other side a distance of about 100m or so.  If ou are really into caving you might push your luck and squeeze into one or both of them but seems a bit crazy for someone alone in the woods!    There is another outlet on Fulton Brook itself which had a strong cold air presence indicating some passage but again a tight squeeze  at best.",
    "directions": "From highway 289 turn on highway 336 and turn again on Harrison Rd before turning again on Alex Semple Rd.  Park where you see my gps track beginning ..there is an old logging rd across from somebody's entry.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/11448/reg_DSC-0027-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11448/reg_DSC-0053-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11448/reg_DSC-0057-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11448/narrow_DSC-0062-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/fulton-falls-and-caves-near-truro-ns-11448",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 3,
        "Time": "3 hrs",
        "Total Distance": "8 km",
        "Town": "Truro, NS",
        "Type": "out-and-back"
    },
    "title": "Fulton Falls and caves",
    "trail_id": "11448"
}