{
    "description": "As of May 16, 2014, this is the extension of the Upper Shannon Falls trail trail-Upper-Shannon-Falls-Viewpoint-near-Squamish-BC-2607 to the top of the Sea to Sky Gondola that opened on May 16, 2014 ( http://www.seatoskygondola.com/ ).It is also the access to the Shannon Falls to Petgill Lake trail.Start at Shannon Falls parking lot (NOT the Stawamus Chief lot), and it's approx 4.5 kms, and 500 m up, from Shannon Falls to the lookout 15 mins above the Upper falls (do NOT turn left 500 m into the hike where the sign directs to the gondola, that takes you to the base, you want to go to the summit). From the lookout, head east on the trail marked \"Sea to Summit\" trail (the markers start at the start of the trail near Shannon Falls, you've been following them all along). You'll be on a trail heading up for approx 1 km, and you'll arrive at an old logging road. Were you to turn right at this point, you would go to Petgill Lake and eventually Murrin Lake Shannon-Falls-to-Petgill-Lake-or-vice-versa-near-Squamish-BC.Turn left, as indicated, and you'll be on a gentle upgrade for approx 4 kms all the way to the gondola, although at one point, you can turn left and follow an alternate trail called Wrinkle Rock Connector (will have to try this one next time).Total distance from Shannon Falls to the Gondola is 10 k, total ascent is 1000 m.The price to descend the gondola is $10, ride is approx 10 minutes. At the bottom, turn right out of the gondola station, walk straight to the east (back) end of the parking lot and you'll see the 500 m trail back to the Shannon Falls parking lot.",
    "directions": "Highway 99 (Sea to Sky) north from Vancouver to Squamish (less than 1 hour drive), turn into and park in the Shannon Falls parking lot. Take the hike towards the Chief, but at the intersection to go straight to the Chief, turn right on the \"Upper Shannon Falls\" trail, the one marked \"Undeveloped and Unmarked\", which is a great sign, because the trail is both developed and marked, but the sign seems to scare people away, such that the trail is very quiet, especially on weekend days when the Chief trail is as crowded as the Squamish Hwy itself.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/11459/reg_Seatosummit1299-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11459/reg_Seatosummit1303-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11459/reg_Seatosummit1304-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11459/narrow_Seatosummit1300-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11459/narrow_Seatosummit1301-7359.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/sea-to-summit-near-squamish-bc-11459",
    "stats": {
        "Activities": "snowshoe hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "4 hrs",
        "Total Distance": "10 km",
        "Town": "Squamish, BC",
        "Type": "out-and-back"
    },
    "title": "Sea to Summit",
    "trail_id": "11459"
}