{
    "description": "Randy Stoltmann Commemorative Grove is one of two trails from the Carmanah Walbran Provincial Park trailhead. It is the shorter of the two trails and takes you to the Heaven Tree and then to the Randy Stoltmann Grove. The trail continues past the grove but is officially closed and becomes extremely overgrown quickly.There are lovely campsites with tent sites, picnic tables and firepits. Two sets of outhouses. There is a water pump but \"A vandal stole the handle\" so it's not useful. There is a fresh water waterfall along the trail to the campsites that is okay to drink but boil or treat if you are unsure.http://www.env.gov.bc.ca/bcparks/explore/parkpgs/carmanah/",
    "directions": "From the BC Parks Website:Carmanah Walbran Provincial Park is located 20 km northwest of Port Renfrew on the southwestern coast of Vancouver Island. There are three different routes leading to the Caycuse River Bridge, which is the only way to access the park. Visitors traveling from Port Alberni should follow the Bamfield Road for approximately 40 km to the Franklin River Junction. At the junction, turn left onto South Main and proceed eastward, past the logging camp buildings and toward Nitinat Lake. Continue on South Main for approximately 23 km to the Nitinat River Bridge. Stay on South Main until reaching the Caycuse River Bridge.Travelers from Port Renfrew should follow the Lake Cowichan Connector Road north to Honeymoon Bay. At Honeymoon Bay, turn left and proceed along South Shore Road, which becomes Nitinat Main, continuing to the junction of Nitinat Main and South Main. Turn left onto South Main and proceed to the Caycuse River Bridge. Those accessing the park via Lake Cowichan should follow South Shore Road past Gordon Bay Provincial Park to the Nitinat Main, or follow the North Shore Road through Youbou to the Nitinat Main. Continue along Nitinat Main till it connects with Junction South. Turn left onto South Main and proceed to the Caycuse River Bridge.Once you have crossed the Caycuse River Bridge, turn right immediately and proceed on Rosander Main for approximately 29 km to the park.Communities near the park include: Port Renfrew, Port Alberni, Cowichan Lake, Duncan, and Victoria.  There is gas available in Port Renfrew and Lake Cowichan and SOMETIMES Nitnat but don't count on it.The final 10km of the logging road to Carmanah is very potholey and overgrown, if it has been raining a lot it will be like a small lake in places.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/11454/reg_DSCN3892-small-47757.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11454/reg_DSCN3908-small-47757.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11454/reg_DSCN3909-small-47757.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11454/narrow_DSCN3894-small-47757.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/randy-stoltmann-commemorative-grove-near-lake-cowichan-bc-11454",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring summer",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "3 km",
        "Town": "Lake Cowichan, BC",
        "Type": "out-and-back"
    },
    "title": "Randy Stoltmann Commemorative Grove",
    "trail_id": "11454"
}