{
    "description": "This is a shorter version of the Diez Vistas trail (see http://www.trailpeak.com/trail-Buntzen-Lake-Diez-Vistas-near-Vancouver-BC-80 )Rather than going all the way to McCombe Lake at the north end of Buntzen Lake, turn right at the T intersection 900 m past vista # 10, or 80 m after dropping down to the logging road.Starting at the SW corner of the Buntzen Lake parking lot, it's 7.35 km to vista 10. From there, it's 850 m to the bottom of the steep hill that bring you to what appears to be an old logging road, where you take a right turn. 80 m later, you normally turn left at a T intersection, with an overgrown trail on the right. Turn right. The trail is very overgrown for 40 m, with 4-5 logs across the trail. The trails then opens up and starts heading downwards, and east, for 500 m, where you connect to the Lakeview trail, at the south, bottom end of the highest hill on this trail (ie, you have avoided it).As this trail is not used very much, it's quite rough. It was marked with pink ribbons on May 30, 2014. As you drop towards the Lakeview trail, you will come to a creek or creek bed on your left. Keep to the right of it, until you cross it as you arrive at the Lakeview trail.From there, it's 7 kms via the Lakeview trail back to the parking lot across the floating bridge, or, if you cross over to the Buntzen Lake trail 1.5 km south, approx. 6 km back to the pl via the lower trail.Total distance is 15 km, with 800 m total ascent.",
    "directions": "Start from the SW corner of the Buntzen Lake parking lot, head SW across the floating bridge, and head up the Diez Vistas trail, until you reach the T intersection, 900 m north of vista # 10.",
    "geohash": "c2b8",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/11462/reg_IMG-1318-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11462/narrow_IMG-1317-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11462/narrow_IMG-1320-7359.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/diez-vistas-short-near-anmore-bc-11462",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "4 hrs",
        "Total Distance": "15 km",
        "Town": "Anmore, BC",
        "Type": "out-and-back"
    },
    "title": "Diez Vistas short",
    "trail_id": "11462"
}