{
    "description": "Nice day hike with great views of Harrison Lake and surrounding environs.  Constantly changing terrain makes each leg quite short and you are on top before you know it.",
    "directions": "Beginning in Harrison Hot Springs, head north along the east side of the lake until you reach a fork about a km past the Sasquatch Provincial Park entrance.  Take the left fork (Harrison-East Forest Service Road) and continue along for 4.8 km, turning right onto the branch Slollicum Forest Service Road. With a 2WD, drive up this as long as you can (it's not far if you park at the bottom) and park out of the way, or with 4x4 park at about 0.8km where a road branches off to the left and the main road continues steeply uphill towards the right.On foot, follow an old road north a short ways keeping an eye out for markers on the right slope which immediately takes you up to an open rock slide area.  If you follow the old road to the end, you've gone too far.  From here, follow markers up until you reach a second old road and continue heading north.  You will come to a road junction - the left heads to Lookout Peak or stay straight for Slollicum.  Markers are obvious and through varying terrain, you will reach the summit ridge which you follow to the summit.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/11464/long_20120930-049-26979.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11464/reg_20120930-005-26979.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11464/reg_20120930-016-26979.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11464/reg_20120930-020-26979.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11464/reg_20120930-033-26979.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11464/reg_20120930-042-26979.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11464/reg_20120930-050-26979.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11464/reg_20120930-069-26979.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/slollicum-peak-near-harrison-hot-springs-bc-11464",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 3,
        "Time": "7 hrs",
        "Total Distance": "14 km",
        "Town": "Harrison Hot Springs, BC",
        "Type": "out-and-back"
    },
    "title": "Slollicum Peak",
    "trail_id": "11464"
}