{
    "description": "This is a composite of Cypress Lake and Cypress Lookout, but also using some different routes in part.Did this late May 2014, snow was all gone. From the trailhead identified at \"Directions\", headed up the paved road, which turned to gravel. This is one of the hardest parts of the trail, as the gravel is large, often twisted ankles waiting to happen. Also quite steep, rose 350 m over 2.5 kms.See GPS data for the trail.After Cypress Lake, continue north on the trail, and do a circuit, which takes you to the huge open rock, Cypress Lookout, with great views SE and SW.Although the forest and trail in the summit area are great, the trails up and down are rough, with quite a bit of large blow downs, with the usual mud and roots, some swampy areas. Very much worth it though.On the way down, west side, you will find yourself on the Lindsay Lake trail for approx 1 km. Do NOT miss the left turn back to the Coquitlam trails, otherwise, you will find yourself going down to Buntzen Lake, with a very long wall back to your vehicle, or steep hike back up to the Coquitlam trails.On the way down, at the bridge over the creek (see photos), we continued west and came out parallel to Parkway Drive along the power line. Note that this is a longer route, but different, although it does have its share of large, ankle breaking roads.At the bottom, you must continue east (ie, turn left at the paved intersection), left again at the sign for the park, and then follow the power line all the way back to your vehicle. There will be 2 baseball diamonds on your left, and a golf course on your right.",
    "directions": "Take Johnson Street in Coquitlam all the way to the top. Along the way the name changes to Plateau Blvd and takes you past the Westwood Plateau golf course. There is a widened gravel area for parking or carry on a short distance and park on the shoulder just before the gate. Do NOT park beyond the green gate, as this is often locked, and you could be locked in.",
    "geohash": "c2b8",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/11477/reg_IMG-1333-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11477/reg_IMG-1334-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11477/reg_IMG-1335-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11477/reg_IMG-1336-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11477/reg_IMG-1337-7359.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/cypress-lake-lookout-near-coquitlam-bc-11477",
    "stats": {
        "Activities": "mtn-bike ski-bc hike snowshoe",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 4,
        "Time": "5 hrs",
        "Total Distance": "16 km",
        "Town": "Coquitlam, BC",
        "Type": "out-and-back"
    },
    "title": "Cypress Lake, lookout",
    "trail_id": "11477"
}