{
    "description": "Rolley Lake is a small lake located northwest of the town of Mission. In the summer, it's a popular day use and camping area complete with picnic tables, a small beach area, and a children's playground. Therefore, the summer months are often packed with families, so it's best to go in the early spring or during the fall to enjoy a nice peaceful walk on a cool, crisp day.During the late fall and winter season the park is generally closed so you will have to park on the paved road and walk down the wide gravel road towards the lake.Begin your hike from the lowermost parking lot next to the lake. Head to the left to begin walking clockwise around the lake. The trail briefly enters a forest before reaching a fork. Continue to the right down the slight hill towards the lake and onto a wooden boardwalk that crosses a marsh area. From here, you can see the peaceful lake or get a glimpse of the crowds using it across from the main beach area.Continue along the boardwalk as it crosses the lake and enters back into the forest. Tree branches are draped and the forest floor is carpeted by a layer of green moss which flourishes in the moist surroundings. The trail continues through second growth Cedar and Hemlock trees as it hugs the shore of Rolley Lake offering occasional views through the trees.Once you reach a bridge that crosses over the rushing Rolley Creek, you are faced with the option of going left or right. Go left and follow the wide trail as it heads gradually uphill until reaching the campsite a short time later. Just a few steps further past the outhouse is another trail which leads towards the Rolley Falls Loop. Follow this trail until you reach a fork and go right as it heads down the side of the mountain. At the bottom, watch for a trail on the left and follow this as it winds through a few short switchbacks to a forestry service road.Walk towards the road and cross the bridge, observing the falls on your left. Look for the start of a trail just past the falls and follow this trail as it heads up a steep hill alongside the creek. A short distance up you arrive at a small wooden viewing platform which offers the best views of the lower falls as they tumble into the canyon below.After taking in the view, continue back up the trail alongside the falls as it heads back into the trees and arrives at another bridge a short time later. Here is the smaller upper falls. To return to Rolley Lake, cross the bridge and head up the gradual hill a short distance where it arrives at the fork you passed earlier. Go right and a few steps later you're back at the outhouse and the trail that heads back down towards the lake on the right.Head back down the trail and pass the bridge without crossing it again. The trail continues alongside the shore as you make your way back towards the beach area where you began.",
    "directions": "Trail starts from the East most parking lot closet to the picnic area.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/11484/reg_IMG-8439-48163.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11484/narrow_IMG-8438-48163.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11484/narrow_IMG-8440-48163.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11484/narrow_IMG-8447-48163.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/rolley-lake-near-mission-bc-11484",
    "stats": {
        "Activities": "hike river-canoe",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "5 km",
        "Town": "Mission, BC",
        "Type": "out-and-back"
    },
    "title": "Rolley Lake",
    "trail_id": "11484"
}