{
    "description": "This groomed and well-marked trail was on the leading edge of the blast zone during the May, 1980 eruption of Mount St. Helens.  It follows Johnston Ridge east from the Johnston Ridge Observatory overlooking the pumice plain 300m below, before turning north along Harry's Ridge which looms over Spirit Lake.  David A. Johnston was the USGS volcanologist who perished shortly after radioing in his laser-ranging results.  Harry Truman, the Spirit Lake Lodge keeper was another casualty.Just before the transition from Johnston Ridge to Harry's Ridge, there is a 100m stretch cautioning people who may be \"uncomfortable with heights\".In 34 years, the blast zone is making a remarkable comeback.  Fireweed, parched salal, foxglove, pearly everlasting, alpine paintbrushIt was in the low 90's when I recorded the GPS track in early September.  The dusty pumice amplifies the heat if you are lucky enough to hike it under clear, sunny skies.  There is no water on the trail and precious few spots for shade.  I've been here at other times when the weather changes incredibly fast.  To aid trail navigation when visibility is poor, the National Park staff have laid out marker posts at strategic locations along the trail.",
    "directions": "Start from the east end of the parking lot at the Johnston Ridge Observatory, located at the end of paved Highway 504.",
    "geohash": "c2",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/WA/11480/reg_DSC00650-0.jpg",
        "https://trailpeak.com/storage//content/trails/US/WA/11480/reg_DSC00692-0.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/boundary-trail-near-castle-rock-wa-11480",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 4,
        "Time": "4 hrs",
        "Total Distance": "10 km",
        "Town": "Castle Rock, WA",
        "Type": "out-and-back"
    },
    "title": "Boundary Trail",
    "trail_id": "11480"
}