{
    "description": "I called this one Secret Corney Brook Fall since the official trailheads you to a fall within the Cape Breton highlands National Park.  My trail uses the first 1.5km of this trail then veers off into the wilderness for a real adventure.   If you are able to bushwhack your way and enter a somewhat narrow canyon, you will see a secret 50ft waterfall seldom seen by humans.The official trail is wide and has little grade as it meanders by the side of the Corney Brook.   You will look for a main valley coming to your right (facing upstream).  Where this valley empties into the Corney Brook, you will cross and follow it up..it?s called the south Corney Brook at this point.   At first the valley is quite wide and you can walk on either side in a very nice mature Acadian deciduous forest.  The forest floor is covered by ferns and very little other stuff so walking is easy.There will be a sharp 90 degree turn of the stream and from this point it enters a kind of canyon-like feature.  I say canyon as if you do not enter it at the base you will never be able to get into it from above at any point upstream as the walls are fairly vertical all the way to the 50ft waterfall.  There are a couple of 10 footers along the way which luckily for me were passable without getting wet.  After a big rainfall you won?t have that luxury!  Towards the end of my gps track I was faced with a huge snow bank left over (this being in early June).  What made it more special was that the snow pack had a natural arch in it as a chute of water carved out a tunnel.  Right beside the snow mound the stream did another 90 degree turn and the waterfall is nestled right there.  All in all about 2 hours return from the Cabot Trail with time in there to take lots of pictures.UPDATE SUMMER 2019I had spotted some more features upstream of the secret fall on sat imagery.  I carefully climbed the left hand side of the fall but I boulder a lot so I am confortable with that sort of thing.  You may want to retrace your steps out of the canyon feature and climb the right hand bank (facing upstream).Above the secret fall are a bunch of smaller 10-15 ft drops that are very nice.  climb upstream until you are in front of a very vertical 30ft drop.  climb to the right of it and continue upstream.  The terminal fall of this hike is a slider fall of about 45ft in length.  The stream then veers sharply to the left and gets really narrow.",
    "directions": "The Cabot trail onto the Cape Breton Highlands National Park.  Park at the Corney Brook Trail and head upstream and follow my gps track",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/11482/reg_secret-1--27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11482/reg_DSC-0005-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11482/reg_DSC-0013-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11482/reg_DSC-0017-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11482/reg_DSC-0044-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11482/reg_DSC-0047-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11482/reg_DSC-0058-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11482/reg_Screen-Shot-2019-08-18-at-3.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11482/reg_secret2-1--27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11482/reg_secret4-1--27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11482/reg_secret6-1--27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11482/reg_secret8-1--27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11482/narrow_secret1-1--27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11482/narrow_secret3-1--27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11482/narrow_secret5-1--27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11482/narrow_secret7-1--27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11482/narrow_secret9-1--27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/secret-southwest-corney-brook-fall-near-cheticamp-ns-11482",
    "stats": {
        "Activities": "snowshoe hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "10 km",
        "Town": "Cheticamp, NS",
        "Type": "out-and-back"
    },
    "title": "Secret SouthWest Corney Brook Fall",
    "trail_id": "11482"
}