{
    "description": "Did this route as a trail run but it would be the same as a hike, just add 1.5-2 hours to the time, probably.We started at Evans Lake, at a pullout adjacent to the turn off the Evan's Lake camp. We entered the woods here, on the east side of the access road to Levett and followed obvious trails uphill. We took a branch to check out a burial ground and access the first views, through the trees. We completed the first portion by exiting onto the access road again, about 1.5 km below Levett Lake and headed up the road to the lake and the public camping area where we made our way to the lakeshore to get the best views of the day, a beautiful glimpse of the Tantalus Glacier. Heading back the same way we came, we went back down the road for 1.5 km and headed into the woods on the West side now, followed yellow markers on trees.The next section is a very old logging road, very overgrown, lots of deadfall and rocky so the going was slow and a bit frustrating. We reached the skyline trail which as well, was quite overgrown with salal. You know there are beatiful views of the Glacier again on the right hand side but you're too low and in the trees to see it except for one or two minor viewpoints. When we reach the main Evan's Lake trails, we respected the request to stay off camp property but may have taken a wrong turn as we felt we descended quite a bit and then turned back uphill. The trail was windy and fairly new/soft so kept going, it dumped us back on the gravel access road, less than a 1km from where we parked our car.I gave this route a 3/5 because of the time spent on a gravel road and the only occasional views, besides Levett Lake. Had it been hot though, Levett is fabulous to swim in as you can enjoy the view unencumbered from the water.Also, the overgrowth on the 2nd half might frustrate hikers but as a run on fun singletrack, this was worth the trip for me.",
    "directions": "Leaving Squamish, heading north on Highway 99 towards Whistler, turn left and Depot Road (there are lights here) about 9km past downtown Squamish. Continue on Depot Rd to government rd, past the airport. At a T intersection Head left. Cross over train tracks, past Fergie's Cafe at the Sunwolf resort, take the immediate Rt after the bridge. You are on Paradise Valley Rd. Turn left onto the gravel road across from the North Van Outdoors School (which now has a new name I can't recall). Drive up the steep gravel/sometimes roughly paved road. It is doable with a sedan but you'll need to take it slow as there are some dips/large potholes. Park on your Rt adjacent to the entrance to Evans Lake camp which is on the Lt.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/11491/reg_2014-06-01-09.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/evans-levett-lake-near-squamish-bc-11491",
    "stats": {
        "Activities": "hike snowshoe",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "13 km",
        "Town": "Squamish, BC",
        "Type": "out-and-back"
    },
    "title": "Evans & Levett Lake",
    "trail_id": "11491"
}