{
    "description": "This is a hike and bushwhack to a fall called Big Falls on the Jordan River.  after seeing it I have two problems with the name.  This fall is not big and hardly qualifies as a fall.  That being said for the South shore area of Nova Scotia...it is as big as it gets.  Most of the other and bigger falls have been dammed up by NS Power so this is a real hidden gem.From the dirt road it is just a manner of going in a straight line through some alder patches and pine forest sections.  Some of the sections are quite nice to walk through as the brush is at a minimum and the canopy is far overhead.  Of course then there are other sections where I think there might had been some logging as the pine tress are clumped together and are about 20 years old.Finally you reach the river after about 20 minutes.....I immediately spotted a trail which was marked by some orange flagging tape.  This trail does not lead you back to the road but rather it is a portage around the Big Falls!!!!There are a couple of small 2-3 ft drop upstream and then the river bends and the biggest drop (about 8 ft total) is in front of you.  Across the river are some big rocks which lead me to believe that a few thousand years ago the river might have been dropping a bigger fall over them.",
    "directions": "Highway 103 to Jordan Falls.  Turn on Lake John Rd and park approx here; 43.900279, -65.232386",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/11495/reg_108291529-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11495/reg_108291565-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/jordan-river-big-falls-near-shelburne-ns-11495",
    "stats": {
        "Activities": "river-kayak river-canoe hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "3 km",
        "Town": "Shelburne, NS",
        "Type": "out-and-back"
    },
    "title": "Jordan River -  Big Falls",
    "trail_id": "11495"
}