{
    "description": "A short walk into the woods leads you to a largely unknown waterfall on the North Framboise River in Cape Breton Island.  I don?t exactly remember why I had put a question mark in my GPS unit for this spot.  Could have been pulled from old maps or someone may have sent me a clue.  You get into the woods from the old dirt road and it?s mostly a young forest so lots of bending and jumping over stuff?a great workout!   After about 15minutes of this you find yourself on top of a small hill with the river at your feet.  There is a large standing rock in the middle of the river which begs to be climbed on!   Upstream the first fall or cascade of about 5ft.  Immediately upstream a large rock wall of about 20 ft on the bank peeked my interest.  Climbing to the top I can see why the rock wall had no vegetation.  At times of high water, the river jumps its bank and flows over that rock wall creating what must be a spectacular fall.  Around the bend, you will spot another fall with large pools at their base perfect for some swimming.  I would go back here if I lived closer to see the fall at the time of the spring freshet?must be very spectacular!",
    "directions": "Highway 247 from St Peters.  Turn left on Sterling Road and then right on Three rivers Road and park by the gravel road approximately here;  45.740948,-60.398036.  go up the road and get into the woods where you see my gps track.  Alternatively just follow the river up from the bridge",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/11506/reg_DSC-0058-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11506/reg_DSC-0063-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11506/narrow_DSC-0056-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/north-framboise-river-fall-near-st-peters-ns-11506",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "3 km",
        "Town": "St. Peter's, NS",
        "Type": "out-and-back"
    },
    "title": "North Framboise River Fall",
    "trail_id": "11506"
}