{
    "description": "This is a good adventure to a remote spot seldom visited by humans.  In the heart of the Creignish Hills lies a hanging valley which has numerous waterfalls downstream of it.   Setting off from the car you are in for a gem.  It?s an Acadian forest, it?s mature and so easy to walk through.  The canopy is high overhead and there is hardly any blowdown or shrubs in your way.  Soon you meet up with a small stream that will lead you into the hanging valley.  The valley ends at the top of a 70ft waterfall surrounded on either side by some imposing rocky cliffs.  You can make your way down to the base of the fall by going either way around the rocky cliffs and down an extremely steep but stable slope.  Further downstream lie two more falls of about 25 and 35 foot each.",
    "directions": "Trans Canada Highway on Cape Breton Island.  Near Whycocomagh, turn on Mountain Rd and turn right on snowmobile/ATV trail that leads right to the top of the Creignish Hills.  I used a pickup truck to get up the road as you need a lot of clearance.  On the other hand you can just walk it up.  Park when your GPS points you to the hanging valley and its waterfalls (falls are approximately at; 45.92814,-61.234167).",
    "geohash": "f8hmq",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/11512/narrow_DSC-0203-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11512/narrow_DSC-0190-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11512/reg_DSC-0209-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/hanging-valley-falls-near-port-hawkesbury-ns-11512",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "4 km",
        "Town": "Port Hawkesbury, NS",
        "Type": "out-and-back"
    },
    "title": "Hanging Valley Falls",
    "trail_id": "11512"
}