{
    "description": "Breadalbane Trail, PEI\r\n\r\nNot often do spider webs in my face make me a happy hiker, but in some cases, it's a great thing because it shows that a trail doesn't see many people. Many places suffer from over-populated hiking trails, but I think in this case the opposite is true. \r\n\r\n In my recent trip to this site, I found the trail to be in need of maintenance in some sections. Someone with a machete (me, if I owned one) needs to go and cut back some of the over grown grass in the boggy section. Although this sounds grim, it only accounts for probably 5 percent of the trail. Despite this, the path is still traceable, and the trail very enjoyable. If you're a bird watcher, a eco-enthusiast, or simply a trail seeker, you'll enjoy this little gem.\r\n\r\nBreadalbane (pronounced [Bread-Al-bin]) is a small community located about a half hour away on the Number 2 highway west outside of Charlottetown. Its trail head can be found at a dam across the Dunk River 2.5 K down the 231 secondary highway. There is a park opposite the site.\r\n\r\nThe original trail was cut in 1994 by the community, and I was told that it has been maintained by katimavik volunteers from time to time. I think the site was to serve as a community attraction. The 3 Km trail offers the hiker or trail runner a great cross section of flora, as it cuts through softwood groves, boggy grasses and beautiful hardwood stands. It edges the Dunk River, and has three bridges that cross it's path and its feeders. If you are a geocacher, there is a cache hidden somewhere along the trail. Another feature of the trail is its proximity to the Confederation Trail; an abandoned rail bed trail system that traverses the island. The actual Breadalbane trail spills out onto it at the end.\r\n\r\nOn my GPS track, I have included some waypoints of interest. I didn't mark the bridge crossings because I hoped that the topo map might indicate where those were. I have indicated an area where one could pitch a tent. It's not an exact spot, but in that general area, you should be able to find a suitable site. If you choose to camp in the area, please abide by the policy of LNT (leave no trace). It's not an official back-country camping spot. Treat the water, or better yet, bring in your own. I noticed a sign in the community about ecoli counts for quite a while now. I certainly suspect run-off from adjacent farm fields in the area.\r\n\r\n\r\n\r\n\r\n\r\n\t\t\t",
    "directions": "Breadalbane (pronounced [Bread-Al-bin]) is a small community located about a half hour away on the Number 2 highway west outside of Charlottetown. Its trail head can be found at a dam across the Dunk River 2.5 K down the 231 secondary highway. There is a park opposite the site.\r",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/PE/1151/reg_Dam.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/1151/reg_ontoconfedtrail.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/1151/reg_trailcleanup.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/1151/topo_Trail.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/breadalbane-near-charlottetown-pe-1151",
    "stats": {
        "Activities": "snowshoe hike ski-xc",
        "From": "",
        "Seasons": "winter fall summer",
        "Stars": 2,
        "Time": "2 hrs",
        "Total Distance": "3 km",
        "Town": "Charlottetown, PE",
        "Type": "out-and-back"
    },
    "title": "Breadalbane",
    "trail_id": "1151"
}