{
    "description": "This is a superb scramble with a beautiful and wide opened view, the impressive Mount Carnarvon on a side and the President Range on the other. You have many different ways to access the summit along Hamilton Lake's trail (or Lake)  or even by going straight up from the grassy avalanche gully by Emerald Lake. We actually took Hamilton Lake path for 4.5 km, until view opened and we started to climb straight up a dirt slope on our right. Then, the ridge starts to offer you nice views already of Hamilton Lake on the left and Emerald Lake on the other side. You can stick to the ridge and scramble up and down the 3 peaks you'll meet before the true summit. The last false summit has 2 cairns and it looks like it's the end, but you climb down and up the last portion and attain the highest point a few metres further. You also get to go down a crevasse and up a cave formed by large boulders, it's beautiful there.Elevation 1199 m, 1288 tot and summit at 2506 metres. We did it in 6 hours return but it can be done in less than that for sure.Going down, we took the avalanche gully, climbing down the head and then in a scree and grassy slope for a half the mileage, but quite steep all the way down though.",
    "directions": "Park at Emerald Lake Parking area and find the trail head at the entrance of the parking.",
    "geohash": "c3jh",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/11538/reg_Emerald-Peak-Yoho-Park-Jul-12-2014-27--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11538/reg_Emerald-Peak-Yoho-Park-Mt-Carnarvon-Nice-Jul-12-2014-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11538/narrow_Emerald-Peak-Yoho-Park-Emerald-Lake-Jul-12-2014-4--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11538/narrow_Emerald-Peak-Yoho-Park-Hamilton-Lake-Jul-12-2014-1--44639_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11538/narrow_Emerald-Peak-Yoho-Park-The-Cave-Jul-12-2014-2--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11538/narrow_Emerald-Peak-Yoho-Park-The-Cave-Jul-12-2014-3--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11538/narrow_Emerald-Peak-Yoho-Park-The-Cave-Jul-12-2014-9--44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/emerald-peak-near-field-bc-11538",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 5,
        "Time": "6 hrs",
        "Total Distance": "10 km",
        "Town": "Field, BC",
        "Type": "out-and-back"
    },
    "title": "Emerald Peak",
    "trail_id": "11538"
}