{
    "description": "Edwards Rating: II (II) S S Little hike of that rocky Knob you can see from Canmore, right in front of Ship's Prow. Great views for a little time & effort with the Three Sisters, the Prow, Lawrence Grassi and the Valley. Short hike, steep most of the time with 730 m elevation in less than 3 km up.Trail: Take the first trail on your right that leads to Highline Trail within a 100 m. Then again, take that trail on your right. You'll pass across one trail; keep going up until you meet 2 blue arrows, where you turn left there. It will bring you up to a creek and you will follow it for 200-300 m up its right. You will meet a sign, keep going up, following the creek still on its right. Now the trail will lead you across the creek and you will have to be careful here, as the trail begins about 10 metres pass the creek, on your right. You'll see yellow-pink flags most of the time, trail is pretty easy to follow but steep. After 15-20 minutes, you'll have to choose going left or right. Both works probably, but I stayed on the path leading right and up, as I didn't want to lose that elevation. That was leading to the ridge, where you can scramble up the rocks or follow the trail on the left side if not comfortable with hands on scrambling.Elevation, 730 m.",
    "directions": "Park at the end of Wilson Way Rd in Canmore, close to the dead end.=========== Alternate Version (from another user) +++++++++++Bob Spirko gives better directions.  From Wilson Way, you basically get on the Highline trail.  Once crossing the foot bridge over the first creek, you go about 100 metres until you see the sign showing the Highline trail branching from east connector to east highline and west connector.  Take the east highline route to Three Sister's Creek which is actually the trail head.  You will soon come to another creek bed (dry at this time of the year) and then follow it up.  It gets steep at times, but there are side paths to the left of the creek which you can take to avoid these sections.  The main trail up the mountain then begins, once you've gone about 200 metres up the creek, at a red ribbon on a tree.If starting from the east end of Wilson Way at the Peaks of Grassi, the hike is actually a little over 8 km and takes about 4 hours at a moderate pace.  The last third of the hike, near the top is actually quite steep and could be considered difficult.  Overall, a moderate hike, but definitely not easy.Once your get to the top, the view is outstanding.  You can see the Bow Valley for miles to the east and west, as well as the majestic Ship's Prow of Mount Grassi and the entire Three Sisters.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/11530/reg_IMG-1242-55273.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11530/reg_IMG-1244-55273.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11530/reg_IMG-1254-55273.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11530/reg_Lawrence-Grassi-Knob-Canmore-Ship-s-Prow-Jul-5-2014-1--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11530/reg_Lawrence-Grassi-Knob-North-Approach-Canmore-Jul-5-2014-4--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11530/reg_Lawrence-Grassi-Knob-North-Approach-Canmore-Jul-5-2014-7--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11530/reg_Lawrence-Grassi-Knob-North-Approach-Canmore-Jul-5-2014-8--44639_best1_.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/lawrence-grassi-knob-near-canmore-ab-11530",
    "stats": {
        "Activities": "snowshoe hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "3 hrs",
        "Total Distance": "6 km",
        "Town": "Canmore, AB",
        "Type": "out-and-back"
    },
    "title": "Lawrence Grassi Knob",
    "trail_id": "11530"
}