{
    "description": "The Avatar Grove and \"Canada's Gnarliest Tree\" was come across by Ancient Forest Alliance (AFA) activists in December, 2009. The magnificent forest towers in the Gordon River Valley on Crown lands in Tree Farm Licence 46 in Pacheedaht traditional territory near Port Renfrew on Vancouver Island, BC. Now a popular hiking area for all ages, was protected from clearcut logging in 2012 after a major campaign launched in 2010 by the AFA, with the help of thousands of our supporters and local tourism businesses with the Port Renfrew Chamber of Commerce and the Sooke Region Tourism Association. The old-growth forest of monumental redcedars and Douglas-firs has become a major tourism draw, akin to becoming a ?second Cathedral Grove? in British Columbia. Canada?s Gnarliest Tree, an enormous redcedar with a 3 metre wide burl, along with many other gnarly and colossal trees, tower in this exceptional and easily accessible old-growth forest that is also inhabited by black bears, cougars, wolves, deer, and elk! Efforts are now underway to build a boardwalk to help protect the Grove's ecological integrity as well as improve visitor access and safety. To donate towards this project please click here: https://www.ancientforestalliance.org/boardwalk-donation.php Ultimately the Ancient Forest Alliance would like to see a new legislated park or conservancy for the area. The larger plan however is to ensure that the BC government protects all of BC's endangered old-growth forests and ensures a sustainable, value-added second-growth forest industry instead. You will lose cell phone service when you pass Jordon River.It's not at Sooke correct location is Port Renfrew",
    "directions": "Directions Coming from Victoria, BC ? Drive time approx 2.5 hoursClick here (http://www.ancientforestalliance.org/biggest-trees-map.php)for a printable map to the Avatar Grove and other tall trees around Port Renfrew!Drive to Port Renfrew along West Coast Hwy #14 Immediately upon reaching Port Renfrew turn RIGHT onto Deering Rd. (Watch for signs on the trees now marking the way along the road) Cross the big bridge over the San Juan River and continue down Deering Rd. staying to the right at the next Y.You then cross a small single lane bridge and reach a ?T? in the road. Turn LEFT at the ?T? Stay on the main paved road and after approximately 5 km you will hit a ?Y? at which you go LEFT and cross a tall, beautiful bridge over the Gordon River. After crossing the bridge stay on the Gordon River Main for about 1.5 km. keeping to the right at the next ?Y?.You will soon cross a small bridge at Baird Creek. Park on the right immediately after the bridge and look for the signs at the entrances on both the left and right side of the road to reach the Upper and Lower Groves respectively.The entrance to the forest on the right will take you to the Lower Grove which is flatter and features a spectacular new \"loop\" trail that passes giant burly cedars and large Douglas-fir trees.Heading up on the left side of the road to visit the Upper Grove will lead you to ?Canada?s Gnarliest Tree? at the end of the trail! This side is a bit steeper and has many large cedar trees along side the path.Avatar Grove Parking GPS:lat = 48.6163043713lon = -124.438022154",
    "geohash": "c0xs86",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/11545/reg_Avatar-Grove-16-47757.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11545/reg_IMG-2581-7279.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11545/reg_avatar-grove-douglas-fir-tree-47757.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11545/reg_avatar-grove-old-growth-forest-tj-watt-47757.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11545/narrow_avatar-grove-canadas-gnarliest-tree-tj-watt-47757.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11545/narrow_avatar-grove-mossy-creek-nature-47757.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/avatar-grove-near-sooke-bc-11545",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 5,
        "Time": "2 hrs",
        "Total Distance": "3 km",
        "Town": "Sooke, BC",
        "Type": "out-and-back"
    },
    "title": "Avatar Grove",
    "trail_id": "11545"
}