{
    "description": "Strathgartney\nWhat another terrific location around the central region. Strathgartney is PEI's oldest provincial park. It was constructed in 1956 and contains some unique amenities. \nOn site, there is a wonderful open car-camping style campground suitable for tents and RVs alike. Besides the camping, the park also offers a trail loop (a portion of which I am featuring) that goes down to the shores of the West River, which is a terrific canoe / kayak day paddle area. The other big and very unique attraction (I've never seen this anywhere else) is a friz-bee golf course. There, you can \"tee-off\" and try to get your friz-bee / throwing disc to the pin in as few throws as possible. I believe it's 18 holes too! (not really holes of course)\nAs for the trail, the really great parts happen after you pass the fork and exit the park's boundaries. Here, the mountain biking really gets technical as you go through root obstacles, rocks and steep inclines. this is granny territory for sure. The trail runs the parameter of the river, making for really great views. Although the park monitors don't officially allow mtn bikers, they really just want you to give way to camper / hikers. Often the die-hart cyclists will enter the trail from the equestrian site and work their way toward the park. (another trail entry I'm working on for trail peak) So if you take your bike, be cautious, and look out for toddlers and families exploring the park.\nThis trail is also a great snowshoeing experience too during the winter. This past winter offered many an added challenge due to the hurricane that struck last fall. Many trees were downed, blocking the trail. Park crews didn't do any clearing until near the beginning of summer when the park officially opened for the season.\nWithin the park's boundaries, there are many interpretive signs explaining the types of trees in the mixed forest, as well as effects on ground cover from the forest canopy.\nYou've love this trail if you're looking for a half-day adventure. Pack a lunch and bring the camera. If you bring a water craft, then you're looking at a whole day's adventure for sure. You'll have a long way to go for a boat launch though. Better to launch further along the highway at the bridge in Bonshaw by the church.\nShannon Burt",
    "directions": "From charlottetown, drive on route 1 TCH for about a twenty minutes. On your left, you'll see a sign saying Strathgartney Provincial park up ahead. Get into the center lane, and turn left into the park. After passing the office, head to the end of the lane, and park alon the grass near the trailhead.\nEnjoy!",
    "geohash": "f84yy",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/PE/1154/reg_IMG-1586-26511.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/1154/reg_IMG-1628-26511.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/1154/reg_JuanclearedJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/1154/reg_alongriveredgeJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/1154/reg_trailforkjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/1154/reg_trailheadjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/1154/narrow_IMG-1580-26511.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/1154/narrow_IMG-1585-26511.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/1154/narrow_IMG-1594-26511.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/strathgartney-trail-near-charlottetown-pe-1154",
    "stats": {
        "Activities": "snowshoe hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 5,
        "Time": "2 hrs",
        "Total Distance": "5 km",
        "Town": "Charlottetown, PE",
        "Type": "out-and-back"
    },
    "title": "Strathgartney trail",
    "trail_id": "1154"
}