{
    "description": "The most western point in Nova Scotia, Brier Island and the town of Westport are a stunning example of life on the east coast of Canada. Requiring a lengthy drive from the city of Halifax and two ferry dies to get there, Brier Island has some of the best whale and bird watching available. This half hike loop covers a little over half of the island and will provide you with some awesome memories. Parking your car at the public beach on Gull Rock Road will be your starting point. The trail that runs between Pond Cove and Western Light is on property owned by the Nature Conservancy of Canada. Please be respectful and keep things clean. Please note that the Nature Conservancy of Canada does not permit overnight camping or fires on any of their properties. The trails are mostly cut by ATV's. Some areas on the western side are very wet and can be circumnavigated by walking the rocky beaches if the tide is low. There are not many opportunities for fresh water sources, so be sure to have sufficient quantity per person.The trail does continue around the entire island and would welcome you with a cove full of seals and a second lighthouse. We opted to cut the hike in half near Peajack Road due to concerns over water and continued our trek through town and then Gull Rock Road back to the car.",
    "directions": "From Halifax take Highway 101 past Digby with a right turn on the 303. Then a left on Highway 217 to the East Ferry. Then continue on Highway 217 to Northeast Cove to catch the ferry to Brier Island. Once off the ferry turn left and continue on the main street the right onto Gull Rock Road. Drive down the dirt road until you see a small dirt road on the right to the public parking area.",
    "geohash": "dxbg",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/11565/reg_photo-1-6--48435.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11565/reg_photo-2-7--48435_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11565/reg_photo-3-5--48435.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/brier-island-half-hike-near-digby-ns-11565",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 5,
        "Time": "6 hrs",
        "Total Distance": "13 km",
        "Town": "Digby, NS",
        "Type": "out-and-back"
    },
    "title": "Brier Island Half Hike",
    "trail_id": "11565"
}