{
    "description": "Painted Bluffs are located on the north side of Kamloops Lake in Painted Bluffs Provincial Park. The park is difficult to access but is well worth the trip. The soil and rocks are shades of purple, green, and red. Being there almost feels like being on another planet. It can be viewed across the lake on the highway but it's a whole new experience to actually be there looking up at the bluffs. I recommend going on a sunny day with little to no chance of rain as it is evident the area can get very muddy and streams of water run down between the bluffs.",
    "directions": "The park can only be accessed from Kamloops Lake. This means you must either kayak, canoe, or boat across the lake. East of the settlement of Copper Creek is a bluff with a train tunnel beneath it. Just east of that  are the Painted Bluffs. There is a small beach below the bluffs. This is  where you begin the hike. Go to the far left of the beach before the beach  ends and becomes rocky. There is a deciduous tree there and directly  above it are many large rocks. These are fairly easy to step on without  needing to climb. The rocks will end and a little-used trail begins. The trail  goes up to the CN railway tracks. Follow the tracks east until you see a  washout to your left. Just past it is another little-used trail that will take  you into the washout. The washout leads to the bluffs. Once at the bluffs there doesn't seem to be any trails. The area has very little to no grass or vegetation. Hiking up the bluffs is extremely dangerous and I do not recommend doing so. A wide ravine winds up through some of the bluffs and gives you different angles to view the bluffs.",
    "geohash": "c340",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/11573/reg_026-49098.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11573/reg_029-49098_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11573/reg_032-49098.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11573/reg_059-49098.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/painted-bluffs-near-kamloops-bc-11573",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 5,
        "Time": "2 hrs",
        "Total Distance": "2 km",
        "Town": "Kamloops, BC",
        "Type": "out-and-back"
    },
    "title": "Painted Bluffs",
    "trail_id": "11573"
}