{
    "description": "Edwards Rating: IV (V) M MMost difficult scramble I have ever done so far, this is a very challenging Mount with route-finding from Niblock-Whyte's Col and on the descent as well. From Lake Louise to Whyte-Niblock's col, it's quite simple. Make sure you ascent the col on its right, very close to Niblock's summit. You should wear a HELMET as there is a lot of rock fall hazard and do it in August and there was still a bit of ice end of July.The elevation is about 1200 m, max 2983 m officially, 2936 m on my GPS.Between 6 and 9 hours depending on how you handle routefinding and numerous exposed sections.Trail description: Starting from Lake Agnes, you have to go along the right side of the lake and keep going straight up for a while, between Whyte and Niblock summits. You will have to scramble up a scree slope, take it on the right side to save your energy, close to the grassy slope. Then, you will scramble up the rockband, there's an easy way right in the middle. Once up the rockband, keep going straight until you see a rockband on your right, you have to go around it on its left. Once over it, you will have to scramble up this slope of scree and rockbands all the way up to the col. There are a few cairns to help you out. You should always be pretty much under Niblock's summit block.Once at the col, take on your left and keep going to Mount Whyte. You will keep your right a very short moment and climb up on your left before it starts to steepen. Easy then and until you see a clear path on your left. It will lead you to a very long and dangerous gully. Don't go there yet, rather stay on its right and climb up as much as you can, probably about 10 metres. Then, you will have to step in at the highest point of that same gully, about 3 steps, easy but exposed. The crux is right there, a high and exposed wall on your left. You have to cross it at its base and then, start climbing by doing very small switchbacks all the way up. It is very scary to my opinion, be careful and take your time. Once this is done, you will have to keep going for about 4-6 steps on your left again. There are solid footholds but exposure is, again, breathtaking.The toughest portion is now completed. You will see a scree path going to a large gully. Once at the gully, look up to your left, there are good footholds to get to the ridge, finally! Probably about 3-4 climbing moves again. Go to the ridge, you will see an obvious path right on the ridge, then going to its left and leading you to the summit. You can either descend the same way (no question I would have done that...) or keep going South with a little ridge walk until you have no choice to down climb a gully, facing Mount Lefroy and leading you to The Plain of the 6 Glaciers trail. It is very important that you stay on that gully at the far end of Whyte's ridge. You will have a lot of rockbands to deal with, but they are not bad if you stick to that gully. Going on your left will complicate routefinding a lot as there are so many cliffs and creeks everywhere. That's where we went and took hours to get back.We did Mount Niblock before the same day; it can be a fun but a long day doing both. I took off my GPS track to Niblock and you have the trail up to Whyte directly instead. I didn't put the GPS down the South slope as it is a mess and we really walked way more than we should have. You can return the same way if you are more comfortable than I am with down climbing, but it scared the heck out of me, I had enough.",
    "directions": "Park at Chateau Lake Louise",
    "geohash": "c3jk",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/11571/long_Mt-Niblock-Mt-Whyte-Lake-Louise-Jul-26-2014-28--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11571/reg_Mt-Niblock-Mt-Whyte-Lake-Louise-Col-Jul-26-2014-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11571/reg_Mt-Niblock-Mt-Whyte-Lake-Louise-Welcome-.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11571/reg_Mt-Whyte-Lake-Louise-Down-East-Gullies-Jul-26-2014-4--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11571/reg_Mt-Whyte-Lake-Louise-Summit-Jul-26-2014-4--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11571/reg_Mt-Whyte-Lake-Louise-Summit-Jul-26-2014-7--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11571/narrow_Mt-Niblock-Lake-Louise-Jul-26-2014-2--44639_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11571/narrow_Mt-Niblock-Mt-Whyte-Lake-Louise-Down-that-way-ouch-Jul-26-2014-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11571/narrow_Mt-Whyte-Lake-Louise-Beggining-of-the-end-Jul-26-2014-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11571/narrow_Mt-Whyte-Lake-Louise-Crazy-scramble.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11571/narrow_Mt-Whyte-Lake-Louise-Down-East-Gullies-Jul-26-2014-6--44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mount-whyte-near-banff-ab-11571",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 5,
        "Time": "8 hrs",
        "Total Distance": "10 km",
        "Town": "Banff, AB",
        "Type": "out-and-back"
    },
    "title": "Mount Whyte",
    "trail_id": "11571"
}