{
    "description": "New for 2014, The Robinson's Island area was redeveloped for trail use.To be honest, it's not really an island, but more a peninsula. I think back in the '50's, the Robinson's Island region was developed for camping, but fell to disuse, and, with the exception of the roadway, was no longer maintained by Park's dwindling budgets.During the Spring, trail circuits were planned, and the final section of the roadway re imagined with an eye for families on bikes. The first 3K of the original roadway still exists and now takes you to a parking area, From there, a nice curvy path takes you to the Island's end. What is the most interesting is the circuits of trails that spring from either side of the road. These are wide smooth paths of packed dirt that thread through the woods, giving glimpses of the coastline.Integrated into these easier circuits are trail features like berms, see-saws and short beam structures. None of these are very high off the ground, but take some practice for some.I found some older roads separate from the intended routes that I think serve as both fire management roads and the old campground roads along with abandoned sites and site numbers. I can imagine 50's style vehicles and canvas tents parked with families around the campfires and Buddy Holly on the radio.You can fill a fun afternoon by putting the routes on repeat. Unlike the way I did the routes, run these counter clockwise and enjoy!Please note that between the months of July through September, there are park fees to enjoy National Park amenities if you enter by car. If you enter the park by bike, it's a free ride. OF you want to take a lunch break, head to Richard's Fish & Chips and go jump in the ocean. Your experience wouldn't be complete without it!Shannon BurtPEI",
    "directions": "Take Brackley Point Road from Charlottetown. Past the Park gate, and take your first left. Drive until the end of the road, or park at the beach parking lot, and bike 3K along the causeway to reach the trails.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/PE/11580/reg_IMG-3130-49157.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/11580/reg_IMG-3135-49157.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/11580/reg_IMG-3529-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/11580/reg_IMG-3533-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/11580/reg_IMG-3534-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/11580/reg_IMG-3535-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/11580/reg_IMG-3537-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/11580/reg_IMG-3538-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/11580/reg_IMG-3540-6702_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/11580/narrow_IMG-3122-49157.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/11580/narrow_IMG-3123-49157.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/11580/narrow_IMG-3128-49157.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/11580/narrow_IMG-3530-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/11580/narrow_IMG-3531-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/11580/narrow_IMG-3532-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/11580/narrow_IMG-3542-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/11580/narrow_cyn-trail-1-49157.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/robinsons-island-pei-national-park-brackley-region-near-brackley-pe-11580",
    "stats": {
        "Activities": "diving snowshoe hike ski-xc mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "5 km",
        "Town": "Brackley, PE",
        "Type": "out-and-back"
    },
    "title": "Robinson's Island, PEI National Park Brackley Region",
    "trail_id": "11580"
}