{
    "description": "Beautiful scramble between the 3 peaks of Mount Baldy! Solid rock most of the time with a lot of hands on scrambling if you want. You'll have no choice on the West summit block for sure, but North offers different alternatives.Starting from North summit, path is quite obvious. You have some flags at the beginning and you want to stick on its ridge as most as you can. When you're over the tree line almost, you can scramble up the ridge if you want. There's a place where you down climb with exposure though. If you can't make it, loose elevation and get back to the trail along the crest. Right after this point, there's a bump people take on its right officially. I climbed up that bump and it was not bad at all.Once going from North to South summit, you'll arrive at a cliff after 200-300 metres. You have 2 choices then: Either climb down a wall with good foothold or going back a bit and go down in a little drop right beside the cliff. First option seems to be much better, but we took the second one this time. It was ok, but exposed. It's just a walk after that to the second peak.South to West is a bit more challenging if you don't like hands on scrambling. It's almost straight up with the path going a bit on the right side of the summit block. This is a superb scrambling with solid rock again, but some exposure and technical difficulty. If you have a bit of experience or climbing background (I don't...!), it will not be a problem.Go down West the same way and you'll see a path down closer to the South peak. Nice and easy trail down this gully with a well defined trail.",
    "directions": "From Calgary, take Highway 1 to Banff up to the Highway 40, where the Casino is located. Once past the casino entrance, it's about 12 km, where you can park at the trailhead on the left side of the road or a few more metres on your right where it looks more like of a parking lot. It's a very busy place.",
    "geohash": "c3n4",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/11588/reg_Mount-Baldy-North-South-Attempt-June-14-2014-15--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11588/reg_Mt-Baldy-Traverse-Kananaskis-Aug-9-2014-17--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11588/reg_Mt-Baldy-Traverse-Kananaskis-View-South-West-Aug-9-2014-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11588/narrow_Mount-Baldy-North-South-Attempt-The-Wall-To-do.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11588/narrow_Mt-Baldy-Traverse-Kananaskis-Aug-9-2014-3--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11588/narrow_Mt-Baldy-Traverse-Kananaskis-Crux-to-South-Aug-9-2014-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11588/narrow_Mt-Baldy-Traverse-Kananaskis-North-South-Crux-Aug-9-2014-44639_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11588/narrow_Mt-Baldy-Traverse-Kananaskis-West-Scramble-Aug-9-2014-2--44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mount-baldy-traverse-near-kananaskis-ab-11588",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 5,
        "Time": "4 hrs",
        "Total Distance": "7 km",
        "Town": "Kananaskis, AB",
        "Type": "out-and-back"
    },
    "title": "Mount Baldy Traverse",
    "trail_id": "11588"
}