{
    "description": "Be prepared for dangerous rockfall, unstable rocks, bushwhacking in a burnt forest and \"landslide\" with a mix of large rocks and scree. This is not the easiest hike and you should wear a HELMET. We didn't hurt anyone as we were alone and it was a good thing with a portion of the scramble with extremely unstable ground. Storm Mountain is the perfect name as we had incredible lightnings and the loudest thunder I have ever heard. Most of the hike is in BC, but you summit in Banff.From the parking lot, go 700 metres South (on the roadside) and cut in the forest where you will have to bushwhack a bit before you find a path on the left side of the creek. It should be fine then until you get to this field of green and red boulders. Traverse that section and start hiking up the scree slope, staying on your right as much as you can to go around the rock bands and avoid rockfall. Then, you'll have to go straight up the second gully and that's where you want to be very careful. Once this portion is behind you, the last 300-400 metres is beautiful and it's an easy walk to the summit.Elevation gain about 1569 m net, over 1650 total.About 7-10 hours and summit at 3169 m. GPS file will help you. I modified it so you can have access to the best out of the up and down route we have taken.",
    "directions": "From Banff, take Highway 1 to the Castle Junction (Highway 93 South). Drive 10 km up to the Continental Divide parking lot.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/11587/reg_Storm-Mountain-Banff-How-lucky-Aug-3-2014-1--0.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11587/reg_Storm-Mountain-Banff-Summit-Aug-3-2014-3--0.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11587/reg_Storm-Mountain-Banff-Summit-Aug-3-2014-4--0.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11587/reg_Storm-Mountain-Banff-Worse-rocks-EVER.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11587/narrow_Storm-Mountain-Banff-Aug-3-2014-14--0.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11587/narrow_Storm-Mountain-Banff-Weird-dead-forest-Aug-3-2014-1--0.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/storm-mountain-near-banff-ab-11587",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 2,
        "Time": "9 hrs",
        "Total Distance": "12 km",
        "Town": "Banff, AB",
        "Type": "out-and-back"
    },
    "title": "Storm Mountain",
    "trail_id": "11587"
}