{
    "description": "Family Guy is a new beginner downhill bike trail built by the Moose Mountain Bike Trail Society in 2012-2013.    The trail is comprised for 3 segments.  Segment 1 from the Jean Guy entrance to the Toothless and SLF entrance, segment 2 from there to the Billy Dog entrance and segment 3 from there to the junction with the Elbow Valley Trail just before the Ing's Mine parking lot.     This one of few MMBT downhill trails that can be enjoyed by a novice on a \"cheap\" bike.   Disk brakes and full suspension aren't required on this trail.    Can be enjoyed by novice to experts.   Fast riders, please be courteous to those newer to the sport.  Makes a great loop by riding up pneuma and connecting to Family Guy at any of the 3 entrances.  Enjoy the views.   For more information and area maps, see www.mmbts.com",
    "directions": "Drive up the Moose Mountain road (closed Dec 1 to May 15) about 6km.  There is a guardrail to the right side (East) of the road and a small parking area.  This is where you will find the entrance to Jean Guy on the Rocks and the entrance to Family Guy is on the West side of the road approximately 200m down the hill.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/11591/reg_IMG-0073-Large--35651.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11591/reg_IMG-0076-Large--35651.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11591/reg_IMG-0084-Large--35651.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11591/reg_IMG-0894-Large--35651.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11591/reg_IMG-0903-Large--35651_best1_.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/family-guy-near-calgary-ab-11591",
    "stats": {
        "Activities": "mtn-bike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "5 km",
        "Town": "Calgary, AB",
        "Type": "out-and-back"
    },
    "title": "Family Guy",
    "trail_id": "11591"
}