{
    "description": "There was apotential waterfall on a brook running close to the acadian trail...so after about 500m on this trail I veered off into the woods and went looking for it.  I descended into a narrow valley quite easily and followed a brook for a while.  the fall was on another brook so I went up a moderate hill and back down to the other brook where the fall was potentialy located.  After about 10min of easy walking in a mixed forest I came up to a fall of about 10ft.....quite scenic but not enough for this adventurous soul.   I decided to follow the brook upstream for a while and after the next bend was trewarded with some really high cliffs (200ft at least) coming straight off a scree slope by the side of the brook.  Of course now I had to go up to the top and see if I could perch myself on these imposing looking rocks.  The scree slope is very steep so I suggest going to the top through the woods.  At the top are numerous vantage point but you have to be very careful as the rock is rotten....large pieces can flake off at any time.  The view at the top is impressive and there were lots of moose tracks and droppings everywhere.  You can then try to see a secondary fall on another brook if you follow the gps track.  also I came out of the woods by finding an old woods trail that sometimes shows up on the 1:50 000 topos.",
    "directions": "This bushwacking trail starts on the Acadian trail in the Cape Breton Highlands National Park",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/11598/reg_DSC-0540-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11598/reg_DSC-0548-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11598/reg_GOPR0401-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/cheticamp-secret-cliffs-and-fall-near-cheticamp-ns-11598",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "3 km",
        "Town": "Cheticamp, NS",
        "Type": "out-and-back"
    },
    "title": "Cheticamp secret cliffs and fall",
    "trail_id": "11598"
}