{
    "description": "Windfall lake is a great hike with multiple options, it can be as short as 10 KM's return.  The main trail going to the lake crosses multiple streams and can be wet at times, but is a fairly easy slow ascent up the valley to the lake gaining roughly 350 Meters.  From there you have the option of taking the circular route along the ridges east of the lake across pinnacle peak before descending down a steep avalanche chute into a cut block and back to the start. or if you have time you can set up camp at the lake and there are a couple of options: one being Tunnel mountain northwest of the lake; you have to hike up the steep hillside beside the lake then from there you trek along a ridge to tunnel mountain.  Tunnel mountain has a cave on its side which if you enter it you can actually follow it through to the peak of the mountain.  Another option would be to scramble up to the top of Mt. Crum, the tallest in the region, which is a little more technical but still no climbing gear is necessary.",
    "directions": "From Tumbler ridge go northwest towards Chetwynd.  Turn southwest on the Bullmoose mine road. follow that about 18 Km's.  you should see some blue signs along the way pointing to a road on your left, follow that road about another 18 km's or so keeping southwest and you should reach the end of the road. trail starts here.  Just keep your eyes peeled for the bright blue signs.",
    "geohash": "c3c",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/11614/long_557203-10151026889127410-201687866-n-23629.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11614/reg_319374-10151040206177410-35892561-n-23629_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11614/reg_375626-10151040203592410-1057175108-n-23629.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11614/reg_396167-10151026889012410-1430776672-n-23629.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11614/reg_400651-10151040204127410-948989675-n-23629.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11614/reg_523999-10151040204617410-1329631466-n-23629.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11614/reg_541655-10151026884547410-314533028-n-23629.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/windfall-lake-hiking-route-near-tumbler-ridge-bc-11614",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 5,
        "Time": "5 hrs",
        "Total Distance": "10 km",
        "Town": "Tumbler Ridge, BC",
        "Type": "out-and-back"
    },
    "title": "Windfall lake hiking route",
    "trail_id": "11614"
}