{
    "description": "A nice three-day hike through the forests of Riding Mountain National park. This loop is on the far East side of the park. The difficult trail rating from Parks Canada is not due to any serious elevation gain. Rather, it is from the rough trail, two (and potentially more depending on water levels) stream crossings (~1m-2m wide) and frequent muddy/wet sections requiring careful navigation to avoid getting too wet and muddy. However, the trail is certainly worth it, travelling through the main three ecozones of Riding Mountain allowing for access to a part of the country that is otherwise difficult to access.There are three main sections to the trail (going CCW in the loop): parking lot to Birdtail camp (~16 km), Birdtail camp to Tilson Lake camp (~15.5km), Tilson Lake camp to parking lot (~8km).The loop can be done either clockwise or counter-clockwise. Going counter-clockwise is probably a better option as this section of the trail is substantially less interesting than the other two sections. It also puts the easiest section last. From the tailhead to Birdtail, the trail tracks along the southern park boundary. Head-high shrubs on both sides limits views but is nice-enough for a forest hike with occasional views into the bordering agriculture to remind one of the landscape changes. The trail was frequently muddy with many sections requiring careful footing to avoid getting wet and muddy. At about 10km is the first stream crossing. It is about 1m wide. The water is clear and is a good (and only) point to refilter water prior to birdtail camp.Birdtail camp is a nice and open meadow site with a fantastic view of a lake. The sites are open cut grass, not pads. Firepits and firewood are present, as is a privy and bear lockers. Water access is via the far campsite and down the hill. The section from Birdtail to Tilson Lake is deceptive; despite being only 16km, expect this to take 5.5 to 7.5hrs due to the rough trail.  The trail is well maintained, but it is not tracked down to dirt, making it slower going due to the uneven footing. However it is well worth it as the meadows are spectacular. Despite following the stream, there are limited options for refilling water prior to Tilson Lake. The trail comes close to the stream at one point about an hour from Birdtail (see gps points). This was our groups only opportunity. Other streams appear to be ephemeral or are incredibly mucky and stagnant. The lakes that are passed do not appear to be good water source opportunities due to stagnant water (e.g. green algae). Right before Tilson lake camp a culvert has been washed out (Aug 2014) and requires a careful ford (2m wide, mid-shin deep).Tilson lake camp is nice with firepits, wood, bear lockers, and a privy. Not quite as nice a view as Birdtail though.The section from Tilson Lake to the trailhead appears to be more heavily travelled and the pace along this section is faster than day 1 or day 2.  This is really a half-day allowing for the rest of the day to return home. This section has lovely views of the escarpment in places.Before going, enquire for trail conditions. If it has been very wet or the bugs are bad, this trail would be utterly unpleasant. Camping is 2 tents and 6 people max for ~$15. useful linkshttp://www.pc.gc.ca/eng/pn-np/mb/riding/activ/activ4.aspx#tilsonhttp://pemmican.tannerpages.com/wiki/Tilson_Lake_LoopWaypoints on map, going CCW are: trailhead, Birdtail camp, water access, central trail junction, Tilson lake camp.",
    "directions": "From the west, take hwy 16 east to Russell, then hwy 45 east towards 476, then north until 264. Head east down 264 until the road end then north (left) towards the park. The first parking lot is the trail head.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/MB/11619/reg_IMG-0972-49525.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/MB/11619/reg_IMG-20140830-124531-49525.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/MB/11619/reg_IMG-20140830-124536-49525.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/MB/11619/reg_IMG-20140830-124540-49525.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/tilson-lake-loop-near-dauphin-mb-11619",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 3,
        "Time": "21 hrs",
        "Total Distance": "39 km",
        "Town": "Dauphin, MB",
        "Type": "out-and-back"
    },
    "title": "Tilson Lake Loop",
    "trail_id": "11619"
}