{
    "description": "Stuart Knob is right between Helena Ridge and Castle Mountain. Considered as a moderate scramble technically, I thought it was quite easy as you just have 2-3 steps of hands on scrambling to get to the summit at the end. Fitness wise it is more challenging with about 25 km overall. You first get to Rockbound Lake and then keep walking along the lake on its right where you'll see a flag and a cairn. From there, it?s straight up to the right of a first gully that you will traverse left easily when arriving at a rock band. Then, you'll see the trail when taking some more elevation. You can gain some more elevation below Helena Ridge Summit block until you get closer to Helena-Stuart col. It's a beautiful ridge walk. Or you can just go straight to Stuart Knob walking in this gigantic amphitheatre and scrambling up easy rock bands before attacking the scree slope on the left side of Stuart Knob. Once at the summit block, go behind it and you'll see the little scramble to do to attain the summit. Return the same way. I suggest though that you go back down the Stuart-Castle col and go North and then Northwest to do Castle True Summit. It's about an extra hour more return.Elevation of Stuart Knob of 2802 m, 2850 m officially GPS TRACK NOTE: This my GPX track from a three summit hike. You don't want to hike up the second gully on Helena Ridge, so, instead keep going to Stuart Knob by walking through the amphitheatre.",
    "directions": "From Banff, drive north up to 93 South/Castle Junction. Take this exit and keep going down to Castle Mountain. Turn right at the stop sign and the parking lot will be on your left a few seconds later, Rockbound Lake parking lot.",
    "geohash": "c3j",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/11629/reg_Castle-Mountain-Banff-Amphitheatre-going-down-Aug-24-2014-1--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11629/reg_Castle-Mountain-Banff-Amphitheatre-going-down-Aug-24-2014-3--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11629/reg_Rockbound-Lake-Banff-Aug-24-2014-2--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11629/reg_Stuart-Knob-Banff-Col-Helena-to-Stuart-Aug-24-2014-9--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11629/reg_Stuart-Knob-Banff-Col-to-Castle-Mtn-Aug-24-2014-44639_best1_.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/stuart-knob-near-banff-ab-11629",
    "stats": {
        "Activities": "snowshoe hike ski-bc",
        "From": "",
        "Seasons": "summer",
        "Stars": 5,
        "Time": "9 hrs",
        "Total Distance": "25 km",
        "Town": "Banff, AB",
        "Type": "out-and-back"
    },
    "title": "Stuart Knob",
    "trail_id": "11629"
}