{
    "description": "Edwards Rating: II (III) L LThis is an incredible loop around Castle amphitheatre! There's no technical challenges really if you have a bit of hiking experience but fitness wise it is more challenging with almost 30 km overall. You first get to Rockbound lake and then keep walking along the lake on its right where you'll see a flag and a cairn. From there, it?s straight up to the right of a first gully that you will traverse left easily when arriving at a rock band. Then, you'll see the trail when taking some more elevation to a second gully, that time a much steeper scree slope. Keep going straight up to the col. Then, go to your left and you will see very soon 2 cairns, there's Helena's ridge highest point.From Helena ridge, you can go down the same way or scramble down almost directly under the summit but it's a little more technical there. If going back down the same way, don't go down too low as you want to cut right and go along the summit block to get to the Helena-Stuart col. Then, walk the col and take on the left side of Stuart Knob when regaining elevation. Once at Stuart-Castle col, go behind Stuart's summit bloc where there's a bit of scrambling, the most \"technical\" you'll meet during that trip.Once you summit Stuart, look up to the west and you'll see the highest point of Castle Mountain, your third summit for the day! Go back to the col and just go North to gain Castle and then, highest point is about 200 metres on your right. Views are stunning; it's really impressive up there. We did Helena to Stuart in the snow and it was still doable. To go back to Rockbound Lake, you want to go back to Castle-Stuart col and just go down sideways in the scree slope. You'll meet some rock bands, but they are easy to climb down. You will finally walk back on the left side of the amphitheatre until you meet the Helena Ridge trail again.Elevation of Helena Ridge of 2852 m, 2866 m officiallyElevation of Stuart Knob of 2802 m, 2850 m officially Elevation of Castle Mountain True Summit Northwest of 2811 m (2850-2882 m on the Web)We have done it in less than 9 hours walking and 1:30 breaks total. We walked fast; we started late in the morning and wanted back before darkness. I would think 11-14 hours if you go at a normal pace.GPS TRACK: As explained above, you can avoid some scrambling by taking the \"official trail\" all the way.",
    "directions": "From Banff, drive north up to 93 South/Castle Junction. Take this exit and keep going down to Castle Mountain. Turn right at the stop sign and the parking lot will be on your left a few seconds later, Rockbound Lake parking.",
    "geohash": "c3j",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/11627/reg_Castle-Mountain-Banff-Amphitheatre-going-down-Aug-24-2014-1--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11627/reg_Castle-Mountain-Banff-Amphitheatre-going-down-Aug-24-2014-4--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11627/reg_Castle-Mountain-Banff-True-Summit-Aug-24-2014-2--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11627/reg_Castle-Mountain-Banff-True-Summit-Aug-24-2014-8--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11627/reg_Rockbound-Lake-Banff-Aug-24-2014-3--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11627/reg_Rockbound-Tower-Lake-Banff-Aug-24-2014-2--44639_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11627/reg_Stuart-Knob-Banff-Col-Helena-to-Stuart-Aug-24-2014-1--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11627/narrow_Tower-Lake-Banff-Aug-24-2014-3--44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/helena-ridge-to-stuart-knob-to-castle-mountain-true-summit-near-banff-ab-11627",
    "stats": {
        "Activities": "snowshoe hike ski-bc",
        "From": "",
        "Seasons": "summer",
        "Stars": 5,
        "Time": "12 hrs",
        "Total Distance": "29 km",
        "Town": "Banff, AB",
        "Type": "out-and-back"
    },
    "title": "Helena Ridge to Stuart Knob to Castle Mountain (true summit)",
    "trail_id": "11627"
}