{
    "description": "Nice trail, not that tough, great scenery, can be a loop or drop a second vehicle at end.Going CCW, park at Ing's Mine trailhead and ride 6km down closed road (may be odd truck from oil biz)  Trail goes straight west crossing and along Canyon Creek.SideNote: At the end of the road, you are within 1km of Ing's Mine, a fun, non-technical cave you can explore.  Look to the WNW and up 100m or so for a tall (20m), narrow (4m) slit in the rock face.  Bring some lights, you'll need them and watch for ice on the floor.  If you go right to the back (you'll have to slither a bit), you can actually go further if you're skinney. Wiggle up behind a hanging block and keep going.The next 9-10km is a mix of creek rock, meadow, single and double track .  You'll have to cross the creek about 15 times, many can be ridden, but it is definately more fun when it is +30.  There is an easy fence you will have to scale in a very narrow gap in the hills.  Apparently the creek can be a real torrent with run-off, so make this a later season ride.  This is mixed use land so watch for cow pies and don't wear your favorite moose-antler hat in the fall (in fact, WEAR RED).You then get out to the road named Powder Creek Trail which you will ride (mostly sweet downhill coasting) back to Hiway 66 (31km so far) where you will find the second vehicle you left there.  What ?? you didn't leave a car there?  Well 12km of hiway back with a bunch more downhill and great scenery gazing will get you to Canyon Creek Rd.Alternately, if you have enough legs and water, you can combine this with the Ford Creek trail that will start about 7km down the road with a marked trail to the west. NTS Map:082J15Elevation Gain: 260 m (853 ft).",
    "directions": "South Calgary, west on 22X, keep going west when it turns into 66.  16km past Bragg Creek turn off, look for Canyon Creek Rd to the right.  Park in lot, trail starts as the road past the locked gates.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/1163/reg_CanyonRd.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1163/reg_CnynCrkJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1163/reg_IMG-2428-8213.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1163/reg_ND7-4731-8213.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1163/reg_map.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1163/topo_ccaltjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1163/narrow_IMG-2401-8213.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1163/narrow_IMG-2405-8213.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/canyon-creek-trail-ings-mine-near-kananaskis-ab-1163",
    "stats": {
        "Activities": "snowshoe hike ski-xc mtn-bike",
        "From": "",
        "Seasons": "winter fall summer",
        "Stars": 4,
        "Time": "4 hrs",
        "Total Distance": "31 km",
        "Town": "Kananaskis, AB",
        "Type": "out-and-back"
    },
    "title": "Canyon Creek Trail (Ing's Mine)",
    "trail_id": "1163"
}