{
    "description": "Edwards Rating: I (II) L MThis is a superb hike, easy scramble and beautiful 360 views with Diana Lake and a little unnamed lake below the summit. The Judge is really beautiful with its white rocks on the last portion of the summit block. There are a lot of flowers around, grizzly bear encounter by two other hikers we met at the top so be careful.Nice descent in an avalanche gully that soon leads you back to Diana Lake trail walking in the meadows. The 6 km approach to Diana Lake is quite nice, but reaching a peak or col surrounding the lake is a must to get wonderful views.The crux is to find the fireroad that leads to the trailhead. Diana Lake trail and the trail that leads to the col and then the ridge walk are not complicated, there are many signs or orange or blue flags. Download my GPX file if you can, it will help you out a bit if needed.// Net elevation of 1312 m, TOT of 1562 m and max 2752 m // UP to Diana Lake in 6.47 km // UP to The Judge in 10.81 km // DOWN in 8.02 km. // TOT 18.83 km",
    "directions": "Here are the indications from the Ministry of Forests website to get to the trailhead:Travel north from Radium town site along Hwy 95 and turn right after 18 kms (.5 kms south of the Spur Valley Campground) onto the graveled Kindersley/Pinnacle Creek FS Road.  At 8.7 kms the main road travels left and climbs uphill into the Pinnacle Creek drainage.  Several forks in the road, some with direction posts, are passed: stay left at 10.6 kms, right at 11 kms, left at 12.5 and 13 kms, right at 13.5, 14 and 15 kms, then stay left to the road?s end at the 24 km mark.",
    "geohash": "c3j3",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/11632/reg_The-Judge-Kootenay-Ridge-Walk-Aug-27-2014-3--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11632/reg_The-Judge-Kootenay-Summit-Aug-27-2014-4--44639_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11632/narrow_The-Judge-Kootenay-Diana-Lake-Aug-27-2014-1--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11632/narrow_The-Judge-Kootenay-Ridge-Walk-Aug-27-2014-1--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11632/narrow_The-Judge-Kootenay-Summit-Aug-27-2014-2--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11632/narrow_The-Judge-Kootenay-Welcome-Aug-27-2014-44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/the-judge-near-radium-hot-springs-bc-11632",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 5,
        "Time": "10 hrs",
        "Total Distance": "19 km",
        "Town": "Radium Hot Springs, BC",
        "Type": "out-and-back"
    },
    "title": "The Judge",
    "trail_id": "11632"
}