{
    "description": "North summit is an easy-moderate scramble but going to the South summit after is much more challenging, requiring route finding with more difficult scrambling sections because of loose rocks and scree, rock bands (and snow that day). If you're not alone as I was, you'll have to call \"rocks\" all the time I am telling you. Wearing a helmet might be a good idea. You get beautiful views of the surrounding glaciers, Emerald Lake, President Range, Mt Carnarvon and the massive Mt Stephen. You?ll also see a lot of fossils and incredible shapes of rocks.Starting with Burgess Pass trail, this is an easy hour ascent up to the base of Mount Burgess. The most popular option is to go to the North Summit; pretty much straight up scrambling in the farthest and largest gully you see when the view opens up from Burgess Pass trail. You'll see a big cairn close to the trail indicating you can cut off on your left and start walking in the scree towards that gully, up north. This is the same gully if you want to go to the South summit first, but you'll have to find your way to the left side at the end of it, leading you to a rocky basin where you'll go straight up another scree and rock bands slope.What I did is actually going up to the highest point where I could see North summit and turned right to start with the East Peak of Burgess. Then, I just walked on the col to the North Summit. From the North summit, I started to walk the ridge until it got too steep and impossible to scramble. That's when I descended in that rocky basin, walking along the wall of the last and highest summit trying not to lose too much elevation. When you get to that scree slope on your right, the fun begins! Rock is unstable and some route finding is required. Stay straight up or left but don't go to your right, you'll get to some climbing walls with great exposure. I tried it and I had to come back to my starting point. Once on the ridge, it's an easy walk to the last summit. RETURN THE SAME WAY. Don't try to go down south west, it is very dangerous and exposed, it is freestyle climbing almost at some point. I tried it and I couldn't keep going. Rather descend the same way down to the rocky basin and find back your way to the same gully you came up.I modified my GPS track so you have something more accurate (without my route finding) but as long as you don't make the same mistakes I discussed above, you won't necessarily need it. Elevation about 1343 m, 1800 m net. Max elevation at 2596 m.",
    "directions": "From Field, take the Trans-Canada Highway East for about 400 metres, you'll see a little road on your left, leading you to Burgess Pass trailhead.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/11644/long_Mount-Burgess-Traverse-Yoho-East-North-summits-Sept-13-2014-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11644/reg_Mount-Burgess-Traverse-Yoho-Sept-13-2014-7--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11644/reg_Mount-Burgess-Traverse-Yoho-South-Summit-Sept-13-2014-2--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11644/reg_Mount-Burgess-Traverse-Yoho-View-North-Summit-Sept-13-2014-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11644/reg_Mount-Burgess-Traverse-Yoho-Welcome-Sept-13-2014-2--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11644/narrow_Mount-Burgess-Traverse-Yoho-Fossiles-Sept-13-2014-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11644/narrow_Mount-Burgess-Traverse-Yoho-Sept-13-2014-12--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11644/narrow_Mount-Burgess-Traverse-Yoho-Sept-13-2014-13--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11644/narrow_Mount-Burgess-Traverse-Yoho-View-Carnarvon-Emerald-Peak-and-Lake-Sept-13-2014-44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mount-burgess-traverse-east-to-north-to-south-near-field-bc-11644",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 3,
        "Time": "8 hrs",
        "Total Distance": "13 km",
        "Town": "Field, BC",
        "Type": "out-and-back"
    },
    "title": "Mount Burgess Traverse: East to North to South",
    "trail_id": "11644"
}