{
    "description": "Edwards Rating: IV (V) S S, when climbing all the ridgeThis scramble is difficult/expert technically if you don't lose elevation and detour on some of the slabby ridge sections. It involves route finding (once you start this climber's scramble) and some sections of the ridge are extremely exposed with very minimal holds. You should look back every 3-5 metres to check if you can go down the same way if you can't make it at a certain point. I can easily see hikers getting stuck in dangerous sections of that ridge. Take your time and enjoy!I tried it 3 times and this last time, I got to complete it 100% on the slabby ridge. Starting on a good trail left of a creek bed, you will see a few trails on your left, don't go there. Just stay as close as you can to that creek for open views and an easy walk up over the tree line without even going into the forest. You'll see the challenging ridge on your left on the way up after only 400-500 metres. The trail leads you under that ridge, starting to go left after about 800 m I would say. Once in front of the first slabs, you'll have a few cairns to help you out and it will be technically easy. The first step that is challenging is at about 1.6 km, when you have a gigantic slab that you want to take on its crest but there is exposure and 2-3 steps without good holds. I hope you have good boots because you'll need adherence here and thereafter. After that, there are 2 sections I think that are not bad at all. Then, you'll have those 2 impressive walls and also a slab to traverse. The walls can be ?climbed? easily enough but are impressive and can be dangerous. Make sure you verify your grips and footholds as some rocks are unstable. When you traverse the slab left to right, there's (to me at least) the crux. WARNING/DANGER: Exposure, no holds at all, you have 3 little steps you can make straight up on the slab looking for a solid rock to grab to pull you up to a safer spot. Then, you'll have again exposure but more holds to climb up to the very last and easy portion of the ridge leading you to the West Summit. If you are not a scrambler, consider another route.Once you made it, you can go down East and then on the scree slope between West and South summits, that's what I did the first time. Or you can go down the same way and take the detours to avoid doing all those exposed sections again. The third and excellent option (my GPS file shows this descent route) is to go straight South where you see another summit with 3 obvious cairns. Challenging scrambling on this ridge is never ending, seriously! You never leave the ridge, it leads you to about 200 metres above a river bed where Baldy Pass trail is located. Only then will you cut to your right down slabs and scree to get to that trail with 100-200 metres of easy bushwhacking. Once on baldy Pass, you get back to the highway 40 and will see your car about 600 metres North. ** Please note that I revisited this south ridge in 2019, going up this time. It is difficult, often exposed, slabby with scree and loose rocks. Also route finding skills are essential, no cairns, some faint trails once in a while at best.",
    "directions": "From Calgary, take the Trans-Canada Highway up to exit 118, Kananaskis Trail - 40 South. Start your odometer in front of the Stoney Nakoda Casino entrance and drive 13.5 km. You?ll see the creek bed on your left where you?ll park next to the road.",
    "geohash": "c3n4j",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/11651/long_Mount-Baldy-West-Ridge-Traverse-Kananaskis-Down-to-Baldy-Pass-Sep-18-2014-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11651/long_Mount-Baldy-West-Ridge-Traverse-Kananaskis-Sep-18-2014-16--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11651/long_Mount-Baldy-West-Ridge-Traverse-Kananaskis-Sep-18-2014-3--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11651/reg_Mount-Baldy-West--False-Summit-Kananaskis-Marry-up-Some-Moderate-Scrambling-Aug-18-2019-800x600--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11651/reg_Mount-Baldy-West--False-Summit-Kananaskis-Mary-up-Crux,-1st-Part,-WOW-Aug-18-2019-800x600--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11651/reg_Mount-Baldy-West--False-Summit-Kananaskis-Myself-up-1st-Section,-Crux-Aug-18-2019-800x600--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11651/reg_Mount-Baldy-West--False-Summit-Kananaskis-Up-Other-Exposed-Section,-Wow-Aug-18-2019-800x600--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11651/reg_Mount-Baldy-West-Ridge-Traverse-Kananaskis-Sep-18-2014-11--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11651/narrow_Mount-Baldy-West--False-Summit-Kananaskis-Marry-up-Crux,-2nd-Part,-Wow-Aug-18-2019-600x800--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11651/narrow_Mount-Baldy-West--False-Summit-Kananaskis-Me-up-2nd-Section,-Crux-Aug-18-2019-600x800--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11651/narrow_Mount-Baldy-West--False-Summit-Kananaskis-Some-Easier-Fun-Scrambling,-Nice!-Aug-18-2019-600x800--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11651/narrow_Mount-Baldy-West-Ridge-Kananaskis-The-crux-not-bad-after-all-GO-RIGHT-in-the-middle-Aug-31-2014-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11651/narrow_Mount-Baldy-West-Ridge-Traverse-Kananaskis-Sep-18-2014-20--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11651/narrow_Mount-Baldy-West-Ridge-Traverse-Kananaskis-To-the-crux-Sep-18-2014-2--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11651/narrow_Mount-Baldy-West-Ridge-Traverse-Kananaskis-West-to-South-complete-ridge-Sep-18-2014-2--44639_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11651/narrow_Mount-Baldy-West-Ridge-Traverse-Kananaskis-West-to-South-complete-ridge-Sep-18-2014-3--44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mount-baldy-west-ridge-traverse-loop-near-kananaskis-ab-11651",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 5,
        "Time": "6 hrs",
        "Total Distance": "7 km",
        "Town": "Kananaskis, AB",
        "Type": "out-and-back"
    },
    "title": "Mount Baldy West Ridge Traverse-Loop",
    "trail_id": "11651"
}