{
    "description": "Edwards Rating: II (III) S MThe fact that this requires bushwhacking through a forest with many trails (mostly animal trails I would say) and that we have to deal with quite a few rockbands in the forest and finally 2 cliff bands after the tree line, I would rate it as a moderate scramble. It's not as bad though because the forest is quite open. My skills in route finding in a forest are not good yet I can tell, I always end up bushwhacking even if it was the third time I was there. The first two times were in May and there was too much snow, mud... and a lot of ticks. In September, conditions were perfect to finally complete it.I would recommend using my GPS track to help you get through the forest, I made it up from my last 2 trips there and it may be helpful. Starting on Grotto Canyon trail behind Baymag plant 2, I walked about 200 metres, until I saw a trail going up into the forest on the right side. I started bushwhacking and got to the first rock band, getting around it on its left end. Because of my two first experiences, I didn?t try too much to follow a particular path to start with. I then started to see blue and/or orange flags that I followed up to the tree line. The first scree slope can be taken straight up to the highest point of that long cliff band you see. I didn?t go into the forest on the right side of the scree slope, a mistake I have made the first time and it?s not worth it trying to take that ?shortcut?. Once at the base of the cliff, I took the right path and went to the end of the band. I started to scramble up that little scree slope and cut to my left very soon to go up on the cliff. Once on it, I had to do a little 3 steps hands on scrambling, easy and not exposed. Seeing the second cliff band, I kept going on the obvious trail (finally!) leading to the end of it. There are many ways to scramble up and you want to do it as soon as possible so you don?t take the wrong trail up. A last scree slope with pinnacles on my right and the false summit on the left side, I went straight up between the two. Some people go right and on a more exposed scree slope all the way to the summit. I did it the first time and I didn?t like it. Once done with the scree, I scrambled through the false summit block, easy but sometimes exposed. Once at the top of it, I finally saw the true summit at the end of a 600 metres ridge walk. I stuck to the ridge rather than lose elevation on its right side like some seem to be doing. It?s more exposed and boring I think. The ridge walk is beautiful, most of the time really easy, not too exposed and footholds are solid.Elevation gain: net 1181 m, Tot 1230 m. 5-8 hours trip",
    "directions": "From Calgary, take Highway 1 west up to exit 114, 1X North. Drive 3.6 km down to Bow Valley Trail/1A and turn left for another 11.2 km. You will see the Baymag sign; turn right to park beside Grotto Canyon trail.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/11657/long_Gap-Peak-Kananaskis-Summit-Sept-21-2014-4--44639_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11657/long_Gap-Peak-Kananaskis-Summit-View-Mt-Fable-Sept-21-2014-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11657/reg_Gap-Peak-2nd-cliff-band-Kananaskis-May-19-2014-2--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11657/reg_Gap-Peak-Kananaskis-Last-Scree-Slope-Sept-21-2014-2--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11657/narrow_Gap-Peak-1st-cliff-band-Kananaskis-May-19-2014-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11657/narrow_Gap-Peak-Around-1st-cliff-Kananaskis-May-19-2014-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11657/narrow_Gap-Peak-Kananaskis-May-23-2014-6--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11657/narrow_Gap-Peak-Kananaskis-Summit-Sept-21-2014-2--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11657/narrow_Gap-Peak-On-1st-cliff-Kananaskis-May-19-2014-44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/gap-peak-near-kananaskis-ab-11657",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 3,
        "Time": "7 hrs",
        "Total Distance": "9 km",
        "Town": "Kananaskis, AB",
        "Type": "out-and-back"
    },
    "title": "Gap Peak",
    "trail_id": "11657"
}