{
    "description": "11kms each way, 22kms round trip.Definitely better to do late in the summer with Hidden Lake being a part of this journey. There is already a very good writeup to Fossil Falls on this site, where continuing up to Aster Lake is a continuation for another hour and a half or so. I recommend this hike as a two day trip spending the night up at Aster Lake campground, however you could do it in a 10 to 12 hour day hike, especially with just your daypack. Give yourself time either way though, you do not want to be route finding in the upper elevations with a headlamp! My dog and I hiked 5 hours up and 4 hours down with a 40 lbs pack and two detours. Our way down should have been 3.5 hours or less, but I tend to hike at a rather fast pace.",
    "directions": "Follow Upper Kananaskis Lakes Trail along the South side of the upper lake until the SW creek entrance. (5.5kms) Turn South here where there is a large opening that does look like a fork, but I didn't see a trailhead sign from my Westward direction.It's about 1km to Hidden Lake. Follow the East shore of Hidden Lake, hopefully you went late in the year when the water is lower. At the South end of the lake, you can see where there is an obvious trail into the trees and your uphill adventure begins!After another 1 or 2 kms you climb up to a scree slope and follow the trail and stacked rocks to climb uphill for some spectacular views of Fossil Falls.At the top of the scree section there is one simple little 5 ft scramble to get over, so if you're not overly sure-footed this might not be a trail for you. I had to give my dog a boost to get up and down this section.From here on, the trail isn't as physically demanding, it's just a lot of ups and downs over rock, then grass then trail, then rock etc. etc.. Try not to lose the trail. :)  From the mudflats at the very top (where there's a turnoff to head up to the Ranger Station instead) to Aster Lake, the trail is difficult to keep an eye on. Wider grassy sections make for a less trampled footpath and the creek crossing at the top means people will choose their own best crossing point based on the water level/current. I lost the path at this section both on the way up and down.Drop your pack at the campground and go check out the lake and area just so you see what you actually climbed to. You can't actually see the lake from the camping area.As I mentioned about losing the trail: On the way down, be careful not to head too far North (downhill) before this mudflat or you'll have to backtrack uphill. There is a VERY common footpath of numerous hikers who've taken the wrong trail (myself included) to find the route getting steep, cornered by fossil falls, then turn around and head back uphill. Print my GPS trail on a Satellite image background and take that with you, and you should be worry free.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/11653/reg_20140920-141729-46070.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11653/reg_20140920-155632-46070.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11653/reg_20140920-155637-46070.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11653/reg_20140920-161157-46070.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11653/reg_20140920-173810-46070.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11653/reg_20140921-132904-Richtone-HDR--46070.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11653/narrow_20140921-094409-46070.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/aster-lake-near-kananaskis-ab-11653",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 4,
        "Time": "14 hrs",
        "Total Distance": "11 km",
        "Town": "Kananaskis, AB",
        "Type": "out-and-back"
    },
    "title": "Aster Lake",
    "trail_id": "11653"
}