{
    "description": "Infrequented summit to south of First Lake in the Nanaimo Lakes chain. Summit block remains interesting. Remains of old fire lookout. Great views. This is a route, there is no trail to the top.",
    "directions": "Take Nanaimo Lakes road to main gate just before First Lake. Pass through gate, attendent willing and then travel about 4 kilometres until forked juntion to First Lake camping grounds. Travel another kilometre from junction. Cross brigde and park on right directly in front of the gate. As of 2014 there was no active logging on this branch and it has become limited access as the gate is never open. Hoof it from here. Continue walking up and keep left on all roads until find yourself ascending on switchback road. Road is initially grown over in sections, but opens up totally from about 600 metres in elevation. Follow road all the way up to about 950 metres and the road ends in a major logging landing. Follow open area either to the east and ascend into 1st growth or ascend more or less directly from the road up until you hit first growth. Ascend about 150 metres until angle lessens and more open areas appear. Continue along ridge until flattens out, and you pass some small tarns with water.Eventually you will hit the old access road about 200 metres from the summit block. Follow this to the end, climb past old stairs and up on to the summit block until you see the remains of an old fire lookout tower from the 40s and 50s.  Return via same route or take road down until you have lost enough elevation to head back into the 1st growth and taverse to the logging landing. if you are a glutton you can follow the original access road down to 1st Lake.  The road is not usable to any motorised transports. No quadders here, in places the vegetation is thick, in others the original road is still present. *This is private forested land of Timber West and they control the gates. Ther use of ATVs is not allowed around Nanaimo Lakes. Your call, but here it is very much enforced.",
    "photos": [],
    "source_url": "https://trailpeak.com/trails/mt-hooker-nanaimo-lakes-near-nanaimo-bc-11656",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 2,
        "Time": "4 hrs",
        "Total Distance": "12 km",
        "Town": "Nanaimo, BC",
        "Type": "out-and-back"
    },
    "title": "Mt. Hooker, Nanaimo Lakes",
    "trail_id": "11656"
}