{
    "description": "This is a mtn bike trail I have been looking to get on for a while; the Evil Birch.  But in order to access Evil Birch you must complete the Suzie Lake area trails and bypass the quarry.  This is a description of the Suzie Lake - Quarry area for mtn bikers.I set off on the corner of highway 102 and Lacewood Drive.  A faint trail enters the wood at this exact point so I followed it for a while.  It is rideable at times and others it is mostly suited for hiking.  I cut off towards highway 102 ands cycled to another access point.  This is an old road which leads you to the top of the quarry.  Once at the quarry stay on the main path on the west side of the quarry and you will see numerous access point on your right as you head North alongside the quarry.  I ended up by the dam of Quarry Lake.  I will here tell a small story which has nothing to do with the path itself but may help someone in the future.   I thought the Evil Birch trail started after the dam ...it may have I didn?t pursue the small and faint trail I  saw across the dam.  Anyways back to the dam and my story.  I had to cross the dam but you cannot cross the structure with a bike.  Just downstream of the dam was an area which seemed narrow but had a lot of water flowing.  It was narrow enough I decided I would throw my bike across and then leap over by jumping.  Of course my back wheel caught something and then my bike splashed in the middle of the stream.  I thought I could then jump and retrieve it from the other side.  To my horror, the bike started floating...yes floating down the heavy current towards a pond of unknown depth.  I had to jump in at this point and so it was the last instance of my journey seeking Evil Birch.........another time maybe.  Lots of secondary trails around the quarry some are pretty good and fast while others are overcrowded by alders and labrador tea brush",
    "directions": "Lacewood drive at highway 102 is the start point of one of the trails going towards Suzie Lake",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/11665/reg_GOPR0576-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/suzie-lake-near-halifax-ns-11665",
    "stats": {
        "Activities": "hike mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 2,
        "Time": "2 hrs",
        "Total Distance": "8 km",
        "Town": "Halifax, NS",
        "Type": "out-and-back"
    },
    "title": "Suzie Lake",
    "trail_id": "11665"
}