{
    "description": "Sub-alpine summit with good views to the North and East.  Fairly easy access to open alpine area and good sections for Rock Climbing development.",
    "directions": "Start up Timber West Road from the Diamond Gate in North Ladysmith - the old Comox Loggind Ladysmith Main. Pass immediately through main Timber West gate (usually open) and travel along the main road about 10 kilomtetres until the road forks into two main roads. Keep right. Travel another 2-3 kilometres ignore smaller side roads and keep along the main road heading roughly Southeast. At about the kilometre section turn right onto lesser road that climbs steadily. Continut through two or three switchbacks until the road comes to an end at a washout. You can park here or lower down at a wider turn out. Continue walking onthe older logging road. About 45 mins takes you past swwitchbacks and past a relatively newer mountain cabin. Keep along the main road and either branch up directly through the logging slash into 1st growth above the cabin or travel to end of road and then head Northeast into the 1st growth.  Head along ridge heading East. The summit is still, thankfully unlogged and there one can travel along the summit ridge and back in a pleasant environment with good views and more than a few deer in the area. Note: The traverse to Coronation Mtn and back is still possible (about  12 kilometres return) but majority of the 1st growth in this area was removed in 2012 logging and after about 2 kilometres of hiking on the summit ridge of Mt. Hall you need to traverse into the cut block logging slash below and then follow the road up the other side and on to the summit of Coronation, rathy bushy in my estimation, but worth a visit. Please also note that the road to the cabin is popular with quadders, so if that is not your genre of entertainment you may be annoyed. Patience however and a short jog into the 1st growth leaves this all behind you, so endure and you can will find the peace you are looking for on the summit.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/11660/reg_P1260613-49764.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11660/reg_P1260620-49764_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11660/reg_P3020626-49764.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11660/reg_P3020632-49764.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11660/reg_P3020633-49764.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11660/narrow_P1260617-49764.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mt-hall-near-ladysmith-bc-11660",
    "stats": {
        "Activities": "climb snowshoe hike ski-bc",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 2,
        "Time": "3 hrs",
        "Total Distance": "5 km",
        "Town": "Ladysmith, BC",
        "Type": "out-and-back"
    },
    "title": "Mt. Hall",
    "trail_id": "11660"
}