{
    "description": "Edwards Rating: IV (V) M M for the three summitsEdwards Rating: II (III) M M for North Summit onlyWhat an exciting scramble, one of my favourites so far! You need to be comfortable with a lot of skills to complete this traverse: very dangerous exposure, climbing moves, chimneys, gullies with rock bands, hands on scrambling and route finding. If you have no skills with route finding, this would be dangerous as there are a few ways to scramble these 3 summits. Some may be very dangerous, so make sure you are able to do the opposite (return) route and look back often.You start on Cory Pass trail with an easy hike up with 900 m elevation. When the view opens up and you start to see Mt Edith and Cory, look for an alternative route in the slope to your right about 200 metres before the Pass. It is parallel to the official trail but you start to get some elevation towards your first objective, North Summit. Easy scramble up in a scree slope to the summit block, where you will see two chimneys on your right. I preferred to go up the first one, but some definitely took the second one where there's a cairn. You will get brief exposure there and take on your right with some hands on scramble. You'll get to two peaks, you can turn left as soon as possible to cross a ravine and get to what seems to be the highest one.Descend the same way and skirt around the North summit block to get to the Centre summit. Easy scramble until you join the Centre block, where you can choose to take on its left with an exposed ledge walk or scramble on the ridge and to its right with some trickier climbing moves if you don't want to lose elevation. I chose the second one. Once in a gully facing South Summit, it's again an easy scramble to the second summit of the day.Descend in that gully facing your third summit, the more challenging South Block. You will clearly see in front of you a gully you need to get to and start scramble up. On the left side, it's more of a of a hands on scrambling and a tunnel traverse. On the right side, it leads you to an exposed ledge. I chose the exposure this time. Pass this point, you'll see a lot of cairns and most of them make sense. I scrambled up as straight as I possibly could and got to that large hole with a big vertical flake. I tried to go up on the right side but I didn't like the exposure where I had to do a difficult pull up with no good holds. I turned back many times, assessed the short climb of 3-4 metres at the end of that hole and finally saw the obvious, a 3 steps move starting with a great foothold on the right wall allowing me to take a step up on my left and then pull myself up. The last few metres to the summit was an easy scramble.Descend the same way to the South-Centre col where you'll see a clear path in the scree leading you straight back to Cory Pass Trail.You may use my GPS as a guide as I \"cleaned\" it up a bit from all this route finding, but you absolutely need to have some route finding skills as my route may not be the one you would take. TOT elevation of approx. 1442 m, Net of approx. 1120 m and max 2551 m6 to 10 hours for the three summits",
    "directions": "From Banff, follow the Trans-Canada Highway 3 km west and take the exit for Johnston Canyon. Immediately take the fireside road on your right to get to the Cory Pass parking lot.",
    "geohash": "c3j",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/11672/long_Mt-Edith-Banff-Centre-Summit-Sept-27-2014-2--44639_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11672/long_Mt-Edith-Banff-Cory-Pass-Sept-27-2014-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11672/long_Mt-Edith-Banff-Sept-27-2014-46--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11672/long_Mt-Edith-Banff-View-of-Centre-Summit-Sept-27-2014-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11672/reg_Mt-Edith-Banff-Sept-27-2014-38--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11672/narrow_Mt-Edith-Banff-North-Chimney-Sept-27-2014-2--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11672/narrow_Mt-Edith-Banff-North-Chimney-Sept-27-2014-4--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11672/narrow_Mt-Edith-Banff-North-Chimney-Sept-27-2014-5--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11672/narrow_Mt-Edith-Banff-Sept-27-2014-12--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11672/narrow_Mt-Edith-Banff-Sept-27-2014-8--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11672/narrow_Mt-Edith-Banff-South-Climbing-move-Sept-27-2014-44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mount-edith-traverse-near-banff-ab-11672",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 5,
        "Time": "7 hrs",
        "Total Distance": "14 km",
        "Town": "Banff, AB",
        "Type": "out-and-back"
    },
    "title": "Mount Edith Traverse",
    "trail_id": "11672"
}