{
    "description": "Reeve?s Ravine and Bald Hill trails are located in Riding Mountain National Park approximately 245 km north-west of Winnipeg or 130 km northeast of Brandon. The area is situated on the edge of the Manitoba Escarpment, which offers a wide range of gully and valley terrain that provide exceptional scenery and challenging riding.   Reeve?s Ravine was developed in a partnership between Parks Canada and the Manitoba Escarpment Trail Society.  The trail was constructed to IMBA specifications and offers a new experience for intermediate to expert mountain bikers. This unique escarpment experience along the ravine?s edge boasts some of the most spectacular views in the park.  This trail also connects to the Bald Hill allowing the cyclist to connect to several additional trails. See map: http://www.pc.gc.ca/eng/pn-np/mb/riding/activ/activ4.aspx#reeves",
    "directions": "The trails are located within the Riding Mountain National Park, so a National Park Pass is required.  After going through the historic east park gate entrance on Hwy #19, continue west approximately 400 m, turn north on the first gravel road and continue to the end of the road, which is the trail head for the Reeve?s Ravine and Burls and Bittersweet trails.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/MB/11682/reg_IMG-20121020-00144-49797.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/MB/11682/reg_IMG-20121020-00152-49797_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/MB/11682/reg_IMG-20121020-00154-49797.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/reeves-ravinebald-hill-near-mccreary-mb-11682",
    "stats": {
        "Activities": "hike mtn-bike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "12 km",
        "Town": "McCreary, MB",
        "Type": "out-and-back"
    },
    "title": "Reeve's Ravine/Bald Hill",
    "trail_id": "11682"
}