{
    "description": "Edwards Rating: II (III) M M - for the complete traversePorcupine Ridge's official trail ends at about 4.5 km and is pretty much a hike with some easy to moderate (if you stick to the ridge all the way) scramble on the ridge where you can avoid some exposed sections if you want. I wanted more so I kept going all the way SE and finished the ridge walk where it turns South with 3 peaks aligned. At this point, I was facing another long ridge, Wasootch and also Mount Bryant N4 Summit pretty close further East. Views are really nice like any ridge walk! The entire traverse is definitely moderate because of the exposure, some hands on scrambling and maybe some route finding depending on your experience.Starting on the left side of Porcupine Creek, I followed the creek until I saw some climber's cliffs on my left, where I scrambled along the creek. Once passed the cliffs, the creek splits and I crossed to get in the middle where Porcupine Ridge starts. From there, it's almost straight up all the way with maybe some bushwhacking, try to stay on the right side as much as possible to avoid this. There are no indications at the end of the official trail, but it is just before a narrow ridge walk with exposure and long slabs. From there, you can keep going on the ridge up to the very last peaks. Again, the best way is almost always directly on the ridge except at the end where it was more of an exposed climbing so I went around to its left and scrambled up the first gully I saw to summit the two last peaks. My GPS track up is very accurate up to the scrambling section, but I took the most exposed trails and did as much hands on scrambling as I could. You may prefer the track down if you want to avoid most of the exposed sections, as I often take the easiest route on my way down. The only thing though is that I bushwhacked a lot when I returned as I didn't realize I should have turned left sooner after the scrambling section. Net elevation of 872 m, TOT 1296 m and max 2303 m.5 to 9 hours",
    "directions": "From Calgary, take the Trans-Canada Highway up to exit 118, Kananaskis Trail - 40 South. Start your odometer in front of the Stoney Nakoda Casino entrance and drive 14.5 km. You can park along the highway just before Porcupine Creek or go off road on your left where you'll see a trail you can go down with your car to park right beside the creek.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/11680/long_Porcupine-Ridge-Traverse-Kananaskis-Exposed-Sections-Oct-4-2014-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11680/long_Porcupine-Ridge-Traverse-Kananaskis-Exposure-Oct-4-2014-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11680/long_Porcupine-Ridge-Traverse-Kananaskis-Ridge-begins-Oct-4-2014-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11680/long_Porcupine-Ridge-Traverse-Kananaskis-Tricky-gully-to-last-peak-Oct-4-2014-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11680/reg_Porcupine-Ridge-Traverse-Kananaskis-Last-Peak-Oct-4-2014-44639_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11680/reg_Porcupine-Ridge-Traverse-Kananaskis-Oct-4-2014-3--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11680/narrow_Porcupine-Ridge-Traverse-Kananaskis-Oct-4-2014-15--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11680/narrow_Porcupine-Ridge-Traverse-Kananaskis-Oct-4-2014-4--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11680/narrow_Porcupine-Ridge-Traverse-Kananaskis-Some-exposure-Oct-4-2014-44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/porcupine-ridge-traverse-near-kananaskis-ab-11680",
    "stats": {
        "Activities": "climb hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 3,
        "Time": "6 hrs",
        "Total Distance": "14 km",
        "Town": "Kananaskis, AB",
        "Type": "out-and-back"
    },
    "title": "Porcupine Ridge Traverse",
    "trail_id": "11680"
}