{
    "description": "A trip up and around Cobble Hill Mtn. via little travelled trails. Please see enclosed GPS track as there is no guidebook nor much signposting for this trail and there are many intersections with other trails. Good views from summit and at open bluffs. Start at bike park - there is a general trail sign at the start which shows routes that are signposted with animal icons. (see http://cvrd.bc.ca/DocumentCenter/ View/64048 for this map). You basically want to follow the sequence Rabbit/Squirrel to their intersection with Salamander and take that trail in a northerly direction until it intersects with an old logging road after about 1 km (48.692469° -123.612388°). Proceed across the road to an obvious trail heading up a wooded shoulder (this is not sign posted). After another 1 km there is a signposted junction at  48.691683° -123.619270°. Bear left and switchback up this trail that contours underneath the steep  bluffs on the NE slopes.  The trail intersects with another trail (bear left or straight ahead and up) and then meets with another old logging road at  48.688051° -123.619802°. Continue on logging road to the next signpost, bear left and follow the short trail up to the summit area (several view points). The summit area features several trails that take in these viewpoints as well as two, logging roads that leave the summit area in a southerly direction. To continue on the Cougar trail, take the road furthest W (skiers right) from the first viewpoint to its intersection with another old road heading west which is signposted (the Deer trail); after a short distance bear left and follow the Deer trail down towards the bluffs which lie at  48.685661° -123.620985°.  Take the first right just before these bluffs (which offers good views of Shawnigan Lake) at  48.685730° -123.620989° to continue on the Cougar trail. After this there are no more signs until the Cougar trail intersects with another old logging road at 48.683168° -123.629367° and ends at this road. You can turn left and follow this road up to the S summit area, or take a flagged trail that leaves this road almost immediately to the right as you head up it (the GPS route). Follow this route up to it's intersection with the main trail (Dragonfly) coming up the SE slopes of Cobble Hill and follow that to the main S summit viewpoint at  48.681111° -123.627872°.  From here follow the main logging road first to the NW and then to NE until it intersects with a steep spur at 48.683176° -123.620847°. Just beyond this spur there is a faint, unmarked trail heading uphill to the left. It eventually intersects with the Deer Trail near  48.683244° -123.618831° which can be followed all the way back to the parking lot. The GPS track takes a shorter route making use of the Eagle trail and a short cross-over trail to regain the Deer Trail at  48.684136° -123.610176° and then follows well established trails back to the parking lot.",
    "directions": "Take Hwy 1 (Trans Canada) to Cobble Hill from Nanaimo (N) or Victoria, BC (S). Turn right (coming from N) or left (from the S) onto Cobble Hill Rd. Follow this 'til intersection with Hutchinson and turn R onto Empress Ave. Park off to the right above the dog run if there is room.",
    "geohash": "c28",
    "photos": [],
    "source_url": "https://trailpeak.com/trails/cobble-hill-mtn-cougar-trail-near-duncan-bc-11688",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "8 km",
        "Town": "Duncan, BC",
        "Type": "out-and-back"
    },
    "title": "Cobble Hill Mtn Cougar Trail",
    "trail_id": "11688"
}