{
    "description": "Edwards Rating: II (III) L LThis is a moderate scramble technically with very few hands on scrambling when going up on the slabby ridge with some exposure. The crux is a portion of the ridge you need to walk on a narrow ledge along a boulder or climb over it. If you want to do some nice scrambling, you really should attack the summit block as soon as you are at the base (our way up on the GPS track). You can avoid that if you prefer by taking more elevation on the scree slope and then go past the ridge in the back of the summit block and you'll see a scree trail there (our way down on the GPS track). The main issue is that you will have to do some bushwhacking and route finding because the trail has been washed out by the flooding. We must have crossed that creek 20 times overall.We started from a parking in front of the Royal Canadian Legion as there was a \"welcoming\" sign for hikers indicating your car would be towed away if parking in the streets of Exshaw. From there, we walked up the first street we crossed to get to Windridge Rd and followed it till it ends at Exshaw Creek. We crossed the creek and walked along until we got to the dam, scrambling up on the left side. Then, it's a very long approach pretty much all the time in that creek bed until it opens on a valley on your left where you going to turn and keep going up to the rock band and the scree slope below Mount Fable that you finally see at this point. Once you scrambled pass the rock bands, you can get closer to the col until you see a scree slope between lower slabs on your right. It will get you to the ridge where you can scramble straight up for some challenges or take the other option of going pass the ridge and follow an easy scree trail to the top.This is a good scramble but a very long day, make sure you have a couple of hours more than what you expect to take to complete it and bring a GPS tracker with you if possible.Elevation of 1425 m and max 2724 m. 9 -12 hours",
    "directions": "From Calgary, get on highway 1 direction to Banff and take exit 114 toward Exshaw. Continue for 3.6 km and turn left on Bow Valley Trail/1A. Drive 6.9 km and turn right to Hearth Mountain Dr. Then turn left and you'll see parking spaces on your left.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/11681/long_Mt-Fable-Kananaskis-Crux-Oct-5-2014-1--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11681/long_Mt-Fable-Kananaskis-Oct-5-2014-1--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11681/long_Mt-Fable-Kananaskis-Oct-5-2014-21--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11681/long_Mt-Fable-Kananaskis-Oct-5-2014-22--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11681/long_Mt-Fable-Kananaskis-Oct-5-2014-8--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11681/long_Mt-Fable-Kananaskis-Summit-Oct-5-2014-3--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11681/long_Mt-Fable-Kananaskis-Summit-Oct-5-2014-8--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11681/narrow_Mt-Fable-Kananaskis-Oct-5-2014-3--44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mount-fable-near-canmore-ab-11681",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 3,
        "Time": "9 hrs",
        "Total Distance": "22 km",
        "Town": "Canmore, AB",
        "Type": "out-and-back"
    },
    "title": "Mount Fable",
    "trail_id": "11681"
}