{
    "description": "This was an early bonus to our annual October weekend adventure hike to Baxter State Park. Due to scheduling conflicts, we had to find different lodgings to what we normal book, so we choose Big Moose Inn, cottages and campground. It was Columbus Day Weekend, so things were packed, as for several outfits, this was closing weekend.When we arrived to our cabin on the lake, we saw three parked canoes just begging to be used. With a full moon lit night, warm air, and no wind, we begged the staff to give us paddles. With the promise that we'd affix my headlamp to the canoe with the provided strip of duct tape (It is the law after all) I returned bearing paddles and PFDs. Off we went. No need for a light, as the moon lit the way on the water. We paddled around the South edge, looking at private cottages and beautiful rocks jutting out of the water. To the North, we saw the moon lighting up the prominent item on the landscape; Mount Katahdin, our destination for early the next morning.With some photography play before we headed back, (we're both photographers) we were quite pleased at how we snatched the first little tidbit of adventure. Way to set the bar on what would be a very fine Canada Day / Columbus Day weekend.Looking at our GPS track once we returned, we only then realized how immense the lake actually was.Shannon BurtEast Coast Editor",
    "directions": "Big Moose Lodge and Cabins is 8 miles or 10 minutes from Baxter State Park proper, and right next to the Katahdin outfitter store on Baxter park road on the right hand side.",
    "geohash": "f2ph1",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/ME/11690/reg_arriving-Big-Moose-004-sml-6702.jpg",
        "https://trailpeak.com/storage//content/trails/US/ME/11690/reg_arriving-Big-Moose-011-sml-6702.jpg",
        "https://trailpeak.com/storage//content/trails/US/ME/11690/reg_arriving-Big-Moose-016-sml-6702.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/millinocket-lake-near-millinocket-me-11690",
    "stats": {
        "Activities": "sea-kayak river-canoe",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "3 km",
        "Town": "Millinocket, ME",
        "Type": "out-and-back"
    },
    "title": "Millinocket Lake",
    "trail_id": "11690"
}