{
    "description": "Obscure peak between Nanaimo and Ladysmith. Rarely ascended. Rocky open summit and some short ridge hiking. No trail. Pick your route and tray to maximise time in 1st growth forest.",
    "directions": "Follow McKay Lake FSR to power lines at about 8 km limit. Proceed through gate into private forest. If gate is closed park at gate and proceed on foot or with Mtn bike.  Keep on main road for about 1.5 kms. Turn left and over Wolf Creek. Proceed another 1.5 kms NE until first major turning. Take this road and keep right. Proceed along until you find a spot that strikes yor fancy to head off into 1st Growth Timber. Climb up through slash into rather poxy 1st Growth Timber. Timber line at about 750 metre level. Proceed up making gradual move towards the ridge line whilst veering to the left, or straight up until the ridge. Ridge flattens out and travel becomes easier. 1st growth is small and most of it not merchantable. Travel is basically good. At this point you can either follow the ridge until it crosses the old logging road, or keep right slightly hit the logging road earlier and proceed up the logging road. Logging road is faster, but some parts are grown shut with alder, but overall none too bad. Where road veers left and flattens look for a tounge of first growth that comes close to the road on your right. Gain this after about 40 metres off the logging road and travel along the North side of the mountain while climbing slightly. Forest opens up. Ascend via open rock bluffs and proceed along ridge across several false summits to the main summit with a small cairn. Great views... but not on the last day I did it. Descent route via the same as ascent or veer off down towards the end of the logging road and pass through nice hemlock forest just above the old cut-block.  Traverse and descend always keeping inside the 1st growth until the original route is gained where the timber takes you within a short distance of the logging road. From here descend road and at first turning strike into woods and continue down gradual slope that eventually steepens. Unlogged first growth with lots of moss. Fast decent. In some places possible to run. * Note: This is private land belonging to Timberwest (immediate vicinity) and Island Timberlands. The main gate near the power line has been turned by quadders on the road to the right below the gate... it is actually very easily accessible to a 4-wheel drive now. Access? Your call. I have walked these hikes from the gate too, but a good alternative it so bring your mtn bike and ditch them near wherever you decide to strike off into the forest.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/11694/long_20141018-104847[1]-49764.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11694/long_20141018-104915[1]-49764.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11694/long_20141018-110823[1]-49764.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11694/long_20141018-113535[1]-49764.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mckay-peak-near-ladysmith-bc-11694",
    "stats": {
        "Activities": "mtn-bike ski-xc hike snowshoe",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 2,
        "Time": "5 hrs",
        "Total Distance": "8 km",
        "Town": "Ladysmith, BC",
        "Type": "out-and-back"
    },
    "title": "McKay Peak",
    "trail_id": "11694"
}