{
    "description": "This is a really beautiful hike once you get up the super super steep part! I've never actually made it to the proper summit (apparently there is a box with a logbook) because once I've gained the ridge I've been distracted by the view and lunch.At first you go up and up and up on the switchback, which can be super slippery even when dry so be careful. The trail then opens up to a meadow with wildflowers. The trail turns left. If you continue straight for 100 m  it dead ends at a lookout down to the lake in the trees.Back on the trail, it goes up a dry creekbed (at least in early fall) and then back into the forest. Then there is another meadow with several pools of water. The trail seems to split, but I'm not sure where the right hand trail goes. Stay left, the trail goes back into the forest and then straight up. Then it's a scramble straight up to gain the ridge. Once on the ridge, the trail continues for another 1.5 km to the summit.It took us 1.5 hours to gain the ridge where we stopped for lunch. Then we headed back down which took us around 1 hour.There is more info about this trail on http://www.surfingvancouverisland.com/hike/mountmoriartytrail.htm",
    "directions": "The drive in can be super confusing! If you don't have GPS:From Hwy 4: 1. Turn south onto the Cameron Main connector, there is a dedicated left hand turning lane (wesbound) and a logging truck sign. Stop before you head down and reset your odo, and send your last cell phone messages as you lose signal once down.2. At the bottom of the connector, turn left onto Cameron Main. (there is a sign). Continue over the Cameron River Bridge, there is a major fork, stay RIGHT. Left is to Mt. Arrowsmith (there is a sign once you've turned).3. Keep on the MAIN logging road, don't go off on side roads, don't second guess yourself. After ~15 km stay left, after 20km stay right. 4. The two last forks are both to the left. If you go over the river a second time and start to climb, you've gone wrong. The last fork to the left does not look like the obvious choice, but if you are at the 27th km marker and it's the red gate its correct.5. Continue for another few kms and then park on the right before the sign that says Labour Day Lake.6. The trail head is marked with flagging tape and goes down for about 15 min into the woods. There's a fallen-over info board at the T junction, go left. (The trail circles the lake).7. Continue on the lake trail for about 5 minutes past the campsite and the giant rock. The trailhead up is clearly marked with flagging tape and a spray painted arrow.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/11697/reg_DSCN3303-3-47757.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11697/reg_IMG-6716-3-47757.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11697/reg_IMG-6718-3-47757.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11697/reg_IMG-6738-2-47757.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11697/reg_IMG-6750-3-47757.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11697/narrow_DSCN3294-47757.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11697/narrow_IMG-6715-3-47757.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mt-moriarty-near-port-alberni-bc-11697",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 4,
        "Time": "4 hrs",
        "Total Distance": "27 km",
        "Town": "Port Alberni, BC",
        "Type": "out-and-back"
    },
    "title": "Mt. Moriarty",
    "trail_id": "11697"
}