{
    "description": "Sabre Peak. FA, Sept 2014, by Lindsay Elms, Valery Wooton, Rod SzaszFly into Scimitar Lake, approx 22 Kilometres SSE of Gold River or 4 Kilometres Directly South of Splendor Mtn.  Set up camp and then walk ridge routes to the outlying string of peaks directly East of camp at Scimitar Lake. NOTE: Extremely isolated area. No cairns. No ascents until this year. Majestic beauty, but no indication that anyone had ever been to Scimitar Lake in the past. Pristine Watershed, lots of bears but they do not bother.",
    "directions": "After establishing a camp at Scimitar Lake travel to East end of lake and either ascend the dry creek bed until it emerges in Alpine or angle to the left of the point you first hit the small seasonal creek entering from this direction and gain easy alpine. Continue along obvious ridge. Best to keep to the direct ridge to the top of the highest and closest peak as a traverse to the right (North) will entail a major loss of elevation. Summit is gained after a brief rock scramble of low V Class scrambles. Exit chute to the top and climb to two rocky summits. Time from Scimitar Lake is about 2.5-3 hours. Continue along the ridge and climb the rest of the rocky outcrops and then descend to the North West side of the mountain and come back of area where snow field would be in early summer ( completely absent in 2014). Or continue along to climb second pinnacle and the descend down ramp to the snowfield. Traverse along and swing around the back of the last pinnacle and work your way past a particularly open traverse on extremely bad rock and then up to summit. From this furthest pinnacle work your way back along the ridge with some steep busy descents and then an easy exit off a ramp taking you back down to Northwest snowfield. Mostly IVth class. Getting back to camp at Scimitar Lake requires you to keep relatively high against Sabre Peak and then climbing roots and steep grass angle around the Northwestern side of Sabre Peak. Keep high if in doubt and then traverse to hit the descent route on the other side.  From here is is about 1 hour back to camp at Scimitar Lake. Note, Sabre Peak and Scimitar Lake do not appear as named on maps. They are not. These names appear as convention. Scimitar Lake being near Scimitar Peak (three ascents as of 2014) .",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/11699/reg_Copy-of-Scimitar-Outliers.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/sabre-peak-near-gold-river-bc-11699",
    "stats": {
        "Activities": "climb hike",
        "From": "",
        "Seasons": "spring summer",
        "Stars": 4,
        "Time": "35 hrs",
        "Total Distance": "10 km",
        "Town": "Gold River, BC",
        "Type": "out-and-back"
    },
    "title": "Sabre Peak",
    "trail_id": "11699"
}