{
    "description": "Edwards Rating: II (II) M LI rated it as difficult only because of the elevation gain and the distance, as there is absolutely no technical difficulty if you have a bit of experience as a scrambler. I definitely didn't enjoy it as the first challenge was to find where to park without upsetting our neighbors. There?s a sign that clearly indicates we are not welcome right in front of Johnny?s trail trailhead, where you should normally start. Then, it?s a scramble in a drainage or on a washed out trail, a canyon and a never ending scree/rubble slope. There?s also rock fall hazard and I almost got hit by a rock in the last scree slope as someone else was going down. I would recommend wearing a helmet. On the bright side, views are great as you gain more elevation than most of the peaks around.Starting in the drainage, walk for about 400-500 metres and you?ll see a sign for Johnny?s Trail on your left. Take that trail as long as you don?t gain too much elevation, it?s much faster and easier than walking up the drainage all the way. You will see another sign by the drainage later on your right, that?s where you want to go back and hike through Stoneworks Canyon Trail. Then, it?s straight up until you see a scree/rubble slope on your left at the tree line and just before the trail gets really narrow. Walk up the slope and after you reached a plateau, you?ll see the summit block that you want to take on the right side, staying closer to it to avoid the scree. On your way down, you will rather walk the ridge for a couple of hundred metres and have good scree to run down for a short distance, but still, saving you time and energy.I would recommend using my GPS track, this is my way down and it?s a good trail. I messed up on the way up and did Nipple Mountain West Ridge. It was not possible for me to walk the ridge to Charles Stewart (more of a climbing route), so I went down 600 metres elevation and took the drainage and scree slope to the peak. If you want to avoid doing the same mistake, please make sure you go back into the drainage from Johnny?s trail while you still can, before it becomes a cliff as you gain elevation.Elevation of 1424 m and max 2758 m5 -9 hours",
    "directions": "Get on Trans-Canada Highway in direction to Banff and take exit 89 toward Canmore/Town Centre. Turn left on Palliser Trail and drive 1.2 km. You?ll see a drainage on your right, park along the south side of the road.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/11695/long_Charles-Stewart-South-Peak-Canmore-All-of-Rundle-Oct-18-2014-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11695/long_Charles-Stewart-South-Peak-Canmore-Fossil-Oct-18-2014-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11695/long_Charles-Stewart-South-Peak-Canmore-Fr-Summit-Oct-18-2014-3--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11695/long_Charles-Stewart-South-Peak-Canmore-Fr-Summit-Oct-18-2014-5--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11695/long_Charles-Stewart-South-Peak-Canmore-Fr-Summit-Oct-18-2014-7--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11695/long_Charles-Stewart-South-Peak-Canmore-Never-ending-scree-Oct-18-2014-2--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11695/reg_Charles-Stewart-South-Peak-Canmore-Three-Sisters-Oct-18-2014-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11695/narrow_Charles-Stewart-South-Peak-Canmore-Stoneworks-Canyon-Oct-18-2014-3--44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mount-charles-stewart-south-peak-near-canmore-ab-11695",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 2,
        "Time": "7 hrs",
        "Total Distance": "13 km",
        "Town": "Canmore, AB",
        "Type": "out-and-back"
    },
    "title": "Mount Charles Stewart South Peak",
    "trail_id": "11695"
}