{
    "description": "Edwards Rating: I (II) M MThis is an easy hike going up Baldy Pass trail and back on the East slope of Midnight Peak. It?s more of a scramble down the West Ridge involving some bushwhacking. Views are nice with a mix of the prairies, surrounding ridges and peaks. A lot to do beyond that point for a next time like South and East Peaks of Midnight Peak.The easiest but longest way is to do Baldy Pass and once you reached it, head South (cut directly to your right on the scree trail, gaining some elevation right away for a couple of hundred metres). Then, you will take on your right and stay close to the forest, looking for cairns and making sure that you never go too far on your left. It will bring you back in the forest for a little while, but will keep you close to the East slope, going pretty much straight up. Once at the tree line, it?s an easy but steep hike on the scree slope to the summit. Take the same way down if you?re not comfortable bushwhacking. If you need a bit of challenge, scramble down the West Ridge as far as you can, until the ridge splits where you will head down on the right side of it, leading you back to Baldy pass trail with a great view of Barrier Lake. This is a nice bushwhack as the forest is carpeted with moss, saving your knees and making the descent quite easy and enjoyable. Be careful though as it can be slippery and the slope is very steep at the beginning. You may also encounter some rockbands. I avoided them by looking at my GPS map from time to time.Elevation of 944 m NET, 999 m TOT and max 2344 m4 to 7 hours",
    "directions": "From Calgary, take the Trans-Canada Highway up to exit 118, Kananaskis Trail - 40 South. Start your odometer in front of the Stoney Nakoda Casino entrance and drive 14.2 km. You will park at the Old Baldy Pass parking lot on your right and cross the highway to the trailhead.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/11702/long_Midnight-Peak-Kananaskis-Fr-East-Slope-Oct-26-2014-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11702/long_Midnight-Peak-Kananaskis-Summit-Oct-26-2014-1--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11702/long_Midnight-Peak-Kananaskis-Summit-View-Baldy-s-Oct-26-2014-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11702/long_Midnight-Peak-Kananaskis-Summit-View-West-descent-Oct-26-2014-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11702/long_Midnight-Peak-Kananaskis-Up-East-Slope-Oct-26-2014-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11702/reg_Midnight-Peak-Kananaskis-North-descent-Lined-moss-forest-Oct-26-2014-44639_best1_.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/midnight-peak-from-baldy-pass-down-west-ridge-near-kananaskis-ab-11702",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 4,
        "Time": "5 hrs",
        "Total Distance": "10 km",
        "Town": "Kananaskis, AB",
        "Type": "out-and-back"
    },
    "title": "Midnight Peak - from Baldy Pass & down West Ridge",
    "trail_id": "11702"
}