{
    "description": "Edwards Rating: II (II) M MThis is an easy scramble with no technical challenges but it involves a lot of bushwhacking and some route finding since the ridge walk is not straight up and you?ll need to lose elevation a few times or climb down and up some rockbands. The ridge is a field of rocks and boulders, really hard to scramble with a bit of snow like today as I couldn?t see all the holes and it was hazardous for my ankles and legs. It would probably be more enjoyable when it?s free of snow or with snowshoes when there?s a lot more. Views are incredible as always around here!I never found the trailhead and it seemed like everyone has the same problem by reading a few stories on some websites. I parked close to a creek bed and thought that was it because there were a lot of flags on the ground, but they didn't make a lot of sense so I have decided to just go straight up bushwhacking following a lot of animal tracks. I was the only human being there, but I was not alone? I even saw a wolf at the trailhead but fortunately, he was more scared than me and jumped into the forest. If you're not used to bushwhacking, I don?t recommend this scramble. Use my GPS track as a guide but it?s a pure bushwhack; I never found a common trail with that snow and no one else before me that day. There?s another flag along the road about 300 metres before the creek when coming from Canmore, it may be a better trail.Elevation of 933 m NET, 989 m TOT and max 2656 m5 to 8 hours",
    "directions": "From Canmore Bow River Bridge, take the Smith Dorrien Trail for 27 km and park along the road in front of the Spray Lakes day use parking.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/11701/long_Red-Rdige-Kananaskis-LOTS-of-animals-footprints-today-Seen-a-Wolfe-Oct-25-2014-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11701/long_Red-Rdige-Kananaskis-Oct-25-2014-16--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11701/long_Red-Rdige-Kananaskis-Oct-25-2014-2--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11701/long_Red-Rdige-Kananaskis-Summit-Oct-25-2014-1--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11701/long_Red-Rdige-Kananaskis-Summit-Oct-25-2014-1-001-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11701/long_Red-Rdige-Kananaskis-Summit-Oct-25-2014-3--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11701/long_Red-Rdige-Kananaskis-View-of-Sparrowhawk-Oct-25-2014-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11701/narrow_Red-Rdige-Kananaskis-Oct-25-2014-4--44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/red-ridge-near-kananaskis-ab-11701",
    "stats": {
        "Activities": "hike snowshoe",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 3,
        "Time": "6 hrs",
        "Total Distance": "10 km",
        "Town": "Kananaskis, AB",
        "Type": "out-and-back"
    },
    "title": "Red Ridge",
    "trail_id": "11701"
}