{
    "description": "Obscure, Little Summitted but beautiful peak and surrounding lands on the Nanaimo River - Nitinat River Watershed divide.",
    "directions": "Depending upon access from Timberwest take Nanaimo River Mainline past the 30 Kilometre marker. Keep along the main line. Ascend the road until you hit the pass between (high-point) of the road between Nanaimo River and Nitinat River watershed. Just shy of the top take the logging road that ascends left. Continue as long as possible. In 2014 it is possible to continue to the end of the road, but recent sloughing of the road and new growth may render it impassible in a few years. Continue off the end of the logging road and ascend direct into 1st growth timber. After 100 metres a secret playland reveals itself. Lakes and tarn and elk trails. No evidence that this area has been frequented by humans. No cairns and no campsites, just elk trails. From the higher larger lake folllow the open alpine and ascend as if to climb the ridge directly to the east of the lake. Either ascend the ridge by some easy III class and come down the other side, or traverse under this high ridge point by following a bench and a well-used elk trail. Continue until the last large lake and then ascend the centre ridge going to the summit. Two routes to the top: continue up the main ridge and pull up on tree limbs on a small exposed space, or ascend the revine to the east of this ridge until the ravine ends in a steep bush covered slope. Pull up on branches and heather over the top.  A route also exists more to the left as well that is better for descent. But all require some pull up and movement over some short steep sections. Summit is gained quickly from here. Rest on top or follow the largely flat and open ridge to the west for about 400 metres for better views before returning back. This is well off the beaten path and is enjoyable for all of those seeking some space of their own.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/11712/long_20141108-072004[1]-49764.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11712/long_20141108-081200-5_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11712/long_20141108-123425[2]-49764.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/sadie-peak-near-naniamo-bc-11712",
    "stats": {
        "Activities": "climb hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 3,
        "Time": "8 hrs",
        "Total Distance": "9 km",
        "Town": "Naniamo, BC",
        "Type": "out-and-back"
    },
    "title": "Sadie Peak",
    "trail_id": "11712"
}