{
    "description": "Highest Summit on the Nanaimo River-Nitinat Watershed nice views and superb Alpine ridge and summit. No trail Route only. Infrequently summitted.",
    "directions": "Follow Road from Lake Cowichan town on Vancouver Island to Youbou on the North Shore of Lake Cowichan. Follow unmettalled road for a further 20 kilometres to the end of the lake. Continue straight and past Kissinger Lake campsite.  Continue approximately two kilometres onwards and turn on to the next major right turning. This is partially metalled (paved), and continue along this for about a further 10 kilometres or until you see the old powder shed on your right hand side next to a larger clearning. From here cross the creek and take the first turning to the right. Ascend this road keeping along the main road. Road is good for about 3-4 kilometres. From the long flat stop the road suddenly get bushy. It is a good road, but the small alders are hard on a vehicle. If you decide to stop here at about 450 metres you will add another 45 minutes up  and about 30 minutes down to your hike.  if you value the paint on your car park here. Or, if you want a new paint job, ascend to where the road continues to about 750 metre elevation and park in a wider turn out covered with small alder. If it possible to continue frm here for a small ways, but is not really worth it. Ascend the old main logging road. Take first left then right after about 400 metres. keep right again after this and continue towards and old landing. When you see an old cat/skidder road on left ascend this as far as possible to the top of the knoll and then make for the mercy of the first growth. There is no trail, no flagging and no cairns. Follow the elk trails. Follow the obvious high ridge which drops, ascends and then drops again into a col before rising to the main summit ridge.You can climb the summit ridge on 4th class right to the summit. The last little bump may have some exposure. Those not liking this can veer to the left just below the false summit block and enter an gentle small depression curving around to the south summit. From here the main summit is about 200 metres further along a flat ridge. Nice views all around. Descend the same ridge route, or, if into some adventure follow the tree line down skirting about 200 metres to the west of the ridge you just ascended. This removes any climbing down rock. Hit the original route again near the bluffs. As of Dec 2014 there were no closed gates on this portion of the Nitinat Main. There are closed ones higher up however on the main and access to Port Alberni via this route is usually not on.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/11720/long_2014-11-08-10.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mt-hooper-nitinat-watershed-near-lake-cowichan-bc-11720",
    "stats": {
        "Activities": "ski-bc hike snowshoe climb",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 3,
        "Time": "6 hrs",
        "Total Distance": "7 km",
        "Town": "Lake Cowichan, BC",
        "Type": "out-and-back"
    },
    "title": "Mt. Hooper Nitinat Watershed",
    "trail_id": "11720"
}