{
    "description": "New for Winter of 2014 / 2015, The Valley Outdoor center is a health and fitness, not for profit initiative started using land donated by the MacCain company; a potato empire here in New Brunswick. As stated on their website (http://valleyoutdoor.ca) their goal is to promote snowshoeing and groomed cross country trails in Winter (skate and classic), and promote mtn biking, hiking and trail running for the other seasons.The facility is located at the end of a short rural road, and houses a small building for a lodge at the trailhead, and a series of circuit trails currently derrived from log roads and some small woodlot cuts that were linked together over the Summer. The terrain is relatively flat, and will be a great place for cruising on the skate skis. Future plans are to expand trails in the 800 square acres where there is more hilly terrain. The main sections are fairly open and wide routes, but rhere are plans under way to cut paths for single track / snowshoeing trails.They plan on offering ski rentals, and provide grooming for both in track and skate skiing. My biggest fears center around the local ATV community. I hope they respect his initiative, and keep away from spoiling his efforts.It is fantastic to see such places as this spring up in rural communities like Centerville. I hope that with publicity such as this, people will come, enjoy and spread the word to make it a popular destination between woodstock and Perth-Andover regions and into Maine.Shannon BurtPEIShannon Burt",
    "directions": "Off of hwy 110, West of HWY 2 junction.  Drive a few minutes until you see the sign to Upton Road on your left. Drive  a couple of Km's down until the pavement ends. Keep going, until you see the little lodge and parking lot on your left. Signage should be added soon!",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NB/11731/reg_IMG-1894-copy-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/11731/reg_IMG-1895-copy-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/11731/reg_IMG-1896-copy-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/11731/reg_IMG-1898-copy-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/11731/reg_IMG-1899-copy-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/11731/narrow_IMG-1893-copy-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/11731/narrow_IMG-1900-copy-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/11731/narrow_IMG-1901-copy-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/11731/narrow_IMG-1902-copy-6702.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/the-valley-outdoor-center-near-centreville-nb-11731",
    "stats": {
        "Activities": "mtn-bike ski-xc ski-bc hike snowshoe",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "6 km",
        "Town": "Centreville, NB",
        "Type": "out-and-back"
    },
    "title": "The Valley Outdoor Center",
    "trail_id": "11731"
}