{
    "description": "Mt Rugged is one of the Alpine Club of Canada (VI Section)'s  qualifies, also knows as an IQ9. The route varies widely on snow conditions, and therefore time of year. The route up to Nathan's Col includes a small section of bushwhacking, steep terrain and in general a long slog.I wrote this up for two days but it would be much more enjoyable as three.  To read my full route description read my trip report on my blog: http://nolofacereinsipida.blogspot.com/2014/09/the-hike-through-hell-to-get-to-heaven.html",
    "directions": "Drive about 20 km past the Woss turnoff , before turning left  (west) onto the Zebellos  Mainline. (I have to apologize about the road names, after examining several sources, there seems to be some discrepancy about the road name; Some call it Atluk Rd and others Pinder Main. If you check my GPS route you will easily see where we drove.) Regardless, we drove about 30 minutes/ 30 kilometres to the Nomash Mainline turnoff, left at the |Zebellos sign and across a bridge that crosses Nomash River.While driving down the Zebellos Mainline we could see Zebellos Peak on our left, obscuring our view of the Haihte Range. Shortly after making the turn onto Nomash Main,we crossed the bridge over the Nomash River and   we were greeted with our first view of our destination. First the South Blades then Rugged and eventually Merlon and eventually the whole range. We stopped to admire the range but quickly ventured down the good quality logging road to our destination. Ultimately we stopped at the old N20 Spur and piled out of the vehicle.",
    "geohash": "c0v",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/11730/reg_Haihte-Range-Rugged-Screen-0497-45810.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11730/reg_Haihte-Range-Rugged-Screen-0506-45810.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11730/reg_Haihte-Range-Rugged-Screen-0509-45810.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11730/reg_Haihte-Range-Rugged-Screen-0655-45810.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11730/narrow_Haihte-Range-Rugged-Screen-0476-45810.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11730/narrow_Haihte-Range-Rugged-Screen-0664-45810.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mt-rugged-haihte-range-near-zeballos-bc-11730",
    "stats": {
        "Activities": "hike climb",
        "From": "",
        "Seasons": "summer",
        "Stars": 5,
        "Time": "14 hrs",
        "Total Distance": "19 km",
        "Town": "Zeballos, BC",
        "Type": "out-and-back"
    },
    "title": "Mt. Rugged, Haihte Range",
    "trail_id": "11730"
}