{
    "description": "This is an 11km return hike to some amazing bluff that is wrongly titled Little Bluffs on the topographical maps?.the bluffs are amazing and well worth the journey to get to them?and BTW they are not ?little?.   The first part of the hike is a 3km journey on the old rail to trails.  It is well maintained with  just a few large puddles to go around.   You will cross three bridges all located within 100m and then you will finally turn into the forest and begin your ascension to the little Bluff.  The ATV trails starts at ; 44.595335°, -64.782418° and you should be at the bluffs in about 2km or so.  The trail ascends into some mixed forest with some large white pines.  There are large sections of exposed granites that look a little bit like the whopper dropper in Hfx.  My GPs was reading that I was veering off the path to the top of the Little Bluff but it turned out that the bluffs or cliffs are located south of the highest point of the land.  Just keep following the ATV path until it branches into a Y intersection.  The right hand side leads you to the top while the left hand side leads you to the bottom of the bluffs.As I mentioned before the bluffs are amazingly fun to explore.  At the top you get a great 180 degree view of the south while exploring into the bluffs is an infinite number of small caves everywhere.  Large sections ?.really large sections have flaked off over the years and either just separated from the cliff face or have tumbled off to the bottom.  There are some large sections with cracks just perfect for sport climbs and there were some signs that this place is frequented by some climbers.",
    "directions": "Highway 10 North through New Germany and park at 44.616930°, -64.803706°.  The rail to trail is right off the Highway and head south on it for about 3km",
    "geohash": "dxcv",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/11738/reg_DSC-0412-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11738/reg_DSC-0427-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11738/reg_DSC-0428-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11738/narrow_DSC-0373-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11738/narrow_DSC-0377-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11738/narrow_DSC-0389-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11738/narrow_DSC-0399-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11738/narrow_DSC-0405-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11738/narrow_DSC-0430-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11738/narrow_DSC-0433-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/little-bluff-near-bridgewater-ns-11738",
    "stats": {
        "Activities": "climb snowshoe hike mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 5,
        "Time": "4 hrs",
        "Total Distance": "11 km",
        "Town": "Bridgewater, NS",
        "Type": "out-and-back"
    },
    "title": "Little Bluff",
    "trail_id": "11738"
}