{
    "description": "The summit of Limestone Mountain is on the east end of a long narrow ridge. The flagged route mostly travels along the southwest face of the mountain. In general the route is easy to follow but good route finding skill is an asset.The hiking is simple with only a couple of sections that require the use of hands, there is limited exposure at one small section of the hike. It may be possible to follow a different route and have no exposure and no scrambling but we didn't explore any further.Read a full report on my Blog: http://nolofacereinsipida.blogspot.com/2014/12/Limestone.html",
    "directions": "To access Limestone Mountain we drove through Port Alberni, heading southwest on the Bamfield Road (AKA Franklin River Road).  Around the 15 kilometer mark, turned left(east) following the Thistle Mine Road (marked TMR) up the Franklin River Valley . This toad may be familiar to those readers who have visited Father and Son Lake, it's the same road, however at the final turnoff to the lake the route turns right (west).For full disclosure, I took my 2001 Subaru Outback. The Thistle Mine Road is in good condition but once we turned right at the Father and Son Lake turnoff, starting our ascent up the mountain side, the road deteriorates and there are many water-bars that must be crossed. We climbed to 1038 m before I was forced to stop at a much larger water-bar.   Regardless, this put us in great position to start the days hike!",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/11737/reg_LimestoneMountain-Screen-2297-45810.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11737/narrow_LimestoneMountain-Screen-2290-45810_best1_.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/limestone-mountain-near-port-alberni-bc-11737",
    "stats": {
        "Activities": "snowshoe hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "5 hrs",
        "Total Distance": "8 km",
        "Town": "Port Alberni, BC",
        "Type": "out-and-back"
    },
    "title": "Limestone Mountain",
    "trail_id": "11737"
}