{
    "description": "Tom Snow trail is a 30 km long multi-user trail, named after Chief Tom Snow of the Wesley Band of the Stoney Nakoda First Nation in the 1950's.  From the Station Flats trailhead going north, the trail offers endless peaceful well treed snowshoeing, but not much in the way of views.  It is very well signed, making for easy route-finding.  There are a couple of bridges, some decent but not difficult climbs, twists and turns to keep it interesting, and lots of side routes should one choose.  This is primarily a mountain biking area in the summer, and the trails are maintained by the cmba - Calgary Mountinan Bike Alliance.From the trailhead at Station Flats, just follow the signs and generally go to the right.  Each junction has a sign.  Go as far as you like, but remember you have to get back!  On this day, I went 6.1 km in, making a 12.2 km out and back.",
    "directions": "From Calgary head west on Highway 22x `Cowboy Trail`which turns into Highway 66 once entering Kanakaskis Country.  Continue 5.6 km after the Information Center, there is a sign indicating Station Flats.",
    "geohash": "c3n3",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/11740/reg_20150106-124701-46684.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11740/reg_20150106-134455-46684.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11740/narrow_20150106-122952-46684.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11740/narrow_20150106-1325321-46684.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11740/narrow_20150106-143123-46684.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/tom-snow-south-near-calgary-ab-11740",
    "stats": {
        "Activities": "snowshoe",
        "From": "",
        "Seasons": "winter",
        "Stars": 4,
        "Time": "5 hrs",
        "Total Distance": "12 km",
        "Town": "Calgary, AB",
        "Type": "out-and-back"
    },
    "title": "Tom Snow - South",
    "trail_id": "11740"
}