{
    "description": "This is hiking and exploring at its best.  The hike will take you along the shoreline and over bluffs, into barrens and over some amazing granite boulders to an end point called Crow?s Nest which is an amazing cliff overlooking Terence Bay and a locally known climbing wall.Setting off from the gravel path, I bushwacked my way to the shoreline and made my way slowly along the shore in a westerly manner.  There is one small brook to cross early on and it?s the brook emptying Bar Harbour Lake.  I picked up a small trail near the brook and followed it for a while until I got to the bluff overlooking Upper Bar Harbour.  At the back of the Harbour lies a 60ft plus wall dropping right into the water.  I made my way up to it and then after following again a very fain trail of some sort made my way back to the shoreline near Upper cheaters Head.  Upper cheaters Head is a nice looking wall with some cracks and this one does not drop all the way to the shore as it has a broad ledge before the ocean.  After a lot of cursing I made it all the way to the Crow?s Nest.  The terrain in some part is fairly easy to navigate but the brush is thigh high and sometimes even thicker in the forest.  Unless you find the faint trails, you will have to be very patient on this part all the way to the Crow?s Nest (N44 28.416 W63 42.345).The Crow?s Nest is a long cliff overlooking Terence Bay.  It has been climbed before but overall it ranges on the difficult side.  After spending some times at the look off, I made my way back to my car but this time looking for a trail at all times to get me back faster.  Overall I was able to follow a trail for about 80% of the journey and cut off about 45minutes of the journey.  It took me about 2hours to get to the Crow?s Nest but only about 1:15 to get back.",
    "directions": "In Sambro, drive towards West Pennant on highway 349 and then unto Shaw Cove Rd and park where it becomes an ATV trail approximately at N44 28.115 W63 40.116.",
    "geohash": "dxf",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/11748/long_Panoramasamll.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11748/reg_DSC-0499-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11748/reg_DSC-0527-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11748/reg_DSC-0534-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11748/reg_DSC-0540-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11748/reg_DSC-0562-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/crows-nest-near-halifax-ns-11748",
    "stats": {
        "Activities": "climb snowshoe hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 5,
        "Time": "4 hrs",
        "Total Distance": "10 km",
        "Town": "Halifax, NS",
        "Type": "out-and-back"
    },
    "title": "Crow's Nest",
    "trail_id": "11748"
}