{
    "description": "From the park entrance at Alma continue north-west on highway 114. Climb the big long hill and pass the Chignecto Campground. At 5.2 km you should see a small parking lot on your right. The Kinnie Brook Trail starts just inside this parking lot straight ahead.From the northern park entrance at Wolfe Lake continue south-east on highway 114. Continue past Bennett Lake and the Laverty Auto Trail. At 14.8 km you should see a small parking lot on your left. The Kinnie Brook Trail starts just inside this parking lot straight ahead.The Kinnie Brook Trail can also be accessed from the north-west corner of the Chignecto Campground.",
    "directions": "The Kinnie Brook Trail is a short but surprisingely interesting trail. At 750 meters the trail branches off to the right to access the Chignecto Campground. Continue left for another 350 meters and the trail starts to get interesting. The first small set of stairs takes you down to a boardwalk through a small valley that has rock slides along the sides and is full of Rhododenron. Another small set of stairs at the end of the small boardwalk takes you up and out of this unique little valley.Shortly after the stairs you will come to the larger set of stairs that take you into the much deeper valley that holds Kinnie Brook. As you start down the long set of stairs you will notice the large rock spire on your right. Continue down the stairs and you will come to a small platform at the valley bottom. The platform has many interpretive signs described below. They outline the geology of the area and a bit about how Kinnie Brook is a dry stream that runs underground for part of the year. Step off the platform and you can explore the streambed that is full of bare rock and gravel. We are planning to return some time when the water is flowing above ground to see the comparison. This trail shows some of the very interesting geology that Fundy National Park has to offer.The trail is quite flat for the first kilometer with a few small ups and downs. The long set of stairs is the only difficult part of this trail.",
    "photos": [],
    "source_url": "https://trailpeak.com/trails/kinnie-brook-trail-near-alma-nb-11745",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "1 km",
        "Town": "Alma, NB",
        "Type": "out-and-back"
    },
    "title": "Kinnie Brook Trail",
    "trail_id": "11745"
}