{
    "description": "It's wednesday, back home in PEI, and I just got back from Newfoundland, doing the Long Range Traverse in Gros Morne National Park.  I'm settling in again, but itchy for another adventure for trailpeak (I am the East Coast Editor for trailpeak). One a bit more laid back... \r\n\r\nI put in a call to Ardelle Haynes, the general manager from Outside Expeditions. (www.getoutside.com) I've been talking with her on a few occasions trying to make a date to tag along on a guided sea kayaking tour, and to get a taste of just what the coastal waters there have to offer. Word of mouth is the best form of advertisement, so I was scheduled to join a tour that afternoon. My guide would be Victor Nelson, and the trip would be a three hour coastal paddle and snack break along the beautiful red rocky coast of North Rustico's region of PEI's National Park. It's a sunny, breezy day, so I'm excited.\r\n\r\nI asked Ardelle what was unique about Outside Expeditions' location out in North Rustico.  She reasoned that the site is special because it's situated right in the heart of a working fishing port, with lobster and deep-sea fishermen going out each day. Geographically, it's situated at the end of a long spit that curves out over Rustico Bay, and the community is bursting with a wealth of Arcadian and Scottish history and culture. In terms of paddling opportunities, their kayak tours explore Rustico bay, Cymbria Bay, the Clyde River, Cape Tryon cliffs and Robinson's Island. No matter what the weather conditions, there are always options for paddling. On their web site, you can see the variety of tours they have to offer. The views outside the door are incredible, and the feel of the location is unique because it's far enough away from touristy spots like Cavindish to seem like a totally different world.\r\n\r\nVictor is a crazy-haired enthusiastic kayak guide who hails from Nova Scotia. It's important to note that Outside Expeditions' guides are all certified and competent people. This is his second season working for Outside Expeditions. Along on this tour are four other paddlers. A father and his 8-year-old daughter from Scotland, and a couple from Ottawa. All have previous kayaking experience, and some being repeat visitors.\r\n\r\nThe weather conditions give a lot of inland winds at our launch point. Experience with the  weather patterns and the location tells our guide that things would be getting calmer as the afternoon progresses, and as we get out into the open water. Never the less, the two pairs are issued very sturdy tandem kayaks. The guide and myself are in solo crafts.\r\n\r\nAt shore, Victor has everyone in their spray skirts and PFDs. He goes over how the rudder systems work for the kayaks, and has us try them out on land. Time is spent on paddle technique and on the safety gear on board before we head out. \r\n\r\nOur launch point intersects a very busy fishing boat channel, so taking cues from our guide is crucial to avoid any mishaps. The guides employ a very safe and efficient strategy for getting us through the harbor channel and into open water.\r\n\r\nOur destination this afternoon is to paddle up the coast edging the national park near Doyle's cove.  Along the way, our guide entertains us with stories of local lore and touches on the history of the province and its rich past. We see herons and cormorants as well as Arctic terns and seagulls. A while later, we reach Doyle's Cove, and beach at a spot of sandstone with eroding red cliffs bordering the shore. There, a nice snack is served to us hungry paddlers. Our guide tells us that we've been enjoying a tail wind, and that getting home is going to be a harder task. So he encourages us to eat up. The iced tea contrasts well against the saltwater in the air. \r\n\r\nDuring the break we have a chance to ask questions, and to get to know a bit more about our fellow paddlers. We explore the rock formations and walk along the shore. Our guide is eager to hear our own explanations as to the red color of the rocks and soil. This gives ear to wonderful creativity among the group.\r\n\r\nTime is pressing, so before too long, we pack up and shove off, en route for home. The groups are given a bit more independence on the return, though Victor spends time with all the kayakers. Prior to rounding a point along the coast, he has us take a break. The headwinds beyond the point are going to require steady effort, so he informs us of this as well as his plan for our landing location. All are definitely up for the task, and no one is concern for the conditions. The tandems are so stable and despite the gusty winds, the waves aren't too bad. The point of concern is  heading back through the narrow harbor channel from where we came. There, the waves would be choppy, and the boat traffic on top of that would make for an unsafe approach. With that in mind, Victor has us land at an adjacent beach within walking distance of the parking lot. It's nice knowing that the guide has considered all possibilities well before hand to keep the group safe and happy.\r\n\r\nEveryone is pleased with afternoon tour. It was a great taste of the island's landscape plus a great sampling of island history. Victor has done a top-notch job guiding us and keeping us safe in conditions where, with poorer judgment, could have made for a dicy situation on our return.\r\n\r\nThanks goes out to Ardelle who allowed me to join in on one of their kayak adventures, and thanks too to Victor who was a great guide. \r\n\r",
    "directions": "North Rustico is 40 minutes outside of Charlottetown. Take Route 2 west and turn to route 223 out to Oyster Bed Bridge, and then onto Route 6 to Rusticoville. Turn right to North Rustico. The outfitter is at the end of the road. Any further, you'll be wet!",
    "geohash": "f86br",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/PE/1174/long_redcliffsjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/1174/reg_Promoshotjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/1174/reg_guidejpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/1174/reg_openwatergroupjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/1174/reg_snacksjpg.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/north-rustico-with-outside-expeditions-near-charlottetown-pe-1174",
    "stats": {
        "Activities": "sea-kayak",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "5 km",
        "Town": "Charlottetown, PE",
        "Type": "out-and-back"
    },
    "title": "North Rustico - with Outside Expeditions",
    "trail_id": "1174"
}