{
    "description": "This Hike starts at the Butcher-Jones Recreation Site on Saguaro Lake. The trail is easy, with moderate elevation gains. It winds along the north side of the lake. I don't know how far it actually goes, we went about 4 km to a viewpoint looking SE before turning back.The views of the lake and surrounding mountains are stunning. The lake is a popular recreation area, with many people launching boats at the Recreation Site and fishing. As with all hikes in the desert, don't touch the cacti and come prepared with plenty of water and appropriate gear.Hikers can enjoy lunch and a beer on the shaded patio at the Marina afterwards. There are also sunset boat tours of the lake.For kayak rentals, SUP, and guided hiking options in the area check out Arizona Outback Adventures.",
    "directions": "From Apache Junction, take either the Bush Highway or Usery Pass Road to North Bush Highway. Continue past the turn off for the Marina and the boat launch. Turn right onto Butcher Jones Beach Road and Park at the Recreation Site. You will need to purchase a park pass in advance and display it in your vehicle to avoid a ticket. There are outhouses at the parking lot, but they are not well maintained.",
    "geohash": "9tb",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/AZ/11763/reg_IMG-7082-2-47757.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/11763/reg_IMG-7124-2-47757.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/11763/reg_IMG-7217-2-47757.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/11763/narrow_IMG-7086-2-47757.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/butcher-jones-near-apache-junction-az-11763",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "8 km",
        "Town": "Apache Junction, AZ",
        "Type": "out-and-back"
    },
    "title": "Butcher Jones",
    "trail_id": "11763"
}