{
    "description": "I chose to take this trail counter-clockwise as it has a much steeper incline going up than the clockwise option; a good way to get warm quick. The first quarter of the way is fairly steep (NE) and then it levels out to a straight route (NW) continuing to just before the midway point and then there is a fairly steep hill to the midway route marker, a great place to rest and snack. The terrain on the way up is a mix of dense forest, glimpses of the valley below and amazing views of the mountain range to your left.At the midway marker it's a hairpin bend to take the route down or take a west route along a secondary trail. Going down meanders first of all above the river and then down next to it, over it and then through the valley bottom. The snow is very deep and below all those lumps bumps and mounds I suspect is the debris from the 2013 flood. There are plenty of torn up trees and stumps to attest to it.Going up I was in plenty of sunshine, coming down lots more shade, therefore a bit cooler. My GPS logged that I walked for 1.5hrs and rested for 1.5hrs. As you can see, I?m in no particular hurry and I stop frequently to look around. Also I?m practicing my navigation skills with map and compass. This a great place to do so because of the mountain peaks to triangulate with.The trail has deep deep snow; it's packed and well-traveled with easy to spot markers. At the offset, I immediately went in the wrong direction! The trailhead is marked for clockwise but not counter clockwise so I followed the packed path leading to the right, this took me SW and off track; you will see this on my gps track.",
    "directions": "Sawmill is well sign posted off the Smith-Dorrien Trail, Peter Lougheed Provincial Park, Alberta. The trailhead is to the left of the washrooms facing North. As I mentioned above, I traveled to the right and took the trail counter-clockwise.http://www.albertaparks.ca/media/3816330/peter_lougheed_pp_-_chester_sawmill_snowshoe_trails_map.pdf",
    "geohash": "c3n0",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/11772/reg_1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11772/reg_4.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11772/reg_6_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11772/reg_8.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11772/narrow_2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11772/narrow_3.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11772/narrow_7.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/sawmill-loop-near-canmore-ab-11772",
    "stats": {
        "Activities": "snowshoe",
        "From": "",
        "Seasons": "winter",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "5 km",
        "Town": "Canmore, AB",
        "Type": "out-and-back"
    },
    "title": "Sawmill Loop",
    "trail_id": "11772"
}