{
    "description": "This is one of the \"dinner hut\" classic runs in winter -- i.e. ski in 4 to 5km, reach a heated hut, in this case Herridge, and, warm up in the well maintained old cabin / hut.  Herridge has a long history, you can guess at it from the large rough hewn timber the cabin was made from over 100 years ago.You start skiing out of P16 along trail #50 and this pretty much takes you there, with a few turns (mostly to the right) as you approach and climb the final leg to Herridge.  Not to worry, there are sign posts at the key intersections, or follow the attached GPS.  If you've been once, you're fine.  I had forgotten how large the first hill is from P16, you climb initially for 20 to 30 minutes depending on your speed -- then settle into rolling terrain.As mentioned, a few hairpin climbs (you know you are on the right route when you climb a hairpin bearing right and upwards with about a kilometer to go), and you'll enjoy the mostly descending terrain on the way down.  Click Expand+ on the right above the GPS map and you can animate the route, noting the hairpin intersection before the final climb up to the shelters.  Healey cabin is nearby as well.",
    "directions": "P16 is along Highway 5 heading to Old Chelsea, from Ottawa there are several ways to cross the river and get on 5 heading north (the same route used to get to the Lac Lemay Casino).  Follow past Old Chelsea, just keep going.  But, it's best to take exit 21, then follow along HWY 105 a kilometer or so until you see Chemin Pine on the left.  It's hard to see at night, so keep your eyes peeled on the left.  If you get to Wakefield you've gone (way) too far. On Chemin Pine, go up this road which is residential at first but then passes under HWY 5, and, you will then reach a triple fork in the road, with a sign (take the middle one) to P16 NCC parking lot just a small distance further.",
    "geohash": "f2",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/QC/11776/reg_herridge1-5.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/p16-to-herridge-near-gatineau-pq-11776",
    "stats": {
        "Activities": "ski-xc",
        "From": "",
        "Seasons": "winter",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "10 km",
        "Town": "Gatineau, PQ",
        "Type": "out-and-back"
    },
    "title": "P16 to Herridge",
    "trail_id": "11776"
}