{
    "description": "Arrowhead provincial park provides a very complete XC ski network for all levels, in a Muskoka setting.  At 53 km of groomed classic and skate trails, this ski network doesn't take a back-seat to the best in eastern Canada.  In fact, the folks in the Gatineau park could learn something about grooming here. Having hosted the Canadian masters XC ski championships, Arrowhead sets great track -- the kind that avid skiers and racers look for.I visited on the coldest day (Feb 23) in 80 years, no matter, dressing warmly, I first skied the lake loop, which is a must do if skiing this network.  It rolls through the campground area first (you can't tell other than the upturned picnic tables) and the terrain has great variety.  You get to a lookout and a few steeper sections, nothing an intermediate skier can't handle.  At just over 5km for the lake route, you get some open views of the lake, and, a great all round ski with gentle ascents and descents.  See the GPS map of my ski track, it show Roe (skate loop) followed by the lake loop.Following the lake loop, I met some skiers in the warming hut who recommended the Hardwood Hill Loop trail, you reach this from the park office / entrance parking area, and although it's only a 3km loop -- it has short steeper climbs followed by longer descents, you'll ski this loop very quickly.  One phenomenal view from up top (look for the best pic in this set with highest elevation and view -- that's Hardwood loop -- it's not on the attached GPS map).  A longer outer loop was closed (Beaver - bridge out), but if you ski the two circuits described here (+ I also skied the 2.5km skate loop to start, with 1 classic groomed track), you will have about 3 hours of the best skiing on your hands (mits).  Once again, great grooming, a first rate ski zone.  Park office has rentals, LF wax, and it's about $16 a day to ski here.  The other parking area (near the 1.5km ice skating track) is the preferred parking spot to begin the lake loop, and there is a warming hut there.What some may not know is that Huntsville area has even more to offer, with the West Gate (Fen lake) 20 km ski network in nearby Algonquin park, and the on-resort XC ski trails at Deerhurst resort, our winter basecamp on this ski trip.  From Deerhurst you can easily cut up Hwy #3 to get to Arrowhead (7km), then, for another day, drive east along Hwy #60 some 30 minutes to get to Algonquin park and the Fen lake ski network for more groomed trails in a wilderness setting.",
    "directions": "Just north of Huntsville Ontarion",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/ON/11779/reg_arrowhead-XC-map-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/11779/reg_arrowhead-lake-loop-start-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/11779/reg_arrowhead-lake-loop1-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/11779/reg_arrowhead-warmup-lake-P-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/11779/reg_arrowhead-xcski-1-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/11779/reg_hardwood-lookout-5_best1_.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/arrowhead-xc-skiing-near-huntsville-on-11779",
    "stats": {
        "Activities": "ski-xc",
        "From": "",
        "Seasons": "winter",
        "Stars": 4,
        "Time": "5 hrs",
        "Total Distance": "53 km",
        "Town": "Huntsville, ON",
        "Type": "out-and-back"
    },
    "title": "Arrowhead XC skiing",
    "trail_id": "11779"
}