{
    "description": "The NCC maintains an official snowshoe trail system, one of which starts at P2 (Relais de Plein Air) for trails 64, 65, and 66.  These are marked and defined snowshoe trails.If you look at the offocial map here, you will see these trails travel up in the hills quite close to P1 (Asticou centre).And isn't the whole point of snowshoeing the ability to explore and wander without a trail.  My mission for the evening (after conning a friend into it), start at P1 asticou where I often start my XC skiing, and, venture straight up the steep hills to re-connect with trails 65, 66.  I had my GPS with me (see right), and, so off we went.  Following the XC ski access trail to where it merges with the parkway (the main groomed trails), you will see a wall of rock and snow opposite.  Wonderful.  A quick turn left, and, within 100 feet / metres, you'll likely see someone's (maybe ours) snowshoe trails going up, pretty much straight up.  As you climb rather steeply, be cautious of rock / stick jutting out in places.  Lots of holds, you quickly reach a false summit, and now you are in this elevated plateau of small peaks and valleys, a ton of fun for finding your next peak and a great view in the night back on the city.As we found a myriad of snowshoe trails, it's really up to you which ones to follow -- who knows if we ever connected with the official trail, it's clear many have had this idea.  A great workout, you dip, rise, climb, descend.  Speaking of descending, you can easily find yourself looking down over a cliff.  Be careful, and, if required, back-track until you re-connect with a gentler descent back to the parkway.  Retrace now along the parkway to your start.  Great 2 hour outing, great workout.",
    "directions": "P1 Asticou centre, Gatineau Park -- park at the area closest to the trails and trails kiosk where on weekends, an attendant collects your money for a trail pass.  In the evenings, no one is there, enjoy!",
    "geohash": "f244e",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/QC/11787/reg_asticou-2-peak-5_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/11787/reg_asticou-snowshoe-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/11787/reg_parking-asticou-5.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/asticou-snowshoe-near-gatineau-pq-11787",
    "stats": {
        "Activities": "snowshoe",
        "From": "",
        "Seasons": "winter",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "10 km",
        "Town": "Gatineau, PQ",
        "Type": "out-and-back"
    },
    "title": "Asticou - Snowshoe",
    "trail_id": "11787"
}