{
    "description": "The Fen Lake Ski Trail is located at the West Gate (km 0.0) of Algonquin Park. Much of this trail travels through the hardwood forest typical of Algonquin's west side, with lots of Pine / Conifer. It offers four loops from 1 to 18 kilometres and offers both easy and more challenging sections. All trails are groomed and trackset. A shelter and toilets are located at the beginning of the trail and at Fen Lake -- halfway around the main outer loop.I really enjoyed these ski trails.  First, your starting point is the staffed park office at the west gate.  Get a map here, wax your skis, warm up (the parking lot is windy!).  You are at a bit of a high point, and you start your ski right out of the west gate parking lot.  Either take the extended 3 km warmup section to the right, or take the more advanced middle route down and connect up with the main lake loop much faster (1.5km vs 3 km), I chose the easy rolling and very scenic 3 km addition to start.  I recommend this route to start.I didn't have time to complete the whole loop returning on the ridge. I only had a few hours, so I  did an out and back of sorts, reaching the cabin (it's new!) and getting a fire going in the wood stove for any others that followed. I changed shirts, had a snack, then, and returned until I reached the shorter 1.5km shortcut back to the parking lot, and enjoyed the rolling / turning terrain of that trail.  I will return and complete this entire network of trails, it's groomed but make no mistake, this is wilderness! There is a first aid tub at main trail intersections, and there are maps posted at key intersections.  It's anywhere from 3 to 4 hours to complete the large loop.  I think this was my favourite of the three ski networks I sampled while staying at Deerhurst in Huntsville.  Why stay at Deerhurst, well, the winter rates are very good (summer is out of range in my opinion), and, they have a hot tub whirpool, which after two record breaking cold days, was just what I needed!",
    "directions": "You can reach the Fen ski network from the east (Ottawa) or the west (Huntsville / Barrie) and it's at the west gate.  Staying at Deerhurst resort, on the way from Huntsville to Algonquin along Hwy 60, it's just a short 30 minute drive east.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/ON/11780/reg_fen-lake-cabin-5_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/11780/reg_fen-loop-1-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/11780/reg_fen-loop-2-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/11780/reg_fen-loop-3-XC-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/11780/reg_fen-map-at-cabin-5.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/fen-lake-xc-ski-network-near-huntsville-on-11780",
    "stats": {
        "Activities": "ski-xc",
        "From": "",
        "Seasons": "winter",
        "Stars": 3,
        "Time": "3 hrs",
        "Total Distance": "22 km",
        "Town": "Huntsville, ON",
        "Type": "out-and-back"
    },
    "title": "Fen Lake XC ski network",
    "trail_id": "11780"
}