{
    "description": "Deerhurst resort, on the east side of Huntsville, is a famous Ontario resort that once hosted a G8 summit.  In winter time, the rates are very good and set you up for a great winter \"base camp\" when exploring two stellar XC ski networks nearby.Deerhurst may be a 4 star resort with a relaxation and entertainment theme, but it's no slouch when it comes to outdoor activity.  It has it's own on-property ski and snowshoe trails, and, rentals are free when staying over.  It didn't take long to leisurely ski all of their trails, they wind along the golf course near the lake for some nice views.  They get top marks for having groomed track set trails, perfect for families or those starting out.  Would the family love to stay here while you race the Arrowhead ski trails just 7 km north, you bet!  Arrowhead is a first rate XC ski destination with rolling hills and some of the finest track set groomed trails for classic and skate skiing you'll find anywhere.  They've hosted the Canadian masters, and, even on one of the coldest days of the year, the trails were perfectly groomed.  I skied the Deerhurst trails in the morning, then did about 2 hours of skiing at Arrowhead in the afternoon, it's just 7km away on #3 Rd. heading out of Huntsville from the Tim Hortons off Hwy #60.The next day, I drove 30 minutes east to ski Algonquin parks Fen lake ski trails at the west gate.  Again, a very nice ski in a wilderness setting with good grooming.  After each ski day, it was back to Deerhurst resort in Huntsville (east) to defrost and enjoy the hot tub and pool.  There are other accommodation options in Huntsville, but if you've never sampled Deerhust resort, winter is a great time to stay at close to half-price and make a ski trip out of it!",
    "directions": "Deerhurst resort is off Hwy #60 just east of Huntsville Ontario.  The ski trails are below the golf pro shop (exit from the pro shop on cold days), walk down the path, and find the beginner ski loop (which I liked more than the intermediate loop) next to the outdoor rink and ski /snowshoe rental office and shack (driving range in summer).",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/ON/11784/reg_deer-intermediate1-5_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/11784/reg_deer-intermediate2-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/11784/reg_deer-intermediate3-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/11784/reg_deerhurst-resort-5.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/deerhurst-xc-ski-trails-near-huntsville-on-11784",
    "stats": {
        "Activities": "ski-xc",
        "From": "",
        "Seasons": "winter",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "3 km",
        "Town": "Huntsville, ON",
        "Type": "out-and-back"
    },
    "title": "Deerhurst XC ski trails",
    "trail_id": "11784"
}