{
    "description": "The trail is located at the base of Cypress Mountain you will take the trail called Baden powell. It is an average hike it will go straight up and curve and bend and there will be alot of dead trees but that is only for the first 30 minutes. This hike is incredible it takes you on an incredible journey where you will see the water falls the mountain side and lots of wildlife. The mountain will wind and bend and the trail is clear of any flooding or washouts. We went July 30 2004 and the weather was perfect. There are lots of people on the trail as it is quite popular. Once you come up into the mountian side there are several clearings where you will be able to have a birds eye view of Vancouver. Once you get to the top keep in mind some places are steep but this hike is great for people and dogs of all ages. The view on top of Mt. Hollyburn is spectacular you will get a 360 degree view of Vancouver, Vancouver Island and a 3D effect of the mountains I can not even begin to describe how wonderful a place this is. 7th heaven would be the way to describe the lush trees the waterfalls the blooming flowers. The aroma of fresh pine and the sun shining brightly all around. This hike is a great break from the city and is a great way to experience the outdoors with out to much effort. Pack lots of water as there is no place to get any. Pack a lunch and some extra's for the Whiskey Jacks if you are lucky like us you will get them landing on you. We took our dogs and they had a blast it is safe and wear lots of sun tan lotion as part of the trip you are with out shade or trees. Don't forget the bug off. Take a camera because you won't want to miss a minute of the scenery you will want to take it with you.",
    "directions": "The Base Of Cypress Mountain in Westvancouver. Take the Baden Powell trail and follow the signs you will reach the top in about 2 hours.",
    "geohash": "c2b",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/1178/long_Hollyburn-Peak-2-13724.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1178/reg_-MG-5629scm-sm-13724.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1178/narrow_WHISKEY-JACKS-1287.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mount-hollyburn-near-vancouver-bc-1178",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 5,
        "Time": "3 hrs",
        "Total Distance": "0 km",
        "Town": "Vancouver, BC",
        "Type": "out-and-back"
    },
    "title": "Mount Hollyburn",
    "trail_id": "1178"
}