{
    "description": "This hike starts at the summit of the Sea to Sky gondola, next to Shannon Falls. 2 ways up: 1) the free, hard way, up the Sea to Summit trail, from the foot of the gondola or from Shannon Falls, or Stawamus Chief Prov Park. This is up 1000 m total ascent, 9 kms and 3 hours  (see http://www.trailpeak.com/index.jsp?con=trail&val=11459, or 2) the easy, fast but more expensive way, $35 (for adults) 10 minute gondola ride (save a few $$ if you buy online in advance). Note it is $10 for ride down only.Top of the gondola is at 890 m el. Head east from the upper gondola deck, approx 800 m on road, follow the signs and take the trail on the left. Quite easy for first 1.5 kms or so, with some great views. After the open ridge, walk through a flat swampy area (frozen and hard packed on March 7, 2015). At the \"Neverland Falls loop\" sign, turn right uphill. This is where the real fun starts, ie, rocky, rooty, muddy, slippery, steep sections, with several ropes and chains to help you up or down.My wife and I quit at an open ridge with great views of Mt Garibaldi, 1365 m el (she had enough). Summit is as 1600 m. The rest of our group continued uphill and gave the following account later: \"On Habrich , the cliffs got a bit steeper and more difficult after we left you.  We got to the point where the ridge slope eased off to about 30 degrees and we stopped there.  Fantastic spot for lunch.  On the way back, we did the Neverland Trail loop, but could not find the lake and water falls.\"Actually, my wife and I saw the falls from a distance on the way back, frozen.",
    "directions": "Drive Hway 99 (Sea to Sky) north from Vancouver, approx 45-60 minutes to the foot of the gondola, just north of Shannon Falls, but before the Chief, and Squamish. Parking for up to 2 hours at the foot of the gondola (2 hours apparently enforced only on weekends and holidays during the summer), or at Shannon Falls PP, or at Stawamus Chief PP, or Sea to Sky gondola overload parking (near Shannon Falls) with shuttle bus to the gondola. Sea to Sky gondola website is at:http://www.seatoskygondola.com/",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/11791/long_Als-Habrich-037-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11791/long_Als-Habrich-047-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11791/long_Als-Habrich-053-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11791/long_Als-Habrich-057-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11791/long_IMG-1489-42566.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11791/reg_DSC05768-42566.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11791/reg_DSC05775-42566.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11791/reg_Habrich2-0.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11791/reg_IMG-1486-42566.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11791/reg_IMG-1488-42566.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11791/narrow_Als-Habrich-044-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11791/narrow_Als-Habrich-048-7359_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11791/narrow_Habrich1-0.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11791/narrow_Habrich3-0.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/als-habrich-ridge-trail-near-squamish-bc-11791",
    "stats": {
        "Activities": "climb snowshoe hike ski-xc",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "6 hrs",
        "Total Distance": "12 km",
        "Town": "Squamish, BC",
        "Type": "out-and-back"
    },
    "title": "Al's Habrich Ridge Trail",
    "trail_id": "11791"
}