{
    "description": "Hedging along the Petite Cascapedia River in the Gaspe, this multi-use trail system was designed for snowshoeing, hiking and mtn biking. Given its state of grooming, I?d like to add fatbike to the list. It?s flat for all but the far left (North) region where it skirts the mountain and fringe ski runs.We explored this on snowshoes and found tons of animal tracks and game trails. Mostly deer tracks criss-crossed our way, evidence that would be virtually unknown any other time of the year.The trailhead is right in front of the Pin Rouge ski center, along Chemin de Sainte-Edgar. Since this was in winter, it was hard to see other trails, but I had the feeling that other spurs do exist. These trails were labeled by number, and we hiked #?s 2 thru 4, not really sure where trail 1 really was. Perhaps it?s the cross country ski circuit in the South east area of the mountain.The section that came back around the ski hill was pretty sketchy. We weren?t sure if the path we followed that traversed the steep bank was bushwhacked in an interpretive style, or if the route fell into disrepair. Fun little hike, never the less.",
    "directions": "From New Richmond, travel West, along Chemin de Sainte-Edgar for around 20K or until you reach Pin Rouge Resort and ski area. Trailhead across from the facility on the left.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/QC/11797/reg_IMG-2371-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/11797/reg_IMG-2372-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/11797/reg_IMG-2376-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/11797/narrow_IMG-2367-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/11797/narrow_IMG-2369-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/11797/narrow_IMG-2373-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/11797/narrow_IMG-2374-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/11797/narrow_IMG-2375-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/11797/narrow_IMG-2379-6702.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/muti-use-trails-pin-rouge-near-new-richmond-pq-11797",
    "stats": {
        "Activities": "mtn-bike ski-xc hike snowshoe",
        "From": "",
        "Seasons": "summer fall winter",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "6 km",
        "Town": "New Richmond, PQ",
        "Type": "out-and-back"
    },
    "title": "Muti-use trails Pin Rouge",
    "trail_id": "11797"
}