{
    "description": "Pin Rouge Nordic starts beside the tubing hill.Set on the foothills along the south-east face of the ski mountain sits their Nordic trail system. Claiming to be more than 7K of trails, I suspect that there should be an emphasis on the more because we did the outskirts totaling just over 7K, and according to the map, there are more connectors with three different loops. A warming hut sits on the furthest extremity. Looks nice!When I did research on the location prior to visiting, I asked the office over the phone if they offered skate skiing in addition to classic grooming. Given that there was a language barrier, I wondered if they just didn?t understand. In the end, she said no, just classic, and it?s free. This raised red flags for me, because often free, and having little knowledge of the offering means that they really don?t care about it, and it isn?t very good.Once there, I had a short exploration prior to a dedicated afternoon with my wife and noticed right away that A) there was grooming for both classic and skate skiing, and B) it isn?t very flat. For that first try, I didn?t go very far up so I had expectations that things might just flatten out later, and that this as just the rise to get to a flatter area. (not that I like things flat, indeed, I don?t)On the afternoon of our last day of skiing, we decided we would try the Nordic trails on our classic skis. This was in March, and given the warming influence of the afternoon heat, I hoped the snow would have softened up, compared to the previous late afternoon?s conditions. Things were softer, and the grip was pretty good.The trail system has numbers to the loops, but not all the loops were recently groomed, and a portion we did along the back side, didn?t match up with the map, so I guess things are open to interpretation. Number 1 seems to be the way up the left side, and other loop numbers come off from that one.One thing I can say about the trails is that they are steep! We didn?t experience all the routes, but the circumference route had its challenges. There isn?t really an indicated direction to take to avoid snowplowing down some very long and steep descents. We went clockwise and found all the signage faced us. After we got to the warming hut, there was a wicked long descent that my legs and hip muscles wouldn?t soon forget!In all, it?s a beautiful trail system, and the warming hut is a perk. Is it an afterthought offering from the ski center? Well it could be, They don?t offer rentals, but given the level of difficulty, and that it?s groomed both for classic and skate skiing, I think it holds some authenticity. Just don?t go there thinking it?s a place to take a novice.",
    "directions": "From New Richmond, travel West, along Chemin de Sainte-Edgar for around 20K or until you reach Pin Rouge Resort and ski area. Trailhead starts beside the tubing hill. Ski du fond.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/QC/11798/reg_nordic-055-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/11798/reg_nordic-056-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/11798/reg_nordic-064-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/11798/reg_skifond-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/11798/narrow_nordic-058-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/11798/narrow_nordic-063-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/11798/narrow_nordic-069-6702.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/point-rouge-cross-country-nordic-system-near-new-richmond-pq-11798",
    "stats": {
        "Activities": "hike ski-xc mtn-bike",
        "From": "",
        "Seasons": "winter fall summer",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "8 km",
        "Town": "New Richmond, PQ",
        "Type": "out-and-back"
    },
    "title": "point rouge cross country nordic system",
    "trail_id": "11798"
}