{
    "description": "Did this trail in March 2015, the \"year of no winter \" in SW BC. So hiked it,  though it would probably be more beautiful in snow on snowshoes.This hike starts at the summit of the Sea to Sky gondola, next to Shannon Falls. 2 ways up: 1) the free, hard way, up the Sea to Summit trail, from the foot of the gondola or from Shannon Falls, or Stawamus Chief Prov Park. This is up 1000 m total ascent, 9 kms and 3 hours (see Sea to Summit Trail, or ... 2) the easy, fast but more expensive way, $35 (for adults) 10 minute gondola ride (save a few $$ if you buy online in advance). Note it is $10 for ride down only.Top of the gondola is at 890 m el. Head east from the upper gondola deck, approx 200 m on the road, and at the equipment holding area, look for the Wonderland Lake loop trail on the right. Head down this trail, do the lake loop, and after nearly 1 km, arrive at the Upper Sea to Summit trail (a logging road). Turn right and head slowly down 3 kms to the Upper Shannon Falls turn off (Lower Sea to Sky Summit trail). You have dropped approx 280 m from the gondola to the lowest point on this trail.Head south in the \"Shannon Basin Loop , 8 km to Gondola and Summit Lodge\" direction. You will rise nearly 250 m over the next 2 kms, on a beautiful trail. Unfortunately, not very many views, but a lovely walk. You will arrive at the Skyline Ridge Trail, the highest point on the trail, where you can go up to Skyline Ridge if you turn right, or walk your way back to the gondola along the Skyline Trail if you turn left.After approx 1.5 k, you will come to Shannon Creek, cross it on a bridge, and, lo and behold, come to 2 abandoned flatbed RAIL CARS, yes rail cars. Kudos to who can let us know how and when they got here (no railroad nearby).A bit farther is the Sky Pilot trail (on the right, heading east) , or the trail back to the gondola, heading west.",
    "directions": "Drive Hway 99 (Sea to Sky) north from Vancouver, approx 45-60 minutes to the foot of the gondola, just north of Shannon Falls, but before the Chief, and Squamish. Parking for up to 2 hours at the foot of the gondola (2 hours apparently enforced only on weekends and holidays during the summer), or at Shannon Falls PP, or at Stawamus Chief PP, or Sea to Sky gondola overload parking (near Shannon Falls) with shuttle bus to the gondola. Sea to Sky gondola website is at:http://www.seatoskygondola.com/",
    "geohash": "c2b6",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/11794/long_SB-Loop-074-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11794/long_SB-Loop-075-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11794/long_SB-Loop-103-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11794/long_SB-Loop-106-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11794/narrow_SB-Loop-069-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11794/narrow_SB-Loop-071-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11794/narrow_SB-Loop-080-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11794/narrow_SB-Loop-091-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11794/narrow_SB-Loop-093-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11794/narrow_SB-Loop-098-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11794/narrow_SB-Loop-100-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11794/narrow_SB-Loop-126-7359_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11794/narrow_SB-Loop-128-7359.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/shannon-basin-loop-near-squamish-bc-11794",
    "stats": {
        "Activities": "snowshoe hike ski-bc",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "11 km",
        "Town": "Squamish, BC",
        "Type": "out-and-back"
    },
    "title": "Shannon Basin Loop",
    "trail_id": "11794"
}