{
    "description": "A great hike of waterfalls, glaciers, and panoramic views!  There are a number of hiking options, but we recommend this route because of added difficulty, climbing the steepest part of the trail (vs. descending), and keeping the easiest part of the hike for the end when you may be tired.  It also gives you two nights of great camping.  This loop: Takakkaw Falls - Iceline - Little Yoho CG - Whaleback - Twin Falls CG - Takakkaw Falls.Park your car at the Takakkaw Falls parking lot.  You will have to backtrack about 600m down Yoho Valley Road to start the hike but you will appreciate ending up at your car when you are done.  Begin at the Iceline / Yoho Pass trailhead beside the Whiskey Jack Hostel.  Immediately you start climbing steep switchbacks through thick forest.   Follow the Iceline trail markers and after 3km or so, you will ascend beyond the tree line.  At this point you are higher than the start of Takakkaw Falls (2nd highest in Canada) - which is directly across the valley from where you stand.  The trail has climbed out of the forest and for the next 10km you will hike over rubble, rock, moraines, rock, rubble and moraines (it really keeps on going!).  You are fully exposed to the elements the entire time and have to hop 3 or 4 streams fed by the Emerald Glacier - which is in close proximity and parallels the Iceline.  When you start to see purple shale, you are nearing the descent into the forest.  A few kms more and you can enjoy a night at Little Yoho Campground (which has a very clean and composting loo!).The first 2.5 kms east from Little Yoho is a very enjoyable and easy hike through lush forest.  You then come upon a 3-way junction.  The Whaleback is the only option that goes up (take a sharp left).  From here you will be hiking up very steep switchbacks, over loose rock and other obstacles as you climb over Whaleback Mountain (2633m).  It is a tough grunt with a heavy pack on, but your reward - the scenic highlight of the Yoho Valley - is only 2 kms away!  At the top you will enjoy panoramic views of the valley including the Daly Glacier, Yoho Peak, and Mt. Daly. Continuing along you will cross Twin Falls creek above the falls via a bridge (only available in summer) where you can stand at the brink of the falls  (9th highest in Canada & another reason not to bypass this portion of the hike).  Continue along the edge of a cliff - there is a great spot to lunch if you need a rest from the Whaleback.  About 4km of steep switchbacks through the forest will take you to the valley bottom.  You will pass the Twin Falls Chalet (private operation) just 60m before you reach Twin Falls CG - another great spot to camp.  If you have time, there is a short hike (2.3km) from the campground to the edge of Yoho Glacier. Day three is the easiest (and least inspiring).  The hike from Twin Falls CG back to Takakkaw Falls is fast and on wide, well-used trails.  It is a popular day hike and can get crowded.  Highlights of this trail include Angel's Staircase Falls and Point Lace Falls, which you will find just off the main trail, two-thirds of the way out.  After this, you are walking along a gravel road for a couple of kilometers to finish off where you parked your car.",
    "directions": "Hwy #1 to Yoho Valley Road just east of Field BC.  Turn north and follow the road to the Takakkaw Falls Campground (14km).",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/1181/long_-Iceline-Whaleback-6744-39116.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1181/long_-Iceline-Whaleback-6745-39116.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1181/long_-Iceline-Whaleback-6746-39116.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1181/reg_-Iceline-Whaleback-6711-39116.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1181/reg_2005-aug-ICELINE-033-30591.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1181/reg_2005-aug-ICELINE-044-30591.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1181/reg_AtopWhalebackJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1181/reg_Icelinejpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1181/reg_JoryonIcelinejpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1181/narrow_-Iceline-Whaleback-6705-39116.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1181/narrow_-Iceline-Whaleback-6706-39116.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1181/narrow_-Iceline-Whaleback-6737-39116.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1181/narrow_2005-aug-ICELINE-004-30591_best1_.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/takakkaw-loop-via-iceline-and-whaleback-near-golden-bc-1181",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 4,
        "Time": "17 hrs",
        "Total Distance": "29 km",
        "Town": "Golden, BC",
        "Type": "out-and-back"
    },
    "title": "Takakkaw loop via Iceline and Whaleback",
    "trail_id": "1181"
}