{
    "description": "Sawblade falls is an excellent and somewhat lesser known waterfall located in the greater Vancouver area. This hike will take you winding through typical west coast rain forest to the base of a stunning waterfall. It is also possible to go briefly off trail to find the top of the waterfall. However, use extreme caution as the rocks are slippery, the current is very fast, and the falls are near 40ft tall.Park along the road just below the Port Coquitlam Hunting and Fishing Club. You will probably hear a a lot of gunfire, don't be alarmed! About 50 meters before the yellow to the hunting club, there is a yellow forestry gate to the right. You can take your very first left in to the forest just meters up from this gate. This is a bike trail so watch out for mountain bikers. Alternatively, you can follow the gravel road and take a left at the fork. Either way you take, you will find the woodland walk trail. This trail will take you in to a clearing for power lines. Continue on along the road, cross a small bridge, and on the right side of the road there should be a sign for the continuation of the woodland walk trail. The handwritten sign reads \"walk upper loop\". Follow this trail and any other signage regarding woodland walk or sawblade falls until you have reached the falls. (It was the blue trail marker nailed into the trees during a 2017 hike.) Check out the lookout along the way. It's a nice, quiet lunch spot. The attached GPS is different on the way down because we missed a turn and took a different trail. However, the trails are well marked now and you can find your way back to Harper Rd quite easily.",
    "directions": "From HWY1 going east:Take Exit 44, stay left and head on towards the Mary Hill Bypass. Turn left on Broadway St, continue strait, cross the Coast Meridian Overpass and drive all the way up Coast Meridian road. Near the top, take a right on Harper Rd, continue along Harper until the end where you will reach the Coquitlam Hunting and Fishing Club. Park along this road before the gate to the hunting club. The trailhead/dirt road is about 50 meters before the hunting club yellow gate and is the beginning of the trail network. The address to Coquitlam Hunting and Fishing Club is 5000 Harper Road, Coquitlam BC. This would be easier to find using Google Maps.",
    "geohash": null,
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/11816/reg_20150509-111145-47175.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11816/reg_20150509-124657-47175.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11816/reg_DSC-0192-50203.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11816/reg_DSC-0208[1]-50203_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11816/reg_DSC-0234~2[1]-50203.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11816/narrow_IMG-7891-29373.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/sawblade-falls-near-coquitlam-bc-11816",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "4 hrs",
        "Total Distance": "9 km",
        "Town": "Coquitlam, BC",
        "Type": "out-and-back"
    },
    "title": "Sawblade Falls",
    "trail_id": "11816"
}