{
    "description": "This is a paved road that is relatively famous for cycling.  It is so famous that in the spin classes that I attend in Canada, one of the videos is of this bike loop.  It is famous for all of its ups and downs (called rollers by those on bicycles) and twists and turns.  It is fully paved.  It is a one way traffic loop except for a short portion that is 2 way.  There are road bikers on it but it would also be something that could be done on a mountain bike.  I was driving this when I recorded the GPS so I guessed at the time it would take to bike it.  The car speed limit is 15 mph.  The GPS recording is just of the loop but the road to the loop has dedicated bike lanes on the shoulders of both sides of the roads.  It clearly would a lot of fun to bike.This is a national park (since 1933) so national park entry fees apply.  It obviously got its name from the Saguaro Cactus that proliferated in the early part of the 1900s.  There are still lots of them but not nearly as many as 80 years ago.  The signs say there were some frosts in the 1930s as well as cattle damage that caused many of the Saguaro to die off.  The signs say that the Saguaro are making a come back now.There are a few trailheads the start off of this road but I didn't explore them and don't know anything about them.  There is a fully operational information centre and gift shop at the entrance to the park (which is where the GPS loop recording begins).For bike rentals: We rented in Scottsdale (near Phoenix) at AOA-adventures for great weekly rates on GIANT and Specialized, allowing you to ride nearby McDowell Preserve or South Mountain before heading to Sedona or Tucson for more great riding.",
    "directions": "This park is basically directly east of downtown Tucson and represents the eastern edge of the city.  The closest intersection would be Old Spanish Trail and East Escalante Road.  East Escalante Road is the one that has the bike lanes on each side of the road.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/AZ/11828/long_SaguaroNatForestEastEPanoTucsonApr202015-41457.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/11828/reg_SaguaroNatForestEastBTucsonApr202015-41457.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/11828/reg_SaguaroNatForestEastCTucsonApr202015-41457.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/11828/reg_SaguaroNatForestEastMTucsonApr202015-41457.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/11828/narrow_SaguaroNatForestEastDTucsonApr202015-41457.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/saguaro-national-park-east-near-tucson-az-11828",
    "stats": {
        "Activities": "mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "15 km",
        "Town": "Tucson, AZ",
        "Type": "out-and-back"
    },
    "title": "Saguaro National Park - East",
    "trail_id": "11828"
}