{
    "description": "This is a neat trail to a run around point where a huge sea cave exists.  The starting point is awesome as well as there is a super nice waterfall just off the brook where highway 215 crosses.  The fall would be hidden except that you made a run on a dirt road to get to the trailhead.  So the fall is a nice bonus!  Then you start walking on the seafloor and the rock formations are kind of numerous folds going all over the place very neat!...The geology changes quickly to a sandstone absolutely pitted with pebble to cobble size different rocks.  You go around a point where the sea is slowly carving a natural arch...you could use the arch if you like squeezing yourself as there is not a ,to of space (April 2015).Once around the point, you will see in the distance a large sea cave.  Between the two are numerous waterfalls, overhangs and in the winter some climbable ice.  The sea cave is huge about 100ft long and maybe 25ft deep.",
    "directions": "Highway 215 near Walton and or Pembroke turn on Pembroke Wharf Rd and park about 100m down the road. Head for the coast and follow it until you get to the sea cave or push it further if you have the time and the tide is working in your favor...don't forget the tide here rises a good 50ft high.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/11837/reg_DSC-0078-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11837/reg_DSC-0111-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11837/narrow_DSC-0094-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11837/narrow_DSC-0097-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11837/narrow_DSC-0106-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11837/narrow_DSC-0117-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/sea-cave-cove-near-windsor-ns-11837",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "5 km",
        "Town": "Windsor, NS",
        "Type": "out-and-back"
    },
    "title": "Sea Cave Cove",
    "trail_id": "11837"
}