{
    "description": "This the direct route to the Grotto Mountain summit. This route is very steep and requires use of your hands to climb rock features. This route contains considerable exposure on several sections. You will gain 1370 metres in approximately 3.6km, one way. The trail will have snow and ice well into May. The trail is not well marked and there are many cliffs along the route. Do not attempt to short cut down gullys or other features as they may end in cliffs. It is not recommended to use this trail for an ascent of Grotto Mountain. Rather, this trail is more frequently used on the descent. Once again, it is very steep. Poles, experience, and sufficient conditioning are recommended. Returning via the north west ridge route is longer, but much easier.From the summit, take the ridge directly to your south towards the screen slope leading into trees. Stay right, towards the cliff edge, once you near the trees to gain the trial. You will stay along this edge for most of the descent.To ascend via this route, proceed up the ACC Grotto Mountain trail as you normally would, however take the less well developed east trail across the creek after about 15-20 minutes. Proceed across the creek and up the other side of the gully and then head northwards. You should see a sign at a fork with the left pointing towards Echo Canyon and the right towards Grotto Mountain. Head right.",
    "directions": "From Highway 1, take exit 91 from Banff to get to 1A. Then, you have to go East and right after the overpass, it'll be the second road on your left, Indian Flats. This road brings you up to the Alpine Club. You have to park your car on the side of the road as indicated on the trail head sign.",
    "geohash": "c3n4",
    "photos": [],
    "source_url": "https://trailpeak.com/trails/grotto-mountain-summit-direct-route-near-canmore-ab-11842",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 4,
        "Time": "7 hrs",
        "Total Distance": "8 km",
        "Town": "Canmore, AB",
        "Type": "out-and-back"
    },
    "title": "Grotto Mountain Summit Direct Route",
    "trail_id": "11842"
}