{
    "description": "In short, another good intermediate to advanced (in places) out and back ride along classic singletrack of Sedona.  The loop is Adobe jack trail followed by a return on Grand Central with a small diversion to ride around Ant hill (more advanced in places) for the 360 views.Red Rock and towering sandstone mountains all around you, forest floor riding, single track ups and downs, wash riding, red rock on ant hill, this ride has some great variety.  I'd still prefer Mescaland Aerie over this loop, but if looking for a 2nd ride of the day (I rode Mescal, Deadmans pass, and Long Canyon loop in the AM), this is a good choice for an hour and a half ride, or connect with Jordan trail and others to extend for three hours or so.  A large trail network here.The ride goes as follows; Adobe jack initially climbs, lots of lose rock on the trail, then has lots of flowy ups and downs and whips until it hits the forest floor.  You ride single-track forest floor that is sandy in places, and overall a ton of fun, a few washes to descend and rise out of. As you complete Adobe Jack and meet up with Grand Central, you begin your return loop.  Oddly, you initially descended on Adobe Jack, and now on the return loop on GC (or javelina), I had some wonderful loopy single track that I knew I would have to pay for.  But it wasn't that bad.  The climb takes you you up to Ant hill, make sure you do the short loop (see the circlular ant hill loop on the GPS map right) then come back to your circle starting point and take GC up to the peak for the views. Some cardio here -- but you quickly gain the peak for 360 views.  Your descent is virtually a downhill trail, being my 2nd ride of the day, I chickened out' of the steep run out and walked that part (no endo rule).  Then, the rest of GC seems to follow forest floor and finally a stream bed, which was fun at first, then just annoying.  Very cool tree with spiralled trunk on Ant Hill as the loop starts.Don't bother with the .3 mile stream bed / boulder trail back to the Adobe Jack parking lot, it's a lot of rock, no flow,  and, x-cross the wash with lots of tire traps.  My only cut of the trip! Just gain the road at the trail intersection, you've done the best riding, close it out with a warm down (it's still up!) along 89A. You can't miss the  89A parking lot for Adobe jack, it's just out of the Y and along 89A south along a forested strip before you hit the commercial drag where the Whole Foods is.It's just past a new restaurant off 89A (Mariposa), and it's on the bike map youget at the bike stores.  Nice loop, lots of other trails to explore if you have time.  In retrospect, had I a bit more time, I would have rode further up Soldier Pass (to seven sacred pools), then on return checked out Devils Kitchen (another sinkhole), and, then Jordan to Javalina which paralles GC just  slightly higher ground.  But I liked the berms and flow on GC.You've got other options here.  Connect with teacup to go do the Thunder Mtn Loop (not that great), or, Jordan trail to Thompson (blue) for what looks to be a more remote ride (towards Wilson).I rented my full suspension bike from AOA adventures in Scottsdale (Phoenix) prior to Sedona, I rode a very nice GIANT Trance 3, 2015, enjoyed it.",
    "directions": "Adobe Jack Paraking lot, off 89A South, go south from the Y in Sedona (the \"downtown\" large traffic circle) and as you drive out of the commercial district, along a forested rise, and just after the new Mariposa restaurant, you'll see the trailhead and parking area on your right.  Adobe Jack apparently gave this land, having been a corporate exec. elsewhere, and having returned to Sedona after making his loot. Thanks Jack!",
    "geohash": "9w0w2",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/AZ/11849/reg_adobe-start-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/11849/reg_adobe2-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/11849/reg_ant-hill-loop-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/11849/reg_mystical-tree-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/11849/reg_swoopy-adobe-5_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/11849/reg_twisted-energy-tree-5.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/adobe-jack-loop-near-sedona-az-11849",
    "stats": {
        "Activities": "mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "15 km",
        "Town": "Sedona, AZ",
        "Type": "out-and-back"
    },
    "title": "Adobe Jack Loop",
    "trail_id": "11849"
}