{
    "description": "Possibly my favourite, but since I can't decide between them all, I'll just say that intermediate to advanced riders will love the flow, the views, and the red rock that Mescal provides.  The  terrain here is epic, the red rock trails less crowded (but still popular) than around Bell Rock and Courthouse trails.Start with Mescal and wind your way around Deadmans Pass and finally Long Canyon for your descent and return to the trail head on blue / green trails.  This loop is about 8km, and can be done in just over an hour.  Of course there is so much more to connect to (add the Chuckwagon loop -- it's highly recommended). I had a trail runner with me, and, it got hot quickly so we used this loop to explore the area.  Make sure you start early in the AM if it's late April or May. The views as you traverse circle a red rock mountain are outstanding.  Cactus, flowers, singletrack,  flow, views, and sunshine.  This trail really flows.  It's low stress (compared to hangover / hiline)  but high reward with only a few places you have to get off the bike. Hydration packs work well, we used Osprey, with 1.5L bladders -- always ensure you have plenty of water on the trail.Once you circle the peak, you reach Deadman's pass trail and it gets easier.  It's mostly downhill now, some more great flow, no real challenges, you are just riding back to the trail head, enjoyable just the same.Finally, take the small rise of Mescal instead of the road (right turn) to get back to your parking area. A bit more single-track here. and then you are back to your parking off Long Canyon Rd.If, after completing Mescal want to create a mega-loop, you can connect  to Aerie / Cockscomb to create a mega-loop if aboutr half-way on this loop, you turn left when Mescal joins Deadmans (to find Aerie), but Aerie is described separately on trailpeak.   Chuckwagon is the trail I would have liked to added onto this ride, you can take that once your loop completes at Long Canyon TH. I rented my full suspension bike from AOA adventures in Scottsdale (Phoenix) prior to Sedona, I rode a very nice GIANT Trance 3, 2015, enjoyed it for the week.",
    "directions": "Park at Long Canyon TH, or, a bit sooner off Long Canyon RD.  You reach Long Canyon RD off Dry Creek Rd from Sedona, heading South from the Y on 89A (past Bashas).  Note: An excellent trail running store in the mall nearby -- for trail supplies / trail info, and, they also sell the recreation map for the area showing all bike / hike trails.  Any bike store also.  Very handy!  I rented my bike (GIANT Trance) from AOA adventures in Scottsdale before coming to Sedona -- great rides, nice dual suspension ride, 1 week rental.  Go ride McDowell while you are down there.",
    "geohash": "9w0q",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/AZ/11848/reg_above-us-mescal-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/11848/reg_deadmans1-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/11848/reg_mescal-slick-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/11848/reg_view-off-mescal-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/11848/narrow_deadmans-lookout-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/11848/narrow_mescal1-5_best1_.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mescal-loop-near-sedona-az-11848",
    "stats": {
        "Activities": "mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 5,
        "Time": "2 hrs",
        "Total Distance": "8 km",
        "Town": "Sedona, AZ",
        "Type": "out-and-back"
    },
    "title": "Mescal Loop",
    "trail_id": "11848"
}