{
    "description": "Hogwash is the goal here, via Mystic.  After Hogwash, Broken Arrow trail flows in behind the mountain, taking you past Devil's Dining Room (sinkhole) and then Chicken Point, with an option to take a spur down to Submarine Rock (I didn't).  Hogwash was great!  Has some flow, some washes, but it's a great ride.  Connects with Hog Heaven, a double black trail that goes up and over the red rock you circle, too early in the season for me.Park at little horse. Take initial path next to road then sidewalk to right on Chapel Rd. and mystic TH about a click up the road on the left. Follow mystic .4 miles until you get to the hog wash trail. It's black diamond, so if you are intermediate to advanced -- you should be fine.There are points (dips / washes) that just about everyone will have to dismount for, but, if you are off your bike frequently, or, afraid to ride the narrow ledgway paths and hairpins, re-consider doing this trail.The double black Hog heaven is reached from hog wash, but, my own limit is black diamond, especially coming off winter, where fitness level and riding strength is often the difference from black to double-black (not to mention technical skill).Some incredible views and lots of slick rock to ride, as you circle the Twin Buttes always on your right, you may run into (or hear) the pink jeep tours, you'll hear them before you see them.As you continue to circle, the reach the submarine rock turnoff.  I was too tired from an earlier hike (Harding Pass +) to go there, so I just followed my loop, Hog Wash meeting up with Broken Arrow trail more or less where the jeep noise appears.  Follow Broken Arrow (more great slickrock) along to Chicken Point.Chicken point is incredible -- the views are outstanding, and, for those that ride Moab, you'll be on familiar ground -- ahem, rock.  I wandered around up top, then, eventually (had to look for it -- it's there) found the metal sign for the Little Horse trail, which does descend in between the two peaks you are staring at as you look out, on the left side.  Yes, you are descending the valley / ravine you are staring out at.  It's more single track now, this time descending steeply and over some rock ledges, but in general Little Horse trail is not as difficult riding as what you've just done. You are now more of a downhill rider, descending and finally looping as Little Horse intersects with the Bell Rock Pathway.  Turn right here, and in some 500m or less, you get back to the Little Horse parking area, where you initially parked.About 2 hours for this loop.  I was tired, and, being a very hot day, I took my time. A great loop, you can extend with Llama on the backside from Little Horse, or connect with Slim Shady and Templeton and the trail network on the other side of 179 via the HT (connector) trail. You can ride all day in this neck of the woods, the red rock views are outstanding.  Make sure you get the Recreation map with all the local trails (bike / hike) at a local bike shop in town e.g. Bike & Bean.  I rented my full suspension bike from AOA adventures in Scottsdale (Phoenix) prior to Sedona, I rode a very nice GIANT Trance 3, 2015, enjoyed it.",
    "directions": "The ride begins out of the Little Horse Parking lot on 179.  Best to park here, take the sidewalk (starts with single-track) to Chapel Road, then, cycle up Chapel a kilometer or so until you see the trailhead for Mystic.  Isn't great parking there, so LH is your best bet and it's off 179.Once on Mystic, follow for a while until the start of Hogwash, or, do the Mystic loop then come back and get on Hogwash.  You'll love Hogwash, it may be black diamond, but it has great views, flow, and, slickrock.",
    "geohash": "9w0w",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/AZ/11847/reg_broken-arrow-to-Chicken-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/11847/reg_brokenArrow-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/11847/reg_chicken-pt-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/11847/reg_devils-dining-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/11847/reg_hogwash-heaven-x-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/11847/reg_mystic-to-hogwash-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/11847/reg_slickrock-broken-to-chicken-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/11847/narrow_map-hogwash-5.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mystic-hogwash-arrowhead-near-sedona-az-11847",
    "stats": {
        "Activities": "mtn-bike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 5,
        "Time": "2 hrs",
        "Total Distance": "10 km",
        "Town": "Sedona, AZ",
        "Type": "out-and-back"
    },
    "title": "Mystic Hogwash Arrowhead",
    "trail_id": "11847"
}