{
    "description": "If you haven't been the the coffee Pot restaurant for breakfast, this could be your warmup ride followed by breakfast.  I don't recommend  it above a lot of other local rides, but I do recommend for a quick fix if staying in the area off 89A near Bashas or the Coffee Pot restaurant.  Let's focus on your apres-ride breakfast first.  The Coffee Pot does a brisk business and is a classic stopover for omelletes, lumberback style breakfast combos, coffee, and, most other diner food.  It's got a Kitchsy southwest decor that is reminiscent of the Tomahawk in North vancouver (can there be another).Ok so the ride.  It's alright, I looped Thunder Mountain (nice singletrack with a few small ledge drops),  Andante, and, then, after Andante, more of Thunder Mountain on a black diamond. You are initially overlooking housing, but on the back-side of Thunder Mountain, you have a more remote typical Sedona trail feel.There are some very achievable peaks you can get off your bike to hike up for some quick photos.  There are several trailheads as well, I chose Andante (near a large water tank) and not far from the Stupa either. Have a chill ride, then visit the Stupa and offer your intentions for more great riding, oh, and world peace.You will see the loop here (see map right) is all blue except for the black part of Thunder Mountain -- the trail closer to the mountains that you parallel Andante for your return to parking.  Now, there is fun black diamond,  then there's pain in the ass black diamond.  Both Andante and Thunder where they run in parallel have tight dips through a lot of washes that seem 50 feet apart.  But on Thunder, it's a lot of off and back on the bike as you really can't (or it's no fun) to climb up the trail ledges and logs off the washes.  Just look at how jagged the GPS track looks where these two parallel each other.Frankly, I was cursing, this could be nicknamed \"no flow trail\".  A great example of a black diamond rated trail that IS fun is \"Hog's Wash\" on the other side of town, phenomenal loop on slickrock mountain shoulders,  turning you around to Broken Arrow (blue) with great views at Chicken Point.  The part of Thunder Mountain that is black Diamond rated has no such joy. Thankfully it's short, and, you can ride the circular part of the trail that circles Thunder Mountain that is fun!To sum up -- a fun (ish) loop overall that may be close to your accomodations, ride it as a filler, or connect with other trails in the vicinity.  In my opinion, hit up the other biker friendly loops and trailheads,  i.e. nearby Aerie / Cockscomb, Mescal / Chuckwagon, or others. So many others.  Possibly use this trail entrance to  reach other trail networks, just note you'll need the recreation map (see Bike&Bean), and, watch for trails that do not allow bikes.  Advice; park / ride elswewhere. I rented my full suspension bike from AOA adventures in Scottsdale (Phoenix) prior to Sedona, I rode a very nice GIANT Trance 3, 2015, enjoyed it.",
    "directions": "From the Coffee Pot restaurant, in general, head in behind into the residential area.  Follow to the main parking lot for Thunder Mtn (recommended), i.e Coffee Pot Dr, Sanborn, then look for Thunder Mtn trailhead past Andante to where Sanborn otherwise curves.  Or, head up Andante (what I did) for alternate parking (not far from the Stupa peace park).  You'll see a water tower (green), and, you can't miss the parking lot.  You can however miss the blue rated Andante trail, which crosses the parking lot as you first enter the parking lot.  It's tempting to park and look up the mountain, and there are (bad) spur trails leading out of the parking area, sure, you'll connect with Thunder (Black), but, look behind you towards the road you came in on, and look for the trail you want to start with.Go here for 3 reasons; you've done everything else (or staying nearby), the Stupa, the breakfast. Hmm, these are actually good reasons.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/AZ/11850/reg_thunder1-5_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/11850/reg_thunder2-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/11850/reg_thunder3-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/11850/reg_thunder4-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/11850/reg_thunder5-5.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/coffee-pot-thunder-mtn-near-sedona-az-11850",
    "stats": {
        "Activities": "mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 2,
        "Time": "1 hrs",
        "Total Distance": "6 km",
        "Town": "Sedona, AZ",
        "Type": "out-and-back"
    },
    "title": "Coffee Pot -- Thunder Mtn",
    "trail_id": "11850"
}