{
    "description": "This moderate to difficult (depending on the temps / your fitness level) is about 18km return.Get here early as the parking lot at the Bridge just a few minutes out of town north on 89A towards Flagstaff is full of gawkers checking out the views above the deep canyon below. We noticed climbers trekking their gear from the parking lot as well, on the lower trails to rock faces unknown to us.For the hiking crowd, the trail starts right away ascending from the parking lot (at the covered picnic table turn right and up). It's gentle at first, but always rising, and you'll feel the sun on hot days. BY 9 a.m. in May, it will be smoking hot, on May 1, I was quickening my pace in the open to reach the single tree's worth of shade ahead every 30 or 40 feet, then slowing my pace to cool a bit, and so on. The climb is steady, this is a local epic that will take 3-4 hours return -- it may be more of a mid-trip selection, but well worth it.As you climb, and climb, and climbm, you will have great views of the peaks around you.\nThen, views of Sedona that are unparalled, you'll then ascend a steep valley / ravine to the peak, switch backing on 45 degree sloped terrain with unreal views back on Sedona, and the towering cliffs of Hangover trail opppsite.Above you, the peaks remain but get closer as you continue to slog / hike in the open sun. For those in shape, the cardio workout feels good, others take breaks in the shade. Reaching the top feels great, but, the trail keeps going for those interested, even the rocky peak above you. On this hot day, we settled for the top of the mesa looking out over a wide expanse that is more or less flat to Flagstaff. Other than the peaks that poke above this plateau, this is the top and where most turn after a break.I believe we started at 9 and finished around 2 p.m. at the car. 4 to 5 hours depending on your pace and about 6+ miles. You will see the Bridge you parked at as you gain elevation, it appears very small at your turnaround point -- this is a great hike!For guided hikes in AZ, check out AOA adventures.",
    "directions": "Just past the bridge not more than a mile out of town (1.1 miles, you can't miss it), park here, display your pass (or purchase) and look for the trailhead, there are large poster sized maps at each trailhead, your trail starts right away on the right at the picnic table. It's a very popular trailhead, get here early!",
    "geohash": "9w0w",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/AZ/11854/reg_wilson-view2-5_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/11854/reg_wilson-view-parking-bridge-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/11854/reg_wilson-view1-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/11854/narrow_wilson-gecko-rock-5.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/wilson-south-near-sedona-az-11854",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 5,
        "Time": "3 hrs",
        "Total Distance": "18 km",
        "Town": "Sedona, AZ",
        "Type": "out-and-back"
    },
    "title": "Wilson South",
    "trail_id": "11854"
}