{
    "description": "A good starter hike, it has some decent elevation gain, nice views, and it's close to town (off Jordan Road, from downtown just up 89A from the Y).  It's 2.5 hours if you go down the other side of the mesa, and, take in the spur atop the mesa (on the right as you reach the top) for views down the canyon.  Fast hikers will do this in 2 (or less).You've got all the elements of a great Sedona hike; cactus, forest, red-rock, vistas from the Mesa, wash and forest cover singletrack. Brins has two different aspects.  The first is cactus laden single-track rising gently from the parking lot along Mormon Canyon for about a mile before you begin some fairly steep cardio (medium effort) to the Brins Mesa bench top 1.4 miles in.  Not killer cardio and elevation like Bear or Wilson South hikes, but some decent vertical gain, with more immediate payoff to views.We were given a tip to take the right spur at the top of the rise to another lookout overlooking the canyon, but we kept going straight on the Brins Mesa, which then  descends into forest and tree coverd singletrack in the back-side shallow canyon (good to know about on hot days).  Brins actually extends another 2.3 miles from where you reach the mesa top, connecting with Chuckwagon at one of it's trail-heads off forest road 152. We hiked most of it, choosing to return before reaching the second trail head. Great initial hike -- our first on this trip to Sedona.For guided hikes in AZ, check out AOA adventures.",
    "directions": "Head up Jordan Rd. from Downtown Sedona (north from the Y along 89A).  Still in town, look for Jordan, follow that all the way (using the local recreation trail map available in hike / bike shops helps).  Check out Bike & Bean on HWY 179 in Oak Creek, or Hike House closer to the Y (downtown).",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/AZ/11852/long_wide-view-mesa-top-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/11852/reg_brins-mesa-top-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/11852/reg_jodie-view-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/11852/reg_kurt-mesa-top-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/11852/reg_kurt-rock-top-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/11852/reg_start-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/11852/reg_trailhead-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/11852/narrow_treething-5.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/brins-mesa-near-sedona-az-11852",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "3 hrs",
        "Total Distance": "10 km",
        "Town": "Sedona, AZ",
        "Type": "out-and-back"
    },
    "title": "Brins Mesa",
    "trail_id": "11852"
}