{
    "description": "It's only 45 minutes up, about 30 minutes down, but we met a couple who hike a lot (Everett who also works at the visitor center and is very knowledgeable about local trails) who showed us an option up top.Being fortunate to meet some locals at the top of this \"Grouse Grind\" styled ascent, we went initially right to collect the views of Oak Creek canyon some 1000 feet directly above the canyon below. Impressive sheer cliff walls and rock turrets opposite you, you've earned your snack break even though it's only a 45 minute hike up.  We extended by continuing back from the viewpoint and then further along the mesa top to where the Cookstove hike completes.  This was about 30 minutes more and very pleasant, in tree cover on a hot day.Stopping to rest here, we discussed other trail options, and, found out the visitor center staff are hikers who are members of a local hiking club and can make great trail recommendations.  We returned, happily chatting and learning more about the area for 30 minutes before descending on Harding Springs trail the way we came up. We learned that Harding once grew fruit in the canyon below, then pack-muled it to the top of the canyon before loading the goods on wagon for delivery to Flagstaff.  These must have been sure-footed mules, one even passes an intact wooden tie-up point, which was an odd find until explained to us later.Oak Creek canyon has many hikes that ascend steeply, and another favourite is Sterling Pass.  In fact, I'd  suggest Sterling first, it's more open, view great views above you, and, once through the pass, continues to Vultee Arch, so named for small plane crash victims some time ago. Wilson North and South (South being the most popular) are closer to town, but share in their ambitious nature to climb steeply out of Oak Creek Canyon.There are campgrounds along shaded and cooler Oak Creek Canyon, and lots of lodges and cabins for those more interested being above Sedona along 89A.  It's more typical pine forest with access to water and small swimming holes.",
    "directions": "Follow 89A, it's across from the Cave Spring Campground (a great option for cooler temperatures, swimming holes and less of the touristy side of Sedona).  11.4 miles of 18.2km from the Y in town (the main circle), you would be heading towards Flagstaff.",
    "geohash": "9w0x1",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/AZ/11853/long_wide-kurt-view-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/11853/reg_best-view-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/11853/reg_spikes-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/11853/reg_start-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/11853/reg_to-cookstove-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/11853/reg_view-5.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/harding-springs-near-sedona-az-11853",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "6 km",
        "Town": "Sedona, AZ",
        "Type": "out-and-back"
    },
    "title": "Harding Springs",
    "trail_id": "11853"
}