{
    "description": "ride up to some great views initially, great switchback climbing on blue rated, views all over the place to opposite cliffs / Bear Moutain / Fay Canyon (great hikes in particular Bear). You are circling Doe Mountain, riding wonderful singletrack with red rock sections on the mountain's shoulder.  Exit the Fay Canyon parking lot (where you park) heading to the right (not straight ahead and down) -- you will be on Aerie in no time, and you'll know you are as you begin to climb.  Several switchbacks later you've gained altitude and ride parallel the road you came in, Boynton Pass Road. Looking to the right you see large cliffs between the Fay Canyon and Bear mountain hike (I can't recommend Bear enough for an epic hike with views).  Aerie has some real flow, it's a great ride.  As you circle Doe it descends and really flows, it's a lot of fun.  Shortly after you cross a road, you reach the Aerie TH and continue on Cockscomb. More flow, and 10 min later you are at the intersection with Rupp.Take Rupp down to Girdner (recommended) doubling your ride if you turn left, and loop back Dawa, possibly taking the Anaconda Black Diamond trail over a small red-rock peak. Return on Dawa and get back on Cockscomb.I was on a one to two hour exploration ride, hitting the main trail intersection points and all of Aerie / Cockscomb. I returned on Cockscomb - wishing I had more time to ride Girdner / Anaconda before my return.  At the 4-way intersection with Cockscomb, Dawa -- you return to the parking lot on Cockscomb, on a wide Jeepish trail rising up to the parking lot fairly quickly.  From here,  ride a spur of Aerie to the right and then ride up the road to Mescal / Chuckwagon, or, get in the car and waste no time getting to some other must-ride areas.  I would have stayed to ride down Dawa and explore ??? and ???  but I really enjoyed Aerie / Cockscomb loop as an anchor ride from which you can extend in several ways (below to Girdner / Anaconda, up Boynton to Deadmans / Mescal). The trails off Boynton are not to be missed as one of the major mountain bike trail access points, these trails provide blue / black level rides with slick-rock, incredible views, and flow.  Get a bike map at the Bike & Bean in town and discuss your options there.  Make sure you include Aerie / Cockscomb / Girdner / Anaconda as a half-day ride during your stay. I rented my full suspension bike from AOA adventures in Scottsdale (Phoenix) prior to Sedona, I rode a very nice GIANT Trance 3, 2015, enjoyed it.",
    "directions": "Park at the ample Fay Canyon parking lot off Boynton Pass road.  Reaching this road from Sedona off 89A, turn on Dry Creek Road (past Bashas grocery) and when you reach a T-intersection, turn left, it's still Boynton Pass road, now continue a fwe minutes to the Fay Canyon Parking lot on the left.",
    "geohash": "9w0q",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/AZ/11851/reg_aerie1-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/11851/reg_aerie2-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/11851/reg_aerie4-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/11851/reg_aerie5-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/11851/reg_aerie6-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/11851/reg_aerie7-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/11851/reg_aerie8-ckscmb-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/11851/reg_aerie9-ckscmb-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/11851/reg_erie3-5_best1_.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/aerie-cockscomb-loop-near-sedona-az-11851",
    "stats": {
        "Activities": "mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 5,
        "Time": "2 hrs",
        "Total Distance": "10 km",
        "Town": "Sedona, AZ",
        "Type": "out-and-back"
    },
    "title": "Aerie Cockscomb Loop",
    "trail_id": "11851"
}