{
    "description": "Honeymoon Pass:If you are looking for a great hike with fantastic view and great scenery this is probably not a hike for you. In fact, I do not recommend this hike for anything other than a way to access the Verdant Creek backcountry camp. The hike starts out in an area that was burnt many years ago. The contrast of the purple fireweed to the burnt leftovers of the forest were stunning but other than that the trail was quite boring. After crossing a creek we lost the trail for a bit but were able to bushwhack for a while until we found it again. The top of the pass offered very little as far as views are concerned. Verdant Creek Trail:After the pass, you start your journey on the Verdant creek trail. Other than the August wildflowers and occasional animal track there is little to be seen. Just before the campsite Verdant Creek must be crossed and at this time the bridge was out. It is my understanding that the trail is not really maintained anymore past the top of Honeymoon Pass so I doubt this bridge has been fixed since. I recommend giving a good shout as you approach the campsite, just to let the other campers know you have arrived. By other campers, I mean the bears. It was a Friday night in early August and we had the place to ourselves. There is a fire pit, gigantic table and all the expected amenities of a Parks Canada backcountry site (bear poles and an outhouse). If you are looking for solitude and wilderness without having to hike very far, this is actually a pretty good little place. Make sure to take the necessary precautions, the next morning we wondered only a few minutes down Verdant Creek before we found loads of fresh Grizzly tracks. If your plan is to continue on past here be prepared for a rough go, this rarely maintained trail was trashed in the June 2013 floods, large parts of the trail were completely washed away and the bear tracks were plentiful.Parks Canada Kootenay website summarizes this trail nicely \"A rough trail for skilled backpackers with multiple creek crossings and prominent avalanche slopes. Watch for bears.\"Distance: 8.9 km one wayElevation: +756 m",
    "directions": "Located along Highway 93 in Kootenay National Park. Trailhead is located at the Vermilion Crossing parking lot.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/11879/reg_IMG-2241-edited-50330.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11879/reg_IMG-2262-50330.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/honeymoon-pass-and-verdant-creek-near-calgary-ab-11879",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 3,
        "Time": "14 hrs",
        "Total Distance": "9 km",
        "Town": "Calgary, AB",
        "Type": "out-and-back"
    },
    "title": "Honeymoon Pass and Verdant Creek",
    "trail_id": "11879"
}