{
    "description": "The Pendragon Trail was named for the Schooner Pendragon that left Northern Arm one summer?s day in 1914 and was never heard from again. Part of the Pendragon Trail was called ?Oxen Road? by our ancestors. This is the road where oxen hauled timber from neighbouring forests to the shipbuilding sites on Evans? Point. The Oxen Road starts at the beginning of the trail opposite the parking lot, and travels along the trail out onto Evans? Point. (Note: Even though the trail extends out onto the point, the land there is owned by the Evans family) Evans? Point is home to the sawmill sight. Sawmills were constructed and operated by the Evans family in the late 1800?s and early 1900?s. These sawmills were used to saw lumber which was used in the construction of the schooners. The old boilers used in these mills can still be seen today out on Evans? Point, one of which is in its proper, upright position, and the other tipped down onto the ground. Another part of the trail was called ?Strawberry Lane? due to the abundance of wild strawberries.",
    "directions": "Northern Arm is located in the central region of the Canadian province of Newfoundland and Labrador. More specifically, the town lies 18 kilometers north of the Trans Canada Highway, along Route 350/352.Route 350 can be found 11 kilometers east of Grand Falls-Windsor, and 72 kilometers west of Gander. As you drive along Route 350, you will pass the neighbouring communities of Peterview and Botwood, and will enter Northern Arm as you cross Northern Arm Brook.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NL/11883/reg_DSCF1969-51661.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/pendragon-trail-near-botwood-nf-11883",
    "stats": {
        "Activities": "hike mtn-bike",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "1 km",
        "Town": "Botwood, NF",
        "Type": "out-and-back"
    },
    "title": "Pendragon Trail",
    "trail_id": "11883"
}