{
    "description": "A popular loop trail starting and ending near the Banff Springs Hotel - can be done in either direction but the trailhead is easier to find for a counter clock wise loop.Starting from the trailhead beyond the parking lot for the Banff Springs hotel this wide old road is a up and down stroll for some 6km to a crossing of the Spray River - you could continue all the way to Canmore if you wish - at the bridge crossing is a level meadow with an assortment of wildflowers in season.I did this trip on mountain bike and it is one of my favorite short rides in the Banff area.After crossing the Spray on a sturdy bridge you will come to a wilderness campsite which considering it closeness to Banff townsite wasn't busy on a long weekend.The gravel road is narrower here and continues its up and downs until you come to the Golf Course - there is a trail junction that will take you to and old quarry loop and also access to the Mt Rundle trail network.As you approach the Golf course you great some great views of the Hotel and wildflowers along the river bank. You may also see Elk grazing on the Golf Course.You will need to watch for the proper trail route otherwise you will end up walking/biking on the lush green grasses of the golf course.The trails ends at the bridge across the Spray River behind the Hotel - just continue a short distance to reconnect to the start if you have left a car at the hotel trailhead.In winter please check the Avaluator(Online Trip Planner) rating is:  Simple.  See more trip planner route details here.NTS Map: 082o04Elevation Gain 65 m (213 ft).",
    "directions": "Follow the signs to the Banff Springs Hotel - drive through the hotel to the gravel parking lot and the start of the trail.",
    "photos": [],
    "source_url": "https://trailpeak.com/trails/spray-river-loop-near-banff-ab-1188",
    "stats": {
        "Activities": "snowshoe hike ski-xc mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "3 hrs",
        "Total Distance": "12 km",
        "Town": "Banff, AB",
        "Type": "out-and-back"
    },
    "title": "Spray River Loop",
    "trail_id": "1188"
}