{
    "description": "This is an easy hike to some world class fossils near Parrsboro, NS.  the hike starts on a descent on an old woods road.  Then the rest of the hike is on the sea floor alongside some high cliffs.  there is a neat little sea stack to see at first and further along there is quite the large natural arch.  throughout all of this scenery, keep your head down as this is a highly prized fossil location.  HOWEVER, you cannot keep any fossils as this is a NS special place under legislation.  Here is an excerpt of why this place is so special (www.wikipedia.org);  Wasson Bluff (also known as Wasson's Bluff) is the name applied to a series of imposing cliff faces on the north shore of the Minas Basin about 5 miles (8.5 km) east of the town of Parrsboro, Nova Scotia.[1] The cliffs, which stretch approximately one mile (1.6 km) from Wasson Brook in the east, to Swan Creek in the west, consist of 200-million-year-old rocks that have yielded a wide array of fossils including more than 100,000 bones from Canada's oldest-known dinosaurs as well as the smallest dinosaur tracks ever found.[2][3] The fossils date from a critical time in the evolution of life, the boundary between the Triassic and Jurassic geological periods, when mass extinctions led not only to the dominance of the dinosaurs, but also to the evolution of groups of vertebrates, such as fish, crocodiles, frogs and mammals, whose descendants are still alive today.[1] The abrasive action of the tides, considered to be the world's highest, constantly exposes fossils on the cliff faces, shores and seabed.[3][4][5] (http://en.wikipedia.org/wiki/Wasson_Bluff)",
    "directions": "From Parrsboro, follow the Two Islands Road until you come up to the Wasson's Bluff parking lot.",
    "geohash": "f846",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/11897/reg_DSC-0207-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11897/reg_DSC-0222-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11897/reg_DSC-0224-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11897/narrow_DSC-0213-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11897/narrow_DSC-0223-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/wassons-bluff-near-parrsboro-ns-11897",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "3 km",
        "Town": "Parrsboro, NS",
        "Type": "out-and-back"
    },
    "title": "Wasson's Bluff",
    "trail_id": "11897"
}