{
    "description": "As far as early season hiking is concerned, this is a great option. It's close to Calgary, has fantastic scenery, and doesn't seem to be as crowded as some of the other more popular shoulder season hikes in the area.Old Baldy Ridge starts out at the Evan Thomas Creek Day use area. The first section in on an old road, stay left at the junction with the sign warning that the trail is not maintained after this point.  There are two cairns marking where the trail along the creek and up to the ridge starts. Right before the actual turn off there is a false trail that looks like the way to go but you quickly realize that it is headed back in the direction of the parking lot. Skip this one and keep going until you see the cairns. The usual route follows the creek all the way up the valley to a tarn, from there you could make the climb up to the ridge. The other option is to keep your eyes peeled for a route that stays left and starts a steep climb towards the top early on. We took this way and found it quite enjoyable. There is some serious elevation gain and then some navigating through a talus field but every so often the trees part and you are treated to stunning views. The trail levels out for a bit as you make your way along the edge overlooking the valley. A cairn marks a good place to stop for a snack on a ledge before you make the final accent to the top of the ridge.  The views are outstanding from the top as you overlook the Nakiska ski hill and Mount Allen. Unfortunately we didn?t get to stay long at the top. The warm May sun had given way to dark clouds and a bitter cold wind.  We ran into a small group of hikers that were overjoyed to hear that there was a secondary route. They had followed the Creek all of the way to where the tarn would normally be and warned us that the snow in the valley was ?waste deep? and there were huge sections of the trail taken out by the flood. We carried on as originally planned along the ridge then dropped down into the valley despite their warnings. If the tarn was there, it was completely covered in snow and not visible. There was still a fair bit of snow on the slope on the other side of the creek so we stayed high on our side to avoid a possible avalanche scenario. A bit of route finding was required due to the lingering winter conditions. At times we could see parts of the actual trail lower in the valley but we were content making our way through the talus fields that were pleasantly snow free instead. After a while we did meet back up with the trail and followed it out. There were a couple sections that were damaged but nothing that wasn?t manageable. The creek was beautiful on the way out but would have been even more enjoyable if you were hiking in that way. Overall I would say we had a great day. The accent was challenging enough to feel like you accomplished something but not so difficult that when you reach your destination you are too tired to enjoy the fruits of your labour. The views from the top are breath taking in all directions. A great shoulder season hiking option.Date: May 9, 2015Distance:14.6 km Elevation gain: 932 m",
    "directions": "From highway 1, turn down highway 40 and continue to the well-marked Evan Thomas day use area on the left side. Trailhead is well marked with signage.",
    "geohash": "c3n1",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/11891/long_Old-Baldy-Ridge-Mountain-Attempt-Kananaskis-Ridge-Feb-28-2016-8--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11891/long_Old-Baldy-Ridge-Mountain-Attempt-Kananaskis-Welcome-Feb-28-2016-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11891/reg_-DSC0052-50330.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11891/reg_Nakiska-50330.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11891/reg_Old-Baldy-50330.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11891/reg_Old-Baldy-Ridge-Mountain-Attempt-Kananaskis-Feb-28-2016-2--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11891/reg_Old-Baldy-Ridge-Mountain-Attempt-Kananaskis-Ridge-Feb-28-2016-14--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11891/reg_Old-Baldy-Ridge-Mountain-Attempt-Kananaskis-Ridge-Feb-28-2016-5--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11891/narrow_Old-Baldy-Ridge-Mountain-Attempt-Kananaskis-To-the-summit-Feb-28-2016-2--44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/old-baldy-ridge-near-calgary-ab-11891",
    "stats": {
        "Activities": "hike snowshoe",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 5,
        "Time": "6 hrs",
        "Total Distance": "15 km",
        "Town": "Calgary, AB",
        "Type": "out-and-back"
    },
    "title": "Old Baldy Ridge",
    "trail_id": "11891"
}