{
    "description": "The hike to the bottom of the four falls is quite easy as it flows an old clearing and then an old cart path.  The forest around the fall is a mature evergreen forest with a high canopy.  the first three falls are about 15, 5 and 5 feet each with the last and hidden one being at lest 70ft.  To get to the last one you have to climb a very steep slope and then follow the contour lines before dropping back at the base of the falls.  there seems to be enough depth at the base and between fall 2 and 3 to have a good soak in the summer time.NEW: there are two more waterfalls upstream of the traditional hidden fall.  Basically follow the brook upstream.  the first fall is accessible either through he river at a narrowing of the stream or you have to climb up on the left hand side (facing upstream) and then carefully find the one spot that you can actually climb down to the river...it is doable without a rope.   Afterward climb back p and make your way more upstream and drop back don to the stream side right ayer the waterfall and then follow it to the next 40-50ft fall!.  Afterward head up the steep slope on a western heading and drop down the tributary on the west side for some more smaller falls.",
    "directions": "Highway 2 to Parrsboro.  The stream to follow upstream bisects the highway at 45.428013, -64.255917",
    "geohash": "f8463",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/11894/reg_DSC-0150-27177_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11894/reg_DSC-0155-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11894/narrow_DSC-0158-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/hidden-falls-near-parrsboro-ns-11894",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 5,
        "Time": "2 hrs",
        "Total Distance": "6 km",
        "Town": "Parrsboro, NS",
        "Type": "out-and-back"
    },
    "title": "Hidden Falls",
    "trail_id": "11894"
}