{
    "description": "Edwards Rating: I (II) M LThis is an interesting scramble but very long day if you do that loop to hike almost all the way from the beginning of Kidd?s ridge. It will involve bushwhacking and route finding if you go up the same way we did, but you can and should take the turnoff after the 6th bridge (see pictures for the cairn) and go up/down the same way (our way down). You will save some energy and do 14 km instead of more than 16km. Even though ridge walk is awesome, the best views are at the summit, so you're not missing much. The approach is really nice and easy all the way just by the creek. TRAILHEAD: Galatea Creek parking lot is currently closed because they are building back the bridges and some of the trails after the flood in 2013, but they are not working on the weekend. Follow Lillian Lake?s trail all the way to the cairn, such is exactly 4 km from the parking lot. When you get to the only T-junction after a bridge, you take on your left and keep going on that trail up to the cairn to start off your scramble in a steep gully. Be careful, there are a lot of gullies, small creeks, snow patches and cliffs. We had to go down in two different gullies to make sure we were safe and crossing only the stable snow patches. You may want to do it later in June for an easier scramble.The 360 degrees views are incredible and the only section where there?s exposure and technical scrambling is on the last couple of hundred metres between the false and true summit. It may not be a problem at all without the snow patches, but you have to be really careful if you go sooner in the season like we did. Use my GPS track with care, some route finding skills are essential in the gullies. Total Elevation Gain for the loop = 1718 m, Net 1422 m and Max 2943 m.7 to 11 hours. We made it in 8 hours including a couple of breaks on our way up and a steady pace. Make sure you have at least 10 hours to do it.",
    "directions": "From Calgary, follow Trans-Canada Hwy/AB-1 W to Kananaskis Trail/AB-40 S. Take exit 118 and start your odometer for a 32.7 km drive to the Galatea Creek parking lot.",
    "geohash": "c3n1",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/11898/long_Mt-Kidd-South-Peak-Loop-Kananaskis-Gully-Down-May-31-2015-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11898/long_Mt-Kidd-South-Peak-Loop-Kananaskis-May-31-2015-11--44639_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11898/long_Mt-Kidd-South-Peak-Loop-Kananaskis-May-31-2015-31--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11898/long_Mt-Kidd-South-Peak-Loop-Kananaskis-Ridge-Walk-May-31-2015-5--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11898/long_Mt-Kidd-South-Peak-Loop-Kananaskis-Summit-May-31-2015-4--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11898/long_Mt-Kidd-South-Peak-Loop-Kananaskis-Summit-May-31-2015-7--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11898/narrow_Mt-Kidd-South-Peak-Loop-Kananaskis-Snow-Patches-Scree-Boulders-May-31-2015-1--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11898/narrow_Mt-Kidd-South-Peak-Loop-Kananaskis-Turnoff-May-31-2015-44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mount-kidd-south-peak-loop-near-kananaskis-ab-11898",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 4,
        "Time": "10 hrs",
        "Total Distance": "17 km",
        "Town": "Kananaskis, AB",
        "Type": "out-and-back"
    },
    "title": "Mount Kidd South Peak - Loop",
    "trail_id": "11898"
}