{
    "description": "This is a multi-day wilderness canoe trip along the Exploits River. There is only 2 short portages along this trip and the river is dam controlled to there is usually enough water to travel on it from spring to fall.  This can be fast moving river and experience canoeing is highly recommended.  The trip can be completed in 2 full days but I recommend 3 days for a more relaxing trip and extra time in case you run into trouble. Check with the dam operator in Millertown before starting your trip because high water can make this an unsafe river for the amateur and even the experienced canoeist.  There are few cabins along the river and cell service is not reliable so you must be able to self-rescue if you get into trouble.  There are not many places to camp along the river.  The only good site is located at Red Indian Falls on the river right.  To access the campsite and portage around Red Indian Falls I find it's easiest to portage on the river left (west side) and once you have made it passed the falls, cross the river and the campsite is on river right (east side) overlooking the falls.  The site is small so groups of 6 or more will have difficulty finding a place to set their tents.It is also a fair distance from the start so I recommend starting the trip early morning to give yourself ample time to reach Red Indian Falls.Approach Red Indian Falls with extreme caution!The town of Badger is a nice spot to camp on the second night and to refuel.  They also have an outfitters there that rents canoes and kayaks.  You can end your trip in badger or continue on to Riverfront Chalets.  The stretch from Badger to Riverfront Chalets has lots of fast water which can be run comfortably but be careful when doing through Badger rattles.  Portage around Badger Chute and then it's just a short paddle to Riverfront Chalets.",
    "directions": "The start of the river is located about 5 kms from Millertown down a dirt logging road. The road crossed the Exploits River just down stream from the dam.  There is a place to park and camp on the right hand side of the road as you cross the steel bridge. The end of the trip can be in either Badger or further down river at River Front Chalets.  River Front Chalets rents canoes and does whitewater rafting tours.  The owners are a wealth of knowledge.  Contact them before starting your trip if you have any questions.",
    "geohash": "f",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NL/11900/reg_red-indian-Falls-51785.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/11900/reg_red-indinad-falls2-51785.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/exploits-river-near-millertown-nf-11900",
    "stats": {
        "Activities": "river-canoe river-kayak",
        "From": "",
        "Seasons": "summer",
        "Stars": 4,
        "Time": "21 hrs",
        "Total Distance": "63 km",
        "Town": "Millertown, NF",
        "Type": "out-and-back"
    },
    "title": "Exploits River",
    "trail_id": "11900"
}