{
    "description": "Edwards Rating: I (I) M MThis is a nice and easy scramble with no technical challenge, no route finding and great views I heard, but it was snowing almost all day when we did it in June. The approach is easy and straight to Paget Lookout, a Parks Canada official trail. From the lookout, head north and scramble to the first high point you see and then you?ll see the false summit at that point (1st). There are a lot of cairns and trails everywhere, just pick one and you will be fine. You could go straight up with some good scrambling in rock bands if you?d like. The second one is 5 minutes away and is the official summit where the register is. From there, you can keep going to a higher point involving a nice ridge walk heading north but losing some elevation to get there (3rd). Return the same way, but you can avoid the summit and false summit for unnecessary elevation gain and just go along the crest on the west (right) side. We did that because the wind was very strong and cold that day and we couldn?t see much anyway with all that snow and clouds when walking the ridge.Elevation of 1016 m NET, 1135 m TOT and max 2624 m to the highest summit (2560 m True Summit), 2125 m for the Lookout 4 to 7 hours",
    "directions": "From Lake Louise, take Trans-Canada highway in direction to Field, BC. Start your odometer at the BC/Yoho National Park signs and drive for 5km. Take the road on your right to the Wapta Lake parking lot.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/11916/long_Paget-Peak-Field-Yoho-Just-Past-Lookout-Jun-13-2015-2--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11916/long_Paget-Peak-Field-Yoho-Just-Past-Lookout-Jun-13-2015-4--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11916/long_Paget-Peak-Field-Yoho-Ridge-Jun-13-2015-2--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11916/long_Paget-Peak-Field-Yoho-Ridge-Jun-13-2015-4--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11916/long_Paget-Peak-Field-Yoho-Ridge-Jun-13-2015-5--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/11916/long_Paget-Peaks-Field-Yoho-Sherbrooke-Lake-Mt-Ogden-Jun-13-2015-1--44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/paget-peak-3-summits-near-field-bc-11916",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 3,
        "Time": "5 hrs",
        "Total Distance": "11 km",
        "Town": "Field, BC",
        "Type": "out-and-back"
    },
    "title": "Paget Peak - 3 summits",
    "trail_id": "11916"
}