{
    "description": "This is a trail for both the adventurous and the rock hounds.  The first part of the trail is to follow the Cape Split trail but you soon veer off to your right and try to follow some orange flagging tape or better yet download the gps track and don't get lost  After rising a few hundred feet and transitioning from an evergreen forest to a leafy forest you will end up at the very long descent to the Bay of Fundy.At the top of the descent is a bucket with gloves....the ropes to get down are easier to handle with gloves so borrow a pair and make sure to leave them back once you return.   Usually I don't use unknown rope but this time around there is one or two spots that you kind of need to.  There is only one vertical spot of about 15 feet but there is enough foot and hand holds to make this manageable.Once on the sea floor go east for about 3km....it's basically the furthest point you can see.  Right around that corner lies amethyst cove where you should be able to find some good minerals.  However I found that the whole way there were good finds to make mineral wise.  There is also on the way there a really tall waterfall which I am told will be encased in ice...for the climbers out there its easily a few hundred feet high!",
    "directions": "The start is the cape split system but you soon veer off to follow some orange tape which may or may not be there.  The top of the rope system is approx at N45 19.412 W64 25.742",
    "geohash": "f841",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/11925/reg_DSC-0043-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11925/reg_DSC-0044-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11925/reg_DSC-0047-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11925/reg_GOPR1144-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11925/narrow_DSC-0038-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/11925/narrow_DSC-0045-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/amethyst-cove-near-wolfville-ns-11925",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 5,
        "Time": "4 hrs",
        "Total Distance": "10 km",
        "Town": "Wolfville, NS",
        "Type": "out-and-back"
    },
    "title": "Amethyst Cove",
    "trail_id": "11925"
}