{
    "description": "This is the full loop of Skyline 1, from the Spruce Bay parking lot (at Lightning Lake camp ground), clockwise around the loop, to the junction with Skyline 2, then down to Strawberry Flats, and back to Spruce Bay.June 27, 2015, a very hot day, you should wait for a cooler day, as long stretches are in the open sun.We initially parked at Strawberry Flats, hoping to hitch hike the 3 k to Lightning Lake campground, but no traffic at 9 am, so drove to Lightining Lake CG and parked in Spruce Bay beach area parking lot.Another option is to in park at Strawberry Flats, and walk or be patient and hitch hike to Lightning Lake CG, such that your car will be at SF 6-7 hours later when you arrive there and can avoid the 3 kms walk to LL CG.Headed south on the \"Skyline trail\" and followed the signs. Uphill started, through pleasant forest, and eventually came to open areas, including through forest fire burnt out areas. Very spectacular, including the views south, of Frosty Mountain and the Hozameen range and peak.3 summits to climb, and the 4th to circumvent. 4 hours till we came to the Hozameen view point, at the hunction with the Skyline 2 trail.By then we had risen 750 m, and 950 total ascent, over 8 kms, but stunning views.On our way to the junction, came upon an absolutely stunning, huge mountain meadow, covered with flowers. This was only 5 mins from the junction, so anybody coming up from Strawberry Flats should walk the extra 5-10 mins to this meadow.Walk down to Strawberry Flats is a pleasant but uninspiring gentle downhill. At SF, tried to hitch a ride to Lightning Lake CG, but once again, no traffic, so walked the 3 kms along the Gibson Road East trail.Total time: 6.5 hoursTotal ascent: 950 msNet ascent : 750 msDistance: 22kmsOverall, an absolutley amazing hike. No wonder it's called the \"jewel in the crown\" of Manning Park. Although the Heather trail on the north side of the highway is also spectacular, this one beats it.",
    "directions": "Drive to Manning Park (BC highway 3, 1/2 way between Hope and Princeton), take the road to Gibson Pass downhill ski area, and park at the Spruce Bay beach parking lot (Lightning Lake campground), or drive the 3 kms west to Strawberry Flats parking lot.",
    "geohash": "c2d",
    "photos": [],
    "source_url": "https://trailpeak.com/trails/skyline-1-manning-park-near-hope-bc-11939",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 5,
        "Time": "7 hrs",
        "Total Distance": "22 km",
        "Town": "Hope, BC",
        "Type": "out-and-back"
    },
    "title": "Skyline 1, Manning Park",
    "trail_id": "11939"
}