{
    "description": "Edwards Rating: I (II) S S for Limestone only with some hands-on scrambling you can avoidEdwards Rating: II (III, even IV) S M for the loop and Extension ridge to The Wedge: exposure-route finding-slabsThis is a very easy scramble technically if you want, but you can make it a moderate one with very nice hands-on scrambling on the ridge, slabby terrain on the Extension, route finding and bushwhacking on the way down by returning in one of the Extension?s gully. Limestone is easy and if you don?t try to take shortcuts, you can have a decent trail to the summit, even though not always that obvious.If you are taking the exact same trail than my GPS, you will need to be comfortable with slabby terrain scrambling and route finding. You will also have to cross the creek about three times and you will get on your way down. It?s definitely not the best option but it?s doable. Trailhead starts on the other side of the road about 50 meters away from it, left side of the creek. You will see a few orange flags once in a while but they aren?t great and some will lead you to the gullies south of your summit, not the best route (our way down). As long as you stay close to the creek and the valley where it lies down, you should be fine. When you get to the summit, you may want to do the Extension up to the Wedge and its impressive north face. From the summit, it takes about 2 minutes and you?ll have a weakness in the first rock band to climb down on your left. This is easy and interesting scramble but again it involves a bit of route finding. Once on the col, you can go up the north face of the Extension and climb on slabby terrain. If you do, it will definitely be more of a moderate scramble. You?ll arrive at the northern cairn of this ridge directly. If you can?t make it that way, keep going until you passed the slabs and go straight up the scree. Not as fun but easier if not comfortable with technical scrambling. There?s the second cairn in the middle of the ridge. We then kept going towards The Wedge wall until it became greatly exposed on a very narrow ridge. As a group, we had to turn back at that point but it would be very interesting if you like challenges. You can return the same way (probably much easier, but more mileage) or do as we did and go down the gully right under the last easy portion of that ridge. If you are not comfortable with scree-slabs-route finding, return the same way. You won?t need to go back to the Limestone summit as there will be a few weaknesses in the 2 rock bands below its ridge where you?ll be able to do some good hands-on scrambling back up to the ?official? trail.Elevation of 842 m NET, 1262 m TOT and max 2325 m to the highest point of the Extension (2171 m to Limestone Mountain Summit) 3 to 7 hours",
    "directions": "From Calgary, follow Trans-Canada Hwy/AB-1 W to Kananaskis Trail/AB-40 S. Take exit 118 and start your odometer for a 34.6 km drive and park at the pull-off right after the Rocky Creek bridge.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/11932/long_Limestone-Extension-kananaskis-Jun-20-2015-1--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11932/long_Limestone-Extension-kananaskis-North-Summit-Jun-20-2015-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11932/long_Limestone-Extension-kananaskis-Ridge-Walk-Jun-20-2015-1--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11932/long_Limestone-Extension-kananaskis-Summit-Jun-20-2015-2--44639_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11932/long_Limestone-Extension-kananaskis-To-Col-Jun-20-2015-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11932/long_Limestone-Mountain-Extension-kananaskis-Jun-20-2015-1--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11932/narrow_Limestone-Extension-kananaskis-Ridge-Walk-to-The-Wedge-Jun-20-2015-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11932/narrow_Limestone-Extension-kananaskis-Slabs-Down-the-Extension-Jun-20-2015-2--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11932/narrow_Limestone-Mountain-kananaskis-Incredible-Scramble-Jun-20-2015-3--44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/limestone-mountain-extension-near-kananaskis-ab-11932",
    "stats": {
        "Activities": "hike snowshoe",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "5 hrs",
        "Total Distance": "7 km",
        "Town": "Kananaskis, AB",
        "Type": "out-and-back"
    },
    "title": "Limestone Mountain & Extension",
    "trail_id": "11932"
}