{
    "description": "Edwards Rating: II (II) M MElevation of 718 m NET, 1002 m TOT and max 2452 m (Belmore Browne at 2351 m)I would rate that scramble as easy if it wasn?t for the 2013 flooding that destroyed half the trail. We did bushwhack a bit on the way up but saved a lot of time by staying in the creek bed as much as possible on the way down.Trailhead & trail: We just added a cairn with a wood stick to help people find the best possible way down to the cutline, just after a large cutblock. It is at about 13.8 km on Powderface Trail from the 68 South?s junction. You will park a little further where there?s enough place on the side of the road and walk back to the trailhead. Follow the cutline up to a point where you can cross over the creek on your right. Take the cutline on your left until it turns left again, cross the creek and start your way up the creek by staying on its left side until it dries-up. As soon as you can, start scrambling up into the creek bed. When it opens wide at the end of the creek, hike up the scree slope on your right and you?ll reach your first summit, Belmore Browne. There are a few rock bands you can walk on to save some energy. Once you?ve reached the summit, you will easily see two summits on your left (west), heading to the second one is the highest point of Boundary Ridge. Coming back, you may want to stay low and bypass Belmore Browne and the other summit by going to the col and slide down a decent scree slope back to the creek bed.",
    "directions": "From Calgary, follow Trans-Canada Hwy/AB-1 West and take exit to Sibbald Flats, Highway 68 South. Drive 23 km to and turn left on Powderface Trail. Start your odometer for about 13.8 km where you should see our cairn on the right side of the road. Pull over a few hundred metres later where you can park along the road and walk back to the trailhead.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/11945/long_Belmore-Browne-Peak-Boundary-Ridge-West-Bragg-Creek-Down-June-28-2015-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11945/long_Belmore-Browne-Peak-Boundary-Ridge-West-Bragg-Creek-Welcome-2-right-ones-June-28-2015-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11945/long_Belmore-Browne-Peak-West-Bragg-Creek-Summit-June-28-2015-1--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11945/long_Belmore-Browne-Peak-West-Bragg-Creek-Summit-June-28-2015-2--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11945/long_Boundary-Ridge-West-Bragg-Creek-Summit-June-28-2015-2--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11945/long_Boundary-Ridge-West-Bragg-Creek-Summit-June-28-2015-3--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11945/long_Boundary-Ridge-West-Bragg-Creek-Summit-June-28-2015-5--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11945/long_Boundary-Ridge-West-Bragg-Creek-Walk-June-28-2015-2--44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/belmore-browne-peak-boundary-ridge-near-kananaskis-ab-11945",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 4,
        "Time": "6 hrs",
        "Total Distance": "12 km",
        "Town": "Kananaskis, AB",
        "Type": "out-and-back"
    },
    "title": "Belmore Browne Peak & Boundary Ridge",
    "trail_id": "11945"
}