{
    "description": "Edwards Rating: II (IV) S MElevation of 1153 m NET, 1243 m TOT and max 2669 m5 to 7 hoursGPS track is excellent, no bushwhacking and very few route finding on the rubbly slope.This is mostly an easy hike up to the summit block with an obvious trail and decent elevation. We found the approach quite long since it?s in the forest most of the time so it takes a while before you start enjoying the views. But it is worth it for the last portion where scramble begins on the East side of the summit block, under the false summit & with a short but challenging ridge walk.Take the Wedge Pond trail for a few meters until you see a first picnic table where you turn left. You?ll take an obvious gravel trail from there. Just a few meters later, you?ll see the trailhead going into the forest on your left. This takes only 1-2 minutes to get there. The trail will split after a few hundred meters, keep right. You will follow a watercourse turning into a creek on your way up and want to stay always on its left. You will start to take more elevation and get to a green slope where you will finally have some great views and head up to the Northeast face of The Wedge. At that time, you are facing the false summit with Limestone Mountain on its right.Once you reach the Northeast face, keep going south until you pass the wall and try to find your way up the right edge to eventually scramble up a decent scree slope to the false summit. From there, head south to the real summit 15-20 minutes away. After just a minute, you will climb down the crux where there is great exposure, but rock is good and there?s really only 2-3 metres where it becomes really narrow. Finally, it?s a nice an easy ridge walk to your summit.",
    "directions": "From Calgary, follow Trans-Canada Hwy/AB-1 W to Kananaskis Trail/AB-40 S. Take exit 118 and start your odometer for a 30 km drive to The Wedge Pond parking lot on your left.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/11952/long_The-Wedge-Kananaskis-Scramble-begins-Jul-3-2015-2--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11952/long_The-Wedge-Kananaskis-Summit-View-False-Summit-Crux-Jul-3-2015-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11952/long_The-Wedge-Kananaskis-Summit-Views-Jul-3-2015-3--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11952/long_The-Wedge-Kananaskis-View-of-False-Summit-Jul-3-2015-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11952/long_The-Wedge-Kananaskis-Welcome-Very-first-peak-left-is-The-Summit-Jul-3-2015-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11952/reg_The-Wedge-Kananaskis-The-Valley-Jul-3-2015-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11952/narrow_The-Wedge-Kananaskis-Ridge-Scramble-The-Crux-Jul-3-2015-2--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11952/narrow_The-Wedge-Kananaskis-Ridge-Scramble-The-Crux-Jul-3-2015-3--44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/the-wedge-near-kananaskis-ab-11952",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 3,
        "Time": "6 hrs",
        "Total Distance": "8 km",
        "Town": "Kananaskis, AB",
        "Type": "out-and-back"
    },
    "title": "The Wedge",
    "trail_id": "11952"
}