{
    "description": "Edwards Rating: II (III) M MELEVATION of 1026 m NET and max 2817 m5 to 8 hoursThis is a superb scrambling with an easy approach by Buller Pass trail, very few and easy bushwhacking and the crux being 2 long slabs on the last portion of the summit ridge. We actually went up way too soon in an avalanche gully and walked the ridge, often loosing elevation and sidesloping under or straight through impressive cliffs and rock bands all along to the col. Our GPS track is only showing our way down, the easiest way to go.From the first bridge just after you crossed the road from the parking lot, hike up Buller Pass for approximately 2.4 km and look to your left where you will see the col you want to go to for the final ascent to the summit. It will involve a bit of bushwhacking but there are a few good trails most of the time and this is mostly easy scrambling. Another option is to keep going on Buller Pass for a total of 3.1 km instead and start from that dried-up creek bed on the left side of the third bridge. Once you've reach the col, you'll see an obvious scree trail on your right and will eventually reach out the first slab. We got extremely lucky as it was raining most of our way up but it changed drastically before we got to the slabs with a sunny and cloudy sky and dry slabs. Even though theses slabs may look impressive, I would walk directly on them being careful with the bit of scree covering some of them. On the right side is a path going around one of these slabs but rock is quite loose and it didn?t feel safe at all on the way up.",
    "directions": "From Canmore Bow River Bridge, take the Smith Dorrien Trail for 35.4 km and park at Buller picnic area on your right.",
    "geohash": "c3jc",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/11966/long_Mount-Buller-Ridge-Kananaskis-Crux-2-big-Slabs-Jul-12-2015-2--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11966/long_Mount-Buller-Ridge-Kananaskis-From-the-Ridge-Jul-12-2015-1--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11966/long_Mount-Buller-Ridge-Kananaskis-Ridge-Scrambling-Jul-12-2015-5--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11966/long_Mount-Buller-Ridge-Kananaskis-Summit-Jul-12-2015-3--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11966/long_Mount-Buller-Ridge-Kananaskis-Summit-Jul-12-2015-7--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11966/long_Mount-Buller-Ridge-Kananaskis-Summit-View-of-Lougheed-3-Sisters-Jul-12-2015-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11966/reg_Mount-Buller-Ridge-Kananaskis-We-seen-6-Bighorn-Sheeps-Jul-12-2015-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11966/narrow_Mount-Buller-Ridge-Kananaskis-Ridge-Scrambling-Jul-12-2015-1--44639_best1_.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mount-buller-near-kananaskis-ab-11966",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 5,
        "Time": "6 hrs",
        "Total Distance": "10 km",
        "Town": "Kananaskis, AB",
        "Type": "out-and-back"
    },
    "title": "Mount Buller",
    "trail_id": "11966"
}