{
    "description": "Edwards Rating: III (IV) M L (including complete ridge walk)ELEVATION of 1170 m NET, 1665 m TOT and max 2485 m8 to 12 hoursThis is a ?real? scramble: bushwhacking, route finding, hands on, scree, rockfall, cliffs & rock bands, exposure, etc. It?s not that easy to find a trail from the parking lot to the top, you really need to make it your own by aiming to get close to the impressive north buttress first and then, sidesloping in the gigantic bowls  to an easy to moderate way up the ridge. We added to the trip a complete ridge walk from the summit far south to the top of the north buttress before heading back down. The ridge is exposed with lose rocks to make it more challenging and definitely a difficult scramble overall.From the parking lot, take your time to visualize your way up the little hump on your left and to that crest leading to the north buttress. Head south on an obvious trail for a few minutes until you get to the Trans-Canada trail and then turn left. Keep walking on that trail until you passed the rock face on your right and turn right to start your ascent. There are a lot of animal trails, good ones. But it is confusing and you will hopefully come across a few orange flags that are great indicators as well as some cairns at a certain point. You are mostly on your own on that scramble, so make sure you can bushwhack up to that buttress anyways. Our GPS track is not perfect but good enough and bushwhacking was much easier on our way down, the trail that starts a little further East on the Trans-Canada trail. Once passed the hump, you will get an open view on the north buttress where you want to go. About 50 metres before you get there you will be able to start sidesloping to your right in the immense bowl facing Pigeon Mountain. There are 2 possible trails once you are done with that first bowl. You can scramble up lose rocks and try to get to the ridge right away (difficult scramble but much faster, we didn?t try it) or lose some elevation and keep going in the second bowl until you see an easy opening on a scree slope to your right that will eventually lead you to the middle of the summit block. Scramble up that slope where you?ll find a few cairns to help you out throughout the rock bands. From the middle of that slope, you will easily see a trail going slightly to your right to reach the ridge. Once it opens up on the green slope and the summit on your right, walk up to the ridge and stay on it if you can as there will be some exposure. There is one section where boulders felt and it seemed too dangerous to us, about 10 metres before the summit. We just scrambled down to the right and back up a few metres later to complete our ascent.From the summit, you can complete the ridge walk to the north for incredible views and moderate scrambling. We went up to the highest point north and then on the top of the buttress north-west. We lost a bit of elevation and stayed on the right side of the ridge to come back to the scree slope leading to the second bowl. The way down was much easier and we came across a lot of cairns and flags.",
    "directions": "From Calgary, follow Trans-Canada Hwy/AB-1 W and take exit 98 toward Dead Man?s Flats. Turn right after the garage on 2 St. and then on your right again on 2 Ave to get back to Highway 1 towards Calgary. Start your odometer before taking the ramp for 3.6 km on the highway up to a small lot on your right.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/11965/long_Mount-McGillivray-Canmore-Bowls-to-traverse-Jul-11-2015-1--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11965/long_Mount-McGillivray-Canmore-Impressive-Summit-Block-North-buttress-Jul-11-2015-1--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11965/long_Mount-McGillivray-Canmore-Jul-11-2015-2--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11965/long_Mount-McGillivray-Canmore-Lac-Des-Arcs-Jul-11-2015-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11965/long_Mount-McGillivray-Canmore-Nice-scrambling-Ridge-Jul-11-2015-5--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11965/long_Mount-McGillivray-Canmore-Nice-scrambling-Ridge-Jul-11-2015-6--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11965/long_Mount-McGillivray-Canmore-Ridge-view-Pigeon-Canmore-Jul-11-2015-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11965/long_Mount-McGillivray-Canmore-View-Summit-Jul-11-2015-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11965/narrow_Mount-McGillivray-Canmore-Nice-scrambling-Ridge-Jul-11-2015-7--44639_best1_.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mount-mcgillivray-ridge-walk-near-canmore-ab-11965",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 4,
        "Time": "11 hrs",
        "Total Distance": "16 km",
        "Town": "Canmore, AB",
        "Type": "out-and-back"
    },
    "title": "Mount McGillivray & Ridge Walk",
    "trail_id": "11965"
}