{
    "description": "NTS Map:92D13.  Mt. Prevost near Duncan -- Vancouver Island, can be shuttled up and biked down at lightning speed! With several choice routes to descend,  it can be suitable for relative-novice to extreme & professional,  it has fast flowy earthy trails, with beautiful vegetation, some parts are built up with ladders, stunts and jumps, and the view from the top is stupendous--on any given day in the spring you will find various hand gliders and paragliders launching from up top and many hikers along the way... to hike/bike up is about 2 hours (or 15 minutes drive) and the route down is anywhere from 14 minutes to 35 depending on your skill/speed. Many bikers choose to shuttle and find that 3 to 4 runs makes for a good day! Mt. Prevost is typically closed in the dry hot months but is awesome in the Fall, Spring and well into the winter--it is truly worldclass!Note:  The GPS data provider says:  We went up a biking trail and bushwhacked some down hoping to find a new trail but without success, found bears instead and ended up eventually on a road (pity).",
    "directions": "Mt Prevost is accessed off Somenos Rd just north of hwy 18, and about 2 k west of Hwy 1. Follow and park by gates to hydro station and wind your way up the gravel road to the top. Follow the signs to \"cairn\" there are a few lefts and rights as you ascend (not difficult) as I recall, but, a better option is to hook up with Iguana Ranch Guesthouse who will shuttle you and ride with you. You'll see the parking area up top, the trail entrance is obvious (in the cleavage between the two peaks), a well ridden path taking you down the main trail. A GPS track would be really sweet! Where to Stay:A good place to stay, with it's own MTB park on their 8 acre B&B is the nearby www.iguanaranch.com , wicked stunts.  Anita and Paul are your hosts, Anita cooks gourmet vegetarian, Paul is a semi-pro rider who will give you a few tips.  Never seen anything like it, and it's budget oriented.",
    "geohash": "c",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/1196/reg_IMG-1124-1-31886.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1196/reg_IMG-1127-1-31886.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1196/reg_IMG-1130-1-31886.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1196/reg_IMG-1140-1-31886.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1196/reg_mt_prevost_bc.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1196/reg_mtp1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1196/reg_mtp2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1196/topo_wildblueyondersmall.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1196/narrow_IMG-1129-1-31886.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mt-prevost-near-duncan-bc-1196",
    "stats": {
        "Activities": "hike mtn-bike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 5,
        "Time": "5 hrs",
        "Total Distance": "10 km",
        "Town": "Duncan, BC",
        "Type": "out-and-back"
    },
    "title": "Mt Prevost",
    "trail_id": "1196"
}