{
    "description": "Goldstrike Canyon is an exciting and scenic hike with the added pleasure of hot springs. There majority of the hike is scrambling up and over large boulders then ends at the Colorado River.  The trail starts out as an easy walk through a beautiful red canyon, not too far from the trailhead you start to encounter large boulders that must be navigated around/over. Some have ropes to assist but must most are just good old fashion scrambling. These continue for the majority of the trail and seem to get progressively more difficult as you get closer and closer to the end. After not too long, hot spring start showing up. Some of the pools are large enough to lounge in and are extremely hot. After more boulders and several hot pools you finally get to the end, the Colorado River. There is an area where the hot water from the springs flows into the cool river, here you can easily wade across to some sitting rocks. People were jumping off the rocks into the relatively slow moving river to cool off. Bringing a pair of sandals or water shoes is recommended as the rocks are very sharp and don?t feel great on the bare feet. Beware, apparently this trail is good midweek but on the weekend it is insanely busy, leading to bottlenecking at some of the more difficult sections. Unfortunately, people camp on the lower section of the trail, you can see evidence of this by the accumulation of garbage, fire rings and places that people must have mistaken for their own personal toilet (seriously, watch your step!).Despite the negative human factor, this is a great hike with beautiful scenery and excitement around every boulder. Real hiking boots are a must to get over the slippery rocks and I would not recommended this trail if you don?t enjoy easy to moderate scrambling. Take more water than you think you will need, there have been fatalities on this trail due to dehydration and heat exhaustion. Trail is closed during summer months for this reason.Distance: 9.2 kmElevation: -/+ 282 m",
    "directions": "To get to Goldstrike Hot Springs trail drive down the Great Basin Highway, take Exit # 2 toward Goldstrike Canyon. After a short drive down Route 172, take the first left turn on to Goldstrike Canyon Road and drive until the old dirt road dead ends into the parking lot for the trail.",
    "geohash": "9qqku",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/NV/11974/narrow_Goldstrike-32-50330.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/goldstrike-canyon-near-boulder-city-nv-11974",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall winter spring",
        "Stars": 4,
        "Time": "5 hrs",
        "Total Distance": "9 km",
        "Town": "Boulder City, NV",
        "Type": "out-and-back"
    },
    "title": "Goldstrike Canyon",
    "trail_id": "11974"
}