{
    "description": "Edwards Rating: IV (V) M MElevation of 1365 m NET and max 3083 m, total between 1400-1500 m 7 to 11 hoursGPS TRACK BUG: The straight line you see is obviously not a part of the route, there's a bug when I upload it. This is an incredible and challenging scramble with a lot of fun hands-on, climbing, route finding, bushwhacking and awesome views! It is difficult in many ways and you absolutely need route finding skills from the beginning to the summit.Trailhead: None really. Just start in the drainage where you parked for about 45 minutes to an hour. If you have a GPS, start hiking up to your left after 1.8 to 1.9 km. I strongly suggest that you download my GPS track. It?s not perfect but I modified it to leave only the best of the routes we did up and down. When hiking up, just gain elevation and try to get out of the forest as soon as you possibly can, you can absolutely sideslope for a while as well to get closer to the summit block. You will soon arrive in a grassy field with flowers and a great view of Spray Lakes in the back, with the impressive summit block in front of you. Stay out of the forest and to the right of the summit block. There you have two options (see GPS track). First, you can take the scree slope on your left and gain elevation with a bit of climbing in the middle of the slope. Once you?ve passed that rock band, you get straight up to the cliff band and then follow it to the right for a few minutes. That?s when you will see an opening between pinnacles with some superb hands-on scrambling and one pitch of climbing. There are some loose rocks, be careful and wear a helmet if possible. The second option is to keep right as much as you can to go around a cliff band and up in the bowl between summit I and II. It?s easier technically but you?ll have more scree there, ideal for the way down but a bugger going up. Once you?ve scrambled and climbed up that gully in between the pinnacles, you?ll see a few cairns in the large bowl leading to the ridge walk. The cairns far right are better to rely on when you go down since we were looking for some ok to good scree to slide down and added most of these cairns. On the way up, you?d rather look on the left side of that bowl and do some great hands-on/climbing up to the ridge, with some decent weaknesses in the rock bands and slabs you?ll go through. Once at the ridge, stay on it for some exposed climbing moves or look for a decent trail on its right. We actually mixed both and ended up doing about 90% of the ride walk straight on it. It?s a little longer sidesloping but better if you don?t like great exposure and narrow ridge walks. You will have to come back up to the ridge in a gully with again, a mix of rocks and scree. You will see your summit only in the last few meters once back to the ridge. We wanted to do the traverse (3, maybe the 4 peaks), but we did way too much route finding and it became too risky to go on time wise. Again, I strongly recommend wearing a helmet and downloading our GPS track. I made sure it avoids bushwhacking and gives you 2 options most of the time as for scrambling in the slopes and summit block.",
    "directions": "From Canmore Bow River Bridge, take the Smith Dorrien Trail for about 22.2 km. Then make a u-turn to park on the left side of the road, by the obvious drainage.",
    "geohash": "c3",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/11971/long_Mount-Lougheed-I-NW-Summit-Kananaskis-Incredible-Scrambling-Jul-19-2015-15--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11971/long_Mount-Lougheed-I-NW-Summit-Kananaskis-Incredible-Scrambling-Jul-19-2015-19--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11971/long_Mount-Lougheed-I-NW-Summit-Kananaskis-Incredible-Scrambling-Jul-19-2015-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11971/long_Mount-Lougheed-I-NW-Summit-Kananaskis-Jul-19-2015-22--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11971/long_Mount-Lougheed-I-NW-Summit-Kananaskis-Jul-19-2015-59--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11971/long_Mount-Lougheed-I-NW-Summit-Kananaskis-Lots-of-Hands-on-Jul-19-2015-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11971/long_Mount-Lougheed-I-NW-Summit-Kananaskis-Our-Peak-Jul-19-2015-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11971/long_Mount-Lougheed-I-NW-Summit-Kananaskis-Ridge-Summit-Jul-19-2015-6--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11971/long_Mount-Lougheed-I-NW-Summit-Kananaskis-Welcome-Jul-19-2015-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11971/reg_Mount-Lougheed-I-NW-Summit-Kananaskis-Exposed-Ridge-Jul-19-2015-1--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11971/reg_Mount-Lougheed-I-NW-Summit-Kananaskis-Exposed-Ridge-Jul-19-2015-4--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11971/reg_Mount-Lougheed-I-NW-Summit-Kananaskis-View-Summit-II-Jul-19-2015-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11971/narrow_Mount-Lougheed-I-NW-Summit-Kananaskis-Incredible-Scrambling-Jul-19-2015-1--44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mount-lougheed-i-nw-summit-near-kananaskis-ab-11971",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 5,
        "Time": "8 hrs",
        "Total Distance": "12 km",
        "Town": "Kananaskis, AB",
        "Type": "out-and-back"
    },
    "title": "Mount Lougheed I - NW Summit",
    "trail_id": "11971"
}