{
    "description": "An up and down hike on Mont Ste Anne ski resort, north east of Quebec City, with great views of the St Lawrence River, Ile d'Orléans, the surrounding hills and countryside.It starts right at the bottom of the gondola for Mont Ste Marie ski hill, and ends at the same spot. The way up we chose is a \"blue\" trail, that is, medium diffculty. It is called \"Sentier des Pionniers\" (Pioneers' Trail) and is a 4 km climb of approx 600 m elevation gain from the base of the gondola (200 m) to the summit (800 m). It rises through forest, with the occasional opening with great view points as it crosses ski slopes.At the top, make sure you enjoy the views of the river, the island and the surrounding countryside, with villages and hills, from the deck. If you're ready for lunch, a good spot.On the way down, we followed easy service roads and ski slopes, generally \"Le chemin du Roy\" (the King's Road).",
    "directions": "Drive approx 45 kms north east of Quebec City on hways 40 (or 440) and then 138, arrive at Mont Ste Anne ski resort, turn left on rue Beau Mont, and drive up to near the gondola. OK to park on the road from May 1 to Nov 15 (but not during ski season)",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/QC/11984/long_TP1180024-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/11984/long_TP1180039-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/11984/long_TP1180044-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/11984/narrow_TP1180015-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/11984/narrow_TP1180031-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/11984/narrow_TP1180036-7359.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mont-ste-anne-near-mont-st-anne-pq-11984",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 3,
        "Time": "3 hrs",
        "Total Distance": "11 km",
        "Town": "Mont St. Anne, PQ",
        "Type": "out-and-back"
    },
    "title": "Mont Ste Anne",
    "trail_id": "11984"
}