{
    "description": "Hike through beautiful woods, subalpine meadows, and glacial moraines to a viewpoint over Iceberg Lake. Hike this in Mid-August for the Wildflowers or in September for the fall color and solitude.This hike starts out at the Bird Creek Meadows Trailhead off of BIA Road 208 / Bench Lake Road. It starts out on an extra wide trail, that at once was a access road to the Bird Creek Meadows Picnic Area. This doesn't feel like a road, though. At the first junction you come to, go right to take the Hellroaring Trail, which is no longer wide like the old roadbed trail. At about halfway up the Hellroaring Trail, you will come to the infamous Hellroaring Canyon Overlook. Mount Adams reveals itself in all it's icy glory! This is a dramatic overlook into an enormous canyon, bounded on the opposite side by the serrated Ridge of Wonders. Gazing up the canyon, you will spot Hellroaring Falls cascading off Mazama Glacier on Mount Adams' southeast flank. Looking down the canyon, you will see Bench Lake, Hellroaring Meadow, and Little Mount Adams (a volcanic cinder cone).After taking in the view at Hellroaring Overlook, look for a continuation of the trail heading directly up the mountain. This is the unmarked Sunrise Camp Trail #20. This trail is far less maintained, but fairly easy to follow. After passing through some pretty subalpine wildflower meadows, and perhaps herds of mountain goats (we saw more than 20 goats on Labor Day) you will break out above treeline and into a world of rock and ice. The trail eventually starts to climb up a glacier moraine in very, very short switchbacks. The trail will then top out on a saddle at the top of the moraine ridgeline. Hike left along the moraine's ridgeline, making your way upwards. You will soon come to an orange \"X\" painted on a rock on your right (towards the mountain). This \"X\" marks the junction to either Iceberg Lake (and eventually Sunrise Camp), or an epic viewpoint of Iceberg Lake and Mount Adams from the top of the moraine's ridgeline. Choose one, or do both. The trail continuing up to the moraine viewpoint \"summit\" is somewhat steep, (no steeper than the trail ascending the moraine earlier, though), and ascends in a series of extra tight switchbacks no wider than a few feet. The view over Iceberg Lake and Mount Adams' glaciated southeast flank is absolutely breathtaking.",
    "directions": "From the Y junction at Trout Lake, go right on the Mt. Adams Rec. Highway for Randle and the Mt. Adams Recreation Area.After 1.3 miles, keep right at the junction with FR 23 for the South Climb, Bird Creek Meadows, and Sno-Parks (FR 82).In 0.6 miles, keep right again for Bird Creek Meadows and the Sno-Parks.In 2.7 miles, the road turns to gravel. Keep right at the junction for Smith Creek Sno-Park and Bird Creek Meadows.Go 6.4 miles, entering Tract D of the Yakama Reservation, and keep left at a junction for Tract D.Head up on a narrow, dusty road for 4.1 miles to the pay station ($5/vehicle) for Tract D (See Mirror Lake to your left).Continue straight for 1.1 miles until you reach the Bird Creek Meadows Trailhead (Note: this is NOT to be confused with the alternative Bird Lake Trailhead, used for the Bird Creek Meadows Loop Hike).",
    "geohash": "c21ws",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/WA/11986/reg_IMG-8909-52856.jpg",
        "https://trailpeak.com/storage//content/trails/US/WA/11986/reg_IMG-8963-52856.jpg",
        "https://trailpeak.com/storage//content/trails/US/WA/11986/reg_IMG-8977-52856.jpg",
        "https://trailpeak.com/storage//content/trails/US/WA/11986/reg_IMG-8978-52856.jpg",
        "https://trailpeak.com/storage//content/trails/US/WA/11986/reg_IMG-8981-52856.jpg",
        "https://trailpeak.com/storage//content/trails/US/WA/11986/reg_IMG-8985-52856.jpg",
        "https://trailpeak.com/storage//content/trails/US/WA/11986/reg_IMG-8989-52856.jpg",
        "https://trailpeak.com/storage//content/trails/US/WA/11986/reg_IMG-8996-52856.jpg",
        "https://trailpeak.com/storage//content/trails/US/WA/11986/reg_IMG-8998-52856.jpg",
        "https://trailpeak.com/storage//content/trails/US/WA/11986/reg_IMG-9016-52856.jpg",
        "https://trailpeak.com/storage//content/trails/US/WA/11986/reg_IMG-9018-52856.jpg",
        "https://trailpeak.com/storage//content/trails/US/WA/11986/reg_IMG-9047-52856.jpg",
        "https://trailpeak.com/storage//content/trails/US/WA/11986/reg_IMG-9058-52856.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/iceberg-lake-near-trout-lake-wa-11986",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 5,
        "Time": "4 hrs",
        "Total Distance": "9 km",
        "Town": "Trout Lake, WA",
        "Type": "out-and-back"
    },
    "title": "Iceberg Lake",
    "trail_id": "11986"
}