{
    "description": "A wonderful trail, much of it along the Ste Anne river, near Mont Ste Anne ski resort, north east of Quebec City.This is a one way trip, that requires 2 cars, or at least a 7 km drive from Mont Ste Anne to St Ferreol les Neiges, where the trail starts (or ends).If you have only 1 car, my suggestion is you try to get a drive, by taxi or otherwise, east along highway 360, from Mont St Anne to the trailhead in the centre of St Ferreol les Neiges, across from the little grocery store, Marché Mont Ste Anne at 1899 Boulevard les Neiges (Hway 360) in St Ferreol. This will avoid having to retrieve your car after the hike.The highest point on the trail is at the trailhead in St Ferreol, at 320 m. There  is an initial 160 m drop down to the river over the first km, then lots of ups and downs along the Ste Anne river. The highlight is probably the 2 suspension bridges, which take you to the east bank of the river and back between kms 8 and 9 (we travelled from km 13 down to 0). There are also several viewpoints with great views of the river and surrounding hills.We got slightly lost at the top of a hill near km 7. Lost the red/white markers, but we remembered the river was on our left (east), we kept going that way and eventually found the trail again, with little or any overall loss of time.Between kms 5 and 4, at the top of a hill after having crossed a stream on a wooden bridge, found a great spot for lunch, including chairs and a sunbrella.Trail ends back at hway 360, near the parking lot of St Ferreol golf course. Mont Ste Anne Village is approx 400 m west (left as you arrive at the road).",
    "directions": "Drive 40 kms or so east from Quebec City on Highways 40 and then 138 to Mont Ste Anne. For the rest of the directions, see in description above.",
    "geohash": "f2m",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/QC/11983/long_TP1170938-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/11983/long_TP1170965-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/11983/long_TP1170969-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/11983/long_TP1170972-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/11983/narrow_TP1170947-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/11983/narrow_TP1170967-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/11983/narrow_TP1170970-7359_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/11983/narrow_TP1170997-7359.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/sentier-mestashibo-near-beaupre-pq-11983",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "5 hrs",
        "Total Distance": "14 km",
        "Town": "Beaupre, PQ",
        "Type": "out-and-back"
    },
    "title": "Sentier Mestashibo",
    "trail_id": "11983"
}