{
    "description": "A moderate to difficult hiking loop that mostly follows ATV trails through forest and along lakes.  20km long, with a short side jaunt to visit an incredibly huge erratic rock that has split into 4 large chunks.  Many options to crown land camp at primitive sites on the lakes.Trail starts at the beach on Round Schooner lake: you can launch your boat/canoe from Long Schooner boat launch to get to Round Schooner.  Road access fee applies for any vehicles travelling and parking at Long Schooner.  Visit North Frontenac Parklands website for permit details.  You can also choose to camp on either of the Schooner Lakes, camp permit must be purchased as these roads and campsites are maintained by the township.Beginning portion of the trail is a single path through the forest heading North to Crag lake.  Most of the trail is flagged with tape, and GPS would be useful as you may be bush wacking part of this trail until you reach an ATV trail at Crag Lk.  There are two crown land campsites on Crag Lk.From Crag Lk, you will be following the ATV trail alongside the lake and then through the forest until you reach Snake Lk.  There is a Trapper's cabin here and the trail runs right through the property.  Most of the trail is quite rugged, and you will be going up and down in elevation.  There are numerous other ATV trails crisscrossing the landscape, so the GPS is necessary to stay on course.From Snake Lk, the trail continues to Sullivan.  The trail ends at a nice campsite at the lake.  Estimated hiking time to Sullivan is 2.5 - 3hrs.  Crag and Sullivan are both stocked Brook trout lakes.  I recommend spending the night at Sullivan.A few hundred yards away, at the east end of the lake, tucked into the forest, is a large erratic rock that you will want to check out.  The ATV trail goes by it, then ends at Snowshoe lake.  Lots of big boulders in the area.At this point, you can backtrack or take the longer section of the loop to get back to your boat.  Again, using the GPS as your guide, you will be following an ATV trail to Little Green lake.  The terrain is mostly downhill - somewhat steep at times, until you reach the lake.  The water is a brilliant green colour, and there is a make-shift campsite.  Just up the hill is a hunt camp and their water intake line crosses over the trail.  Please be mindful that in the fall, there will be a lot of ATV traffic  and hunters will be out.From Little Green Lk you are heading towards the hydro line.  You will pass Turtle Lk and Knotty Pine Lk - although you can barely see them from the trail, and a bush wack would be in order if you wanted a peek.  You will join the hydro line at Dodge Lk.  From here the ATV trail becomes a dirt road and you may find people \"car camping\" at Dodge.  About 3kms later, you  will be back on an ATV trail and beginning the long ascent up to Crag Lk.  With an elevation change of 400ft, this is definitely a lung buster.  A rest stop at the lake will be welcomed!   From here, you will be bush wacking a bit until you find the flagging tape marking your trail back to the beach.  There is a campsite next to the beach, so you may end up there due to a second trail being flagged from the site.  This leg of the trip is about 13.5km and takes about 4-5 hours.  You will want to plan a few snack and water breaks a long the way.Note: these ATV trails are very rugged and technical.  This is typical Canadian Shield topography with lots of rock outcrops, tree roots, small lakes and marshes.  In the spring you will likely encounter muddy sections of trail.Wildlife seen on the trail: Chipmunks, Red Squirrels, Grouse, White-tail deer, Loons, Woodpeckers.  Moose and wolf tracks seen.  Black bear- while not seen, they are definitely in the area and you should hang your food bag when camping.",
    "directions": "Plevna ON: Mountain road to Long Schooner boat launch.  (Road permit required).  Boat into Round Schooner and leave boat at the beach.OR: you can drive the hydro line down from Mountain Chutes and park near Dodge Lk and join the loop there.  If you have a backroads map, you may be able to locate other 4 wheel drive roads that intersect with the hydro line road further southwest.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/ON/11998/reg_IMG-0292-53021.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/11998/reg_IMG-0294-53021.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/11998/reg_IMG-0299-53021.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/11998/reg_IMG-0302-53021_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/11998/reg_IMG-0314-53021.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/crag-sullivan-lake-hiking-loop-20km-near-renfrew-on-11998",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 3,
        "Time": "8 hrs",
        "Total Distance": "20 km",
        "Town": "Renfrew, ON",
        "Type": "out-and-back"
    },
    "title": "Crag & Sullivan Lake hiking loop  20km",
    "trail_id": "11998"
}