{
    "description": "Edwards Rating: IV (V) M LElevation of 1398 m NET, 1908 m TOT & Max 3114 mSummit I at 3083 m, II at 3107 m (officially) & III at 3011 m 9 to 14 hoursThis traverse involves a lot of climbing and hands-on scrambling. This is a difficult scramble and some people may want to use a rope. Wear a helmet, as it can be hazardous if other parties are there. It's possible to do it without a rope as we did, but you will need at least some experience and skills in climbing, route finding and be physically and mentally fit and prepared for a long day. This is one of the best scrambles we've done, because hands-on and climbing are tremendous with solid rock with great holds and very few rock fall in general. Like it wasn?t enough of a challenge already, my girlfriend sprained her ankle 12 hours before we started, but she insisted to do it anyway and she made it?!Summit I: Hike up the drainage and keep right when it splits, keep going for about 1.8-1.9 km. You'll see the slope opening on your left at that point, start sidesloping and taking elevation until you get past the rock band and up to a wide field with a nice view of your first summit block. You'll see a large cylinder shaped pinnacle, approximately in the middle of the summit block, go straight to it walking in that field and then some scree and rubbles (see pictures). You will have a first climbing pitch here by the most probably dried-up drainage/waterfall but it might be avoidable if you do some route finding. It's a good way to see if you can/should keep going or not. Once up that rock band, keep taking elevation by going slightly to your right until you reach the cliff band. You should see an obvious trail going right here that leads you to a great scrambling/climbing section. Once facing that gully between the two pinnacles, scramble up on the left side and then straight up for good hands-on scrambling (a couple of cairns there). Once up that gully, you will face a wide bowl with very solid rocks to scramble up on the left side, staying close enough to the crest. You will then reach the ridge for an interesting walk with 2-3 pitches of climbing with great exposure. It's actually really nice and much faster, but you can also go back about 15-20 meters down the ridge and find a decent scree trail all along. You'll have 2 or 3 gullies on your left leading you back on the ridge; pick whichever one you?re the most comfortable with.  You are now just a few minutes away from your first summit.Summit II: Go down to the col of summit I & II on an incredible scree slope. You'll be down to that col very quickly. You will then need to stay close to the ridge and find weaknesses through quite a few rock bands with different options going from easy scrambling to interesting climbing sometimes a bit exposed. If you are uncomfortable at this point, you may consider turning back the way you came. You will know when you get to the crux, it's going to look like there's no way up once you reach that scree ledge lying down a 4-5 meters wall. We explored the wall for a while and there were 3 different routes we were comfortable with but one easier 5.5 climbing with less exposure a little further down the ledge. Once you climbed the crux, you are a minute away from the summit II. Funny fact, we met 2 folks coming up from the scree slope on the other side, Marie & Kris (just like us!?). Marie is a physiotherapist at Element Therapeutics in Golden and she did a brand new bandage for Marry so we can keep going to our last destination.Summit III: Go down to the col of summit II & III on again nice scree and then back up to your last summit staying close to the ridge again to avoid the scree as much as possible for an easier ascent. In 20-30 minutes, you will reach summit III with no technical difficulties. Descent: Go down to the col of summit III & IV. This was not as fun as the last two slopes with a mix of ok scree, slabs and rubble. We stayed very close to the ridge until we got down to the lowest point of that col and started our descent into that beautiful valley. Mount Sparrowhawk north face is quite impressive. You can go down straight in the middle and when it opens wide, stick to the right side of this little canyon without losing elevation for a while. When you have a chance, go on your left when you see an easy way down the slope leading to the valley. You?ll see on my GPS track that we went too far and had to come back a couple of hundred meters to find our way down to the valley in the rubble slope. From there, you?ll soon see a lot of cairns leading you eventually on the right side of Spencer Creek. The trail along Spencer Creek brings you back in the forest for a while but is very well identified with cairns and flags. Once you regain Smith Dorrien Trail, walk back to your car for about 2.2 km.",
    "directions": "From Canmore Bow River Bridge, take the Smith Dorrien Trail for about 22.2 km. Then make a u-turn to park on the left side of the road, by the obvious drainage.",
    "geohash": "c3",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/11995/long_Mt-Lougheed-Traverse-Kananaskis-Airplane-debris-Aug-3-2015-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11995/long_Mt-Lougheed-Traverse-Kananaskis-Awesome-Scrambling-on-I-Aug-3-2015-2--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11995/long_Mt-Lougheed-Traverse-Kananaskis-Awesome-Scrambling-on-I-Aug-3-2015-5--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11995/long_Mt-Lougheed-Traverse-Kananaskis-Beautiful-Stream-to-complete-the-descent-Aug-3-2015-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11995/long_Mt-Lougheed-Traverse-Kananaskis-Crux-near-Summit-II-Aug-3-2015-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11995/long_Mt-Lougheed-Traverse-Kananaskis-I-II-Ridge-Aug-3-2015-1--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11995/long_Mt-Lougheed-Traverse-Kananaskis-Incredible-Valley-by-Sparrowhawk-North-Face-Aug-3-2015-3--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11995/long_Mt-Lougheed-Traverse-Kananaskis-Summit-I-Aug-3-2015-3--44639_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11995/long_Mt-Lougheed-Traverse-Kananaskis-Summit-II-Aug-3-2015-2--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11995/long_Mt-Lougheed-Traverse-Kananaskis-Summit-III-View-Wind-Mountain-Aug-3-2015-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11995/long_Mt-Lougheed-Traverse-Kananaskis-To-Summit-I-Aug-3-2015-4--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11995/long_Mt-Lougheed-Traverse-Kananaskis-Up-to-the-scrambling-between-the-pinnacles-Summit-I-Aug-3-2015-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11995/long_Mt-Lougheed-Traverse-Kananaskis-Welcome-Aug-3-2015-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11995/narrow_Mt-Lougheed-Traverse-Kananaskis-Awesome-Scrambling-on-I-Aug-3-2015-8--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11995/narrow_Mt-Lougheed-Traverse-Kananaskis-Awesome-Scrambling-on-I-Aug-3-2015-9--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11995/narrow_Mt-Lougheed-Traverse-Kananaskis-Crux-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11995/narrow_Mt-Lougheed-Traverse-Kananaskis-To-the-Crux-Aug-3-2015-1--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/11995/narrow_Mt-Lougheed-Traverse-Kananaskis-To-the-Crux-Aug-3-2015-2--44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mount-lougheed-traverse-summit-i-ii-iii-near-kananaskis-ab-11995",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 5,
        "Time": "12 hrs",
        "Total Distance": "16 km",
        "Town": "Kananaskis, AB",
        "Type": "out-and-back"
    },
    "title": "Mount Lougheed Traverse-Summit I, II & III",
    "trail_id": "11995"
}