{
    "description": "Black Hole, Fundy National Park, Bike packing trip, From Elgin, NB into Fundy National Park. We were looking to do a bike packing fat bike trip without too much technical riding. We chose to leave from a friend?s farm in Elgin, and rode approx. 25km along mostly gravel roads and a cart path. The route took us along Hillside Road where the farm resides. The initial climb was pretty steep, given I don?t have a granny gear, so we did switchbacks to climb the steepest sections. The road is quite wide and well developed. Hillside road turned into Collier Mountain Road as it heads toward Fundy National Park. In winter, it?s a snowmobile super highway and you can tell by the signage at the infrequent intersections. Arriving at the park boundary, (no gates) the road turns into the Forty Five Road, named for the River and covered bridge it crosses within the park.The road skirts within the north-eastern park boundary and continues to roll until you reach the trailhead to Black Hole. The route into Black Hole is designated as a bike path, but ultimately is a cart trail strewn occasionally with bowling ball sized rocks. Nearing the end, the path descends steeply, and we chose to dismount and walk our steeds down to the end.At the end of the path there is an old warden?s cabin which was locked. A couple of welcoming deck chairs made for a pleasant rest post ride recovery. Two picnic tables aided in kitchen and eating duties, and hammocks were strung to nearby trees along the water. In prep for a pleasant night?s rest. The next day, we packed up to leave. Remembering the steep descent from the previous day, I didn?t look forward to the push a bike session. It turned out not to be so bad, and was thankful for the tree canopy that kept us cool. Before too long, we were on our way back to the main dirt roads back to Elgin.Note that there are some popular trails we cross along this route. The Dobson trail intersects the main road near the National Park boarder, as well as the Canada Trail which runs right along the Warden?s cabin.Fundy National Park has several cart path-style trails suitable for bike packing.Shannon Burt, PEI.",
    "directions": "From Elgin, take Gowland Mountain Road, and begin at any point where the pavement ends. Elgin is less than 30 minutes from Moncton, NB.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NB/12000/reg_iphone-055-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/12000/reg_iphone-056-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/12000/reg_iphone-058-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/12000/reg_iphone-061-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/12000/reg_iphone-066-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/12000/reg_iphone-074-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/12000/reg_iphone-077-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/12000/narrow_iphone-076-6702.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/black-hole-fundy-national-park-near-alma-nb-12000",
    "stats": {
        "Activities": "mtn-bike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 3,
        "Time": "14 hrs",
        "Total Distance": "50 km",
        "Town": "Alma, NB",
        "Type": "out-and-back"
    },
    "title": "Black Hole, Fundy National Park",
    "trail_id": "12000"
}