{
    "description": "Edwards Rating: III (V) S M Elevation of 898 m NET, 1149 m TOT and max 2877 m 5 to 9 hoursIf you follow our GPS both ways, it is a climber?s scramble with great exposure and loose rocks on the way up. If not, it is still a difficult scramble with a lot of route finding. This is not easy so you must be prepared to make it your own, you should wear a helmet and don't forget your bear spray. Our way up in the forest (further left on the GPS track) is not the best trail and involves bushwhacking. The other way to the left of the creek is much better, but we saw a dozen bear?s droppings going down, it was scary. I suggest you go this way up and down, but you should go in a larger group and talk all the time.Trail: Have a look from the highway first. You want to hike up a gully leading to the base of that left crest. Start on the obvious trail that leads to the creek. Cross the creek and take a little slope on your left to go up in the forest and find a good trail on your right, along that creek. You will see flags quite often but you may use other animal trails from time to time. As long as you stay close to the creek, you?ll get to that large bowl under Storelk ridge and in between the two crests. Hike up the dirt slope on your left to gain the crest and then keep walking left of that crest to gain elevation and start the tough route finding section. We went up on top of that crest all the way and it was exposed climbing with loose holds. It was said in Kane?s book not to do that because of the exposure, we understand now. We made it to the top, but if you think you can't make one of the sections there, just go with route finding left of that crest both up and down. Mark your way with cairns/take pictures to help you with route finding when you come back. This is hard to explain what we did and if you take our GPS track, you may not be comfortable with that path, so find any weaknesses on that wall and go with whatever you're most comfortable doing. Route finding skills are essential here and always remember you must go down this way. Once close to the ridge, an obvious trail/cairn will bring you back to the crest going right and you'll be a few meters away from the ridge. You want to stay close to it on the left side for a few minutes and then lose a bit elevation to scramble under these long slabs. Once you circumvented all the slabs, you can come back up to the ridge and complete your ascent to the summit.",
    "directions": "From Calgary, follow Trans-Canada Hwy/AB-1 W to Kananaskis Trail/AB-40 S. Take exit 118 and start your odometer for about 73.9 km or 23.9 km from Kananaskis Lake Trail junction. You can park on the right side of the road beside the trailhead where you'll see a cairn.",
    "geohash": "c2y",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/12002/long_Storelk-Mountain-kananaskis-Indications-Aug-8-2015-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12002/long_Storelk-Mountain-kananaskis-Scrambling-scetion-Aug-8-2015-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12002/long_Storelk-Mountain-kananaskis-Summit-Aug-8-2015-1--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12002/long_Storelk-Mountain-kananaskis-Summit-Aug-8-2015-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12002/long_Storelk-Mountain-kananaskis-Summit-Aug-8-2015-6--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12002/narrow_Storelk-Mountain-kananaskis-Exposed-climbing-WOW-Aug-8-2015-1--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12002/narrow_Storelk-Mountain-kananaskis-Exposed-climbing-WOW-Aug-8-2015-3--44639_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12002/narrow_Storelk-Mountain-kananaskis-Exposed-climbing-WOW-Aug-8-2015-5--44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/storelk-mountain-near-kananaskis-ab-12002",
    "stats": {
        "Activities": "hike climb",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "7 hrs",
        "Total Distance": "9 km",
        "Town": "Kananaskis, AB",
        "Type": "out-and-back"
    },
    "title": "Storelk Mountain",
    "trail_id": "12002"
}