{
    "description": "Edwards Rating: I (II) M MElevation of 1223 m NET, 1240 m TOT and max 3083 m 5 to 7 hoursThis is one of the most rewarding scramble we've ever done! Views are absolutely stunning, it?s not too busy, scrambling is easy with ?stairs? shaped rock bands and it?s quick with an obvious trail all along. If you do lots of scrambling, you will find it easy, but most people rate it as a moderate scramble. I am not sure I agree with that, but it could make sense if you have very few scrambling experience. Anyways, this is a must! Make sure you look at the trail report as there?s groups restrictions in the summer and maybe closures for bears activity. We tried it mid-June for the first time and the gully up to the last portion of the summit block was full of snow, we turned back. You may want to try it on later in July or August the first time for a snow free ascent.Start by Moraine Lake shore where you'll see an obvious sign for Larch Valley hiking trail. Do not use Eiffel Lake trail at the junction later on, keep going to Larch Valley for an easier ascent. Once in the valley, walk another 300-400 meters and turn left on another good path going down the creek. Cross that creek and keep going on that trail until you reach a plateau where you'll have incredible views already. Eiffel is slightly on your right, look for obvious paths and cairns (a lot of cairns) and make your way up to the summit. You'll have one spot where the trail splits, both are fine but the right one is better and involves easy and fun scramble in 2-3 rock bands. The gully you'll use close to the top is easy but you can scramble both sides on solid rocks if you'd like. Enjoy stunning views of the surrounding peaks like The Valley of the Ten Peaks, Mount Temple, Pinnacle Mountain, Horseshoe Glacier and so on.",
    "directions": "From Calgary, follow Trans-Canada Hwy/AB-1 W to the Bow Valley Parkway exit toward Lake Louise. Turn left and continue onto Lake Louise Dr for 2.2 km. Turn left on Moraine Lake Rd and drive up to the lake?s parking lot.",
    "geohash": "c3j",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/12003/long_Eiffel-Peak-Moraine-Lake-Awesome-views-all-around-Aug-10-2015-1--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12003/long_Eiffel-Peak-Moraine-Lake-Easy-Fun-Scramble-Aug-10-2015-2--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12003/long_Eiffel-Peak-Moraine-Lake-Summit-Aug-10-2015-10--44639_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12003/long_Eiffel-Peak-Moraine-Lake-Summit-Aug-10-2015-12--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12003/long_Eiffel-Peak-Moraine-Lake-Summit-Aug-10-2015-2--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12003/long_Eiffel-Peak-Moraine-Lake-View-Pinnacle-Temple-Aug-10-2015-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12003/long_Eiffel-Peak-Moraine-Lake-Welcome-Aug-10-2015-44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/eiffel-peak-near-banff-ab-12003",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 5,
        "Time": "6 hrs",
        "Total Distance": "11 km",
        "Town": "Banff, AB",
        "Type": "out-and-back"
    },
    "title": "Eiffel Peak",
    "trail_id": "12003"
}