{
    "description": "I have heard that Fish Lakes Backcountry Campsites is one of the nicest backcountry sites in Banff. Although the camp is very nice, it is the hike in that you will remember the most. Whether you are coming from Mosquito Creek or over the Pipestone Alpine Trail, the scenery is amazing.The trailhead is at Mosquito Creek Campsite and Hostel parking lot. To get to the trail you must make a daring dash across the highway and either walk along the bridge with cars whizzing by or drop down and make your first crossing of Mosquito Creek. The very first section of that trail is steep but quickly levels off to an easy creek hike. The trail is very well maintained and the many bridges are sturdy and easy to cross. Mosquito Creek backcountry camp is at approximately kilometer 6. This campsite had nice tables with views of Mosquito Mountain and appeared to have many nice areas to put a tent. After the campsite the trail starts to get more interesting and more challenging as you make your way towards North Molar Pass. The trail runs through rolling subalpine meadows until you reach the challenging accent to the top of the pass. Once over the pass you are treated to spectacular scenery and a well-deserved elevation drop all the way down to the lake. At the camp you will find several picnic tables right beside the lake with bear poles and one not-so-pleasant outhouse up in the treed area. There didn?t appear to be any really designated tent sites, just a few areas that were better than others with logs to sit on. There isn?t much privacy between flat areas, if you want more seclusion, you can fallow one of the many trails into the trees and find a suitable place to put up your tent. There is a ranger cabin not far from past campsite and if you continue even further in that direction you will find trails to Moose Lake and the Pipestone Pass. This is the direction to head if you are heading on to Devon Lakes and the Clearwater Pass area.  Distance: 15.3 kmElevation: + 809 / - 448m",
    "directions": "Take the Icefields Parkway north from the Trans-Canada Highway approximately 24 km. Park at the small lot adjacent to the Mosquito Creek Campsite and Hostel. Mosquito Creek Trailhead is across the highway.",
    "geohash": "c3jm",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/12017/reg_-DSC1452-50330_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12017/reg_Fish-Lakes-50330.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/fish-lakes-via-north-molar-pass-and-mosquito-creek-near-banff-ab-12017",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 5,
        "Time": "5 hrs",
        "Total Distance": "15 km",
        "Town": "Banff, AB",
        "Type": "out-and-back"
    },
    "title": "Fish Lakes via North Molar Pass and Mosquito Creek",
    "trail_id": "12017"
}