{
    "description": "The Devon Lakes area may be one of the best kept secrets in Banff. If you are looking for the true backcountry experience, it is well worth the two day hike in. If that is more of a time commitment than you are able to make, there is a one day option to access the lakes by shortcutting over Quartzite Col but this is not an official trail and involves some route finding and scrambling. Although not very ?technical? if you choose the right route, the decent from Quartzite Col into the Siffleur River Valley is challenging with a multi-day pack and I have heard that there have been injuries here. Devon Lakes is close to the east boundary of Banff National Park at the base of Mount Willingdon. This remote area is in the random camp zone, you still need to purchase a backcountry permit but there are no camping facilities like outhouses or bear poles. There are very few (if any) flat places to set up your tent but if you don?t mind sleeping on an incline or a few lumps, the amazing camp locations are endless. Most camp on the grassy slopes above the larger, main lower lake but there are places to set up by the middle and upper lakes too. Due to the remoteness, proper wildlife precautions are a must and leave no trace camping is required to keep the area in the pristine condition you found it in. There are very few trees in the area and what trees are there are generally pretty small. Not nearly high enough to hang a bear bag any higher than what would be considered a convenient biting height for the bear. A bear proof canister or bag will be required to keep and bears and other forest critters out of your food supply. The lack of trees also provides little protection from the elements, there are some SUV sized boulders to seek shelter behind but that is about it.Starting at the Mosquito Creek trailhead, follow the Mosquito Creek Trail for approximately 4 kms, you will see a secondary trail turn off the main trail just before the fourth bridge. This is the ?trail? to Quartzite Col. For the most part, the route is well stomped out but there are areas that are little more than game trails and every so often we would all together loose the trail and have to bushwhack. The trail loosely follows the creek until at approximately kilometer 8 where you change direction and start ascending up a gully. GPS or extremely good navigating skills are recommended as you can?t see the col from the creek area and the trail just seemed to disappear at the point that you would want to start your accent. After a short climb the Col becomes visible. You do not want to go over the col at the lowest point, instead you should aim to stay on the high right side. There are two unnaturally square rock formations that you need to aim for. There is a small cairn to the left of the lower rock formation, this is the route that we used but apparently if you go the extra ways up to the higher of the two there is a scree slope that you can go down that is easier. BE CAREFUL HERE! The rock is slippery and loose, there are drop offs that are difficult to see and it is deceivingly steep in some places. From the top of the col you get a view of the Clearwater Pass and Mount Willingdon. We started working our way down the mountain in the general direction of the pass. I have heard this part referred to as ?tedious? but I don?t think that beings to describe it. It felt like hours working our way down the scree, loose rock and then boulder field. The only thing that makes this part bearable is the expansive view of the river valley and having your destination in view. Once off of the mountain, you will find yourself in a large alpine meadow spanning the Siffleur River Valley. If there is a trail or route here, we didn?t see it. We carefully made our way across the valley passing by a few tarns and streams. There is a small ?river? that you will have to cross before you make your accent up to the Clearwater Pass but if you scout it out from above, you will see a spot where the bank on the other side is only a couple of feet high and the water is shallow and easily rock hopped. Eventually you will run into the Pipestone/Siffleur River trail that has a connection that runs to Devon Lakes and eventually right down into the Clearwater River Valley. Nice to be on an actual trail again.At Devon Lakes there is one main large lower lake and two smaller higher lakes further up the trail. To get to the upper lakes, we followed the Clearwater Valley trail until we could hear the water flowing down from the middle lake. There wasn?t a defined trail that we could find that went to the lakes, so we bushwhacked and made our way along game trails until we reached the area between the two lakes. There is a defined short section of trail here, but when we tried to follow it out, it too disappeared. It looked like you might be able to follow along the shore of the lower lake and make your way over a grassy hill to reach the upper lake but the weather turned on us so we didn?t get the opportunity to investigate if this was an option. Distance to Lower Devon Lake via Quartzite Col: 16.1 km, additional 2.5 km to Upper LakesElevation: + 1050m / - 511 m (additional + 120m to upper lakes)",
    "directions": "Take the Icefields Parkway north from the Trans-Canada Highway approximately 24 km. Park at the small lot adjacent to the Mosquito Creek Campsite and Hostel. Mosquito Creek Trailhead is across the highway.",
    "geohash": "c3j",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/12014/long_-DSC1231-50330.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12014/long_Devon-Lakes-50330.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12014/reg_Devon-Lakes1-50330.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12014/reg_Willingdon-Camp-50330.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/devon-lakes-via-quartzite-col-near-banff-ab-12014",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 4,
        "Time": "8 hrs",
        "Total Distance": "18 km",
        "Town": "Banff, AB",
        "Type": "out-and-back"
    },
    "title": "Devon Lakes via Quartzite Col",
    "trail_id": "12014"
}