{
    "description": "A well traveled hiking trail starting at the Cline River outflow to Lake Abraham and following the Cline River upstream towards Pinto Lake. Restricted most of the year to hiking only, with horses in the shoulder seasons.I have had the pleasure of hiking this trail twice in the last two years. Poor directions and poor weather have prevented me from making it all the way to Pinto Lake, but I have mapped the trail to Waterfalls Creek. I plan on completing this trail all the way to Pinto, and over the Sunset Pass to Normal Lake and then on to the Icefield Parkway. Check back for future updates.The trails are well traveled and are an easy walk for the most part. I have ranked this a moderate hike for two reasons. The first is the climb up the hill at Sentinal Creek which some people have found a bit steep. The loose rocks require a little caution descending - recommend treking poles if steep slopes bother you. The other reason is some of the fords can be a bit deep and fast. The first year I went there were no issues, but it was a dry year. The second year was wet and there was a lot of pondering where the best crossing location was.The open forests, beautiful mountains and prestine river make this a worthwhile hike. Other than stupid determination to get to Pinto and the Parkway, there are so many other reasons I love this hike - I think you will too.",
    "directions": "The trail head is just on the south side of the Cline River bridge, on the west side of Highway 11. Coordinates are shown on the map.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/12012/reg_DSC00071-36825.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12012/reg_DSC00075-36825.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12012/reg_DSC00076-36825.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12012/reg_DSC00086-36825_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12012/reg_DSC00088-36825.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12012/reg_DSC00090-36825.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12012/reg_DSC00095-36825.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12012/reg_IMG-2320-36825.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12012/reg_IMG-2368-36825.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/cline-river-near-rocky-mountain-house-ab-12012",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "8 hrs",
        "Total Distance": "33 km",
        "Town": "Rocky Mountain House, AB",
        "Type": "out-and-back"
    },
    "title": "Cline River",
    "trail_id": "12012"
}