{
    "description": "This is a new trail currently being built at Whistler. It is proposed to link from the Flank trail near Function Junction (east side of Mt Sproatt)  to the Rainbow Lake trail on the west side of Mt Sproatt. It is proposed to be finished by 2016, as a multi purpose trail (biking, hiking, snowshoeing, back country skiing). Start behind Olive's at Function Junction, 10 m into the forest, turn right (west) at the graffitied sign (see photo), and then at the Flank trail junction, go right again, ie, north and west on the Flank trail. Go approx 2 kms, and you will see the new trail heading west (see the \"Sproatt Multi Use Ascent Trail sign) whereas the Flank trail continues north.We continued approx 6 kms where a crew was working building the trail. After that, we bushwacked for approx 1 flagged km, then even the flags ended. Fortunately, we had 2 experienced outdoorsmen (1 was a geologist) with built in GPSs who lead us to the alpine, with great views of the south, east (Black Tusk and Whistler) and north east (Blackcomb, Wedgemount).Return trip: 20 kms, 1050 net ascent, 1150 cumulative ascent",
    "directions": "From Vancouver, turn left (west) at Function Junction (first set of lights as you arrive at Whistler), drive straight to Olive's, turn left and park behind Olive's. You will see the entrance to the forest on the south side of the parking lot.",
    "geohash": "c2b",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/12013/long_Sproatt220-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12013/long_Sproatt222-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12013/long_Sproatt225-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12013/long_Sproatt226-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12013/long_Sproatt230-7359_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12013/long_Sproatt234-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12013/long_Sproatt239-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12013/long_Sproatt240-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12013/long_Sproatt242-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12013/narrow_Sproatt217-7359.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/sproatt-alpine-near-whistler-bc-12013",
    "stats": {
        "Activities": "ski-bc hike snowshoe",
        "From": "",
        "Seasons": "winter fall summer",
        "Stars": 4,
        "Time": "7 hrs",
        "Total Distance": "20 km",
        "Town": "Whistler, BC",
        "Type": "out-and-back"
    },
    "title": "Sproatt Alpine",
    "trail_id": "12013"
}