{
    "description": "Saddlebag Lakes, 20 lakes basin, Inyo Natnl Forest on the east side of Yosemite. Trip Length: ~10 miles.\nIf you plan to backpack (it's a nice easy backpack, great for beginners), you'll need a wilderness permit. You can pick that up on your way in at the Inyo Natnl Park ranger station or you can pick it up at the ranger kiosk at the mouth of the backpackers parking lot.\nTo start the hike head out of the parking lot and cross the road and cross the dam to your left.  The beginning of the hike takes you along the shoreline of Saddlebag lake.  The path is easy to follow.  As you proceed you'll start to transition from red volcanic rock to alpine meadows (which the day of our hike was blooming with beautiful purple flowers - purple lupine I think).  As you near the far shore of the lake another lake can be seen to your left, this is Greenstone lake.  Rising up from the lake you'll see North Peak and its ridge. If you look back and you'll see Mt. Conness and part of its glacier.  Continue on the trail thru the meadow and start to work right. You'll come to a T in the trail.  We chose to do the hike thru the 20 lakes basin counter clock wise because we planned to camp and the best camping is on the left side of the basin which we'd reach at the end of our day.  At the trail T, go right.  Keep your eyes open, the trail junction is hidden to your left, if you pass the ranger hut turn around, you missed the junction leading you to the basin (it's more visible from that direction anyway). \nBefore you turn off to Lundy Canyon (according to the signs), take one last look behind you back to Saddleback Lake.  Take in the awe inspiring vista of Mt. Conness. At the junction, the trail climbs slightly, take it easy if you've not acclimated to this elevation (sometimes you forget that you are at 10,000 ft!).  You'll pass a series of small lakes that in the later months are all but dried up.  These lakes are Hummingbird Lake and Z Lake.  You'll now start to ascend and walk into Lundy pass. The walk takes you thru deep canyons with walls of red rock rising up around you. We stopped here for lunch, perched on a boulder outcropping looking over a lake. The water was crystal blue (with polarizing lenses you can see to the bottom).  Be careful in this area, the rocks are much steeper and if wet, can be slippery.  Pass one last lake to your right and you'll start to descend thru a corridor of large talus and boulders, the path is a little more difficult to follow, however you see your target in front of you, Helen Lake.  Descend the rocky slope and continue around the right side of Helen Lake.  From here the views start to get more spectacular.  It's hard to believe that you're only about 8 miles from the nearest road.  Standing at the shores of Lake Helen, you'll see a small cascade across the shore and the walls of the canyon reach high into the sky. The colors of the walls vary from rusty reds to steel blue because of the volcanic nature of this area. \nMake your way around the right hand side of the lake and start to climb a bit.  In front of you, just over the crest is Shamrock Lake (possibly one of the most beautiful lakes I've ever seen).  You'll climb a bit on the rocks, be careful, the rocks can be slippery.  Standing at the top you'll be looking down on Shamrock Lake. The lake is punctuated by small islands and clear blue water.  To your right is a large talus field that if you're adventurous, can provide wide expansive views of Shamrock, Helen and the upcoming Steelhead, Little Steel Head and Cascade lakes.  This is a great place for lunch (make sure you have your mosquito repellent!). \nFollow the path around the right side of Shamrock Lake and climb a little more.  You'll have to drop down and cross the small stream that feeds Shamrock. There are great places to camp here if you are ready to take a break or you can continue on the path up to Steel Head, Little Steel Head, Cascade and a variety of other Lakes. We chose to push on and camp at Cascade. The rocks around you now start to change from the deep rusty reds to bright white granite as dusk rolls in they start to glow orange with the setting sun.  The best camping is around Cascade Lake although you will have company (this is a popular spot to stop and camp).  We set up camp and relaxed. This is a great point to just absorb.  Rising out of the lake in front of our campsite is a large wall of granite that is part of the North Peak ridge.  \nThe next morning we were up bright and early, the sun bouncing off the lake and surrounding granite made for a beautiful spectacle to awaken to! Do I really have to leave this place, I keep asking myself.  We pack up in the brisk 40 degree morning and head out.  We pass two more lakes before we emerge from the basin ready to find our path and work our way back to the parking lot.  But we're in no rush to leave, there are plenty more beautiful vistas to take in as we work our way back. As you emerge the alpine meadow returns and the bare granite is replaced with lush green grass and shrubbery.  Some of our most beautiful pictures were taken on this day in the early am.  You'll see Greenstone Lake appear to your right and the path works to the left.  We stopped here for lots of pictures!  The best is shown here, Greenstone Lake created a beautiful reflection of North Peak. We then worked our way to the way left hand side of Saddlebag Lake and took the opposite trail.  If you are simply too tired or two awed to walk your way back, there is a water shuttle that will ferry you back and forth across the lake. This saves you about a mile each way and costs, I believe $5 round trip for backpackers.",
    "directions": "How to get there:  Rt. 120 east, just past the east gate of Yosemite (Tioga Pass), make a left on Saddlebag Lake Road. Stay to the right across the bridge and follow the road approx 2 miles (it switches back and forth from paved to dirt).The backpackers parking lot is on your right side (it's a heck of a turn, keep your eyes peeled). \n GPS information for the complete hike is attached (see download GPS). \nGeneral information is at the National Parks service:\nhttp://www.nps.gov/yose/trip/travel.htm",
    "geohash": "9q",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/CA/1201/long_shamrock.jpg",
        "https://trailpeak.com/storage//content/trails/US/CA/1201/topo_20LakesBasinjpg.jpg",
        "https://trailpeak.com/storage//content/trails/US/CA/1201/narrow_20LakesBasinAerialjpg.jpg",
        "https://trailpeak.com/storage//content/trails/US/CA/1201/narrow_northpeak.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/saddlebag-20-lakes-basin-yosemite-near-lee-vining-ca-1201",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 5,
        "Time": "10 hrs",
        "Total Distance": "18 km",
        "Town": "Lee Vining, CA",
        "Type": "out-and-back"
    },
    "title": "Saddlebag  20 Lakes Basin, Yosemite",
    "trail_id": "1201"
}