{
    "description": "The trail from Devon Lakes to Fish Lakes over the Pipestone Highline Trail is worth the trip in itself. From the Fish Lakes Campground follow the trail past the ranger cabin, over the creek and start your accent to the trail above. With rolling alplands ahead, the Pipestone Valley below, and towering mountains on either side, the scenery never gets boring. A bit of work is required to get up and out of the area where that campground sits but once you do the trail stays high all the way to the Pipestone Pass and has very little elevation gain and loss. The trail is in good shape overall, it split in multiple directions at a few spots, especially near water crossings, but seemed to always join back up. There are approximately 9 km of the high alpine trail before you hit the Pipestone Pass. Since you are already high up and plan on staying high to get to the Clearwater Pass, the pass isn?t much of an obstacle.Once over the pass, continue on the east side of the valley all the way to the Clearwater area. There will be a junction for a trail that leads up to Devon Lakes and even further into the Clearwater River Valley. If you were to continue straight, the trail would lead you to the Siffleur River Trail system.  Continue on the new trails until you reach your destination either at the lower lake or further down the trail. This is a random camp zone, so as long as you have the proper random camp permit, you can set up camp anywhere as long as you are at least 70 m from the water.Distance: 14.9 km Elevation + 562 / - 448",
    "directions": "Fish Lakes Backcountry Campground is accessed by Mosquito Creek trail to North Molar Pass Trail.Take the Icefields Parkway north from the Trans-Canada Highway approximately 24 km. Park at the small lot adjacent to the Mosquito Creek Campsite and Hostel. Mosquito Creek Trailhead is across the highway.",
    "geohash": "c3j",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/12016/long_pipestone-Pass-2-50330.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/pipestone-alpine-highline-trail-fish-lakes-to-devon-lakes-near-banff-ab-12016",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 5,
        "Time": "5 hrs",
        "Total Distance": "15 km",
        "Town": "Banff, AB",
        "Type": "out-and-back"
    },
    "title": "Pipestone Alpine (Highline) Trail ? Fish Lakes to Devon Lakes",
    "trail_id": "12016"
}