{
    "description": "Mt. Willingdon is an easily attained 11,000er. The route up is non-technical scramble but yet never boring with spectacular views in every direction. The base of Mount Willingdon is at Devon Lakes random camp zone in the Clearwater Pass. There are three main routes to access Devon Lakes, over the Pipestone Pass from Fish Lakes, Siffleur River Valley Trail and an unofficial shortcut route over Quartzite Col (scramblers route).The route to the summit starts right from the camp area by the lakes up a gentle slope but quickly turns to scree followed by some easy to moderate scrambling. The last third is a scree slog up to the crux, a cliff band just before the summit. Although exhilarating, the cliff band has good holds and the exposure is manageable. Beware of the loose rock and the fact that the rock seems to always be wet. Make sure to take in the amazing views of the lakes and glacier when you can, the clouds roll in quick and you may find yourself left without a view. Distance: 8.4 km (round trip)Elevation: + 1089 m",
    "directions": "Devon Lakes can be accessed by a two day hike in through Fish Lakes/Pipestone Pass or by a one day scramble over Quartzite Col. Both start at the Mosquito Creek Trailhead.Take the Icefields Parkway north from the Trans-Canada Highway approximately 24 km. Park at the small lot adjacent to the Mosquito Creek Campsite and Hostel. Mosquito Creek Trailhead is across the highway.",
    "geohash": "c3jq6",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/12015/long_-DSC1231-50330.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12015/long_-DSC1236-50330.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12015/long_Willingdon-50330.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12015/reg_Will-50330.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12015/reg_Willingdon-Camp-50330.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mount-willingdon-near-banff-ab-12015",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 5,
        "Time": "5 hrs",
        "Total Distance": "8 km",
        "Town": "Banff, AB",
        "Type": "out-and-back"
    },
    "title": "Mount Willingdon",
    "trail_id": "12015"
}