{
    "description": "To summarize we will go up Sumas mountain across to Taggart Peak then down the bike side of the mountain to the logging road that will connect with the Sumas Trail and back down to our vehicle on the Sumas Mountain RoadThis hike will go up the old sumas trail to the logging road turn right about 30 meters down the road then on your left and join onto the centennial trail up to Chadsey Lake.  Go 3/4 of the way around on the left to the sumas peak trail that climbs steeply from the lake.  At the top go to the East lookout. On the way back go south to the microwave towers and find the Knob Gobbler Bike trail beside the access road follow this down keeping to the left half way down instead of using Sideshow.  At the end of this bike trail it will be at a bend in the Taggarted Road you can go straight through the path to the access road that goes to Taggarted Peak.  Follow this up to Taggarted Peak.  This is where our hike got urgent to get back to our car we then Followed the Access Road back to the main road and across the street to the bike trail Noah's Fear it is down the road about 100 meters on the right.Noah's Fear goes down beside the main road to a logging road that you walk down when you come to a junction take the right road it will go up then down the west side of Sumas Mountain to get to the trail coming up from the car.",
    "directions": "Along Sumas Mountain Road go North towards the Fraser River as it turns into gravel after the sharp right turn it is on the left at the left turn. The trail head is just past the ditch.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/12027/long_IMG-20150809-104544205[2]-52998.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/sumas-peak-and-taggart-peak-near-abbotsford-bc-12027",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 4,
        "Time": "6 hrs",
        "Total Distance": "18 km",
        "Town": "Abbotsford, BC",
        "Type": "out-and-back"
    },
    "title": "Sumas Peak and Taggart Peak",
    "trail_id": "12027"
}