{
    "description": "This hike takes you along and over Walbran Creek to see the Castle Giant, an ancient Red Cedar thought to be between 1200-1500 years old. The first part of the hike is on boardwalk that was built in 1992, some sections are a bit sketchy so be careful. Side trails take you down to the river edge where you can camp among the trees.The summer crossing of the river can be done on foot over the rocks without getting wet. This is a great place to stop for a swim! The winter crossing is farther up-stream and you will need hip-waders or the courage to get wet.Continue on up into the forest along the trail. Signage indicates which way for Castle Giant and which way for Anderson Lake, a 6 hour return trip. Once you get to the Castle Giant, be respectful of it's roots and stand on the boardwalk for taking pictures (and don't fall off!) A trail was started from here up to the proposed cut-block, but the hornets put up a fierce defense so I wouldn't go any farther.This area was NOT included in the Carmanah-Walbran Provincial park when it was created in 1995 and is currently slated for clear-cut and heli-logging in 8 sections. Check out http://friendsofcarmanahwalbran.com for more information on the area.",
    "directions": "From Lake Cowichan (zero your odometer) - take the South Shore Road. Continue past the highway to Port Renfrew. Where the sign is that indicates RIGHT for Carmanah Walbran Provincial Park - GO LEFT INSTEAD onto Caycuse Main(32km). Stay on Caycuse Main (left at most spur roads) until it joins onto McLure Main(42km). Look for blue spray painted \"W\"'s. Stay straight (do not cross large bridges or climb up hills). You will end up on Walbran Main(60km). At 71km turn right and follow the pink flagging down to Walbran Creek. This is the worst part of the road, you can do it in a passenger car but there are two big drops.From Port Renfrew (zero your odo) - Go north along Deering Lake. Turn LEFT ie. away from the Highway to Lake Cowichan. Km 3.9 ? Continue ahead Km 8.0 ? Stay left, continue ahead Km 9.1 ? Stay right, continue ahead Km 9.9 ? you should be passing the signed entrance to Avatar Grove Km 15.7 ? Turn left off Gordon Main onto Bugaboo crossover road ? just after the 36km Gordon Main road marker.  From here there are some blue painted markers to help with directions. Km 17.1 ? Stay left, continue ahead Km 19.1 ? Stay left, continue ahead Km 19.7 ? Stay right, continue ahead Km 20.6 ? here you pass an impressive grove of large stumps.  It boggles the mind what the forests of this island used to look like. Km 21.4 ? A short rise onto a wide section of road, please do not spin tires on rise. Km 25.2 ? Bugagoo crossover ends at Walbran Main.  Turn left here.  Also look around and take note of the intersection for your return journey. Km 33.6 ? Stay right, continue ahead Km 36.8 ? Turn right off Walbran Main and take the smaller road down into the Walbran Valley Km 38.5 ? the road ends at a bridge over the Walbran River.Once you get to the bridge - you can park on either side. The trailheads and outhouse are on the opposite side. The road also continues up for another 5 km (?) where there is a turnaround and a good camping spot, but this road is very narrow.",
    "geohash": "c0xk",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/12035/reg_IMG-5528-1--47757.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12035/reg_IMG-5529-47757.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12035/reg_IMG-5531-47757.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12035/reg_IMG-5532-47757.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12035/reg_IMG-5534-47757.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/castle-giant-in-central-walbran-valley-near-lake-cowichan-bc-12035",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 5,
        "Time": "2 hrs",
        "Total Distance": "4 km",
        "Town": "Lake Cowichan, BC",
        "Type": "out-and-back"
    },
    "title": "Castle Giant in Central Walbran Valley",
    "trail_id": "12035"
}