{
    "description": "These are a bunch of loops  with in  Frontenac Provincial Park.you can find good  descriptions of these trails  at  The Friends of Frontenac Provincial Park web page  www.frontenacpark.ca and then click trails.Officially, Frontenac Provincial Park has approximately 160 km of trails. The staff arrived at this figure by counting the total distance of every loop and adding how far the trail-heads are from the Park Office. This number is not the same as saying how many distinct kilometres of trails there are Frontenac Park because some loops have common segments.Although the distances from the Park Office are included, it is not necessary to start each hike from the Park Office. From late spring to late fall, the Big Salmon Lake Road is open allowing you to drive and park your car (Big Salmon Lake and Arab Lake parking lots) close to where many loops start.Note also that the times given are really rough guidelines. There are too many variables. Some hikers like to get a good aerobic workout while others prefer looking at every blade of grass. There is no way to give an accurate measure.Trail descriptions are taken word-for-word from plaques displayed at the Park Office.",
    "directions": "From Toronto:Take Highway 401 east until you get to Kingston. Take Exit 613 - Sydenham Road and go north. Follow the directions from Kingston.From Montréal:Follow the 20 west to the junction with Ontario's Highway 401. (Alternatively, you could go west on the boulevard Métropolitain (40), then south on the 540 to the 20 and the 401.) Continue on the 401 till you get to Kingston. Exit at Sydenham Road (Exit 613) and go north. Follow the directions from Kingston. staff at the Park recommends this route: Take Highway 7 west to Carleton Place.Turn on Highway 15 south to Crosby, then turn west on Highway 42 to Westport (you should see Provincial Park signs). From Westport drive south towards Kingston on County Road 10 (the Old Perth Road). Shortly after Perth Road Village, you will see a Provincial Park sign indicating a right turn on County Road 5. Go as far as the village of Sydenham, then follow these directions. From Kingston:The easiest way to get to the park from Kingston, is to go north on Sydenham Road (Frontenac County Road 9) for approximatively 20 km. At the end of the road you will see a Provincial Park sign (Blue and white), telling you to turn left on County Road 5.As you enter the village of Sydenham, watch for the another Park sign on your right (1.9 km). From then on follow the signs. You will go though Sydenham crossing a small bridge over the Millhaven creek and passing a grocery and a beer store on your right as you leave the village. After driving 13 Km on curvy County Road 19, you will see a larger Park sign indicating a right turn and a drive of 2.4 km. This is the Salmon Lake road (just after the Outfitter), it ends at Frontenac Park.South-eastern Ontario Area mapFrom the USA:Depending where you are coming from your best bet may be to make your way to Toronto or Montréal and follow the directions above. You can also get to Kingston via Interstate 81, crossing the St. Lawrence River at the Thousand Island bridge and ending directly at the 401 Expressway (a.k.a. Macdonald-Cartier Freeway). Go west on the 401 for about 48 km (30 miles) and you will reach Kingston. Leave the freeway at Sydenham Road (Exit 613) and go north. Follow the directions from Kingston.From Ottawa:Since I live in Kingston I rarely have the occasion to come to Frontenac Park from the north. Therefore the information given here may not be entirely accurate.You could use Highway 16 to get to the 401, then drive toward Kingston, get off at Sydenham Road (Exit 613) and follow the route outline for Kingston",
    "geohash": "drct",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/ON/12036/reg_IMG-0590-53021.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/12036/reg_IMG-0594-53021.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/12036/reg_IMG-0624-53021_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/12036/reg_IMG-0677-53021.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/frontenac-provincial-park-near-kingston-on-12036",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "22 hrs",
        "Total Distance": "52 km",
        "Town": "Kingston, ON",
        "Type": "out-and-back"
    },
    "title": "Frontenac  Provincial park",
    "trail_id": "12036"
}