{
    "description": "Edwards Rating: III (IV) M LElevation of 1261 m NET, 1495 m TOT and max 3167 m (3185 officially) 7 to 10 hoursThis is an easy and straightforward approach to the base of Mount Galatea followed by fun scrambling on slabs and rock bands, a short ridge walk and some exposed hands-on. I would rather rate it as a moderate scramble, but the ridge may be a little bit tricky.Take the Chester Lake trail for about 4.5 km. Once at the lake go left and as soon as the trail splits, take the left one and keep going to the elephant rocks. The trail is still obvious at that point and brings you to the second valley passed Chester Lake. You will gain a bit of elevation just after you passed by a beautiful lake and the valley opens wide. I recommend that you just go straight in the middle of the valley and left of the several tarns you will encounter; it?s beautiful and easy terrain to hike on. Have a look at Galatea?s summit on your left. Close to the end of that valley, you will see 2 waterfalls on Mount Galatea. Start your ascent at this point. There are many ways to go up to the ridge and you can?t really go wrong there, but we have chosen to go for the slabs and rock bands for an easy ascent and to avoid snow patches, making sure we would go slightly on the right side of the waterfalls as we were gaining more elevation.Once close to the ridge, scramble up one of the gullies to the ridge. The first one is a bit tricky with loose rocks, you may want to sideslope on the left a little bit to assess which gully you?re most comfortable using. Once on the ridge, you?ll see a few cairns and you will have one section with some great hands-on scramble and some exposure. There is also a bit of exposure as the ridge narrows a few metres before getting to the summit. For the descent, I tried to find good scree right under the summit but it wasn?t a success. I recommend that you go back the way you came and then use the large gully (there was a mix of scree and snow for a nice glissade down) that eventually leads to the waterfalls. You can find good scree on your left most of the time and it is quite obvious with some good trails.",
    "directions": "From Calgary, follow Trans-Canada Hwy/AB-1 W to Kananaskis Trail/AB-40 S and take exit 118. Drive south for about 50 km and turn right on Kananaskis Trail/AB-742. Follow that road for about 23 km and park at Chester Lake parking lot on your right.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/12038/long_Mount-Galatea-Kananaskis-Incredible-Valleys-Tarns-Aug-23-2015-5--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12038/long_Mount-Galatea-Kananaskis-Incredible-Valleys-Tarns-Aug-23-2015-6--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12038/long_Mount-Galatea-Kananaskis-Nice-pink-ice-by-the-summit-Aug-23-2015-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12038/long_Mount-Galatea-Kananaskis-Scramble-Elevation-time-Aug-23-2015-1--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12038/long_Mount-Galatea-Kananaskis-Scramble-Elevation-time-Aug-23-2015-4--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12038/long_Mount-Galatea-Kananaskis-Scramble-Elevation-time-Aug-23-2015-5--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12038/long_Mount-Galatea-Kananaskis-Summit-Aug-23-2015-5--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12038/long_Mount-Galatea-Kananaskis-Welcome-Aug-23-2015-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12038/reg_Mount-Galatea-Kananaskis-Crux-exposure-hands-on-Aug-23-2015-2--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12038/reg_Mount-Galatea-Kananaskis-Incredible-Valleys-Tarns-Aug-23-2015-2--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12038/narrow_Mount-Galatea-Kananaskis-Crux-exposure-hands-on-Aug-23-2015-1--44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mount-galatea-near-kananaskis-ab-12038",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 4,
        "Time": "8 hrs",
        "Total Distance": "17 km",
        "Town": "Kananaskis, AB",
        "Type": "out-and-back"
    },
    "title": "Mount Galatea",
    "trail_id": "12038"
}