{
    "description": "Edwards Rating: I (II) S S (TO LOWER NORTH SUMMIT ONLY) Edwards Rating: II (III) M M (COMPLETE TRAVERSE) Elevation of 847 m NET, 913 m TOT and max 2859 m (2847 m officially) 5 to 8 hoursYOU HAVE TO RESERVE YOUR PLACE ON THE BUS TO LAKE O?HARA MONTHS IN ADVANCE (1-877-737-3783). OTHERWISE, YOU WILL HAVE TO HIKE 12 KM BEFORE EVEN START YOUR SCRAMBLE.This is a great scramble with few technical challenges when going to the true summit (SW), but definitely easy to the lower summit (NW). The whole traverse makes it a beautiful ridge walk with different views of the many surrounding lakes and snowy peaks.Starting from Le Relais Day Shelter, cross the road and go to the Lake O?Hara trail and then turn right. Walk up that trail, following the indications for Mary Lake and then, Opabin Plateau/ Lake. After Hungabee Lake, you will start seeing Yukness Alpine trail on the signs, follow that trail. From Opabin Lake, look up to your left for a good trail up the slope towards Yukness Mountain. You?ll clearly see the trail and cairns for the first few hundred metres until you get to a wall. There are two gullies, go to the second one and scramble up until you reach the col. If you want to do the true summit, walk on the ridge and along its right until you reach the beautiful pinnacles you can observe from the col. Right after the crest leading to these pinnacles, pass the first two narrow gullies and look for cairns in the third one. Scramble up scree/lose rocks/rock bands for a few metres until you reach a cairn on your right. Keep going right and up to the ridge, where you?ll reach the SW summit. Going back the same way down to the col, stay on the ridge for the great views and some easy & fun scrambling. You will have to lose a bit of elevation at one point when you arrive to a cliff, just circumvent on the left and go back up the ridge to reach your second summit of the day NW of Yukness Mountain. Descend under the NW summit instead of reaching back the col for an easy scree trail down. Once back to Opabin Lake, you can return the same way or stay on the right side of Hungabee Lake to go back to Lake O?Hara on a different trail for a change.",
    "directions": "From Lake Louise, continue onto Trans-Canada Hwy going slightly left to BC. About 10 km later, you will see an obvious sign for Lake O?Hara, turn left. The parking is going to be on your right after the railroad. RESERVATION REQUIRED ON THE BUS TO LAKE O?HARA.",
    "geohash": "c3jk",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/12047/long_Yukness-Mountain-Traverse-Lake-O-Hara-Easy-scrambling-to-col-Aug-29-2015-2--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12047/long_Yukness-Mountain-Traverse-Lake-O-Hara-Easy-scrambling-to-col-Aug-29-2015-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12047/long_Yukness-Mountain-Traverse-Lake-O-Hara-Hungabee-Lake-Aug-29-2015-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12047/long_Yukness-Mountain-Traverse-Lake-O-Hara-Mary-Lake-Aug-29-2015-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12047/long_Yukness-Mountain-Traverse-Lake-O-Hara-Mod-Scramble-South-Aug-29-2015-3--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12047/long_Yukness-Mountain-Traverse-Lake-O-Hara-Moor-Lakes-Aug-29-2015-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12047/long_Yukness-Mountain-Traverse-Lake-O-Hara-Welcome-On-the-right-Aug-29-2015-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12047/long_Yukness-Mountain-Traverse-Lake-O-Hara-mary-O-Hara-Wiwaxy-Aug-29-2015-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12047/narrow_Yukness-Mountain-Traverse-Lake-O-Hara-Moderate-scrambling-True-Summit-Aug-29-2015-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12047/narrow_Yukness-Mountain-Traverse-Lake-O-Hara-True-Summit-Aug-29-2015-1--44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/yukness-mountain-traverse-near-field-bc-12047",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 4,
        "Time": "6 hrs",
        "Total Distance": "11 km",
        "Town": "Field, BC",
        "Type": "out-and-back"
    },
    "title": "Yukness Mountain Traverse",
    "trail_id": "12047"
}