{
    "description": "A strenuous climb to some abandoned mica workings at the 7,000 foot level of Mica Mountain. The route begins by following old logging trails and roads which were cleared of brush for hiking in 1992, then picks up the original mule trail at the top of an early 60's logging area. Mules were once used to freight large pieces of mica - or \"ising-glass\" as it was once called - down from the mine, which is a hole in the ground at approximately 7,000 feet above sea level on a steep alpine slope. The old mule trail meanders up the brushy mountainside staying roughly 100 to 200 meters to the left of the lip of Tete Creek Canyon. At the mine, a pile of large mica flakes marks the mule loading area. On the ridge above the workings, a crescent-shaped rock shelter may be seen. It is apparently a place for heli-hikers to await pickup.The hike rewards with an amazing view of the Robson Valley including Mt. Robson, Kinbasket Lake and Canoe Mountain. Hiking to the top of ridge affords views of the back side of he range. Plan on 5 hours return at a steady pace to the mine and 6 hours if you want to head up to the ridge.",
    "directions": "From Valemount, travel north on Highway 5 to Blackman Road. Turn left on Blackman Road and follow it for several miles, then turn left onto Old Tete Jaune Road. About 2 km. down Old Tete Jaune Road, turn left on Mica Mountain Forest Road. If you come to a railway crossing, you have gone about 150 m. too far - turn around and come back to Mica Mountain Forest Road. Approximately 9.5 kilometers up the forest road, a not-very-conspicuous sign marks the trailhead.",
    "geohash": "c37",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/12053/reg_GOPR0209-53186.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12053/reg_GOPR0226-53186.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mica-mountain-mine-trail-near-valemount-bc-12053",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 5,
        "Time": "6 hrs",
        "Total Distance": "9 km",
        "Town": "Valemount, BC",
        "Type": "out-and-back"
    },
    "title": "Mica Mountain Mine Trail",
    "trail_id": "12053"
}