{
    "description": "Eva Lake is a beautiful turquoise coloured lake near the summit at Mount Revelstoke National Park. The lake was named after Eva Hobbs, an early member of the Revelstoke Mountaineering Club formed in 1909. The hike meanders through alpine meadows near the tree line and boulder scree slopes where marmots and pikas call home.There is a small cabin at the lake, built in 1928, that once was used by the park warden and is now designated as a federal heritage building. There is also an outhouse near the cabin and lockers to store food away from the bears. A trail leads around the lake to a small stream that drops off the mountain's edge down a steep ravine.About 5.4 km from the summit trail head there is a branch trail to Miller Lake, which is a short 0.4 km side trek. At 5.8 km from the trail head there is another branch trail to Jade Lake, which is a further 4 km.",
    "directions": "The trail head is at the end of the Meadows In The Sky Parkway. The parkway starts at the entrance to Mount Revelstoke National Park, just east of Revelstoke, on the Trans-Canada Highway. The parkway has many switchbacks as it climbs 26 km to the summit of Mount Revelstoke. The first parking lot at the top is reserved for RVs but can be used as an overflow if the second parking lot is full. A shuttle bus ferries people from the second parking lot to the summit every 20 minutes in the summer months but there is also a 1 km trail that connects the second parking lot to the summit.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/12059/reg_Eva001-53270.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12059/reg_Eva013-53270_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12059/reg_Eva014-53270.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12059/reg_Eva017-53270.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12059/reg_Eva019-53270.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12059/narrow_Eva010-53270.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12059/narrow_Eva015-53270.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12059/narrow_Eva018-53270.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/eva-lake-near-revelstoke-bc-12059",
    "stats": {
        "Activities": "ski-bc hike snowshoe",
        "From": "",
        "Seasons": "summer",
        "Stars": 4,
        "Time": "4 hrs",
        "Total Distance": "15 km",
        "Town": "Revelstoke, BC",
        "Type": "out-and-back"
    },
    "title": "Eva Lake",
    "trail_id": "12059"
}