{
    "description": "The start of the trail is on the road that leads to Crystal Falls.  I had noticed a well used path leading to the Mumford Brook but well away from Crystal Fall.   I looked at some topo map and noticed that the next brook over had a nice drop in elevation within a 100ft or so and also that the an old path seems to lead almost right to that spot.The first part is easy...just follow the path to the stream.  Immediately upstream of the path you may be able to jump across rocks to span the stream.  afterward it's a matter of finding the old path.  Which I did after walking maybe 200m or so.  The path is not so easy to follow once you are on it but you can follow my gps track.  At one point you cross a logged area for electrical transmission.  The fall lies about 200m beyond that corridor.  the area near the fall is surrounded by a mossy and open area.  The falls while not very tall are very scenic and have multiple levels.  The stream has carved through the rock leaving small cliffs on either side of the stream.  Unfortunately my camera died before I could take pictures so I will post some crappy phoone picts instead but don't rely on those to assess iof you want to go there....it's really worth it especially if you are already visiting Crystal Fall and the rockville Notch Fall close by.",
    "directions": "South of Kingston, take the Harmony Rd and turn on dirt road at  44.950308°, -64.888066°.  The fall are approx at  44.939122°, -64.895357°.  I will post a gps track soon.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/12056/reg_Berwick-20150911-00427-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12056/reg_Berwick-20150911-00428-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/fales-river-fall-near-kingston-ns-12056",
    "stats": {
        "Activities": "hike snowshoe",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "2 km",
        "Town": "Kingston, NS",
        "Type": "out-and-back"
    },
    "title": "Fales River Fall",
    "trail_id": "12056"
}