{
    "description": "Long Range Traverse, Gros Morne Nfld. (Early August, 2004)PreliminariesThis hike is sited as a four or five day trek over Arctic tundra and rock. Gros Morne is a UNESCO World haritage site, and the Long range Traverse  goes for aproximately 35 Km. There is no trail to speak of, and topo map reading and compass skills are essential for navigation. Now in order to do the hike, there are a few things to organize prior to taking your first physical steps.  These aren't huge hurdles, but never the less, can not be left to the last minute. First, if you have one vehicle, you must work out the logistics of getting to the trailhead, while leaving your car at the trail's end. (we hired a taxi driven by Ivan. Nice guy. Make sure you visit Norris Point for your post hike supper, he owns a restaurant there.) The second task is to book spaces on the tour boat that runs the Western Brook Pond Fjord tour. Book for the 10 AM run if you want to make that day count in terms of distance on day one. The third task is to go through the warden's meeting and obtaining your back country permit. We booked the tour boat for Western Brook Pond by phone, a month before we arrived. We made taxi arrangements on the day of the warden's meeting that tuesday. I considered that cutting it a little close, but it worked out. There are cheaper alternatives, but for 35 dollars, you know where your car is at the end of four or five days. That's peace of mind.Getting past the wardenThe one thing that could put an end to any hopes of doing this trip even after working out the other expenses and details would be fail at the warden meeting. I was pretty nervous because we've never done a trail-less hike before, and our compass and map skills prior to that were mainly academic. We've done a few exercises using the compass, nothing life and death. My girlfriend had some previous experience in Girl Guides but that was years ago. I'll admit that I was starting to make things more complicated than they needed to be, mainly because it would be the last hurdle for us getting on the trek. Compass work is really a very simple process. When you combine it with a GPS, you have two instruments to verify direction and position on the map.We got to the VIC and while waiting for the warden, watched the video that describes the Long Range Traverse hike. It was educational, and more to the point, I felt that it was accurate (a post hike observation of course) Sometimes the things these people show you are so dated, that you'd see people in external framed packs and dated clothing. This wasn't the case. While waiting, we also took the time to trace the route sketched on their topo onto our own. UTM waypoints for the campsites were written on the side, and those I copied too.Finally, the warden met with us and we talked about the route, and how many days we'd take. He has a lot of detail to say about what we'd encounter at various points along the way. I couldn't keep up in my note taking. He was pretty insistent that we take 5 days. We told him that we have five days scheduled, but planned to cover it in four. We spoke of our other back country hiking experiences both summer and winter to give an indication that we tend to cover ground quickly, and then asked him what segments would be most rapidly covered on this trek., He gave us a few suggestions, still insisting on five days. He wanted to see what we were using for navigational tools. We showed him our compass and also the GPS I use. I explained that we have a backup compass as well that we didn't bring to the meeting. He thought that our sighting compass would work well enough and was very satisfied with my GPS unit. It's a Garmin Etrex Venture, apparently the same ones issued to the wardens there. I found that although the write-ups given by the park state that a GPS wasn't a foolproof method for navigation, the warden seemed to be put to greater ease knowing that we had one. He made a point to mention the \"leave no trace\" mantra and said, based on what he saw of the items we brought, \"I suppose you have all the latest in gear\" so there's nothing to worry about. I mentioned the stove I use, and what we use to treat our water but didn't feel the need to make too much of everything else we planned to carry.  We had a good system by now. He was satisfied with our forethought, but told us that we needn't carry more than a liter of water each, since there were plenty of springs along the way. He even said that the water there is very good, and that he personally didn't bother treating it. We took the advice, and that saved us carrying a lot of extra weight. Finally, he wanted us to demonstrate our compass skills by giving us a location on the topo, and asking us to find the bearing for Gros Morne Mountain. I proceeded to take my compass and go through the exercise. I told him the bearing number and pointed in the direction that I derived from the process. Well, I was correct! (thank god, I would have shit myself otherwise.) He then told us a story of an other group who screwed up their declination setting and failed the exercise. He then asked the question to them, \"do you think it's safe to let you go?\"Well, I was relieved that was over. We chatted a bit longer with a few questions about the area and and some navigational questions, and then we were on our way. We paid for the permits (67 dollars each) and they gave us a tracking device to put into our packs. It was a bit larger than the size if a AA battery with long wire antenna. He said with that, they could find us within a half hour if we didn't report back. Later on, I joked that as we found our way along the terrain, there would be the warden at his station looking at some computer display watching a little blip-blip of us going off-course with his finger poised over the panic button. That would be the whole interaction through out our journey.With that, we headed to Berry Hill campground and made camp for the night. We also checked our packs that everything was in order with some of the time we had to kill.Day 1 From Tour boat to getting out of the FjordWith anxious nerves, we packed up early to meet Ivan at the Gros Morne trailhead. All went as planned, and we arrived early at the Western Brook pond tour boat dock. (I's the by' tours) The hike along the board walk was a long one to get to a tour boat. Easy in terms of what we'd be getting into later. We saw no other hiking parties there as we waited for the departure time. You see, I had called a while back in order to find out how many other groups would be going on the same day. (three tents is the limit per day)  I was informed that there were to be two other groups. That made me wonder what the group dynamic would be. Would we end up following one person, or would we get into disagreements, or what would happen? In the back of my mind, I figured with other groups there, we'd end up followers and the whole navigational thing wouldn't end up mattering. Well, it was sobering when I didn't see any other groups that morning. We were definitely doing this on our own, and it was entirely up to us to do this right. (reality setting in?)The tour got underway. The weather, to our great fortune, was sunny, with a light haze. It was chilly in the morning, so we needed our shells. Onboard, they took our permits and stowed our packs below deck. Wildlife was scarce on the tour, but someone mentioned to us that we'd be seeing tons of caribou and mouse where we were going. I smiled.When we got to the dock, the narrators of the tour mentioned the Long Range Traverse hike for \"Seasoned hikers\" and people were staring at us as our packs and permits were returned. No one is allowed off the boat unless they have a valid permit. People were talking about it, and a guide for a walking group on board, said to us as we got off the boat, \"Good luck, you'll need it.\" Jeeze, nice guy! I thought of the tag line to Sunto compasses... \"replacing luck.\"As the boat sped away, and everyone waved, I had that sobering feeling return. There we were, left to our own resources to make it back home. Leaving that boat was severing the last chance to bail out. But why would we bail on this opportunity?We got ourselves ready by putting on gators and fine-tuning our pack adjustments. I wanted to check out the water around the dock because the narrator mentioned that because it was so deep, it was quite cold. At least around the dock, I think one could swim in it comfortably enough. At last, I took a picture of our first objective; the steep cliff-tops of the fjord,  600 meters up. We set a bearing, and  our 4 day adventure was under way.I didn't bother with the GPS for most of this section because there was pretty dense tree cover as we headed toward the incline. The terrain varied between forest canopy, meadows, and foot hills. Rocks the size of cars were strewn everywhere. For this section at least, there was a well trodden hunting trail to follow. We past the dock's primitive tent platform and headed inland a few kms before reaching a dried up creek bed. We had read an account from a fellow named Matthew Hogg (http://www.littlewoodenman.com/tke/) who did this hike a few years back, and we were using that to familiarize ourselves with what we were encountering. The dry creek bed was a good sign. The trail crisscrossed it, and sometimes we'd loose it all together. We weren't too concerned however because we were headed toward a narrowing wedge. One couldn't go all that wrong. One thing to remember from the warden's meeting was to keep to the right of the waterfall. As we made our way up, we thought we could hear a waterfall, and it was to our left.By then, things were getting very steep. At some points, we were having to grab hold of branches and roots to haul ourselves up. Occasionally, we'd get onto a path that would vanish. So two pairs of vigilant eyes were an asset. I don't think we would be able to duplicate our path a second time if we tried.When we got to what I thought was the waterfall, I was a bit taken aback. It didn't seem to amount to what it was talked up to. Also, we could start to see the smooth faced cliffs of the fjord walls above us, and figured that we were not where we were suppose to be. Because I thought I heard more water to our right, we ventured over, and sure enough, there was a considerably larger waterfall. Unfortunately to our right.I marked the correct waterfall's position on the gps, for future reference, and we proceeded to cross the rocks and logs at its base. This was somewhat risky business. Actually, I felt that the whole climb out of the fjord was risky business due to the weight of our packs and the steep and tangled incline we were up against. I don't know how we managed as well as we did. It attests to fresh legs and tons of energy I guess.We continued to pick up and loose trails as we ascended and finally, we came across smooth but climbable rock that a path seemed to go through. To our left was the water source for the waterfall. We were on track and delighted. Before long, we reached the money shot of looking back over Western Brook Pond Fjord. The weather was great. Windy in the exposed area, but still sunny. We spend some time to eat a lunch and take photos. I even had shannon (nicknamed shanette since we both have the same name) walk back 50 feet and then walk towards me for an action shot. (with pack on) I am always hoping for that ever elusive MEC catalog shot. One day I'll get it.We rested there for about 15 minutes before packing up to finish the climb. There was still a bit to ascend before getting out of the fjord. The final part would be much more straight forward since it was mainly grippy granite we were treading on. Heavens knows how difficult that would have been if it were wet. When we finally neared the top, we had some mild rock climbing to do. Fortunately, the hand-holds were jug like, and we made it out. It took four hours to climb out of the fjord. 3 PM. The view back was a classic. The view toward our next bearing was one of a waste land of endless wilderness. Time for the topo map and compass.We surveyed the terrain, instantly spotting two things. One was a big body of water below, and the other, a well beaten path leading to the right; right on course. A bit disappointing to find a trail in such wilderness, but what the heck. We thought that maybe the trip wouldn't be so navigationally challenging after all. (we were later going to regret the notion, but that was an other day.We took the path, and it pretty much lead us to our first campsite at Little Island Pond. 1.5 Km away. It was now a quarter to 6pm. We reached the tent platforms and set up camp. A strenuous day had successfully reached its end. Time for food, drink and route plotting for tomorrow. (and a skinny-dip in the cold water of the pond to cool off!)The food we brought was MountainHouse brand dehydrated meals. Compared to what we tried last time, this stuff was awesome. it cost a little more per package, but man, it was tasty. I still think that a 2 portion package feeds only one and a half hungry hikers.Day 2Wow, what a day. It started at a quarter to five in the AM with a moose walking by our site. The first part of the day continued in just as good a way, but things turned a bit less than fair after that. In four words, rain and getting off track. By day's end, my toes were sore. We had soaked boots and three pairs of wet socks, and a damp down bag. It certainly was an adventure! Our journey toward Mark's Pond was uneventful, but I think we grew too accustomed to following a footpath, and started drifting off course. Why didn't I question why the waypoints were going to the right slightly. (I had reoccurring images of the ranger poised over that panic button) After Mark's pond, the rain started.During a break, I used the GPS to discover that we had strayed toward Candlestick Pond. (Note three tiny little islands) So we were 2.3 Km off course from our nearest waypoint. To bushwhack back on course, we had to climb over hills, go through thick tangles of tuckamore, ford brooks and descend small cliffs. We found the cabin from an older route, and continued to skirt the ponds toward our nearest waypoint. Finally, we crossed a trail fairly close to the route, and declared ourselves back on course. (Two and a half hours later.)We were rewarded soon after by crossing three tent platforms (civilization!) and deemed it to be Harding's Pond. By then it was 3 PM. Despite being wet (how wet can one's feet get, really?) we figured that since the track was good and clear, we'd press on to Green Island Pond. We stopped to mark and record a few more GPS waypoints in order to keep our route in check.When we started out again, we ran into a problem right away. Either I made waypoint mistakes, or the route we were taking was drifting off course again. It was 4 pm by then and we didn't want to continue off course and get stuck for the evening, especially with the rain. Consequently, we turned back for Harding's Pond. By then, good fortune had it that the sky was clearing up, and the rain has stopped. It was actually getting warm when the sun was out. A cold night ahead, I figured.After the tent was up, shannon prepped the inside, while I tried to dry out our boots, socks, and a sleeping bag. I figured that bags for our feet would be in order for tomorrow. Our boots wouldn't be dry for the rest of the trip either I guessed. The inside of our packs stayed pretty dry otherwise, and extra socks were a great thing to bring along. Our food that night was beef teriyaki, and now two times in a row, we had a winner for dehydrated meals. Hats off to Mtn House.  Since we skipped lunch that day, I ate that food too in order to restock my energy levels. Talk about being hungry!That evening, I decided to double check the co ordinates and re-enter them just in case they were in error. A note here about Shannon on the trip, she has been absolutely incredible. Her compass work in concert with the GPS has been a huge help. It's been a great partnership, and she's damn strong too! A great girl, she is.We decided based on nearly two off course errors, that we had better rely more on our instruments, and less on game trails. If the path went one way, and the bearing said otherwise, we'd make a B-line. We wanted to cover extra ground tomorrow, and couldn't afford mistakes.Day 3.Footprint! That word both screwed us over and comforted us a few times so far on this trip. After yesterday's experiences, we wanted to be darn sure we were on route. Game trails were just that. Trails made by animals. You can't rely on them at all. Consequently, some of our B-line excursions today took us over scree, steep talus fall, thick tuckamore, (I think I lost my zip off pant legs there) around ponds and through creeks where we had to ford across barefoot. It got to the point where until the last few hills prior to Ferry Gulch, we had little to no path to speak of. Nothing we'd trust anyway.This was definately the day for wildlife sitings too. We saw caribou by the groups, and came across one or two additional moose. As we rounded toward Green Island Pond, one big bull stood right on our route. We used our whistles and shouted for it to move with out challenging it. We ended up sitting down and taking a break (moose break) to snack a bit and to plot in some more waypoints. By then, the moose wandered to a near by pond to bathe. It was probably 30 feet away when we walked by. Seeing the tent platforms at Green Island Pond was a comforting sign of being on track. good timing too. it was about 2:30 with enough time to reach Ferry Gulch if we push for it.The terrain was a bit easier going, with occasional montainous hills to climb and then get down from. Sometimes descending would put us off course too. That's how we rounded into Green Island Pond. By a different direction. There were two big money shots after passing Green Island Pond. One was Ten Mile Pond, and the other near trip's end was Ferry Gulch. Ten Mile Pond hit us quickly, adding to the wow factor. You could also see the cliff edges of Baker's Brook Pond, but we never did see a good view. Judging by its surrounding terrain, it would have been quite the challenge.We eventually came across a well trodden path on our bearing about 2-3 Kms from our final destination.The prints were fresh and going both ways, so I figured people were using it to come and go to from Ferry Gulch to view the TMP fjord. This picked up our pace until we were about a hill away from the edge. At that point we lost the trail. Back to bushwhacking through more tangles and steep descents. Finally we came across the cliff edge, over which we saw Ferry Gulch disappearing into the shade of Gros Morne Mountain in the setting sun. What a long way down, and what a day! We still had a huge descent to muster on trail-weary legs. Just then, we saw a Search and Rescue chopper. We hoped that it wasn't coming for us. Just then, it headed to the top of Gros Morne Mountain. We later heard conflicting stories of either someone suffering a fall, or someone getting dehydrated. Not sure which.Eventually a path on our bearing headed toward the edge, and there we found a path leading to a dry steep creekbed with huge fallen talus. That was our way down. The warden warned us about how steep this was. Going slowly, we carefully made our way. We reached our destination by a quarter to eight. After setting up the tent, dinner was our next concern. Again, we had skipped our lunch break to make up time. Continually munching on trail mix and taking in water made this less of a suffering.Well, as far as I was concerned, the main challenge of the trip had come to a finish. We did it in three days. All that was left was to take the 4 hour hike along a marked trail that traversed the edge of Gros Morne and back to the car. That would be for day four of course.  We finally met up with the originator of the boot print we had frequently seen as we visited with two other parties who left a day before us. One group a couple, and the other, a party of one. A guy from BC. Day 4We couldn't take off for home on our final day without doing the obligitory climb of Gros Morne Mountain. We took the path and the stairs leading to the top. Took a few pictures of ourselves at the highest point, and snapped a uniquely different view of Ten Mile Pond. We rushed through this time because we had been there last year, taking more of its detail in then.With that, we packed up and headed to the parking lot. Mind you, this wasn't an easy trail, but never the less, much more brainless sans the route finding. By early afternoon, we were back to the parking lot and feeling quite giddy that we just completed what was considered the East Coast's most challenging hike. Four days and it was in the bag. As we left the parking lot on our way to Norris Point for a well earned meal, we were wondering what sort of challenge we'd do after this one. I think it will have to be a tall order to beat this one.Shannon Burt",
    "directions": "Go to Western Brook Pond Fjord to take the tour boat ride.",
    "geohash": "f8",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NL/1205/reg_10milepond.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/1205/reg_120181jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/1205/reg_170112jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/1205/reg_170186jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/1205/reg_24A0024jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/1205/reg_24A0169jpg_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/1205/reg_24A0329jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/1205/reg_60224jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/1205/reg_IMG-0055-10324.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/1205/reg_IMG-0070-10324.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/1205/reg_IMG-0071-10324.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/1205/reg_grosmorne.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/1205/reg_longwaydown.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/1205/reg_overfjord.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/1205/topo_outoffjord.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/1205/narrow_180089jpg.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/long-range-traverse-gros-morne-nfld-near-deer-lake-nf-1205",
    "stats": {
        "Activities": "climb hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 5,
        "Time": "25 hrs",
        "Total Distance": "35 km",
        "Town": "Deer Lake, NF",
        "Type": "out-and-back"
    },
    "title": "Long Range Traverse, Gros Morne, Nfld.",
    "trail_id": "1205"
}