{
    "description": "Edwards Rating: II (III) L LElevation of 1404 m NET, 1847 m TOT & max 2800 m (2795 m officially)7 to 9 hoursThis is a long and boring approach with bushwhacking, some route finding, nice and easy but steep hands-on scrambling but rewarding & magnificent views. There are pretty much no indications, cairns or trails after you hiked the first 7 km. It?s all about finding the best possible animal trails up to the large avalanche gully under the summit. For the first 7 km, you can use a bike (I wish I had one?!).Hike about 6.9 km on the popular Redearth Creek trail, just after you crossed 2 bridges in a row. You?ll see a campsite on your right, turn there to find the trail leading to the food storage. After a few metres, you will get to the wood platform and see a trail going up the grassy slope, that?s where bushwhacking begins. Try not gaining too much elevation yet and make sure you take the first faint trail on your right. You will have to cross the first forest and come across a drainage at one point. Go up that drainage for about 50 metres and get out to find another animal trail to sideslope across the meadow and then into the second forest. Find again the best possible animal trail to go through and you?ll come across a second drainage. Use it for about 100 metres up and get out on your right again to cross the last meadow and avoid the other forest by gaining a bit of elevation this time. At that point, you will start to see a very large avalanche gully further on your left. You can hike up the grassy slope for a while to slowly gain that gully staying left the gully when you reach it. At some point you can go in the gully when you see a weakness or if you are comfortable going down slabs. Keep gaining elevation in the gully and make sure you always stay left (the gully splits at some point). It will open on another grassy slope with impressive vertical slabs on your left. Keep going up and towards the left walls until you find a weakness to start very fun hands-on scramble on good rock but on a very steep terrain. We had snow, rain, thunder and sun that day. We were lucky enough to have dry conditions at that point. This scrambling section is in between two little peaks and along the vertical slabs. There are many ways up, you can just go straight up if you can and you will eventually arrive to a beautiful platform (yes, this is the summit) where you turn right to attain the summit cairn.The views are absolutely exceptional and even though it was a long approach and sometimes frustrating bushwhacking, it was worth it! Descend the same way. We did take a slightly different path on the way down and we shouldn?t have, our ascent trail made more sense.",
    "directions": "From Banff last exit, drive about 19 km west up to a well-signed parking lot for Redearth Creek trailhead on your left.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/12061/long_Copper-Mountain-Banff-Impressive-vertical-slabs-Sep-13-2015-2--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12061/long_Copper-Mountain-Banff-Route-finding-before-summit-Explained-Sep-13-2015-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12061/long_Copper-Mountain-Banff-Sep-13-2015-15--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12061/long_Copper-Mountain-Banff-Steep-but-easy-fun-scramble-Sep-13-2015-4--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12061/long_Copper-Mountain-Banff-Steep-but-easy-fun-scramble-Sep-13-2015-5--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12061/long_Copper-Mountain-Banff-Summit-Shadow-Lake-Stanley-Glacier-Mt-Ball-Sep-13-2015-1--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12061/long_Copper-Mountain-Banff-Summit-WOW-Sep-13-2015-13--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12061/long_Copper-Mountain-Banff-Summit-WOW-Sep-13-2015-14--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12061/long_Copper-Mountain-Banff-Summit-WOW-Sep-13-2015-8--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12061/long_Copper-Mountain-Banff-Summit-WOW-Sep-13-2015-9--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12061/reg_Copper-Mountain-Banff-Summit-WOW-Sep-13-2015-19--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12061/narrow_Copper-Mountain-Banff-Rain-again-3x-but-how-beautiful-today-Sep-13-2015-1--44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/copper-mountain-near-banff-ab-12061",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 3,
        "Time": "8 hrs",
        "Total Distance": "20 km",
        "Town": "Banff, AB",
        "Type": "out-and-back"
    },
    "title": "Copper Mountain",
    "trail_id": "12061"
}