{
    "description": "Tuktakamin Mountain is the highest point on the ridge that forms the south side of the Salmon River Valley near the town of Falkland, BC. This hike offers beautiful vistas of the Salmon River Valley as it climbs a fairly steep grade towards three microwave tower installations at the mountain's peak.Sections of the trail are fairly steep, reaching grades approaching 30%. Elevation gain is about 370 meters over 2.9 km to the summit.The hike forms a loop around a ravine that flows to the Salmon River. The south trailhead begins in a newly deforested area where there is room for parking (there is little room to park near the north trailhead). Recent logging activity at the south trailhead has left only stumps with trail markers, and the trail itself is hard to find due to debris. Hike the logging road a short distance to find the trail. Once on the trail it is well marked as it runs the ridge on the south edge of the ravine towards the summit.Past the summit, the trail continues down the north side of the ravine towards the north trailhead. From here it is a short walk back via logging road to the south trailhead and parking area.Alternatively, one can park near the south trailhead and hike to the north trailhead, on to the summit, and then down the south side of the ravine to the south trailhead and parking area.",
    "directions": "The best access route is via Ingram Creek Forestry Service Road 1 km east of Westwold on Hwy 97, 13.5 km west of Falkland. Follow Ingram Creek FSR 6.5 km, turn left on Will Lake FSR and follow the TUK signs a further 5 km to the south trailhead. This is an active forestry road so watch for logging activity. The road is in good condition as it acts as the access road to Pinaus Lake, a popular recreation site.Access can also be via two deactivated forestry service roads 10 km west of Falkland. These roads require a 4x4 and have several deep washouts.",
    "geohash": "c2fzn",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/12075/reg_Tuk01-53270.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12075/reg_Tuk03-53270.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12075/reg_Tuk05-53270.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12075/reg_Tuk17-53270_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12075/narrow_Tuk02-53270.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12075/narrow_Tuk11-53270.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12075/narrow_Tuk13-53270.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12075/narrow_Tuk14-53270.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12075/narrow_Tuk16-53270.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12075/narrow_Tuk18-53270.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/tuktakamin-mountain-loop-near-vernon-bc-12075",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "5 km",
        "Town": "Vernon, BC",
        "Type": "out-and-back"
    },
    "title": "Tuktakamin Mountain Loop",
    "trail_id": "12075"
}