{
    "description": "Edwards Rating: I (II) S MElevation of 1142 m NET, 1207 m TOT and max 2923 m (2914 officially) 4.5 to 7 hoursThis is not an exceptional scramble but a good training with over 1100 metres of elevation in just 4 km one way. It may be possible to do it in winter conditions with proper gear & avalanche knowledge. It was so cold up there, even with a 15 degrees day so be prepared. The views are very rewarding and you have a great panorama from the beginning of the outlier?s crest up to the summit. This peak is the highest point of Mount Kent.From the parking lot, walk behind the outhouse and slightly left until you reach a metal gate. From there, the only difficulty will be that there are a lot of trails. After only a few metres, you will see a snowshoe trails sign, take the right trail. At the second intersection a few minutes later, go left. There?s a third intersection that you take on your right and it?s pretty much straightforward from now on. You should have open views on the outlier and the summit after about 25-40 minutes. Just hike up to the outlier?s cairn. Lose some elevation on its right sidesloping for a few metres and then gain back the col and just go straight up to the summit. There were some snow patches and the ground was frozen so we took a different path up from the col thinking it may be safer. But it was easy and stable even right under the summit to the col, where we went back down on a boring but easy slope with boulders. There are many other options it seems where you wouldn?t have to lose elevation from the outlier. But we liked doing it that way to take advantage of the great views and avoid bushwhacking or route finding.",
    "directions": "From Calgary, follow Trans-Canada Hwy/AB-1 W to Kananaskis Trail/AB-40 S and take exit 118. Drive south for about 50 km and turn right on Kananaskis Trail/AB-742. Drive 2.2 km to the Smith Dorrien Trail junction and turn right for another 14 km to the sawmill parking lot that will be on your right (there?s an obvious sign for it).",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/12079/long_Kent-Ridge-North-Summit-Kananaskis-Chester-Sep-27-2015-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12079/long_Kent-Ridge-North-Summit-Kananaskis-Summit-Sep-27-2015-4--44639_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12079/long_Kent-Ridge-North-Summit-Kananaskis-Summit-Sep-27-2015-9--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12079/long_Kent-Ridge-North-Summit-Kananaskis-Summit-View-Lawson-Sep-27-2015-1--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12079/long_Kent-Ridge-North-Summit-Kananaskis-Summit-View-Lawson-Sep-27-2015-2--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12079/long_Kent-Ridge-North-Summit-Kananaskis-Summit-from-outlier-Sep-27-2015-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12079/reg_Kent-Ridge-North-Summit-Kananaskis-Mountain-Goat-Sep-27-2015-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12079/reg_Kent-Ridge-North-Summit-Kananaskis-Welcome-Sep-27-2015-44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/kent-ridge-north-summit-near-kananaskis-ab-12079",
    "stats": {
        "Activities": "hike snowshoe",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "6 hrs",
        "Total Distance": "9 km",
        "Town": "Kananaskis, AB",
        "Type": "out-and-back"
    },
    "title": "Kent Ridge North Summit",
    "trail_id": "12079"
}