{
    "description": "Edwards Rating: I (I) M MElevation of 1294 m NET, 1325 m TOT & max 2276 m4.5 to 6 hoursThis is simply a hike really, even though it is steep all the way from the very beginning. It makes it a good workout up to the ridge and a very annoying descent for your knees. Once at the ridge, it is a nice and short walk to the highest point with great views for a low elevation like that. Look up for a huge cairn painted in white for the parking by the trailhead.We almost felt like we were back to Quebec with a long approach in the forest and similar viewpoints throughout the ascent. Once you found the parking lot (the only ?route finding? of the day?!), it is an obvious trail all the way up with switchbacks for about 4km. Some switchbacks will lead you on the wrong way; always look up to keep going on the right trail. We actually missed a turn once and had to hike up and through a rock band to find back the official trail 2-3 minutes later. We blocked that trail on our return and some others with rocks and tree branches. Once the trail leads to an open slope with boulders and rock debris, keep left and up to ridge directly. Go right on the ridge towards the valley where you should see a first big cairn. This is not the summit yet, you got to keep going about 500 m slightly on your right where another large cairn awaits for your summit picture.",
    "directions": "From Field, keep going west on the Trans-Canada highway in direction to Golden. Start your odometer at the kicking horse rest area and drive for an extra 5.4 km. Turn right and find the small parking lot on your left, a few metres up that road. From Golden, drive east and start your odometer at the Highway 1/95 junctions for 6 km and park at the pullout on the south side of the highway or keep going to the kicking horse rest area to turn back and park in the parking on the north side",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/12070/long_Table-Mnt-Golden-Few-viewpoints-from-the-forest-Sep-19-2015-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12070/long_Table-Mnt-Golden-Nice-Valley-Up-There-Sep-19-2015-2--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12070/long_Table-Mnt-Golden-Nice-Valley-Up-There-Sep-19-2015-4--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12070/long_Table-Mnt-Golden-PRK-Trailhead-Sep-19-2015-1--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12070/long_Table-Mnt-Golden-PRK-Trailhead-Sep-19-2015-2--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12070/long_Table-Mnt-Golden-Summit-Sep-19-2015-1--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12070/long_Table-Mnt-Golden-Summit-Sep-19-2015-4--44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/table-mountain-near-golden-bc-12070",
    "stats": {
        "Activities": "hike snowshoe",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 3,
        "Time": "5 hrs",
        "Total Distance": "11 km",
        "Town": "Golden, BC",
        "Type": "out-and-back"
    },
    "title": "Table Mountain",
    "trail_id": "12070"
}