{
    "description": "This is a 12 miles crossover, starting at the First Water Trailhead (2200 Feet) and hiking to the Peralta Trailhead (2430 Feet). This is not a hike for a very hot day as there are several sections without shade.The trail junctions onto the Dutchmen Trail at 1/3 mile out and continue gradually up to Parker Pass at the 2 1/2 mile mark.The trail is easy to find as it moves generally downhill to the Black Mesa junction at 4.4 miles. Go straight ahead, at the junction, passing the junction to Bolder Canyon at 4.6 miles. The trail bends to the right under a yellowish cliff and branches to the right onto the Peralta trail at 5 1/2 miles out. There are trail signs at all to the last four junctions to keep you on the right path.The trail now starts its main climb up to Fremont Saddle at the 9.5 mile mark; an elevation of 3740 feet. After Fremont Saddle the hike proceeds generally downhill on a well-used track which is rubbly in places. After a total of about 12 miles you will reach the Peralta Trailhead, where you will have had to arranged for a ride back.The entire trail can also be done in the reverse order, starting at the Peralta Trailhead.",
    "directions": "The First Water Trailhead can be accessed from the Apache Trail in Apache Junction, Traveling North on Apache Trail, go past the junction to the Dutchmen State Park to the junction with the First Water Road. This is a dirt road of about 5 miles that can be rough at times.The Peralta Trailhead can be accessed from Highway 60 East of Gold Canyon at the Peralta Turn off. There is a sign to show the location of the left turn (north). This is again a dirt road for all but about 1 mile and it can also be a bit rough in places, particularly near the end of the 7 miles.",
    "geohash": "9tb",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/AZ/12081/reg_2015-02-19-FIRST-WATER-PERALTA-CROSSOVER-012-53646.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/12081/reg_2015-02-19-FIRST-WATER-PERALTA-CROSSOVER-013-53646.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/12081/reg_2015-02-19-FIRST-WATER-PERALTA-CROSSOVER-018-53646.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/12081/reg_2015-02-19-FIRST-WATER-PERALTA-CROSSOVER-019-53646.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/12081/reg_2015-02-19-FIRST-WATER-PERALTA-CROSSOVER-020-53646.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/12081/reg_2015-02-19-FIRST-WATER-PERALTA-CROSSOVER-021-53646.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/12081/reg_2015-02-19-FIRST-WATER-PERALTA-CROSSOVER-022-53646.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/first-water-to-peralta-near-apache-junction-az-12081",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall winter",
        "Stars": 5,
        "Time": "6 hrs",
        "Total Distance": "19 km",
        "Town": "Apache Junction, AZ",
        "Type": "out-and-back"
    },
    "title": "First Water to Peralta",
    "trail_id": "12081"
}