{
    "description": "Located on Burke Mountain above  Coquitlam, the Woodland Walk Trail passes through Pinecone Burke Provincial Park to the scenic Sawblade Falls and continues on to Woodland Falls . The trail begins near the top of Harper Road where there are two entry points that will alter the length of the hike.  It's also worth noting that there is considerable noise from gunfire courtesy of  the Port Coquitlam and District Hunting and Fishing Club.For the longer route (13.6 KM) the trail for the Woodland Walk begins right at the first metal gate along Harper Road -- past the hairpin turn on the gravel section.  The trail starts just to the left of the gate and weaves its way up hill until the trail reaches a gravel forestry road; about 15 minutes.   Turn left and go up the gravel road for about 1 KM and you will see a sign to your left directing you back onto the trail.  Ignore all of the orange paint; they are trail heads for bike trails.The shorter (official) route (10.4 KM) for the Woodland Walk begins right at the second metal gate along Harper Road.  The trail starts just to the left of the gate and weaves its way up hill, over wooden steps and planks. Within 10 minutes or so the trail reaches a gravel forestry road. You will see a sign immediately to your left directing you to the route.Continue until you reach a gravel road (power lines) and turn left, and continue across the bridge over Prichard Creek. Within a few minutes you will see signage for the Upper and Lower Loops.  The Upper Loop gets you off the road and into the forest more quickly.  The way-finding for the rest of the trail is very good.",
    "directions": "Take Coast Meridian Road to Harper Road and turn right. Follow Harper Road until it becomes gravel.  The first trail head is just after the hairpin turn.  The second is about a 1/2 KM beyond.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/12088/reg_DSC00760-hdr-44680.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12088/reg_DSC00802-44680.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12088/reg_DSC00827-hdr-44680.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/woodland-walk-pinecone-burke-provincial-park-near-coquitlam-bc-12088",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "10 km",
        "Town": "Coquitlam, BC",
        "Type": "out-and-back"
    },
    "title": "Woodland Walk -- Pinecone Burke Provincial Park",
    "trail_id": "12088"
}