{
    "description": "Edwards Rating: III (III) S M Elevation of 1302 m NET, 1570 m TOT and max 2849 mSummit 6 to 9 hoursThis is a superb and fun scramble involving route finding, some hands-on scrambling and awesome scrambling up stairs shaped rock bands. The views are spectacular all the way up! We had hard time finding the best way to go on our ascent and we did quite a bit of route finding. Make sure you choose the right gullies up or that you have good route finding skills. Some sections are steep with climbing involved if not taking the route I recommend. Our GPS track is our descent route only to avoid confusion.From the parking lot, walk back up the road 500 metres and cross the highway to find the trailhead cairn, right in front of the large avalanche gully. Walk straight up for a couple hundred metres and then bushwhack slightly to your left (in the ?boulder field?) to eventually get into that drainage/gully just left of the largest gully. If you stayed in the largest one (further right), it?s okay as long as you turn left and along a cliff at the tree line. If in the right drainage, it will split into two gullies (we took the left one) half way up and you will see a huge ?orange cliff?. You need to get to that cliff and turn left to walk along the wall to where it ends. Take the gully on your right at this point, you need to scramble up and slightly right until you reach another cliff, with black rocks this time (see pictures). Turn right and walk along this cliff for about 100 metres or so, where you?ll see an opening on your left. Start scrambling up and eventually, you will have to angle left to gain the ridge as soon as possible. Once on the ridge, turn right and complete your ascent with this awesome ridge walk to the summit, a few hundred metres further. We put a lot of cairns on our way down as there were not much to guide us, hopefully you will find them to be useful. We did it in October and it was tricky sometimes with some snow patches and mud. I definitely recommend doing that scramble in dry conditions as it is steep and a fall could be fatal if snowy in the gullies. To us, it seemed like it was more of a moderate-difficult scramble than moderate as there are so many options up there (some difficult) and route finding skills are essential.",
    "directions": "From Banff, stay on Trans-Canada Highway and take the AB-93 S exit at Castle junction. Start your odometer for an extra 13.5 km from the junction and park at the Stanley Glacier parking lot on your left",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/12090/long_Mount-Whymper-Banff-Almost-back-to-the-car-beautiful-Oct-4-2015-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12090/long_Mount-Whymper-Banff-Finally-getting-closer-Oct-4-2015-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12090/long_Mount-Whymper-Banff-HOW-TO-1-Oct-4-2015-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12090/long_Mount-Whymper-Banff-HOW-TO-4-Oct-4-2015-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12090/long_Mount-Whymper-Banff-HOW-TO-5-Oct-4-2015-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12090/long_Mount-Whymper-Banff-HOW-TO-6-Oct-4-2015-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12090/long_Mount-Whymper-Banff-Just-starting-Oct-4-2015-2--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12090/long_Mount-Whymper-Banff-Oct-4-2015-4--44639_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12090/long_Mount-Whymper-Banff-Summit-Ridge-Oct-4-2015-10--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12090/long_Mount-Whymper-Banff-Summit-Ridge-Oct-4-2015-4--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12090/long_Mount-Whymper-Banff-Summit-Ridge-Oct-4-2015-6--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12090/long_Mount-Whymper-Banff-Wrong-way-was-getting-crazy-Oct-4-2015-1--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12090/reg_Mount-Whymper-Banff-HOW-TO-2-Oct-4-2015-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12090/narrow_Mount-Whymper-Banff-HOW-TO-3-Oct-4-2015-44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mount-whymper-near-radium-hot-springs-bc-12090",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 4,
        "Time": "7 hrs",
        "Total Distance": "9 km",
        "Town": "Radium Hot Springs, BC",
        "Type": "out-and-back"
    },
    "title": "Mount Whymper",
    "trail_id": "12090"
}