{
    "description": "Doing the hike counterclockwise, the trail starts just west of the Sandy McNabb road junction. You can also hike from the Sandy McNabb Campground parking and then across Highway 40 going north.The trail is well marked throughout, but you need to pay attention to the trail signs, as there are several trails leading off the main Death Valley trail.Cattle are in the area in the summer and fall and can cause significant muddy spots, particularly after the Fall roundup.At about 7 KM out you'll come to the Death Valley creek and you'll need to find a good place to cross; usually it is an easy task. After crossing the creek you'll be on the Windy Point trail.There is an alternative trail across to Windy Point at about 5.5 KM out, which is 1 1/2 KM from the creek crossing and cuts off about1.8 KM from the loop.Follow the Windy Point trail for 5 KM from the creek crossing, to the Foran Grade junction at 11.7 KM out.The Foran Grade trail goes left and up the hill for about 100 meters, but it provides several good vistas along its length. Foran Grade ends at Hwy 546 at about 15.2 KM out, after which you'll go across the highway and follow the Sheep River trail back to Sandy McNabb.Alternately you could elect to continue on the Windy Point trail, from the Foran Grade junction, to the highway, but you would either need a pickup at that point or you would need to hike down the Sheep River trail to Sandy McNabb. This full loop is 16.6 KM long with a cumulative elevation gain of 680 meters.",
    "directions": "Sandy McNabb junction is 21 KM west of Turner Valley on highway 546. There is parking across from the junction to the Sandy McNabb Campground and at the Campground area.",
    "geohash": "c3n8",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/12102/reg_2014-10-13-DEATH-VALLEY-WINDY-PT-FORAN-GRADE-008-53646.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12102/reg_2014-10-13-DEATH-VALLEY-WINDY-PT-FORAN-GRADE-009-53646.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12102/reg_2014-10-13-DEATH-VALLEY-WINDY-PT-FORAN-GRADE-026-53646.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12102/reg_2014-10-13-DEATH-VALLEY-WINDY-PT-FORAN-GRADE-027-53646.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12102/reg_2014-10-13-DEATH-VALLEY-WINDY-PT-FORAN-GRADE-029-53646.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12102/reg_2014-10-13-DEATH-VALLEY-WINDY-PT-FORAN-GRADE-030-53646.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12102/reg_2014-10-13-DEATH-VALLEY-WINDY-PT-FORAN-GRADE-031-53646.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/death-valley-windy-point-foran-grade-loop-near-turner-valley-ab-12102",
    "stats": {
        "Activities": "mtn-bike ski-xc hike snowshoe",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 5,
        "Time": "5 hrs",
        "Total Distance": "17 km",
        "Town": "Turner Valley, AB",
        "Type": "out-and-back"
    },
    "title": "DEATH VALLEY-WINDY POINT-FORAN GRADE LOOP",
    "trail_id": "12102"
}