{
    "description": "This was an amazing alpine adventure!  We went on a perfect sunny day and were treated to amazing views and got some great photos.The route starts at the Peyto Lake viewpoint trailhead near Num-ti-jah Lodge.  Once reaching the lookout, take a trail that starts just above the second lookout up to the Lake.  There were lots of cars in the parking lot by the time we got there (late start - almost 10am!) but the crowds thinned after the lookout.  We only say a handful of people up to and around the lake and only one other couple on route to the summit itself.  Anyway, you'll lose about 300m of elevation going down into the flatland at the valley floor, head towards the narrows and just pass cross the bridge spanning the creek.Follow the moraine to the top of the ridge.  Here, the trail forks, take the right to the Lake.From the ridge, we hiked up ridge between Mistaya Mountain and Caldron Peak.  There are absolutely amazing views from the ridge.  This is where we got our best photos.  Peyto Glacier, Peyto Peak and great views of the Lake, too.  Before reaching the peak, we were treated to a 500m plod through scree...two steps forward, one back.  But we made it in good time.  It was rather windy at the summit, so we did not stay long.  We enjoyed some sweet scree running action on the way down.  Some of the scree was more friendly than others...the smaller, lighter stuff working better for us.   My bf's sister had a couple slips on the moraine on the way down, because there is loose rock everywhere, but all in all, we had an awesome day!",
    "directions": "The route to the summit of Caldron Peak starts at the Peyto Lake Lookout trail parking lot.  \tThe parking lot is approximately 40Km north of Lake Louise on the Icefields Parkway.  It is 5km North of the Num-ti-jah Lodge.",
    "geohash": "c3jn",
    "photos": [],
    "source_url": "https://trailpeak.com/trails/caldron-peak-near-banff-ab-12103",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall",
        "Stars": 5,
        "Time": "8 hrs",
        "Total Distance": "24 km",
        "Town": "Banff, AB",
        "Type": "out-and-back"
    },
    "title": "Caldron Peak",
    "trail_id": "12103"
}