{
    "description": "The ice cave is located on the south face of Moose Mountain with an elevation gain of approximately  274 Meters. Allow 4-5 hours for a return trip. Several years ago you could drive down this road to a day use picnic area below the ice caves. This picnic area is now a large natural gas well site. The road leading to the old picnic site is  6 K long and rather boring to walk. You will appreciate a bicycle here. The road passes by a few Natural Gas installations that are an eyesore to say the least and makes one wonder why the gas company has vehicle access and the public does not. Once you arrive at the old picnic site you can see the ice cave's large tall opening when looking towards the south west side of Moose Mountain. Beware of falling rocks and be careful when in or near the cave. Several years ago a person was killed by falling rock while standing near the mouth of the cave. Avoid hiking along the bottom of the cliff face. There is another  325 Meters of rock above you that is very unstable. It feels like this unstable rock is waiting for you to pass under it. The ice inside the cave looks like beautiful crystals. It is created by water seeping down through the mountain top and then freezing.   The cave has several caverns that travel deep inside the mountain. Ice has blocked the narrow passage at the end so you can no longer enter the deeper caverns.",
    "directions": "Park at Ings Mine.  The approach is by gravel road that is maintained by Shell Canada and can only be accessed on foot. Unfortunately there is a locked road gate to keep vehicles out.",
    "geohash": "c3n3",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/12105/narrow_IMG-9138-2-55357.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12105/narrow_IMG-9140-55357.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12105/narrow_IMG-9143-55357.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/moose-mountain-ice-cave-near-kananaskis-ab-12105",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer spring",
        "Stars": 5,
        "Time": "6 hrs",
        "Total Distance": "13 km",
        "Town": "Kananaskis, AB",
        "Type": "out-and-back"
    },
    "title": "Moose Mountain Ice Cave",
    "trail_id": "12105"
}