{
    "description": "Edwards Rating: II (III) L M 8 to 11 hoursElevation of 1220 m NET, 1448 m TOT & max 2948 m (2910 m officially) Can be done early/late season from Boom Lake as it?s a south facing slope*****Since we were at the end of October and therefore not expecting to complete a moderate scramble without the appropriate winter gear, we decided to try Mount Bell from the south gullies by Boom Lake instead of Taylor Lake. This was one of the most enjoyable 15km + scramble of the year for us! It is a moderate scramble mostly because it involves a bit of bushwhacking/route finding and there are a few sections that can be actually difficult if sticking to the ridge but you can always find an easier way. The views were absolutely perfect, the scrambling in the boulders so much fun and the ridge walk long enough to make this long approach totally worth it!Our GPS track shows different ways up and down. The best way is to go up and down one of the very first gullies after reaching the lake and keep your elevation gain from the col as much as you possibly can (more technical & fun scrambling). I will detail the best of both our ascent & descent routes. From the parking lot, take the Boom Lake hiking trail up to the lake. Once at the lake, go past the boulder field on your right and find a faint but good trail close to the lakeshore that brings you to a big stack of rocks and a small pond. Start bushwhacking (easy, faint trails) straight up in the gully in front of the pond for a very steep approach close to the tree line. As soon as it gets clear enough on your left and by the tree line, go left and sideslope without taking anymore elevation to get to a small col. From the col, stay as close as you can to the ridge for easy to difficult scrambling depending on your route finding skills and what you choose to do here. But really, you always have a way up that is easy but I?ve sometimes climbed some sections for a more direct approach. It is a stunning scrambling through walls and boulders, but sometimes scary as they seem to be ready to fall. At some point, you will get closer to the false summits (beautiful pinnacles blocks) on your right and scramble up one last wall in which you will find an easy scramble leading you to a scree slope. Best thing here is to go up to the right side of the first block of pinnacles. After that, you will go along the other block on the left to finally see your final destination. The ridge walk is not bad, but you can find a good trail on the right side if you are not comfortable staying on it. There?s a 2 steps section under a big standalone rock with a bit of exposure. RETURN THE SAME WAY. We have taken a gully more in the middle of the lake and it was great until the last 1.5 km, where bushwhacking to the lake shore and back to the pond was so frustrating.",
    "directions": "From Banff, stay on Trans-Canada Highway and take the AB-93 S exit at Castle junction. Start your odometer for an extra 7.1 km from the junction and park at the Boom Lake trailhead parking lot on your right.",
    "geohash": "c3j7",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/12114/long_Mount-Bell-Lake-Louise-Boom-Lake-Oct-25-2015-1--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12114/long_Mount-Bell-Lake-Louise-Boom-Lake-Oct-25-2015-3--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12114/long_Mount-Bell-Lake-Louise-Boom-Lake-Oct-25-2015-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12114/long_Mount-Bell-Lake-Louise-Boom-Lake-Oct-25-2015-5--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12114/long_Mount-Bell-Lake-Louise-Boom-Lake-Oct-25-2015-7--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12114/long_Mount-Bell-Lake-Louise-False-summit-Ridge-walk-Oct-25-2015-6--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12114/long_Mount-Bell-Lake-Louise-Oct-25-2015-17--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12114/long_Mount-Bell-Lake-Louise-Overall-scrambling-Awesome-.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12114/long_Mount-Bell-Lake-Louise-Ridge-walk-view-Castle-Oct-25-2015-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12114/long_Mount-Bell-Lake-Louise-Up-the-first-gully-Oct-25-2015-Copie-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12114/narrow_Mount-Bell-Lake-Louise-Ridge-walk-2-steps-exposed-Oct-25-2015-44639_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12114/narrow_Mount-Bell-Lake-Louise-Scramble-in-HUGE-boulders-Oct-25-2015-2--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12114/narrow_Mount-Bell-Lake-Louise-Scramble-in-HUGE-boulders-Oct-25-2015-4--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12114/narrow_Mount-Bell-Lake-Louise-To-false-summit-Oct-25-2015-44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mount-bell-boom-lake-approach-near-banff-ab-12114",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 5,
        "Time": "9 hrs",
        "Total Distance": "18 km",
        "Town": "Banff, AB",
        "Type": "out-and-back"
    },
    "title": "Mount Bell ? Boom Lake Approach",
    "trail_id": "12114"
}