{
    "description": "Mount Lorette - Edwards Rating: II (III) M M Complete Traverse - Edwards Rating: III (IV) L L Elevation of 1255 m NET, 1685 m TOT and max 2463 m for Lorette (2487 m officially). Skogan Peak is at 2669 m (2662 m officially). 9 to 12 hours for the complete traverse, 6-7 hours for Mt Lorette only.Mt Lorette can be done early/late in the season (June to October) with its south facing ascent. It must be dry for the traverse though.Possible bike approach, if only we had bikes... The traverse is a difficult scramble in our opinion, not a moderate as Nugara mentions in his book. Lorette alone is not moderate but rather easy we thought. The traverse is as difficult as other such rated scrambles like Carnarvon, Lady Mac true summit, The Wedge, Kananaskis Peak and so on. You definitely need to be in great shape for a long day, be able to scramble on a greatly exposed ridge and have route finding skills if you try to avoid the ridge walk. Check out the weather, you want dry slabs (no risk of thunderstorms or rain) and hopefully light wind. We had gusts at about 50 km and we wouldn?t have done it with stronger winds. The gully up is long and not that enjoyable and the scree not good enough to ski down the hill, but the ridge scramble is nice and the views are great.First we stopped our car at 19 km from Highway 1 on the right side of the road (in front of Lorette ponds parking lot). A Wildlife Conservation Officer came to see us and said we would never be able to cross back Kananaskis River at the end of the day because of the water level. We thought he knew better than us so we kept going to the Stoney Trail parking lot for a LONG approach. We would have saved about 9 km by crossing the river.Our GPS track is not perfect as we did some route finding, so use the pictures and description below with it. We walked about 4.7 km on Stoney trail to get in front of the south facing gully between Mt Lorette on the left and a huge crest on the right. We started bushwhacking almost straight up until we got into the drainage/gully. From now, it was up in the gully or sometimes on its left when the trail was good enough (washed out at many places). Once closer to a high point slightly on our left, we passed under it to avoid some elevation and get to the col between that point and Lorette. From the col, the best way is directly on the ridge for a fun easy-moderate scramble with some exposure. If you prefer to stay on an easy path, go to the right side of the ridge and find some good trails by losing a bit of elevation that you will gain back under the summit.From Lorette summit, we started the traverse to Skogan Peak by going left of the ridge and to the high point. From there, we got to a second high point representing the beginning of Skogan ridge. The best way up Skogan is to stick to a very narrow and exposed ridge. Going left may help avoid some sections but will involve route finding, elevation loss and traversing exposed scree gullies and slabs. We did that on our way up, but we stuck to the ridge on the way down, it is much better even though scary sometimes. I added some pictures to show you the only place where you should lose some elevation just after what I considered the crux for some hands-on scrambling over a slabby wall with beautiful rounded rocks. You want to gain back the ridge just before the last steep slope leading to the only summit you see on your right, the false summit. Once up there, you will see the true summit minutes away where you will descend on scree and gain back some elevation for the final peak. The only different thing we did on the way down is that we preferred to go up the high point we avoided when getting to Lorette and then back down to its left in the limestone/scree slope leading us to the main gully. We did that to look for the best possible scree, but there?s not much in that gully.",
    "directions": "From Calgary, follow Trans-Canada Hwy/AB-1 W to Kananaskis Trail/AB-40 S. Take exit 118 and start your odometer for about 23 km and turn right on Mt Allan Dr. Drive an extra 1 km and turn right to get to the Stoney Trail parking lot.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/12113/long_Mount-Lorette-Kananaskis-Oct-18-2015-1--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12113/long_Mount-Lorette-Kananaskis-Summit-View-Colembolla-Lougheed-Oct-18-2015-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12113/long_Mount-Lorette-Kananaskis-Summit-View-Mary-Barclay-Oct-18-2015-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12113/long_Mount-Lorette-Kananaskis-Summit-View-Wasootch-Oct-18-2015-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12113/long_Mount-Lorette-Kananaskis-Summit-View-Wind-Ridge-3-Sisters-Oct-18-2015-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12113/long_Mount-Lorette-to-Skogan-Peak-Traverse-Kananaskis-Stoney-Trail-Oct-18-2015-2--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12113/long_Mount-Lorette-to-Skogan-Peak-Traverse-Kananaskis-Up-South-Gully-Oct-18-2015-1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12113/long_Mount-Lorette-to-Skogan-Peak-Traverse-Kananaskis-Welcome-Oct-18-2015-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12113/long_Skogan-Peak-Traverse-Kananaskis-Crux-Oct-18-2015-2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12113/long_Skogan-Peak-Traverse-Kananaskis-Down-the-ridge-Oct-18-2015-2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12113/long_Skogan-Peak-Traverse-Kananaskis-Exposed-Ridge-wow-Oct-18-2015-3--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12113/long_Skogan-Peak-Traverse-Kananaskis-Exposed-Ridge-wow-Oct-18-2015-7--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12113/long_Skogan-Peak-Traverse-Kananaskis-View-Lorette-Oct-18-2015-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12113/long_Skogan-Peak-Traverse-Kananaskis-Wrong-idea-away-from-ridge-Oct-18-2015-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12113/narrow_Skogan-Peak-Traverse-Kananaskis-Exposed-Ridge-wow-Oct-18-2015-1--44639_best1_.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mount-lorette-to-skogan-peak-traverse-near-kananaskis-ab-12113",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "10 hrs",
        "Total Distance": "20 km",
        "Town": "Kananaskis, AB",
        "Type": "out-and-back"
    },
    "title": "Mount Lorette to Skogan Peak Traverse",
    "trail_id": "12113"
}