{
    "description": "This description covers remote sea kayaking of the Discovery Passage via Ferry (wet launch) near Hecate Island after departure from Port Hardy.  All details including day log and waypoints below, starting with B.C. Ferries details.Website: http://www.bcferries.com/schedules/discovery/Wet launching demonstration: http://discoverycoast.bcferries.bc.ca/tour.cgi/welcome/wwl01Ferry Terminal: Bear Cove - Port HardyPhone: 1-250-949-6722, Fax: 1-250-949-6513There is an 8-kayak rack and a baggage cart available for use at Discovery Coast Passage terminals.Do not bother phoning BC Ferries' 800 number to make your reservation and/or inquire about the wet launch. The operator you'll get will probably have no clue of what you are talking about. Best you call the ladies at Bear Cove directly. They are friendly and helpful, will make the reservation, and will fax you a 'wet launch request form' immediately. Even when approved, the actual wet launch is at the discretion of the caption and will depend on daylight, currents, winds and waves; the ferry stops dead in the water during launch.Odyssey Kayaking Ltd. in Port HardPat and Jackie KervinPhone: 1-250-902-0565 1-888-792-3366 (toll free)Website: http://www.island.net/~odyssey/We rented one brand new Seaward Southwind extremely stable double touring kayak:http://www.seawardkayaks.com/Product_Page1.asp?ProductName=SouthwindThe kayak came with everything brand new, including paddle leaches! We also rented a VHF Radio: ICOM M1VPat was very helpful in every way. He lent us an extra water container, several more dry-bags and lots of flares. He also drove us to the ferry terminal at the beginning of the trip and picked us up on our return. What's more, I could leave my car with him for the duration of the trip.Books, Charts and Pamphlets:Kayak Routes of the Pacific Northwest Coast, 1. Edition, edited by Peter McGeeCanadian Tide and Current Tables 2004, Volume 7, Fisheries and Oceans CanadaCoast Recreation Map (BC Outdoor Map) - Hakai PassageCoast Recreation Map (BC Outdoor Map) - Bella BellaBritish Columbia Chart: 3935 Hakai Passage and Vicinity 1:40000 (NAD 83)3937 Queens Sound 1:40000 (NAD 83)3787 Queens Sound to Seaforth Channel 1:36396 (NAD 27)June 15:9:30am - ferry leaves Port Hardy; 2pm - ferry passes Cape Calvert and we commence wet launch preparations on the car deck. The captain decides on a drop-off site just north of east entrance to Kwakshua Channel off Hecate Island; 3pm - car deck hatch opens and crew starts preparing the special wet launch ramp; 3:30pm - wet launch from stern of the vessel complete - two double kayaks, gear and provisions for 16 days and 40 liters of water.The packing before and during launch was a bit frantic, so we decide to rearrange some gear while we are still sheltered behind Experiment Pt. and before heading for the white-caps in Kwakshua Channel. We take first GPS reading (GPS-1) in Experiment Bight. It is sunny but a strong wind blows straight down the channel from the west. Several creeks on Hecate Island bring lots of water from the heavy rain the previous days and weeks. We round Whittaker Pt. and cross over to a muddy bay north of Pruth Bay and south of Meay Islet. There is a decent campsite on Calvert Island (GPS-2) tucked behind a little islet in the bay. We later find a trail opposite our site that climbs to one or two camp spots in the trees high on the islet. There is a midden ridge connecting this islet with Calvert Island. This ridge does not completely flood for a 13.9 feet tide at Adams Harbour (14.1 feet at Wadhams) during the night.June 16:Sunny. We paddle north past Meay It. and encounter strong cross winds and much refracted wave action as we round the north tip of Calvert Island heading west to Sandspit Pt.. We eventually find shelter behind islets close to the Calvert Island shore. The campsite at Sandspit Pt. looks inviting but we don't land. We continue through Choked Passage and check out the first beach after Sandspit Pt. known as Wolf Beach. This beach is supposed to be good for crabbing. Lunch is on the next sandy beach west of Wolf Beach. The Coast Recreation Map of Hakai Passage shows a trail connecting this beach with Pruth Bay - a fiction - we never find it. We proceed around a headland to North Beach and find an easy landing at low tide on a beautiful sand spit connecting Calvert Island with one of the Surf Islands on the west side of North Beach. Back into the boats we have a small surf landing and set up camp on North Beach just east of the trail to West Beach (GPS-3).June 17:Sunny and hot. We hike to West Beach past an inland lake then walk the gravel road to Haikai Beach Resort at the head of Pruth Bay. Only a small number of staff is present but none of their exclusive clients - not in June. We return to West Beach and now hike the \"Seven Beaches Trail\" south over several headlands via board walks, some ladders and ropes. Contrary to our information it doesn't seem to be necessary to time this hike during low tide. The trail becomes suddenly bushy going across the neck of land to the first beach facing west. It is the one which has a good size creek flowing into it. This beach has probably the least exposure to surf of all the west-facing sand beaches on Calvert Island. The route becomes even more bushy on the way to Beach 7. This is the large beach facing SSW. It is well worth the effort. A trail continues at the east end of this beautiful beach but it peters out completely at the height of land.June 18:Sunny and hot. A day of salmon fishing, trolling a sinker in big swells several times back and forth across Choked Passage to near Lower Is. No luck, we paddle around the Surf Islands, idle sun-bathing, spend time beach combing and more time filtering water. We find water dripping from moss in a shady corner east of our campsite. There is also a creek - not marked on the chart - near the east end of our beach. The trail marked on the Recreation Map connecting North Beach directly with Hakai Resort never materializes.June 19:Sunny. After a 7am start, we cross Choked Passage, enter sheltered waters between Flat Is. and Lower Is. and are surprised by a strong wind blowing west from the Mainland as we round Starfish Island and enter Adams Harbour. The wind blows harder still as we pass Odlum Point and start the crossing of Hakai Passage an hour before turn. We are in big, regular swells at high seas as we head straight north, safely west of Maiguy Rock toward the nearest land off Stirling Island. The crossing is about an hour of hard paddling. Across, we encounter a bit of tidal current between the islets south-west off Stirling Island. We skip into a long narrow east-west channel for shelter and a break (GPS-4). It is time to deploy our salmon fishing gear for \"The Gap\", one of the top salmon producing spots in the vicinity of Hakai Passage. We troll exposed far west of the islands off Sirling Is. We have again no luck since we are a bit early for the salmon season, so we cross Kildidt Sound in a most direct line toward the Serpent Group. Northeast around the eastern group of islands we find the NE entrance to a much recommended campsite on the center-main island. It's a sneaky spot and easy to miss. We trust the beautiful white midden beach, get out of our boats and walk around the corner, for only then do we see the possibility to camp here; and what an awesome campsite it is (GPS-5).June 20:Sunny and hot. A very lazy afternoon start for Triquet Island via the north coast of Manley Island and the passage between it and Ronald Island. We land at the extreme eastern sand beach on the north side of Triquet Island (GPS-6). It's the only beach that looks inviting, after the spoils of Serpent that is. This beach has also middens.June 21:Fog. We paddled in fog and some swells around Triquet Island in a clock-wise direction hoping to see sea lions (no luck). We must almost completed the circle just to get reoriented, then we head for the passage into Spider Anchorage where the fog is lifting somewhat. We continue along Anne Is., then north through Spider Channel to a small rocky bay on Spider Island with a creek (not marked on the chart) which empties a lake only several hundred meters inland. This is marked with a float. There are ruins of a cabin just up the shore. It is a great place to get good water (GPS-7) and there is a place to camp for one, maybe two tents. After a long break and some exploring we cross over to Hunter Island and back into fog. We must carefully navigate past Swordfish Bay. We enter Cultus Sound in from Superstition Pt. and find the Cultus Sound campsite just as the fog finally lifts for good (GPS-8). A group of three Vancouver paddlers welcomes us. They are the first kayakers we meet although we saw evidence of earlier parties at all the previous sites except the first.June 22:Sunny but windy. The other party heads for Bella Bella. We paddle up Cultus Sound and see a Minke whale breaching in the distance. We come closer and rediscover the whale feeding just off-shore. We must wait for high tide at the entrance to a large lagoon where now there is a little waterfall (GPS-9). The obstacle eventually disappears and we look for the creek which runs from a narrow lake north of the lagoon. We hike up toward the lake directly in the creek bed, at times avoiding difficulties on (river) right. We wade into the lake at (GPS-10) and go for a long swim. We have a window of less than two hours before the entrance into the lagoon is again blocked.June 23:Calm but overcast. We decide to attempt the crossing to Goose Island if conditions remain favorable west of the Simonds Group. We cross the west entrance of Cultus Sound, pass Granville Islands in a direct line to just west of Purple Bluff. The seas remain calm. We cross the almost 9 kms to Goose Island Anchorage in just under 1h30min. The GPS shows we are cruising at 6.5km/h. We decide to land for lunch at a large campsite on the north tip of Snipe Is. (GPS-11). Encouraged by the successful crossing of Queens Sound we decide to circumnavigate Gosling Island before setting up camp on the very north tip of Gosling Island. We notice a sizable seal colony in a bay of Gosling, and then, not completely unexpected, we encounter rather rough seas rounding the south tip of Gosling. The tide is still low and there are many breakers off the south-west coast of Gosling. The Gosling Rocks beam south. Before setting up camp we investigate and find rather brackish water in the south-western most charted creek on Goose Island. Our camp spot (GPS-12), in the open, is above a 11.5 feet tide at Goosing Island (12.5 feet in Bella Bella), but there are also good sites in the trees just west of the point in case of rain or wind.June 24:Party sunny. We check out the eastern most marked creek on the SE shore of Goose Island (equally brackish) and then must wait until the tide submerges the tidal flats between Gosling and Goose Islands. When possible we head for the passage between Duck and Swan Island and the open West Coast. As soon as we enter into open water, with dangerous breakers all around us and swells rolling in, we spot a pod of Killer Whales, possibly Transients, plying the foamy waters generally heading south. After an hour or so following them we return north, a good distance west of any breakers, to the only safe channel for us to reenter the calm waters behind Swan Island, and the only deep channel marked NE of Swan Island. We find the entrance into the saltwater lagoon north of Swan Island still blocked, even though it is almost high-tide (12.5 feet in Bella Bella) and are required to line the kayaks. We now head up the lagoon, getting in and out of the boats in shallow waters, looking for the creek marked on the chart at the extreme end of the lagoon. We discover a grassy landscape with many deer and several Sandhill cranes - and water back in the trees -  if you are not too discerning!June 25:Overcast. We head north along the east coast of Goose Island. After a short stop visiting the Heiltsuk Nation Rediscovery Camp on the sandy beach at the north end of Goose Island (nobody there), we cross Golby Passage to the west of McMullin Group. There is good rock-fish fishing in between the small islets west of the southern most island of the McMullin Group. It is here where we see a large float of sea-otters bobbing up and down in the kelp. Turns out, it is almost impossible at low tide to gain the eastern side of the McMullin Group from here and another great campsite (GPS-13).June 26:Overcast, later party sunny. We take it easy. Our next campsite (GPS-14) on a small island south of Potts Island and just off the south entrance to Louise Channel is not far. Just as we are leaving, a pair of paddlers arrives from our distination. They tell us that our next camp is not the narrow islet marked on the Recreation Map. Instead, it is on a more round islet a bit north and to the west of the narrow one. The best landing is actually from the north-east, around and from behind the islet as you come from McMullin. Spoiled from previous campsites, we immediately set out to make some campsite improvements. We move enough rocks from the beach until we can setup tents between them. The tide at night will be 13.5 feet in Thompson Bay (14.1 feet in Bella Bella).June 27:Sunny and warm - the perfect do-nothing-day.June 28:Overcast, showers developing at noon, serious rain in the afternoon. We pack and paddle north up Louise Channel. It is almost high tide. We cross Boddy Narrows, Quinoot Point, and head for the bay with a large creek (best water of the whole trip) on the east coast of Dufferin Island. It now rains in earnest as we continue north up Joassa Channel and through Rail Narrows where we encounter barely a tidal flow - and it is with us. The first sign of civilization since Hakai Resort is a clam farm tucked into the bay south of Rait Narrows. We pass south of small Mur Island, cross Dundivan Inlet into Seaforth Channel and visit the campsite in shady Hose Bay just west of Hose Pt. (GPS-15). It feels gloomy here so we continue in the rain across Raymond Passage, pass Lay Pt and enter Kynumpt Harbour. No sand beach this time, but we find a good campsite between isolated trees below the overgrown site of an abandoned village. This is just east of the visible stumps from the old landing (GPS-16). For the first time of the trip we put the rain gear and tarp to use, then settle in for the night.June 29:Rain stops early morning, then overcast. We search for the trail to Bella Bella marked on the Recreation Map, again to no avail. Instead, we find an overgrown trail across the narrowest part of Green Neck to Norman Morrison Bay. I spend most of the rest of the day much improving this trail to the point where it becomes almost \"wheel chair accessible\".June 30;Sunny and hot. A pod of Harbour Porpoises visits Kynumpt Harbour as we are leaving. We paddle around Defeat Pt. into Ormidale Hr. We pass Dryad Point light house and cruise in a direct line to Clayton Pass between Denny and Shearwater Island not knowing where the ferry terminal is located.  Turns out, the Shearwater ferry terminal is behind and east of Atli Pt. (GPS-17). There is a great pub at the marina. The ferry arrives on time at 2:30pm, departs again two hours later. Final arrival time in Port Hardy is at 7:45am the next day.Garmin etrex WayPoints (indicated accuracy always better than 10 meters):NAD 83 - hddd mm'ss.s\"--------------------------------(GPS-  1) N 51 39' 19.3\" W 127 57' 52.7\"(GPS-  2) N 51 39' 51.1\" W 128 05' 54.0\"(GPS-  3) N 51 39' 47.4\" W 128 08' 34.7\"(GPS-  4) N 51 44' 28.7\" W 128 07' 18.2\"(GPS-  5) N 51 47' 45.2\" W 128 10' 07.0\"(GPS-  6) N 51 48' 26.0\" W 128 14' 06.5\"(GPS-  7) N 51 51' 22.1\" W 128 14' 33.1\"(GPS-  8) N 51 53' 49.1\" W 128 14' 03.9\"(GPS-  9) N 51 54' 45.2\" W 128 11' 23.7\"(GPS-10) N 51 54' 53.0\" W 128 11' 02.2\"(GPS-11) N 51 55' 38.3\" W 128 25' 51.2\"(GPS-12) N 51 55' 44.4\" W 128 26' 25.6\"NAD 27 - hddd mm' ss.s\"---------------------------------(GPS-13) N 52 03' 34.2\" W 128 24' 43.6\"(GPS-14) N 52 06' 05.6\" W 128 23' 14.7\"(GPS-15) N 52 12' 53.8\" W 128 13' 03.1\"(GPS-16) N 52 12' 12.4\" W 128 10' 09.4\"(GPS-17) N 52 08' 44.1\" W 128 05' 05.0\"",
    "directions": "The Discovery Coast Passage (Queen of Chilliwack) from Port Hardy or Bella Coola",
    "geohash": null,
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/1212/reg_CulvertIslandjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1212/reg_Sandtraumjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1212/reg_wetlaunchjpg_best1_.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/hakai-marine-park-kwakshua-channel-to-shearwater-near-bella-coola-bc-1212",
    "stats": {
        "Activities": "sea-kayak",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 5,
        "Time": "112 hrs",
        "Total Distance": "0 km",
        "Town": "Bella Coola, BC",
        "Type": "out-and-back"
    },
    "title": "Hakai Marine Park - Kwakshua Channel to Shearwater",
    "trail_id": "1212"
}