{
    "description": "Edwards Rating: I (I) L M 5 to 8 hoursElevation of 723 m NET, 1039 m TOT & max 2216 mCan be done early/late season BUT road may be closed some days and from December 1 until May 15 between the 2 parking lots.Bike, hike or both*****We weren?t sure about the weather conditions and since it?s late in the season (October 31st), we thought we would try a hike with no technical scrambling and lower elevation. This was really just a hike, but a very long one and this is the only reason why I rated it as difficult. Even though the elevation is gained gradually, this is a good workout with over 1000 m for the day and a half-marathon distance.The trailhead is at the very beginning of the parking lot and there are many signs so there?s not much too add here. The summit is a nice plateau with great views of the prairies and mountains. We thought we had a lot of energy left so we decided to keep going by losing elevation between the summit and Jumpingpound Ridge on an official trail. There?s a sign when it?s time to turn right and go back to another parking lot on Powderface Trail. This is when the fun ends as you have to turn right on the road and walk an extra 7.6 km to your car. I definitely recommend you bring your bikes and leave them in that parking if doing this whole loop. We wish we had bikes at that point? Good hike, but nothing unforgettable there.",
    "directions": "From Calgary, follow Trans-Canada Hwy/AB-1 West and take exit 143 to Sibbald Flats, Highway 68 South. Drive 23 km to and turn left on Powderface Trail. Start your odometer for about 3 km and turn left to park in the Dawson parking lot.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/12120/long_Cox-Hill-Complete-Loop-Bragg-Creek-Limited-views-nice-forest-Oct-31-2015-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12120/long_Cox-Hill-Complete-Loop-Bragg-Creek-Ridge-Oct-31-2015-3--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12120/long_Cox-Hill-Complete-Loop-Bragg-Creek-Summit-Oct-31-2015-2--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12120/long_Cox-Hill-Complete-Loop-Bragg-Creek-Summit-Oct-31-2015-4--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12120/long_Cox-Hill-Complete-Loop-Bragg-Creek-Summit-Oct-31-2015-5--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12120/long_Cox-Hill-Complete-Loop-Bragg-Creek-Welcome-From-Jumpingpound-Ridge-Oct-31-2015-44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/cox-hill-complete-loop-near-kananaskis-ab-12120",
    "stats": {
        "Activities": "snowshoe hike mtn-bike",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 3,
        "Time": "6 hrs",
        "Total Distance": "21 km",
        "Town": "Kananaskis, AB",
        "Type": "out-and-back"
    },
    "title": "Cox Hill -  Complete Loop",
    "trail_id": "12120"
}