{
    "description": "Edwards Rating: II (II) M M 5.5 to 8 hoursElevation of 1062 m NET, 1096 m TOT & max 2552 mSHOULD be done early/late season (Terrible bushwhacking?)*****We are still finding some peaks with no technical scramble and light or no exposure to extend our 2015 scrambling season. We would not do that one in summer months as bushwhacking is sometimes absolutely terrible and therefore it will easier in Fall or Spring when vegetation is not as dense. I rated it as a moderate scramble because you absolutely need to be comfortable with off-trail routes with bushwhacking/route finding. You may find it easy if you are an experienced scrambler. Winter conditions always add a bit of challenge as you know. Our GPS track is all over the place so I will try to describe the best possible route.Starting from the parking lot, hike on the official Evan-Thomas Trail up to the end of the maintained trail (sign). Keep going about an extra 400 metres and look for a little drainage on your left. Start bushwhacking up and right in the forest for about 5 minutes to reach an open field (burned forest). From there, you can see Volcano Peak further away on your right. Walk straight as long as you possibility can in that valley to avoid bushwhacking. Once in front of the forest down Volcano Peak slope, either start your ascent here or keep going straight for another 100-200 metres or so and look for an open slope with boulders. If bushwhacking in that forest, go up and left to get to that boulder field later at the beginning of the ridge. Traverse up and left that boulder field to get to another small wooded area. Keep left and hike up along that forest to an open slope where you?ll see the summit slightly on your right. It is an obvious and easy walk up to the summit at this point. The views were absolutely stunning and this scramble would not be as enjoyable without that fresh snow we got minutes before starting our scramble. When we arrived in Kananaskis, there was a blizzard but we looked at the forecasts and it was to last for an hour or so. We got clear views as soon as we started bushwhacking. If snow free, the best may be to look for that boulders slope to go up and down. We rather chose bushwhacking because it was slippery on the boulders and we were actually not sure of the best way to go anyways.",
    "directions": "From Calgary, follow Trans-Canada Hwy/AB-1 W to Kananaskis Trail/AB-40 S. Take exit 118 and start your odometer for about 27.4 km drive to the Evan-Thomas parking lot on your left.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/12121/long_Volcano-Peak-Little-McDougall-Kananaskis-Ridge-Nov-1-2015-1--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12121/long_Volcano-Peak-Little-McDougall-Kananaskis-Ridge-Running-in-snow.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12121/long_Volcano-Peak-Little-McDougall-Kananaskis-Ridge-Tough-boulders-snow-mix-Nov-1-2015-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12121/long_Volcano-Peak-Little-McDougall-Kananaskis-Summit-Nov-1-2015-1--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12121/long_Volcano-Peak-Little-McDougall-Kananaskis-Summit-Nov-1-2015-2--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12121/long_Volcano-Peak-Little-McDougall-Kananaskis-Summit-Nov-1-2015-6--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12121/long_Volcano-Peak-Little-McDougall-Kananaskis-Terrible-Bushwhacking-Nov-1-2015-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12121/long_Volcano-Peak-Little-McDougall-Kananaskis-View-summit-from-ridge-Nov-1-2015-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12121/long_Volcano-Peak-Little-McDougall-Kananaskis-Welcome-Nov-1-2015-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12121/narrow_Volcano-Peak-Little-McDougall-Kananaskis-Just-before-sunset-Nov-1-2015-44639_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12121/narrow_Volcano-Peak-Little-McDougall-Kananaskis-Started-in-a-blizzard-Nov-1-2015-2--44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/volcano-peak-little-mcdougall-near-kananaskis-ab-12121",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 3,
        "Time": "7 hrs",
        "Total Distance": "12 km",
        "Town": "Kananaskis, AB",
        "Type": "out-and-back"
    },
    "title": "Volcano Peak (Little McDougall)",
    "trail_id": "12121"
}