{
    "description": "Edwards Rating: II (II) M M 6 to 8 hoursElevation of 954 m NET, 1105 m TOT & max 2350 mI recommend returning the same way after the second peak (bushwhacking is quite challenging)*****With most of the peaks snow covered now, we are looking for technically easy scrambles with low to moderate exposure. We did this loop on November 15 and it was fine but you do have to scramble up steep and exposed slopes with quite a bit of snow this late in the year. You may want to bring an ice axe, poles and maybe spikes as well. This makes a physically challenging trip and bushwhacking down South to Porcupine Creek is not fun at all. The best thing to do may be to RETURN THE SAME WAY.Hike up to Baldy Pass for an easy 4 km and then start gaining more elevation by turning right on the ridge. Take a minute to look up and you will see that you have will eventually want to turn right again to start ascending the last slope. Make sure you don?t go too far and go past the final slope. There are a few options there and if you choose to use a trail in the forest mid-slope, stay close to the right slope and eventually get out of the woods to finish your ascent on the steep scree/snow slope leading you to Midnight Peak. You will see your second peak on your left, the unofficially named Midday Peak. Just stay on the ridge and walk down and up to your second peak of the day for about 1 km. It?s going to be slabby on the way up, but you can definitely stay on and over these slabs for a bit more challenge and a more direct route if you feel comfortable doing so. Once you have made it up to the second peak, I strongly recommend you go back the same way.We did not and we rather followed a SW facing crest for a few metres and then went down left into a gully narrowing down to a waterfall eventually. Once up the waterfall, we went around to the left and about 5 metres lower, we cut straight right crossing the waterfall and following that beautiful cliff for a few minutes until we crossed a very small drainage. Once to the right side of this drainage, we started a long and boring descent with challenging bushwhacking in a sometimes steep, snowy and muddy slope with quite a bit of dead trees to make it harder. After a long 1h30 approximately, we finally got an easy access back to the drainage and bringing us to Porcupine Creek. We walked in the creek back to Highway 40 as it was already passed sunset but there would have been an obvious trail to our right in the forest and leading back to Baldy Pass eventually. We walked back north on the road for about 1.5 km to the parking lot.",
    "directions": "From Calgary, take the Trans-Canada Highway up to exit 118, Kananaskis Trail - 40 South. Start your odometer in front of the Stoney Nakoda Casino entrance and drive 14.2 km. You will park at the Old Baldy Pass parking lot on your right and cross the highway to the trailhead.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/12139/long_Midnight-Peak-Kananaskis-Summit-Nov-15-2015-1--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12139/long_Midnight-Peak-Kananaskis-Summit-Nov-15-2015-2--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12139/long_Midnight-Peak-Kananaskis-Summit-Nov-15-2015-4--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12139/long_Midnight-Peak-Kananaskis-Summit-Nov-15-2015-6--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12139/long_Midnight-to-Midday-Peak-Loop-Kananaskis-Baldy-Pass-Nov-15-2015-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12139/long_Midnight-to-Midday-Peak-Loop-Kananaskis-Nov-15-2015-15--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12139/long_Midnight-to-Midday-Peak-Loop-Kananaskis-Nov-15-2015-16--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12139/long_Midnight-to-Midday-Peak-Loop-Kananaskis-Route-down-Nov-15-2015-1--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12139/long_Midnight-to-Midday-Peak-Loop-Kananaskis-Route-down-Nov-15-2015-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12139/long_Midnight-to-Midday-Peak-Loop-Kananaskis-To-Midday-Nov-15-2015-1--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12139/long_Midnight-to-Midday-Peak-Loop-Kananaskis-To-Midday-Nov-15-2015-2--44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/midnight-to-midday-peak-loop-near-kananaskis-ab-12139",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 3,
        "Time": "6 hrs",
        "Total Distance": "14 km",
        "Town": "Kananaskis, AB",
        "Type": "out-and-back"
    },
    "title": "Midnight to Midday Peak Loop",
    "trail_id": "12139"
}