{
    "description": "This is a good little hike to some seldom seen falls near Londonderry.  I had been on this brook a few years before to  the first 40ft fall but turned around as there was no flow at the time.  This time, I went out after a big rainfall (70mm) and was rewarded with multiple falls two of which are above 30ft and then a multitude of smaller ones.  There was so much water than even the tributary brooks had little falls on them as well.The walk is not the most pleasant as there is some deadfall on the side of the stream but if you take your time you will only trip a couple of time...promise!    The first large fall ia 500m or so after the power lines while the last fall is further in....It is so far in that a couple of time I wanted to turn around thinking there was not enough elevation left for a fall to exist.....However there is one large fall towards the top of the hill.I bushwacked my way back to my car on the east side of the stream but it wasn't as easy as I thought so maybe you are better off to retrace your steps on the side of the stream",
    "directions": "The brook crosses the Baseline Rd (Londonderry) at N45 28 45.1 W63 34 44.5.  follow it upstream!",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/12144/reg_DSC-0640-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12144/reg_DSC-0658-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12144/reg_DSC-0660-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12144/reg_DSC-0674-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/saltspring-brook-falls-near-truro-ns-12144",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "4 km",
        "Town": "Truro, NS",
        "Type": "out-and-back"
    },
    "title": "Saltspring Brook Falls",
    "trail_id": "12144"
}