{
    "description": "This hike offers stunning views of the Marble Creek drainage with ample opportunities for enjoying wildflowers in the summer and picking huckleberries in the early fall. Grandmother and Grandfather Mountains are the closest peaks above 6000 feet to Moscow. Expect temperatures to be up to 8º C (15º F) cooler than the temperatures on the Palouse, which makes this a great place to escape the heat of summer. On a clear day, views extend into Montana and to the Gospel Hump. Freezeout Ridge accumulates more snow than any other location in the area. That makes this a great backcountry ski location in the winter. It also means that on an average year, the trailhead is not accessible by car until July. During heavy snow years, there have been remaining patches of snow on the ground into August. Pick up trail 275 from Forest Service road 301 at the base of Mark's Butte. The trail is well used and easy to follow, but signs at each intersection will help you keep on the right path. Stay with the uphill options keeping on trail 275 to Grandmother Mountain. A .1 mile spur trail will take you to the summit. The views are best on Grandmother Mountain, though the extension to Grandfather Mountain will take you through a forest of old-growth Mountain Hemlock. Return on the same trail.",
    "directions": "Head to the small town of Clarkia off of Idaho's Rt. 3. Here you'll turn onto Poplar Street and cross the railroad tracks. Follow the road through town until you hit Forest Service road 321. Turn Left onto FS 321, and in about a mile, turn right onto FS-301. Stay on FS-301 for about 12 miles as it climbs the mountains to Freezeout Saddle. You'll see the trailhead with a large sign containing a map of the trails in the area. Trailhead at N47° 01.144', W116° 03.678'.",
    "geohash": "c2m7",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/ID/12147/reg_Grandmother01-0.jpg",
        "https://trailpeak.com/storage//content/trails/US/ID/12147/reg_Grandmother02-0.jpg",
        "https://trailpeak.com/storage//content/trails/US/ID/12147/reg_Grandmother03-0.jpg",
        "https://trailpeak.com/storage//content/trails/US/ID/12147/reg_Grandmother04-0.jpg",
        "https://trailpeak.com/storage//content/trails/US/ID/12147/reg_Grandmother05-0.jpg",
        "https://trailpeak.com/storage//content/trails/US/ID/12147/reg_Grandmother06-0_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/US/ID/12147/reg_Grandmother07-0.jpg",
        "https://trailpeak.com/storage//content/trails/US/ID/12147/reg_Grandmother08-0.jpg",
        "https://trailpeak.com/storage//content/trails/US/ID/12147/reg_Grandmother09-0.jpg",
        "https://trailpeak.com/storage//content/trails/US/ID/12147/reg_Grandmother10-0.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/grandmother-grandfather-mountains-near-clarkia-id-12147",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 4,
        "Time": "5 hrs",
        "Total Distance": "13 km",
        "Town": "Clarkia, ID",
        "Type": "out-and-back"
    },
    "title": "Grandmother & Grandfather Mountains",
    "trail_id": "12147"
}