{
    "description": "Edwards Rating: I (I) S S3 to 5 hoursElevation of 779 m NET, 811 m TOT & max 2494 m*****This is a wonderful easy scramble to do when you don?t have much time or in the winter. We did it on in December and even though it slowed us a lot because of the snow accumulation and since we did not have snowshoes, this was quick and we easily made it before sunset. It starts at the Spencer Creek Trailhead, right between Mount Lougheed II (true summit) and Mount Sparrowhawk. Little Lougheed is the small pointy peak in front of Lougheed II that you easily see from the road.We started on the Spencer Creek trail to cut into the woods too early on our way up. We were trying to follow a good snowshoe trail but we realized on our back down there was an easier trail. The best thing is to stay on Spencer Creek trail until you see two bridges, just few minutes away from your car. You turn left and cross that bridge and keep following that trail up to the crest. At mid-point, you will get to a boulder field. This slowed us a lot and we should have looked for a better way up on the right side close to the cliff. By following the cliff, you get better views most of the time and you can see your summit lying down under the impressive Lougheed II. When you are just under the summit, you will have to hike up a steep scree slope for about 200 metres going left a bit and then back to the right once you reached the small ridge leading you to your final destination. It was easy in winter conditions so I suppose this is a very easy scramble in the summer and so much faster than we did in just over 4 hours return.",
    "directions": "From Canmore Bow River Bridge, take the Smith Dorrien Trail for about 24.4 km. Then make a u-turn and park on the side of the road, by the obvious drainage at Spencer Creek.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/12156/long_Little-Lougheed-Kananaskis-Nice-Views-from-boulder-field-half-way-Dec-5-2015-2--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12156/long_Little-Lougheed-Kananaskis-Summit-Dec-5-2015-1--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12156/long_Little-Lougheed-Kananaskis-Summit-Dec-5-2015-3--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12156/long_Little-Lougheed-Kananaskis-Summit-View-Windtower-Lougheed-I-Dec-5-2015-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12156/long_Little-Lougheed-Kananaskis-View-Lougheed-II-Dec-5-2015-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12156/reg_Little-Lougheed-Kananaskis-Welcome-Dec-5-2015-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12156/narrow_Little-Lougheed-Kananaskis-Nice-Views-from-boulder-field-half-way-Dec-5-2015-1--44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/little-lougheed-near-canmore-ab-12156",
    "stats": {
        "Activities": "ski-bc hike snowshoe",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 4,
        "Time": "4 hrs",
        "Total Distance": "6 km",
        "Town": "Canmore, AB",
        "Type": "out-and-back"
    },
    "title": "Little Lougheed",
    "trail_id": "12156"
}