{
    "description": "Heather Mountain is located at the Western end of Cowichan Lake. The first half of the hike is on logging roads, but there are great views along the way to make the slog worth it. The peak is 1345 meters with amazing 360 views from the top on a clear day and is a great hiking/snowshoeing/back-country skiing spot. The trail starts at the \"Branch R\" logging road gate. To this point 2WD is fine. Sometimes the gate is unlocked and the first 1-2 km can be driven. Once past the gate, take the second major logging road to the right. Note that it is easy to get lost on the logging roads on the lower part of the trail! You will follow a series of switchbacks until about 1050 meters, then there is a flagged trail to the left.  Follow the flagging and booted trail (when there is no snow) over the hill and through a meadow with many streams and tarns before starting the steep ascent to the summit. Once you are out of the trees, follow the cairns to the top.On snowshoes, this took us 9 hours including breaks.Note that the GPS track may not follow the trail exactly, as there was snow on the ground.",
    "directions": "Take Highway 18 (Cowichan Highway) towards Lake Cowichan. Right before entering town, take the Youbou exit to the right.  The \"R Branch\" logging road/gate where you park is about 38 km from this turn off. After you pass Youbou, the road turns to gravel and becomes North Shore Road. Continue along North Shore past a sign marked \"Heather Campsite.\" This is the Western tip of the lake. Right after this, the road curves to the left, you will see the gate for \"R Branch\" straight ahead. There is a sign. This is where you will park your vehicle and start your hike.",
    "geohash": "c0x",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/12182/long_2016-01-09-13-45289.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12182/reg_IMG-2884-45289.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12182/reg_IMG-2885-45289_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12182/reg_IMG-2892-45289.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12182/reg_heather-3-51101.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/heather-mountain-near-lake-cowichan-bc-12182",
    "stats": {
        "Activities": "snowshoe hike ski-bc",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 5,
        "Time": "8 hrs",
        "Total Distance": "19 km",
        "Town": "Lake Cowichan, BC",
        "Type": "out-and-back"
    },
    "title": "Heather Mountain",
    "trail_id": "12182"
}