{
    "description": "Waterfalls, sea caves, minerals, rock climbing...this place has it all !   I had previously driven through Morden to see another waterfall when I noticed the awesome cliffs that are located to the east of the village along the Bay of Fundy. The first part of the walk is on a cobble beach and you soon come to some large features that are covered by seaweed.  this is a chocking point...Two hours before high tide, you will not be able to go around it anymore and you will need to bushwack along the cliffs (like I did on my gps track).Around the feature, the tall cliffs start and the major waterfall to see is right there.  After a little while you come up to a small cave with some cool looking  minerals at the end of it. At this point, you come to a major brook flowing out and into the Bay.  this will be your escape route if the tide goes up too much.  after the brook, you will pass a couple of good looking ice climbs on the cliffs before coming to a large crevasse type feature.  A very large pillar of stone is now fully detached from the cliff and you can go behind it...and if you are brave enough, I guess you could stem the whole thing 80ft plus!There is no end to the walk, just turn back when you feel like it and watch out for the tide",
    "directions": "Highway 101.  Aylesford Exit.  Go up the north Mountain to the village of Morden and park by the each and walk east",
    "geohash": "f81bd",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/12200/reg_morden2-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12200/reg_morden5-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12200/narrow_morden1-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12200/narrow_morden3-27177_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12200/narrow_morden4-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/morden-fall-and-crevasse-near-greenwood-ns-12200",
    "stats": {
        "Activities": "hike climb",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 5,
        "Time": "3 hrs",
        "Total Distance": "6 km",
        "Town": "Greenwood, NS",
        "Type": "out-and-back"
    },
    "title": "Morden Fall and Crevasse",
    "trail_id": "12200"
}