{
    "description": "Edwards Rating: II (III) L L10 to 13 hours for the loopElevation of 1051 m NET, 1752 m TOT & max 2385 mGreat early-late season scramble but lots of ticks in SpringGear: Microspikes were a must when we did it in March. Bug repellent for ticks would have been a good idea. *****Even though the approach is painful sometimes, this was an awesome moderate scramble. I rated it as extreme for various reasons: mileage, total elevation, many trails around so route finding and bushwhacking involved. You sometimes follow animal trails, ATV/horse trails, power lines or hiking trails. There were no cairns on the scrambling portion so we thought we would add a few on our way back. Our GPS track is good overall, but avoid going too far East like we did (see picture and the GPS track as well) as you will lose elevation to take it back again later. It took us less than 11 hours including some breaks and we miscalculated how long it would be with that snow, ice and long approach so we came back in the dark for the last 45 minutes. The following description is the best of our way up and down.From the parking lot, trace back to the dirt road and turn right. Walk back just a few hundred meters and you`ll see on your left a pile of dirt with a dirt road going east. Take that road until you get to a junction with a shack, turn left and start an almost perfect straight line up (power line and some good trails) for 400 m elevation to Mt Yamnuska east shoulder. Then, you`ll find a good trail down the valley surrounded by Mt Yamnuska, Wendell and way further NW your two objectives for the day. Once we lost all our elevation, we arrived to a creek and turned right to walk along it until we reached another obvious trail. We turned left and down to Old Fort Creek with an open view of Association Peak and Hill. We soon crossed the creek and walked towards the Peak on the right of the river looking for a trail going up to the col. A few hundred meters later we saw a good trail and started taking another 400 m elevation up to that col. We then kept going left with some easy bushwhacking in the snow to pass the tree line. We scrambled straight up and as close as we possibly could from the right end of the summit block for some good hands-on scrambling. There is no difficult scramble there if you have some experience already. Once at the top of this first slope, you will see that big bowl between Association Peak and End Mountain. Impressive, but still not difficult we thought. We walked straight for a few hundred meters and started taking more elevation to finally get as close as possible to the cliff we had to bypass. There`s finally an opening in this wall and we turned left and almost straight up to the ridge. We turned left and up to the summit once on the ridge. Back down to the col, we continued east until we reached Association Hill summit. We the kept going left a bit for an east/SE descent with some easy bushwhacking back to our trail eventually and later on to Old Fort Creek. Our mistake after that was to try to find an easier way back up to Mt Yamnuska east shoulder by taking an ATV/horse trail way too far east. There was a lot of snow there and we had to gain back elevation we thought we would avoid doing this. Something we didn`t learn yet it seems is not to take a different trail on the way back if you`re short in time. We made it back to the car safe anyway but we didn`t enjoy going down in the dark at the end.",
    "directions": "From Calgary, follow Trans-Canada Hwy/AB-1 West and take exit 114. Keep going on AB-1X North for about 4 km and turn right on Bow Valley Trail/AB-1A. Continue for just over 2 km and you`ll see an indication to the Mt Yamnuska parking lot, turn left and head up to the parking 1 km further.",
    "geohash": "c3n",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/12248/reg_Association-Hill-Kananaskis-Hill-Traverse-Mar-12-2016-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12248/reg_Association-Peak-Kananaskis-Welcome-Mar-12-2016-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12248/reg_Association-Peak-and-Hill-Traverse-Kananaskis-Moderate-Scramble-Mar-12-2016-1--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12248/reg_Association-Peak-and-Hill-Traverse-Kananaskis-Moderate-Scramble-Mar-12-2016-9--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12248/reg_Association-Peak-and-Hill-Traverse-Kananaskis-Summit-Mar-12-2016-16--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12248/reg_Association-Peak-and-Hill-Traverse-Kananaskis-View-Yamnuska-Mar-12-2016-2--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12248/reg_Association-Peak-and-Hill-Traverse-Kananaskis-Welcome-Mar-12-2016-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12248/narrow_Association-Peak-and-Hill-Traverse-Kananaskis-Moderate-Scramble-Mar-12-2016-7--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12248/narrow_Association-Peak-and-Hill-Traverse-Kananaskis-Moderate-Scramble-Mar-12-2016-8--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12248/narrow_Association-Peak-and-Hill-Traverse-Kananaskis-Sliding-down-the-gully-Mar-12-2016-1--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12248/narrow_Association-Peak-and-Hill-Traverse-Kananaskis-Summit-Mar-12-2016-15--44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/association-peak-and-hill-traverse-near-kananaskis-ab-12248",
    "stats": {
        "Activities": "mtn-bike hike snowshoe",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 4,
        "Time": "12 hrs",
        "Total Distance": "23 km",
        "Town": "Kananaskis, AB",
        "Type": "out-and-back"
    },
    "title": "Association Peak and Hill Traverse",
    "trail_id": "12248"
}