{
    "description": "Edwards Rating: II (III - descent route & IV - ascent route) M L7 to 11 hoursElevation of 1038 m NET, 1621 m TOT & max 2384 mGreat early-late season scramble but lots of ticks in SpringGear: Microspikes were a must when we did it in March. Ice axe and crampons recommended if taking the difficult route up and snow remains in some sections of the gully.*****This is a long day scrambling in CMC Valley behind Mount Yamnuska. Route finding, bushwhacking, total elevation over 1600 metres and close to 20 km makes it a difficult day but a moderate technical scramble if using our descent route only (please see pictures and GPS).Using Mount Yamnuska hiking trail at the end of the parking lot, we hiked up to the signs and turned right for the hiking trail leading up the east shoulder of Yamnuska. The trail turns left and takes some more elevation but you will see a sign for CMC valley on a tree. We turned right and followed some decent animal and hiking trails down the valley. After losing our elevation, we turned left and bushwhacked until we passed the long cliff just below Wendell Mountain. Do not go too far right (as we did on our way up) as you would be forced to take some more elevation you would lose minutes later. Stay low and mostly straight and when you finally pass that cliff, you will go in a large drainage to your right and hike up the scree slope leading to Wendell?s ridge. We ascended the very first gully on our right just before a larger and more obvious scree slope and this was a very challenging and difficult hands-on technical scramble. If going that way, make sure you have the necessary gear, experience and technical scrambling knowledge. It was a mix of hard snow, slabs and scree on exposed terrain and crampons would have been extremely useful but we managed to do it with microspikes. This was not safe at all.Back to our descent route that you may want to use for the ascent, we found a good trail in the scree slope slightly turning right towards the end and leading to the ridge for a narrow and exposed ridge walk but with good footing. The last portion is an easy but steep hike in the scree up to the summit. We first tried to scramble a few metres under the ridge but it was a mistake and we soon climbed back on it to realize the ridge walk was a much safer and easier way to go even though narrow sometimes.Coming back down was much easier and the scree was pretty good for a quick descent with some snow patches we used to slide down on our butt. Back to the drainage, we made sure this time to loose all the elevation before turning back left into the valley and finally back up to the left shoulder of Yamnuska.",
    "directions": "From Calgary, follow Trans-Canada Hwy/AB-1 West and take exit 114. Keep going on AB-1X North for about 4 km and turn right on Bow Valley Trail/AB-1A. Continue for just over 2 km and you`ll see an indication to the Mt Yamnuska parking lot, turn left and head up to the parking 1 km further.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/12249/long_Wendell-Mountain-Kananaskis-Our-GPS-track-Mar-19-2016-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12249/reg_Wendell-Mountain-Kananaskis-Cazy-Scramble-Mar-19-2016-1--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12249/reg_Wendell-Mountain-Kananaskis-Cazy-Scramble-Mar-19-2016-2--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12249/reg_Wendell-Mountain-Kananaskis-Scree-slope-to-the-ridge-Mar-19-2016-4--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12249/reg_Wendell-Mountain-Kananaskis-Summit-Mar-19-2016-5--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12249/reg_Wendell-Mountain-Kananaskis-Trail-1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12249/narrow_Wendell-Mountain-Kananaskis-Cazy-Scramble-Mar-19-2016-3--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12249/narrow_Wendell-Mountain-Kananaskis-Crazy-scramble-Mar-19-2016-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12249/narrow_Wendell-Mountain-Kananaskis-Exposed-ridge-walk-Mar-19-2016-4--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12249/narrow_Wendell-Mountain-Kananaskis-Scree-slope-to-the-ridge-Mar-19-2016-3--44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/wendell-mountain-near-kananaskis-ab-12249",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 4,
        "Time": "9 hrs",
        "Total Distance": "19 km",
        "Town": "Kananaskis, AB",
        "Type": "out-and-back"
    },
    "title": "Wendell Mountain",
    "trail_id": "12249"
}