{
    "description": "Edwards Rating: II (II) L M8 to 11 hoursElevation of 1232 m NET, 1307 m TOT & max 2535 mGreat early-late season scrambleGear: Microspikes were a must when we did it in March and maybe even snowshoes. You may want to bring your helmet if walking in the canyon directly.*****This is an easy scramble technically as no bushwhacking, route finding or hands-on scrambling is involved. The only thing some people may be less comfortable with is how steep can be the two slopes leading to the summit. It is a long day over 20 km so I rated it as difficult overall.We first walked up to the end of the parking lot and kept going until we reached the power line. We walked under it until we saw an obvious ATV trail on our right. This led us to the Jura Creek bed where we completed the first 9 km of our ascent with an easy elevation gain of about 500-600 metres. As the creek bed was dry or snowy and icy, we didn`t even try to bypass the canyon but rather hiked in it using our microspikes on some beautiful blue ice (probably the best part of the hike). There`s one point past the canyon where the creek splits, we stayed left. There was quite a bit of snow on the last portion of the creek but that was still manageable without snowshoes. Once at the end of the creek, we started going up that steep orange slope going slightly right to find a weakness leading us on the top of that ridge. We turned right and went almost straight up that last scree slope. The highest point is just a few metres to the left. We took almost the exact same trail back down but we were looking for the best loose scree or shale to go down faster without much success. This is not the best scree to slide down. Overall a great day but the 9 km back from the ridge to the parking lot was painful at the end.",
    "directions": "From Calgary, follow Trans-Canada Hwy/AB-1 West and take exit 114. Keep going on AB-1X North for about 3.6 km and turn left on Bow Valley Trail/AB-1A for 5,2 km. There is a parking lot on your right but you can park along the road as it may be easier.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/12253/reg_Morrowmount-Jura-Peak-Kananaskis-Our-path-1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12253/reg_Morrowmount-Jura-Peak-Kananaskis-Summit-View-4x-Lougheed-Mar-21-2016-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12253/reg_Morrowmount-Jura-Peak-Kananaskis-Summit-View-Mt-Fable-Gap-Peak-Mar-21-2016-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12253/reg_Morrowmount-Jura-Peak-Kananaskis-View-Summit-Mar-21-2016-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12253/narrow_Morrowmount-Jura-Peak-Kananaskis-Canyon-hike-priceless-Mar-21-2016-4--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12253/narrow_Morrowmount-Jura-Peak-Kananaskis-Canyon-hike-priceless-Mar-21-2016-8--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12253/narrow_Morrowmount-Jura-Peak-Kananaskis-To-the-ridge-Ridge-walk-Mar-21-2016-3--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12253/narrow_Morrowmount-Jura-Peak-Kananaskis-Up-to-the-ridge-Our-path-1.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/morrowmount-jura-peak-near-canmore-ab-12253",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 3,
        "Time": "9 hrs",
        "Total Distance": "21 km",
        "Town": "Canmore, AB",
        "Type": "out-and-back"
    },
    "title": "Morrowmount (Jura Peak)",
    "trail_id": "12253"
}