{
    "description": "This hike has it all; it's remote, it has huge bouldering boulders, some of the highest cliffs on mainland NS and then of course if you know me at all it has a couple of waterfalls.It all started because I wanted to see some cliffs that were mapped on an 1890 document.   I was looking at the satellite imagery when I noticed that close by was this huge had dome like (for NS) rock jutting out of the forest.  That's all it took for m to get geared up and go.The road to the railhead is pretty rough...not that you need high clearance but its rutted for at least 20 of the 20km (approx).   It might be more....all I know is that its a good 25 min to the trailhead after leaving the pavement.The first little bit is easy as you follow a logging road that then becomes narrow as it crosses two bridges.   At the end of the trail you are in front of round pond.  there is a faint trail heading west of the lake.  Then I saw a tree and a rope crossing the Salmon River.  The rope is very frayed so caution!  Then the hill in front of you you want to circumvent.  there is a pretty fall on the Salmon River downstream of the crossing point but I saw it on my way back.  Getting back to the circumnavigation of the hill.....You basically want to go north of Maskell pond.   Around the pond you cross a small brook and bushwhack your way to a unnamed bog or pond in about  a sw direction. From the pond, you then climb a hill aiming this time for the bottom corner of Brooks Lake.  there is a huge boulder right on that corner that would be fun for bouldering.  Plus there is a small sugarloaf of rock for climbing to the east of the bottom of the lake.Across the lake you will now see the Salmon River cliffs about 600m away.  It's easy to get to them except for all the small brush in your way.   I picked a random spot to climb up and soon was up to the summit.   What a view there is up there...a full 360 degrees and to the west are huge cliffs that rival the ones on Paces Lake...except there is no-one else there but you.  I also saw at least one huge boulder down there.In the distance to the north you see some more rock faces and then also to the southeast you can see some more cliffs.  I had seen those on the sat imagery so I ventured to the cliffs to the southeast.   There are certainly more stuff to climb there but just not as high.   The way down is mostly ok but crossing the brook flowing out of the unnamed bog is a bit harder as Juan did some damage in this section.   Then you will get to the Salmon River where a small fall with a broken canoe lie just downstream of to   There is a rage tree and island just downstream of it to cross the river.  then you can follow from time to time an informal trail back to the logging road passing by another nice fall.   The whole hike was about 3.5 hours....which would be less if I only went to the largest cliffs.  And it's a weird place as I saw some flagging tape in the middle of nowhere and some cut rail the lasted maybe 100m.",
    "directions": "Lays Lake Rd off highway 357 in Meaghers Grant.  Follow it to a secondary road at N44.84962 W63.09109.  Park here or follow it down to the first bridge that is rickety that you know you don't want to go further.",
    "geohash": "dxgp",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/12258/reg_DSC-0001-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12258/reg_DSC-0006-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12258/reg_DSC-0910-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12258/reg_DSC-0925-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12258/narrow_DSC-0907-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12258/narrow_DSC-0913-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12258/narrow_DSC-0922-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12258/narrow_DSC-0924-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/promised-land-aka-salmon-river-cliffs-near-halifax-ns-12258",
    "stats": {
        "Activities": "climb snowshoe hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 5,
        "Time": "4 hrs",
        "Total Distance": "8 km",
        "Town": "Halifax, NS",
        "Type": "out-and-back"
    },
    "title": "Promised Land (aka Salmon River Cliffs)",
    "trail_id": "12258"
}