{
    "description": "This hike takes in portions of several trails in the University and Greenway area.  Trail starts at the Greenway Parking Lot, but you can access the Labrador Tea Trail coming in from Forests for the World also. Labrador Tea Trail starts just after the Labrador Tea Pond on south side of Greenway Trail. It loops back to the Blue Spruce Trail through lodgepole pine and spruce trees, as well as some areas of birch & aspen. There was logging at some point in the area, so a few areas of moderate regrowth. You can take a short steep climb up to a new lookout, for mountain views to the south and west (Baldy Hughes). Labrador Tea ends at the Blue Spruce Trail. (signs will say Greenway) Once on Blue Spruce (Greenway), head left (northeast) until you see the Sawmill Trail to the right. Sawmill Trail generally takes a southeast heading - follow it, ignoring other trail signs, until you get to an old steam boiler located in bushes to the right. About 10m past the boiler will be a trail to the left called Backside Trail which heads northeast toward the Greenway Parking lot. Several trails meet up once again in this area, but stay on Backside until you come to Bears, then take Old Trail and it will finally connect back at the Greenway Trail a very short distance from parking lot.",
    "directions": "Greenway Parking lot - first right off of University Ave once you pass the University entrance. Or, if coming from College Heights and Tyner Blvd, it is the left once you hit the steep curve going to the University.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/12250/reg_IMG-4636-45311.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12250/narrow_IMG-4610-45311_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12250/narrow_IMG-4635-45311.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12250/narrow_IMG-4649-45311.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/labrador-tea-backside-trail-near-prince-george-bc-12250",
    "stats": {
        "Activities": "mtn-bike hike snowshoe",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "4 hrs",
        "Total Distance": "11 km",
        "Town": "Prince George, BC",
        "Type": "out-and-back"
    },
    "title": "Labrador Tea & Backside Trail",
    "trail_id": "12250"
}