{
    "description": "Edwards Rating: III (V) M M (For the loop)7 to 10 hoursElevation of 952 m NET, 1314 m TOT & max 2290 mIncredible early-late season scramble as long as the west ridge & crux are free of snowGear: A good pair of scrambling boots or approach shoes could be useful for the crux. Some may want to bring a rope if not comfortable scrambling on loose rocks there.*****This is one of the greatest scramble we have done and doing the whole loop is a must if you can handle exposure, some route finding, hands-on scrambling and climbing on loose rocks at the crux. The approach is long but straightforward and the west ridge walk is fun and challenging with the east one easy-moderate and beautiful on the way down. From the parking lot, use the Mt Yamnuska approach at the end of the parking to get to the east shoulder. Once there, you`ll see an opening before you start taking elevation for Yamnuska and you will see a CMC Valley sign on a tree. Turn right and follow a very good trail down to the creek. Cross the creek and find another great trail where you turn left and along Wendell East walls for 20-30 minutes. You will start have openings on your right and when you see the beautiful pinnacles in a boulder field under Wendell, look for an easy way up to your right and towards the pinnacles. At this point we stayed at the same elevation than these pinnacles and found another scree trail leading us to the end of East Wendell. We turned right and started walking until we crossed the easy route. We went down 5-10 metres to find the other good scree trail going all the way to the col of Wendell-East Wendell. At the end of that scree trail, there is a weakness in these walls with good hands-on scrambling for 5-6 metres up. Once up that wall, look up to your right and aim to go straight between the first two pinnacles on the ridge. You`ll have scree trails both on the left and right side of a gully but since it was quite dry, we used that gully to avoid scree as much as possible. We then used a good rocky crest to finish our ascent on the col and get over that second pinnacle. From there, we stayed on the ridge all the way to the very last peak just in front of the summit block. There is a 3 metres down climb before you get there with exposure but good holds such would be the little crux. Going down the scree just before that last peak for 15-20 metres loss of elevation and then around rock bands and slabs until we saw an opening under the summit pretty much. We scrambled up rocky walls with 2-3 different possible routes and going slightly back to the left and on the ridge again. We then took a break to assess the crux and even though it seemed to be possible to cross the summit block on the left and find some moderate to difficult scramble, we didn`t like the exposure and decided to just climb up on the ridge. The rock is bad there and very loose, so we took our time to test all hands and footholds and after 2-3 climbing moves we were back to safe heaven and just a few seconds from the summit. Down the easy way, we started hiking down the long east ridge to the end and turned right at the cairn. We were lucky enough to have nobody down there so we ran down great scree. There was a lot of large rocks falling and we were calling them to our scrambling partners all the time. We would have had to slowly walk down if other parties would have been below us. Back to the parking lot pretty much the same way, except for the creek crossing that we did a little bit sooner and then took good trails back to our descent route. This loop is absolutely awesome but if you are not comfortable with route finding this may be very challenging along the west ridge and down the summit block before the crux. There`s no cairns on that side and we didn`t put any as really it depends on your level of comfort with hands-on scrambling.",
    "directions": "From Calgary, follow Trans-Canada Hwy/AB-1 West and take exit 114. Keep going on AB-1X North for about 4 km and turn right on Bow Valley Trail/AB-1A. Continue for just over 2 km and you`ll see an indication to the Mt Yamnuska parking lot, turn left and head up to the parking 1 km further.",
    "geohash": "c3n4",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/12268/long_Wendell-Mountain-East-Peak-Attempt-View-East-Wendell-to-Wendell-APR-1-2017-1024x228--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12268/long_Wendell-Mountain-East-Peak-Attempt-View-Yamnuska-Old-Goat-Old-Fort-APR-1-2017-1024x221--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12268/long_Wendell-Mountain-East-Peak-Attempt-Yamnuska-from-East-Shoulder-APR-1-2017-1024x285--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12268/reg_Wendell-Mountain-East-Peak-Attempt-Fun-Moderate-Scramble-APR-1-2017-2-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12268/reg_Wendell-Mountain-East-Peak-Attempt-Slab-Crux-Enough-for-Marry-APR-1-2017-2-1006x1024--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12268/reg_Wendell-Mountain-East-Peak-Attempt-View-Wendell-East-APR-1-2017-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12268/reg_Wendell-Mountain-East-Peak-Loop-Attempt-Stunning-walls-and-pinnacles-Mar-26-2016-2--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12268/reg_Wendell-Mountain-East-Peak-Loop-Crux-Apr-9-2016-2--44639_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12268/reg_Wendell-Mountain-East-Peak-Loop-Fun-scree-down-Apr-9-2016-1--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12268/reg_Wendell-Mountain-East-Peak-Loop-Little-Crux-Apr-9-2016-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12268/reg_Wendell-Mountain-East-Peak-Loop-Route-on-west-ridge-Apr-9-2016-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12268/reg_Wendell-Mountain-East-Peak-Loop-Route-to-west-ridge-Apr-9-2016-1--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12268/reg_Wendell-Mountain-East-Peak-Loop-Summit-Apr-9-2016-5--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12268/reg_Wendell-Mountain-East-Peak-Loop-Summit-View-Lougheeds-Apr-9-2016-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12268/narrow_Wendell-Mountain-East-Peak-Loop-Hands-on-scrambling-to-start-Apr-9-2016-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12268/narrow_Wendell-Mountain-East-Peak-Loop-Route-to-west-ridge-Apr-9-2016-2--44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/wendell-mountain-east-peak-loop-near-kananaskis-ab-12268",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 5,
        "Time": "9 hrs",
        "Total Distance": "16 km",
        "Town": "Kananaskis, AB",
        "Type": "out-and-back"
    },
    "title": "Wendell Mountain East Peak Loop",
    "trail_id": "12268"
}