{
    "description": "I got the urge to visit this location after reading a book which called for a 75ft fall 1km up from the TCH.   I did find a 75 ft but it was a bit further but there is an awesome gorge in there with multiple falls and deep holes to swim in.  Of course all of these are closest to where I parked but I didn't know that until I did a very long detour to where I thought the fall might be.   It all started on the snowmobile trail, the main branch continued a steep uphill but I could see a secondary fork going towards blues Brook.  I turned on it and went to the left at the first branch.  The trail is nicely maintained and gradually ascends the hill.  Of course, soon it was veering off course so I had no choice then to veer into a small ravine go back uphill and descend into a very steep ravine.   At the bottom, there is a a scenic 10ft waterfall.  I ascended the ravine to see if that 75ft was there but it wasn't.  I retraced my steps and came all the way down the ravine to the blues Brook.  I wen upstream for a while but the terrain didn't seem proper for a large fall.  I then went downstream and got to see along the way two fall on small tributaries that would be maybe 30 and 70ft.  These don't have a lot of water so go fatre a rainfall.Further down the main brook starts to have so small 5ft falls.  In the first mini gorge I encountered was a beaver!      Not sure what he was doing there!    After nearly climbing out of the ravine I finally stumbled upon the ravine with numerous falls, rock walls, swing ropes!",
    "directions": "Mountain Rd off TCH at N45° 55' 31.2\" W61° 11' 48.2\" and take the atv/snowmobile trail on the right!",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/12279/reg_DSC-0386-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12279/reg_DSC-0395-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12279/reg_DSC-0399-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12279/reg_DSC-0401-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/blues-brook-ravine-and-falls-near-port-hawkesbury-ns-12279",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "5 km",
        "Town": "Port Hawkesbury, NS",
        "Type": "out-and-back"
    },
    "title": "Blues Brook Ravine and Falls",
    "trail_id": "12279"
}