{
    "description": "This is one of these laces where I had been before but for whatever reason I turned back too quickly and never found the mother load of waterfalls that lie in this ravine.I started on the dirt road, pass the gate and all the way to the brook crossing.  then I went up towards the lake and saw the earthen dam.  I then followed the brook downstream, convinced that I had missed something good.   I found one little fall right at the start.  then came back to the crossing of the trail over the stream.  I then continued on and ended up seing the first and only significant fall I had ever seen on this brook...a whopping 10 footer...that is why I had never posted this one on trial peak.  fowling the stream more downstream, I vcae across lots of small picturesque cascade type falls.At some point during the descent, there was tributary that flowed into the stream and then a large pond  At the end of the pond...the first surprise!  A dam of about 30ft......Then immediately downstream a foot bridge right above a 30ft plus fall.  An old mill wall is still on one side of the stream and then another fall lies right downstream of it.At the footbridge lies a trail that you can basically follow back the hillside and back to the entrance of this Nature preserve.",
    "directions": "In Gaspereau, take the Greenfield rd up the hill and turn left on Forest Hill Drive.  Park at the end of the road at the entrance to the Nature Preserve.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/12275/30.DuncansonBrookFall.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12275/reg_DSC-0183-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12275/reg_DSC-0165-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12275/reg_DSC-0182-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/duncanson-brook-ravine-and-falls-near-wolfville-ns-12275",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "3 km",
        "Town": "Wolfville, NS",
        "Type": "out-and-back"
    },
    "title": "Duncanson Brook Ravine and Falls",
    "trail_id": "12275"
}