{
    "description": "This is a funny place.  I had followed this brook up from the highway to find a small 15ft fall a few years ago.   Based on the low flow of the stream I figured there was nothing else of value upstream....big mistake!As soon as you climb above the first fall, there are at least 4 more and all are located in a small canyon like setting.   All have what looks like deep poll at their base.  This place begs for some canyoneering style exploration in the summer!We got out of the stream and aimed for an old dirt road that took us all the way to the top of the Cobequid.  A fellow waterfall enthusiast had told me of a large fall at the top of the hill.   I took a secondary overgrown road through some evergreen and ended up at the top of a super super steep ravine!  I think that following the stream from downstream yo the fall would have been easier.   Anyways I got lucky and found pretty much the only place where you can go down the side wall of the ravine by holding on to some tiny trees.   All the way to the fall and some ways downstream, there is a sheer rock wall that you cannot go down!  Some of it looks dry and moss free enough that you could probably do some climbing.Right in front of where I comedown into the ravine, was a fall on a tributary that probably only flows after rain events or spring runoff.  At the terminal of the ravine lies a good 40ft plays fall!",
    "directions": "Highway 2 towards Parrsboro.  Turn on New Prospect Road and park at the dirt road located at N45.42674 W64.27288.  Head upstream and follow the east branch of the stream....btw there are more smaller falls on the west side of the stream as well!",
    "geohash": "f846",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/12272/reg_DSC-0224-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12272/reg_DSC-0211-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12272/reg_DSC-0213-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12272/reg_DSC-0215-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12272/reg_DSC-0220-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12272/reg_DSC-0221-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/new-prospect-falls-near-parrsboro-ns-12272",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 5,
        "Time": "2 hrs",
        "Total Distance": "4 km",
        "Town": "Parrsboro, NS",
        "Type": "out-and-back"
    },
    "title": "New Prospect Falls",
    "trail_id": "12272"
}