{
    "description": "This is an excellent hike to a very little visited mountain and fall just steps away from the Cabot Trail.  I had spotted this fall on an old map a while ago and wanted to go see it.  I decided to try to go at it in a straight line which meant to scale Jerome mountain and then descend into the valley at the back.   If you do this the hike is difficult...if you only follow the stream then the hike is easy!Setting off from the look off, I was soon on the Cap Rouge Trail but then I went off of it and started to climb the steep hill.  After a while, I found an old footpath and followed it to a false summit.  all the while i thought this as the top but the mtn kept going!  The forest is a joy to traverse as it is mostly beech trees and some evergreens at the edge.   At the top of the mountain, you have a nice view as there is almost no trees but just tall grasses almost like a Canadian version of a savanna.  Then I actually spotted the fall across the valley.  It's a multi tiered 100 ft plus easy.   he descent into the valley was a bit sketchy with slope above 100%  but in ten minutes I was at th3e base of the fall.On my way back from it I noticed what could only be an old road following the stream so instead of reclimbing Jerome Mountain, I followed the old trail and soon met up with the Cape Rouge trail.",
    "directions": "Cabot Trail to where Aucoin Brook crosses the highway .  The fall is a N46° 41' 44.2\" W60° 55' 45.8\" so either climb Jerome mountain - hard or follow stream up - easy!",
    "geohash": "f8k9t",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/12278/narrow_DSC-0362-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12278/long_aucoinbrook-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12278/narrow_DSC-0371-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/aucoin-brook-fall-and-jerome-mountain-near-cheticamp-ns-12278",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 5,
        "Time": "2 hrs",
        "Total Distance": "6 km",
        "Town": "Cheticamp, NS",
        "Type": "out-and-back"
    },
    "title": "Aucoin Brook Fall and Jerome Mountain",
    "trail_id": "12278"
}