{
    "description": "Edwards Rating: IV (V) L L (going down from Gap Peak on the narrow/exposed ridge). Probably III (IV) L L otherwise (when there`s no snow on the right scree slope and avoiding the crux that way).10 to 14 hours if you have two cars (add 5 km walk on the road otherwise)Elevation of 1418 m NET, 1934 m TOT & max 2710 mLook up at my Gap Peak and Mount Fable pages for more details about the ascent-descent. Gear: microspikes or crampons and ice axe might be useful early season. Bug repellent as there are lots of ticks and some bushwhacking is involved up Gap Peak.*****This is a very long and exhausting day with a bit of bushwhacking, some easy-moderate route finding, great exposure and fun and impressive scrambling on slabs and some very narrow sections on the ridge. As there was snow on the moderate trail, we scrambled down the steep, long and narrow ridge under Gap Peak mostly on our butt to start at least. You may want to wait later in the season (we did in mid-April) if you want to have the option of using an easier route.From Grotto Canyon trail, we walked about 700 metres until we saw a good trail on our right. We started bushwhacking and didn`t bother too much about finding the best trail as there are a lot of good animal trails and it is almost straight up. We didn`t try to avoid 2-3 rock bands we just scrambled up but you can go around them on the left. Once we reached the tree line, we went up to the cliff and turned right to its end and then scrambled up as close as possible on the left to avoid a steep slope of mud and scree. There are good rock bands to scramble up the cliff band. We then took the second cliff on its left and went up on the right as soon as we had a weakness in the wall. As the next slope is frustrating scree we took it slightly on the left side to try to use some rock bands leading to these nice pinnacles up the slope. We then went slightly to the right and up slabs to this first high point. After that it is just a nice ridge walk and it`s easier to stay on it all the way to the summit cairn. From Gap Peak, we started on our butt going down straight on a steep and sometimes extremely narrow ridge. The moderate route is probably on the right side of this ridge losing some elevation right away but it was full of snow, so the difficult route it is for us! Once we were finally done with that butt walk, we kept going on the ridge as much as possible until we arrived to these high oblique slabs and we saw the moderate trail circumventing this section on the right side traversing bowls with exposure to a cliff down below. The problem was the snow here. It made it probably the most stressful part of the traverse because of that snow. Once we traversed these bowls it was pretty much just a walk up to the highest point just west of Fable. We kept going after that peak but we turned back as our way down to the col of Fable was just under this peak. Once down to the col, we couldn`t use the slabs to go up Mount Fable as there was too much snow. We took the path of least resistance going up more on the left side of the summit block using scree trails to avoid the slabs as much as we could. When snow free, the route is obvious. Going down Fable was easy but long. We took the best possible scree on the left from the col and went down to the left side of the drainage. We followed a very good trail with some cairns to finally end up into the creek bed. At one point, there is a fork where you obviously have to turn right if you don`t want to start this all over again. Other than that, this brings you down to a barrage where you can scramble down on the right side of it. Then you walk down to Lafarge and cross the creek on your left to arrive in Exshaw. Your car is about 1-1.5 km further on the other side of the town.",
    "directions": "From Calgary, follow Trans-Canada Hwy/AB-1 West and take exit 114. Keep going on AB-1X North for about 4 km and turn left on Bow Valley Trail/AB-1A. Drive 6.9 km and turn right to Hearth Mountain Dr. in Exshaw. Then turn left and you'll see parking spaces on your left facing the 1A. Park the first car here as Exshaw residents may have your car towed away if you park at the trailhead. From Exshaw, turn right on Bow Valley Trail/AB-1A for 4 km and turn right to park at the Grotto Canyon parking lot.",
    "geohash": "c3n4",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/12276/reg_Gap-Peak-Bow-Valley-Traverse-approx-route-Apr-16-2016-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12276/reg_Gap-Peak-to-Mt-Fable-Traverse-Bow-Valley-Crux-crazy-narrow-ridge-coming-Apr-16-2016-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12276/reg_Mount-Fable-Bow-Valley-Summit-Apr-16-2016-3--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12276/reg_Mt-Fable-Traverse-Bow-Valley-Our-next-summit-Apr-16-2016-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12276/reg_Mt-Fable-Traverse-Bow-Valley-We-got-everything-almost-Apr-16-2016-10--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12276/narrow_Gap-Peak-Bow-Valley-Some-easy-scramble-up-Gap-Apr-16-2016-2--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12276/narrow_Gap-Peak-to-Mt-Fable-Traverse-Bow-Valley-Crux-crazy-narrow-ridge-Apr-16-2016-4--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12276/narrow_Mt-Fable-Traverse-Bow-Valley-Exposed-snowy-sections-Apr-16-2016-1--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12276/narrow_Mt-Fable-Traverse-Bow-Valley-Fable-scramble-Apr-16-2016-1--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12276/narrow_Mt-Fable-Traverse-Bow-Valley-We-got-everything-almost-Apr-16-2016-7--44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/gap-peak-to-mount-fable-traverse-near-canmore-ab-12276",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 5,
        "Time": "12 hrs",
        "Total Distance": "20 km",
        "Town": "Canmore, AB",
        "Type": "out-and-back"
    },
    "title": "Gap Peak to Mount Fable Traverse",
    "trail_id": "12276"
}