{
    "description": "NTS Map: 011I03\r\nBonshaw Trail System\r\n\r\nThe Bonshaw trails were first constructed back in 1974 by the Red Cross as a hiking / running trail spanning both sides of the Trans Canada Highway. The water-side of the trail is 6.5K, while the inland side is between 7-10 K depending on the spur trails you cover.\tOf all the hikes I know of in PEI, this is the most back country in nature, and has camping potential. No guarantee for a water supply however.\r\n\r\nThe trail serves as frequent haunts for informal groups of mtn. bikers called the Twisted Shifters and Rigid Riders who conduct frequent trail maintenance and course re-routing when hurricanes cause havoc, or private landowners take issue.\r\n\r\nThe system cuts through land that is entirely privately owned. Consequently it is essential to stay on the trail to keep land owners happy. On one occasion, one landowner did the generous act of creating new trail to keep cyclists from rutting one of his logging roads. Thus the range of enthusiasm is teeteringly varied. Please, no ATV's.\r\n\r\nThe trail serves hikers and cyclists by warmer seasons, and xc skiers and snowshoe enthusiasts by winter. I am especially enthusiastic to finally have the GPS data  because with downed leaves in the autumn, and snow cover in winter, the trail is difficult to track.\r\n\r\nThe nature of the trail is such that it passes through some of the hilliest terrain of the island. It spans gorges and edges along the occasional clearing.  An added bonus is that the trail's original route (not including recent detours) was such that it went through a variety of flora. Because of the trees close to the trail, the roots and surface undulations, the Bonshaw trail is one of the  most technical the island has to offer.\t\t\r\n\r",
    "directions": "(Thank your GPS!)\r\n\r\nFrom Charlottetown, you can access the water side of the Bonshaw trail (also known as the St. Cat's trail) by  reaching the small community of Bonshaw, and after crossing the West River bridge, turn left onto the St. Catherine's road. Drive for about a minute or two and look for a small \"trail\" sign posted near a stick bridge crossing the ditch on the right.\r",
    "geohash": "f84y",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/PE/1228/long_bonshaw.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/1228/reg_100-0020-27250.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/1228/reg_100-0022-27250.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/1228/reg_100-0023-27250.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/1228/reg_100-0027-27250.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/1228/reg_100-0029-27250.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/1228/narrow_100-0031-27250.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/1228/narrow_BStrailheadmarkerjpgjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/1228/narrow_athicketjpgjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/1228/narrow_trailjpgjpg.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/bonshaw-trail-st-catherines-trail-near-charlottetown-pe-1228",
    "stats": {
        "Activities": "snowshoe hike mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 5,
        "Time": "2 hrs",
        "Total Distance": "7 km",
        "Town": "Charlottetown, PE",
        "Type": "out-and-back"
    },
    "title": "Bonshaw trail (St. Catherine's trail)",
    "trail_id": "1228"
}