{
    "description": "Edwards Rating: I (I) S S (This is a hike not a scramble)5 to 8 hours (if road is closed)ROAD CLOSED FROM DEC 1 UNTIL JUNE 15. We did it in April and GPS/Data considers that extra 6.4 km.Elevation of 636 m NET, 754 m TOT & max 2143 mNice early-late season hike if you don`t mind walking on the road to get to the trailhead. Gear: Bug spray early season is a must as there may be lots of ticks with all the sheep and deer around.This is an easy hike with a bit of bushwhacking involved the way we`ve done it but look at the GPS screenshot as a mix of our ascent-descent route is the best recommended route to avoid bushwhacking (very easy though) and get to that ridge as soon as possible for nice views and a fun walk. It`s worth a visit and we will definitely go back planning a long traverse in between all these hills in the region. There were so much scats of deer, sheep and elks everywhere but we haven?t ?seen one animal in that bad weather. On a good day, you would definitely see them on the ridge and would probably be attacked by an army of ticks early in the season.We parked at the 541/940 and 40 junction as the rod is still closed and walked 3.2 km to find a good trail on our right. We took a bit of elevation by going left but we should have gone straight or slightly right t avoid that slope and just get to the very beginning of the ridge earlier. We didn?t bother too much as this was a grassy slope and even though we couldn`t see anything with the clouds, we knew from our satellite map where to go. Once we later reached the ridge, we started the long and beautiful walk up to the false summit. It was raining and the greenish rocks were very slippery so it made that little bit of scrambling more challenging but it seems anyways like the best way to go was to stick on the ridge all the time. We circumvented the high points on the left on our way back down and it was not fun sidesloping in the tress and rubble. There is a gigantic cairn on the false summit but you`re not yet at the highest point, being 1 km further away losing some elevation and then up another grassy slope to the very end of that ridge at about 2143 metres elevation. But the best views even though it was raining all day were definitely closer to the false summit. The real summit is surrounded by trees so you don`t get a 360 view up there.",
    "directions": "From Bragg Creek, take Highway AB-22 South to Longview and turn right on Highway 541 to Kananaskis. Drive 44 km and park at the 541/940 junction if the road is still closed to walk 3.2 km to the trailhead. If open, drive an extra 2.7 km and park at the parking lot on your left. Walk 500 metres further to the trailhead on your right.",
    "geohash": "c2yq",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/12285/long_Cat-Creek-Hills-Kananaskis-GPS-MAP-Apr-24-2016-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12285/reg_Cat-Creek-Hills-Kananaskis-Apr-24-2016-10--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12285/reg_Cat-Creek-Hills-Kananaskis-Apr-24-2016-14--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12285/reg_Cat-Creek-Hills-Kananaskis-Apr-24-2016-19--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12285/reg_Cat-Creek-Hills-Kananaskis-Apr-24-2016-3--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12285/reg_Cat-Creek-Hills-Kananaskis-Apr-24-2016-44--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12285/reg_Cat-Creek-Hills-Kananaskis-Apr-24-2016-9--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12285/reg_Cat-Creek-Hills-Kananaskis-False-Summit-Apr-24-2016-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12285/narrow_Cat-Creek-Hills-Kananaskis-Apr-24-2016-24--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12285/narrow_Cat-Creek-Hills-Kananaskis-Apr-24-2016-33--44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/cat-creek-hills-near-kananaskis-ab-12285",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "6 hrs",
        "Total Distance": "13 km",
        "Town": "Kananaskis, AB",
        "Type": "out-and-back"
    },
    "title": "Cat Creek Hills",
    "trail_id": "12285"
}