{
    "description": "Cottonwood (the plateau that extends along the Red Rock National Conservation area) is single-track heaven.  Most don't think of Las Vegas as one of the premiere mountain bike destinations -- it's overshadowed of course by the lights further below and Moab un Utah.  But here, riding directly from the Bike Shop (McGhies) and parking area at the old mining town of Blue Diamond on the outskirts (30 min) from Vegas, you have incredible flowy single-track that takes you out in behind some front range and into the plateau area looking up to some large peaks.  Joshua tree and other desert vegetation make this riding network a thrill. I can't say enough about it.My own route (day 1) consisted of the landmine trail loop, and some other miscellaneous riding on Ducky, and others.  More technical climbs and difficult trail options exist like the Hurl exist, and if you head up towards the mountains, there are trails of higher difficulty rating on the shoulder area of the mountains.  The bike shop in town McGhies has rentals ranging from hard tail to high-end dualie.  You'd be fine with either here as the trails are smooth.The main trails are just pure flow and heavenly single-track, with ups and downs, and, some extended slight downhill grade rides that swoop and roll -- you will love it.  No real difficulty but even the advanced rider will enjoy taking these sections at speed.  You can spend all day out here, definitely a few if you want to get to some of the must do trails (Mustang, Late Night, Ducky, Landmine, ...).  The bike shop will hand you a paper map, that admittedly is hard to decipher until you've ridden here a day.The bike shop also sells good maps, and, can put you in touch with a guide.  If you ride Cottonwood and love it, there are more options nearby.  Cross the highway and check out the 3 mile smile, one of my favourites, as you ascend on Dead Horse Loop, then climb Devil's staircase  (all switchbacks) to reach an upper plateau that has a meadow full of Joshua trees as you get flow sections. Then the 3 mile downhill (not extreme) that will put a smile on your face.  So now here's the main info you need to have two great days of riding here, after which you can come back and do more (like 3 mile smile), or venture to other networks in Vegas. So here we go.First, this network of trails makes it hard to get lost as it's bounded by the highway on the left (as you ride up -- and the old Spanish trail is one connector trail that you will intersect with a few times as you climb out of the shop up the plateau).  The trails are (obviously) bounded by the mountains to the west (very top of the plateau).  Next, the Blue Diamond Road below you, and, well, that's your main box.So, out of the bike shop you can ride Molly (super flowy - new trail) or connect with a shortcut taking you to closer to the highway (after a major dip and climb).  Once on the main trail heading up parallel to the highway, don't follow Old Spanish too long, turn RIGHT into the trails (you can see that on my GPS map).  You will naturally likely do this anyway.  Take \"Ducky\" or the  \"Landmine\" loop.  I did landmine on day 1, after taking Ducky then turning back to connect with Landmine.  It's the loop (that isn't quite complete on my GPS track, but it's an obvious oval circling a small mountain range close to town).  So that's about 9 miles or so complete. Good stuff.On day 2, I knew the terrain a bit more and, other than Ducky and Landmine, not much is signed.  So Ducky is both a good reference trail, and, super fun. I loved Ducky you can take it up and down, and it passes a J-tree full of small rubber ducks (see pic).  After you follow this, you can wind your way again closer to the highway and followup (incline up) to the Late-night parking lot.  Continue on through and then merge towards the mountains on late-night and enjoy the flow on a downhill grade!  Keep it going, until you hit Black Velvet (I somehow missed this loop, thought I had done it, alas no). If you zoom in on google maps, it seems they have the trail outlines.  You'll see Black Velvet.  There are other trails up high close to the mountains.  Poorly signed, but, you can't really get lost.  On the way back, look for signs to Ducky, and, reconnect with the familiar and your route up, and then take Molly back to town (this is at least a few hours of riding all in), or, find Landmine which is one big loop closer to the nearer peaks of town.OK so if you ride these must do areas, and you still want more, there is more.  Head to the bike shops in Blue Diamond, or, in town (Pro Cycles - Summerlin area) where at Pro Cycles you can rent mountain or road bikes, and, check in with them. It's in Summerlin, they'll have more trails for you to check out. By the way, a great area to stay in close to Red Rock Conservation Area.  Of course, the bike shop in Blue Diamond itself is your starting point for Cottonwood.  Technical riders will enjoy Cowboy Trails (closer to Summerlin and Pro Cycles, but finding theactual  trails for riding can be challenging), where you get perhaps the most technical riding in the area.  You've got a lot more to check out as well -- at least 2 or 3 other networks nearby.  Could you spend a whole week in Vegas cycling, hmmm, yes you could.  2 Days Cottonwood, 1 day Cowboy, 1 day for 3 mile smile (it's also part of Cottonwood so 3 days Cottonwood) and nearby, and, you've got 2 other networks (Southwest - close to a suburb), and, then you've got Bootleg Canyon not too far away, and don't forget Gooseberry Mesa 2 hours away at Hurricane.  And that's on the way to Moab (Mecca). Or drive 5 hours South to Sedona.  All in all, 3-4 days of cycling in Vegas (if not hungover) will please any mountain biker -- then -- go forth to the Mecca's of riding, either Moab or Sedona.  Word is many of the bike networks in Vegas on the Red Rock side will soon connect!",
    "directions": "Blue Diamond (small town heading towards the westerly mountains), pull into town, you can't miss the bike shop in town, they provide rentals, and, will service / sell parts.",
    "geohash": "9qm",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/NV/12299/reg_DCIM383[N3602228W11542517T445268A8H04729D]-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/NV/12299/reg_DCIM384[N3600267W11544420T44527136H0502F9]-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/NV/12299/reg_IMG-0174[1]-5_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/US/NV/12299/reg_IMG-0176[1]-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/NV/12299/reg_IMG-0179[1]-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/NV/12299/reg_IMG-0183[1]-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/NV/12299/reg_IMG-0186[1]-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/NV/12299/reg_IMG-0189[1]-5.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/cottonwood-near-las-vegas-nv-12299",
    "stats": {
        "Activities": "mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 5,
        "Time": "3 hrs",
        "Total Distance": "50 km",
        "Town": "Las Vegas, NV",
        "Type": "out-and-back"
    },
    "title": "Cottonwood",
    "trail_id": "12299"
}