{
    "description": "This is a hike I did in the long search for a sea cave that was suppose to exist in this cove.   One of the stream leading into the cove has a fantastic 50ft high fall aka St Croix Cove fall.I entered the cove by following another stream down to the shore.  Close to shore are two falls of about 15 and 10 ft.  Once on the cove, I headed east and  found myself looking down more than up.....there are a bunch of cool looking minerals all over this place.  some are embedded in the cliffs and some just lie in the open.I made my way to the mouth of the brook which has the tall fall upstream.  Right at the beach is another set of fall of about 15ft.   Further east a cliff rises.  On the sat imagery I had seen a kind of circular pattern on the cliff.  turns out its a softer part of the cliff which has lost some height in this area in a quasi perfect half circle.  You can climb higher here but I was turned away by the seagull colony laying eggs at the time!I could see a dark patch in this distance and thought it might be the cave.   Sadly it was not.  I was at the eastern end of the cove and hiked to the top of the cliffs and 100m more east was this totally gnarly rock face...perfect for bouldering!",
    "directions": "Shore Rd in St Croix cove.  I followed snow brook but the large fall is on Poole brook just 200m down from the road.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/12303/reg_DSC-0462-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12303/reg_DSC-0468-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12303/reg_DSC-0484-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12303/narrow_DSC-0473-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/st-croix-cove-mineral-hounding-near-bridgetown-ns-12303",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "6 km",
        "Town": "Bridgetown, NS",
        "Type": "out-and-back"
    },
    "title": "St Croix Cove Mineral Hounding",
    "trail_id": "12303"
}