{
    "description": "Edwards Rating: II (III or IV) M LTechnically moderate if avoiding some sections by sidesloping on either side of the ridge.8 to 13 hoursElevation of 1226 m NET, 1573 m TOT & max 2727 m (2557m for Volcano Peak and 2721m for Old Baldy Mountain)Awesome early-late season ridge traverseGear: May require an ice axe and crampons if too much snow when traversing a couple of gullies and some sections of the ridge.*****What an awesome ridge traverse! The best thing is that most scramblers with a minimum of experience and in good physical condition can do it as there is always different options and it is possible to avoid down climbing or narrow ridge walk. We decided to stay on the ridge to really enjoy this scramble even though it meant to take more elevation as some of the high points between each summit would have been avoidable in lower elevation on either sides (mostly right between Volcano and McDougall and left after that). Route finding is not required if you stay on the ridge but it may be rated difficult technically because of the exposure and some down climbing or scrambling on slabs.From the parking lot, we took the main trail for a couple hundred metres and then turned left to follow the bed creek for about 1.8km at the end of the maintained trail (sign). We kept going past the sign for about 300 metres and we saw the obvious cairn to Old Baldy trail and turned left to start going up in the valley (GR325384). The trail starts to take more elevation at some point and we should have stopped before it did so we had to turn back down and cross the creek (around GR337388 for less bushwhacking distance) for a 200 metres of terrible bushwhacking. Once we got to the unstable rubble slope, we started going up and slightly left to get to the skyline. We turned left and hiked up to Volcano Peak. From Volcano, take a few minutes to look at what`s coming (see picture). From there this is straightforward as the goal is to stay on the crest and scramble all the way down and up to McDougall for 2 km. If you were to take the easiest trail all the way, you may want to consider doing that traverse later in May or June when there`s no more snow. Staying on the ridge made it more challenging technically but safer in my opinion. If you can`t go down the crux later on, you may have to lose some elevation on the left and sideslope past it. From McDougall to Old Baldy, we again stayed on the ridge and sometimes walked a little lower on the left side because of the snow. Just a few metres before Old Baldy summit and if you stayed on the ridge, there will be a difficult and exposed wall to climb. We avoided that section by walking along a slab and then along a wall in the scree slope.From the 3rd summit, we went straight down toward the grassy slopes for probably a couple of hundred metres. Watch on your left just before a small peak on that ridge as there is a perfect scree slope to lose most of the elevation in a few minutes only (see picture). We went down there as long as the scree was great and then cut to the right to reach the valley on the grassy slopes. We then easily saw the trail and went all the way back along the creek, mostly on the right side but sometimes left or in the creek bed as the 2013 flooding damaged the trail. Personally my only concern during that traverse was to cross these 2 snow gullies/cornices as we took unnecessary risks by not having the appropriate gear with us.",
    "directions": "From Calgary, follow Trans-Canada Hwy/AB-1 W to Kananaskis Trail/AB-40 S. Take exit 118 and start your odometer for about 27.4 km drive to the Evan-Thomas parking lot on your left.",
    "geohash": "c3n1",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/12308/reg_McDougall-Traverse-Kananaskis-Awesome-Scree-Down.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12308/reg_McDougall-Traverse-to-McDougall-Kananaskis-2-Bad-Snow-Gullies-to-Cross-May-1-2016-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12308/reg_McDougall-Traverse-to-McDougall-Kananaskis-Crux-May-1-2016-1--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12308/reg_McDougall-Traverse-to-McDougall-Kananaskis-Peak-2-3-from-1-May-1-2016-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12308/reg_McDougall-Traverse-to-McDougall-Kananaskis-Summit-Old-Baldy-way-further-May-1-2016-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12308/reg_McDougall-Traverse-to-Old-Baldy-Kananaskis-Summit-May-1-2016-2--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12308/reg_McDougall-Traverse-to-Old-Baldy-Kananaskis-Summit-May-1-2016-7--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12308/narrow_McDougall-Traverse-to-McDougall-Kananaskis-Crux-from-Nugara`s-Book-fun-and-easy-May-1-2016-2--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12308/narrow_McDougall-Traverse-to-Old-Baldy-Kananaskis-Looks-Exposed-but-Actually-Easy-May-1-2016-2--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12308/narrow_McDougall-Traverse-to-Old-Baldy-Kananaskis-Looks-Exposed-but-Actually-Easy-May-1-2016-9--44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/volcano-little-md-to-mcdougall-to-old-baldy-md-nw2-traverse-near-kananaskis-ab-12308",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 4,
        "Time": "10 hrs",
        "Total Distance": "17 km",
        "Town": "Kananaskis, AB",
        "Type": "out-and-back"
    },
    "title": "Volcano (Little MD) to McDougall to Old Baldy (MD NW2) Traverse",
    "trail_id": "12308"
}