{
    "description": "This is a really cool place to hike.  It has one of the largest sea caves in Nova Scotia.   I was in the area to visit another cove but looked at a satellite imagery first to see if there were more points of interests nearby.  That's when I spotted these cool looking cliffs just east of Port Lorne....actually east of the Keating \"sand\" beach...No sand to be found there by the way.the first part of the hike is on an old road (Shore rd) that has been overgrown but would be passable by bike.  Before you get to Staratt brook there is a secondary trail to your left.  Take it and follow it to the shoreline.  I spotted a porcupine up an evergreen on the way...it was pretty funny to see.  Once on the beach, head east.  there is a cliff nearby and right after you enter the cove which has the very large and deep enough sea cave.   I got out of the cove heading east but I was exactly at low tide and there wasn't much space left to get by with dry feet so be careful.    On the other side of the rock wall, another deep cave!  and then a very large rockfall with numerous holes big enough to squeeze into and play around.  Once I =found this spot on the sat imagery, I also found an old geology book talking about this place and how there was a cavity which you could enter....not a sea cave but more of a cave like structure...however i didn't find it.further east I could see another sea cave and a waterfall.  I hiked up to it (its on number five brook).  At this point I knew I couldn't get by the pinching point near the main cove so I hiked up the cliffs and followed them back to Staratt brook.  Then I actually walked the brook upstream.  no falls there but there are some larger fall on this brook but located way more upstream (there s a post on trailpeak on them)",
    "directions": "Arlington Rd on the North Mountain. turn on Grant Rd and park where it turns 90 degrees and becomes shore rd.  The beast sea cave is at N44° 57' 34.1\" W65° 14' 07.5\" with the pinching point just east of it.",
    "geohash": "dxcx",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/12302/reg_DSC-0500-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12302/reg_DSC-0501-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12302/reg_DSC-0503-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/keating-sand-beach-caves-and-cliffs-near-bridgetown-ns-12302",
    "stats": {
        "Activities": "hike sea-kayak",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 5,
        "Time": "2 hrs",
        "Total Distance": "8 km",
        "Town": "Bridgetown, NS",
        "Type": "out-and-back"
    },
    "title": "Keating Sand Beach Caves and Cliffs",
    "trail_id": "12302"
}