{
    "description": "Edwards Rating: II (III) M L7 to 10 hoursElevation of 1270 m NET, 1379 m TOT & max 2646 mNice early-late season scrambleGear: May require ice axe and crampons if too much snow left in the gully.*****This is not the most exciting scramble we`ve done but it is still a good one to do early season. We attempted it in a whiteout in March 2016 and had to turn back as the snow was hard and seemed impossible to deal with without an ice axe and crampons. A month later on April 30th, we managed to complete it in the clouds with wet rocks/slabs without too much trouble. It might be a moderate scramble technically at most but was trickier sometimes because of the weather. I rated it as difficult only because it?s still 17 km & over 1300 metres elevation gain.Starting from the popular Lady Mac parking lot, walk up Cougar Creek for 6.7 km approximately. You will see a debris fence after about 1.5 km and there`s an opening in it. After 4 km at the Canadian Forks, take the left fork and keep going for another 2.7 km where you will see a gully on your right (we added a cairn there). Scramble up that gully using either sides when necessary if you can`t climb the walls in front of you. Once on the first plateau, we could see 3 snow gullies further up and slightly on the left and needed to get to the middle one just between the false summit and another smaller peak on the right. We cut to the left to take some elevation and avoid the snow without knowing yet how it was and then kept going up toward the gullies. When we reached the middle gully, we scrambled on the left side of it for a while until we found an easy and flat spot to cross the snow and reach the scree-rubble slope on the right side. We went a little further right under the small peak to use some rock bands as the scree was pretty frustrating. Once we reached the col, we turned left and went on the false summit to finally walk an extra 100 metres to the summit cairn. We couldn`t see at all so it`s hard to really tell how worth it is that scramble and conditions were not so good that day. Descent was fun and quick as the snow was actually pretty good to slide down on our butt.",
    "directions": "From Calgary, follow Trans-Canada Highway/AB-1 to Canmore and take exit 91. Turn left on AB-1A and take the first left on Elk Run Blvd for 1.9km. Turn right into the Lady MacDonald parking lot.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/12307/reg_Cougar-Peak-Bow-Valley-Cleared-up-a-bit-completely-when-finished-Apr-30-2016-2--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12307/reg_Cougar-Peak-Bow-Valley-Our-route-Apr-30-2016-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12307/reg_Cougar-Peak-GR219648-Attempt-Mar-25-2016-17--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12307/reg_Cougar-Peak-GR219648-Attempt-True-Mnt-weather-today-Mar-25-2016-2--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12307/narrow_Cougar-Peak-Bow-Valley-So-funny-and-quick-Apr-30-2016-1--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12307/narrow_Cougar-Peak-Bow-Valley-Summit-Apr-30-2016-3--44639_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12307/narrow_Cougar-Peak-GR219648-Attempt-Difficult-scramble-impossible-Mar-25-2016-1--44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/cougar-peak-gr219648-near-canmore-ab-12307",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 3,
        "Time": "8 hrs",
        "Total Distance": "17 km",
        "Town": "Canmore, AB",
        "Type": "out-and-back"
    },
    "title": "Cougar Peak (GR219648)",
    "trail_id": "12307"
}