{
    "description": "I rated this trail difficult just due to the fact that you need to add 9km to the trailhead by bike and 9 km back. And its similar to the grouse grind with rope sections but you have to go back down.The views are spectacular. The peak is a huge flat surface you can explore you can see Seymour valley below all the way to the city. The whole mount Seymour range and as you walk to the back of the peak you see Seymour reservoir and the mountains behind that. And you also see Mt Coliseum with a couple of nice water falls at this time of the year (early may). There is a trail that leads to Mt Coliseum but there is still lots of snow. This is one of the nicest views i have seen in a while and i didnt see anyone all day friday. The 4 hours it took me was including the bike ride and i hike fairly fast almost running down hill also. Enjoy",
    "directions": "Hwy 1 exit 22A and take lillooet all the way to Seymour reservoir. The road continues through the forest with speed bumps until you get to a parking lot on the right. You will know you are there when you cant drive further. Ride your bike on the paved Seymour trailway to the 9 km mark and about 200m later there is a road to the left that turns to gravel. Follow this old logging road to its end a dried up creek bed with big rocks and on your right you see the trail going in the forest. Well flagged just got to look up more often to make sure you dont miss one. Its up all the way with no respite. So take your time the view is worth it.",
    "geohash": "c2b91",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/12312/reg_IMG-0341-42566.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12312/reg_IMG-0342-42566.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12312/reg_IMG-0348-42566.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12312/reg_image.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12312/narrow_image.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/patons-lookout-near-north-vancouver-bc-12312",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 5,
        "Time": "4 hrs",
        "Total Distance": "6 km",
        "Town": "North Vancouver, BC",
        "Type": "out-and-back"
    },
    "title": "Paton's Lookout",
    "trail_id": "12312"
}