{
    "description": "Edwards Rating: II (III - with the crux) L L11 to 14 hours (a couple of hours quicker if you have a bike) RESTRICTIONS: No bikes allowed July 10-Sept 15 and hiking in groups of 4 during that periodElevation of 1695 m NET, 1937 m TOT & max 3173 mEarly-late season scramble (We did it in May on a warm Spring in 2016 and it was fine)Gear: May require an ice axe and crampons if too much snow left.*****This is mostly a very long hike and scrambling is easy except if you stay on the ridge to down climb the crux as we did but it was a lot of fun. Views are impressive as this is the highest peak around Banff and Lake Minnewanka was gorgeous from up there.From the parking lot, we turned left and kept going on the road to the trail going along the lakeshore. After crossing the bridge in the canyon, we kept going left to the sign and then turned right to follow the Aylmer Pass trail. This is a beautiful but long 8 km hike to the campground and to the next sign where we turned left. If you have bikes you will probably enjoy the whole day more than we did hiking all the way. We started gaining a bit of elevation up into the valley and after about 3 km, we saw a wide avalanche gully (GR081849) to our right and started our ascent to this first col (grassy slope on the right, dirt and scree on the left). We made the mistake to go too far left and came back to the right to take advantage of the easier grassy slope. Once on the col, we could see the summit but not the ridge yet. We scrambled up in between the brownish peak and grey peak to gain the ridge. From there, we gained more elevation than necessary by staying on the ridge but finally having some fun scrambling to do up to a cliff before the last col leading to the summit. We walked back just a few metres and saw the 5-6 metres long down climbing to do which was the crux. Some of the steps were tricky because there were no footholds but friction was great and handholds okay so it was not bad. I am not sure I would rate it as difficult technically even though I understand some parties may not be comfortable with down climbing. If you are not taking that route you must stay off the ridge from the beginning and walk below it to the right sidesloping on a steep scree slope. If you start walking up on the ridge and can`t down climb, you will lose a lot of time and energy getting back to the beginning of it and take the easy route. Once at the col, it was an endless scree-rubble slope up to the summit, steep and taking in at least a third of the total elevation right there.Back down, we tried a different route on the right side of the ridge from the col and it turned out to be a frustrating and longer than expected descent. The best way to go would have been to use the easy route on the left sidesloping under the ridge and back to our avalanche gully. We could easily see this route from the summit.",
    "directions": "From Calgary, follow Trans-Canada Highway/AB-1 to Banff and take exit toward Banff/Minnewanka Loop. Keep right to continue on Lake Minnewanka Scenic Rd/Range Rd 115B Rd for 5.5km. Turn left to the Lake Minnewanka parking lot.",
    "geohash": "c3jg",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/12318/reg_Mount-Aylmer-Banff-Awesome-morning-hike-along-Lake-Minnewanka-May-7-2016-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12318/reg_Mount-Aylmer-Banff-Break-on-the-col-May-7-2016-1--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12318/reg_Mount-Aylmer-Banff-Col-to-Summit-Route-May-7-2016-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12318/reg_Mount-Aylmer-Banff-Our-gully-up-the-col-Route-May-7-2016-1--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12318/reg_Mount-Aylmer-Banff-Summit-May-7-2016-1--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12318/reg_Mount-Aylmer-Banff-Summit-May-7-2016-4--44639_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12318/reg_Mount-Aylmer-Banff-Summit-May-7-20161-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12318/reg_Mount-Aylmer-Banff-View-Mt-Girouard-Inglismaldie-May-7-2016-1--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12318/narrow_Mount-Aylmer-Banff-Awesome-morning-hike-along-Lake-Minnewanka-May-7-2016-3--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12318/narrow_Mount-Aylmer-Banff-Crux-fun-May-7-2016-2--44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mount-aylmer-near-banff-ab-12318",
    "stats": {
        "Activities": "mtn-bike hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "12 hrs",
        "Total Distance": "30 km",
        "Town": "Banff, AB",
        "Type": "out-and-back"
    },
    "title": "Mount Aylmer",
    "trail_id": "12318"
}