{
    "description": "This is a full loop starting at P2 on the road (where one can venture onto either side to create a longer hike than the visitor center map hikes of 30 minutes each) and moving to either side to hike the red rock and explore.  We were tired of the crowds at Zion (at all costs avoid Emerald Pools -- it felt like a cattle run), and Valley of Fire State Park is very impressive, and, more expansive than I thought.  I'd rate it higher than red-rock state park, at least for the actual red rock and geography.  Don't get me wrong, Red Rock Park near Vegas is a favourite, but Valley of Fire was equally impressive and has hiking opportunites that go beyond the visitor center maps.On this hike, we wanted to explore -- so we parked at P2 and initially wanted to head off on the mountain side (all the rock), but looking at the visitor center map, it was clear we could create our own route from P2 to the famed fire wave (alternating sandstone colours on red rock), and what a great hike it was.  In fact, the park should make this an official loop rather than just the current 20 minutes in from the firewave (and crowds).So cross the road from P2 which is at a height of land, looking down initially across a white rock outcrop, then, hike to the nearby peak in front of you with sand dune on top.  From there, walk towards the firewave on the peak, and, looking below you'll see people on it.  Now descend, make your way to the wave, a very cool approach to it.  Join everyone else there, take the pics, then, follow the maintained trail back to their parking lot.But here, cross the road, and, get an even more stellar (somewhat close to the road) scramble and hike back along mostly sandstone.  Some easy route finding and descending off rock shelves, you eventually find a pool or two (coyote tracks at the water trap -- likely dry in summer), and, continue your route finding and hiking, what fun.  Climb up a small canyon (arguably a small slot) and as you complete the rise, you are just under where you initially parked.  The GPS map right more or less shows the route, this was a great hike, in part because it involved exploring and having a good idea where one was (relative to the road).  The sandstone is grippy, you can easily walk down steep stone slopes.  Wonderful.",
    "directions": "Valley of Fire State Park one hour from Vegas (do this after Red Rock National Conservation Area and Calico Tanks hike).  The scenery here is other worldly, star trek and various westerns were filmed here.  OK stop in at the visitor center, then, get to P2 for the best part of the park.  Create your own route, or, follow the route described here to get an alternate route to the fire wave (made famous by the Germans!).  Summer may be too hot.  Go in Spring or Fall, or winter.To Park at P2 either follow the visitor center map, or, use the attached GPS to find the location where it crosses the road (at height) from the south, this is your starting point, cross the road and go.",
    "geohash": "9qqx",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/NV/12316/reg_DCIM373[N3647353W11452250T44511F9FH0246BD]-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/NV/12316/reg_DCIM374[N3647353W11452250T44511FA8H0246F1]-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/NV/12316/reg_DCIM375[N3647376W11452197T44511FEBH024C33]-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/NV/12316/reg_DCIM378[N3648452W11452257T44512984H0245E6]-5_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/US/NV/12316/reg_DCIM382[N3648613W11452377T44512A9EH0245CC]-5.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/valley-of-fire-firewave-loop-near-las-vegas-nv-12316",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall",
        "Stars": 5,
        "Time": "2 hrs",
        "Total Distance": "10 km",
        "Town": "Las Vegas, NV",
        "Type": "out-and-back"
    },
    "title": "Valley of Fire - firewave loop",
    "trail_id": "12316"
}