{
    "description": "This is such a cool little discovery for me!   I have almost exhausted the potential locations for falls in the South Mountains of the Annapolis valley.  However I was looking at the sat imagery and the side view and noticed a good dip in the forest where the south River leaves the Factorydale dam.   The dam was also a clue as it needs some height difference to create electricity.Instead of moving down the stream, I walked on a dirt road on its western side and then entered the woods about 500m down.  I quickly entered a magnificent softwood mature stand and was rewarded by a high sided ravine in front of me.  I made my way down and wasn't sure if the falls would be upstream or downstream.  I followed the river down for a while and apart from some rock walls and almost caves there wasn't anything else.I went upstream and quickly the mini gorge formed and there was a rock wall that look suitable for climbing just before it.  Turning around a corner, I spotted the power house of the dam.  From there and moving upstream is a series of falls that are set in a min gorge like setting.  The upper most fall is the biggest and it has a very large pool at its base.",
    "directions": "Aylesford Rd from highway 1 and then turn right on Harmony Rd and park at the dam.  At the Factorydale pond and dam...follow the river downstream for some unique features.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/12325/29.SouthRiverFall.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12325/reg_DSC-0750-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12325/reg_DSC-0707-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12325/reg_DSC-0726-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12325/reg_DSC-0738-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12325/reg_DSC-0755-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12325/narrow_DSC-0717-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12325/narrow_DSC-0722-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/south-river-mini-gorge-and-falls-near-aylesford-ns-12325",
    "stats": {
        "Activities": "climb hike",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "3 km",
        "Town": "Aylesford, NS",
        "Type": "out-and-back"
    },
    "title": "South River Mini Gorge and Falls",
    "trail_id": "12325"
}