{
    "description": "Edwards Rating: I (II) S M (this is mostly a hike) 4 to 7 hours for the loopElevation of 872 m NET, 980 m TOT & max 2428 mWe did it in winter conditions and it was ok.*****I would not qualify this as a scramble even though some bushwhacking was involved to complete the loop back to the road. This is still an interesting hike with beautiful views and avalanche hazard was very low as there was just enough fresh snow to make it harder but no layering. It may be risky when there?s more snow on some of the slopes we used to complete that loop. We hiked up Lineham trail for about 1.8 km and turned right (GR175396) on an open slope to start Ruby Ridge ascent. We kept going slightly to the left and along the forest to start the ridge walk from the very beginning. There is probably a trail here somewhere but we could not see it as there was quite a bit of snow (2-5 feet) after a recent snowfall a few days before our ascent in mid-May. Once we reached the ridge, we completed our ascent to the first summit. From there, we just followed the ridge down a few rock bands and back up to the false summit (GR188413) and the highest point to the East a few minutes later. Because of all that snow, we did not to go further down East and rather went back down to the false summit to turn left at that point and down on its crest. Again this is easy scrambling leading to the forest where bushwhacking was pretty easy for a while and became not so good the last 10 or 15 minutes back to the road. We walked back up to our car by the road. This is a very nice hike to do if you don?t have much time or energy.",
    "directions": "From Waterston visitor centre, keep going down on AB-5 W for 350 metres and turn right onto Range Rd 302A/Township Rd 13A. Drive up to the Lineham trail parking lot in about 9.2 km on your right.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/12337/reg_Ruby-Ridge-Loop-Waterton-Cameron-Lake-Away-May-14-2016-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12337/reg_Ruby-Ridge-Loop-Waterton-Easy-Scrambling-but-Tricky-with-Snow-May-14-2016-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12337/reg_Ruby-Ridge-Loop-Waterton-Nice-Ridge-Walk-May-14-2016-1--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12337/reg_Ruby-Ridge-Loop-Waterton-Scrambling-Down-the-Crest-May-14-2016-3--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12337/reg_Ruby-Ridge-Loop-Waterton-Summit-May-14-2016-1--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12337/reg_Ruby-Ridge-Loop-Waterton-Summit-May-14-2016-3--44639_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12337/reg_Ruby-Ridge-Loop-Waterton-West-Summit-May-14-2016-3--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12337/narrow_Ruby-Ridge-Loop-Waterton-Scrambling-Down-the-Crest-May-14-2016-1--44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/ruby-ridge-loop-near-waterton-park-gate-ab-12337",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "5 hrs",
        "Total Distance": "9 km",
        "Town": "Waterton Park Gate, AB",
        "Type": "out-and-back"
    },
    "title": "Ruby Ridge Loop",
    "trail_id": "12337"
}