{
    "description": "This is a very nice day hike.  There are only a few steep sections which only last for 25 minuets right from the start.  Most the trail was very over grown which made the single track trail more scenic.  There are several trails that can make this 8.2K hike into several shorter hikes.  After the initial accent the trails guide you along the ridge lines to several great view points.  There is a small off shoot trail that takes you to a beautiful look out.  However, the best view was found at the old communication tower On the southern tip.This hike would be great for the entire family.  I would suggest wearing long pants of some sort due to the dense Devils Club that lines the side of the trails.  The trail is very well marked and there are several maps along the way.",
    "directions": "From Vernon drive north for about 23 kilometers on Highway 97 to Armstrong.  On the outskirts, the far end, turn left on Rosedale Avn.  Drive down Rosedale for approximately  1.6 Kilometers where it intersects with Pleasant Valley rd.  Turn right on Pleasant Valley road and continue on it for around 1 kilometer till you reach Bridge St.  Turn left and almost immediately turn left onto Wood Avn.  Stay on Wood Avn. for about 1.5 Kilometers till the road makes a sharp right turn and turns into Salmon River rd.  Salmon River rd. soon makes a sharp 90 degree left followed by a sharp right.  About 1 Kilometer from the sharp right you will see Hallum Rd. on the left.  Take that left and drive for around 2 Kilometers to the intersection with Chamberlain road. It's roughly 1.75k from the turn off to the parking lot. Turn left on to Chamberlain.   Chamberlain turns into a dirt road very shortly after your turn.  The road will take a right corner and you will be faced with a big rolling hill in front of you.  Continue on the dirt road as it continues to go up and make a few corners.  The road will fork off so stay left.  The right direction house a house address on it.  After the fork you will shortly see a parking lot on your left, with two entrance ways and the road continues on to the right.  This is the parking lot you want.  The trail head is in the same lot.  There are two trails from this lot depending on which trail you want to start on.",
    "geohash": "c2g",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/12344/reg_20160325-104516-56664.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12344/reg_IMG-20160521-134905-55661.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12344/narrow_IMG-20160521-123456[1]-55661.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12344/narrow_IMG-20160521-125549-55661_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12344/narrow_IMG-20160521-125808-55661.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12344/narrow_IMG-20160521-130115-55661.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12344/narrow_IMG-20160521-130636-55661.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12344/narrow_IMG-20160521-134351-55661.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12344/narrow_IMG-20160521-134602-55661.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mounts-rose-and-swanson-near-armstrong-bc-12344",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "8 km",
        "Town": "Armstrong, BC",
        "Type": "out-and-back"
    },
    "title": "Mounts Rose and Swanson",
    "trail_id": "12344"
}