{
    "description": "Edwards Rating: II (II) M M4.5 to 7 hoursElevation of 1122 m NET, 1157 m TOT & max 2424 m (GR499630)Bug repellent is a MUST! 4x4 an essential on those fireguard/forestry roads to the trailhead. We actually stopped 3.2km before because of the road condition.Finding the road & trailhead might be the biggest challenge as it is for most backcountry roads like this one in BC.We did it on May 23 and there were just a few snow patches left, mostly dry.*****This is a very easy scramble technically but moderate overall with good elevation gain on just over 12 km depending on where you park. You would save 6.4 km walking on the forestry road by going up to the parking where the ATV trail begins. A high-clearance 4x4 is definitely a must to get up there though. That`s why we preferred to walk a little more from the 3km sign.We had no issues finding the forestry road but the condition was even worse than on the 5-mile road we took yesterday for McKirdy Ridge. We stopped after a few km at the 3km sign (GR470611) thinking it might get worse and not sure our Rogue would like it. We walked up to the trailhead and kept going on the ATV trail for an extra 1.2 km approximately and turned right on the hiking trail (GR490621). This is again well identified with orange and yellow flags. Thanks to Patricia, owner of the Caribou Grill restaurant downtown, flagging lots of trails around here locals we met on our way down told us. When we got closer to the false summit (GR496628), we rather cut straight up to it instead of going right and sidesloping below the ridge. We wanted to see if there was interesting scrambling up the ridge. Not really but we found some rock piles to climb on for fun. We stayed on the ridge and attained the true summit a few minutes later (GR499630). The views around are really awesome with the impressive Mount Robson to the northeast. Just for this it is worth the trip.",
    "directions": "From Valemount town gate on 5 Ave, turn right on Southern Yellowhead Highway and go north for 1.3 km. Turn right onto Loseth Rd and continue for another 1.6 km. Take the road on your right crossing the railway and go up Swift Mountain Rd for as long as your car can take it. We stopped at the 3km sign and hiked from there (GR470611).",
    "geohash": "c37h",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/12347/long_Swift-Mountain-Valemount-BC-Summit-View-Mt-Robson-May-23-2016-2--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12347/reg_Swift-Mountain-Valemount-BC-Scrambling-for-fun-on-the-Ridge-May-23-2016-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12347/reg_Swift-Mountain-Valemount-BC-Short-Ridge-Walk-May-23-2016-2--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12347/reg_Swift-Mountain-Valemount-BC-Summit-May-23-2016-9--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12347/reg_Swift-Mountain-Valemount-BC-Summit-View-Mt-Robson-May-23-2016-1--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12347/reg_Swift-Mountain-Valemount-BC-Summit-View-Mt-Robson-May-23-2016-4--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12347/reg_Swift-Mountain-Valemount-BC-Welcome-May-23-2016-2--44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/swift-mountain-near-valemount-bc-12347",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 4,
        "Time": "5 hrs",
        "Total Distance": "13 km",
        "Town": "Valemount, BC",
        "Type": "out-and-back"
    },
    "title": "Swift Mountain",
    "trail_id": "12347"
}