{
    "description": "Putting in at Crystal Geyser and taking out at Spanish Bottoms, we paddled 11 days, although it could be done in less.  Take your time and enjoy the sights and side hikes.  April is an ideal time since the water levels are low enough that you can take your time and temperatures are comfortable.  In May the river rises significantly, so you would move much faster and campsites might be more difficult to find.  The trip is more or less in four parts.  The first 2-3 days you are in cattle and farming country.  It is interesting, but the take-outs for camping tend to be very muddy.  The second section (3-4 days), Labyrinth Canyon, is spectacular!  You work your way down through the geologic ages  as you progress, so the canyon keeps changing in character.  There are many nice hikes and campsites along the way.The Third section (2 days), Tower Park, is very different and beautiful.  The canyon walls move back from the river and many vistas of near and distant monuments, buttes, and mountains keep the trip interesting.  Campsites are excellent along this section.The final section (2 days), Stillwater Canyon, is much narrower, with many goblin shaped rocks along the top of the canyon.  Campsites are more infrequent, but still available.  The last four miles is on the Colorado River.  Save some time for hiking at the end, as there are excellent hikes to the Doll House and the Needles in this section of Canyonlands National Park.The jet boat ride (54 miles) is quite scenic and interesting, however it is an open-air, exposed ride so bundle up!This is a must-do trip!",
    "directions": "We worked with Tex's Riverways to shuttle us from Moab to the put-in at Crystal Geyser and to pick us up in Spanish Bottoms to jet boat and bus us and our boats back to Moab.  This was well worth the expense.  Tex's will also help you with obtaining the required permits and renting you the required toilet to take along.",
    "geohash": "9wc",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/UT/12340/reg_2016G0079-NSSKA-Green-River-Trip-54074.jpg",
        "https://trailpeak.com/storage//content/trails/US/UT/12340/reg_2016G0140-NSSKA-Green-River-Trip-54074.jpg",
        "https://trailpeak.com/storage//content/trails/US/UT/12340/reg_2016G0192-NSSKA-Green-River-Trip-54074.jpg",
        "https://trailpeak.com/storage//content/trails/US/UT/12340/reg_2016G0207-NSSKA-Green-River-Trip-54074.jpg",
        "https://trailpeak.com/storage//content/trails/US/UT/12340/reg_2016G0217-NSSKA-Green-River-Trip-54074.jpg",
        "https://trailpeak.com/storage//content/trails/US/UT/12340/reg_2016G0226-NSSKA-Green-River-Trip-54074.jpg",
        "https://trailpeak.com/storage//content/trails/US/UT/12340/reg_2016G0267-NSSKA-Green-River-Trip-54074.jpg",
        "https://trailpeak.com/storage//content/trails/US/UT/12340/reg_2016G0272-NSSKA-Green-River-Trip-54074.jpg",
        "https://trailpeak.com/storage//content/trails/US/UT/12340/narrow_2016G0257-NSSKA-Green-River-Trip-54074.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/green-river-canyonlands-np-near-moab-ut-12340",
    "stats": {
        "Activities": "river-kayak river-canoe hike",
        "From": "",
        "Seasons": "spring fall",
        "Stars": 5,
        "Time": "56 hrs",
        "Total Distance": "195 km",
        "Town": "Moab, UT",
        "Type": "out-and-back"
    },
    "title": "Green River-Canyonlands NP",
    "trail_id": "12340"
}