{
    "description": "This is one of those falls that I discovered purely by chance.  I was out exploring in that region and saw the topo for this brook and it looked really good for a fall!Setting off on a logging road, there was nothing I could see that would lead to a fall.  However, the stream was close and it was an easy walk on the logging road.  after traversing alleged area, I ended up in a small sad looking ravine.  Totten lakes were upstream and there didn't seem to be such to see that way.  the brook was pretty small but it hadn't rained for a while.  I decided to follow it downstreamTo my utmost delight, there was a massive fall just 100m down but you can't see it form the logging road.  there are some good and solid cliffs on one side too for rock climbing.   The fall drops about 10ft at first and then drops another 50 ft to the bottom of the ravine.  I made my way down on the south side of the fall and it was pretty easy...but I do explore a lot!àI followed the brook a bit more but that was it for falls!",
    "directions": "E Folly Mtn Rd and then a logging road at N45.48842 W63.44647.  follow it up until you see a drivable road on your right.  At the end of this gravel road, there is a logging road going towards there lakes...take it to the stream and follow it downstream to the falls at approx;  N45.49622 W63.44929",
    "geohash": "f84fu",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/12349/narrow_DSC-0017-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12349/narrow_DSC-0023-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/totten-lake-brook-fall-near-truro-ns-12349",
    "stats": {
        "Activities": "hike climb",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "2 km",
        "Town": "Truro, NS",
        "Type": "out-and-back"
    },
    "title": "Totten Lake Brook Fall",
    "trail_id": "12349"
}