{
    "description": "Edwards Rating: I (II) M M4 to 6 hoursElevation of 742 m NET, 1016 m TOT & max 2223 m (GR543584)Bug repellent is a MUST! 4x4 recommended on those fire/logging roads to the trailhead.Finding the trailhead was the biggest challenge and our route is not always accurate since there was a lot of snow in the meadows but the trail should be obvious in dry conditions. *****We did this hike on a rainy day and it was so cloudy that we can?t really say if it?s worth the time to find that trailhead and driving up this backcountry road... We were hoping to complete the ascent of Mount McKirdy but we stopped when we reached its ridge cairn as we were freezing, not expecting all that snow on the ground and rain that switched into a snowfall past 1900 metres of elevation.From the tower where we parked, we walked up the road for a few metres and saw the trailhead sign. The trail is obvious and there?s also flags all the way up to the meadows. Once at the cabins sign, we kept going straight in the meadows and lost track of the trail with all that snow and because we followed someone's steps for a while to make it easier. We got back to the trail at some point where we started to gain more elevation. Using our satellite map, we circumvented that slope on the right and found back the trail that was dry in some places with a south aspect. We stayed at the same elevation sidesloping until we could see the beginning of McKirdy Ridge. We went down to the col and then up the ridge following its crest. Once at the ridge cairn, we had enough for the day and turned back down a few metres later on a solid snow patch for the best/fastest glissade of the year, that was awesome! Back to the col, we took the same route to the left and returned the same way. We will definitely comeback to complete the scramble up Mount McKirdy as it seems like the fun part was just starting.",
    "directions": "From Southern Yellowhead Highway & 5 Ave intersection to Valemount, go down this road for 1.5km and turn right onto Whiskey Fill Rd. Take the first road to the left about 150 metres later (Hillside Rd). At the first fork, go to the right and keep going up this fire road (called 5 mile Rd, not on Google) for a few kilometres until you get to a tower. That`s where we parked (GR503576) and walked a few metres up the road to the trailhead (GR504576).",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/12346/long_McKirdy-Ridge-Valemount-BC-Ridge-May-22-2016-1--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12346/reg_McKirdy-Ridge-Valemount-BC-Finally-stopped-snowing-May-22-2016-1--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12346/reg_McKirdy-Ridge-Valemount-BC-Kinbasket-Lake-May-22-2016-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12346/reg_McKirdy-Ridge-Valemount-BC-May-22-2016-5--44639_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12346/reg_McKirdy-Ridge-Valemount-BC-Wild-Grouse-showing-us-the-way-May-22-2016-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12346/narrow_McKirdy-Ridge-Valemount-BC-Best-descent-ever-May-22-2016-1--44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mckirdy-ridge-near-valemount-bc-12346",
    "stats": {
        "Activities": "snowshoe hike ski-bc",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "5 hrs",
        "Total Distance": "11 km",
        "Town": "Valemount, BC",
        "Type": "out-and-back"
    },
    "title": "McKirdy Ridge",
    "trail_id": "12346"
}