{
    "description": "Edwards Rating: II (III, maybe IV with snow) M S4 to 7 hoursElevation of 875 m NET, 905 m TOT & max 2884 mWe made it in May with snow patches and steep snow gullies or cornices to walk through. Some difficult steps in these conditions and mostly moderate technically when sticking to the ridge the whole traverse.*****What a beautiful and fun scramble, one of the nicest we have ever done! The views are absolutely spectacular and almost from the beginning! Staying on the ridge rather than avoiding it on its right makes it a more challenging but much nicer moderate scramble technically. The snow patches, gullies and cornices added a few difficult/exposed steps but it would still be moderate only in dry conditions.Starting from Columbia Icefield Campground parking lot, we walked straight up for a minute and turned right (GR860855) at the sign for campgrounds across the creek and Wilcox Pass trailhead. Once past the bridge, we followed the creek and waterfall on that obvious trail to the valley. Because of the snow, we did not try to stay on the official trail to Mount Wilcox and turned left to start hiking up its ridge as early as possible avoiding the snow. Once up on the ridge, we stuck on it for great hands-on scrambling and because several snow patches and snow gullies were in the way on what seemed to be the most popular trail a few metres down on the right. Route finding was easy and our goal was to stay as close as possible to the cliff where we had dry conditions with some exposure. The last few steps before reaching the summit was the crux for us as we had to go down a snow gully along the ridge with steep snow. We hung out to the ridge with one hand and tested out footing with our pole on the other hand at each of the 3-4 steps down this steep snow. Once on this little col we just had to hike up the last short slope leading to the summit (GR835882). Again the views were absolutely incredible and this is definitely worth a visit. Back down approximately the same way but we slid down a nice snow patch for a quick descent in the valley.",
    "directions": "From the Trans-Canada Highway 1 and 93 North junction, start your odometer and drive for 124 km. Turn right to the Columbia Icefield Campground and park there. It is located 1.8 km before Columbia Icefield Discovery Centre parking lot.",
    "geohash": "c3k9",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/12345/long_Mount-Wilcox-Icefields-Parkway-Jasper-This-Valley-is-Stunning-May-21-2016-5--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12345/reg_Mount-Wilcox-Icefields-Parkway-Jasper-Awesome-Ridge-Walk-Mod-Scramble-May-21-2016-15--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12345/reg_Mount-Wilcox-Icefields-Parkway-Jasper-Our-Route-May-21-2016-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12345/reg_Mount-Wilcox-Icefields-Parkway-Jasper-Summit-May-21-2016-3--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12345/reg_Mount-Wilcox-Icefields-Parkway-Jasper-Summit-May-21-2016-5--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12345/narrow_Mount-Wilcox-Icefields-Parkway-Jasper-Awesome-Ridge-Walk-Mod-Scramble-May-21-2016-11--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12345/narrow_Mount-Wilcox-Icefields-Parkway-Jasper-Awesome-Ridge-Walk-Mod-Scramble-May-21-2016-12--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12345/narrow_Mount-Wilcox-Icefields-Parkway-Jasper-Awesome-Ridge-Walk-Mod-Scramble-May-21-2016-18--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12345/narrow_Mount-Wilcox-Icefields-Parkway-Jasper-Awesome-Ridge-Walk-Mod-Scramble-May-21-2016-3--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12345/narrow_Mount-Wilcox-Icefields-Parkway-Jasper-Awesome-Ridge-Walk-Mod-Scramble-May-21-2016-8--44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/wilcox-peak-mount-wilcox-near-jasper-ab-12345",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 5,
        "Time": "5 hrs",
        "Total Distance": "10 km",
        "Town": "Jasper, AB",
        "Type": "out-and-back"
    },
    "title": "Wilcox Peak (Mount Wilcox)",
    "trail_id": "12345"
}