{
    "description": "This is a neat little hike to a small canyon on the Dead Horse Brook near Five Islands.  Setting off from your car, follow the ATV trail through the blueberry field which affords views all the way to the Bay of Fundy.  Pretty soon, you enter this beautiful mature hardwood forest.  If you continue on the ATV path, you will cross the stream...Of course I was in a hurry trying to pack i as many falls as possible so I went into the woods on a tangent to the brook.Big mistake towards the end as I got into a clear cut area.  However I soon spotted the stream and photographed a couple of nice cascade type falls of about 5-10ft.  I decided to follow the brook instead of turning back.....Best Decision ever!!!!!!  After 5 minutes I was at the top of a nice small gorge or canyon.  I accessed it from the bottom.  It's about 4-5ft wide and there are a few falls in it of about 5-8ft.as I was photographing it....I nearly got a heart attack.  It turns out that a fellow explorer happened to be there at the same time!  Weird for a spot that is so remote!  To get back to my car, I followed the East river for a while.  there were a few more falls to see but nothing very big.",
    "directions": "Five Islands.  Take New Britain Rd and turn right at N45° 27' 12.1\" W64° 02' 01.9\" and go past the old pub!   and park at the blueberry field at N45° 27' 29.0\" W64° 00' 31.7\".  the canyon is at N45° 27' 51.9\" W63° 59' 51.4\"",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/12355/reg_DSC-0137-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12355/narrow_DSC-0148-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/dead-horse-brook-mini-canyon-near-parrsboro-ns-12355",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "3 km",
        "Town": "Parrsboro, NS",
        "Type": "out-and-back"
    },
    "title": "Dead Horse Brook Mini Canyon",
    "trail_id": "12355"
}