{
    "description": "This is a beautiful hike that is easily accessible from Port Alberni. Not to be confused with the OTHER angler's trail across the river in Stamp River Provincial Park, this trail seems to be a collaboration between Greenmax and others. The first part of the hike is through the Greenmax woodlot, then it goes down to the river bank and continues through the forest. It is a beautiful hike. There are two parts of the trail that provide access to the beach/river for swimming or fishing. The trail goes back up to the top of the bluff at the end. From here you can probably keep going, but I'm not sure where it connects. There is a brochure for the trail available from the ACRD website.Starting from the woodlot, hike up the road until it splits. Go right until you reach the top of the bluff. The trail starts here on your left. It travels along the wood lot before twisting its way down to the river.",
    "directions": "From the T-Junction by the river at the western edge of Port Alberni, head west on highway 4. At 12 km turn right onto Coleman Road. Continue past airport road, down a hill and across a creek. There is a pull-out, gate and large sign at the trailhead.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/12365/reg_12377559-10156926259585727-5197999722646723238-o-47757.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12365/reg_12440743-10156926262715727-6857885793584774440-o-47757.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12365/reg_12909464-10156926268805727-192586940946720155-o-47757.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12365/reg_1477362-10156915618115727-3285514398798619282-n-47757_best1_.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/greenmax-anglers-trail-near-port-alberni-bc-12365",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "6 km",
        "Town": "Port Alberni, BC",
        "Type": "out-and-back"
    },
    "title": "GREENMAX Angler's Trail",
    "trail_id": "12365"
}