{
    "description": "Brew hut is located on top of the world (or so it seems) on a ridge beside the final ascent to the peak of Mount Brew, a bit more than a km farther than the lake. It was built and is managed by the UBC Varsity Outdoors Club (http://www.ubc-voc.com). You can book in online or risk showing up to a crowd. It is $10/night. There is a wood stove and firewood (which they pay to fly in - so only use it if you actually need it). There is a loft for sleeping, and the hut is very well insulated so it warms up quickly just with a few bodies in it. There is an outhouse beside the hut.Summer access to Roe creek trail is across a cutblock almost at the end of logging road R233. It is 5 km up to the hut. You gain a thousand feet of elevation. The trail starts in the forest, then you get above treeline and travel past the lake and then up and around to the top of the ridge. It is well marked with orange diamonds and flagging tape. You can hike/snowshoe/ski(skin) this route, although the first part has some slippery bits climbing over large rocks which doesn't really work with anything but boots on your feet. The difficulty, and length of the hike is going to depend entirely on the conditions, so I can't give this a proper rating. It took me five hours to snowshoe to the hut, because there was three feet of fresh snow and it was snowing the whole time and I'm slow at gaining elevation! With no snow, some people pop up to the lake or hut in an hour or two. 36 hours later and ten degrees warmer, half the snow had melted and it only took me 90 minutes on the way down. (I include picture taking and snacking in my time). Come prepared for anything - snow and whiteout conditions, blazing sun and bugs and everything in between.",
    "directions": "South of Brandywine Provincial Park, turn off the Sea-to-Sky highway onto Chance Creek Road (Brew Creek Road on Google Maps). Stay on this road for 3-4 km, then turn right onto Roe Creek Road (R200). Zero your odometer here! (You will need a 4x4 or at least decent ground clearance on your vehicle to get all the way to the trail-head. The logging road(s) are nice and wide, so there is plenty of places to pull off and carry-on by foot if you don't want to drive any farther.) May 28, 2016 there we crossed three washouts on our way up.At 0.6 km stay right.At 0.9 km stay rightAt 1.1 km stay leftAt 1.3 km stay rightAt 1.5 km - Winter and 2WD parkingAt 1.6 km stay leftAt 1.9 km - Summer and 4WD parkingAfter parking, head back down the logging road ~100m to where you should see a trail through the cut-block to the trail-head. It is marked with orange diamonds.",
    "geohash": "c2bk",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/12367/reg_12871454-10157178090465727-3032229068669159753-n-47757.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12367/reg_13305148-10157186116075727-5935469583446664211-o-47757.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12367/reg_13308691-10157189365310727-634220649304661259-o-47757_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12367/reg_13320489-10157189372025727-1084632139280684268-o-47757.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12367/reg_13320638-10157186116595727-6615603184487286428-o-47757.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12367/reg_13346806-10157186092470727-7499165280396249783-n-47757.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12367/narrow_13323461-10157189372515727-435393053456921759-o-47757.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/brew-hut-summer-trail-near-squamish-bc-12367",
    "stats": {
        "Activities": "snowshoe hike ski-downhill",
        "From": "",
        "Seasons": "summer",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "5 km",
        "Town": "Squamish, BC",
        "Type": "out-and-back"
    },
    "title": "Brew Hut Summer Trail",
    "trail_id": "12367"
}