{
    "description": "A combination of walk along the shore of the Strait of Juan de Fuca, with the Olympic Mountains across the strait, and in the hills on the walk back to Aylard Farm park.7.5 kms from Aylard Farm park to Cabin Point, via the Petroglyphs and Beechy Point, with some areas right along the water, some higher up, always with views of the strait and the Olympic Mtns. From the parking area, you can head either straight to the water, or s/w through the field. The 2 trails join and you continue along the water, by the petroglyphs and on to Beechy Point for a fabulous view of the strait and the mountains.Continue on to Cabin Point, 7.5 kms, for lunch, and then continue west approx. 400 m to the right hand turnoff to the Interior Trail. This is approx. 1 km and 100 or so m up. At the top, turn right on the Interior trail, go by and up to Babbington Hill, and then east back to Aylard Farm. Total trip is approx. 12.5 kms and total ascent is 675 m.  The hike along the waterfront is often rocky, with some short steep ups and downs, and a bit slow, but who cares. The hike through the forest is beautiful, the trial surface much smoother.Don't forget the ice cream treat at the grocerystore, Gillespie Rd and East Sooke Rd on the way back.",
    "directions": "East Sooke Regional Park is located on the East Sooke Peninsula, 35 kilometres west of Victoria.To reach the park, take Highway 1 to Exit 14 to Highway 14. Follow Hway 14 to Gillespie Road, turn left and continue down to East Sooke Road. Turn left on East Sooke Road, right on Beacher Bay Road and this leads to the park entrance at Aylard Farm.Approx. 45 minutes from downtown Victoria.",
    "geohash": "c284",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/12378/reg_East-Sooke-trail-2476-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12378/reg_East-Sooke-trail-2478-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12378/reg_East-Sooke-trail-2479-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12378/reg_East-Sooke-trail-2483-7359_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12378/narrow_East-Sooke-trail-2477-7359.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/east-sooke-cabin-point-loop-near-sooke-bc-12378",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "5 hrs",
        "Total Distance": "13 km",
        "Town": "Sooke, BC",
        "Type": "out-and-back"
    },
    "title": "East Sooke, Cabin Point Loop",
    "trail_id": "12378"
}