{
    "description": "Edwards Rating: III (III) L L8 to 12 hoursElevation of 1352 m NET, 1476 m TOT & max 2956 mCompleted early June and conditions were fine.*****This is a moderate scramble technically as some route finding and bushwhacking are involved between animal and hiking trails with no obvious trail from the beginning of the ridge to the true summit. It is physically challenging and that is why I rated it as difficult overall. It?s a fun scramble because there are many opportunities to do some great hands-on scrambling by staying on the ridge almost all the way to the top. From the parking lot, we took the road down to the campground for about 600 metres to get to the suspension bridge. From there, you have a very nice view of Mount Glasgow to your right. Just passed the bridge, we took the first trail to the right and started following the river for about 1.8km doing some unnecessary bushwhacking. The best way to go is to use good ATV/hiking/animal trails closer to the river until you get to a great trail to the left (GR494282) and up the valley to Mount Glasgow outlier. We passed a drainage and then continued to walk to the end of a small meadow. We then turned right (GR496266) and started bushwhacking up the outlier. We went too far left at some point and had to come back to the right to reach out the rocky ridge below the false summit. We scrambled up rock bands and walked up to the false summit (GR483252). From there we could see all of the ridge walk and the true summit further right. There are 3 peaks along the ridge and the 3rd one just before the summit turns out to be exposed climbing so we had to lose a few metres of elevation and circumvent it to the left. Other than that, we stayed on the ridge all the time. On the last section below the summit, we followed the ridge as long as we could and then started going along slabs and gain some more elevation when we could find weaknesses in the rock bands. There?s a lot of scree and unstable rocks at that point so it can be a little tricky and route finding skills are tested a little bit but there?s always a way up so it wasn?t so bad. Once we reached back the ridge it was just a walk to the summit. Back down, we lost more elevation right away and tried sidesloping to the right reaching the col just below the false summit. It was not a good idea and we should have taken the same route for a quicker descent to that col (GR478249). From the col, we went down to the left a frustrating rubble slope but two snow patches to slide down and save some time and energy. From the boulder field down the slope, we reached the creek bed using some good faint trails and hiked down the creek all the way back to the small meadow. We took back the same trail leading to Elbow River later on and then used different trails trying to stay along the river this time and avoid bushwhacking.",
    "directions": "From Calgary, follow Trans-Canada Highway/AB-1 W, take exit 161A for AB-22 S toward Bragg Creek/Redwood Meadows and go south for about 22 km. Turn right on AB-66 W and drive another 27 km to Powderface Trail junction. Turn left and drive another 1.2 km to the Elbow River parking lot entrance to your left.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/12372/long_Mount-Glasgow-Kananaskis-Our-Route-June-4-2016-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12372/long_Mount-Glasgow-Kananaskis-Summit-June-4-2016-15--44639_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12372/reg_Mount-Glasgow-Kananaskis-Beautiful-Rock-Formation-June-4-2016-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12372/reg_Mount-Glasgow-Kananaskis-Cool-Ridge-Walk-June-4-2016-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12372/reg_Mount-Glasgow-Kananaskis-False-Summit-and-Descent-Route.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12372/reg_Mount-Glasgow-Kananaskis-Nice-but-Unecessary-Scrambling-June-4-2016-1--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12372/reg_Mount-Glasgow-Kananaskis-Scramble-to-Summit-June-4-2016-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12372/reg_Mount-Glasgow-Kananaskis-Summit-View-Banded-Peak-Outlaw-Cornwall-June-4-2016-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12372/reg_Mount-Glasgow-Kananaskis-Welcome-Our-Route-from-the-Bridge-June-4-2016-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12372/narrow_Mount-Glasgow-Kananaskis-Our-Descent-Route-Nice-but-Short-Snow-Glissade-June-4-2016-2--44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mount-glasgow-near-kananaskis-ab-12372",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 3,
        "Time": "10 hrs",
        "Total Distance": "20 km",
        "Town": "Kananaskis, AB",
        "Type": "out-and-back"
    },
    "title": "Mount Glasgow",
    "trail_id": "12372"
}