{
    "description": "This hike is not for the faint hearted....to explore this ravine required a good sense of direction and stamina.  However, you will be rewarded by the sight of a pristine valley filled with waterfalls !From the end of the road I entered the woods and followed a path and discovered that this s[pot was used as a baiting station a while ago.  People have left some plastic gear in the woods and the remains of a blind is easy to spot.   I cut across the Acadian forest and found a small brook to follow into the ravine below.  the brook has lots of cascade type falls but the geology of this particular ravine makes atall fall impossible.  Once I hit the East Branch of Macrae brook, the falls started to appear.  There are lots and lots of small ones until you hit the largest on this branch.  the tallest fall would be about 40ft plus a couple of other drops above make it a total drop of 70ft plus over a very short distance.I walked further downstream and then met up with the west branch of Macrae brook.  again, there were many small 6-10ft fall that I saw but I knew there were taller fall(s) ahead!   The forest down there is a treasure....the trees are so large and the canopy is high above your head.  Tall ferns unfortunately;t hide everything and you will bash your shins numerous times on hidden objects!After about 450m up, I saw a rock wall on one side of the stream and immediately after, there was a mini Shangri-La of waterfalls.  there were two falls coming down the side walls of the ravine as well as two large falls in the main branch of the brook.  the pool at the base of those falls are very deep and beg for people to swim in!  There might be more falls on the main branch of the brook as it goes on for a while in this ravine but I was pressed for time.I followed one of the brook coming off the side wall of the ravine and the slope was very steep but that  brook is an ever ending source of waterfalls....There were so many, I stopped taking photos!   The brook loses at least 500ft and its one waterfall after another on the whole drop (falls are from 5-25ft).",
    "directions": "Crowdis Mountain Road.  Turn on secondary road at N46° 11' 40.7\" W60° 50' 26.7\" and park at; N46° 11' 07.6\" W60° 48' 53.7\"",
    "geohash": "f8h",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/12382/reg_DSC-0115-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12382/narrow_DSC-0119-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12382/narrow_DSC-0127-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12382/narrow_DSC-0128-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/macrae-brook-falls-near-baddeck-ns-12382",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 5,
        "Time": "3 hrs",
        "Total Distance": "5 km",
        "Town": "Baddeck, NS",
        "Type": "out-and-back"
    },
    "title": "Macrae Brook Falls",
    "trail_id": "12382"
}