{
    "description": "Edwards Rating: II (II) M M - To True Summit onlyEdwards Rating: III (V) M M - Including East Summit by the ridge as much as possible without a rope6.5 to 9 hoursElevation of 913 m NET, 1069 m TOT & max 2648 m True Summit, 2622 m East SummitEarly season scramble up to the true summit possible but dry conditions required for the loop. We did in mid-June and it was clear of snow.*****This is an easy scramble with easy route finding to Mount Bryant and challenging-exposed scrambling with a few moves of down climbing completing the east ridge on the descent. The loop makes it a beautiful and complete scramble after an easy ascent to the true summit.Starting at GR459419 on Powderface Trail, we crossed the road and reached Canyon Creek immediately to turn left and go down for about 15 minutes looking for a fork to the right at GR446413 just before Mount Bryant. We followed that drainage all the way to the end staying left when there were forks to go behind Mount Bryant and as it started to take some elevation we cut into the forest going up a steep but short slope on the left. We did some unnecessary and dense bushwhacking to finally get onto a good trail 10 minutes later. The best way to go should have been to go left a couple of hundred meters before where there was supposed to be obvious cairns that we missed. Once out the forest, we went down to the beautiful tarn for a little break and then took a sharp left up that scree and rubble slope under the true summit. From the true summit at GR412407, we started hiking down the ridge going east and reached a first peak minutes later where the fun began. We scrambled down an exposed section of the ridge and climbed down on its right soon after (crux at GR416406). We went back on the ridge immediately but it was a mistake and we turned back to the crux and lost some elevation to circumvent that section of the ridge. We stayed as high as possible sidesloping and traversing two small bowls to finally get under what we didn?t know yet was the summit block. We gave it a shot and scrambled up to a wide ledge under this block (GR417405) with several pinnacles and turned right to the end of the wall. We then completed this ascent with easy hands-on scrambling going left and to the East Summit. From there, we kept going down the ridge and stayed on it all the time for 4-5 easy to moderate down climbs with one more exposed but you can avoid this each time on the right. We reached that brown scree slope and started going down towards the end of it and before an obvious immense and colourful cliff. Back to the forest, we walked under the cliff and cut down grey scree into a small drainage bringing us back to Canyon Creek. We turned left to get back to the parking area. Doing the loop is completely worth it but Bryant Summit only got nothing exceptional in itself.",
    "directions": "From Calgary, follow Trans-Canada Highway/AB-1 W, take exit 161A for AB-22 S toward Bragg Creek/Redwood Meadows and go south for about 22 km. Turn right on AB-66 W and drive another 27 km to Powderface Trail junction and continue on that road for about 14.3 km to park on the right side of the road at GR459419.",
    "geohash": "c3n",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/12389/long_Bryant-East-Summit-Loop-Kananaskis-Awesome-Scrambling-Jun-18-2016-3--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12389/long_Mount-Bryant-Loop-Kananaskis-Summit-View-Seven-Peaks-Jun-18-2016-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12389/long_Mount-Bryant-to-Bryant-East-Summit-Loop-Kananaskis-Our-Route-Jun-18-2016-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12389/reg_Bryant-East-Summit-Loop-Kananaskis-Crux-Jun-18-2016-4--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12389/reg_Bryant-East-Summit-Loop-Kananaskis-Our-Route-to-East-Summit-Jun-18-2016-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12389/reg_Mount-Bryant-to-Bryant-East-Summit-Loop-Kananaskis-Descent-Route-Jun-18-2016-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12389/reg_Mount-Bryant-to-Bryant-East-Summit-Loop-Kananaskis-Jun-18-2016-15--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12389/reg_Mount-Bryant-to-Bryant-East-Summit-Loop-Kananaskis-Jun-18-2016-9--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12389/reg_Mount-Bryant-to-Bryant-East-Summit-Loop-Kananaskis-To-the-Tarn-Jun-18-2016-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12389/reg_Mount-Bryant-to-Bryant-East-Summit-Loop-Kananaskis-Welcome-Jun-18-2016-44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mount-bryant-to-east-summit-loop-near-kananaskis-ab-12389",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 5,
        "Time": "8 hrs",
        "Total Distance": "16 km",
        "Town": "Kananaskis, AB",
        "Type": "out-and-back"
    },
    "title": "Mount Bryant to East Summit Loop",
    "trail_id": "12389"
}