{
    "description": "This is a nice and easy hike to a spectacular fall near Cheticamp, NS.   I had wanted to check this place out for a while but somehow always managed to find something else to explore instead.  In a June rain storm, I decided to finally to explore this brook.I set off on a wide and well maintained ATV/snowmobile trail.  It lost some elevation and then remained pretty much on the same contour line as it followed the brook into a valley.  there were a couple of side trails to the right and left but I kept continuing straight.  The forest down there is quite nice with lots of large deciduous trees.   At the end of the road lies a very nice shelter by the side of the river....Now the exploring of sorts begins.  There is no trail from this point on but you can spot some faint signs that people have traveled here before.  I stayed on the same side of the stream the whole way.soon you will see some small falls, large boulders and moss covering everything!   And after only about 300m from the shelter, a spectacular fall of total height of 80ft plus appears.   It's impossible to get one picture of the whole fall as it has numerous drops in a row.  I climbed the side ravine slope to get a better view of the top portions of the fall.  BTW there is another fall about 2km upstream from this point but I didn't have the time on that day to visit it.",
    "directions": "At 14115 Cabot Trail, there is a sign for a church (N46° 34' 47.9\" W61° 01' 21.9\").  turn on the dirt road and drive up the hill.  Park at the back of the building and start on the ATV trail.",
    "geohash": "f8k8g",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/12381/reg_DSC-0108-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12381/narrow_DSC-0104-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/farm-brook-fall-near-cheticamp-ns-12381",
    "stats": {
        "Activities": "snowshoe hike mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 5,
        "Time": "2 hrs",
        "Total Distance": "5 km",
        "Town": "Cheticamp, NS",
        "Type": "out-and-back"
    },
    "title": "Farm Brook Fall",
    "trail_id": "12381"
}