{
    "description": "Edwards Rating: III (IV) S S4.5 to 7 hoursElevation of 896 m NET, 921 m TOT & max 2286 mEarly-late season scramble*****In my opinion this might be the most beautiful mountain seen from Kananaskis Trail South. I wanted to do it for a long time but didn?t because I didn?t like the fact we had to cross the river. We brought our water shoes but it was so cold and current was surprisingly strong. Don?t go for the shortest distance and rather make sure it is not too deep where you cross it because this can be tricky when you have water up to the thighs. Other than that, this is straightforward with easy bushwhacking, steep but direct ascent and awesome hands-on scrambling before the summit.From the road at GR334486, we walked down the drainage to the river and crossed it. We hiked up the steep embankment wherever it looked easier and crossed the field to bushwhack in the beautiful birch forest between Mt Lorette and Mary Barclay?s. We kept an eye on our mountain to the right to make sure we would arrive at the beginning of its south ridge. From there, this is straight up and as always the best option is to stay as close as possible on the ridge line. We went too far left at some point and missed good hands-on scrambling probably. Close to the summit it gets very interesting. Awesome and long slabs to scramble up or avoid on the right with mildly exposed ridge and great hands-on up to the crux. You can?t miss it as the ridge is narrower and you got to climb a few metres with impressive exposure to your left. It was pretty good as holds are awesome on this ridge but a fall here and you are dead. So I don?t see it as a moderate scramble like most people say but rather a moderate to difficult because of that exposure on more technical sections. Once at the summit (GR330514), we looked at our options to go down the ridge on the other side and complete it as a loop. We kept walking on the ridge and descended good scree on its right for a few minutes. At GR329515, we turned left to reach that brown scree and kept walking down that ridge for a while. When it started to take some elevation, we turned left and started our descent on decent scree patches going right to find the fastest way to go but stay in line with the drainage below. We got to the forest (GR321514) and followed a small drainage eventually bringing us to the main one (GR321512). We went down that drainage and it was easy most times but there were a few big piles of dead trees to go through. Not a big deal but annoying. When we lost most of our elevation and saw that birch forest we got out the drainage (GR329494) to the left and bushwhacked back to our ascent route. We chose a better spot this time to cross the river and it was longer-colder but easier and most importantly safer.",
    "directions": "From Calgary, follow Trans-Canada Hwy/AB-1 W to Kananaskis Trail/AB-40 S. Take exit 118 and start your odometer for about 17.7 km drive and park just after Wasootch Creek on the right side of the road (GR334486).",
    "geohash": "c3n",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/12390/reg_Mary-Barclay-s-Mountain-Kananaskis-Down-the-Drainage-Golf-Jun-19-2016-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12390/reg_Mary-Barclay-s-Mountain-Kananaskis-Easy-Bushwhacking-Nice-Forest-Jun-19-2016-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12390/reg_Mary-Barclay-s-Mountain-Kananaskis-Incredible-Scramble-Here-Jun-19-2016-5--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12390/reg_Mary-Barclay-s-Mountain-Kananaskis-Jun-19-2016-23--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12390/reg_Mary-Barclay-s-Mountain-Kananaskis-So-cold-and-Strong-Current-View-of-Mary-Barclay-s-Jun-19-2016-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12390/reg_Mary-Barclay-s-Mountain-Kananaskis-Welcome-our-route-Jun-19-2016-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12390/narrow_Mary-Barclay-s-Mountain-Kananaskis-Incredible-Scramble-Here-Jun-19-2016-1--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12390/narrow_Mary-Barclay-s-Mountain-Kananaskis-Incredible-Scramble-Here-Jun-19-2016-4--44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mary-barclays-mountain-near-kananaskis-ab-12390",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 5,
        "Time": "5 hrs",
        "Total Distance": "9 km",
        "Town": "Kananaskis, AB",
        "Type": "out-and-back"
    },
    "title": "Mary Barclay?s Mountain",
    "trail_id": "12390"
}