{
    "description": "Edwards Rating: III (IV or V maybe when climbing some sections of the ridge) L L11 to 14 hoursElevation of 903 m NET, 1653 m TOT & max 2631m// Summit 1 - 2310 m at GR435427// Summit 2 - 2333 m at GR430436// Summit 3 ? 2502 m at GR411445// Summit 4 ? 2570 m at GR408436// Summit 5 (Bryant NW2) ? 2612 m at GR395417// Summit 6 ? 2631 m at GR394404// Summit 7? 2610 m at GR401402Completed at the end of June in dry conditions.*****This requires very few bushwhacking, route finding on col 2-3 only and awesome climbing on solid walls and rock bands on col 2-3 and 4-5 as well as on summit block 6. Most difficulties might be avoidable but would require to lose a lot of elevation and we were not willing to do that. Scrambling was too good to avoid the ridge for about 99% of the traverse. I rated it as extreme because it?s a long and exhausting day with good technical challenges.From the parking area, we crossed the road and turned left into Canyon Creek seeing our first peak not so far away on the right. When we got closer we turned right in another drainage and started to gain elevation on the treed slope just after an obvious cliff (GR440413). We bushwhacked up and over that cliff until we reached the ridge and walked to our first summit. From summit 1 it is an obvious hike to summit 2. Down from 2 was more challenging when we reached the nice rock formations and had to lose a few metres of elevation to the right at GR422442. Going down a tricky and steep slope of scree covered slabs/rock bands we found a way to go left as soon as possible and stay closer to the ridge to get back on it at GR421442. We stayed on the ridge for some moderate scramble on more exposed slabs just before summit 3. At one point, we had to down climb 3-4 metres on the right at GR414445 to complete our summit 3 ascent on scree. Col 3-4 is quick and easy with nice hands-on scrambling if using the rock band close to the summit 4 but it might be avoidable on the left. Col 4-5 is a wonderful scramble with lots of rock bands and cliffs to climb. Only one cliff was too high and we didn?t feel comfortable completing it from the ridge so we went down to a weakness requiring 3 moves of climbing up to a slab and around the cliff band to get back to the ridge (GR400429, see picture). Col 5-6 was easy and when we got closer to the impressive summit block we realized we could climb straight up to the summit for some nice climbing or moderate/difficult hands-on scrambling. Another option is to go left until you find weaknesses you are more comfortable with in the rock bands facing col 6-7 such has been our descent route to reach our last summit of the day. The ascent to summit 7 is easy and quick. Our mistake today was to take Nugara`s route back down the SW scree slope leading to a small drainage (GR396398) in the opposite direction of the parking area. It was long and even though the waterfalls were nice, it took forever to get back to Canyon Creek (GR411384) and then on the left to the car. We had to sideslope on the left about 5 times when the waterfalls were too steep. You can`t get lost once in that drainage though as it brings you back to the main one directly. The other descent route suggested by Nugara might be the best one: Going back to col 5-6 and down good scree to the beautiful tarn and then find a good trail leading you back to a closer drainage that would probably bring you back to Canyon Creek and your car way faster. This was an awesome traverse overall!",
    "directions": "From Calgary, follow Trans-Canada Highway/AB-1 W, take exit 161A for AB-22 S toward Bragg Creek/Redwood Meadows and go south for about 22 km. Turn right on AB-66 W and drive another 27 km to Powderface Trail junction and continue on that road for about 14.3 km to park on the right side of the road at GR459419.",
    "geohash": "c3n",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/12403/long_Seven-Peaks-Traverse-Kananaskis-Col-4-5-Jun-25-2016-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12403/long_Seven-Peaks-Traverse-Kananaskis-From-Col-1-2-View-Peak-2-7-Route-Jun-25-2016-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12403/long_Seven-Peaks-Traverse-Kananaskis-Fun-Scrambling-Col-4-5-Jun-25-2016-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12403/long_Seven-Peaks-Traverse-Kananaskis-Route-Summit-Block-Peak-6-Jun-25-2016-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12403/reg_Seven-Peaks-Traverse-Kananaskis-Beautiful-Slab-Under-Summit-3-Jun-25-2016-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12403/reg_Seven-Peaks-Traverse-Kananaskis-Col-4-5-Route-on-Lower-Elevation-Jun-25-2016-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12403/reg_Seven-Peaks-Traverse-Kananaskis-Looking-for-Safe-Climbing-Col-4-5-Jun-25-2016-2--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12403/reg_Seven-Peaks-Traverse-Kananaskis-Route-to-Peak-1-Jun-25-2016-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12403/reg_Seven-Peaks-Traverse-Kananaskis-Summit-6-Jun-25-2016-5--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12403/narrow_Seven-Peaks-Traverse-Kananaskis-Summit-7-View-Bryant-Lake-Jun-25-2016-44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/seven-peaks-traverse-near-kananaskis-ab-12403",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 4,
        "Time": "12 hrs",
        "Total Distance": "24 km",
        "Town": "Kananaskis, AB",
        "Type": "out-and-back"
    },
    "title": "Seven Peaks Traverse",
    "trail_id": "12403"
}