{
    "description": "You would think by the hordes of people hiking up to  Sentinel Pass from Moraine Lake, in Banff National Park, that this hike did not exist.  Nonetheless this is a beautiful hike and it provides a completely different perspective of the Valley of the Ten Peaks.As I said the trailhead is the same one as the trail to Sentinel Pass.  After the 40 or so minute climb to the fork in the trail you take the far less traveled left fork (most people will go right to Sentinel).  After just 20 minutes in the woods you will emerge into the open on the side of the hills opposite the Valley of the Ten Peaks.  The views persist from here until the pass and back again without a break.The biggest difference between this hike and Sentinel Pass is that the view of the Ten Peaks includes the bottom of the valley to the tops of the peaks.  If you have never seen this valley before prepare yourself for a most dramatic and impressive site, towering Rocky Mountains with glaciers from one end of the hike to the other.  If you are a picture taker point anywhere and shoot.From the fork in the trail it is an easy hike to Eiffel Lake with very little elevation gain or loss. The round trip from the Moraine Lake to Eiffel Lake takes about 3 hours.  Typical of a lot of Alpine Glacier Lakes the lake itself is quite small and not much to ooh and awe about.If you continue on to Wenkchemna Pass you have to add a couple of hours to the round trip. You continue past the lake toward the obvious pass to the left on the clearly visible trail.  The trail remains fairly flat until you reach the climb to the pass.  From here to the pass is about 30 minutes.  The trail can be a little hard to see a couple of hundred meters short of the pass but it makes very little difference as you can see your destination and take one of the alternate routes many other people have blazed before you.The best view from the Pass is back the way you came with a view of the entire valley and all the Peaks.  The view from the other direction cannot compare to this magnificent valley.NTS Map: 082N08Elevation Gain to Eiffel Lake: 370 m (1,214 ft),Elevation Gain from Eiffel Lake to Wenkchemna Pass: 720 m (2,362 ft).EDITOR'S NOTE - Trailpeak does not edit out contributor's opinions on park rules. We also do not advocate breaking of park rules. The group size restrictions in the Moraine Lake area are put in place for safety reasons. It's generally accepted that no group of 6 or more has ever been attacked by a grizzly. Groups tend to make more noise than couples, that's just a fact. If, God forbid, something should happen, a larger group affords more rescue options. The majority of attacks recently have been on bikers and runners who tend to travel quietly and fast. The group size restriction is an actual bylaw, you can be fined.  If you are fewer, consider linking up with other couples or hikers to form a group.  Trailpeak has a trip planning feature that would suit this purpose fine (see upper nav -- a note goes out to all reviewers and others who have registered for group trips here).",
    "directions": "Moraine Lake Parking Lot, 12K from Lake Louise.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/1240/reg_10409039-10153171332968266-4418247780831129816-n-49442.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1240/reg_10626877-10153171332593266-2273506370319115671-n-49442.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1240/reg_10636148-10153171332453266-6436143488617084275-n-49442.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1240/reg_13903-10153171332838266-1987616133267843763-n-49442.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1240/reg_20130903-135932-52055.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1240/reg_20130903-142212-52055.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1240/reg_Eiffel-Lake-48461.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1240/reg_Wenchemna-Pass-Map.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1240/reg_Wenkchemna4907.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1240/reg_Wenkchemna4908.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1240/reg_Wenkchemna4910.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1240/reg_Wenkchemna4916.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1240/reg_eiffelsurroundedjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1240/topo_Wenkchemna4915.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1240/narrow_10423955-10153171332718266-1561077914751681445-n-49442.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1240/narrow_10556297-10153171332628266-7413162374410753381-n-49442.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1240/narrow_10641278-10153171332908266-8274354116067808334-n-49442.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/eiffel-lake-wenkchemna-pass-near-banff-ab-1240",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 4,
        "Time": "6 hrs",
        "Total Distance": "19 km",
        "Town": "Banff, AB",
        "Type": "out-and-back"
    },
    "title": "Eiffel Lake Wenkchemna Pass",
    "trail_id": "1240"
}