{
    "description": "Day 1: 11.42km. Moving time 4h 20m, total time 6.5 hours.Ascent: 2425ftDescent: 1480ftMax elevation: 8209ftDay 2: 11.26km Moving time  3h 40m, total time 6h 08mAscent: 1450ftDescent: 2467ftMax elevation: 8219ftA wonderful overnight trip. The hikes in and out are fairly easy, apart from the summits of the passes, which are very steep with loose rock. This route is an excellent way of getting to Ribbon lake whaile avoiding the chains and cliffs of the Ribbon Creek trail. Our trip June 27, 2016 there was still a considerable amount of snow on the east side of the passes.One disclaimer for the GPX track is that the North Buller Pass Trail intersection was covered in snow on our  trip, and the trail itself appears to have been completely washed out at some points. It should be close, but you may have to use your own judgement on how best to approach the Northern pass. The backcountry campground is well stocked with firewood, bear lockers and outhouses. The waster source is a clear-running stream not far up the trail from the campground. It will need to be treated or boiled before drinking.The 20 tent pads are well isolated from eachother and surrounded by trees. There are two communal fire pits and a few metal picnic tables.",
    "directions": "Take the Smith-Dorien/Spray trail from either Canmore or Peter Lougheed Provincial Park to Buller Mountain day use area. Park in the lot to the west of the road, and hike back across the road to the trailhead.",
    "geohash": "c3",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/12406/reg_IMG-1558-56231.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12406/reg_IMG-1562-56231.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12406/reg_IMG-1564-56231.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12406/reg_IMG-1574-56231.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/ribb-on-lake-via-buller-pass-near-kananaskis-ab-12406",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 5,
        "Time": "14 hrs",
        "Total Distance": "23 km",
        "Town": "Kananaskis, AB",
        "Type": "out-and-back"
    },
    "title": "Ribb on Lake via Buller Pass",
    "trail_id": "12406"
}