{
    "description": "This is a shortened version of the Tawayik Lake hiking trail in Elk Island National Park (Trail 9).  It follows the official trail around the east end of Tawayik Lake and through the narrows.  You complete the loop along the west side of the lake by taking a shortcut, following an unmarked trail and access road, returning to the parking lot.  The shortcut reduces the length of the trail to approximately 11 km (from the original trail length of 16.5 km).Starting at the parking lot at the end of Tawayik Lake road, follow the official trail (#9) for approximately 7 km around the east and south ends of Tawayik Lake.  This portion of the trail is mainly through the forest with the occasional small clearing.  As you enter the narrows between the lakes, the scenery changes.  There are great views of the open plains between the lakes and this is an excellent place to have a break and enjoy the view.I did this hike in the summer of 2016 and there isn't much of a lake left, just a bit of water visible off in the distance.Soon after you re-enter the forest to the west of the narrows, you will leave the official trail and head north.  The shortcut starts in a small clearing, with the original trail continuing west.  Look for an intersecting trail running north/south.  Follow this trail north.  This appears to be the remains of an old road based on the width of cleared forest and the more-or-less straight north/south direction.  This portion of the trail was mostly overgrown with tall grass but still easily passable, with a few muddy portions due to recent rains.  One portion of the trail descends to a low spot that was flooded because of a beaver dam, but was easily passable around the beaver dam.The last portion of the hike follows the access road to the Oster Lake backcountry tenting area (closed to vehicles) and is an easy walk back to the parking lot.I discovered this shortcut years ago as a quicker way to reach the narrows between the lakes, which is one of my favorite areas in the park.",
    "directions": "Turn onto Tawayik Lake Road from the main road through Elk Island National Park (park entry fee required).  Trail head is at the parking lot at the end of the road.",
    "photos": [],
    "source_url": "https://trailpeak.com/trails/elk-island-park-tawayik-lake-with-shortcut-near-edmonton-ab-12405",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "11 km",
        "Town": "Edmonton, AB",
        "Type": "out-and-back"
    },
    "title": "Elk Island Park, Tawayik Lake with shortcut",
    "trail_id": "12405"
}