{
    "description": "This hike starts at the Forgetmenot Trailhead Parking lot.The hike goes west to the Suspension Bridge where you cross over the Elbow River.Turn right after crossing the bridge and follow the trail general along the south side of the Little Elbow River. There some small creek crossing until you get to the Glasgow Creek crossing 2.7 KM out. At this point go straight west along the Little Elbow until you find yourselves at the base of a narrow ridge at 3.5 KM out. Go up the ridge moving off it near the top to get to the trail at the top.Follow this good trail up hill, past three viewpoints of the Nihahi Creek Valley and Nihahi Ridge, to a saddle at 4.5 KM out. You two choices here 1: go straight up to the tree line and further to the peak or 2: turn right up a rough trail to an outstanding knob viewpoint.There are several trails leading off the lower portion of this trail and care must be taken not to get off the main trail.",
    "directions": "Take Highway 66 from the Bragg Creek area to the junction with the Powderface Trail and turn left towards the Forgetmenot Trailhead parking lot.Alternatively you could park cars at the Suspension Bridge parking further down the road.",
    "geohash": "c3n2",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/12413/long_2016-06-13-mt-glasgow-ne-ridge-027a-160-panorama-from-the-top-56261.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12413/reg_2016-06-13-mt-glasgow-ne-ridge-026-looking-up-at-mt-glasgow-56261.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12413/reg_2016-06-13-mt-glasgow-ne-ridge-028-nihahi-creek-valley-from-the-top-56261.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mount-glasgow-ne-ridge-near-calgary-ab-12413",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 5,
        "Time": "6 hrs",
        "Total Distance": "12 km",
        "Town": "Calgary, AB",
        "Type": "out-and-back"
    },
    "title": "Mount Glasgow NE Ridge",
    "trail_id": "12413"
}