{
    "description": "Edwards Rating: II (III with snow patches) M M5 to 8 hoursElevation of 1117 m NET, 1177 m TOT & max 3023 m (3000 m officially)Completed on July 3 2016 with snow patches to avoid.Gear: Ice axe & crampons might be useful if early-late season ascent.*****This is supposed to be an easy scramble technically but it was not for us the three times we tried to complete it. Up to 2875 m in October 2015 in a whiteout with no appropriate gear, we had to turn back. Our second attempt on Canada Day in 2016 was no better as we attempted it on the first snow patch (see picture) and stopped on the ridge with a steep snow gully to cross and there was no way we would do that. The last and successful attempt two days later with some easy to moderate scrambling up closer to the summit and avoiding the snow was actually much nicer than expected as the snow forced us to do some fun hands-on scrambling. This is a very straightforward scramble overall and very few route finding was involved (only to avoid the snow and scree) but the route is obvious from the valley.From Chester Lake, we continued on the trail to the left and around the lakeshore until we got to the slabs and scree slope (GR217304). We went up the valley between Chester and Gusty and got a first grizzly encounter in 3 ½ years of weekly scrambling. That was scary as he ran in our direction 3 times before he finally decided to walk away. That is why we never took the good trail in the middle of the valley that day and rather stayed high along Mount Chester sidesloping on the rubble slope (GR221304). Once we got closer to Gusty, we looked for the waterfalls and started to go straight up and to the left to go around and started using rock bands from now on to get to the summit heading to the right. We stayed below the third snow patch as this was the safest way to go with no ice axe, crampons and unstable scree-rubble closer to the snow. We did have to do one step in the snow but we avoided it on our way down by scrambling in between small waterfalls a little bit lower (see picture). There`s a reason why it was named Gusty Peak (GR227324) and it is always really cold out there, no matter how warm it can be up to Chester Lake. From the true summit, I kept going to a close peak heading North but it was a little bit exposed to get there. I thought it was worth the 2-3 minutes hike to get a better view of the surrounding lakes and tarns.",
    "directions": "From Calgary, follow Trans-Canada Hwy/AB-1 W to Kananaskis Trail/AB-40 S and take exit 118. Drive south for about 50 km and turn right on Kananaskis Trail/AB-742. Follow that road for about 23 km and park at Chester Lake parking lot on your right.",
    "geohash": "c3n",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/12419/long_Gusty-Peak-Attempt-Kananaskis-Welcome-End-Oct-12-2015-1--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12419/reg_Gusty-Peak-Attempt-II-Kananaskis-Welcome-Jul-1-2016-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12419/reg_Gusty-Peak-Attempt-Kananaskis-Beautiful-ice-Oct-12-2015-2--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12419/reg_Gusty-Peak-Kananaskis-First-Grizzly-Encounter-Jul-3-2016-2--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12419/reg_Gusty-Peak-Kananaskis-Pointing-at-our-Summit-Jul-3-2016-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12419/reg_Gusty-Peak-Kananaskis-Route-2-Jul-3-2016-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12419/reg_Gusty-Peak-Kananaskis-Summit-View-of-Fortress-Jul-3-2016-44639_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12419/reg_Gusty-Peak-Kananaskis-Welcome-Route-1-Jul-3-2016-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12419/narrow_Gusty-Peak-Attempt-Kananaskis-Back-Down-easier-than-expected-Oct-12-2015-2--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12419/narrow_Gusty-Peak-Kananaskis-Our-Crux-Today-Jul-3-2016-44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/gusty-peak-near-kananaskis-ab-12419",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "7 hrs",
        "Total Distance": "16 km",
        "Town": "Kananaskis, AB",
        "Type": "out-and-back"
    },
    "title": "Gusty Peak",
    "trail_id": "12419"
}