{
    "description": "Edwards Rating: III (III or IV if climbing under Mount Girouard) L L11 to 15 hoursRESTRICTIONS: Wildlife corridor close by  Elevation of 1447 m NET, 1577 m TOT & max 2852 mGPS TRACK WARNING: I cut it off to the point where it became a difficult scramble. Going down the scree slope down that last point and back to the long waterfall is the best way to go even though you will cover a bit more distance.Completed in mid-July 2016 when snow-freeGear: Helmet with unstable rubble slopes*****This was the longest and most annoying-tiring approach we have ever done! That`s why I am rating it only 2/5 but the views of Lake Minnewanka from the ridge are stunning and hiking up the slaby waterfall was an great experience in itself! We thought we would be quicker and that we would do 2-3 peaks today, it didn?t work out that way?From Johnson Lake parking lot, we took the lake trail beside the outhouses and walked along the lake to its end. We saw a little creek with a clearing on our left so we turned left there (GR064724) and started to bushwhack for a few minutes. We were soaked almost immediately so we hiked up a little slope to our right and came across a nice trail on which we turned left (GR064722). We realized only on our way back at night that it was a closed trail (wildlife corridor). At one point, we saw an small opening to our left such happened to be the beginning of that terrible drainage (GR066721). We made sure to stay in that drainage bringing us in the opposite direction to start with and then slowly turning left and towards Girouard-Peechee ridge. We hiked for a couple of hours into that drainage until we arrived to a fork with a beautiful waterfall along Peechee on a slaby terrain to our right (GR107749). We walked up along that very long waterfall happy to finally get out of the drainage. Once at the end of it, we kept hiking along Peechee cliffs until we started to gain elevation again on a scree slope. My spouse decided to use the scree but I saw an almost dried up waterfall on the left and used it for some awesome moderate hands-on scrambling with mild exposure. Once up that beautiful valley, we saw a weakness in the rock bands below our ridge almost in the middle where there was a grassy slope so we reached that point and started to go up the ridge on a steep slope of unstable rubble using the rock band when possible. When we got to a plateau and we slowly gained the ridge going to our right. Once on the ridge, we got closer to Mount Peechee to realize this was climbing only to complete the ascent on that side. We turned back and decided to walk all the way to Mount Girouard. We stayed on the ridge all the way to the highest point and took a break (GR127763). We then continued to a wall before Girouard summit staying on the ridge. We lost just a little bit of elevation sidesloping until we reached a first brownish wall. We climbed that one and it was not so bad but then we had to stop. Having almost broken a pinky and both of us being exhausted, we didn`t even want to take more risk at that point with more exposed climbing next. We turned back the same way and went to that last point on my GPS track to go down a decent scree-rubble slope. Our mistake here was to keep going in that bushy-steep drainage in front of us? The best way to go (see picture) is to walk to the left side of the scree slope and get back to the valley, traverse it and go down that slaby waterfall again. You`ll have enough dead trees and rocks to deal with in the main drainage so you don`t need that here as the waterfall provides you with an obvious and beautiful way back down to the fork. Hales and heavy rain to complete our day helped in making it a very long and tiring one!",
    "directions": "From Calgary, follow Trans-Canada Highway/AB-1 to Banff and take exit toward Banff/Minnewanka Loop. Keep right to continue on Lake Minnewanka Scenic Rd/Range Rd 115B Rd for about 3.6 km and turn right on Johnson Lake Rd and continue to the parking lot.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/12428/long_Peechee-Girouard-Ridge-GR127763-Banff-Jul-10-2016-17--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12428/long_Peechee-Girouard-Ridge-GR127763-Banff-Welcome-Jul-10-2016-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12428/reg_Peechee-Girouard-Ridge-GR127763-Banff-Crux-Under-Girouard-Jul-10-2016-2--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12428/reg_Peechee-Girouard-Ridge-GR127763-Banff-Girouard-Lake-Minnewanka-Jul-10-2016-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12428/reg_Peechee-Girouard-Ridge-GR127763-Banff-Lake-Minnewanka-from-Ridge-Jul-10-2016-1--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12428/reg_Peechee-Girouard-Ridge-GR127763-Banff-Lake-Minnewanka-from-Ridge-Jul-10-2016-2--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12428/reg_Peechee-Girouard-Ridge-GR127763-Banff-View-Cascade-from-Johnson-Lake-Jul-10-2016-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12428/narrow_Peechee-Girouard-Ridge-GR127763-Banff-Crux-Under-Girouard-Jul-10-2016-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12428/narrow_Peechee-Girouard-Ridge-GR127763-Banff-Hiking-up-the-Nicest-Longest-Waterfall-Jul-10-2016-1--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12428/narrow_Peechee-Girouard-Ridge-GR127763-Banff-Hiking-up-the-Nicest-Longest-Waterfall-Jul-10-2016-5--44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/peechee-girouard-ridge-gr127763-near-banff-ab-12428",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 2,
        "Time": "13 hrs",
        "Total Distance": "26 km",
        "Town": "Banff, AB",
        "Type": "out-and-back"
    },
    "title": "Peechee-Girouard Ridge (GR127763)",
    "trail_id": "12428"
}