{
    "description": "Edwards Rating: II (III) M L6 to 9 hoursElevation of 1458 m NET, 1631 m TOT & max 2969 m (2958 m officially)Completed in mid-July 2016 when mostly snow-freeGear: Helmet and an ice axe and maybe crampons if you use the snow gullies. We didn?t as we did not have the gear and snow pack didn?t seem safe anyways at this time of the year. *****After reading lots of negative reviews about a long scree ascent and how important it was to use snow gullies early in the season to make it less painful, I was not expecting this scramble to be one of the nicest moderate one I have ever done. There are impressive waterfalls all along, the hands-on scrambling is incredible and the holds very good and options to reach that summit seem to be endless. We may have used the scree only about 10% of our ascent and took full advantage of it on our descent by doing a loop instead. Some sections of our route are trickier and involve a bit of climbing but moderate-difficult at most.Starting at the Galatea Creek parking lot, we went down the trail and crossed the 2 bridges and turned right after the second one. We looked to our left and passed a first drainage and kept going to a creek in the second one that we crossed to take a nice trail to the left on the other side of that drainage. We used that trail most times but sometimes went into the drainage as it was really bushy and we were completely soaked after a few minutes. When we reached the first waterfall, we used the fixed chain and crossed that first wall. You can also gain some elevation and do some good hands-on scrambling but rock was wet so it was easier for us with the chain. We kept going up the drainage, staying along the waterfall for good and easy scrambling avoiding the official trail. Once at the bowl we made sure to stay right and I used a good rock band leading me to the top of another waterfall to my right. My spouse would stay more in the centre to avoid that rock band separating us for about 50-75 metres of elevation gain. I found a weakness just before the waterfall to climb the rock band. It had rained a lot already at mid-point in the main gully but surprisingly rocks were still good and holds solid and the slabs not slippery at all most of the time. So we used a few slabs and went up closer to pinnacles and a cliff band. We could not see what was coming half the time as we were in the clouds but route finding ended up being quite easy and fun anyways. Once closer tot that cliff band, we found a weakness to the left bringing us up that last 300 metres scree slope. As we wanted to avoid again that treadmill we cut to the right and reached the ridge quickly that lead us to the summit few minutes later. It was easier with incredible views when clouds were clearing up.Descending was pretty quick even though we didn?t use the snow gully at the centre of the bowl. We first went straight down the summit using excellent scree to lose 300 metres of elevation in a few minutes. We started to add some cairns at that point and made our way down using a scree path going to the right and in between slabs leading us to a small gully at some point and then to the highest point of the main drainage. We stayed along that snow gully and scrambled down a steep slope but again with good rocks. We found a weakness in the middle of that slope and reached out what would be the official trail of dirt-scree. From there, we used the trail all the way down for a quicker descent. Doing it that way and avoiding the scree on the way up made it an incredible scramble where there was always a way up with lots of possibilities for fine scrambling and route finding, I loved it!",
    "directions": "From Calgary, follow Trans-Canada Hwy/AB-1 W to Kananaskis Trail/AB-40 S. Take exit 118 and start your odometer for a 32.7 km drive to the Galatea Creek parking lot to your right.",
    "geohash": "c3n1",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/12441/long_Mount-Kidd-Kananaskis-Ridge-Jul-17-2016-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12441/long_Mount-Kidd-Kananaskis-Summit-Jul-17-2016-2--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12441/reg_Mount-Kidd-Kananaskis-Beautiful-Morning-Sky-Jul-17-2016-2--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12441/reg_Mount-Kidd-Kananaskis-Route-Jul-17-2016-1--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12441/reg_Mount-Kidd-Kananaskis-Route.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12441/reg_Mount-Kidd-Kananaskis-Stunning-Waterfalls-Everywhere-Jul-17-2016-3--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12441/reg_Mount-Kidd-Kananaskis-Stunning-Waterfalls-Everywhere-Jul-17-2016-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12441/reg_Mount-Kidd-Kananaskis-Stunning-Waterfalls-Everywhere-Jul-17-2016-7--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12441/narrow_Mount-Kidd-Kananaskis-Clouds-Moving-Fast-Today-Jul-17-2016-3--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12441/narrow_Mount-Kidd-Kananaskis-Stunning-Waterfalls-Everywhere-Jul-17-2016-4--44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mount-kidd-loop-near-kananaskis-ab-12441",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 5,
        "Time": "8 hrs",
        "Total Distance": "12 km",
        "Town": "Kananaskis, AB",
        "Type": "out-and-back"
    },
    "title": "Mount Kidd (Loop)",
    "trail_id": "12441"
}