{
    "description": "Hike is fairly straight forward and ridge can be accessed from a couple of different approaches. It is 5km from parking area to peak. Once you are on the ridge it is mostly just scattered rock cairns although it is fairly easy to navigate. Summit elevation is 1430 metres.Explore the 360 degree view on the ridge. This is alpine area and you will see plenty of tarns, small lakes and alpine flowers along the way which makes the exploring interesting. Check out Mount Arrowsmith, Mt Moriarty, and Mt McQuillan to name a few. On a clear day you will not be disappointed. Absolutely stunning views.",
    "directions": "To get to the trailhead of Minna Ridge look for the turn off from Hwy #4 to \"Summit Main\" or Mt Arrowsmith Old Ski Hill road. Drive to the end of the connector then turn left and head up the Cameron Main line for about 20kms. Take the right turn at the fork and drive over Cameron river about 150m further on. Once on the other side of the bridge park in the small pull-off on the right (Parking Area #1) and walk 100m up the road towards Labour Day Lake taking the first spur road on your right. It is marked with yellow flagging tape. Follow trail/flagging from there on. This trail will take you up the gulley to the top of Minna Ridge. If you want to head up Camma Ridge Trail instead, then you can drive up another 300 metres from the bridge and park on the side of the road (Parking Area #2) and keep eyes peeled for an overgrown spur road on your right. Hike to it's end before picking up the trailhead. Both ways will get you to the top of Minna Ridge and each route has their merits. Make it a loop and you will see both aspects. Someone has slashed a lot of the alders along the trail of the Camma Ridge way but they are just strewn across the old spur road which makes it a little difficult to walk over.",
    "geohash": "c0xr",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/12455/reg_Mt-Arrowsmith-56734.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12455/reg_One-of-the-many-tarns-56734.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12455/reg_Side-ridge-56734.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12455/reg_Summit-Cairn-56734.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12455/reg_View-toward-Mt-Moriarty-56734.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/minna-ridge-near-port-alberni-bc-12455",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 4,
        "Time": "6 hrs",
        "Total Distance": "5 km",
        "Town": "Port Alberni, BC",
        "Type": "out-and-back"
    },
    "title": "Minna Ridge",
    "trail_id": "12455"
}