{
    "description": "Edwards Rating: III (V) M S5 to 8 hoursElevation of 872 m NET, 884 m TOT & max 2760 mCompleted in dry conditions on July 24 2016. An helmet is a must here as well as bug repellent. *****I rated that scramble as extreme because it definitely takes some experience and being comfortable with completely exposed climbing and ledges is essential: Exposed chimney, ridge, climbing, slabs, gullies, etc. You've got it all here. This is an awesome scramble and the approach is easy and straightforward. Rock fall is definitely a concern on the ascent if others are scrambling above. A huge rock fell while 2 other scramblers were coming down from the ridge.Starting at the Burstall Pass parking lot, we followed the obvious trail for about 3km where we saw a cairn and blue flags on the left side (GR175268). We started our ascent using that trail going through the forest and leading us to the bowl under the col (black scree slope). We hiked up to reach the slope and used the brown rock band in the middle for an easier ascent. We reached the col and then turned right to start the ascent to the ridge. This is where rock falls can be dangerous if other scramblers are above you. We stayed close to the ridge on the right side most of the time and used good rock bands and slabs to make it easier. Once at the ridge we went directly on it but some people are using a scree path to the left. You might want to experience that moderately exposed ridge scramble and see how you feel before going further. After just a few minutes, we used a good weakness on the ridge and went down a few meters to our right to reach a ledge. We added a cairn down there to remember where to come back up. At the end of the ledge, we took a break on a platform looking at the huge crack in the vertical slab that we would have to use to go up to the ridge again. From that platform and by myself at this point, I climbed up into the crack using great holds on each side. At mid-point, I started to feel some stress as I had to go down 1-2 steps into a tiny gully with great exposure on my right. I used whatever holds were available and slowly got to the last part of that first crux (to me at least). Back on the ridge, I climbed up and to the right on a slab with good footing and handholds but exposed to a cliff on my left. It was the part I personally found the most difficult because of that exposure. I then used footholds on the right side of the ridge and got back on it again for a short and exposed section leading to another tiny and exposed gully. At this point I was in front of what is the actual crux but I kind of liked it as it was a 3-4 climbing moves with good holds but again very exposed as always here. Once up the crux, I scrambled to the right on a small ledge to reach easier terrain for the last minute of scrambling to the summit. I took the exact same way down back to the ledge and we came back up to the ridge at the cairn we added earlier. Going down the ridge was easy and we stayed to the right at first to take advantage of some decent scree for a little while. We arrived to a cliff at some point and cut to the left to use our ascent route again. We reached the col and went to the end of the black scree and it was one of the best scree we've used in a while for a quick and fun descent. We walked back to the trail on our left to the forest and eventually to Burstall Pass trail. This is a stunning and challenging scramble, highly recommended!",
    "directions": "From Calgary, follow Trans-Canada Hwy/AB-1 W to Kananaskis Trail/AB-40 S and take exit 118. Drive south for about 50 km and turn right on Kananaskis Trail/AB-742. Follow that road for about 23 km and park at Burstall Pass parking lot on your left.",
    "geohash": "c3",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/12452/long_Mount-Burstall-Kananaskis-Summit-Jul-24-2016-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12452/reg_Mount-Burstall-Kananaskis-Beautiful-Flowers-Everywhere-Jul-24-2016-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12452/reg_Mount-Burstall-Kananaskis-Exposed-Chimney-Crack-Jul-24-2016-3--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12452/reg_Mount-Burstall-Kananaskis-Route-Jul-24-2016-1--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12452/reg_Mount-Burstall-Kananaskis-Route-Jul-24-2016-2--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12452/reg_Mount-Burstall-Kananaskis-Summit-Jul-24-2016-2--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12452/narrow_Mount-Burstall-Kananaskis-Exposed-Chimney-Crack-Jul-24-2016-1--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12452/narrow_Mount-Burstall-Kananaskis-My-Crux-Exposed-Slab-Jul-24-2016-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12452/narrow_Mount-Burstall-Kananaskis-Route-Jul-24-2016-3--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12452/narrow_Mount-Burstall-Kananaskis-The-Crux-Climbing-Jul-24-2016-44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mount-burstall-near-kananaskis-ab-12452",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 5,
        "Time": "7 hrs",
        "Total Distance": "10 km",
        "Town": "Kananaskis, AB",
        "Type": "out-and-back"
    },
    "title": "Mount Burstall",
    "trail_id": "12452"
}