{
    "description": "Relatively unmaintained steep hiking, then vast wilderness plateau with fantastic views all around.  One of the more beautiful hikes I?ve done recently, primarily due to the fact that for most of the day you are walking in the alpine or on a ridge with stunning views in all directions!STATSAccumulative Elevation Gain 1150m (3800ft) to true summit (Note, Grouty is improperly placed on Google Maps/Earth - what Google calls Grouty is what I know as Mortar.  Grouty is still further north.)Mean Elevation Gain 930m (3050ft) to true summitDistance (return) 16kmTime 7-9hr depending on how many photo stops you make!",
    "directions": "Highway 99 to Pemberton to Pemberton Meadows Road. Cross the river to Lillooet Forest Service Road. Turn right to Hurley River Forest Service Road at 7.6 Km point from the bridge. Trailhead is at about 10.7 Km from Hurley River FSR junction.Park pretty much at the top of Railroad Pass at a turnout on the west side of the road (50.5977, -123.0188), about a km beyond the far more popular Semaphore Lakes trailhead.  The trail begins on the east side of the road, so walk across the road and you will see pink flags marking the trailhead.  The trail itself is fairly defined and marked by both pink flagging as well as orange paint on the occasional tree, although a bit overgrown in places.  However, if the snow is gone, it should be relatively easy to follow.  After climbing for 40 minutes or so, you reach the alpine which continues up steeply along a fairly visible track through the grass, albeit with fewer markers, until you gain the ridge after which all signs of trail or markers cease.  There is a small tarn just over the ridge from where you top out.  Total elevation gain from car to ridge is about 500m (1640ft) and takes about an hour.  Poles were handy to this point (and particularly for the final descent), but once we had gained the ridge here, we simply stashed them and picked them up again on our return ? I think they would be more of a hindrance on the rocky sections yet to come, than of use.From there, simply head north through the alpine grasses, your next destination being the ridge composed mainly of rock you see in the far distance.  (Looking due north, you will also see a much closer ridge slightly off to your right, but that is not the ridge you want).  Once you?ve walked the alpine meadow and reached this rocky ridge, there are numerous ways up and you simply continue to travel north picking whichever way you think is best.  In all honesty, I don?t ever recall seeing a single cairn the entire way, other than the summit cairn on Grouty at the far end of the ridge.  There are, interestingly enough, quite a number of old and dried out bamboo poles just lying on the ground (never vertical, always horizontal) which you can follow if you like as they are laid out in the direction of the summit.If you come across any obstacles along the way, the simple rule of thumb is to keep to the west side of them and you should get around them without problem as you don?t always have to stay on the ridge line itself.  Continuing on, the first named bump on the ridge (not sure if officially named, but nonetheless) is Mortar Peak (50.6296, -122.9976) which by all accounts is about 3m lower than Grouty, a little over a km away as the crow flies.  Descend west easily from Mortar to the low point on the ridge between it and Grouty, and once again follow the ridge northeast until you reach the true, highest point of Grouty at 50.6402, -122.9932.  We weren?t going especially fast (maybe even a bit slow) and it took us about 45 minutes from Mortar to Grouty.The views constantly change as you travel along this entire ridge, so really it?s up to you as to how far you would like to go, or if bagging named peaks is your game.  Although the route was fairly easy to figure out, because of the curves of the ridge line, various gullies and cliff bands, etc., in cloud or poor visibility it might be a whole other matter, so having a GPS to ensure you?re following the right route back could become very handy in such conditions.  But to be honest, with views as incredible as you get up there, you really want to do this on a gorgeous day anyway!(In case anyone is allergic to wasps, I should point out that about 170m up from the car we encountered a few.  I got stung by 3 and my friend by 4 ? after which on the descent she got stung at the exact same place yet one more time for good measure!)",
    "geohash": "c",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/12466/reg_01-26979.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12466/reg_02-26979.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12466/reg_03-26979.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12466/reg_04-26979_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12466/reg_05-26979.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12466/reg_06-26979.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12466/reg_20150725-140827-56933.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12466/narrow_20150725-152807-56933.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/grouty-and-mortar-peaks-near-pemberton-bc-12466",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 5,
        "Time": "8 hrs",
        "Total Distance": "19 km",
        "Town": "Pemberton, BC",
        "Type": "out-and-back"
    },
    "title": "Grouty and Mortar Peaks",
    "trail_id": "12466"
}