{
    "description": "Edwards Rating: III (IV, maybe V on some sections of the ridge) M M7 to 11 hoursElevation of 752 m NET, 1282 m TOT & max 2941 m on Mt Pocaterra (2874 m Mt Tyrwhitt & 2767 m Grizzly Ridge Peak)Completed on August 1 2016 in dry conditions. Helmet was a must here again.*****This is a seriously exposed scramble when staying on the ridge. I have no clue why some rates it as a moderate as there are many sections of deadly exposure, a bit of climbing, some route finding and all that makes it a very challenging but incredibly fun scramble! We had a blue sky and I wouldn?t have done it in different conditions because of that exposure. Funny that Mount Tyrwhitt is rated moderate as we both thought it was easy technically. Starting on the main trail, we took the first left at a fork for Pocaterra Cirque trail and kept going for a few minutes to the second fork where we went left again. From there, it was straightforward with some games of trails but staying on the most obvious one all the time. At the next fork and once in front of Tyrwhitt-Pocaterra ridge, we took our left again (GR407063) and started to go up until we came across another trail on our left leading to the very beginning of all this ridge (GR406058). We turned left again and hiked straight up to the orange-brownish ridge. We completed that easy scramble to Grizzly Ridge Peak (GR412057). We then continued on that ridge and turned right to go down the col and start our ascent of Mt Tyrwhitt. There was a lot of people and rock falls here, so we stayed very close to the crest for better hands-on scrambling anyways using rock bands, slabs and sometimes scree trails. Easy ascent again here and looking at what?s coming. There was a scree trail to the left from the summit to go down Tyrwhitt-Pocaterra ridge but we stayed straight on the ridge as great exposure was only on our right and manageable to the left. Walking down the ridge to a point that was too tricky for us, we went down and around a steep slab and reached back the ridge right after. You can stay a 100% of the time on the ridge but we decided in two other occasions to avoid it to the left. Funny thing is both times we put ourselves in a difficult situation anyways as it was exposed using ledges with scree to go down a few metres. The second time we came back to the ridge was between the false summit and summit ridge (GR394071). I completed the false summit ascent and came back down to climb a 5 metres wall with great grips and get back on the ridge. We did a few sections incredibly exposed there and then circumvented the last one on the left again. We went down to reach a narrow and easy to scramble chimney at this point that led us to easy terrain and the true summit (GR393072). Going down, we had enough challenges and it was late in the day so we went down the chimney and lost an extra 100-200 metres at least and sidesloped to traverse 3 gullies in a row. Back up on a rocky spine at the end of the third one (GR393068), we reached back the ridge and saw our pinnacle we were looking for to go straight down on the east slope (GR395068). Alan Kane was wrong as some people said as there is a trail down and it is easy to moderate at most. We went down the scree, then used a steep grassy bump to scramble down to the edge of a cliff. We looked to our right and saw the huge shark fin (GR397067) Soistheman was mentioning in his report and we slowly went down along it to get to the last scree slope leading to Pocaterra Cirque. We turned right and walked back to an official trail (GR401062). We took a different one for a while but we couldn?t care less as they all lead back to the parking lot anyways it seems. That was an incredibly challenging and fun scramble, but this is a difficult scramble in my mind for sure.",
    "directions": "From Calgary, follow Trans-Canada Hwy/AB-1 W to Kananaskis Trail/AB-40 S. Take exit 118 and start your odometer at the Casino entrance and drive for about 67 km to Highwood Pass parking lot on your right.",
    "geohash": "c2yp",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/12475/long_Grizzly-Ridge-Peak-Kananaskis-Summit-Our-Route-for-Tyrwhitt-Pocaterra-Aug-1-2016-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12475/long_Mt-Tyrwhitt-Kananaskis-Summit-Aug-1-2016-3--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12475/long_Mt-Tyrwhitt-Kananaskis-Summit-View-of-Pocaterra-Kananaskis-Lakes-Grizzly-Ridge-Aug-1-2016-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12475/reg_Grizzly-Ridge-Peak-to-Mt-Tyrwhitt-Kananaskis-Beautiful-Window-Aug-1-2016-2--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12475/reg_Grizzly-Ridge-Peak-to-Mt-Tyrwhitt-Kananaskis-Fun-Scrambling-on-Tyrwh-Aug-1-2016-1--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12475/reg_Grizzly-Ridge-Peak-to-Mt-Tyrwhitt-to-Mt-Pocaterra-Traverse-Kananaskis-Descent-Route-Aug-1-2016-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12475/reg_Mt-Pocaterra-Traverse-Kananaskis-Exposed-Scrambling-freaky-Aug-1-2016-1--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12475/narrow_Mt-Pocaterra-Traverse-Kananaskis-Exposed-Scrambling-freaky-Aug-1-2016-2--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12475/narrow_Mt-Pocaterra-Traverse-Kananaskis-Exposed-Scrambling-freaky-Aug-1-2016-3--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12475/narrow_Mt-Pocaterra-Traverse-Kananaskis-Exposed-Scrambling-freaky-Aug-1-2016-4--44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/grizzly-ridge-peak-gr412057-to-mt-tyrwhitt-to-mt-pocaterra-traverse-near-kananaskis-ab-12475",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 5,
        "Time": "9 hrs",
        "Total Distance": "14 km",
        "Town": "Kananaskis, AB",
        "Type": "out-and-back"
    },
    "title": "Grizzly Ridge Peak (GR412057) to Mt Tyrwhitt to Mt Pocaterra Traverse",
    "trail_id": "12475"
}