{
    "description": "Edwards Rating: II (III) M S5 to 8 hoursElevation of 886 m NET, 925 m TOT & max 2768 m (2775 m officially)Completed on July 31 2016, dry conditions. I read some do it with snow patches requiring an ice axe and maybe even crampons.Gear: Helmet, bug repellent. *****This is a fun scramble with a moderately exposed section of good hands-on scrambling close to the summit, some not so good bushwhacking for about 30 minutes and a creek crossing through wetland just before starting to gain most of the elevation. Most of it is actually easy but the bit of scrambling and route finding might make it easy-moderate technically.Starting from Burstall Pass parking lot, we walked on the main trail for about 4 km until the trail brought us to the wetland (GR167261). We then started to cross the valley trying to avoid to get our feet soaked (a little bit of a challenge there). We reached the creek and took off our boots to cross it making sure to avoid some sections that were quite steep even though short in distance. We came back to the right to face the avalanche gully between Pigstail on the left and Commonwealth Peak on the right. We saw orange flags at GR166264 such we used to bushwhack for a while. When it became trickier and we saw the opening on our right, we cut straight back to the gully and got rid of that last bit of more challenging bushwhacking. The flags are not always obvious or logical we thought but they did help. Once in front of the col, we took the grey rubble slope to our right to get to the summit block. We saw a scree gully leading us to the right and stayed along the walls gaining some more elevation to the first gully behind (a few cairns here). We used rock bands and a scree trail to go up that gully and took it to the right upon its end to get on a plateau in front of what people call the crux. It was on our right and leading to the ridge, a 15 metres hands-on scrambling mildly exposed as a fall there would most likely not be fatal. We climbed up using good grips and reached the ridge to walk all the way to the summit for a few minutes with maybe one or two steps more exposed but again nothing to worry about there really.We went down the same way except that we walked longer on the col to go down good brownish scree and for the bushwhacking we tried on the left side of the waterfall to stay out of the woods as long as possible. It was not really a good idea so the orange flags might be better after all. A fun scramble overall with a fun and a bit more challenging section.",
    "directions": "From Calgary, follow Trans-Canada Hwy/AB-1 W to Kananaskis Trail/AB-40 S and take exit 118. Drive south for about 50 km and turn right on Kananaskis Trail/AB-742. Follow that road for about 23 km and park at Burstall Pass parking lot on your left.",
    "geohash": "c3",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/12474/long_Commonwealth-Peak-Kananaskis-Crux-Nice-Hands-on-Jul-31-2016-2--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12474/long_Commonwealth-Peak-Kananaskis-Summit-Jul-31-2016-3--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12474/long_Commonwealth-Peak-Kananaskis-View-of-Robertson-Glacier-Jul-31-2016-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12474/reg_Commonwealth-Peak-Kananaskis-Col-Jul-31-2016-1--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12474/reg_Commonwealth-Peak-Kananaskis-Crux-Nice-Hands-on-Jul-31-2016-3--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12474/reg_Commonwealth-Peak-Kananaskis-Freakin-wetland-and-storm-Jul-31-2016-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12474/reg_Commonwealth-Peak-Kananaskis-Route-Jul-31-2016-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12474/reg_Commonwealth-Peak-Kananaskis-Summit-View-of-Galatea-Gusty-The-Fortress-Chester-Jul-31-2016-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12474/reg_Commonwealth-Peak-Kananaskis-View-of-Robertson-Glacier-Jul-31-2016-2--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12474/reg_Commonwealth-Peak-Kananaskis-Welcome-Route-Jul-31-2016-44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/commonwealth-peak-near-kananaskis-ab-12474",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 4,
        "Time": "7 hrs",
        "Total Distance": "13 km",
        "Town": "Kananaskis, AB",
        "Type": "out-and-back"
    },
    "title": "Commonwealth Peak",
    "trail_id": "12474"
}