{
    "description": "Edwards Rating: II (III or IV depending on your route) M L (Whole loop)5 to 9 hoursElevation of 1288 m NET, 1344 m TOT & max 3143 m on Mist Mountain (2579 m Mt Lipsett)Completed on August 7 2016 in dry conditions. Helmet recommended for rock fall hazard.Annual road closure from December 1st to June 14th.*****The quality of the rock and possibilities for hands-on or climbing made it one of my favourite moderate scrambles ever. Most of this loop was a hike only but the route finding and hands-on makes it a technically moderate scramble when completing the loop like we did.From the parking lot we took the official trail to a first fork (GR494990) where we continued to the left. That trail was very muddy sometimes but pretty good and easy even though quite long. Some people are probably bushwhacking straight up to take a shortcut but we had no intention of doing so today. When got to the summit (GR469015) and after a short break I walked just past it and went down to the right on a steep dirt slope with unstable rocks. I made it down to the rubble and reached Lipsett col to the right but my spouse was smart enough to avoid this and went back about 20 meters from the summit and down easy terrain directly in front of the col. We walked by a flock of sheep there and then started going up the rubbly slope. Once done with that and in front of vertical slabs, we saw a weakness to the right (GR477017) and climbed some awesome rocks in what seemed to be a waterfall at some point. Using that white rock, we started to go up left using the first and second gullies but avoided the scree and rubble almost a 100% of the time. Route finding is involved here but there are so many ways to go up using rock ribs/bands, chimneys and climbing up short walls. It was an incredibly fun section. When we got close to the end of those gullies, we climbed up in between the v-shaped red rock ribs and eventually had to turn right where we came across our first cairn. We kept going right until we finally saw the ridge up to our left. I reached its highest point again to avoid scree and enjoy this awesome scramble and stayed up there all the time for some easy scrambling with narrower sections. My spouse stayed about 5-10 meters lower where it was easier to walk below the ridge and cross those ribs. The colors of the soil and rocks there again were absolutely incredible: Yellow, red, purple, orange and green. When we got to the little scree slope just before the summit, we used the obvious trail and completed our ascent with the summit on our left (GR480023). We had extremely limited views being in the clouds and with thunderstorms all around we stayed only a few minutes and went down the same way for about 5 minutes until we came across excellent scree leading down to a bowl on our left (GR480021) and losing 400 m of elevation quickly. We went to the left for some time using rock bands and then saw the obvious trail along the right slope going to the valley. We got there and once in the valley we went down the grassy slope to reach the trail again to the right. Back to the highway, we turned right and walked along the road for about 700 m back to the car. This really is a stunning scramble up Mist Mountain but use our GPS track as a guide if you are not comfortable with route finding. It's hard to explain exactly what we did but experienced scramblers will have no issues with it.",
    "directions": "From Calgary, follow Trans-Canada Hwy/AB-1 W to Kananaskis Trail/AB-40 S. Take exit 118 and start your odometer at the Casino entrance and drive for about 79 km (12 km south of Highwood Pass parking lot) to a parking spot on your left. This is not Mt Lipsett parking lot. It is located about 7 km further south.",
    "geohash": "c2yr",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/12481/reg_Mist-Mountain-Summit-Storms-Clouds-Around-Aug-7-2016-3--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12481/reg_Mount-Lipsett-to-Mist-Mountain-Loop-Aug-7-2016-19--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12481/reg_Mount-Lipsett-to-Mist-Mountain-Loop-Aug-7-2016-41--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12481/reg_Mount-Lipsett-to-Mist-Mountain-Loop-Beautiful-Rock-Colors-Aug-7-2016-1--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12481/reg_Mount-Lipsett-to-Mist-Mountain-Loop-Col-Flock-of-Bighorn-Sheep-Aug-7-2016-3--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12481/narrow_Mount-Lipsett-to-Mist-Mountain-Loop-Aug-7-2016-22--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12481/narrow_Mount-Lipsett-to-Mist-Mountain-Loop-Aug-7-2016-34--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12481/narrow_Mount-Lipsett-to-Mist-Mountain-Loop-Aug-7-2016-43--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12481/narrow_Mount-Lipsett-to-Mist-Mountain-Loop-Beautiful-Rock-Colors-Aug-7-2016-3--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12481/narrow_Mount-Lipsett-to-Mist-Mountain-Loop-Beautiful-Rock-Colors-Aug-7-2016-4--44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mount-lipsett-to-mist-mountain-loop-near-kananaskis-ab-12481",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 5,
        "Time": "7 hrs",
        "Total Distance": "15 km",
        "Town": "Kananaskis, AB",
        "Type": "out-and-back"
    },
    "title": "Mount Lipsett to Mist Mountain Loop",
    "trail_id": "12481"
}