{
    "description": "This trail gets you close enough to Coleman Glacier on Mt Baker named after the first to summit it. This is also the start of the climbers route. Only 550 meters elevation gain. Only one thing to know there is a creek to cross that can become a torrent especially after rain or later in the day when it gets hotter so its better to do in the morning. When i went i backtracked crossing it because the rocks were too far apart and wet and the water was going fast. So i went down hill a bit and found a more suitable place to cross. The most i guess can happen is get wet but also slip on a wet rock and get hurt. I can see a child getting swept away a little down stream but not to the point of drowning although i havent seen this creek at its worst. The view of the glacier and Mt Baker up close is worth getting wet. And its not too long of a hike for the reward. The forest road to the trail head can seem long but its maintained and partially paved. Any car can go. Northwest forest pass required to park there 5$ one day or 30$ for year pass more convenient if you plan on spending a few days in the area to do other hikes and the pass can be used even in Oregan at trails there.",
    "directions": "Sumas border down until you hit the turnoff left for 547 then left again on 542 Mt. Baker hwy. Pass Maple falls and Glacier stop at the visitor centre to get pass. Continue down the road very soon on the right you will see Glacier creek road. Go straight ignoring the first left that goes to skyline divide trail. Keep on that road to the trail head will be a road to the right just before the trailhead ignore it.",
    "geohash": "c29m",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/WA/12499/reg_DSC05857-42566.jpg",
        "https://trailpeak.com/storage//content/trails/US/WA/12499/reg_DSC05861-42566.jpg",
        "https://trailpeak.com/storage//content/trails/US/WA/12499/reg_image.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/heliotrope-ridge-near-maple-falls-wa-12499",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 5,
        "Time": "3 hrs",
        "Total Distance": "8 km",
        "Town": "Maple Falls, WA",
        "Type": "out-and-back"
    },
    "title": "Heliotrope Ridge",
    "trail_id": "12499"
}