{
    "description": "Chose to adventure to this un-named lake as I couldn't find any information on it anywhere online. I originally named this hike Miserable Lake to keep expectations low. Indeed it wasn't in the least bit awful. Beautiful hiking through the rugged, unpopulated depths of Okanagan Mountain Park. We turned off the well maintained Wildhorse Canyon trail at the 7.6 km mark to bush whack up to the lake. Turned out to be pretty easy Okanagan foresty/grassland bush whacking. The lake itself is large and clean. Surrounded by reeds there wasn't many options for access to swim but if you can get in it's worth it. Other than a rock cairn we saw no signs of humans at all which was nice. Definitely need to pack lots of water as we didn't pass any suitable drinking water until we got to the lake.We drank the lake water without any miserable consequences which obviously isn't recommended but made things easy. Re-growth since the 2003 fire is awesome and we were surprised by the amount of shade we came across. Especially in the canyon. I rate this hike moderate as the majority is flat with only inclines leaving the parking lot and bush whacking to the lake. It's fairly long which might up the difficulty for some. The timing is based on our 4km/h hiking speed with 40lb packs. Very few stops other than drinking and photos. We camped on a bluff above the west side of the lake with spectacular views and cool breezes. This allowed us time and energy to explore many of the other little ponds and views in the area the following day.  Came across several deer, a rattlesnake, rubber boa and lots of garter snakes. Saw sign from many other animals including bears.It should be noted that on the provincial website hiking off trail and camping out of designated areas is not encouraged.",
    "directions": "The shorter, easier option to access Wildhorse Canyon trail is 9.7km's from the Lakeshore/Barnaby/Chute Lake Rd intersection. There are two tall cell towers that mark the trail head with parking on the shoulder of the road. The longer option is to drive only 8km's out Lakeshore and park at the marked Okanagan Mountain Park Access Trail. This is a big obvious parking lot. Use the 'Boulder Trail' and 'Cn Trail' to access Wildhorse Canyon Trail.",
    "geohash": "c2f",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/12490/reg_2016-08-12-at-18-26-38-35968.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/notmiserable-lake-near-kelowna-bc-12490",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall winter",
        "Stars": 5,
        "Time": "6 hrs",
        "Total Distance": "18 km",
        "Town": "Kelowna, BC",
        "Type": "out-and-back"
    },
    "title": "Notmiserable Lake",
    "trail_id": "12490"
}