{
    "description": "I rated this trail as difficult due to the elevation gain and lack of water until the meadows. This is one trail in the area that is doable in the spring because of its southern exposure the snow melts faster. The first half is switch backs in the forest then opens up in the meadows. Lots of flowers in August when i did it. Once in the meadows the trail goes right then you have 2 options to the top. To the right side is easier grade but longer and the left trail goes straight shot to the summit. The final push is a bit of scrambling but nothing crazy and metal wires to hold on to if you need. I ditched my poles before that they would be just in my way. The summit views are awesome, Mt baker full view and mt shuksan and to the north you can see all the way to Canada, Mt Slesse and Cheam range. You need a pass to park at the trailhead. Forest road is good for a small car just a few small potholes and gravel.",
    "directions": "From Canada take Sumas border crossing than straight down until you see signs for 542 mt Baker hwy to the left very soon. Than drive past Maple falls and Glacier. Once at Glacier stop at the visitor centre for your day pass 5$ or take a year pass 30$ if you plan on doing other hikes in the northwest usa. Its worth it and less headaches. Continue on Mt Baker hwy until mile marker 38 and very shortly on the left will be church mountain road. Take it to its end ignoring any side road there will be a toilet and a trail info.",
    "geohash": "c29q",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/WA/12498/reg_DSC05873-42566.jpg",
        "https://trailpeak.com/storage//content/trails/US/WA/12498/reg_DSC05877-42566.jpg",
        "https://trailpeak.com/storage//content/trails/US/WA/12498/reg_DSC05878-42566.jpg",
        "https://trailpeak.com/storage//content/trails/US/WA/12498/reg_DSC05880-42566.jpg",
        "https://trailpeak.com/storage//content/trails/US/WA/12498/reg_DSC05881-42566.jpg",
        "https://trailpeak.com/storage//content/trails/US/WA/12498/reg_DSC05882-2-42566.jpg",
        "https://trailpeak.com/storage//content/trails/US/WA/12498/reg_image.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/church-mountain-near-maple-falls-wa-12498",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 5,
        "Time": "5 hrs",
        "Total Distance": "13 km",
        "Town": "Maple Falls, WA",
        "Type": "out-and-back"
    },
    "title": "Church Mountain",
    "trail_id": "12498"
}