{
    "description": "The trail starts at the Mt. Kostuik trailhead and it is well marked all the way to the alpine. Once on the ridge, follow the ridge line and bag Mt. Kostuik, two unknown peaks, and Mt. Terminator along the way. View to the east is Roman Mountain and the mine; to the west is the surrounding mountain range. The best way to descend Mt. Terminator is heading down from the north west face of the peak then follow the ATV tracks all the way to down to the Mt. Terminator trailhead.Alternatively, for a shorter day hike, one can hike up Mt. Kostuik / Mt. Terminator separately. Both hikes are about 8 km return.",
    "directions": "From Tumbler Ridge, drive south on Highway 52 (Heritage Highway) for 19.5 km then turn right onto Core Lodge Road (this is a radio controlled road so watch out for industrial vehicles). Keep right at 12.5 km (left is for mine traffic only). Drive 800m, there is another fork. The one going to the right goes uphill (to Boulder Gardens/Shipwreck). Take the left road. Drive another 800 m. You will see the Core Lodge on the left hand side. This is the start of the Five Cabin Road, which can be quite rough for 2x2 low clearance vehicles. Drive cross the bridge and shortly after you'll see Mt. Kostuik Trailhead sign (the trail starts across the road). Park a vehicle here. Continue driving for another 4.7 km to a bend. Park your second vehicle. This is the Trailhead to Mt. Terminator.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/12502/reg_P1040301-resize-56135.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12502/reg_P1040302-resize-56135.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12502/reg_P1040321-resize-56135.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12502/reg_P1040331-resize-56135.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12502/reg_P1040346-resize-56135.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12502/reg_P1040365-resize-56135.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12502/reg_P1040368-resize-56135.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/windy-ridge-traverse-near-tumbler-ridge-bc-12502",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 3,
        "Time": "7 hrs",
        "Total Distance": "15 km",
        "Town": "Tumbler Ridge, BC",
        "Type": "out-and-back"
    },
    "title": "Windy Ridge Traverse",
    "trail_id": "12502"
}