{
    "description": "This is a very long and physically challenging day in terms of distance and elevation gain. A helmet a good idea with some lose rocks and debris. Edwards Rating: II (III) L L8 to 11 hoursElevation of 1650 m NET, 1599 m TOT & max 2938 mCompleted on August 13 2016, dry conditions.*****Technically it is also challenging and difficult where route finding skills are a must and there's some exposure and a little bit of exposed climbing closer to the summit with debris/rock fall hazard most of the time. I personally loved it overall but I wouldn't do it again as the approach is so long. Descent is not great as we didn't want to take another route down and lose time on possibly more route finding so no good scree to lose elevation quickly if you take the same route than us.Starting at Floe Lake parking lot, we crossed the highway and took the official Hawk Creek Trail going left. It brought us back to the road a few minutes later and then into the forest just after the creek where you actually may want to park to save some time and energy (GR660596). An extra 7 km followed on a good trail in a beautiful burned out forest with new vegetation all around. At the total 7.5 km mark, we saw 2 cairns on the left (GR704630) and started easy bushwhacking up that slope. We reached a rock band and went around it to the right (GR702633). On the way down, we actually down climbed this band and it might be a good idea to test your abilities here on the way up. Not being able to make it would probably mean that the summit is not a sure thing. We started going up to the right in the scree/rubble slope and it was a mistake. My partner made me realize we should be going straight in the middle of that gully leading to more rock bands and using good stairs like rocks now. Once we got in the middle of what we thought was the summit block but actually just the beginning of the ridge, we took it on our left finding some good climbing leading up to a plateau. Going around a cliff, we came across a chimney (GR697638) and used it to reach the ridge. From now on we stayed on the ridge as much as possible for a nicer scramble rather than sidesloping even though sometimes it was moderately exposed. There are trails going along to the left most of the time but I wouldn't go too far down, staying about 20 metres max from the ridge. We actually had to use of them at some point to avoid tricky sections (GR694642). Once we got to a wide gully with black rocks, we tried many walls that could be doable for both of us before I finally found a good 4 steps with good holds to walk over a drop of about 5-7 meters. My partner called it a day there so it seems like this section was the crux for us. After that, I kept scrambling up rock bands with debris and some lose rocks almost straight up and to the ridge again. Looking to my left there was a large plateau before the summit block. I went up to the block and circumvented it on the left at some point to use a ledge (GR693642) bringing me to the last few steps leading to the summit (GR693643), just a walk from there.I went back down the same way but down climbed a different section at the crux (see picture). From there, we purposely lost a bit of elevation but staying close enough to the ridge using some good lines to go faster back to the chimney. We sometimes got back to the ridge when it was the easiest and fastest way to go. Most of our way down was almost identical thereafter except that we stayed in the gully as long as possible and down climbed the very first rock band and bushwhacked almost straight down from there to eventually come back to the official trail using a drainage when it was too bushy. Again, the greatest challenge here might be the route finding and some of the climbing sections. I thought it looked like Mount Carnarvon in many ways: distance, elevation, route finding and climbing.",
    "directions": "From Banff, get to Castle junction/Highway 93 South and drive for another 32 km or so. Turn right and park at the Floe Lake/Hawk Creek parking lot.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/12507/long_Isabelle-Peak-Kootenay-Route-1-Aug-13-2016-1024x385--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12507/long_Isabelle-Peak-Kootenay-Summit-View-Ball-Copper-Pilot-Brett-Aug-13-2016-1024x252--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12507/long_Isabelle-Peak-Kootenay-Up-Gully-Below-Ridge-Aug-13-2016-1024x389--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12507/reg_Isabelle-Peak-Kootenay-Back-Before-Sunset-Aug-13-2016-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12507/reg_Isabelle-Peak-Kootenay-Climbing-Down-1st-Rock-Band-Aug-13-2016-1-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12507/reg_Isabelle-Peak-Kootenay-Crux-Aug-13-2016-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12507/reg_Isabelle-Peak-Kootenay-Crux-Aug-13-2016-3-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12507/reg_Isabelle-Peak-Kootenay-Nice-Waterfalls-Aug-13-2016-1-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12507/reg_Isabelle-Peak-Kootenay-Ridge-Walk-Aug-13-2016-2-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12507/reg_Isabelle-Peak-Kootenay-Summit-View-Mt-Ball-Aug-13-2016-2-1024x683--44639_best1_.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/isabelle-peak-near-radium-hot-springs-bc-12507",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 4,
        "Time": "10 hrs",
        "Total Distance": "20 km",
        "Town": "Radium Hot Springs, BC",
        "Type": "out-and-back"
    },
    "title": "Isabelle Peak",
    "trail_id": "12507"
}