{
    "description": "This short, but quite steep trail, offers a robust workout on a well maintained path resulting in access to a long, beautiful mountain top ridge. The trail yields amazing 360 views of the Purcell and Rocky mountains as well as the Columbia valley.  The hiker could easily spend several more hours hiking ridges toward Mt Cadiz overlooking Toby Ck Valley.  while only approx 3.2 km one way, be prepared for a very strenuous climb of about 2000' over the first 2.2 km, but then a quite gentle ridge climb for the next 1.0 km.  The trail is well maintained with a lovely spring water source about 700 m up the trail.  The path winds a long way up the hill following the base of a long, boulder slope before entering sparse but beautiful larch filled meadow areas.  The route is very obvious but npot heavily marked on up on the ridge. Just be aware of where you came up and you'll find your way back to the path again.  Views are excellent, with vistas of Mt Nelson, Assiniboine, Panorama resort and Invermere.Be mindful this long, unassuming ridge top is approximately 8200' elevation at the summit. It's a long way up.",
    "directions": "Drive from the Conrad Kain memorial in Wilmer BC along the Bruce FSR past lake Enid. You'll see the big, imposing Mt Bruce Monolith on your left from time to time. The road winds up a reasonably surfaced route for about 24 km eventually passing the Ryan Mine sign.  It's a popular trail and the route is fairly obvious",
    "geohash": "c2vr",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/12501/long_mt-bruce-small02-55777.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12501/long_mt-bruce-small05-55777.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12501/long_mt-bruce-small08-55777.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12501/long_mt-bruce-small13-55777.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12501/long_mt-bruce-small16-55777.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12501/reg_mt-bruce-small20-55777.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12501/reg_mt-bruce-small25-55777.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12501/narrow_mt-bruce-small03-55777.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12501/narrow_mt-bruce-small23-55777.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mt-bruce-near-invermere-bc-12501",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "6 km",
        "Town": "Invermere, BC",
        "Type": "out-and-back"
    },
    "title": "Mt Bruce",
    "trail_id": "12501"
}