{
    "description": "Edwards Rating: II (III) M M4 to 8 hoursElevation of 1007 m NET, 1100 m TOT & max 2587 mGPS track drawn on Google Earth after we completed it.Completed on August 19 2016, dry conditions. If you have bikes, you could save some time and energy on the dirt road for probably 6-7 km return.*****This is a very nice scramble and the most complicated thing might have been getting to the trailhead even though some interesting route finding is required close to the summit. I broke my IPhone the day before in a rain/hail storm so all data and the GPS track are estimates only. This is a moderate scramble with no obvious trail at some point and one section of climbing on a 5 metres red rock band.We walked to the gate and kept going on the dirt road until we arrived to an intersection with a road going up to the ridge on our right. We followed that road until it turns 90 degrees to the right and left it there going down the ditch on our left and up the grassy slope to a first high point. After a short break, we walked towards Victoria Peak and started our ascent staying on the crest as much as possible circumventing to the left if necessary. When we got close to the highest point of that crest (there?s a window at that point and exposed climbing), we turned left and lost about 10-15 metres of elevation to find a solid red rock band to climb on and get to the next rubbly slope. We then saw a weakness up large grey rocks on our left and reached the summit soon after. The views were really nice especially Castle Peak with its impressive pinnacles and wide cliffs.We went down the other way around heading to the left early in a rubble slope trying to find some scree to make it easier. After about 10 minutes, we finally got good scree and lost most of our elevation going down a drainage. We should have stayed higher there to avoid a cliff/waterfall close to the end of that drainage. We had to do some pretty bad bushwhacking for less than 5 minutes sidesloping to the left and we found a good trail bringing us down to another official trail. We turned left and followed that trail until we got back to the road and kept going straight to our car. The colours of the rocks there are stunning and just that is worth a visit. There are a lot of ridges and scrambles to do around here and Nugara says in his book that it is a must late in the season with the larches turning to gold.",
    "directions": "From Pincher Creek roundabout, take AB-6 S towards Waterton for about 22.3 km, turn right on Township Rd 43A (Shell Waterton Complex Rd) and continue on this road for about 9.2 km. At the junction with the Forest Reserve sign, turn left and continue for about 5.5 km. Park at the clearing to the left, about 100 metres before the gate.",
    "geohash": "c2yb",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/12508/long_Victoria-Peak-Loop-Beaver-Mines-Welcome-Aug-19-2016-1-1024x505--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12508/reg_Victoria-Peak-Loop-Beaver-Mines-Col-Aug-19-2016-2-1024x683--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12508/reg_Victoria-Peak-Loop-Beaver-Mines-Col-Aug-19-2016-3-1024x683--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12508/reg_Victoria-Peak-Loop-Beaver-Mines-Finally-some-Scrambling-Aug-19-2016-2-1024x683--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12508/reg_Victoria-Peak-Loop-Beaver-Mines-Our-Route-Aug-19-2016-1024x807--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12508/reg_Victoria-Peak-Loop-Beaver-Mines-Stunning-Colours-Aug-19-2016-1-1024x683--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12508/reg_Victoria-Peak-Loop-Beaver-Mines-Stunning-Colours-Aug-19-2016-2-1024x700--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12508/reg_Victoria-Peak-Loop-Beaver-Mines-Stunning-Colours-Aug-19-2016-3-1024x683--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12508/reg_Victoria-Peak-Loop-Beaver-Mines-Summit-View-Castle-Peak-Aug-19-2016-1024x683--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12508/narrow_Victoria-Peak-Loop-Beaver-Mines-Too-Exposed-Finding-Another-Way-Aug-19-2016-683x1024--44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/victoria-peak-loop-near-pincher-creek-ab-12508",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 4,
        "Time": "7 hrs",
        "Total Distance": "15 km",
        "Town": "Pincher Creek, AB",
        "Type": "out-and-back"
    },
    "title": "Victoria Peak (Loop)",
    "trail_id": "12508"
}