{
    "description": "Edwards Rating: III (IV) L L10 to 14 hoursElevation of 931 m NET, 2072 m TOT & max 2555 m on Nihahi summit (2500 m Compression summit)Completed on August 27, 2016 in dry conditions.2 cars are required.*****I did several traverses this year but this one killed me with its gains and losses of elevation well over 20 times along the two ridges. This is a difficult scramble overall but very few route finding is involved as long as you stick to the ridge. It involves some down climbing and the crux would be the exposure in some sections before Compression Ridge summit.From the day use parking lot in the campground, we walked down the road until we saw the sign for Nihahi Creek on the right. We took that trail and came across at least three forks where we took the right trail every time except the last one closer to the ridge where we went left to stay higher. The trail goes along a rock band that we climbed at GR 484299 for some unnecessary difficult but fun hands-on. We soon got back onto the main trail by following that section of the ridge and went up a crack on another rock band leading to a scree slope. We soon reached the beginning of the ridge and stayed directly on it for all the traverse. You can lose elevation to the left to avoid some elevation gain overall and 2-3 down climbing sections but we thought it would be nicer to stay on it for a more enjoyable scramble. Once at highest point (GR457362), we kept going to the left and followed the C-shaped Compression Ridge. Most of it is actually easy until we got to some moderately exposed slabs on the right side of the ridge. Past that section is the rock fin that might be the crux as you got to use a ledge on its right exposed to a 10-15 metres drop and an even more impressive cliff on the left. We down climbed to the right at the end of the rock fin and walked over a 2-3 metres wide ridge with that impressive cliff on our left. It was quite straight forward to the summit (GR435382) after that. We then kept going to complete the ridge walk avoiding some sections of the ridge by circumventing huge pinnacles to the right. We passed the two beautiful windows and finished the ascent of the eastern peak. We started walking north sidesloping to the left as we wanted to avoid gaining more elevation at that point. We started to lose elevation at GR450393 descending west and toward a small drainage. We went to the right quite a bit and found a weakness in a rock band and completed the descent of that slope. Going right in that drainage, we followed it until we got to Canyon Creek and turned right for about 45 minutes of hiking back to the car. I didn?t necessarily enjoy doing the whole traverse at once and would probably do them separately if I go back again.",
    "directions": "CAR 1: From Calgary, follow Trans-Canada Highway/AB-1 W, take exit 161A for AB-22 S toward Bragg Creek/Redwood Meadows and go south for about 22 km. Turn right on AB-66 W and drive another 27 km to Powderface Trail junction and continue on that road to the right for about 14.1 km to park on the right side of the road at GR459419.CAR 2: From car 1, drive back on Powderface Trail to the junction and turn right and drive about 1.2 km to the Elbow River parking lot. You can also turn right on the campground road just before the entrance and park at the day use area (sign and 5-6 parking spaces). You will save about 1 km of hiking.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/12515/long_Nihahi-Compression-Ridges-From-Mt-Glasgow-Kananaskis-on-June-4-2016-1024x438--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12515/long_Nihahi-Ridge-Traverse-Kananaskis-Sunrise-Aug-27-2016-2-1024x348--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12515/long_Nihahi-Ridge-Traverse-Kananaskis-Sunrise-Aug-27-2016-3-1024x246--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12515/reg_Compression-Ridge-Kananaskis-Window-1-Aug-27-2016-3-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12515/reg_Compression-Ridge-Kananaskis-Window-2-Aug-27-2016-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12515/reg_Nihahi-Ridge-Traverse-Kananaskis-Aug-27-2016-2-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12515/reg_Nihahi-Ridge-Traverse-Kananaskis-Aug-27-2016-6-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12515/narrow_Compression-Ridge-Kananaskis-Crux-Aug-27-2016-2-667x1024--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12515/narrow_Nihahi-Ridge-Kananaskis-Jan-Creating-a-Crux-Aug-27-2016-793x1024--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12515/narrow_Nihahi-Ridge-Traverse-Kananaskis-Moderate-Down-Climbing-Aug-27-2016-590x1024--44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/nihahi-compression-ridges-traverse-near-kananaskis-ab-12515",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 4,
        "Time": "12 hrs",
        "Total Distance": "23 km",
        "Town": "Kananaskis, AB",
        "Type": "out-and-back"
    },
    "title": "Nihahi & Compression Ridges Traverse",
    "trail_id": "12515"
}