{
    "description": "This is a 13 km loop with a 500 m elevation gain, IF you walk up from the Austin Pass visitors' centre or the overflow parking lot along the Wild Goose Trail to Artist Point. I suggest you hitch-hike the 3 kms from one of these parking lots to Artist Point, and do the  hike clock wise, to avoid the very long climb up to Herman Saddle at 1740 m elevation.From Artist Point (the very end of WA State Hway 542, el 1660 m.), head west for 2 kms along the Ptarmigan Ridge trail with its incredible views of both Mt Baker (ahead of you, to the SW, and Mt Shuksan, behind you to the east). At the post (el 1675 m), turn right for the Chain Lakes trail and commence the circuit. You'll first go by tiny but pretty Mazama Lake, up a short slope to stunning Iceberg Lake, surrounded by very high mountainous walls, followed by warmer Arbuthnet and Hayes lakes, these last 3 forming the Galena Chain Lakes.There is camping at Mazama and Arbuthnet Lakes. From this side , the climb up to Herman Saddle is 200 m. This is followed by the long (5 k) downhill to Bagley Lake and Creek, around huge boulders from old landslides. You can cross over the pretty arch bridge up to the Austin Pass visitors centre, or walk approx. 1.5 k. north along either side of Bagley Creek to the old dam. If you parked in the overflow parking lot, your car will be here, if you parked at the visitors' centre, you'll have to walk back south approx. 1.5 k.  If you parked at the visitors centre, walk along Bagley Creek on the west side, cross over the dam, and walk back along the east side, then up to your car at the Austin Pass visitors' centre.",
    "directions": "WA State Hway 542 eastbound all the way past the Heather Meadows ski centre, and look for the overflow parking lot on your right or the Austin Pass visitors' centre approx. 500 m farther. Don't forget to purchase your $5 day pass (1 pass/day/car) from either the Ranger station at Glacier or on your left just before the Heather Meadows ski centre.",
    "geohash": "c29m",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/WA/12512/long_P1220496sm-7359.jpg",
        "https://trailpeak.com/storage//content/trails/US/WA/12512/long_P1220507sm-7359.jpg",
        "https://trailpeak.com/storage//content/trails/US/WA/12512/long_P1220511sm-7359.jpg",
        "https://trailpeak.com/storage//content/trails/US/WA/12512/long_P1220524sm-7359.jpg",
        "https://trailpeak.com/storage//content/trails/US/WA/12512/long_P1220531sm-7359.jpg",
        "https://trailpeak.com/storage//content/trails/US/WA/12512/long_P1220542sm-7359.jpg",
        "https://trailpeak.com/storage//content/trails/US/WA/12512/long_P1220546sm-7359.jpg",
        "https://trailpeak.com/storage//content/trails/US/WA/12512/long_P1220549sm-7359.jpg",
        "https://trailpeak.com/storage//content/trails/US/WA/12512/reg_DSC05790-42566_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/US/WA/12512/reg_DSC05792-42566.jpg",
        "https://trailpeak.com/storage//content/trails/US/WA/12512/reg_DSC05795-42566.jpg",
        "https://trailpeak.com/storage//content/trails/US/WA/12512/reg_DSC05796-42566.jpg",
        "https://trailpeak.com/storage//content/trails/US/WA/12512/reg_DSC05798-42566.jpg",
        "https://trailpeak.com/storage//content/trails/US/WA/12512/reg_DSC05799-42566.jpg",
        "https://trailpeak.com/storage//content/trails/US/WA/12512/narrow_P1220497sm-7359.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/galena-chain-lakes-near-maple-falls-wa-12512",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 4,
        "Time": "4 hrs",
        "Total Distance": "13 km",
        "Town": "Maple Falls, WA",
        "Type": "out-and-back"
    },
    "title": "Galena Chain Lakes",
    "trail_id": "12512"
}