{
    "description": "Edwards Rating: III (V) M S4.5 to 7 hoursElevation of 792 m NET, 835 m TOT & max 2536 mCompleted on Sept 5 2016, dry conditions.A helmet is a must here, should have brought mine.Powderface Trail closure: Dec 1-May 15*****This is rated as a moderate scramble but very difficult when climbing the gully right under the summit as per my GPS track. The crux and also the rock bands up to the col made it a very nice scramble. As this was my second time around here, it was easy and straightforward to get to the col but it might be confusing sometimes as it is not always an obvious/well defined trail. From the car, I walked back down 300 metres on the road and turned left down the forest at the cairn (GR439468). I followed a decent trail leading me to the right and across a stream. The trail stays on the right side of that first cutline until it goes right again and across a creek. Now following a trail to the left of a second cutline until it goes back left and across that same creek (GR428459). This creek/drainage is very important and you should stay close to it as it brings you pretty much to the col. Another thing is that you should have in sight Tiara Peak almost all the time being right in front of it or slightly to its left otherwise. Following a faint trail to the left of that creek, it eventually dries out and I started to use the drainage itself going in and out when there was a good trail on the left. I arrived at a fork (GR418458) and used the right one. Reaching a pile of dead trees, I circumvented it on the right but stayed low and kept going into the drainage to take the left fork (GR411461) this time and start my ascent to the col using great rock bands. Eventually I started to sideslope on the left (GR406460) to reach the col closer to Tiara Peak. I turned left and hiked to the summit block. I then went to the left side of it and almost immediately saw the difficult gully to climb to my right (GR405453). I laughed at first thinking it would be difficult but totally doable but I actually tried about 4 different lines and spent about 20-30 minutes wondering what I was going to do in the first 10 meters before I finally decided to do one tricky climbing move on the right side. Holds are either bad, small or nonexistent and rock falls are frequent. There are loose rocks, debris, slippery dirt and ledges to cross from one side to another. Past that climbing move that was the crux for me, I scrambled up to the left using a little chimney of dirt and scree holding on a few good rocks on both sides. I then crossed again to the right on a ledge and climbed the last portion, a rock band with some unstable scree above. I finally saw the summit cairn and hiked to it easily for the last part.Going down the moderate route was easy and quick on the SW slope with two good scree trails. It brought me to the left at some point and below the cliffs of the summit block with nice and huge pinnacles in front of me (GR405452). I came back on the eastern side of the summit block but went down the first scree slope right in between two huge pinnacles again (GR406452). Using some decent scree when possible, I ended up going more on the left side on easier terrain and completed the descent to a small drainage (GR414452). I turned left and reached back the main drainage to come back the same way from there.",
    "directions": "From Calgary, follow Trans-Canada Hwy/AB-1 West and take exit to Sibbald Flats, Highway 68 South. Drive 23 km to and turn left on Powderface Trail. Start your odometer for about 14.6 km and park on the right side of the road (GR439465). Walk back on the road for about 300 m and the trailhead will be on your left.",
    "geohash": "c3n",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/12528/long_Tiara-Peak-Attempt-Kananaskis-Impressive-Avalanche-Debris-JUN-3-2017-1024x408--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12528/long_Tiara-Peak-Kananaskis-Gully-Crux-Sept-5-2016-1-1024x596--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12528/long_Tiara-Peak-Kananaskis-Ridge,-Belmore-Brown-Behind-Jun-29-2019-900x368--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12528/long_Tiara-Peak-Kananaskis-Summit-Panorama-with-Marry-Jun-29-2019-900x207--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12528/long_Tiara-Peak-Kananaskis-Summit-View-Belmore-Browne-Boundary-Ridges-Sept-5-2016-2-1024x339--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12528/reg_Tiara-Peak-Attempt-Kananaskis-Fun-Steep-Rock-Bands-to-Scramble-JUN-3-2017-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12528/reg_Tiara-Peak-Attempt-Kananaskis-JUN-3-2017-3-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12528/reg_Tiara-Peak-Kananaskis-Gully-Crux-Sept-5-2016-2-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12528/reg_Tiara-Peak-Kananaskis-Long-Descent-Along-Waterfalls-Jun-29-2019-900x675--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12528/reg_Tiara-Peak-Kananaskis-Route-Down-Described-Sept-5-2016-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12528/reg_Tiara-Peak-Kananaskis-Summit-Block-from-Col-Sept-5-2016-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12528/reg_Tiara-Peak-Kananaskis-Summit-Sept-5-2016-8-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12528/reg_Tiara-Peak-Kananaskis-Summit-Sept-5-2016-9-1024x683--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12528/reg_Tiara-Peak-Kananaskis-Summit-View-Moose-Prairie-Mnts-Sept-5-2016-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12528/reg_Tiara-Peak-Kananaskis-Welcome-end-Route-Sept-5-2016-1024x683--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12528/narrow_Tiara-Peak-Kananaskis-Sept-5-2016-20-768x1024--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12528/narrow_Tiara-Peak-Kananaskis-Some-Moderate-Exposed-Scrambling-Behind-Jun-29-2019-675x900--44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/tiara-peak-near-kananaskis-ab-12528",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 4,
        "Time": "6 hrs",
        "Total Distance": "11 km",
        "Town": "Kananaskis, AB",
        "Type": "out-and-back"
    },
    "title": "Tiara Peak",
    "trail_id": "12528"
}