{
    "description": "Edwards Rating: II (III) M M5 to 7 hoursElevation of 1268 m NET, 1314 m TOT & max 2837 mCompleted on Sept 10 2016 with some snow patches, rain and snow.A helmet is a must here if other parties are present because of rock falls on the way down.*****I turned back twice in the past because of bear activity, snow conditions and unsure about the warning signs at the bridge and I finally made it. This was more enjoyable as I thought it would be straight up and boring when looking at it from the road. You shouldn?t try this scramble if you need an official trail from the car to the summit. You could easily lose track a few times during this ascent and a GPS track was pretty useful today for me. This is considered a moderate scramble and it is very steep but you can make it difficult with some good hands-on or if you struggle with route finding or when trying to avoid snow patches. Route finding/bushwhacking can be challenging even though some of the flags helped and cairns were good. Someone died in an avalanche a few months ago here so I had that in mind since I was by myself but snow patches were small and avoidable or manageable and I tried to keep it moderate technically because of the rain, snow and extreme wind gusts.From the car I walked down the road and crossed the bridge. I turned left here and stayed on the left side of the road where I saw a faint trail with an orange flag at 350 metres from the bridge approx. (GR291274). I followed that trail going south for a while and got to a first drainage (GR291272) where I turned right and followed it for a bit. I saw a good trail on the other side of the stream (GR287272) after avoiding a bunch of dead trees and used it to go south again and towards the second drainage (GR288270) as per my GPS track and Kane?s book. I turned right and went up to a dried out waterfall. I avoided these walls by going right (GR283267) on a very steep terrain with some good faint trails, staying close to the drainage. Once almost over the tree line, I came back into the drainage (GR281266) and avoided the next rock band on its right. I realized on the way down there was a large ledge to use directly in the drainage and up to the right after such was easier. Once in front of the false summit/crest I cut to the left and followed some cairns/orange flags using rock bands as much as possible to avoid scree and reach that crest. You should stay away from the brownish slope (centre and right) as I saw 2 impressive rock falls while scrambling to the left. On the crest, I stayed mostly to the right (GR278259) sometimes following good cairns but mostly just trying to avoid wet rocks and snow for some fun hands-on scrambling with a bit of exposure. I finally got to the top of that crest and reached the high point in front of me before turning left and completing the ascent with an easy ridge walk. On the way down I found the cairns to be very useful to go back to the tree line and I mostly used ledges going down those rock bands. I made a mistake down there as a flag seemed to indicate another descent route to the left but I never saw another flag after and eventually had to come back to my original trail with some unnecessary bushwhacking. I should have just taken the exact same way down. Same thing down in the forest where I walked a little more by following different faint trails and some flags that didn?t really make sense after all. I liked that scramble with its challenges and awesome views but the descent is painful with bad scree on rock bands and steep terrain.",
    "directions": "From Calgary, follow Trans-Canada Hwy/AB-1 W to Kananaskis Trail/AB-40 S. Take exit 118 and start your odometer for about 41.5 km to the gas station and turn right on Fortress ski area access road. Park on the side of that road before the barricade.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/12537/long_Mt-Lawson-Kananaskis-Sept-10-2016-8-1024x394--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12537/long_Mt-Lawson-Kananaskis-Summit-View-Kananaskis-Lakes-Sept-10-2016-2-1024x554--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12537/long_Mt-Lawson-Kananaskis-Summit-View-Sept-10-2016-1024x231--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12537/reg_Mt-Lawson-Kananaskis-Good-Scramble-on-Crest-Sept-10-2016-2-1024x683--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12537/reg_Mt-Lawson-Kananaskis-Green-and-Pink-Tree-wow-Sept-10-2016-1024x641--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12537/reg_Mt-Lawson-Kananaskis-Ridge-Walk-View-Denny-Potts-Evan-Thomas-Packenham-Sept-10-2016-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12537/reg_Mt-Lawson-Kananaskis-Sept-10-2016-3-1024x695--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12537/reg_Mt-Lawson-Kananaskis-Summit-View-Kent-Kananaskis-Lakes-Sept-10-2016-1-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12537/reg_Mt-Lawson-Kananaskis-Superb-Rainbow-Sept-10-2016-1-1024x675--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12537/reg_Mt-Lawson-Kananaskis-Welcome-Route-Sept-10-2016-1024x768--44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mount-lawson-near-kananaskis-ab-12537",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 3,
        "Time": "6 hrs",
        "Total Distance": "10 km",
        "Town": "Kananaskis, AB",
        "Type": "out-and-back"
    },
    "title": "Mount Lawson",
    "trail_id": "12537"
}