{
    "description": "Located on the south rim of the Grand Canyon of the Yellowstone River, this trail has a great combination of views of the canyon, Ribbon Lake, open meadows with a small herd of bison, and open forest.We started at Uncle Tom's Point, just east of the Chittenden Bridge, near the Lower Falls, headed east all the way to Ribbon Lake, and circled back south and east along the Wapiti Lake trail.Make sure you go down (and back up) the 354 stairs to Uncle Tom's Point for great views of he Lower Falls (93 m vs only 33 m for the Upper Falls) on the Yellowstone River. This is the start of the Grand Canyon of the Yellowstone River, very spectacular with great formations and colours.The \"walk\" to Artist Point is approx. 1.5 kms, but very spectacular, along the river and canyon. The walk to Ribbon Lake is through forest, and the lake is beautiful, with wonderful spots to relax and have lunch. From the lake, follow the direction to \"Wapiti Lake\" trail, and then west on Wapiti Lake trail back towards the start. This will take you through open forest, but also wide open meadows, with a small herd of bison. When we went through, the bison were 200-300 m south of the trail, but we heard it had been right along the trail earlier in the day, and that the bull charged a horse shortly before we went through. Be careful, bison are wild animals, very large and unpredictable. They can cause serous injury. Give them a wide berth.At the junction with the Clear Lake trail, we turned northeast towards it, and then northwest to Uncle Tom's Point. However, to extend your hike approx 2 kms, continue west on the Wapiti Lake trail to Chittenden Bridge to get a closeup look of the Upper Falls, and then northwest along the river back to Uncle Tom's Point.",
    "directions": "At \"Canyon\" in Yellowstone NP, turn south, go past the North Rim entrance, to Chittenden Bridge, turn left (east) across that bridge and drive approx. 1 km to Uncle Tom's Point parking lot and trail head. The trail starts at the washrooms, where you turn right and follow the signs and trail. The stairs down to Uncle Tom's Point are approx. 600-700 m down the trail. Despite the 354 stairs down and then back up, it's worth the effort and the 15-20 minutes or so.",
    "photos": [],
    "source_url": "https://trailpeak.com/trails/ribbon-lake-south-rim-near-yellowstone-national-park-wy-12544",
    "stats": {
        "Activities": "ski-xc hike",
        "From": "",
        "Seasons": "summer fall winter",
        "Stars": 4,
        "Time": "5 hrs",
        "Total Distance": "14 km",
        "Town": "Yellowstone National Park, WY",
        "Type": "out-and-back"
    },
    "title": "Ribbon Lake - South Rim",
    "trail_id": "12544"
}