{
    "description": "Edwards Rating: I (II or III to West summit) L M6 to 8 hoursElevation of 830 m NET, 994 m TOT & max 2689 mCompleted on Sept 17 2016, no snow but rainy-windy day.Bear spray should always be a must even though I don?t mention it but encounters here happen a lot, be bear aware! In summer time, bug repellent will be very useful as well. *****This is an easy scramble (technically) but still almost 20 km so physically a good day, adding one moderate and more exposed step to the lower west peak if you want. I was with a group of 11 people and a dog and we saw many other groups so it is a very popular scramble and the views are spectacular. Still a grizzly bear came straight down to us while we were having lunch down to the lake so make sure you have bear spray with you. I heard lots of stories around here with bear encounters and this grizzly couldn?t care less even if we were a large group. From the parking lot, we followed the obvious old logging road for about 3 km and kept going right at the fork (GR166310). It brought us to Commonwealth Creek and with very nice waterfalls. We kept following that obvious trail along the right side of the creek until we got to the valley. We crossed that valley following the same trail aiming for Mt Birdwood and Smuts col. We finally took some elevation to get to the col on its right. The views here were incredible with Birdwood Lakes, Smutwood ridge/peak up front as well as Mount Smuts to the right. We followed again the obvious trail going left and up to the ridge. Once at the first rock band of the ridge, this is straight forward with again an obvious trail going left sometimes to avoid some climbing or extra elevation and keep this an easy scramble. Passed the false summit and about 150 metres from the summit, there?s a good trail going up to the crest at GR128287 and leading to the summit (GR127288). From there, you can go west and reach an even smaller and a bit lower peak if you?re ok with going over or around a pinnacle for 2 moves of exposed hands-on scrambling. I personally thought it was worth an extra 5 minutes just for this bit of hands-on and down climbing. The colours are incredible during Fall with all the golden larches.",
    "directions": "From Canmore Bow River Bridge, take the Smith Dorrien Trail for about 38.2 km. Turn right on the Engadine Lodge access road for 0.9 km and then turn left to park at the old logging road (GR161332).",
    "geohash": "c3j",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/12551/long_Smutwood-Peak-Kananaskis-Bridwood-Lakes-Smutwood-and-Smuts-Sep-17-2016-2-1024x301--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12551/long_Smutwood-Peak-Kananaskis-Grizlly-Joining-us-for-Lunch-Sep-17-2016-1-622x372--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12551/long_Smutwood-Peak-Kananaskis-The-Fist-and-the-Valley-Sep-17-2016-1024x383--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12551/reg_Smutwood-Peak-Kananaskis-Beautiful-Valley-Sep-17-2016-1-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12551/reg_Smutwood-Peak-Kananaskis-Bridwood-Lakes-and-Smutwood-Sep-17-2016-1-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12551/reg_Smutwood-Peak-Kananaskis-Bridwood-Pigs-Tail-and-Commonwealth-Sep-17-2016-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12551/reg_Smutwood-Peak-Kananaskis-Commonwealth-Creek-Sep-17-2016-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12551/reg_Smutwood-Peak-Kananaskis-Mt-Birdwood-Sep-17-2016-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12551/reg_Smutwood-Peak-Kananaskis-Summit-Sep-17-2016-4-1024x722--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12551/reg_Smutwood-Peak-Kananaskis-West-Summit-Scrambling-Willow-Sep-17-2016-1024x887--44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/smutwood-peak-near-kananaskis-ab-12551",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 5,
        "Time": "7 hrs",
        "Total Distance": "19 km",
        "Town": "Kananaskis, AB",
        "Type": "out-and-back"
    },
    "title": "Smutwood Peak",
    "trail_id": "12551"
}