{
    "description": "Edwards Rating: II (II) L M6 to 9 hoursElevation of 1049 m NET, 1177 m TOT & max 2777 m Completed on September 25, 2016 with winter conditions on the last 3 peaks including the summit. I would consider it rather moderate technically in these conditions because of the wind, snow and ice.Gear: I didn?t use my microspikes but it might be useful in snow conditions and ice axe/crampons might be necessary with more snow. *****This is a beautiful ridge walk with great views of both the prairies and the mountains and a very long but easy approach, no obvious trail sometimes but a straightforward route overall. Bushwhacking is minimal with great faint trails and on a pretty short distance anyway.From the parking area, I crossed the road and turned left into Canyon Creek and walked for about 5.3 km to a treed slope with a visible trail in the middle and a cairn (GR422387). Look at the rib to your left as this is my return route, using that small drainage back to this point. Using faint trails going mostly right up, I got out of the forest quickly but a little too much on the right so I cut to the left and reached a first high point (HP1). I counted 5 peaks overall before the summit. HP2 and HP3 are in line pretty much but it?s going to the left for HP4 (GR417358) and then I turned right to get to HP5 (GR415352) and the summit (GR418350). The wind was so strong that it would push me out of track sometimes and with the ice and snow on HP4-5-summit, I stayed on the ridge and took extra elevation to avoid a trail sidesloping to the right of HP4 and over a cliff. On the way back, I did sideslope on a trail from the summit to HP5 and kept my elevation from there to pass under HP4 and keep going right to continue this nice ridge walk towards Compression Ridge. When I reached the small rib just before Compression, I turned left (GR427364) and scrambled down rock bands for a while. Once past these rock bands I looked to my left to get some decent scree (GR426368) and reached the small drainage down there quickly. There was 3 dried out waterfalls that I could easily avoid to the left. I actually really liked that route down as this drainage was mostly dry slabs. It brought me back straight down to Canyon Creek and all the way back to the car from there. Even though it is a long approach in a drainage and the return is painful, I think this is worth a visit and one of the nicest easy (technically) scramble I have done.",
    "directions": "From Calgary, follow Trans-Canada Highway/AB-1 W, take exit 161A for AB-22 S toward Bragg Creek/Redwood Meadows and go south for about 22 km. Turn right on AB-66 W and drive another 27 km to Powderface Trail junction and continue on that road for about 14.1 km to park on the right side of the road at GR459419.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/12558/long_Mount-Howard-Kananaskis-Ridge-Walk-Route-Sep-25-2016-1024x300--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12558/long_Mount-Howard-Kananaskis-Route-from-Canyon-Creek-Route-Sep-25-2016-1024x371--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12558/long_Mount-Howard-Kananaskis-Summit-Sep-25-2016-2-1024x552--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12558/long_Mount-Howard-Kananaskis-Summit-Sep-25-2016-6-1024x221--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12558/long_Mount-Howard-Kananaskis-View-Bryant-Bryant-East-Sep-25-2016-1024x416--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12558/reg_Mount-Howard-Kananaskis-Ridge-Walk-Crazy-Wind-Gusts-Sep-25-2016-1024x683--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12558/reg_Mount-Howard-Kananaskis-Ridge-Walk-Sep-25-2016-10-1024x683--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12558/reg_Mount-Howard-Kananaskis-Ridge-Walk-Sep-25-2016-2-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12558/reg_Mount-Howard-Kananaskis-Ridge-Walk-View-Summit-Sep-25-2016-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12558/narrow_Mount-Howard-Kananaskis-Only-animal-I-have-seen-today-Sep-25-2016-768x1024--44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mount-howard-near-kananaskis-ab-12558",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 4,
        "Time": "8 hrs",
        "Total Distance": "21 km",
        "Town": "Kananaskis, AB",
        "Type": "out-and-back"
    },
    "title": "Mount Howard",
    "trail_id": "12558"
}