{
    "description": "This is one of those falls which I had marked on my gps but I cannot remember where I got the original information.   The start of the hike is in an old pastoral field.   You follow a well established ATV path and go by numerous apple trees in the abandoned fields.  The area around the stream is very flat so any falls on this river will come at a surprise.Following the ATV path, I came up to a Y intersection.  I went to the right but then had to come back and bushwhack to the river.   At the intersection take a left instead.  Walk approximately 300m.  At this point the road will start veering further away from the river.  You might also hear a waterfall.  the first fall is a a drop of about 4feet.  Continue by the side of the river to a sharp bend of the river.  A very small fall or rapid occurs here but the rock outcrop and towering evergreens make it a nice spot.  From then on, you might have about 200m to go to the largest fall.  In late September, the water was channelized over the rock outcrop into 4 different slider type fall.  the pool at the bottom seems deep enough for a swim.  I did notice a camp site by the side of the river and a road of some type coming in from the east side of the river which probably means that there might be an easier way to get top this place.",
    "directions": "Highway 104, east of Antigonish.  Take New France Road and continue on it for approximately 4.8km and turn right on a dirt road at  45°33'50.56\"N,  61°44'21.74\"W.  If not driving a high clearance vehicle , park at the start of the dirt road.  The falls are at;  45°34'24.22\"N,  61°43'46.93\"W",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/12564/reg_DSC-0058-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12564/reg_DSC-0064-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12564/IMG7357.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/afton-river-fall-near-antigonish-ns-12564",
    "stats": {
        "Activities": "hike snowshoe",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 2,
        "Time": "1 hrs",
        "Total Distance": "3 km",
        "Town": "Antigonish, NS",
        "Type": "out-and-back"
    },
    "title": "Afton River Fall",
    "trail_id": "12564"
}