{
    "description": "Edwards Rating: II (III) M M6 to 10 hoursElevation of 1215 m NET, 1275 m TOT & max 3037 m Completed on October 2, 2016 with snow over 2000 metres. Great one for a late season scramble.Gear: Microspikes might be useful as well as an ice axe for late season ascent. *****I think this is a perfect late season scramble with an easy route that was totally manageable even though snow covered (descent route in Nugara?s book). Nugara?s moderate ascent route had snow and ice with greater exposure so I didn?t even try it but I would still rate today?s scramble as moderate in these conditions as it becomes very steep for the last 200 metres. The approach is long but can be hiked quickly as there is a good trail all the way up to the valley. Maybe it was because of the perfect conditions, stunning views with lower clouds and sunshine but I really liked that one.From the parking lot, I followed the trail behind the outhouse to the metal gate. I turned left at the fork and kept going for just under 2 km. I then took the right fork at the cairn (GR232249) and got to a first tarn under what some people call Mount Chestmill (GR247266). At the end of the tarn, I saw two cairns in a stream and turned right into the forest but it was a mistake. I bushwhacked a few minutes and came back down to that stream, crossed it and found back the trail 5 minutes later. I should have looked to my left as there was several cairns showing me the way, such I realized only when I returned. I saw other trails going to the right (orange or pink flags) that might go up to the valley but I stayed on the one that was the most obvious and staying close to a creek. After having gained quite a bit of elevation the trail goes to the left along a cliff band (GR251273) with a waterfall and then up right into the valley. I hiked all the way to the end passing a few tarns, got very close to James Walker-Inflexible col and I turned left to start hiking up a steeper slope. Once at the plateau, I stayed to the right and closer to the ridge but it got much steeper towards the end so I left the edge as it was slippery sometimes and a fall there could have been fatal. The summit was to my right by the time I got to a narrower ridge at the skyline (GR254296). The views were absolutely stunning with Chester, Galatea or The Fortress on one side and Opal, Evan-Thomas, Hood, inflexible, etc. on the other side. And this was the warmest time of the day!Going down the same way and once past the steepest part, I used the steeper snow patches in the middle to go down the slope quickly and by the time I got back to the valley most of the snow had melted. I stayed as low as possible and walked along the tarns this time to avoid the rubble slope but got too far and eventually got cliffed out at this cliff band I circumvented on my way up. I walked up to the right along it and used the first weakness to down climb what was more of a rock band at that point and reached back the trail just a few metres below.",
    "directions": "From Calgary, follow Trans-Canada Hwy/AB-1 W to Kananaskis Trail/AB-40 S and take exit 118. Drive south for about 50 km and turn right on Kananaskis Trail/AB-742. Drive 2.2 km to the Smith Dorrien Trail junction and turn right for another 14 km to the sawmill parking lot sign and turn right.",
    "geohash": "c3n",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/12566/long_Mt-James-Walker-Kananaskis-View-James-Walker-to-Inflexible-Oct-2-2016-1024x223--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12566/reg_Mt-James-Walker-Kananaskis-Beautiful-Valley-Oct-2-2016-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12566/reg_Mt-James-Walker-Kananaskis-Beautiful-Valley-and-Tarns-Oct-2-2016-2-1024x683--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12566/reg_Mt-James-Walker-Kananaskis-Beautiful-Valley-and-Tarns-Oct-2-2016-7-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12566/reg_Mt-James-Walker-Kananaskis-Beautiful-Valley-and-Tarns-Oct-2-2016-9-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12566/reg_Mt-James-Walker-Kananaskis-Finally-the-Summit-Shows-up-Oct-2-2016-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12566/reg_Mt-James-Walker-Kananaskis-Routes-Oct-2-2016-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12566/reg_Mt-James-Walker-Kananaskis-Summit-Oct-2-2016-13-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12566/reg_Mt-James-Walker-Kananaskis-View-Pakenham-Hood-Brock-Blane-Oct-2-2016-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12566/narrow_Mt-James-Walker-Kananaskis-Steep-Slopes-to-Summit-Oct-2-2016-2-768x1024--44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mount-james-walker-near-kananaskis-ab-12566",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 4,
        "Time": "8 hrs",
        "Total Distance": "18 km",
        "Town": "Kananaskis, AB",
        "Type": "out-and-back"
    },
    "title": "Mount James Walker",
    "trail_id": "12566"
}