{
    "description": "I wished I lived in Cape Breton!  This is what I was thinking when I rounded one last bend of a brook and came face to face with an unknown 70ft plus waterfall.During the winter months, I often pour over the satellite imagery of places I would like to explore in the upcoming year.  Near NE Margaree, I was looking at some deep valleys around the Twelve O'clock Mountain.  You don't hear of a lot about exploring out in this part but its just a few minutes from the Cabot trail.  I soon spotted a hole in the canopy which meant either a waterfall or nothing at all! In October 2016, I took the gamble and visited the hole in the canopy.  Setting off from the Mt Pleasant - Big Brook Rd I turned on a secondary road approximately 1km past the Stubbard Rd.   The road is gated so I left my vehicle there and started hiking.  after about 800m on a straight and well maintained dirt road, I turned right on a smaller road.  If I would have continued 150m, I would have crossed Tompkins Brook.   The smaller road went uphill a bit and almost looked like it terminated in a logged area at the base of the mountain.  However, there was a smaller and fainter woods road going to the left.I followed the road to the left and soon had ferns and brambles up to my waist.  soon the trail started to climb uphill but I left the main track and went to the brook on the left instead.  The road does continues alongside the Tompkins Brook almost all the way to the fall.  It crossed the brook numerous times.  some of the areas on the Tompkins are absolutely gorgeous with moss covering all the rocks and smaller cascades all around.  You have about 1.5km  in the valley to the main fall.   Trees in this valley have grown to gigantic sizes.  Just before the main fall, there is a multi tier 20ft fall.  I could actually climb in it as there wasn't much water.  Once passed this fist fall, you will be faced with the main fall.  There is a slide part on the right of the fall about 25ft up that was carved by the force of the water into almost a cave like perch.  If I had some rope and someone else with me, I might have tried to get into it.  You can climb the hill on the right hand side to get some birds eye view of the fall and also to see another 15 footer further upstream.   There could be more falls further upstream as I only went up to the 200m contour where the top of the mountain culminates at 400m but I had to turn back at this point",
    "directions": "Cabot Trail to NE Margaree.  Turn on Mt Pleasant - Big Brook Rd.   I turned on a secondary road on your left approximately 1km past the Stubbard Rd.",
    "geohash": "f8hx",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/12567/reg_DSC-0138-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12567/reg_DSC-0134-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12567/reg_DSC-0140-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12567/reg_hole-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/tompkins-brook-falls-near-cheticamp-ns-12567",
    "stats": {
        "Activities": "snowshoe hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 5,
        "Time": "2 hrs",
        "Total Distance": "7 km",
        "Town": "Cheticamp, NS",
        "Type": "out-and-back"
    },
    "title": "Tompkins Brook Falls",
    "trail_id": "12567"
}