{
    "description": "Humes River Fall has been on my list of places to go for a while now.   I had noticed a spot on the First Branch that looked like it could have a fall.  this was later confirmed by some pictures I saw posted on facebook.  A little while later, someone sent me a map of the trails being developed to get to the fall.The first 3km of the trail is the continuation of the Humes Rear Rd as it becomes narrower and ultimately an ATV/ snowmobile trail.  There is a loss of elevation at fist to a large wooded bridge over MacNaughton Brook  (btw there is another fall on this brook but I didn't have enough time to see it).  I used my mtn bike for the first 3km to speed things up.After the first bridge, you cross another smaller one and then uphill to a Y intersection.  Go to the right.  From now on and until the wooded trailhead, the road goes steadily uphill.  There are lots of markers in the tress on the left of the road and the trail really begins here.  At first you will go pass an old rock wall and rock foundation, the trail then ascends the small hill behind the structure.The first 1km or so has been cleared of trees and dug in places to make way for the trail.  Afterward, the trail is flagged but nothing else has been done yet (October 2016).  The flagged route will go down one small valley (First Branch Humes River), go back up the hill and finally make it to the fall on the second branch.  The walking was not easy but not hard either.  There is some undergrowth and thickets of evergreen in some spots.Finally you will arrive at the op of the ravine and yo can now hear the roar of the river.  The slope is moderate to get to the base of the fall.  At the base of the fall is quite a large area to relax, eat and just contemplate this beauty.  Facing the falls, to the left of it, there are some large cliffs that with a cleaning would be good for climbing.",
    "directions": "Highway 105 to Waycobah and/or Nyanza.  Take the Humes Rear Rd and park at the end of it near the modern building and baseball field.  start walking/biking/snowshoeing....",
    "geohash": "f8hw",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/12568/narrow_DSC-0110-27177_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12568/narrow_DSC-0103-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12568/narrow_DSC-0115-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/humes-river-fall-near-baddeck-ns-12568",
    "stats": {
        "Activities": "mtn-bike hike snowshoe climb",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 5,
        "Time": "2 hrs",
        "Total Distance": "11 km",
        "Town": "Baddeck, NS",
        "Type": "out-and-back"
    },
    "title": "Humes River Fall",
    "trail_id": "12568"
}