{
    "description": "This is an area of Nova Scotia I have been exploring for a while.  Between New Glasgow and Antigonish, on the north side of highway 104, are a couple of hills that are called Aulds mountain on some maps.  I started to be interested in these mountains because of a story I was told.  One of the first white settlers in the area, Barnabas McGee, supposedly survived his first winter in the area by hiding out in a cave.   So this is basically what I had for information.....  There are some old maps showing who owned the land back then and didn't I see his name on a plot of land atop Aulds Mountain.  My next step was to look at some geological map of the area and wasn't there a small pocket of different geology on the west side of a small stream valley by Aulds Mountain... BTW I explore a lot for caves too and I know of some off Browns Mountain so this search wasn't for those.There is an old logging road that starts at the CH.  I followed it to the foot of the mountain and then bushwacked my way on one side of the ravine and then on the other side.  I went looking for the small pocket of different geological units and did find some rock outcrops at the edge of Aulds Mountain.   However I did not find any caves!!!!   The view at the top is pretty decent in the fall but must be spectacular once the leaves have fallen.  The search for Barnabas's cave continues and hopefully anybody out there that has some info can drop me an email!",
    "directions": "On highway 104 going east from New Glasgow.  There is a dirt road leading to Aulds Mountain located 3.7km after you cross over the old highway 4 passed French River.  If driving west, the dirt road is located 1km after you cross over Barneys River West side",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/12565/reg_DSC-0069-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12565/reg_DSC-0072-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12565/reg_DSC-0074-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12565/reg_DSC-0075-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12565/reg_DSC-0079-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12565/reg_DSC-0080-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/barnabas-mcgee-mystery-near-antigonish-ns-12565",
    "stats": {
        "Activities": "hike snowshoe",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "6 km",
        "Town": "Antigonish, NS",
        "Type": "out-and-back"
    },
    "title": "Barnabas McGee Mystery",
    "trail_id": "12565"
}