{
    "description": "This is one of those hikes I had been dreaming about since the winter.  Of course with the low precipitation we had this summer (2016), I had to bide my time until the fall to set forth on this adventure.It all started when I was looking at some satellite imagery of some rivers in the Roman Valley.  I happened to chance upon a white spot on the Tracadie River in an area that nobody else had reported waterfalls before!  The topographical maps showed bit of elevation changes in that area so I knew there would be something to look at.....I just wasn't sure if it would be spectacular or not (you will have to read to the end of the post to know!)I drove to the end of the dirt road and pulled into a wide turn around spot.  I followed the ATV trail to an abandoned, collapsed, house and then farther up the hill.  At the top of the hill you get a nice view all the way to the west coast of Cape Breton.   From there, I aimed my gps to the fall and bushwacked my way through, at first, a thick regenerated forest.   Then as I made my way closer to the river, the forest opened up just a little bit and I noticed a lot of mushrooms which had just popped out of the ground.Made it to the river in about 15 minutes and then walked upstream a little to the first fall!   The river valley is quite broad but luckily in this area, the river crossed a hard geological formation which creates a two tier fall of about 10 feet.  I then followed the stream further upstream, hoping for some more falls.  The river in this area is quite narrow and you cannot follow it as it has some shear walls on either sides.  At the end of this quasi-gorge feature, there were another sets of falls no more than 5 feet.So the conclusion here is that it was a scenic discovery of some semi-remote, and mostly unknown falls, however it didn't live up to all the expectations I had for a large fall visible from satellite imagery!",
    "directions": "TCH highway.  Drive east on the TCH from Antigonish and take the Big Tracadie/ Monastery Exit.  Drive south on highway 4 and turn right on Highway 16.  Drive approximately 4km south and turn right on Upper Big Tracadie Rd.  Follow it to its conclusion and then aim for the river which is about 300m away.  The first falls are at;  45°32'58.79\"N,  61°35'44.69\"W and the other series at  45°32'52.92\"N,  61°35'48.11\"W",
    "geohash": "f8h5n",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/12563/reg_DSC-0025-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12563/reg_DSC-0026-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12563/reg_DSC-0033-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12563/reg_DSC-0047-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/tracadie-river-falls-near-antigonish-ns-12563",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "4 km",
        "Town": "Antigonish, NS",
        "Type": "out-and-back"
    },
    "title": "Tracadie River Falls",
    "trail_id": "12563"
}