{
    "description": "Edwards Rating: I (I) L M - Mostly a long hike5 to 9 hoursElevation of 731 m NET, 1147 m TOT & Max 2334 mCompleted on October 9, 2016 in winter conditions. Microspikes might be useful on the steeper section up to the ridge as it can be slippery.*****This is pretty much just a hike and only once did I ?scramble? up a rocky peak but rock and footholds were good and maybe I could have avoided it but it was quick an easy that way. No views today and reduced visibility with light but persistent freezing rain. There was about 5 cm of fresh snow and up to 30 cm on some sections of the ridge. It just made it easier to run down. I didn?t have to use my microspikes this time but it can be slippery on the first section of the ridge. As this is a very popular area the problem is not to find a trail but to deal with many of them. As long as you look at the big picture and know where you are heading there should be no problem with that. You can actually see your way up Forgetmenot from the parking lot and the bridge.From the Elbow River parking lot (campground road closed), I walked back to that road past the outhouses and reached the bridge. I crossed it I kept going on the wide trail heading left and soon came across a few other trails to the left. I used one of them to get closer to the river bed and hiked to another wide drainage (GR516291). I crossed that drainage and continued on a wide trail (orange flag). I eventually crossed a creek bed and turned right at the fork (pink flag, GR522295) to start going up the northwest shoulder of Forgetmenot. I got to the open ridge and kept going on a good trail that was easy to follow despite the snow and reduced visibility. I could barely see a 100 metres in front of me so I relied on my GPS more often today. The trail goes through the forest and then out to an open ridge. It then goes to the right and along the ridge for a while until I got to a meadow and a steep slope under a small rocky peak. I hiked up to that peak and scrambled on its left and kept going along the left side of the ridge until I got to a huge cairn (GR549263, Ridge Summit). From there, I went in the wrong direction for a few minutes as I should have just followed the forest staying left. It goes down and back up on a treed section of the ridge and eventually leads to the summit (GR565246). On the way down, it was no problem as I just made sure this time to follow the tree line on my right and went back to the huge cairn. From there, I followed my own footsteps for a while and lost track running down too low so I just came back up progressively to the ridge where the trail goes into the forest before the steepest section. I did the north summit of that ridge last year when the weather was better and I am sure this would be an awesome long ridge walk with nice views on a clear day.",
    "directions": "From Calgary, follow Trans-Canada Highway/AB-1 W, take exit 161A for AB-22 S toward Bragg Creek/Redwood Meadows and go south for about 22 km. Turn right on AB-66 W and drive another 27 km to Powderface Trail junction. Turn left and drive 1.2 km to the Elbow River parking lot. You can also turn right on the campground road (if still opened, just before the parking entrance) and park at the day use area (sign and 5-6 parking available). You will save about 1.2 km of hiking.",
    "geohash": "c3n2",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/12571/long_Forgetmenot-Ridge-Mountain-Kananaskis-Ridge-Oct-9-2016-7-1024x632--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12571/long_Forgetmenot-Ridge-Mountain-Kananaskis-Summit-Oct-9-2016-2-1024x612--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12571/reg_Forgetmenot-Ridge-Mountain-Kananaskis-Drainage-Oct-9-2016-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12571/reg_Forgetmenot-Ridge-Mountain-Kananaskis-Oct-9-2016-13-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12571/reg_Forgetmenot-Ridge-Mountain-Kananaskis-Ridge-Oct-9-2016-2-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12571/reg_Forgetmenot-Ridge-Mountain-Kananaskis-Ridge-Oct-9-2016-4-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12571/reg_Forgetmenot-Ridge-Mountain-Kananaskis-Route-Oct-9-2016-1024x768--44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/forgetmenot-ridge-and-mountain-near-kananaskis-ab-12571",
    "stats": {
        "Activities": "hike snowshoe",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 4,
        "Time": "7 hrs",
        "Total Distance": "23 km",
        "Town": "Kananaskis, AB",
        "Type": "out-and-back"
    },
    "title": "Forgetmenot Ridge And Mountain",
    "trail_id": "12571"
}