{
    "description": "Fortune is a community since resettled some years ago.Not much is left standing now, except an old 2 storey house which has a kitchen/school attached and 3 walls of a shed. The steeple from the church can be seen, though it has since tipped over. The hike offers beautiful views of the coast and Atlantic ocean, Icebergs, whales, and some wildlife. The destination of Fortune is in a small harbour that quickly opens up to the Atlantic Ocean. It is more of a backcountry trek with some wet places and potential bushwhacking. The views and community are worth the effort of the hike!In 1972, The same day Canada won against Russia in hockey, the last family moved out of Fortune. Those families were the Bartlett's, Carroll's, and Byrne's.The initial starting dirt road turns into a dirt trail that may have mud or boggy sections. you'll have to traverse across varying land of the same until you can get on the rocky hilltops, before you descend into Fortune.GPS highly recommended and you can download that data to the right.",
    "directions": "Drive toward L'anse aux Meadows, NL and turn Right at Quirpon. Drive until the road splits 4 ways, turn right. Drive all the way until you hit a dirt road. Park and hike from here!",
    "geohash": "fc0t6",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NL/12574/reg_Fortune-55291.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/12574/reg_Fortune23-55291.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/12574/reg_IMG-3646-55291.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/12574/reg_IMG-3650-55291.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/12574/reg_IMG-3654-55291.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/12574/reg_IMG-3659-55291_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/12574/narrow_Fortune3-55291.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/abandoned-community-of-fortune-near-st-anthony-nf-12574",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 4,
        "Time": "5 hrs",
        "Total Distance": "10 km",
        "Town": "St. Anthony, NF",
        "Type": "out-and-back"
    },
    "title": "Abandoned Community of Fortune",
    "trail_id": "12574"
}