{
    "description": "St. Brendan's Lookout offers Panoramic Views of the surrounding community and Atlantic Ocean. A quick 700m uphill trail will get you here. You can then continue along to Dog Head, the outer most point of St. Lunaire Bay which opens to the ocean. Potential to see Icebergs, whales, moose and boats from here. The wonderful coastal views cannot be discounted.The parts of boardwalk trail to Dog Head have since been worn down by the weather. It needs maintenance, however it looks like it may take a long time for this to happen due to town budgets, etc. Just be careful along this route and you'll enjoy it all.Return via the route taken.About half way through the trail, if you can find it, there is a large boulder with some old inscriptions on it. Doesn't appear to be much, but the carvings are sharp and clear and appear as a jumble of straight lines.  The lines are so clear and narrow they appear to have been made by a metal tool.  The rock has been known to the local folks for decades and no one has claimed to have made the lines.  Local legend suggests that the inscription is likely in Ogham, an Early Medieval alphabet used primarily to write the Old Irish language and that is somehow related to St. Brendan.For more information, please visit: https://nlarchaeology.wordpress.com/2011/05/27/graffiti/ and http://www.cbc.ca/onthego/episodes/2012/07/11/st-brendans-boulder-in-st-lunaire-griquet-may-have-been-carved-by-the-tartessians/",
    "directions": "Head through St. Lunaire-Griquet and stop at the playground near the old school. The trailhead is on the left of the playground. Enjoy!",
    "geohash": "fc0",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NL/12576/reg_IMG-5476-55291.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/12576/reg_IMG-5487-55291.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/12576/reg_IMG-5503-55291.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/12576/reg_IMG-5518-55291.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/12576/narrow_IMG-5496-55291.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/st-brendans-lookout-to-dog-head-near-st-anthony-nf-12576",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "5 km",
        "Town": "St. Anthony, NF",
        "Type": "out-and-back"
    },
    "title": "St. Brendan's Lookout to Dog Head",
    "trail_id": "12576"
}