{
    "description": "Road closure from December 1st to May 14th.Edwards Rating: II (II) M L - Bushwhacking & route finding6 to 11 hoursElevation of 723 m NET, 1108 m TOT & max 2131 m on Volcano Ridge Summit (2111 m Allsmoke Mountain Summit)Completed on October 16, 2016 when mostly dry with snow accumulation in some places on the connecting ridge.Gear: A compass and/or a GPS are a must as this is almost entirely bushwhacking/route finding in the forest.*****You should not attempt this traverse if you need a trail as I have done a lot of bushwhacking/route finding following probably a hundred different animal trails/tracks (bears, wolves, deer and lots of cougar tracks) as well as cut lines and horse trails. My description will not help at all I think and I wouldn?t do that traverse without a GPS and a compass. That being said, I enjoyed it for the fitness challenge and route finding adventure and surprisingly the bushwhacking was almost fun in an open forest most of the time. Starting from the side of the road (GR689225) I walked down the field and followed the forest line to my left until the trail goes straight into the forest. The trail was still wide but so muddy and wet that I started bushwhacking pretty much right away going west for a while and cutting north at some point to reach the east ridge gaining maybe half of the elevation to Allsmoke. I heard an animal growling and it was very intense so I couldn?t care less about finding the right trail when it happened. Once on the ridge (GR664230), I followed an obvious trail to my left but again with many intersections to confuse me. I went left at one point but it was going down too much so I cut back up into the forest and reached the ridge line again going north. I went too far SW later on and missed the turn to the summit (funny we call that a summit?). I bushwhacked back to it relying on my GPS and found a trail leading to the unimpressive summit at GR630239. The views were nice but half blocked by the forest. From there I cut down straight south using animal trails again and my satellite map to reach some of the clearings on the connecting ridge, avoid a bit of bushwhacking and have some views on my objective from time to time. I went S-SW for just under 6 km with quite a bit of elevation loss and gain and finally reached an open ridge just under Volcano Ridge summit. Shouting every 30 seconds to make sure wildlife was aware of my presence, I saw a wolf running down the slope onto my left and then to my right 30 seconds later. I have no clue if there was two of them or if this one was circling around me but it helped me get to the summit quickly (GR616199). From the summit, I followed a trail down the other side eventually going to the left around the forest (GR613197) but I left it and went down an open grassy slope. Getting closer to what seemed to be a cliff, I turned right and hiked until I reached a drainage (GR620188). I went down along that drainage using good animal trails on the left side when possible. I finally got to another wide trail I followed straight down until I reached a horse trail with a sign (GR642185). I turned left and followed it until I reached the closed road (GR649189). I turned left again for a very long walk back to my car. Quite an adventure and I wouldn?t recommend doing both summits the same day. Volcano Ridge has way better views and there are a few trip reports available online to do it from the south.",
    "directions": "From Calgary, follow Trans-Canada Highway/AB-1 W, take exit 161A for AB-22 S toward Bragg Creek/Redwood Meadows and go south for about 22 km. Turn left on AB-22 S and immediately to your right on AB-762 S and continue for 22.2 km. Turn right on AB-549 W for 6,3 km and then turn left on Gorge Creek Trail/Township Rd 210B for 6.8 km and park on the right side of the road just before the bridge.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/12578/long_Allsmoke-Mountain-Kananaskis-Oct-16-2016-3-1024x251--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12578/long_Allsmoke-Mountain-Kananaskis-Summit-Oct-16-2016-2-1024x591--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12578/long_Allsmoke-Mountain-Kananaskis-Summit-Oct-16-2016-4-1024x242--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12578/long_Volcano-Ridge-Kananaskis-Summit-Oct-16-2016-5-1024x468--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12578/reg_Allsmoke-Mountain-Kananaskis-Oct-16-2016-2-1024x764--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12578/reg_Allsmoke-Mountain-to-Volcano-Ridge-Traverse-Kananaskis-Oct-16-2016-12-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12578/reg_Allsmoke-Mountain-to-Volcano-Ridge-Traverse-Kananaskis-View-Volcano-Oct-16-2016-2-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12578/reg_Allsmoke-Mountain-to-Volcano-Ridge-Traverse-Kananaskis-View-Volcano-Route-Oct-16-2016-1024x655--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12578/narrow_Allsmoke-Mountain-to-Volcano-Ridge-Traverse-Kananaskis-Oct-16-2016-16-768x1024--44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/allsmoke-mountain-to-volcano-ridge-traverse-near-kananaskis-ab-12578",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 3,
        "Time": "9 hrs",
        "Total Distance": "26 km",
        "Town": "Kananaskis, AB",
        "Type": "out-and-back"
    },
    "title": "Allsmoke Mountain to Volcano Ridge Traverse",
    "trail_id": "12578"
}