{
    "description": "This hike follows the power line cut from Oyama in Lake Country to Cold Stream. Several great views of Kalamalka Lake and Cougar Canyon can be had along the way. We did this hike as an overnighter but could be done in a day. We started the hike in Oyama at the Pier Mac gravel pit. This is private property as is the next super scenic leg of the hike through the grassland cow-grazing plateau. The government write up on Cougar Canyon Ecological reserve states the following 'Cougar Canyon Ecological Reserve is restricted to scientific and educational purposes related to reserve management only. There is no public route to access this ecological reserve. The only route is through private land. Permission from the landowner is required. Also, groups of ten or more people must receive permission from the Ministry prior to entering this ecological reserve.' The power line cut of this hike marks the western border of the ecological reserve. From the plateau you ascend the 300m to the highest point in the hike. This is your last chance for south views. We followed the main dirt road the entire way which winds it way up to the summit. This could get really hot in the summer months as it's southern exposure. Several minutes from the summit you come to a heavily signed gate which marks the end of the private property. Once on top of the ridge the road meanders back and forth under the power lines all the way to Coldstream. Initially I thought this would be a horrific hike under power lines but the old growth forest and grasslands were classic Okanagan awesomeness. Cool geographical features, ecosystems, views, and wilderness exploring highlight the route.  The trail/road itself is free from any litter and makes for a pleasant walk as most of it is covered in grass with very few signs of erosion. The difficulty rating of this hike was determined more by length than the actual hiking itself. Never is the trail steep or challenging. Just long. If you choose to camp I would suggest a point just past the halfway mark. You get some great views of Kal and Vernon. No suitable drinking water is available on this route so be prepared. On the Coldstream end of the hike you come to another private property gate. From there it's a few hundred meters to Cosen's Bay Road.  My GPS track only worked for the second half of the hike but route choice is pretty straight forward. We stopped for lots of pics and popped our heads off the road on many occasions to view the very cool lake chain in Cougar Canyon. Also of note is a small pond in a place that geographically speaking shouldn't have a pond - midway along the ridge. It's in the middle of nowhere; sunk into a little depression on the west side of the ridge.  We saw several deer and bear sign.",
    "directions": "Follow Oyama Rd off of Hwy97 which eventually turns into Sawmill Rd. Parked safely off rd across from Pier Mac gravel pit. We left a vehicle on the north end of the hike under the security camera in the tiny Cosen's Bay community. This is aprox 6 km shorter than parking in the Cosen's Bay Provincial Park parking lot and saved plenty of road walking. 2km north of our parking spot is the Cougar Canyon parking lot which would be a suitable option too but would require road walking.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/12583/long_2016-10-23-at-10-58-02-35968.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12583/long_2016-10-23-at-11-00-26-35968.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12583/reg_2016-10-22-at-13-49-16-35968.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12583/reg_2016-10-22-at-14-02-29-35968.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12583/reg_2016-10-22-at-14-26-37-35968.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12583/reg_2016-10-22-at-15-27-48-35968.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12583/reg_2016-10-22-at-15-52-49-35968.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12583/reg_2016-10-22-at-15-53-58-35968.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12583/reg_2016-10-22-at-16-04-19-35968.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12583/reg_2016-10-23-at-10-48-30-35968.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12583/reg_2016-10-23-at-10-50-34-35968.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12583/reg_2016-10-23-at-10-58-17-35968.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12583/reg_2016-10-23-at-11-00-49-35968.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12583/narrow_2016-10-23-at-10-50-44-35968.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/cougar-canyon-ridge-near-coldstream-bc-12583",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 3,
        "Time": "5 hrs",
        "Total Distance": "15 km",
        "Town": "Coldstream, BC",
        "Type": "out-and-back"
    },
    "title": "Cougar Canyon Ridge",
    "trail_id": "12583"
}