{
    "description": "No road closure I am aware of but I doubt that George Creek Road is accessible in winter.Edwards Rating: I (II) M S - This is a hike but easy bushwhacking/route finding required if following my route up the very beginning of the SE Ridge.3.5 to 6.5 hoursElevation of 557 m NET, 745 m TOT & max 2126 m on Mount Ware Summit (1949 m Little Ware Summit)Completed on November 6, 2016 in dry conditions except for a few snow patches on the ridge (between the two summits).Gear: A compass and/or a GPS might be useful for the bushwhacking/route finding in the forest if doing the whole loop.*****This is a very popular hike and I understand why as it is relatively easy and it offers awesome views of the surrounding peaks: Bluerock Mountain, Mount Burns, Mount Rose or Threepoint Mountain to name a few. The trail follows George Creek through the valley with partial to wide open views most of the time. I needed a bit of challenge and wanted to avoid the crowd to start with so I left the official trail to make a loop starting with the ascent of Little Ware. From the parking lot, I followed the official trail for a while. Just after the bridge, I turned left to keep going on George Creek trail (sign at GR632151). Looking at the map as I was getting closer to Mount Ware SE ridge, I took what seemed to be an old trail up the slope to my right (north, at GR617140). I then came across a cutline (GR616140) and turned left to go west for a few minutes. As soon as the forest cleared up onto my right (GR615140), I started to go up the treed ridge and gained most of my elevation going NW and eventually reached Little Ware Summit with its huge cairn (GR605147). This is an open forest so bushwhacking was easy and enjoyable. From Little Ware, I made sure to look at my route before I started going down the connecting ridge (see picture). Once back in the forest (GR604148), I found again bushwhacking to be so easy that I just made sure to stay in line with Mount Ware that I could see occasionally. There is probably a trail as I saw 2 orange flags (one at GR600151) but so many animal trails (and a bear track?) that I was losing it and it didn?t matter since I could see where I was heading. I did go too far right for a while and ended up hiking along a gully until I reached the opening under Mount Ware. I hiked straight up to the summit (GR591156) from there.From the summit, I hiked back down to the wide opening and kept going to the right (south) to a grassy gully. I stayed on its left and went straight down until I reached the official trail (GR592145). I turned left and followed it back to the parking lot. I had to cross the creek twice (very low water level) and sometimes the trail split but it always merged back minutes later. If you are not comfortable with bushwhacking, you should start with Mount Ware and you?ll always have the option to keep going down Little Ware after. I met about a dozen people at Mount Ware Summit and as many on the way down so it is crowdy but absolutely worth it.",
    "directions": "From Calgary, follow Trans-Canada Highway/AB-1 W, take exit 161A for AB-22 S toward Bragg Creek/Redwood Meadows and go south for about 22 km. Turn left on AB-22 S and continue for 19.5 km. Turn right on AB-22 S for 27.4 km to Turner Valley. Turn right at the intersection onto Sunset Dr. NW/AB-546 W and stay on that road for 29.5 km.  Turn right on George Creek Road (dirt road) and keep going for about 4-5 km to the barricade and then turn left to park at the George Creek day use area.",
    "geohash": "c3n2",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/12589/long_Little-Ware-Kananaskis-Summit-View-Burns-Bluerock-Rose-Ware-Nov-5-2016-1024x226--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12589/long_Mount-Ware-Loop-Kananaskis-Summit-Nov-5-2016-1-1024x229--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12589/reg_Little-Ware-Kananaskis-Summit-View-Burns-Bluerock-Nov-5-2016-2-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12589/reg_Little-Ware-to-Mount-Ware-Loop-Kananaskis-Nov-5-2016-5-1024x692--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12589/reg_Mount-Ware-Loop-Kananaskis-Summit-Nov-5-2016-4-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12589/narrow_Little-Ware-Loop-Kananaskis-Route-to-Mt-Ware-View-Mt-Rose-Threepoint-Mnt-in-the-back-Nov-5-2016-768x1024--44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/little-ware-to-mount-ware-loop-near-turner-valley-ab-12589",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 4,
        "Time": "6 hrs",
        "Total Distance": "15 km",
        "Town": "Turner Valley, AB",
        "Type": "out-and-back"
    },
    "title": "Little Ware to Mount Ware Loop",
    "trail_id": "12589"
}