{
    "description": "After a long day of exploring out of the city, sometimes you might want to add one last exploration close to home and one which doesn't take much time.  This hike is all that plus its on the easy scales of places to explore.I wanted to get to this brook after I read a report on the hydro potential of this brook in an 1890s report.   This brook doesn't have a large fall but it drops a lot elevation quickly.  Setting off the road, I spotted some flagging tape. I followed it until I was in an area that has the large pipe carrying water for the NS power plant.  Went over the pipe and followed the ATV path north for maybe 300m.  On the right was some kind of quarry with large boulders....I hiked in there and over the hill.   There was a road there, which I followed due east and came out on a dirt road which had a large mound running alongside its eastern side...almost like a berm.I entered the woods east of the berm and immediately came unto the first of two 12 ft falls.  The geology on this brook is fantastic.  Large boulders are everywhere and some of them have really square shapes.  I followed the brook upstream and found the second fall.  All around the brook, the moss was sometimes highly disturbed...some sort of animal was digging in there...not sure what it could be but I hope its a rather small animal.",
    "directions": "Highway 103.  Turn on hiking trail rd just west of highway 103.   The brook is the outflow from Coon Pond.   Follow the gps track if you need help finding the falls.",
    "geohash": "dxfw",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/12584/reg_DSC-0144-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12584/reg_DSC-0146-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12584/reg_DSC-0147-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12584/reg_DSC-0152-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12584/reg_DSC-0154-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/northeast-brook-falls-near-halifax-ns-12584",
    "stats": {
        "Activities": "snowshoe hike",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "2 km",
        "Town": "Halifax, NS",
        "Type": "out-and-back"
    },
    "title": "Northeast Brook Falls",
    "trail_id": "12584"
}