{
    "description": "The Portapique River in the Cobequids of nova Scotia doesn?t offer any large waterfall.  This is rather a unique situation as most rivers flowing ion the south side of the Cobequids have one or more large falls.  I have explored some of the tributaries to the Portapique river.  Gamble Brook offers a couple of nice falls and Wilson brook some nice but smaller falls as well (both on trailpeak already).  I decided to go exploring the unnamed tributaries that flow on the eastern side of this valley.Setting off from almost the cobequid toll, I found a well used ATV trail that went due west and in the general direction of the brook I wanted to follow.   Soon the trail got overgrown and the canopy closed off overhead.  I went up and then down a hill and then the ATV trail ended in a small clearing.  I then set forth into the woods for about 600m to the stream.  I intersected the stream in a very interesting geological area.  There are large outcrops on either side of the brook and sometimes the whole brook disappears under boulders.   There are signs in the cliffs of old witches cauldron which means the stream has been flowing here a long time.After this section came a section that was mostly flat and I thought that maybe the first bit I had seen was all that the stream had to offer.  However, the next sight was a nice 40+ plunge waterfall.  After this fall, ther3e was one other that might be 20 ft and then countless smaller ones.  The stream empties in the Portapique river.  I followed the river south to inspect some old copper adits.  Found two of them but they were not deep at all.I decided to follow another brook upstream to get back to my truck and found another scenic fall of about 20ft (the brook to the south on my gps track).   After the brook ended, the walk became a bit of a chore has I had to push through an area where loggers had thinned the forest leaving all the small trees on the ground.",
    "directions": "Drive on the cobequid toll highway and park just north of the toll section in an area that looks like a small quarry.  There is a road at the top that goes due west into the woods and towards the Portapique river",
    "geohash": "f84d",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/12588/reg_14639769-784133761726470-4627017713155347387-n-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12588/reg_14910551-784133685059811-7463642438924228031-n-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12588/narrow_14963143-784133645059815-8479467310551263749-n-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/eastern-tributaries-of-the-portapique-near-truro-ns-12588",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "4 hrs",
        "Total Distance": "10 km",
        "Town": "Truro, NS",
        "Type": "out-and-back"
    },
    "title": "Eastern tributaries of the Portapique",
    "trail_id": "12588"
}