{
    "description": "A small humble lake with little treed islands in the middle surrounded by the most beautiful crystal turquoise waters. This lake lies in a cove like setting surrounded by breathtaking peaks to further explore. Trailhead is 20 KM east of Squamish at the Skookum Power Project Water Intake Dam.   This is accessed by the Mamquam Main FSR (begins next to the Chief Climbers Parking Lot on Highway 99 just prior to entering Downtown Squamish).The Watersprite Lake Trail was build and is maintained by the BC Mountaineering Club.  It mostly consists of old logging roads and is well marked.  There are bridges across all major creeks and boardwalk across muddy sections.  There is a BCMC cabin at Watersprite Lake which can be booked by the public on the BCMC's website.",
    "directions": "The Mamquam River Forest Service Road (FSR) leaves Highway 99 about 1 km south of Squamish at the Apron parking lot (Stawamus Chief Provincial Park).  Follow for 13.2 KM then turn left on to the Skookum Dam Road.   Continue 6.6 KM to near end of road at the Dam and parking area at a locked yellow gate.  AWD or 4x4 highly recommended for this last 6.6 KM.",
    "geohash": "c2b",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/12587/reg_P1020679-57936.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12587/reg_P1020684-57936.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12587/reg_P1020688-57936.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12587/reg_P1020694-57936.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12587/reg_P1020697-57936.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12587/reg_P1020705-57936.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12587/reg_P1020718-57936_best1_.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/watersprite-lake-trail-bcmc-near-squamish-bc-12587",
    "stats": {
        "Activities": "snowshoe hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 5,
        "Time": "8 hrs",
        "Total Distance": "15 km",
        "Town": "Squamish, BC",
        "Type": "out-and-back"
    },
    "title": "Watersprite Lake Trail (BCMC)",
    "trail_id": "12587"
}