{
    "description": "Edwards Rating: II (III) L L - IV if climbing the rock bands just before the highest point.8 to 12 hoursElevation of 1055 m NET, 1554 m TOT & max 2345 m \"True Summit\" (1747 m Exshaw Mountain & 2157 m Exshaw Ridge Official Summit)Completed on November 13, 2016 in dry conditions. This is a great late season scramble and I wouldn?t do it early season because of the bushwhacking involved (tick season). GPS TRACK: Some bushwhacking and route finding so read the description and look at the pictures for more details.I didn?t park at the trailhead as the whole town is a tow away zone.*****It was a very nice ridge walk with some fun technical scrambling just before the highest point about 2.4 km further north than the official summit. There is also some bushwhacking and route finding involved.Starting from the beginning of the town I walked up the first street and turned left looking for the trailhead to my right. Going up that obvious trail, I took the right fork (GR288585) at the intersection and went up the rocky ridge not worried about the trail as it was open and obvious. I reached back the official trail later and must have came across 20 cairns so you can?t get lost there. I reached the unimpressive Exshaw Mountain summit (GR292595) about 45 minutes later and took a quick break since views were limited. Using faint trails, I bushwhacked going N-NW relying on my GPS to stay in line with the south end of Exshaw Ridge. I arrived to a clearing with my next objective in view and went down a rocky spine going NW (GR286600) all the way down the col. At the lowest point, I bushwhacked straight north and found a good trail (GR282606) to go up the ridge. Once on the ridge, I stayed on it and enjoyed an easy hike with a several high points to the official summit (GR271646). I decided to keep going and reach the ?True Summit? being the highest point further north. It became a little more exposed and technical with a few rock bands to deal with but most of it was fine. There were 3 rock bands before the summit with a little bit of route finding required. The first one had an obvious weakness close to the ridge. The second one was also no problem at all but on the third one, I first tried to go east and around but I didn?t like the exposure even though some people would probably have been fine climbing up just over the corner of that band. A fall there would have been fatal so I lost a bit of elevation and climbed a 5-7 metres wall (GR266663). I kept going straight and up over the 4th band and turned right to go up an exposed slab (GR266664) and reach the summit (GR267664) minutes later.On the way down, I realized it was easy to just go down east from the summit and then lose some elevation along the 3rd rock band until I found easier hands on scrambling (GR266663) to go down. I lost some more elevation along another rock band later and that was a mistake as I got cliffed out. I gained all that elevation back to the ridge. As I got closer to the official summit, I started to go down the treed ridge using a gully (GR270647) to reach Exshaw Creek bed as soon as possible since it was late in the day. I had to go back to my right quite a bit to avoid what seemed to be another cliff but other than that I used the gully and the forest without any trouble. It was probably not the best way down but there was no way I was staying up there in the dark by myself. I turned left in the creek bed and hiked all the way down to the dam, down climbed to its right, followed the road to the intersection and turned left into the creek bed to cross it, now back in town for the final stretch across Exshaw. I hated the return in the creek bed but I enjoyed the overall trip. The best way down if you get to the true summit would be to stay on the ridge until you reach back the south end and then use that good trail to go down Exshaw Creek.",
    "directions": "From Calgary, follow Trans-Canada Hwy/AB-1 W for about 64 km and take exit 114 toward Exshaw. Continue for 3.6 km and turn left on Bow Valley Trail/AB-1A W. Drive 6.9 km and turn right toward Hearth Mountain Dr. Turn left and you'll see parking spaces immediately on your left.",
    "geohash": "c3n4",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/12595/long_Exshaw-Mnt-Ridge-Traverse-True-Summit-Kananaskis-True-Summit-Nov-13-2016-1024x588--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12595/long_Exshaw-Ridge-Traverse-Kananaskis-South-End-in-View-Bushwhacking-Route-Nov-13-2016-1024x368--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12595/long_Exshaw-Ridge-Traverse-Kananaskis-View-Gap-Fable-Morrowmount-Nov-13-2016-1024x360--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12595/reg_Exshaw-Ridge-Attempt-Kananaskis-High-Point-Past-South-Peak-Jan-14-2017-2-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12595/reg_Exshaw-Ridge-Attempt-Kananaskis-Sunset-over-Piegon-and-Big-Sister-Jan-14-2017-1024x768--44639_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12595/reg_Exshaw-Ridge-Attempt-Kananaskis-Walking-on-Beautiful-Cornices-Jan-14-2017-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12595/reg_Exshaw-Ridge-Traverse-Kananaskis-Beautiful-Steep-Slabs-Nov-13-2016-2-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12595/reg_Exshaw-Ridge-Traverse-Kananaskis-Moderate-Hands-on-Nov-13-2016-909x1024--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12595/reg_Exshaw-Ridge-Traverse-Kananaskis-Route-Down-to-Drainage-Nov-13-2016-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12595/reg_Exshaw-Ridge-Traverse-Kananaskis-Route-up-True-Summit-Nov-13-2016-1024x739--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12595/reg_Exshaw-Ridge-Traverse-Kananaskis-Tricky-Slabs-below-True-Summit-Nov-13-2016-1024x683--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12595/reg_Exshaw-Ridge-Traverse-Kananaskis-True-Summit-Nov-13-2016-2-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12595/reg_Exshaw-Ridge-Traverse-Kananaskis-View-Old-Fort-Goat-Door-Jamb-Loder-Nov-13-2016-1024x768--44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/exshaw-mountain-ridge-traverse-true-summit-near-canmore-ab-12595",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 4,
        "Time": "10 hrs",
        "Total Distance": "23 km",
        "Town": "Canmore, AB",
        "Type": "out-and-back"
    },
    "title": "Exshaw Mountain & Ridge Traverse (True Summit)",
    "trail_id": "12595"
}