{
    "description": "This is a hike to some nice falls near Portree in the NE Margaree valley section.  The only thing I knew about this brook is that I could see some white spots (waterfalls!) from satellite imagery obtained in the fall.At the bridge over the Margaree river, I could see rows of houses in between where I was and where I wanted to go.  So I chose to go along the river....big mistake!  Just around the first bend is a fairly steep rock slope all the way to the river.  this coupled with the few inches of snow nearly got me a soaker in the first five minutes of my journey.  Keep reading and you will see that I didn't have to go this way at all!after crossing the Lavis brook where it flows into the Margaree river, I walked in a pasture and was soon entering the woods at the base of the Lavis Brook valley.  there I spotted some flagging tape to the right of the stream (if facing it!) and soon discovered that the route is mostly flagged all the way to the top with even some old ropes in steep places.I had forgotten my gps so I had no clue where to stop making my way upstream.  I passed a couple of sets of falls of about 20 ft and then I was just about to turn back die to the low light conditions and snow squall of December when I finally spotted the tallest of all the falls so far.  A nice 40ft some waterfall hugged on all side by sheer rock walls.  there may be more falls after this one but I had not enough time to pursue them!On my way back, I decided to see if there was an easier way back to the road as it seem this place was well traveled.  I found a small bridge that lead to a cow fence with an entrance.  I used it and once at the top of the hill I saw some signage that this was the start of a \"hiking trail\"!",
    "directions": "West big Intervale Rd to Portree.  At 20 T 656376 5140625, you will see the signange for the hiking trail  From this point you should also be able to see the Lavis Brook Valley in front of you.",
    "geohash": "f8",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/12605/reg_15337416-803993049740541-5191045795388182788-n-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12605/narrow_15317781-803992983073881-2639050515477971162-n-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/lavis-brook-falls-near-cheticamp-ns-12605",
    "stats": {
        "Activities": "hike snowshoe",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 5,
        "Time": "1 hrs",
        "Total Distance": "3 km",
        "Town": "Cheticamp, NS",
        "Type": "out-and-back"
    },
    "title": "Lavis Brook Falls",
    "trail_id": "12605"
}