{
    "description": "Completed on December 10, 2016. Snow covered and river not entirely frozen (even at -20 to -30 for days).This is only a hike but my GPS track involves easy route finding and bushwhacking.1.5 to 3 hoursElevation of 329 m NET, 464 m TOT & max 1687 mGear: A compass and/or a GPS might be useful for the bushwhacking/route finding in the forest. We didn?t use our microspikes but it would have helped as it was slippery with snow on grassy slopes.*****This is an easy nice little hike to complete at pretty much any time of the year but ideally when the river is frozen. We made our own trail most of the time as it was snow covered and we didn?t always see the trail but bushwhacking was easy.From the parking area, we used the road to go down to the river but came back by the trail leading directly to the parking. We had to find a safe spot to cross the river as it was surprisingly not completely frozen yet despite extreme cold weather recently. We crossed it and went almost straight up in the forest, passing a first clearing and gaining elevation until we reached a good trail along a huge washout and went up to our right. We managed to make it to the summit in a reasonable time but we didn?t follow the trail going too far to the left (south) but eventually came back to our right and gained the last bit of elevation up another clearing to follow the ridge to the summit. Not sure we were yet at the summit, we continued for about 200 metres but turned back and took a break on this little ?bench? by the fire pit (GR725116). Views are very limited but we do see the Rockies far away and it was beautiful with all the fresh snow and the sun late in the day. On the way down, we started on the official trail but lost it again and just hiked back to the river using whatever faint trails worked for us.",
    "directions": "From Calgary, follow Trans-Canada Highway/AB-1 W, take exit 161A for AB-22 S toward Bragg Creek/Redwood Meadows and go south for about 22 km. Turn left on AB-22 S and continue for 19.5 km. Turn right on AB-22 S for 27.4 km to Turner Valley. Turn right at the intersection onto Sunset Dr. NW/AB-546 W and stay on that road for 19.1 km.  Turn left to the Sandy McNabb Campground and keep going for about 1 km to the barricade and then turn left to park at the day use area.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/12608/long_Mount-McNab-Kananaskis-Dec-10-2016-14-1024x292--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12608/long_Mount-McNab-Kananaskis-Summit-Dec-10-2016-1-640x360--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12608/reg_Mount-McNab-Kananaskis-Dec-10-2016-2-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12608/reg_Mount-McNab-Kananaskis-Summit-Dec-10-2016-5-1024x768--44639_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12608/reg_Mount-McNab-Kananaskis-Summit-Dec-10-2016-7-1024x779--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12608/reg_Mount-McNab-Kananaskis-Tricky-River-Crossing-Dec-10-2016-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12608/reg_Mount-McNab-Kananaskis-Welcome-1-Dec-10-2016-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12608/narrow_Mount-McNab-Kananaskis-Dec-10-2016-9-768x1024--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12608/narrow_Mount-McNab-Kananaskis-Light-at-the-End-of-the-Tunnel-Not-Yet-Marry-Dec-10-2016-1-700x1024--44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mount-mcnab-near-turner-valley-ab-12608",
    "stats": {
        "Activities": "hike snowshoe",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "3 hrs",
        "Total Distance": "7 km",
        "Town": "Turner Valley, AB",
        "Type": "out-and-back"
    },
    "title": "Mount McNab",
    "trail_id": "12608"
}