{
    "description": "I had mapped out this section of the south Nile Brook a while ago with the wording...falls 58.   So I wasn't sure if this place would have a fall of 58 feet or a series of them totaling 58ft.  I couldn't find any information online about waterfalls on this brook and the sat imagery didn't show much.  I set forth into the woods and was pleasantly surprised to find a well established ATV trail which led in the direction of the river.  Once at the river, the trail ends and the bushwack began.   The first part was pretty easy and soon I was in an area where the two branches of the brook separated.  I followed the south Nile Brook branch and soon was upon two small but nice falls.  I pursued the way upstream and soon was rewarded by this series of falls set into sheer rock walls.  I made my way upstream into the min canyon and only soaked myself to my knees!   Usually thias is not a problem but in December it can get a bit cold on the feet.  I decided to continue along and was in awe of all the falls I saw.  There are never tall but its a long series of them all set into a mature hardwood forest.",
    "directions": "Egypt rd.  Park close to the Normaway Inn and head into the woods opposite it.  Most of the falls are at N46° 20' 30.4\" W60° 55' 33.8\".",
    "geohash": "f8hxt",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/12606/reg_15268093-804611349678711-7487632026116270305-n-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12606/narrow_15391129-804611336345379-4549998482242551064-n-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/south-nile-brook-falls-near-cheticamp-ns-12606",
    "stats": {
        "Activities": "hike snowshoe",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "4 km",
        "Town": "Cheticamp, NS",
        "Type": "out-and-back"
    },
    "title": "South Nile Brook Falls",
    "trail_id": "12606"
}