{
    "description": "This hike takes you to a magnificent fall in the middle of the woods near Elgin, Nova Scotia.   I had seen a beautiful picture of this fall on a facebook page and wanted to see it for myself.  I knew it was on Maple Brook but the topo maps weren't showing much in elevation changes.  So I went out and bushwacked my way up and down a section of the brook but it was so flat, I couldn't imagine how a fall would form.I asked the person who posted the fall on the web for some better directions and they did share the location more precisely with me (Tks G Cassidy!).  so in the spring and armed with this new information, I travelled to another section of Maple Brook and bushwacked my way to a small fall and then a huge swamp area...where I decided to turn back!I was seriously discouraged at this point.  Back at home, I looked at the direction and found that I had made a mistake in transcribing the coordinates to my GPS.  The summer low water prevented me to go before the late fall of 2016.Drove down a fairly good woods road to an area where my GPS was pointing straight into the woods...the fall was about 700m away!   I traveled through a logged area and then actually emerged on a well worn ATV trail.  I walked on this trail and then noticed some flagging tape.  My gps was also in concordance with the flagging tape so I went into the woods and 100m later I was at the summit of this beautiful waterfall.  It starts with a cascade type fall which is broad and loses about 20ft of elevation.  It then plunges the last 12 feet in a straight drop.  The stream has carved a nice mini ravine here and there are some large exposures of rocks on one side of the stream.  The forest around the fall is composed of towering evergreen and the ground is covered by a deep moss carpet.This fall is easy to get to, fairly unknown and very beautiful.  It' a bit out of the way but close by are numerous other falls that are worth the detour; Glencoe, Black Brook, Chisolm Brook to name just a few.",
    "directions": "Highway 347 south of New Glasgow.  Just passed Lorne, turn on a dirt road at N45° 22' 05.9\" W62° 39' 39.4\".  You need to take most of the left turns off this dirt road to make your way to the ATV trail at  45°23'45.58\"N,  62°39'45.40\"W.  The falls are at N45° 23' 47.1\" W62° 39' 15.2\".",
    "geohash": "f856",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/12601/60.Maplealt.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12601/reg_15137519-796116177194895-1985274929568912440-o-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12601/reg_15167482-796116047194908-5650497640525961822-o-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/maple-brook-fall-the-big-one-near-new-glasgow-ns-12601",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 5,
        "Time": "1 hrs",
        "Total Distance": "1 km",
        "Town": "New Glasgow, NS",
        "Type": "out-and-back"
    },
    "title": "Maple Brook Fall- The big one!",
    "trail_id": "12601"
}