{
    "description": "Weymouth falls....this is a sign you see on highway 101 between Digby and Yarmouth.  I always figured that the falls were destroyed when NS Power built a dam.I was so wrong!   I set off from a metal bridge downstream of the dam and made my way upstream following the west side of the Sissiboo River.   After only a few minutes, I saw the falls in the distance!  They are well hidden but so nice!   The fall a height of approximately 50ft over a few steps.On top of the fall is a man made weir which depending at the time of the year will let water run to the fall or leave them dry.  I was in luck as there was lots of water going over the weir.Once I finished my photo taking, I looked at my gps and found that the quickest way out was straight through the woods for about 200m and I ended up in the back of a church property...The falls are at most 300m away from a well travelled road making this fall easily accessible for practically anybody.",
    "directions": "From Weymouth, continue on Weymouth Falls Rd until you see the old Yarmouth Rd on your right and the church on the left.  Behind the church is a small woodland and the falls are just beyond.",
    "geohash": "dxche",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/12612/long_DSC-0968-62849.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12612/reg_DSC-0082-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12612/reg_DSC-0083-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12612/reg_DSC-0094-27177_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12612/reg_DSC-0102-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/weymouth-fall-near-weymouth-ns-12612",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "1 km",
        "Town": "Weymouth, NS",
        "Type": "out-and-back"
    },
    "title": "Weymouth Fall",
    "trail_id": "12612"
}