{
    "description": "Completed on December 18, 2016 (snowshoeing). GPS track involves a lot of bushwhacking as we were just exploring after we realized we couldn?t cross the river to do two ridges on the other side. If you want to do White Buddha without bushwhacking, start from Powderface Trail (GR554371) and turn right at about GR542370 where you should see an obvious trail if not snow covered or if someone recently did White Buddha. 1.5 to 3 hours if doing White Buddha from Powderface Trail and back down the same way.Elevation of 320 m NET, 477 m TOT & max 1806 m (including all that extra bushwhacking).*****We had a completely different plan to start with and when we realized we couldn?t cross the river, we just bushwhacked on the other side of the road to explore something new. White Buddha happens to be this little bump we can see on the right side of the road just past Prairie Mountain. It took me an hour to find out what was the name of that little hike after we did it?! Again, the most easy and direct way is hiking up Powderface Trail such is completely different than our GPS track.From the road, we snowshoed up the slope that happened to be sort of the east end shoulder of Powderface Ridge. At the highest point of it, we just bushwhacked down to Powderface Trail and then straight up what we didn?t know yet was White Buddha. We eventually found a trail and followed it to the summit. Views were interesting even though nothing exceptional kept us there for too long. We came back the same way for a few minutes and decided to go down the other way down to Prairie Creek just to explore a little more. There was some challenging bushwhacking on a steep slope but nothing impossible. Once we reached Prairie Creek, we turned right and followed it back to the road. Not following a trail was probably what made it more challenging and fun but still it can be a nice snowshoe trip if you don?t have much time and want to get out, enjoy decent views and avoid the crowd on Prairie Mountain.",
    "directions": "From Calgary, follow Trans-Canada Highway/AB-1 W, take exit 161A for AB-22 S toward Bragg Creek/Redwood Meadows and go south for about 22 km. Turn right at the intersection onto AB-66 W and drive for 18.5 km to the winter gate on the road or to Elbow Falls parking lot on your left. When the road is open, you can park at the Powderface Trail parking lot on your right about 700 metres further away on AB-66.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/12618/long_White-Buddha-Vents-Ridge-Kananaskis-Elbow-River-View-Iyarhe-Ipan-Swany-s-Ridges-Dec-18-2016-1024x421--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12618/long_White-Buddha-Vents-Ridge-Kananaskis-Summit-View-Iyarhe-Ipan-Ridge-Dec-18-2016-3-1024x300--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12618/long_White-Buddha-Vents-Ridge-Kananaskis-View-Iyarhe-Ipan-Ridge-Dec-18-2016-4-1024x259--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12618/reg_White-Buddha-Vents-Ridge-Kananaskis-Summit-Dec-18-2016-3-1024x818--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12618/reg_White-Buddha-Vents-Ridge-Kananaskis-Up-East-Powderface-Dec-18-2016-1-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12618/reg_White-Buddha-Vents-Ridge-Kananaskis-View-Iyarhe-Ipan-Ridge-Dec-18-2016-1024x700--44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/white-buddha-vents-ridge-near-kananaskis-ab-12618",
    "stats": {
        "Activities": "snowshoe hike",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "7 km",
        "Town": "Kananaskis, AB",
        "Type": "out-and-back"
    },
    "title": "White Buddha (Vents Ridge)",
    "trail_id": "12618"
}