{
    "description": "This trail is the basic route in to the future Rogue's Roost Wilderness Area from Nice View Drive. From this \"backbone\" you can branch off to many beautiful spots--Sorrow's End, the twin peaks over Black Duck Lake, or the whole area around Rogue's Roost itself and overlooking Prospect Bay.You'll be following an ATV trail, and crossing three bogs that can be very wet at certain times of year. Because of the nature of the coastal barrens landscape, it's difficult to give a description of landmarks. Basically, you leave Nice View Drive and cross a small swamp, turn left and turn right to come up on a rock ridge. After the ridge ends, you descend to cross a stream and come up again to a spot where the trail branches. Turn left (or go straight for the Sorrow's End route) and the path takes you across the largest, wettest bog of the hike. (You could bushwhack around the south end of the bog and cross the stream that drains it into Back Bay.) Then turn right along the ridge and follow until the modest peak and set of erratics, where you turn left (if you continued straight here you would bear back to the right and, again, reach Sorrow's End). Not long after turning left you descend to the stream that drains Black Duck Lake and come up (the gps trail marks the right-most path), catching a glimpse of the lake to the right as you leave the dip. In the next section of the trail, you pass a turnoff to the right (which would take you to the two peaks over Black Duck Lake) and left (along a ridge to overlook Back Bay) and follow the trail as it winds along ridges and twice crosses small bogs and turns left. Finally, you descend into the tidal marsh at the head of Back Bay. Usually you can cross the stream without wading, but not always. This is a gateway to the ridges that form the two sides of Rogue's Roost.",
    "directions": "Take the 333 out of Halifax and turn left on Terence Bay Road. You'll descend Porcupine Hill and then come up along the road overlooking the Bay. Watch for Nice View Drive on the right. This is a private road so you may consider parking at the bottom and hiking up to the trailhead.",
    "geohash": "dxftj",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/12628/reg_CRW-5473-58181.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/from-nice-view-drive-to-the-head-of-back-bay-near-halifax-ns-12628",
    "stats": {
        "Activities": "river-canoe hike",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "5 km",
        "Town": "Halifax, NS",
        "Type": "out-and-back"
    },
    "title": "From Nice View Drive to the head of Back Bay",
    "trail_id": "12628"
}