{
    "description": "An alternate path up this mountain. Steep bushwacking until you hit nearer the top where it levels off and opens up.",
    "directions": "Head up Spruston Road (access only from South heading on the highway). Continue past Y junction about 4 kilometers up and keep left. Continue another 3 kilometers until you enter McKay Lake Forestry Road (at this point there are also signs for the Trans-Canada trail as it passes here). Enter main road and past open area continue along main road keeping left at the next Y junction. Always keep on the main road at this point. Continue just past 7 kilometre call sign or until you make a slight ascent on a curve to where the gated entrance to Private Forestry Land is located.Park here or continue along main road if the gate is open for about 4 kilometers. Pass power lines and keep on the main road. You are entering a broad valley between two peaks, Mt. McKay on your left and Buffalo Hump (probably not veiwable, on your right). A disused logging road breaks right (elevation approximately , ascending the cut block (logged in 2011) at the base of Buffalo Hump. Continue up this disused road until the going gets bushy and the road is ditched. Turn perpendicular to the road and ascend through average 2nd growth forest.Bushy for first 200 metres of elevation, but gradually breaks open at about 800-850 metres with the last 100 metres being pleasant. Broad rocky summit with nice views and nice area for lunch and a stop and admire the fact that quaders will never reach this destination. NOTE: This is private forested land belonging to Island Timberlands and the gate may close at any time. If you are up there before 0800 and want to remain after 1600, better to park below the gate and walk. As well as if you find it open on weekends it is probably best to trek in. ATVs are not allowed on this land, though you will undoubtedly see quite a few - your call.",
    "photos": [],
    "source_url": "https://trailpeak.com/trails/buffalo-hump-alt-near-nanaimo-bc-12625",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "6 km",
        "Town": "Nanaimo, BC",
        "Type": "out-and-back"
    },
    "title": "Buffalo Hump Alt",
    "trail_id": "12625"
}