{
    "description": "Completed on December 26, 2016 in winter conditions.Edwards Rating: I (II) S S2.5 to 5 hours.Elevation of 632 m NET, 660 m TOT & max 2086 m.GPS track involves some bushwhacking and route finding as it was snow covered with no footsteps or flags to guide us. Gear: A GPS/satellite map might be useful for the bushwhacking/route finding in the forest but a trail should be obvious when not snow covered. We used our microspikes all along but snowshoes would have helped closer to the summit.*****We were looking for something short but still a good workout so Gunnery Mountain was the perfect destination for that with a decent elevation gain on a short distance. The views were absolutely awesome being closed to the impressive Holy Cross Mountain and other beautiful summits not too far away.We parked by the river, put our microspikes on and crossed the road walking west and along rock bands until we saw an easy but steep opening up Gunnery Mountain (GR698849). We followed an opened rocky spine for a while but slowly cut to the left to stay away from the cliff as it was slippery sometimes with the snow even though our spikes helped a lot. We kept a northeast angle to get to the false summit visible from the beginning of our ascent (picture) and gained the ridge. Snow was forming micro slab avalanches but sometimes they were more impressive even though not dangerous. It shows how tricky it can become when multi-layers form during the winter though. It seemed like we were following a trail sometimes but we had no clue really with the snow accumulation (anywhere between a few centimeters to 2-3 feet).On the ridge, we headed north to get to the summit cairn at GR700863. After a short break because of that freezing and violent wind, we started to go down the opposite direction as we didn?t want to go down the same steep slope we came from in these conditions. We did some dirty bushwhacking for about 5 minutes and got down to the Holy Cross col where there was another clearing with great views. We hiked down what seemed to be a drainage and turned right heading east first but then sidesloping north to avoid what seemed to be a cliff below us (when looking at the satellite map). We kept going down slowly sidesloping until we could see for sure an easy way to reach Gunnery Creek Trail down into the valley. Once at the creek, we turned right and followed an obvious trail back to the road. Our car was just a few minutes away to our right. It?s a very nice easy scramble and might be even more interesting when dry as there seems to be many possibilities for some good hands-on scrambling on the south face of this mountain.",
    "directions": "From Calgary, follow Trans-Canada Highway/AB-1 W, take exit 161A for AB-22 S toward Bragg Creek/Redwood Meadows and go south for about 88 km following directions to stay on AB-22 S. Just before Longview, turn right onto Highway 541 for 39.7 km where we parked on the left side of the road right in front of Gunnery Mountain.",
    "geohash": "c2y",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/12620/reg_Gunnery-Mountain-Kananaskis-Dec-26-2016-19-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12620/reg_Gunnery-Mountain-Kananaskis-Dec-26-2016-24-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12620/reg_Gunnery-Mountain-Kananaskis-Dec-26-2016-28-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12620/reg_Gunnery-Mountain-Kananaskis-False-Summit-Dec-26-2016-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12620/reg_Gunnery-Mountain-Kananaskis-Gunnery-Creek-Trail-Dec-26-2016-2-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12620/reg_Gunnery-Mountain-Kananaskis-Summit-View-Holy-Cross-Dec-26-2016-1-1024x709--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12620/reg_Gunnery-Mountain-Kananaskis-View-Holy-Cross-Mnt-Dec-26-2016-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12620/narrow_Gunnery-Mountain-Kananaskis-Gunnery-Creek-Trail-Dec-26-2016-1-768x1024--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12620/narrow_Gunnery-Mountain-Kananaskis-Steep-Slope-Bushwhacking-Dec-26-2016-3-671x1024--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12620/narrow_Gunnery-Mountain-Kananaskis-The-Sheep-Argument.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/gunnery-mountain-near-longview-ab-12620",
    "stats": {
        "Activities": "hike snowshoe",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 5,
        "Time": "4 hrs",
        "Total Distance": "7 km",
        "Town": "Longview, AB",
        "Type": "out-and-back"
    },
    "title": "Gunnery Mountain",
    "trail_id": "12620"
}