{
    "description": "See \"From Nice View Drive to the Head of Back Bay\" for the route in to begin this loop.This hike takes in two spectacular views in the to-be-designated Rogue's Roost Wilderness Area--you can see to Prospect (and beyond) on one side and to Sambro and West Pennant on the other, from both the twin peaks over Black Duck Lake and the cliff (\"Sorrow's End\") over Shellbird Lake.If you start at Black Duck Lake, then take the ATV trail to the right just after you come up from the stream draining Black Duck Lake into Back Bay. Follow the trail down and up over the two peaks. This is the first highlight of the hike.Then continue on as the trail winds through the barrens. It's easy to miss the turn-off to the right to round the top of Black Duck Lake--the GPS trail should help you. (If you continue straight, the trail head off by a couple of different routes to the left that take you over to Prospect Bay.) The path across the streams draining into Black Duck Lake takes you down and through some fairly swampy black spruce groves. It can be very wet, especially in some places where the ATVs have created trenches. There are few landmarks as you head towards Shellbird Lake, but eventually you meet a t-junction. If you went left, you would end up at the cell towers, but turn right and skirt the edge of a large bog, with Sorrow's End in sight, to come up the back of Sorrow's End and on to the cliff, for the second highlight. There are many options to leave the cliff, but this GPS track shows you where to find a foot path by a large boulder on the south edge of the exposed granite ridges. This footpath goes along under the rock form and then turns left to cross the stream between Shellbird and Dadie's Lakes. You emerge from the woods into brush and then join the ATV trail again on open barrens. Following this ATV trail, you join again the trail \"From Nice View Drive to the head of Back Bay\".",
    "directions": "Take the 333 out of Halifax and turn left onto Terence Bay Road. You'll descend Porcupine Hill and then come alongside the river up the road overlooking the narrow section of the Bay (still called \"the river\" locally). Watch for Nice View Drive on the right. This is a private road, so you may consider parking at the bottom and hiking up to the trailhead. Use the map \"From Nice View Drive to the head of Back Bay\" to reach the beginning and end of this loop.",
    "geohash": "dxftj",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/12630/reg_IMG-8572-58181.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/loop-around-shellbird-and-black-duck-lakes-near-halifax-ns-12630",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 5,
        "Time": "2 hrs",
        "Total Distance": "5 km",
        "Town": "Halifax, NS",
        "Type": "out-and-back"
    },
    "title": "Loop around Shellbird and Black Duck Lakes",
    "trail_id": "12630"
}