{
    "description": "Bird's-eye views of the stunning Yakima Canyon, miles of wildflower fields, and a line of ragged fenceposts marching all the way along the trail -- the Yakima Skyline Trail is a great conditioner, or extend it to a full day hike. From the parking area, follow the trail as it winds through fields of balsamroot and cheatgrass, gradually leading to the rim of the canyon about a half mile from the trailhead. Here you can peer down into Yakima Canyon without risking vertigo -- the ground falls away in a staircase pattern so it's not a sheer drop. Despite that, keep children close at hand here. Continuing onwards and upwards, note the gorgeous expanse of wildflowers all around you. Look for purple bitterroot, purple larkspur, white and pink buckwheat, even fluffy big-headed clover early in the season. Keep an eye out for wildlife as well. Bighorn sheep live in the canyon, and pelicans like the Yakima River Canyon. You may be lucky enough to spot a few soaring on the breezes as they come out of the canyon. The trail proceeds uphill for another mile, following the fenceposts. Then it turns away from the rim of the canyon briefly, allowing you a respite from climbing as you traverse through ever-thicker wildflowers. But soon it turns back toward the canyon rim, and you'll enjoy the rest of the hike to an old hitching post at the high point. It's two miles to this hitching post. The view here is gorgeous, and it's a great place to stop for the day. But, you can proceed even further on if you wish. Dropping into the saddle offers even better views of Roza and the dam that provides irrigation to some of the Yakima Valley. It's nearly 6 miles roundtrip if you continue on to the saddle. Or go big. Head for the high summit visible from the hitching post. Locally known as Gracie Point, it adds another two miles to your hike and a fair bit of elevation gain, but views from the top, on a clear day, are incredible.",
    "directions": "Take I-90 to exit 110 for I-82. Continue on I-82 to exit 26 for Selah/Canyon Road. Make a right off road, and then turn left onto Harrison Road. Drive 1.9 miles southwest before turning right onto Wenas Road. Continue nearly 3 miles to a Y junction near an old fire station. Continue straight ahead on Gibson Road, and 0.3 miles past getting onto Gibson Road, turn right on Buffalo Road. Here the pavement ends and the L. T. Murray State Wildlife Recreation Area begins. Follow this rough gravel and dirt road 1.5 miles to the trailhead. There are no facilities here. Park your car (ensuring to leave room for other visitors) and hike down the road onto the trail, passing an old white metal sign on your right. Discover Pass required.Park at N46° 42.874' W120° 30.527'",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/WA/12640/reg_P1030520-18265.jpg",
        "https://trailpeak.com/storage//content/trails/US/WA/12640/reg_P1030522-18265.jpg",
        "https://trailpeak.com/storage//content/trails/US/WA/12640/reg_P1030533-18265_best1_.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/yakima-rim-near-yakima-wa-12640",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "15 hrs",
        "Total Distance": "15 km",
        "Town": "Yakima, WA",
        "Type": "out-and-back"
    },
    "title": "Yakima Rim",
    "trail_id": "12640"
}