{
    "description": "A beautiful moderate hike / snowshoe in the Cypress Park area of West Vancouver. Lovely open forest, with mild rolling hills.Start at the small parking area for the cabins in the Cypress park area, and head northeast along the old logging road as far as Blue Gentian Lake. The road does narrow to a trail approx. 2 kms in. There will be a few private cabins, mostly on the right side, but several trails into the woods on the left, leading to many more cabins in the woods.Other than the cabin properties, this is all public property, so aside from the cabin properties, you can venture anywhere.In deep snow, on snowshoes on Jan 15, 2017, I went approx. 4 kms, to beyond Blue Gentian Lake (by then on the BP trail), where the trail in the snow eventually ended. Hoped to get to Lost Lake, but not possible in this deep snow.On the way back, followed a trail marked \"Main trail\" (of the BP trail), and did 2 loops on the right (north side), with several cabins, some very basic, others appearing to be more comfortable.Approx 8 kms, and 300 m total ascent.",
    "directions": "Take the Cypress Bowl Road off the Upper Levels Hway in West Vancouver. At approx. 11 kms, 200 m just past the last switchback westward, there is a small parking lot (12 cars?) on the right. This is for the cabin owners, so should be avoided on weekends. Drive 200 m farther westbound, and park in the larger PL on the left, or on the roadside, ACROSS from the small parking lot, and walk back along the road to the small parking lot, the trailhead.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/12643/reg_IMG-2900sm-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12643/reg_IMG-2903sm-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12643/reg_IMG-2905sm-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12643/reg_IMG-2906sm-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12643/reg_IMG-2908sm-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12643/reg_IMG-2913sm-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12643/narrow_IMG-2909sm-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12643/narrow_IMG-2911sm-7359.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/cypress-bowl-road-to-blue-gentium-lake-near-vancouver-bc-12643",
    "stats": {
        "Activities": "hike snowshoe",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "8 km",
        "Town": "Vancouver, BC",
        "Type": "out-and-back"
    },
    "title": "Cypress Bowl Road to Blue Gentium Lake",
    "trail_id": "12643"
}