{
    "description": "This is a very nice hike to some sea caves, underwater sea caves, bird colonies, towering cliffs, waterfalls and a natural arch to finish!The one thing to remember for this hike is that it's on the Bay of Fundy and you must do it a low tide...if not there is no way to get into the sea caves or coves along the way.Setting off from Smugglers Cove Provincial Park, head west along the cliffs.  If you stay at the bottom of the cliffs you will see more of the features above.  On top of the cliffs, the walking is easier and harder at the same time.  Its easier than the shoreline as there is no sharp rock to navigate but its harder as the forest is very very dense.Before getting to the main cove, there were two smaller lagoon type opening in the rocks which reached all the way to the cliff.   I swear I could hear some underwater caves sound at these points.  Definitely need to come back there in the summer for snorkelling!   The main sea cave to see is a bit like the one in Smugglers Cove but it has two natural arches in it...One really high above your head and the other at your head level.    Again you will not be able to enter the cave but just a low tide.  I also had to jump a fair way from the cliff to the beach when heading west just after the cave...so if you are doing this hike towards the east you might not pass in front of the cave at all if you go up the cliffs.All in all I had to do some light bouldering from time to time to ascent or descent some of the cliffs so be careful.. There were two spots that had a good size ice wall for ice climbing both of them facing north and hidden from the sun.Towards the end you all pass some bird colonies and near Bear Cove you will see the natural arch...what's cool about it is that it is very high on the beach so probably accessible even at mid to high tides.",
    "directions": "Highway 1 to Smuggler Cove Provincial Park which is a few km west of Meteghan.  Park at the park and walk to the shoreline heading west",
    "geohash": "dxbg",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/12663/reg_DSC-0157-27177_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12663/reg_DSC-0144-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12663/reg_DSC-0189-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12663/narrow_DSC-0158-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12663/narrow_DSC-0170-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12663/narrow_DSC-0184-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/belle-anse-near-yarmouth-ns-12663",
    "stats": {
        "Activities": "sea-kayak hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "5 km",
        "Town": "Yarmouth, NS",
        "Type": "out-and-back"
    },
    "title": "Belle Anse",
    "trail_id": "12663"
}