{
    "description": "Completed on March 4, 2017. Snow covered most of the time but not enough to consider snowshoes.This is only a hike but my GPS track involves some easy bushwhacking as we couldn?t see the official trail (if any) so we were just finding the fastest way and path of least resistance.3.5 to 6 hoursElevation of 417 m NET, 513 m TOT & max 1780 mGear: A compass and/or a GPS might be useful for the bushwhacking/route finding in the forest in winter conditions. We used our microspikes for a quick/safe descent from the summit.*****We were heading to another mountain today but we forgot about the road closure so we used a hiking App to find out what we could do nearby. Having completed Mount McNab not so long ago, we were not expecting much so let?s say it was nice to do some exercise and enjoy the outdoors but one visit to Mount Dyson is enough.From the parking area, we used the trail going down to Sheep River and crossed it following Wolf Creek Trail to the left after. Obviously, some skiers and snowshoers opened the way so we just followed that trail up to a marsh and across until we met a huge group just before a fence after about 5-6 km. After a short conversation, we crossed the fence and stayed left to follow the creek bed and looking at our summit further away to the left. We could rarely see the trail because it was snow covered in most places so we just headed to the very beginning of the SW ridge, crossed the creek and started going up towards the summit looking at the satellite map once in a while to stay aligned with it. Bushwhacking was actually enjoyable except after we gained most of our elevation where there was a lot of dead trees to circumvent. We stopped at a viewpoint (the only one) for a few seconds just before the summit cairn (at GR735074) but it was cloudy so we couldn?t see much anyways. We continued a few minutes past the cairn to find out if views could be better but we found nothing so we came back the same way after a snack.",
    "directions": "From Calgary, follow Trans-Canada Highway/AB-1 W, take exit 161A for AB-22 S toward Bragg Creek/Redwood Meadows and go south for about 22 km. Turn left on AB-22 S and continue for 19.5 km. Turn right on AB-22 S for 27.4 km to Turner Valley. Turn right at the intersection onto Sunset Dr. NW/AB-546 W and stay on that road for 19.1 km.  Turn left to the Sandy McNabb Campground and keep going for about 1 km to the barricade and then turn left to park at the day use area.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/12679/long_Mount-Dyson-Kananaskis-Marsh-MAR-4-2017-2-1024x333--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12679/reg_Mount-Dyson-Kananaskis-Beautiful-Frozen-Creek-MAR-4-2017-1024x789--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12679/reg_Mount-Dyson-Kananaskis-MAR-4-2017-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12679/reg_Mount-Dyson-Kananaskis-Marsh-MAR-4-2017-1-1024x730--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12679/reg_Mount-Dyson-Kananaskis-Welcome-MAR-4-2017-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12679/narrow_Mount-Dyson-Kananaskis-Summit-MAR-4-2017-3-671x1024--44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mount-dyson-near-turner-valley-ab-12679",
    "stats": {
        "Activities": "ski-xc hike snowshoe",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 2,
        "Time": "5 hrs",
        "Total Distance": "14 km",
        "Town": "Turner Valley, AB",
        "Type": "out-and-back"
    },
    "title": "Mount Dyson",
    "trail_id": "12679"
}