{
    "description": "A great way to see some of the beautiful scenery on Manitoulin Island is from the cliff lookouts along the Cup and Saucer trail.  The trail runs along part of the Niagara Escarpment which always provides some interesting topography.  There are two routes marked on the map, a white trail at 5.5km and a blue trail at 6.5km.  It's not indicated whether that's one way or total length although it only took us 1.5hrs to get to the high cliffs and back so I would assume that it's a 5.5km round trip.  The intersections between routes allow you to wander around and spend the day however you like.  There's also a little detour called the \"Adventure Trail\" which leads down a crack in the cliffs via a series of wooden ladders.  I've never taken it but I might try it someday.  On a clear day you can get a great view of Georgian Bay from most of the cliff lookouts, so a pair of binoculars comes in handy.  I'd also recommend a decent pair of shoes, as some of the steeper rocky sections can be quite slippery.",
    "directions": "From Sudbury, take hwy 17 west to the Espanola turnoff at hwy 6.  Follow hwy 6 across the bridge onto the island at Little Current.  Take hwy 540 west out of Little Current and turn left at Bidwell road.  The parking lot is on the right.  The way to the trail is marked by a sign and the trail well marked and easy to follow.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/ON/1267/reg_111-19041.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/1267/reg_143-19041.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/1267/reg_CS1JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/1267/reg_CS2JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/1267/reg_CS3JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/1267/reg_CS4JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/1267/reg_CS5JPG.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/cup-and-saucer-near-sudbury-on-1267",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "0 km",
        "Town": "Sudbury, ON",
        "Type": "out-and-back"
    },
    "title": "Cup and Saucer",
    "trail_id": "1267"
}