{
    "description": "A comprehensive online map can be found: hereThis map shows all existing Trail Heads and Trails, each shown in different colors. These correspond with the colored markers that can be found on the trails. Brief descriptions of each trail are also provided under the map.TOWER TRAIL - Difficult Hike (Time=16min, Length=1km, Elevation change=150m)Connects Grand Overlook to the summit of Spion Kop. This trail is very steep with a short scramble near the top. The Tower Trail is identified with white markers.",
    "directions": "Directions to GRAND OVERLOOKThe Grand Overlook is the termination point of the Paintbrush Trail and the Arrowleaf Trail. Refer to either of those trails to approach the Grand Overlook. The Tower Trail begins here. Directions to RAVEN RIDGE TRAIL HEAD for the Paintbrush TrailFrom Highway 97, take Oceola Road past The Lakes subdivision, turn north onto Carr?s Landing Road. Turn onto Moberly Road then left onto Forest Hill Road. Enter the Raven Ridge subdivision on Townsend Drive, take Northstar Lane to the very top. Park near the water tank. If the gate is closed, park at the gate and continue on foot to the water tower. Paintbrush Trail head begins right behind the water tank and is identified with orange trail markers. Adjacent to the water tank you can enjoy the new District of Lake Country Raven Ridge Park with picnic tables and magnificent views. The Ridgeline Trail is identified with blue markers.Directions to UPPER LAKES TRAIL HEAD for the Arrowleaf TrailFrom Highway 97, take Oceola Road to \"The Lakes\" subdivision turning right onto Lake Hill Drive, turn left onto Shoreline Drive and then left onto Apex Drive. At the end of Apex Drive continue up gravel road to the left to the parking area below the water tank. Trail Head is marked with a WALC (Walk Around Lake Country) sign. Arrowleaf Trail is identified with yellow trail markers.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/12676/long_GRAND-OUTLOOK2-58520.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12676/long_Summit-58520.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12676/reg_GRAND-OUTLOOK-58520.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12676/reg_GRAND-OUTLOOK-south-58520.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12676/reg_Spion-Kop-Scree-58520.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12676/reg_Spion-Kop-Trail-58520.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12676/reg_Tower-Trail-58520.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12676/reg_Tower-Trail-scramble-58520.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12676/reg_Tower-Trail2-58520.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12676/narrow_Lake-Okanagan-58520.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12676/narrow_Wood-Lake-and-Duck-Lake-58520.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/spion-kop-tower-trail-near-kelowna-bc-12676",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "1 km",
        "Town": "Kelowna, BC",
        "Type": "out-and-back"
    },
    "title": "Spion Kop TOWER TRAIL",
    "trail_id": "12676"
}