{
    "description": "The start of the trail from the parking lot is quite steep for about 3-5 minutes, but soon levels off. Most of the trail is minor up's and down's. A small creek crossing after the first 5 kms or so. Then another big ascent that lasts about 5 mins., bringing ya to the top of the trail. Getting ya pumped up for the descent on the backside. Once down, ya come to a bit of a clearing and a major creek crossing(if the water levels are higher then usual), a little bridge has been made on the far right of the creek crossing. Can be riden across its 15-20 foot mouth, and 1-2 feet depths.If ya read the creek right. Just past this creek is a great spot to have lunch. This is pretty much the half way point. Then the trail winds back through some trees, and then along side a neighbouring mountain, making some of the inclines and declines difficult to ride and unsafe if a stay in the saddle while riding over some of the big rocks and loose shail. After a few kms of this, the trail is up and down again, and once ya notice some cows in the area,ya know your getting closer to the hi-way and to the end of the trail.NTS Map: 082J15Elevation Gain: 450 m (1,475 ft).",
    "directions": "Take hi-way 1 west of calgary, to hi-way 22. Turn right onto underpass to gain access to hi-way 22. Follow hi-way 22 all the way to Bragg Creek. Once your at the crazy 4way stop. Turn left, which is how hi-way 22 continues on. As 22 comes to a T-Intersection, turn right. This is where it turns into hi-way 66. Follow hi-way 66 for a good 15 minutes or so, til ya see the winter gate, which is right by the turn off for the Elbow Falls parking look.  Right past the winter gate on the right hand side is where you will see a sign labelled \"Powderface\". The parking lot is about 100 meters a head. Not a big trail head parking lot but if its full, there is also an inlet for parking across hi-way 66. Or in the ditch along the hi-way.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/1268/reg_map.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1268/topo_powder_best1_.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/up-powderface-creek-to-down-powderface-ridge-near-kananaskis-ab-1268",
    "stats": {
        "Activities": "hike mtn-bike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 4,
        "Time": "4 hrs",
        "Total Distance": "18 km",
        "Town": "Kananaskis, AB",
        "Type": "out-and-back"
    },
    "title": "Up Powderface Creek to Down Powderface Ridge",
    "trail_id": "1268"
}