{
    "description": "A comprehensive online map can be found: hereThis map shows all existing Trail Heads and Trails, each shown in different colors. These correspond with the colored markers that can be found on the trails. Brief descriptions of each trail are also provided under the map.PAINTBRUSH TRAIL - Moderate Hike (Time=39min, Length=2.6km, Elevation shange=130m)This main trail connects Raven Ridge Trail Head to the Grand Overlook. It climbs through lovely, cool forested areas and after the big switchbacks breaks out into great vistas of Okanagan Lake. The RIDGELINE TRAIL can be taken to return to the Raven Ridge Trail Head.",
    "directions": "Directions to RAVEN RIDGE TRAIL HEADFrom Highway 97, take Oceola Road past The Lakes subdivision, turn north onto Carr?s Landing Road. Turn onto Moberly Road then left onto Forest Hill Road. Enter the Raven Ridge subdivision on Townsend Drive, take Northstar Lane to the very top. Park near the water tank. If the gate is closed, park at the gate and continue on foot to the water tower. Paintbrush Trail head begins right behind the water tank and is identified with orange trail markers. Adjacent to the water tank you can enjoy the new District of Lake Country Raven Ridge Park with picnic tables and magnificent views. The Ridgeline Trail is identified with blue markers.",
    "geohash": "c2ghf",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/12686/long_Paintbrush-Trail-58520.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12686/long_Raven-Ridge-Trailhead-Parking-Lot-58520.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12686/reg_GRAND-OUTLOOK-58520.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12686/reg_Nice-View-58520.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12686/reg_Ridgeline-Trail-58520.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12686/narrow_Summit-Trail-58520.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/spion-kop-paintbrush-trail-near-kelowna-bc-12686",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "3 km",
        "Town": "Kelowna, BC",
        "Type": "out-and-back"
    },
    "title": "Spion Kop PAINTBRUSH TRAIL",
    "trail_id": "12686"
}