{
    "description": "Starting on the old Mountain Highway road leading up Mt. Fromme in North Vancouver, This wooded trail has only a few hundred meters of total rise and fall. It passes by a very large old growth Cedar tree (thus the trails name) on it's way to Kennedy Creek and it's waterfall. Trail length is the in and out distance.Park in the new parking lot past the gate at the end of Mountain Highway in N. Vancouver. Walk up the old road leading up Mt. Fromme for about 300M to find the only trail sign marking the start of the trail on the right. Cross a wooden bridge very soon and continue north until the trail soon degrades into a walking trail. Don't be fooled by all the bike trail intersections. If after 5 minutes you are still on a bike suitable trail, backtrack and find the walking trail. About 3km in you will see the old growth cedar tree the trail is named after. It is at least 12' in diameter at it's base. Continue uphill past the tree following the trail looking for plastic flags where the trail gets indistinct. Arrive at the Kennedy creek to see the falls buried in the trees. Return on the same trail being careful to follow the main set of flags. If you find yourself going downhill for more than a few hundred meters, you probably have followed a few flags heading toward Lynne Creek, which peter out. If so, climb uphill till you intersect the main trail again and hike out.Trail is rough in sections and quite muddy in wet weather.",
    "directions": "Drive to end of Mountain highway in North Vancouver. Continue past gate (locked at 6pm) to a new parking lot. There are a lot of well marked mountain bike trails looping all over the woods here. Walk a few hundred meters up the old Mt. Fromme  road to find the marked trail head on the right side of the trail. It stars as a bike trail, so continue north at all intersections till yu loose all the bike trails.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/12683/long_2017-03-02-12.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/cedar-tree-trail-kennedy-falls-near-north-vancouver-bc-12683",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 3,
        "Time": "4 hrs",
        "Total Distance": "11 km",
        "Town": "North Vancouver, BC",
        "Type": "out-and-back"
    },
    "title": "Cedar Tree Trail (Kennedy Falls)",
    "trail_id": "12683"
}