{
    "description": "Géo-expédition de deux jours entre l'accueil Shannahan et Mauvaise avec oucher au refuge MontagneArt[b]Jour 1: Accueil Shannahan vers Refuge Montagne-Art[/b]Après un bonne nuit de sommeil dans notre petit campeur stationné à l'accueil Mauvaise, on entend arriver nos amis vers les 7:15. On fera ensuite le transit vers Shannahan en laissant des véhicules à ce point-ci.On signera la cache de l'accueil Shannahan vers 8:00. On débutera alors notre randonnée qui nous mènera jusqu'au refuge Montagne-Art en fin d'après-midi peu après 17:00.Aujourd'hui  nous avons parcouru 19km pour une durée de 9h20 incluant la recherche d'une soixantaine et plus de géocaches. Le dénivelé total en montée fût de 725m et en descente de 563m avec une altitude maximale atteinte de 543m et minimale de 181m.Le sentier d'aujourd'hui a débuté avec un terrain assez plat car on suivait souvent la rivière. Il était assez large et bien aménagé. On constate qu'on est proche de l'accueil et que ces sentiers sont souvent parcourus pour les randos d'un jour ; le sentier de la Yourte au Refuge étant beaucoup plus rustique.Et puis on arrive à l'étonnante chute Delaney. Wow! quelle belle surprise que cette incroyable chute segmentée ! Comme on pouvait s'y attendre, c'est ensuite que la vraie montée survient qui nous mènera jusqu'au panorama de la Yourte et puis par mont et par vaux jusqu'au refuge Montagne-Art ![b]Jour 2: Refuge Montagne-Art vers accueil Mauvaise[/b]Il a beaucoup plu vers les 4-5 h du matin et c'est sous la pluie que le camp se réveille vers les 6h30. On garde le moral et c'est avec la bonne humeur que chacun s'occupe à déjeuner et à refaire son paquetage. Quand on quitte le refuge vers les 8:00 la pluie a déjà cessée! Yes! On est béni ! Les sentiers auront toutefois bien soufferts de l'ondée nocturne et on fera maint et maint petits détours pour éviter les sections les plus boueuses. Pas grave, y pleut pas au moins !Aujourd'hui nous avons parcouru 9.7km pour une durée d'un peu plus de 5h incluant la recherche d'une trentaine de géocaches. Le dénivelé total en montée fût de 264m et en descente de 460m avec une altitude maximale atteinte de 566m et minimale de 266m. Du refuge, on monte pour un bon 2km jusqu'à atteindre 566m qui nous semble être le point le plus élevé de notre parcours. Et puis on redescend souvent pour mieux remonter et vice-versa  jusqu'à arriver à la descente finale vers l'accueil Mauvaise.Vers 13h, on est de retour à notre point de départ d'hier matin! Fatigué  mais tellement heureux d'avoir réussi qu'on va certainement remettre ça pour faire l'autre section allant vers Perthuis!",
    "directions": "Accueil Shannahan (Parking Area)\tN 47° 04.477 W 071° 53.428",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/QC/12699/reg_-001DSCN8927-58699.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/12699/reg_-001DSCN8947-58699.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/12699/reg_DSCN8966-58699.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/12699/narrow_-001DSCN8921-58699.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/brasdunord-shannahan-mauvaise-near-saint-raymond-pq-12699",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall winter",
        "Stars": 3,
        "Time": "15 hrs",
        "Total Distance": "30 km",
        "Town": "Saint-Raymond, PQ",
        "Type": "out-and-back"
    },
    "title": "BrasDuNord - Shannahan-Mauvaise",
    "trail_id": "12699"
}