{
    "description": "Ridgeline Trail follows the entire length of ridgeline from the highway to the summit of Coliseum Mountain offers much more excitement than old Coliseum Mountain. The trail is easy to follow due to orange ribbons on the trees every 10-15m. Hard to get lost as long as you pay close attentions to the flagging. The ribbons disappear above the treeline but the route is obvious at that point.Initially, the trail follows beside steep drop-offs. It levels out before climbing steeply over a few cliffbands. At one point, a ladder and a rope makes it easier to ascend an almost vertical cliffband (see a picture).  Follow orange ribbons all the way to ridgeline if the trail is not distinct.Once on the ridge, a pleasant ridgewalk leads to South Summit, which greets you with a huge cairn. At this point, you connect with main Trail and are still 1.2km from the \"cap\", the true summit of Coliseum Mountain.NOTE: While I did it in the winter on snowshoes, I recommend it only to experienced adventurers. In winter conditions, it's more a scramble than a hike. Potential avalanche terrain, crampons and ice-axe might be needed, depending on snow quality.",
    "directions": "Park your vehicle at Beaverdam Recreation Area, 4.5km east of Nordegg.Cross the highway and walk approximately 400m west along the highway untill you see the sign \"No Off-Highway Vehicles Permitted\" on an old ATV track (see picture). That's the trailhead.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/12696/long_0-Coliseum-mountain-10101.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12696/long_1-Trailhead-10101.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12696/long_2-Trail-10101.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12696/long_3-Ladder-10101.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12696/long_5-Crux-10101.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12696/long_6-Summit-Block-10101_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12696/long_Ridgeline-Trail-on-GoogleEarth-10101.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/coliseum-mountain-ridgeline-trail-near-rocky-mountain-house-ab-12696",
    "stats": {
        "Activities": "hike snowshoe",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "6 hrs",
        "Total Distance": "17 km",
        "Town": "Rocky Mountain House, AB",
        "Type": "out-and-back"
    },
    "title": "Coliseum Mountain Ridgeline Trail",
    "trail_id": "12696"
}