{
    "description": "Le sentier est nommé en l?hommage à Vianney Guillemette. Dévoué à son rêve de développer le Sentier national dans la Réserve faunique Mastigouche, il a ?uvré jusqu?à son décès comme directeur de la Coopérative des travailleurs de Mastigouche.Tracé dans un territoire méconnu, isolé dans la forêt mauricienne, ce sentier sillonne des collines, des crêtes et côtoie quelques lacs sur lesquels on a des points de vue. Le départ se trouve près du stationnement de l?'accueil Pins-Rouges de la Réserve faunique Mastigouche. Après avoir marché 10,9 km vers l?est, nous arrivons au refuge Le Huppé, en bordure du lac du même nom, où il est possible de passer la nuit. On doit cependant le réserver auprès de Réserve faunique aux numéros de téléphone cités dans la section Hébergement. Par la suite, on atteint le vaste lac Shawinigan où une passerelle permet d'?accéder à un stationnement.",
    "directions": "Voies d?accès :Accueil Pins-Rouges, Réserve faunique de Mastigouche, Saint-Alexis-des-Monts, payant, 3 saisonsLac Shawinigan (par la Route 11), Réserve faunique de Mastigouche, Saint-Alexis-des-Monts, payant, 3 saisonsPour se rendre à la Réserve faunique de Mastigouche : Dans la ville de Louiseville (en Mauricie), empruntez la route 349 Nord jusqu?au village de Saint-Alexis-des-Monts. Suivre les indications de la Réserve faunique Mastigouche. L'accueil Pins-Rouges est localisé à 24 km au nord du village.",
    "geohash": "f2",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/QC/12700/narrow_20151018-081730-s-58699.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mastigouche-sentier-vianney-guillemette-near-saint-mathieu-pq-12700",
    "stats": {
        "Activities": "hike snowshoe",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 4,
        "Time": "6 hrs",
        "Total Distance": "16 km",
        "Town": "Saint-Mathieu, PQ",
        "Type": "out-and-back"
    },
    "title": "Mastigouche - Sentier Vianney-Guillemette",
    "trail_id": "12700"
}