{
    "description": "Nova Scotia never fails to amaze me!  I was travelling for work to Yarmouth and decided I needed a bit of hiking to stretch my legs.  I had previously been to the Cape St Mary's lighthouse but saw that I had missed some more significant features to the east of it.   In the same area, I have also hiked smugglers cove to the natural arch at Bear Cove and another area west of Bear Cove called Deveau shore (both adventures in trailpeak of course!)I set off on an ATV path which led me to the cliffs...unfortunately the ATV path is now off limits because of two houses that were built on the cliff tops!  I could see that east of the houses, was a bunch of sea caves at the bases of huge cliffs.  We drove a bit farther on the gravel rd and then walked on a muddy ATV path all the way to a huge bog.  I could see some atv path in the bog and I tried to follow them to see if they would lead to the cliffs.  We missed the main atv path and ended up bushwalking for 150m to the cliff top...on the way back we found the main atv trail through the bog all the way to the muddy track where we started. There are some areas on the cliff tops that are devoid of trees and you can peer to the shore way way below you...those sea caves from that angle look awesome (an they were!).   I found a rope leading down to the beach but instead of relying on it, I carefully down climbed a very steep slope with one vertical part of about 6ft all the way tooth beach below.I could see on the next bend of the Grand Anse, some more ropes leading to the beach.   Once on the seafloor i visited at least 3-4 main sea caves and countless others.  Working from the west to east is better as there are tall rocks you can jump off to the next beach but they would be hard to climb as they are covered in seaweed...maybe at the very very low tides you could go around.   I made my way up on the other side of the cove again in an area that had a rope but I didn't trust it too much so I was super careful in the loose slate scree slope.Getting down to the shore is not for everybody and maybe should only be done by using a rope you bring yourself.",
    "directions": "Highway 1 near Mavillette.  Turn on Cape St Mary's Rd and then turn right on BaseLine Rd where there is a sign for a B&B.  Park where the last house entrance is located on the left ut a muddy path continues straight  to the large bog about 100m away.",
    "geohash": "dxbfv",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/12709/reg_DSC-0203-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12709/reg_DSC-0211-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12709/reg_DSC-0220-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12709/reg_DSC-0234-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12709/reg_DSC-0242-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12709/reg_DSC-0248-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12709/narrow_DSC-0228-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/grande-anse-near-yarmouth-ns-12709",
    "stats": {
        "Activities": "hike sea-kayak climb",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 5,
        "Time": "2 hrs",
        "Total Distance": "3 km",
        "Town": "Yarmouth, NS",
        "Type": "out-and-back"
    },
    "title": "Grande Anse",
    "trail_id": "12709"
}