{
    "description": "A lot of people know the main Bennery Brook Fall.  The fall is located on the side of highway 102 just before the airport exit if heading south towards Halifax.  I had a good hunch that a better fall existed further upstream.   I chose an old road that would lead me to some of the upstream areas.  The road was a bit overgrown but immediately there was the sound of waterfall.  The road still cuts one of the branch of the brook and upstream and downstream of the road are a few cascade type falls flowing over red coloured rocks.  there is even the old culvert that used to be in place..it's huuuuge!Next up, I made my way through the mixed forest to the branch of the brook I wanted to follow.  The brook enters a nice deciduous patch of trees that reminds me of Keji.  A bit further upstream there are a few small cascades set in rocks.  The area here is surrounded on each side by small hills and sure enough in an area about 1.2km after leaving the highway is hidden a very nice 12 ft true drop fall.  the fall is framed by rock alls on either sides and a nice deep poll right in front!I thought it was a good discovery! That is until I noticed some flagging tape...Someone else had been here before!  On my way back I noticed a nice blind close to the highway and another brook which flows under the highway near the parking with a small man made drop.",
    "directions": "Highway 102 south, There is an old overgrown road right behind the sign indicating the airport hotels.  Park there.   The semi-secret fall is at; 44.897228, -63.543295",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/12705/reg_DSC-0064-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12705/reg_DSC-0028-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12705/reg_DSC-0046-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/bennery-brook-secret-fall-near-halifax-ns-12705",
    "stats": {
        "Activities": "hike snowshoe",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "3 km",
        "Town": "Halifax, NS",
        "Type": "out-and-back"
    },
    "title": "Bennery Brook Secret Fall",
    "trail_id": "12705"
}