{
    "description": "This is a moderate trail (can be called difficult because of it's length) starts at the Ship Creek Road trail head.  You will want to park cars at the China Creek trail head 11KMs farther up Franklin River Road.Some of the below description is taken from the ACRD pamphlet:From the Ship Creek Road trailhead, the trail rises through the working forest to alookout with a panorama from the City of Port Alberni across to Mount Arrowsmith.Approximately 2 km from the start, it connects up with a logging road and turns westtowards the Alberni Inlet. Another 0.6 km further at the next signpost, there are two route options descending to the Inlet: the first along Follinsbee Creek, which is less demanding and the second is by way of the Lookout and the old Copper Mountain Trail.  The Lookout provides views up the inlet to the north and south west and is included in the GPS track below.The trail continues south along the water with several changes in elevation along the way, at around the 9KM mark, it turns away from the water.   At the 12KM mark the trail comes to a logging road with a yellow gate at the left end, cross over this road and continue on the trail thru the forest and over China Creek.Stage 1 ends at a private industrial road. All trail users are requested to approach thisarea with caution and provide right-of-way to any industrial traffic they may encounter.",
    "directions": "From the Visitors Information Centre, take Highway 4A,  following the signs toBamfield. Drive 3.8 km to the traffic light on 10th Avenue.  Turn left onto 10th andcontinue a further 1.2 km to the four-way stop at Argyle. Turn left on Argyle, then 0.3km ahead turn right on Anderson for a further 2.2 km to where it meets Ship CreekRoad. The parking lot for the trailhead is directly opposite the junction",
    "geohash": "c0x",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/12707/reg_IMG-4846-58210.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12707/reg_IMG-4857-58210.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12707/narrow_IMG-4843-58210.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12707/narrow_IMG-4847-58210.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12707/narrow_IMG-4853-58210.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12707/narrow_IMG-4856-58210.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12707/narrow_IMG-4859-58210.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12707/narrow_IMG-4860-58210.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/alberni-inlet-trail-stage-1-near-port-alberni-bc-12707",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 5,
        "Time": "6 hrs",
        "Total Distance": "15 km",
        "Town": "Port Alberni, BC",
        "Type": "out-and-back"
    },
    "title": "Alberni Inlet Trail Stage 1",
    "trail_id": "12707"
}