{
    "description": "Le nom de ce tronçon a été donné en mémoire de l?Abbé Roland Leclerc qui est décédé par noyade le 21 novembre 2003 dans les eaux du lac en Croix. Personnalité engagée dans la communauté mauricienne, excellent communicateur à la télévision et grand amant de la Nature de Saint-Mathieu-du-Parc, il mérite que l?on redore ce lieu en lui rendant hommage. Nous croyons que ce tronçon du sentier national saura plaire aux randonneurs par la maturité de ses arbres et par la luminosité qui y pénètre.Ce tronçon est en bonne partie situé dans le parc récréoforestier de Saint-Mathieu-du-Parc au sud-ouest du lac en Croix et du lac Barnard dans la municipalité de Saint-Mathieu-du-Parc. Il reliera les tronçons déjà inaugurés du côté ouest, le Vianney-Guillemette dans la réserve faunique Mastigouche, et du côté est, la Chute du Diable situé dans le parc récréoforestier de Saint-Mathieu.Le sentier Roland Leclerc commence au stationnement du lac Shawinigan (accessible par la réserve faunique Mastigouche) pour se terminer au lac en Croix (accessible par le village de Saint-Mathieu-du-Parc). À partir du stationnement du lac Shawinigan, le randonneur aura à traverser, à l?embouchure du lac, sur une nouvelle passerelle de bois inaugurée à l?été 2011. Une montée attend le randonneur pour ensuite parcourir quelques kilomètres dans une forêt mature de feuillus et de conifères, pour ensuite descendre vers le lac Barnard. Un petit abri quatre places y est accessible pour coucher ou s?abriter. Le sentier poursuit en longeant le lac sur près de deux kilomètres avec quelques points de vue sur ce dernier jusqu?à atteindre une magnifique chute d?eau qui se trouve à mi-chemin du tronçon. C?est l?endroit idéal pour prendre une pause et quelques photos.Par la suite, le sentier pénètre dans une forêt de feuillus, tout en s?éloignant pour contourner le lac en Croix. Cette dernière portion permettra d?apprécier différents passages tels qu?une passerelle sur marécage et un gigantesque cap de roc qui incitera surement quelques-uns à y méditer. Le tout se terminera par une descente d?escaliers en bois et en pierres pour finalement longer un étang jusqu?au stationnement du lac en Croix.",
    "directions": "Voies d?accès :Lac Shawinigan (par la Route 11), Réserve faunique de Mastigouche, Saint-Alexis-des-Monts, payant, 3 saisonsLac en Croix, Saint-Mathieu-du-Parc, gratuit, 3 saisonsPour se rendre à la Réserve faunique de Mastigouche : Dans la ville de Louiseville (en Mauricie), empruntez la route 349 Nord jusqu?au village de Saint-Alexis-des-Monts. Suivre les indications de la Réserve faunique Mastigouche. L'accueil Pins-Rouges est localisé à 24 km au nord du village.Pour se rendre au lac en Croix : de l?autoroute 55, prendre la sortie 217. Prendre la route 351 Nord. Dans le village de Saint-Mathieu-du-Parc, prendre en direction nord-ouest le chemin Saint-Édouard, qui deviendra le chemin Lac-en-Croix. Du village, calculer une distance de 12.5 km environ.",
    "geohash": "f2k1",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/QC/12701/long_20151016-172811s-58699.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/12701/long_20151017-085035s-58699.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/12701/narrow_20151017-091916s-58699.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mastigouche-sentier-roland-leclerc-near-saint-mathieu-pq-12701",
    "stats": {
        "Activities": "hike snowshoe",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 4,
        "Time": "5 hrs",
        "Total Distance": "12 km",
        "Town": "Saint-Mathieu, PQ",
        "Type": "out-and-back"
    },
    "title": "Mastigouche - Sentier Roland Leclerc",
    "trail_id": "12701"
}