{
    "description": "Skinner Brook Falls are very unknown waterfalls located in an area where you wouldn't expect to see any features.   The journey to these falls is mostly on some woods road which are quickly deteriorating.  Once parked, its a short bushwack of about 400m to the brook.  I stumbled upon the brook a bit upstream of the falls.  Quick decision was to decide which way to go.  I decided downstream and was correct for once!  The falls are not very high about 8 and 10 feet for the two main ones but there are lots of small cascades in between.  The scenery is breathtaking with an old growth hemlock stand and the unique geology around the brook.  There are large boulders on the side of the brook and even one in the middle which cleaves the brook in two and forms two waterfalls, one on each side.If these waterfalls were located in Cape Breton or the Cobequid Hills, I probably wouldn't bother travelling to see them.  However on the south shore of NS, the falls are so few that this is well worth the detour.",
    "directions": "Exit 6 on the 103.  Take the Mill :Lake Road No 1 to the north and turn right on Mill Brook Lane.  Go don the hill, cross the brook, up the hill and then turn to the left.  there should be a DNR gate coming up but they do no lock it anymore.  Drive 2.9km and then turn on a main secondary road on your right.  Drive on it, for 1.15km.  There are lots of offshoots from this secondary road and you will need a gps to make sure you take the one getting you close to the brook and falls (N44 40 24.4 W64 04 23.3).",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/12717/reg_exit6-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12717/reg_exit6-copy-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12717/reg_exit6b-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12717/reg_exit6c-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12717/narrow_exit6a-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/skinner-brook-fall-near-mahone-bay-ns-12717",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "1 km",
        "Town": "Mahone Bay, NS",
        "Type": "out-and-back"
    },
    "title": "Skinner Brook Fall",
    "trail_id": "12717"
}