{
    "description": "From time to time, I get to work in Cape Breton near Cheticamp.  In April of this year, the snow was melted in the foothills of the highlands and I decided it was time I checked out a possible gorge and falls on the main stem of the Factory Brook.  In a previous post, I described another tall fall on a tributary of this brook.Setting off from the bridge over the brook, the forest is dense and full of deadfall.  My best advice is to climb as high as you can on the right hand side if facing upstream.   Once you get about 800m from the starting point there is a nice, almost gorge-like feature with a very good size waterfall (40ft) and a few more smaller one before and after.   The descent is very steep but manageable.Hike up another 500m or so and you get to another series of features.  these are a series of slider falls with a larger one at the top.   Another 300m from there, brings you to a tributary on the left.  About 1000m up the tributary is a two-tier 50ft waterfall.  this one may go dry in the summer.  I wanted to push on the main stem to get further upstream but unfortunately, the snow pack got to about thigh height.  In places where there was bare ground, the moss was completely frozen and very hard to hike on without falling over!I decided to get to the top of the highlands by the last waterfall.  the ascent was very steep.  At the top the forest is being actively eaten by a large moose population.  Droppings were everywhere and I had a nice view all the way to the Gulf of St Lawrence.  I continued on the top of the mtn and dropped into the next ravine.  I was so lucky, right in front of me was a very well maintained ATV trail which eventually brought me back to my truck saving me at least an hour of bushwacking!  That ATV trail actually goes right by a fall described in another trailpeak post.",
    "directions": "Cabot Trail to Grand Etang.  turn on Ch du Lac and drive on it to a small bridge at; N46° 33' 27.8\" W61° 00' 42.7\".  this is the brook you need to follow.  Main fall is at; N46° 33' 11.2\" W61° 00' 11.7\" and upper one at; N46° 32' 49.0\" W60° 59' 52.8\"",
    "geohash": "f8k8g",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/12719/narrow_18033478-885774551562390-1387893591697449583-n-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12719/narrow_18056949-885774628229049-981428435358736422-n-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/factory-brook-gorge-and-upper-fall-near-cheticamp-ns-12719",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "5 km",
        "Town": "Cheticamp, NS",
        "Type": "out-and-back"
    },
    "title": "Factory Brook Gorge and upper fall",
    "trail_id": "12719"
}