{
    "description": "Sometimes I need to get out and hike and explore something new in this province.   I had read a few blogs about Ross Creek Cove and the coves next to it which are full of minerals and fossilized trees!On a PD day, the kids and I set off from the beach and immediately had to construct a make shift bridge over a small stream.   That being done we continued on the beach going east.  There is no trail, the purpose is to follow the shoreline and going cove to cove find as much minerals as possible.  The first cove was where we could see the fossilized trees the most.  They are set within the rocky bank.Cool minerals are everywhere you look, some in the rocky cliffs some within the rocks.....you can spend a lot of time here.  There are a few passages that you will need to walk on some pretty slippery rocks and of course the whole thing can only be done at low tide so check the tide charts before setting off.From https://www.mindat.org/loc-33819.html; Zeolites filling amygdules and veins in North Mountain basalt. There are also outcrops of the fossiliferous McCoy Brook Formation in some of the coves to the east. The McCoy Brook Formation overlays the basalts and consists of mud limestone and wackestone. These rocks also contain small amounts of zeolites. Fossil tree strumps are sometimes hollow with the cavity lined with amethyst or rarely smoky quartz.",
    "directions": "Highway 358 towards Cape Split.  Turn on Ross Creek Rd at the top of the North Man.  Drive to the end of it and park by a few cottage and a small stream.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/12728/reg_DSC-1131-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12728/reg_DSC-1135-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12728/reg_DSC-1167-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12728/narrow_DSC-1151-27177_best1_.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/ross-creek-mineral-hounding-near-canning-ns-12728",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "3 km",
        "Town": "Canning, NS",
        "Type": "out-and-back"
    },
    "title": "Ross Creek Mineral Hounding",
    "trail_id": "12728"
}