{
    "description": "Completed on April 14, 2017. Deep snow and snowshoes were necessary today.This is only a hike but my GPS track involves some easy bushwhacking as we couldn?t see the official trail sometimes so we were just trying to find the fastest way to go.3.5 to 7 hoursElevation of 617 m NET, 656 m TOT & max 2060 m Gear: A compass and/or a GPS might be useful for the bushwhacking/route finding in the forest in winter conditions even though there are obvious Parks Canada signs at the beginning.*****We tried this hike for the first time, having seen the lakes from Storm Mountain summit a few years ago. This is just a hike but we thought it was physically challenging with all that steep and later heavy snow. We had no choice but to put our snowshoes on at the gate (it was closed but only about 200 metres from the parking lot and trailhead).We snowshoed down to the parking lot and followed the signs for the first 1-2 km. Then we kept going on what seemed to be the official trail as we had ski tracks to rely on making it easier to go on with that steep snow. We lost track at some point and used our GPS to go up to the lakes. If we go there again, we will rather use the other trail starting from the 93 S rather than the 93 and AB-1 junction. 2 reasons for that: It is way shorter and not worth doing 17 km with partial or no views most of the time and you get to see 4 lakes when using that other trail. As always around Storm Mountain, it was snowing heavily when we got close to Lower Twin Lake.",
    "directions": "From Banff, continue on Trans-Canada Highway/AB-1 W for about 29km and take the AB-93 S exit toward Radium Hot Springs. Take your first left right after the bridge and park by the gate (or parking lot about 200 metres lower if the road is opened).",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/12720/long_Twin-Lakes-Banff-Lower-Lake-APR-14-2017-1-1024x310--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12720/long_Twin-Lakes-Banff-View-Storm-Mountain-APR-14-2017-1024x252--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12720/reg_Twin-Lakes-Banff-Castle-Mnt-Behind-APR-14-2017-1024x913--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12720/reg_Twin-Lakes-Banff-Steep-Snow-APR-14-2017-1024x775--44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/twin-lakes-from-trans-canada-hwy-near-banff-ab-12720",
    "stats": {
        "Activities": "snowshoe ski-xc hike",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 2,
        "Time": "5 hrs",
        "Total Distance": "17 km",
        "Town": "Banff, AB",
        "Type": "out-and-back"
    },
    "title": "Twin Lakes (From Trans-Canada Hwy)",
    "trail_id": "12720"
}