{
    "description": "This is a hike to some mostly unknown waterfalls near Nictaux Falls.  I lucked out on some old map from 1890 of the nearby mining district of Torbrook.  On tis map, Delanceys Brook was showing a 15 fall and cascade.  i looked at some satellite imagery and could see a big opening in the canopy in the same vicinity.  there was also a logging road close-by so it want even a hard hike to get to it!The road is in ok shape...if you don't like it or have a low clearance just start hiking soon.  the road eventiually crosses Delanceys Brook upstream of the potential falls.   A short walk on the side of the river by some small cascades eventually brought me to the hole in the canopy.  There a small fall of about  feet is surrounded on one side by some really cool rock formations...you could even set up a single tent with quite the view on the large pool.  Looking downstream I could spot  large drop!   A walk of 50 m led to the falls!  Yes multiple falls!  The river after the large pool split in two branches (which I didn't see), and then the river has two falls separated by an island!",
    "directions": "Highway 10 south from Middleton. Turn right on Alpena Rd, then right on Inglisville Rd it becomes a dirt road and then branches n a few directions.  Keep on the main branch until you reach Delanceys.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/12726/reg_DSC-0970-1--27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12726/reg_DSC-0949-1--27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12726/reg_DSC-0949-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12726/reg_DSC-0970-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/delanceys-brook-falls-near-middleton-ns-12726",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "1 km",
        "Town": "Middleton, NS",
        "Type": "out-and-back"
    },
    "title": "Delanceys Brook Falls",
    "trail_id": "12726"
}