{
    "description": "Again I lucked out in spotting those falls on an old geological map!   The map was describing a few falls of 10 and 30ft on a tributary and then a few 15 and 10 footers on the Black River.I drove down a well maintained dirt road all the way to an entrance of a quarry.  the road continued but was no ,longer maintained after that.  I set off on foot on the alder chocked road and got to the tributary within 300m.  I followed this tributary through a mature evergreen forest.  The 10 ft fall wasn't spectacular and the 30ft is unfortunately not in one drop but rather a few cascade in a row.  at times of higher water it would probably be better!Right after the fall, you reach the Black River and then just a minute upstream is the series of 4 magnificent falls.   The first one splits into two sides of a small island.  There were some signs of human activity but I think this spot remains mostly unvisited!",
    "directions": "Torbrook Rd, turn on Bloomington Rd and drive south all the way to Allen Lake Rd.  Take two sharp bend on Allen Lake Rd, cross the Black River (one 10ft fall downstream of the bridge) and the next sharp bend is the location of the quarry.  Park here and continue on the old road until you reach a small tributary.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/12727/reg_DSC-1000-1--27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12727/reg_DSC-1000-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12727/reg_DSC-1020-1--27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12727/reg_DSC-1020-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12727/reg_DSC-1022-1--27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12727/reg_DSC-1022-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/black-river-falls-near-middleton-ns-12727",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "2 km",
        "Town": "Middleton, NS",
        "Type": "out-and-back"
    },
    "title": "Black River Falls",
    "trail_id": "12727"
}