{
    "description": "Completed on April 22, 2017. Steep snow only in one section but dry otherwise. Good shoulder season hike.This is only a hike on an obvious trail but my GPS track involves some easy route finding as we tried to avoid the snow as much as possible on our way back.3 to 6 hoursEdwards Rating: N/A - HikeElevation of 698 m NET, 783 m TOT & max 2198 m Gear: Snowshoes would have been useful for that one section where snow was really steep. Other than that, it is really just a hike so our hiking poles as always!*****We already did Gunnery Mountain and Junction Hill recently and they are both easy and fun scrambles/hikes but with higher summits so there are preferred destinations in our opinion. This one is only a hike and the treed summit doesn?t allow for much views on the east side but going down a bit on the grassy slope allows for beautiful views of impressive peaks like Mount Armstrong, Strachan, McPhail & Bishop.Starting at the gate at GR687844, we followed the prospecting road for a while and then saw a flag on our left (GR683849). We followed this obvious trail until we saw a grassy hill (GR669861) on our right. We left the trail and hiked up there for a break and decent views to the south and east. We went back down and that?s when the nightmare began with steep snow for about 40 minutes. It should have taken 10 minutes to walk down in the valley. We finally reached back the trail sidesloping along Junction Hill and it was a bit better with about 2 feet of snow instead of hip-high a few minutes earlier. Once at the low point between Junction Hill summit on our left and Stony Ridge crest on our right, we hiked up right away to the crest such was a mistake because of the snow patches. We did lose elevation during the ridge walk to avoid some more steep snow. We reached the treed summit (658880) and went back down a few metres to the grassy slope to enjoy the views to the west before heading back. We avoided elevation gains by going down in the valley earlier and then we followed the trail along Junction Hill such brought us back to the main trail eventually. This is a nice hike but we definitely enjoyed the surrounding peaks and ridges more than this one.",
    "directions": "From Calgary, follow Trans-Canada Highway/AB-1 W, take exit 161A for AB-22 S toward Bragg Creek/Redwood Meadows and go south for about 88 km following directions to stay on AB-22 S. Just before Longview, turn right onto Highway 541 for 41.3 km where we parked on the right side of the road (between Gunnery Mountain & Junction Hill).",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/12721/long_Stony-Ridge-StonyCat-Kananaskis-APR-22-2017-8-1024x296--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12721/reg_Stony-Ridge-StonyCat-Kananaskis-APR-22-2017-5-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12721/reg_Stony-Ridge-StonyCat-Kananaskis-Crest-Burke-Behind-APR-22-2017-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12721/reg_Stony-Ridge-StonyCat-Kananaskis-View-Burke-Plateau-APR-22-2017-2-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12721/reg_Stony-Ridge-StonyCat-Kananaskis-View-Holy-Cross-APR-22-2017-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12721/reg_Stony-Ridge-StonyCat-Kananaskis-View-McPhail-Armstrong-APR-22-2017-1024x974--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12721/reg_Stony-Ridge-StonyCat-Kananaskis-View-Summit-APR-22-2017-1024x782--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12721/reg_Stony-Ridge-StonyCat-Kananaskis-Welcome-APR-22-2017-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12721/narrow_Stony-Ridge-StonyCat-Kananaskis-Worst-Snow-Ever.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/stony-ridge-or-stonycat-ridge-near-longview-ab-12721",
    "stats": {
        "Activities": "hike snowshoe",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 3,
        "Time": "5 hrs",
        "Total Distance": "11 km",
        "Town": "Longview, AB",
        "Type": "out-and-back"
    },
    "title": "\"Stony Ridge\" (or StonyCat Ridge)",
    "trail_id": "12721"
}