{
    "description": "I'm referencing http://trailpeak.com/index.jsp?con=trail&val=11294 There wasn't an actual GPS track from Spider Lake to Lake Major, so I created this entry.This is the simplest route I could find to follow West Brook to Lake Major. There is some bushwhacking, but nothing too difficult. If you follow the GPS track you'll avoid most of the deadwood/blow down that litters the whole area. At the top of the brook you'll see beaver activity. I just followed the brook until it got too difficult then tracked away and found what seems to me to be an old logging road. Follow that back to the brook; mostly climbing or ducking under some timber that has crossed the path. You will need to climb down to the water and back up on your return. I used a rope and anchored to a tree for safety. From there your maybe 5 minutes away from the lake.Just a great hike following the falls all the way down to the lake. There's fallen timber over the water at different spots that you could use to get to the other side.",
    "directions": "Park on the street at the end of Spider Lake Estates Road. As soon as you step in, turn right and follow the power lines. About a 7 minutes walk, take any trail you see on your left. This will take you to the right side of Spider Lake. The trail gets faint after Spider lake. Just hasn't been used in many years.",
    "geohash": null,
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/12723/reg_West-Brook-2-58226.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12723/reg_West-Brook-3-58226.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12723/reg_West-Brook-4-58226.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12723/narrow_West-Brook-1-58226.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/spider-lake-to-lake-major-along-west-brook-near-halifax-ns-12723",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 4,
        "Time": "4 hrs",
        "Total Distance": "8 km",
        "Town": "Halifax, NS",
        "Type": "out-and-back"
    },
    "title": "Spider Lake to Lake Major along West Brook",
    "trail_id": "12723"
}