{
    "description": "The Galena trail has be described in Beautiful BC magazine as an excellent ride or hike in the New Denver area of the Slocan Valley.The 13 km trail from Roseberry to Three Forks follows the abandoned Nakusp and Slocan railway. The trail features natural wonders, rock slides, steepr drop-offs, bridges and a cable car (you get to pull yourself across Carpenter Creek.As former railway line there is only minimal elevation change.Section from Roseberry to New Denver is better for biking than hiking.",
    "directions": "There are three access points.New Denver trailhead From New Denver: drive east on Hwy 31A, turn right (south) onto Dnver siding road, residential street marked by a blue and white hiker sign. Proceed 75 meters turn left toward highway maintenance yard and park.Three Forks trail head:Hwy 31 east from New Denver (8.2 km) or 39.5 west from Kaslo. At the junction signed for Sandon turn southeast and park at the pullout on the right. Trail starts about 75 meters south east by the interpretive signs.Sandon: depart hwy 31 at Three forks, heading southeast. At 5.6 km arrive at mining boomtown Sando. Proceed straight on Reco Street at 6km park on left by the Historic Railway interpretive sign just below the Tin Cup Cafe.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/1273/long_galmap.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1273/reg_galena-alamo-siding-7279.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1273/reg_galena-trail-2-7279.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1273/topo_helmetmonk99.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/galena-near-new-denver-bc-1273",
    "stats": {
        "Activities": "hike ski-xc mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 2,
        "Time": "50 hrs",
        "Total Distance": "13 km",
        "Town": "New Denver, BC",
        "Type": "out-and-back"
    },
    "title": "Galena",
    "trail_id": "1273"
}