{
    "description": "In and outside of the City of Saskatoon, on both sides of the river, there are sites and services to help you make the most of your day. Explore the natural habitat along the riverbank, discover culture at museums and interpretive sites, and take advantage of enhancements such as parks and canoe launches. Click here for our full Trail Brochure.Many parks and sites are located along the Meewasin Trail, a must-see attraction. The trail runs along both sides of the river, winding under the bridges, and through beautifully landscaped parks and natural areas. Residents and visitors flock to the trail to cycle, jog, stroll or simply gaze at the scenery.Exploring the trail is easy! Access points are found throughout the city, with maps and interpretive signage along the route.The Great Trail (formerly the Trans Canada Trail)In Saskatoon, 20 km of the Meewasin Trail is designated as part of The Great Trail. The trail starts in the northwest of the city crossing the river at Sid Buckwold Bridge (temporary crossing) and continues through historic Saskatchewan Crescent into beautiful Gabriel Dumont Park in the southeast where a TCT pavilion showcases more than 4000 names in support of this great legacy. The Great Trail is the world's largest network of trails. When completed, it will be 22,000 km, linking 1000 communities and over 33 million Canadians. Saskatchewan's goal is to mark and map 1400 km of trail within this network.",
    "directions": "932 Saskatchewan Cres EN52° 07.682' W106° 38.868'",
    "geohash": "c9k0t",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/SK/12737/long_20170516-070151-18265.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/SK/12737/long_20170516-071806-resized-18265.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/south-saskatchewan-river-loop-saskatoon-near-saskatoon-sk-12737",
    "stats": {
        "Activities": "hike mtn-bike",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "8 km",
        "Town": "Saskatoon, SK",
        "Type": "out-and-back"
    },
    "title": "South Saskatchewan River loop Saskatoon",
    "trail_id": "12737"
}