{
    "description": "*** Annual road closure (AB-532) between December 1 & April 30.Completed on MAY 13, 2017. Steep snow only on the north end of Hailstone and below Plateau Mnt when we returned. Good shoulder season hike.Edwards Rating: I (II) L MThis is mostly a hike but rated as an easy scramble as we did some bushwhacking and route finding when leaving the main road or trails a few times.6 to 10 hoursElevation of 463 m NET, 1160 m TOT & max 2378 m on Hailstone Butte (2370 m Sentinel Peak & 2240 m on \"Little Sentinel\")*****We had the idea of reaching every single high point today on that range starting with the south peak of Hailstone, down the road and up an unnamed ridge (let?s call it ?Little Sentinel?), down to Sentinel Pass and up to Sentinel Peak. Extreme and persistent cold winds made our day less enjoyable for sure but this was a great ridge walk and physical challenge with all the elevation loss we took to attain our goal.We started at the gate with these uninviting signs (see pic) and walked on the gravel road for about 600 metres where we could see a drainage on our satellite map. We cut into the forest to the right (GR803626) and hiked up until we reached the drainage at GR804627. We followed it for a few minutes but as the walls were raising quickly, we got out ad followed that gully to the left and up to the south ridge. We saw the first summit as we passed the tree line and hiked up a scree slope to get to it (summit at GR814638). From there on, we just followed the ridge going north and reached the true summit at the fire lookout (GR814649). We hiked all the way down the ridge and got caught in steep snow for a few minutes before we reached the road. We crossed that road and immediately started going up a steep grassy slope to complete the ascent of that unnamed ridge (summit at GR808675) between Hailstone and Sentinel Pass. We followed the ridge all the way down to the Pass and up Sentinel Peak (GR796699). From there, we hiked down the SW slope and cut to the left once in the valley to reach the grey boulders field we could see from the summit. We then crossed another meadow to get closer to Plateau Mountain where we thought we would find a good trail. That was a mistake and we lost a lot of time trying to reach the gravel road bushwhacking in steep snow. When we finally reached a gravel road, we turned left and followed it to an intersection where we turned left again to get back to the car. I didn?t look down the valley while traversing the ridges as I was hoping to do Plateau Mountain the same day but we didn?t have enough time to do it. It seems like staying low in the valley would have been easier avoiding all the steep snow we encountered the way we came back. This is the first time we explore that area and we really loved it despite the snow and extreme winds!",
    "directions": "From Calgary, follow Trans-Canada Highway/AB-1 W, take exit 161A for AB-22 S toward Bragg Creek/Redwood Meadows and go south for about 88 km following directions to stay on AB-22 S. 28 km passed Longview, turn right onto AB-532 and continue for 26 km. Turn right on a gravel road between Hailstone Butte-Plateau Mountain and park at the gate.",
    "geohash": "c2yt",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/12736/long_Sentinel-Peak-Summit-Kananaskis-View-Whole-Traverse-Route-MAY-13-2017-1024x437--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12736/reg_Hailstone-Butte-Traverse-Kananaskis-Up-South-End-MAY-13-2017-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12736/reg_Hailstone-Butte-Traverse-Kananaskis-View-Sentinel-MAY-13-2017-2-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12736/reg_Hailstone-Butte-to-Little-Sentinel-to-Sentinel-Peak-Traverse-Kananaskis-Inviting-Signs-at-the-Gate-MAY-13-2017-.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12736/reg_Hailstone-Butte-to-Little-Sentinel-to-Sentinel-Peak-Traverse-Kananaskis-View-Hailstone-Butte-MAY-13-2017-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12736/reg_Sentinel-Peak-Kananaskis-Beautiful-Plateau-Mnt-MAY-13-2017-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12736/reg_Sentinel-Peak-Kananaskis-Summit-MAY-13-2017-1024x768--44639_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12736/reg_Sentinel-Peak-Kananaskis-Summit-MAY-13-2017-2-1024x685--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12736/reg_Untitled-817x610--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12736/narrow_Hailstone-Butte-Traverse-Kananaskis-Steep-Snow-Down-North-End-MAY-13-2017-680x1024--44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/hailstone-butte-to-gr808675-to-sentinal-pass-peak-traverse-near-kananaskis-ab-12736",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "8 hrs",
        "Total Distance": "21 km",
        "Town": "Kananaskis, AB",
        "Type": "out-and-back"
    },
    "title": "Hailstone Butte to GR808675 to Sentinal Pass & Peak Traverse",
    "trail_id": "12736"
}