{
    "description": "*** Annual road closure (AB-532) between December 1 & April 30.Completed on MAY 21, 2017. Good shoulder season hike but a lot more snow than expected and pretty much everywhere on the huge plateau.Edwards Rating: I (II) M S (mostly a hike)This is mostly a hike but rated as an easy scramble as we did some bushwhacking and route finding going up the SE end and back down the south end to do a loop. 5 to 8.5 hours// Elevation of 581 m NET, 903 m TOT & max 2494 m (Highest point seemed to be on the south plateau)*****We saw that plateau from ?Stony Ridge? a few weeks ago and last week from our traverse of Hailstone Butte to Sentinel Peak and couldn?t wait to get back there. Quite a bit of snow fell in a week though and we completed the loop in the snow except for a few dry spots. You can use gravel roads both on the east or west side of Plateau Mountain to make it a hike but we studied the map before and thought it would be much nicer making our own route up the SE end and down the south end of the plateau. We saw a fox, several Rock Ptarmigans, sheep and grizzly tracks today to make the experience even more interesting. There were also huge cornices along several large bowls we walked along but we made sure to stay away from a possible break as a recent tragedy in BC reminded us of how dangerous they are.From the drainage where we parked at GR779620, we walked back down the road for about 250 metres and cut into the forest (GR781620) to start bushwhacking up the right shoulder of a gully. We mostly went straight up and came across a first rock band (GR781622) and scrambled up to its left. We went up to the right of the second rock band at GR782623 later on and soon enough we got over the three line and reached the SE plateau. We then walked along the east side of the plateau to the highest point to the north. We came back on the west side to finish our long walk passed the south station after reaching the highest point of the day at GR770645. We got to the very end of the plateau and even though a route to the right seemed easy and clear we decided to go down to the left as I could study it from the SE slope at the beginning of the day. We scrambled down steep slopes made of boulders and snow patches at first, then down a steep forest where we would have been cliffed out to the left. We cut to the right, scrambled down rubble and back into the forest for more snow and more dead trees. We slowly started to cut to our left as we were getting closer to the road and seeing openings for easier bushwhacking down that way. We ended up at the clearcut and walked straight down to the road, turned left and got back to our car a couple of minutes later. Again, our route involves some scrambling and might not be as obvious or fun if you are looking for an official trail. We enjoyed it after along day walking on the plateau even though we usually hate rubble slopes. Snow patches made it much easier for us on the way down.",
    "directions": "From Calgary, follow Trans-Canada Highway/AB-1 W, take exit 161A for AB-22 S toward Bragg Creek/Redwood Meadows and go south for about 88 km following directions to stay on AB-22 S. 28 km passed Longview, turn right onto AB-532 and continue for 28.6 km. AB-532 becomes Range Rd 42A & Township Rd 143A in the last 3 km. We parked on the right side of the road just after a drainage at GR779620.",
    "geohash": "c2yt",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/12753/long_Plateau-Mountain-Loop-Kananaskis-Route-Up-Down-May-21-2017-1024x429--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12753/reg_Plateau-Mountain-Loop-Kananaskis-Fed-Sheep-it-Seems-Sad.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12753/reg_Plateau-Mountain-Loop-Kananaskis-Fox-Crossed-the-Road-on-our-Way-in-the-Morning-May-21-2017-1024x937--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12753/reg_Plateau-Mountain-Loop-Kananaskis-From-AB-532-May-21-2017-1024x722--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12753/reg_Plateau-Mountain-Loop-Kananaskis-Fun-South-Descent-May-21-2017-2-1024x782--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12753/reg_Plateau-Mountain-Loop-Kananaskis-Huge-Cornices-May-21-2017-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12753/reg_Plateau-Mountain-Loop-Kananaskis-Male-Rock-Ptarmigan-May-21-2017-2-1024x683--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12753/reg_Plateau-Mountain-Loop-Kananaskis-North-End-May-21-2017-1024x725--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12753/reg_Plateau-Mountain-Loop-Kananaskis-South-View-May-21-2017-1024x743--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12753/reg_Plateau-Mountain-Loop-Kananaskis-To-SE-High-Point-May-21-2017-1024x768--44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/plateau-mountain-loop-se-ascent-s-descent-near-longview-ab-12753",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 4,
        "Time": "7 hrs",
        "Total Distance": "17 km",
        "Town": "Longview, AB",
        "Type": "out-and-back"
    },
    "title": "Plateau Mountain Loop (SE Ascent-S Descent)",
    "trail_id": "12753"
}