{
    "description": "Saw this trail on a map. Wasn't sure how old or maintained this trail was but decided to head out and see how far I could get.Spider Lake trail is a frequently used trail. I headed towards Skull Lake trail and my goal was to reach Lake Major and depending on how that went, continue on all the way to Perrin Drive(Millar Lake).After passing Spider Lake the trail narrows. Nice leisurely hike full of ups and downs and twists. It's obvious someone is hard at work trail clearing recently. As you get close to Lake Major, you begin a steep descent. If I do this trail again this is probably where I would stop, have a little lunch , and turn back. It makes for a wonderful half day walk through some beautiful scenery, with great views of Spider Lake, two small lakes, and then Lake Major. This took me just under an hour and a half one way.But I kept going. I followed the brook upstream that runs into Lake Major. It's a dirt road, and if you stay on it, it will lead you to Perrin Drive. I decided to keep following the stream which brought me to Soldier Lake. You'll be doing some minor bushwhacking once you get off that road. This part is what they call Soldier Lake gullies. You have elevation to the left and right of you as you follow the stream. After leaving Soldier Lake, the bushwhacking gets more difficult getting back to the road and you'll be going up and down gullies a few times. Unless you want to backtrack.Once you're back on the dirt road, there's not much that held my interest. You'll eventually get near highway 118, turn right, and keep going until you reach the bus terminal parking. I should mention you'll need to have parked a car at this end before hand or have someone pick you up.I can imagine myself going to Lake Major in the fall, on a sunny day, when the bugs have gone, sitting on a rock in the middle of the stream for a picnic (I found a wonderful spot to do that). And then just lie back and forget my troubles.",
    "directions": "Park on the street at the end of Spider Lake Estates Road. Just walk straight in and your on the trail.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/12754/reg_Beaver-dam-58226.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12754/reg_Lake-Major-58226.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12754/reg_Running-into-Lake-Major-58226.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12754/reg_Soldier-Lake-58226.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/spider-lake-trail-to-perrin-drive-near-halifax-ns-12754",
    "stats": {
        "Activities": "snowshoe hike",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 3,
        "Time": "5 hrs",
        "Total Distance": "14 km",
        "Town": "Halifax, NS",
        "Type": "out-and-back"
    },
    "title": "Spider Lake Trail to Perrin Drive",
    "trail_id": "12754"
}