{
    "description": "I don't get to explore new areas a lot lately but this was an extreme journey to an inescapable gorge near the Cape Breton Highlands National Park (CBHNP).  This is not a hike for just anybody...you will need stamina and rock climbing skills to make it into this gorge.   The route I took (with my mtn bike at first) is 20km return with a vertical ascent of 800m for the whole trip.  Faribault Brook is named after one of two geologists who criss-crossed this province in the 1890's to map out most of Nova Scotia. I am happy that they named this particular stream in his honour as it has some very unique geological formations!Setting off from the Cheticamp Back Rd, I used my mountain bike to climb to the top of the highlands on a very well maintained dirt road.  the same dirt road is used to access a lot of cabins on the slope as well as one main structure on top of the mountains.  There are lots of paths on this section so a download of my gps track will be helpful.   Just before you crest the mountain, there is a view point all the way to the Grande Falaise and Presqu'Iile in the CBHNP.   At the top of the mountain, the trail continues with some elevation gains and drops for a few kilometers until you get to the rim of the gorge.  However before reaching the gorge, the trail skirts an old gold mine adit.   The adit is not deep and there seems to be another old adit in the brook next to it!   Upon reaching an area I thought would be good to start my journey to the gorge, I ditched my bike an started to bushwack.  the terrain got seriously steep within 10m from leaving the trail.  Unbeknown to me I had picked a good path as on either side  of me were large cliffs which you wouldn't be able to climb down.  This afforded me a good viewpoint of the Faribault Brook valley down below.  The whole descent is only 100m or so but at percentage reaching up to 70%...yes 70%!    Again, I picked my way with some luck and reached an area where I could get down (very carefully and using some bouldering skills) right next to the river.  In this area are three sets of 20-30ft fall.....the most impressive sight is downstream as the water plunges one last time in a narrow slit and disappears in the gorge below.  The gorge below cannot be accessed from upstream.  There are shear walls on both sides of the stream that would be at least 100 feet highFrom this point on, I climbed on the side of the stream to a few more descent size falls of between 20-30 feet.  The journey finished at a gorgeous two tier waterfall.  the upper is the tallest at about 60ft with a deep pool at its feet and the a second fall drains that pool over maybe 20 ft or so.  The climb out of this area wasn't easy either as there were some very steep sections  with very few trees to hold on to and sharp drops on every sides.  Once at the top, find your bike and return the way you came!",
    "directions": "On the Cabot Trail heading north passed Cheticamp, turn on Cheticamp Back Rd and find a dirt road at (N46° 37' 21.0\" W60° 59' 10.7\").  Follow this road until you reach the rim of the gorge at N46° 36' 07.8\" W60° 54' 40.8\".  The gorge is at; N46° 36' 10.2\" W60° 54' 32.1\". and the upper falls at; N46° 36' 09.1\" W60° 54' 23.7\".  Again this is a very extreme hike in a remote area of the province!",
    "geohash": "f8k9",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/12762/reg_18881982-910693109070534-890556984256895951-n-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12762/reg_18893428-910694029070442-1602358769636017784-n-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12762/reg_18920420-910694109070434-8789650602750800555-n-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12762/reg_18952647-910693389070506-2090068529360356400-n-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12762/narrow_18839137-910693869070458-5171256930130865438-n-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/faribault-brook-gorge-and-falls-near-cheticamp-ns-12762",
    "stats": {
        "Activities": "mtn-bike hike climb",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 5,
        "Time": "4 hrs",
        "Total Distance": "20 km",
        "Town": "Cheticamp, NS",
        "Type": "out-and-back"
    },
    "title": "Faribault Brook Gorge (and Falls)",
    "trail_id": "12762"
}