{
    "description": "The distance of 19 km is including Lily lake and Lizard lake loop beyond Oyster Dome. If you want a work out and great view at the end you could do just Oyster dome and back the same way for a total of 14 km.Elevation gain is 2000 feet or 650 m from chuckanut drive.Starts as long switch backs uphill until you reach a fork well marked left to Oyster dome or right to another great view, samish lookout ( reachable by car). Then you continue on easy grade for a while until the turnoff to Oyster dome for a bit of uphill where you reach a rocky outcrop with great views of Samish and Vancouver island. From here you can go back the way you came or at the fork go left to lily lake and do the loop which i didnt find really worth it. Up to you.One warning, this is i have been told by locals, the most popular hike of Bellingham so dont come on the weekend otherwise come early or you will have to park a long way down the road.",
    "directions": "Take hwy 5 to exit 250. It will say Fairhaven and hwy 11 chuckanut drive. Continue west to chuckanut drive and take a left. You will be on a road with lots of curves and scenic viewpoints.Once past Larrabee state park keep going until you see a restaurant called Oyster bar, and park past it along the road only on pullouts. Dont do like others have done parking beyond the white line people have been towed there.The trailhead is clearly visible across the road.",
    "geohash": "c28u",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/WA/12760/reg_IMG-2009-42566.jpg",
        "https://trailpeak.com/storage//content/trails/US/WA/12760/reg_IMG-2010-42566.jpg",
        "https://trailpeak.com/storage//content/trails/US/WA/12760/reg_IMG-2013-42566.jpg",
        "https://trailpeak.com/storage//content/trails/US/WA/12760/reg_IMG-2014-42566.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/oyster-dome-with-lily-lizard-lakes-loop-near-bellingham-wa-12760",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 5,
        "Time": "5 hrs",
        "Total Distance": "19 km",
        "Town": "Bellingham, WA",
        "Type": "out-and-back"
    },
    "title": "Oyster Dome with Lily / Lizard lakes loop",
    "trail_id": "12760"
}