{
    "description": "Elevation gain: 900 Rated difficult due to length and elevation gain. But for a regular hiker could be moderate. This trail is a newer trail in Golden ears provincial park. Built by Ridge Meadows Hiking Club in 2014.Its a great hike to get in trail shape with nice views along the way to stop and take a break. Eventually leads to the top of Mount Nutt with views of Alouette lake, Golden ears and Evans peaks. Trail starts along East Canyon trail on an old road then at 1.6 km there is a turnoff to the right with a small sign Mount Nutt wilderness route. It starts immediately steep up until a lake or pond. Then again steep but not as hard as before. You get to a junction where you choose the way to the first viewpoint of Alouette Lake (marked as tricky go left or easy go right). Once at the viewpoint the trail continues up a bit until a gentler grade at the ridge. Trail continues until the markers end but if you go another 500 m further you get to the true summit with a bit of route finding. The gps file is to the end of trail as i did not make it to the true summit because of snow and unexpected heavy rain. Im sure the views are great i just went the wrong day. Was looking nice when i left home and they announced clearing by noon. Just goes to show how alpine weather is unpredictable. Sun showed itself as i got to the car. Will do it again as its a nice trail well marked and not too travelled. Will add more pictures at that time. As of June 20 2017, clear of snow until the top along the ridge (1100m) but markers are very visible.",
    "directions": "In Maple ridge take dewdney trunk road to 232 st. Go left where you see signs for Golden ears park. Go all the way to the roundabout and take first right on fern crescent. Continue on this road to Golden ears provincial park and all the way to its end at Gold creek parking lot. Walk up the road on the right with a yellow gate and take a left on East Canyon trail.",
    "geohash": "c2bb",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/12769/reg_IMG-2033-42566.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12769/reg_IMG-2034-42566.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12769/reg_IMG-2036-42566.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12769/reg_IMG-2038-42566.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mount-nutt-near-maple-ridge-bc-12769",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 5,
        "Time": "6 hrs",
        "Total Distance": "15 km",
        "Town": "Maple Ridge, BC",
        "Type": "out-and-back"
    },
    "title": "Mount Nutt",
    "trail_id": "12769"
}