{
    "description": "Completed on Jun 17, 2017. It should be done in dry conditions as you go up an avalanche gully and scrambling up steep slabs.Edwards Rating: III (IV) S S4 to 6.5 hours// Elevation of 860 m NET, 889 m TOT & max 2631 m (Mount Kent True Summit is lower than other high points like Kent North for some reasons)*****Even though I understand some may dislike this scramble as it involves bushwhacking and hiking up a drainage full of dead tress and bushes, we actually really liked it. The different colors of rocks/dirt, mix of grassy/slabby slopes and impressive surrounding peaks made it a beautiful scramble overall. If you go up the same way I did, it involves some hands-on scrambling on steep slabs and sometimes quite exposed for a moderate-difficult scramble. My partner didn?t feel like going on exposed slabs today so she avoided most of them by going either side where easier terrain allowed her to complete the ascent except for the last portion where slabs were the only way up at that point.Starting from GR260204 where we parked, we crossed the road and followed one of the two drainages that soon merged into one. We used faint trails on the right side of it for easier bushwhacking for about 700 metres. We reached what seemed to be a bike trail (GR264205) and turned left crossing the creek to realize soon enough that we would be going nowhere close to the summit. We turned back and started scrambling up in the creek using the left shore most of the time when running water made the rock too slippery. Later in the season it might be possible to stay in the creekbed all along and be more enjoyable. We came across avalanche debris a couple of times so doing this early season is probably a bad idea. Once in front of the slope leading to the ridge we kept going straight up climbing a series of slabs that can be avoided hiking up steep grassy slopes either side. We reached the last scree section and then got to the ridge where we could see the summit cairn (GR275217) on our left. After a long summit break, we walked down for about 140 metres (to GR276216) south passed our ascent line and facing the grassy knoll (a few hundred metres down below). We saw a cairn and went down to a rock band and found a weakness to the left where we could get some decent scree to go down faster for a while. It was actually mixed with rubble but probably better than going back down the slabs. We reached a huge slab and a forest at some point. We found an easier way down and walked along between the slab (GR275214) and the forest to the left. It led us to another gully a few minutes later that we used to go down to the col. We hiked down the black muddy slope going to our right and back to our ascent route. On our GPS track, you can see we turned left to see where that bike trail would bring us but after about 600 metres we realized it would take us more time getting back to the car that way so we turned back to our ascent trail. It seems like the best way to go is to stick to that drainage no matter what. You will come across lots of faint trails leading you away from it and you should avoid them.",
    "directions": "From Calgary, follow Trans-Canada Hwy/AB-1 W to Kananaskis Trail/AB-40 S and take exit 118. Drive south for about 50 km and turn right on Kananaskis Trail/AB-742. Follow that road for about 12.5 km and park on the left side of the road at GR260204.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/12767/reg_Mount-Kent-Kananaskis-Avalanche-Debris-Jun-17-2017-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12767/reg_Mount-Kent-Kananaskis-Descent-Route-Jun-17-2017-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12767/reg_Mount-Kent-Kananaskis-Incredible-Hands-on-Slabs-Jun-17-2017-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12767/reg_Mount-Kent-Kananaskis-Marry-Nervous-Jun-17-2017-955x1024--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12767/reg_Mount-Kent-Kananaskis-Most-Beautiful-Moss-Ever-Jun-17-2017-1024x1012--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12767/reg_Mount-Kent-Kananaskis-Mt-Black-Prince-Smith-Dorrien-French-Jun-17-2017-2-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12767/reg_Mount-Kent-Kananaskis-Our-Ascent-Route-Jun-17-2017-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12767/reg_Mount-Kent-Kananaskis-Ridge-View-Gap-Mnt-Mt-Wintour-Pocaterra-Jun-17-2017-2-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12767/narrow_Mount-Kent-Kananaskis-Beautiful-Rocks-Jun-17-2017-768x1024--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12767/narrow_Mount-Kent-Kananaskis-Jun-17-2017-20-777x1024--44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mount-kent-near-kananaskis-ab-12767",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 3,
        "Time": "5 hrs",
        "Total Distance": "6 km",
        "Town": "Kananaskis, AB",
        "Type": "out-and-back"
    },
    "title": "Mount Kent",
    "trail_id": "12767"
}