{
    "description": "The whole journey to this deep ravine started a while ago when I was reading on this brook in a geological report from 1890 which described this area as a rough gorge and fall.  Subsequently, I used satellite imagery to pin point the particular location on the stream where I thought this gorge and fall might be.One fine day in early June 2017, I used the well maintained logging roads of the highlands to take me within 300m or so of the top of the ravine.  I set off into the mixed forest and soon came to the lip of the ravine.  I picked a particular spot where a small ephemeral stream cascades down the slope.  The walking was easy but can be steep at time.  My only mistake that day is that I ended up upstream of the features I wanted to see.   Once I reached Bothan, there was a 20ft fall with sheer walls on either side for about 20ft.   Bushwacking downstream, I soon spotted a large area where the forest dropped off from my sight line =which equals usually  a waterfall!Yes there it was a 50 ft fall right in front of me...However now I needed to get down to stand in front of it.   The best is to reach a fall downstream so you can choose which side to climb up....climbing down is harder as you can't see whats ahead of you.  I chose one side and it was extremely thick and kind of precarious to climb down.  I made it finally after swearing a bit too much and finally stood in front of this beauty.   The stream then does have some smaller falls downstream but they are smaller.  I then picked a small ephemeral stream to follow to get back up to the top of the highlands.  this hike looses all its elevation ...about 200m...withing about the same in distance so prepare for a good workout!",
    "directions": "Take the Crowdis Mtn Rd and turn on secondary rd at ; N46° 15' 19.9\" W60° 49' 08.3\".  continue on this road turning to the right after 2.4km and park at a point N46° 16' 38.4\" W60° 52' 35.4\" and walk due North.",
    "geohash": "f8hx",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/12763/reg_18892995-911223545684157-6186941641127627927-n-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12763/narrow_18920545-911223539017491-6173590630413627652-n-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/bothan-brook-falls-near-baddeck-ns-12763",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 5,
        "Time": "2 hrs",
        "Total Distance": "3 km",
        "Town": "Baddeck, NS",
        "Type": "out-and-back"
    },
    "title": "Bothan Brook Falls",
    "trail_id": "12763"
}