{
    "description": "This all season hike starts at the Rice Lake parking lot in North Vancouver.  The route has few stairs, and is sometimes flat for long sections as it parallels the Seymour River.Starting at Rice Lake parking with clean modern washrooms newly (2016) installed, follow signage to Homestead trail.  While this is a bit steep heading downhill, it will not be the return trail coming back.  After about 3/4 of an hour, or about 1.5 km there is a T intersection for Fisherman's Trail, turn left through the large sign prohibiting dogs, and go about 5.1 km and look for the signage for Midvalley Lookout where there is a covered area for picnicking, with a toilet as well.  This Fisherman's Trail parallels the Seymour river and is relatively flat.After taking a break return the same way you went out but don't turn right at the Homestead Trail.  Instead continue on Fisherman's Trail until you reach the Twin Bridges which have been washed out due to a landslide for at least 3 years.  Turn right up the gravel road which will eventually lead you back to the parking lot.  There is no choice but to go up this road from Twin Bridges-all other directions are closed.",
    "directions": "Cross Iron Worker's Memorial Bridge from Vancouver and take exit 22 for Lillooet Road and go to the very end where you will find Rice Lake parking.",
    "geohash": "c2b8",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/12765/reg_IMG-0010-26421.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12765/reg_IMG-0014-26421.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/seymour-midvalley-viewpoint-near-vancouver-bc-12765",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "5 hrs",
        "Total Distance": "16 km",
        "Town": "Vancouver, BC",
        "Type": "out-and-back"
    },
    "title": "Seymour Midvalley Viewpoint",
    "trail_id": "12765"
}