{
    "description": "There are three small, lovely lakes near to the Whistler Olympic Athletes Village that have historically been accessed off of the Black Tusk Tower rd., which leads off the west main rd from Cheakamus. The three lakes, East Jane, West Jane and Crater Lk are nestled in the rolling forests that slope off the volcanic scree of the Black Tusk. This is a TR accessing them from an alternate route, via the Jane Lakes FSR.The Jane Lakes are close to Whistler, easy to hike to and not very often thought of, let alone accessed. They are post-card pretty and  they made for a perfect moderate hike. These would be beautiful on a hot summer day and we will return there next season to map the entire trail system and swim in these wonderful little lakes.If you're looking for some sweet, fresh water destinations in the whistler area, without much effort, give these a try.",
    "directions": "ACCESS to the TRAILHEADDrive out the Whistler Olympic Athletes Village and head all the way SW on Legacy way. At the point where the sea-to-sky trail is well-signed, you'll find a sign to 'Jane Lakes 7.7 km' . Drive along this old FSR. You'll need a good AWD with some clearance or 4x4 pick up that you don't mind getting scratched(the road can be brushy). After about 4.5 km you'll see the road to the right impassable and the fork to the left heading up and looking very rough. This is the the trail head but there is no sign. This trail is actually a very rough, brushed in spur road. FROM the TRAILHEADHike up this very rough, brushed in old road for about 2.7 km. Along the way, the volcanic geology and local scenery is very impressive. Some of the most geometrically perfect basalt columns I've ever seen are along this trail. A little ways up the road opposite the Jane Lakes trail are occurrences of unusual pumpkin sized magma pillows encased in sand/silt. Very coolWhen you arrive at the West Jane Lake follow the well marked trail around to your left along the lake. You'll come to a beautiful embankment area where the water is easily accessed. From this spot you can enjoy a superb view of the black tusk reflected in the calm water of the lake.The trail system proceeds around west jane, over to east jane lk and over to crater lk as well. I've included only pics and info on west jane in this TR.",
    "geohash": "c2bk",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/12776/reg_Jane-Lakes-road-and-trail-55777.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12776/reg_jane-lake-small008-55777.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12776/reg_jane-lake-small011-B-W-55777.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12776/reg_jane-lake-small020-55777.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12776/narrow_jane-lake-small021-55777.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/jane-lakes-whistler-near-whistler-bc-12776",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 4,
        "Time": "6 hrs",
        "Total Distance": "7 km",
        "Town": "Whistler, BC",
        "Type": "out-and-back"
    },
    "title": "Jane Lakes Whistler",
    "trail_id": "12776"
}