{
    "description": "Completed on Jun 24, 2017 in dry conditions. Several people have done it in winter conditions as a mountaineering trip.Edwards Rating: II (III) S M4 to 6.5 hours// Elevation of 985 m NET, 1153 m TOT & max 2671 m (Ship?s Prow Peak lower at 2565 m elevation)*****This is one of the most beautiful and impressive peaks we can see from Canmore in my opinion and for that reason I?ve been wanting to do that scramble for a while. It turned out to be a very nice moderate scramble with some fun scrambling on slabs/scree on the summit block. The approach is easy even though there is no official trail (on our route at least) but we should have come back the same way rather than going down the drainage below the summit as it was mostly a rubble slope and the creek was sometimes bushy or not so obvious to hike even though totally doable.From the gate (GR121537) we started walking down the gravel road going north for about 500 metres. We turned right at the wide clearing (GR119541) and stayed right to reach the forest. We reached a pile of boulders and just kept going straight up in the forest going east. We can barely say this was bushwhacking in this open forest with a nice moss floor to make the ascent easier and enjoyable. We gained elevation quickly on steep terrain and finally reached the crest (GR128547) and started following a huge cliff band staying as close as possible to gain the summit ridge faster. Once on the ridge, we enjoyed the most beautiful views of the popular Three Sisters and kept going left following the ridge line closely. We reached the false summit with a huge cairn a few minutes later and analysed the rest of the route from there. What was coming seemed difficult from that point of view but turned out to be moderate scrambling on steep slabby terrain with some scree to make it a little more challenging at times. We reached the summit and went back down the same way watching for a possible way down to our left as I wanted to keep going east to complete the extension and reach ?Ship?s Prow Peak?. The first chimney (GR136560) we saw was almost like steep stairs so we used it to go down on the extension and followed that little ridge going up three high points before reaching the lower point at the end. A herd of sheep welcomed us and we enjoyed the views of the Bow Valley and the Three Sisters again. Going back up to the chimney, we reached back our ascent route and went down the crux of the summit block. We saw some light brown scree (GR136559) and thought it would be much faster to go down the drainage under the summit. It was not the best idea as this was mostly a rubble slope and the drainage was not fun to hike (they rarely are?). When we got closer to the road, we decided to go back in the forest to our left and quickly reached the clearing. We really enjoyed that trip as it involved some scrambling, stunning views, easy approach in an open forest and a great ridge walk.",
    "directions": "From Canmore?s Bow River Bridge, follow Spray Lakes Road for about 13.5 km and turn left after Goat Pond aqueduct to park at the gate. There are a few parking spots on your left by the canal.",
    "geohash": "c3jf",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/12777/long_Ship-s-Prow-Mountain-Peak-Kananaskis-Route-Jun-24-2017-1024x431--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12777/long_Ship-s-Prow-Mountain-Peak-Kananaskis-Summit-View-Three-Sisters-to-Lawrence-Grassi-Jun-24-2017-1024x229--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12777/reg_Ship-s-Prow-Mountain-Kananaskis-View-Three-Sisters-Jun-24-2017-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12777/reg_Ship-s-Prow-Mountain-Peak-Kananaskis-Chimney-Jun-24-2017-2-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12777/reg_Ship-s-Prow-Mountain-Peak-Kananaskis-Nice-Moss-Forest-Jun-24-2017-1-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12777/reg_Ship-s-Prow-Mountain-Peak-Kananaskis-Ridge-Walk-Route-Jun-24-2017-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12777/reg_Ship-s-Prow-Mountain-Peak-Kananaskis-Trailhead-Jun-24-2017-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12777/reg_Ship-s-Prow-Mountain-Peak-Kananaskis-Welcome-Jun-24-2017-1-1024x713--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12777/reg_Ship-s-Prow-Peak-Kananaskis-Herd-of-Sheep-Jun-24-2017-1-1024x732--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12777/narrow_Ship-s-Prow-Mountain-Peak-Kananaskis-Crux-Jun-24-2017-2-768x1024--44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/ships-prow-mountain-peak-near-canmore-ab-12777",
    "stats": {
        "Activities": "hike snowshoe",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 4,
        "Time": "5 hrs",
        "Total Distance": "9 km",
        "Town": "Canmore, AB",
        "Type": "out-and-back"
    },
    "title": "Ship's Prow Mountain & Peak",
    "trail_id": "12777"
}