{
    "description": "Completed on Jul 2, 2017 in dry conditions. GPS track is not exact (descent route is accurate) as I modified it to take off a part of our scramble where we attempted Wind Mountain first.Edwards Rating: II (IV) M L7 to 9 hours// Elevation of 878 m NET, approx. 1000 m TOT & max 2349 mThis was an expected scramble as we intended to do Wind Mountain but turned back when we saw most of the scrambling section was still covered in snow. We had a great view on Bogart Tower and Memorial Lakes and even though we had no idea yet where we were heading we decided to give it a try. Most of the route is the same and even though it can be confusing as there are a few trails the idea is to follow Ribbon Creek and Falls all the way up.From Ribbon Creek parking lot, we walked to its end and started going up the trail heading west. At the first fork, we kept going on the middle trail (GR288435) along the creek. We took the right one at the second fork at GR281431. After about 3 km we saw a cairn at GR271431 and took that much narrower but excellent trail to our right. From now on, we stayed along Ribbon Falls and even though we used the trails to the right for most of the next forks we came across, both trails would have been fine as we took the other one on our way back down. We lost track once and found the trail easily to our right minutes later. At GR241433, you will see a couple of trails to your left on the other side of the creek. That?s where you should cross and start going toward Bogart Tower and the three beautiful Memorial Lakes. You will see the first lake to your left at some point. Keep going up the obvious trail to the second lake on the right shoulder of the Tower and along a rubble slope. From the second lake, we went straight up to the rock bands looking for a weakness to climb. We found two ways on the left side with some exposed hands-on and a direct route but we went down further right on our descent route on easier terrain using the official trail. Once behind the Tower, I went to the left and up the cliff band while my partner followed the trail to the right. I walked on an exposed ledge for a few metres and then scrambled almost straight up to meet my partner on the trail. We then left the trail to get to the south ridge of the Tower. I continued alone as it became more exposed with loose rocks on steep terrain (GR237427). I tried to go straight up as much as possible and it was fine but moderate-difficult technically for sure except for one rock band I avoided going left to find a chimney (GR237428) I used to get to a narrower ridge thereafter. Again, lose rock made this ascent a little trickier. The last portion of this scramble was easier and I reached the summit plateau. Views were not that great up there so I came back down the same way after a short break and we went down the third lake at the top of that stunning waterfall and then to the monument. We used the easier way and stayed on the official trail on the way down. This is a very nice scramble with some great technical challenges to get to the summit of Bogart Tower but overall it is a strenuous day. Ribbon Falls and the lakes are also worth the effort!",
    "directions": "From Calgary, follow Trans-Canada Hwy/AB-1 W to Kananaskis Trail/AB-40 S. Take exit 118 and continue for about 23 km and turn right on Mt Allan Dr. Continue for 850 metres then turn left onto Centennial Dr. After 250 metres turn right onto Ribbon Creek Rd. and park at Ribbon Creek Day Use Area.",
    "geohash": "c3n1",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/12788/reg_Bogart-Tower-Kananaskis-Route-Tower-Jul-2-2017-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12788/reg_Bogart-Tower-Memorial-Lakes-Kananaskis-2nd-Lake-Jul-2-2017-3-1024x768--44639_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12788/reg_Bogart-Tower-Memorial-Lakes-Kananaskis-3rd-Lake-Jul-2-2017-1-1024x772--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12788/reg_Bogart-Tower-Memorial-Lakes-Kananaskis-Awesome-Scrambling-Jul-2-2017-6-1024x754--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12788/reg_Bogart-Tower-Memorial-Lakes-Kananaskis-Waterfall-1st-Lake-Jul-2-2017-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12788/reg_Wind-Mnt-Attempt-Kananaskis-View-Bogart-Tower-Jul-2-2017-1016x1024--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12788/narrow_Bogart-Tower-Kananaskis-Ridge-Jul-2-2017-768x1024--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12788/narrow_Bogart-Tower-Memorial-Lakes-Kananaskis-2nd-Lake-Jul-2-2017-8-768x1024--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12788/narrow_Bogart-Tower-Memorial-Lakes-Kananaskis-Awesome-Scrambling-Jul-2-2017-2-768x1024--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12788/narrow_Wind-Mnt-Attempt-Bogart-Tower-Memorial-Lakes-Kananaskis-Ribbon-Falls-Jul-2-2017-1-666x1024--44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/bogart-tower-memorial-lakes-near-kananaskis-ab-12788",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 5,
        "Time": "9 hrs",
        "Total Distance": "18 km",
        "Town": "Kananaskis, AB",
        "Type": "out-and-back"
    },
    "title": "Bogart Tower & Memorial Lakes",
    "trail_id": "12788"
}