{
    "description": "Premiere hike in Yosemite National Park. The view on top is not the best in the park, but standing on top of the most famous landmark in Yosemite should be on any hiker's bucket list. The official length is 16 miles round trip, but depending on how you get to the trail head, you may add one to three miles to your hike.Due to its popularity, the trail is limited to a limited number of people per day. At the beginning of every year, applications are sent in online to be entered into a lottery. Daily lotteries are available, but harder to get and not advisable if you are visiting from a foreign country. This makes trip planning for this hike a little tricky. Details are available on the Yosemite park website.If you win the lottery and got your permit, make sure you don't forget to bring your permit. There is a ranger standing guard at the base of the dome to check them.Be prepared for a very long day. The hike itself is not difficult until the very end, but the distance is the killer. On your way down, you'll be asking \"are we there yet\" a lot. That's why it's a good idea to start the hike early. Some people leave at midnight so they can reach the top to see sunrise.Once at the foot of the dome, you will queue up for the cable to get to the top. This is a traffic jam area, since you have to wait for people going up and coming down. You may also encounter some people who clearly shouldn't be on this hike blocking the trail, so be patient.It's helpful to wear gloves for the cable. Climbing shoes would make it much easier, but not completely necessary. I also wish I had my Via ferrata kit so I can harness myself in.",
    "directions": "The trail starts at the Happy Isle area just beyond a bridge. The beginning of the trail is shared with Mist Trail, so look for that trail sign. The nearest parking is about half a mile away and only open early in the morning until it's filled. Once it's full, the only way to access it is an even longer walk to another parking, or take the bus and get off at Happy Isle stop. If you are starting your hike late enough to catch the bus, then just follow the crowds and you won't miss the trail head.",
    "geohash": "9q",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/CA/12783/reg_DSC-3833-59668.jpg",
        "https://trailpeak.com/storage//content/trails/US/CA/12783/reg_DSC-3861-59668.jpg",
        "https://trailpeak.com/storage//content/trails/US/CA/12783/reg_DSC-4214-59668.jpg",
        "https://trailpeak.com/storage//content/trails/US/CA/12783/reg_DSC-5350-59668.jpg",
        "https://trailpeak.com/storage//content/trails/US/CA/12783/reg_DSC-5417-59668.jpg",
        "https://trailpeak.com/storage//content/trails/US/CA/12783/narrow_DSC-4137-59668.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/half-dome-trail-near-mariposa-ca-12783",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 5,
        "Time": "12 hrs",
        "Total Distance": "26 km",
        "Town": "Mariposa, CA",
        "Type": "out-and-back"
    },
    "title": "Half Dome Trail",
    "trail_id": "12783"
}