{
    "description": "The new Campbell River Lookout Hike is a difficult 8km round trip up Broken Eyes Mountain with approx. 500m of climbing, and is rated as \"black diamond\" or difficult.  The trail begins with an easy section of old logging road reduced to singletrack (length approx. 800m-1.2km.)  The trail then enters mature 2nd growth west coast rainforest and proceeds across 3 bridges before crossing a 2nd newer logging road.  At the 2nd logging road proceed almost directly across and begin a sharp switchback climb for approx. 800m-1km through older 2nd growth forest.  The trail then levels out for a short distance before climbing a moderate slope to a frog pond.  Cross the fir rounds over the frog pond and proceed through a boulder section with remnants of the old growth cedar forest.  The trail now enters a 2nd steep climb through a boulder field and below a large rock cliff band.  After ascending a section with the aid of a chain bolted to a tree, the trail proceeds upwards for approx. 200-300m before leveling out for a short distance.  The next sections of trail are a series of short and steep climbs with 3 of them utilizing chains bolted to trees for assistance.  The trail then proceeds for approx. 1km up an old logging road reduced to singletrack before turning right up a steep new singletrack climb; after proceeding approx. 1-1.5km the trail arrives at the rocky bluff/summit of the climb.  180 degree views of the mainland Coast Mountain range, the Salish Sea and gulf islands, Campbell River, and Vancouver Island mountains are visible.",
    "directions": "The Trail is located approx. 20km (20 minutes driving) north of Campbell River on the Island Highway (19) on Vancouver Island, British Columbia, Canada.  A small parking area is located 50m off the highway (right side) approx. 200m after Grey River Netting (approx. 400m north of Brown Bay Road, or approx. 3km north of the Ripple Rock Trail.)",
    "geohash": "c0yv3",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/12789/reg_20170630-172259-0.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12789/reg_8715BE7B-861D-4CDF-9B25-B0281178B927.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12789/reg_98835439-EC59-4908-B623-E558D69C0F84.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12789/reg_campbell-river-look-5.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/campbell-river-lookout-hike-near-campbell-river-bc-12789",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 5,
        "Time": "4 hrs",
        "Total Distance": "8 km",
        "Town": "Campbell River, BC",
        "Type": "out-and-back"
    },
    "title": "Campbell River Lookout Hike",
    "trail_id": "12789"
}