{
    "description": "I had wanted to get to Renfrew for a while.  Renfrew back in its day was a booming gold mining district.  There were countless seams exploited, adits driven and shaft sunk all over the place.  Of course these days the whole place is overgrown by a mixed forest but there are a few pothole-ridden road which can take you smack in the middle of the action.The final nail in the coffin for me to visit this place happened while I was reading an old plan and section map of the mining and it showed the sites used for hydropower on the North Brook.  The word \"fall\" appeared in a few places.   The road is still passable as of July 2017 but take your time or hike or bike in instead.   The main fall is located about 300m downstream of a well constructed bridge over north Brook.  A semi established path takes you from the road to the cascading falls.  It's nice enough as there are not a lot of falls in this area and the exploration of the mining makes it a worthwhile detour.Back at the bridge there is one fall under the bridge and a few more smaller ones upstream and some signs of mining activity on both sides of the brook.   I explored a lot of the woods to seek out old adits but did not find any that were still open.  As for the name of the post; Ghost town; I  took it from a geocaching name you can find in the woods in this area.",
    "directions": "Highway 14.  turn on Renfrew Rd and drive for 5.5km.  At this point turn left  (if you go straight there are no trespassing signs).   At the next intersection turn left and drive to a bridge over North brook.  main fall is at N45° 00' 19.6\" W63° 36' 47.3\"",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/12791/reg_Northbrook2-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12791/reg_Northbrook3-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12791/reg_Northbrook4-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12791/reg_Northbrook5-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/renfrew-ghost-town-near-halifax-ns-12791",
    "stats": {
        "Activities": "mtn-bike hike",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 2,
        "Time": "1 hrs",
        "Total Distance": "1 km",
        "Town": "Halifax, NS",
        "Type": "out-and-back"
    },
    "title": "Renfrew Ghost Town",
    "trail_id": "12791"
}