{
    "description": "*** Annual road closure (AB-546) between December 1 & May 14.Completed on July 8, 2017 in dry conditions.Edwards Rating: III (V) M M (if completing both false and true summits)7 to 11 hoursElevation of 1010 m NET, 1175 m TOT & max 2622 m (2547 m for False Summit)Gear: Poles (every hike), helmet (every scramble), GPS device (some easy bushwhacking today), bug repellent & sunscreen were essential today (30 degrees in the afternoon). *****We loved that scramble for all its challenges (including false summit ascent), quick approach and long ridge walk/scramble. As always, we took every bit of ?unnecessary? elevation gain to reach each and every high point/outcrop/buttress on the way up but avoided some of them and tried to use a good trail where available on the way down. Therefore, our ascent route includes more scrambling, downclimbing and elevation than our descent route. This is technically a moderate-difficult scramble with some exposed sections.From the lower parking lot, we walked back on the road to reach the Sheep River trailhead and hiked for about 10 minutes or 1 km. We turned right in the forest at GR592081 and started bushwhacking up the slope in a light forest. We made sure to go straight up or slightly left using the path of least resistance. We came across two official trails (GR592082 & 590083) and an old trail but kept going up to make sure to reach the ridge as soon as possible. As we got closer to the ridge, we saw a good trail going left at GR586085 leading us to the beginning of a long ridge walk. We followed the ridgeline almost a 100% but there were trails left or right to avoid some of the several high points. At the last high point with a cairn we looked at Nugara?s book before continuing to the intimidating false summit. After a short hike to the base of that summit, we turned right and followed an obvious trail with cairns and blue flags. We saw a steep but interesting rock band to our left just a few minutes past the base and started climbing straight up for some fun, easy scrambling with some exposure. Once closer to the crux below the false summit, we turned left and climbed 2-3 metres to get on a slabby and steep terrain with a tiny ledge. My partner had to stop there and waited for me to complete that first ascent. Nugara mentions how hard the crux can be going down and it was for me. Going up seemed obvious and I reached the ridgeline quickly to scramble up to the false summit cairn (GR565088) a minute later. I could see the rest of the route to the true summit from there and took some time to analyze it. I downclimbed the same way and freaked out a little bit going down the crux and meeting my partner in the middle. I helped her on the way down and we continued scrambling along larger ledges below an impressive cliff to the right of the false summit block. We reached back the trail and went along the block to get to the connecting ridge with the true summit. From now on, we climbed up and down every single outcrop except for two that seemed impossible to do without ropes and stayed on the ridgeline all the time. We knew there were trails left or right sometimes but were not interested in leaving the ridge on our ascent. Once at the true summit block, we went to the right following an obvious scree trail that soon brought us back up the ridge (GR556096) and the summit (GR555096).On the way down, I did try to downclimb that section just under the summit out of curiosity but after the first two walls that I could circumvent on the left I gave up on the third one and came back to the scree trail. Most of the way back was identical but we did avoid high points and followed the most obvious trail when available or easier. Really a tremendous day with a lot of hands-on scrambling if completing the false summit ascent and stay on the ridgeline almost all the way. This obviously requires some route-finding skills even though cairns and blue flags help a lot.",
    "directions": "From Calgary, follow Trans-Canada Highway/AB-1 W, take exit 161A for AB-22 S toward Bragg Creek/Redwood Meadows and go south for about 22 km. Turn left on AB-22 S and continue for 19.5 km. Turn right on AB-22 S for 27.4 km to Turner Valley. Turn right at the intersection onto Sunset Dr. NW/AB-546 W and continue on that road till the end (approx. 38 km) to park at Sheep River lower parking lot toward the end of the loop.",
    "geohash": "c2yr",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/12794/long_Mount-Burns-East-False-Summit-Kananaskis-Summit-View-Mist-Storm-Gibraltar-Bluerock-Jul-8-2017-1024x221--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12794/long_Mount-Burns-East-Peak-False-Summit-Kananaskis-View-False-Summit-Jul-8-2017-1-1024x527--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12794/long_Mount-Burns-East-Peak-False-Summit-Kananaskis-view-False-Summit-Gibraltar-Arethusa-Rae-Jul-8-2017-1024x308--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12794/long_Mount-Burns-Kananaskis-Summit-Jul-8-2017-5-1024x221--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12794/reg_Mount-Burns-East-Peak-False-Summit-Kananaskis-Fun-Hands-on-Jul-8-2017-3-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12794/reg_Mount-Burns-East-Peak-False-Summit-Kananaskis-Route-True-Summit-Jul-8-2017-2-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12794/reg_Mount-Burns-East-Peak-False-Summit-Kananaskis-Welcomed-by-Herd-of-Sheep-Jul-8-2017-2-1024x748--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12794/narrow_Mount-Burns-East-False-Summit-Kananaskis-Summit-Jul-8-2017-1-768x1024--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12794/narrow_Mount-Burns-East-Peak-False-Summit-Kananaskis-Crux-Jul-8-2017-2-768x1024--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12794/narrow_Mount-Burns-East-Peak-False-Summit-Kananaskis-Crux-Jul-8-2017-3-768x1024--44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mount-burns-east-peak-eeob-false-summit-gr565088-gr555096-near-turner-valley-ab-12794",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 5,
        "Time": "9 hrs",
        "Total Distance": "12 km",
        "Town": "Turner Valley, AB",
        "Type": "out-and-back"
    },
    "title": "Mount Burns East Peak-EEOB & False Summit (GR565088 & GR555096)",
    "trail_id": "12794"
}