{
    "description": "Saturday (Jul.15, 2017) four of us bagged all three mountains (Jim Kelly Peak, Coquihalla Mountain, Illal Mountain) around Illal meadow within 9.5hrs. Here are the details and pictures:Approach: we left hwy1 exit 50 surrey Park&Ride around 6am, then drove to Coquihalla hwy until exit 228, from there follow Tulameen FSR near Km 19 right at the bridge over Illal Creek. Most people parked there but i managed to get my old X-Terra push all the way to the end of Illal Creek road which is 3km after the turn off. The time was about 8:30am.Trailhead to 3-way pass at Illal meadow: we left car at 8:46am then stepped on beaten Illal meadow trail. The trail is in good shape which leads you all the way the meadow. From there you just go wherever you want we made a little snack break at the \"3-way pass\" (the spot among all 3 mountains) then decided to bag Jim Kelly peak as our today's appetiser :PJim Kelly Peak: from the \"3-way pass\" there is no difficulty to walk up to the summit. Hands were barely touching the rocks. 10:51am we reached summit, enjoyed view (of course spent lots of time on looking into that \"shipmast\") then got some beta for next Target - Coquihalla Mountain. This was just 2 hrs from the car. Coquihalla Mtn: i freaking love this mountain! Simply because there are so many options to bag itwe backtracked to the \"3-way pass\" then drop a little bit around 1850m elevation which is north-east corner of Coquihalla mtn. From there, you have 3 options: 1-climb up the north-east buttress to gain the most east sub-summit then traverse the whole summit ridge to the true summit (the most west one). (class3-4)2-traverse on the north side of the mountain around 1850m then scramble the NNW ridge to the summit (class3)3-traverse on the south side of the mountain around 1900m then walk up the screey south flank direct to the summiti was selling hard for the option1 as i love rocks (loose or solid) to other 3 buddies. However, due to very strong wind at the pass, they were not willing to take the risk of being blown off the summit ridgeOh well, option2 it is. Traversing around 1850m contour line was quite straightforward and smooth. On the way i spotted at least 2 easy approach from gentle gully to gain the summit ridge in the middle, but my partners still liked to stick on the option2 as classic.we soon reached north ridge and there is deep drop on the other side which forces you to climb up the ridge, near 2000m: you have option to climb the loose chimney all the way up to gain summit ridge on the west or you can move to the right to scramble up on rock to the broad upper ridge. we decided to move to the right by traversing a small hard snow patch then scramble - which was definitely the fun and highlight of the day.At 1:55pm, we reached the summit of Coquihalla. Lots of pictures and talks and searching for the canister. The mystery canister disappeared, instead i found a ziploc bag which has a soaked mountain muse book and a beautiful painted riverstone! Took some pictures of it and then put it back very carefully.Looking at the very benign south flank, we decided to use this a descent to finish our loop. Started descenting at 2:30pm and around 4pm we were back to the \"3-way pass\". The \"main course\" was well done and we were all satisfied. Illal Mountain: i don't know why so many people choose to ignore this flat top volcano like cute mountain after they bagged 2 peaks. Since we still have tons of day light i suggested to climb it as \"dessert\". This time my buddies bought it. 30minutes after we are atop it. it turned out the view from the top of Illal mountain was stunning! You got very nice full view of Jim Kelly and Coquihalla from north. You can see every detail of the route for the \"high summit ridge traverse\" of Coquihalla from east to west. This was certainly the climax of the day The strong wind still continued so we didn't stay long and ran down to the mountain. Got to the car around 6:08pm. Some stats of the day: Total distance: 17kmTotal ascent: 1534mduration: 9hr22min",
    "directions": "Approach: we left hwy1 exit 50 surrey Park&Ride around 6am, then drove to Coquihalla hwy until exit 228, from there follow Tulameen FSR near Km 19 right at the bridge over Illal Creek. Most people parked there but i managed to get my old X-Terra push all the way to the end of Illal Creek road which is 3km after the turn off. The time was about 8:30am.",
    "geohash": "c2cc",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/12806/long_IMG-20160708-191346373-59119.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12806/long_IMG-20160709-133853772-59119.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12806/long_IMG-20160709-133903512-59119.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/coquihalla-trio-near-hope-bc-12806",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 5,
        "Time": "10 hrs",
        "Total Distance": "17 km",
        "Town": "Hope, BC",
        "Type": "out-and-back"
    },
    "title": "Coquihalla Trio",
    "trail_id": "12806"
}