{
    "description": "There is an existing report on a part of this trail but this refers specifically to accessing Hanging lake.  This is a much better hike than that report lets on.  The trail is much improved,  climbs steadily with good views and ends at Hanging lake, a lovely spot giving access to more subalpine terrain. Although this trail has some very nice forested ridge and sidehill sections it has been well known for its mucky sections through numerous bogs in the first few km of the track. Recently, however, the RMOW trail crew has placed many sturdy foot bridges across these wetlands. The trail experience is vastly improved as a result. Many thanks to these hard working trail builders. The path is about 6.7 km to the north end of Hanging Lake and first climbs gently through wetland and very old, decaying Hemlock-dominated forest for about three km. It then begins a steady climb up and across rock scree, sidehill and ridge top. It is quite varied in terrain and requires crossing about 1/2 dozen heavily vegetated, rocky slide chutes in the upper sections. These can be tricky to navigate, especially when wet. Frankly, these short, rocky spots can be a little unpleasant when they are in a wet, overgrown state(as they are right now in summer). That aside, the trail has many enjoyable sections.The elevation difference from TH to the first lake view is less than 1600', but much of that occurs in the back half of the trail. The path undulates a great deal so there is noticeable elevation gain and loss along the way. Hanging Lake is quite pretty, and affords great access to marvelous terrain.",
    "directions": "ACCESS to the trailhead:The TH is accessed via the Callaghan valley road, south of Whistler, which heads up to the Whistler Olympic Park. Near the end of the paved road, turn left across the river on to the Callaghan FSR. A few hundred meters later turn right on to the Madeley FSR. It is about 5 km along this road to the Trailhead, where a large sign and parking area are to be found.",
    "geohash": "c2bm",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/12800/long_Madeley-Hanging-Lake-Trail-55777.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12800/reg_Madeley-Hanging-BIG-Hw-55777.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12800/reg_Madeley-Hanging-small017-55777.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12800/reg_Madeley-Hanging-small023-55777.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12800/reg_Madeley-Hanging-small024-55777.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12800/narrow_Madeley-Hanging-small002-55777.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12800/narrow_Madeley-Hanging-small005-55777.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12800/narrow_Madeley-Hanging-small007-55777.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12800/narrow_Madeley-Hanging-small011-55777_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12800/narrow_Madeley-Hanging-small013-55777.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/madeley-hanging-lake-near-whistler-bc-12800",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 4,
        "Time": "8 hrs",
        "Total Distance": "14 km",
        "Town": "Whistler, BC",
        "Type": "out-and-back"
    },
    "title": "Madeley Hanging lake",
    "trail_id": "12800"
}