{
    "description": "This hike starts from the Gorge Creek Trailhead, which is at the end of the Gorge Creek Road, where it is closed off. At just over one KM out you'll meet a junction, just after a small footbridge. Take the trail to the left and then after another 1/10 KM turn left again. There is a sign there.I usually hike it clockwise to avoid the steep climb along the Indian Oils Trail. There is a creek crossing at 1.3 KM out, which can be tricky if the stream flow is high, so it is best to do from mid-Summer to mid Fall.At the 6.7 KM stop the South Gorge Trail intersects with the Indian Oils trail. At the 7.4 KM mark there is a steep drop for about 1/2 KM. We usually have lunch at the top of this descent.At the 8.6 KM spot there is a \"Y\" junction, and while my track does follow this route it is best to take the right trail, at that junction.At about 9 KM you will need to ford the North Gorge Creek and then climb up the hill towards the Gate. The trail back to the trailhead is very straight forward, but with a few undulations.",
    "directions": "The Trailhead is just left off the Gorge Creek Road, where the road ahead is closed off, About 4 KM North of the Township Road 194a, the extension of highway 546 from Turner Valley. The Gorge Creek Road junction is about 30 KM west of Turner Valley, when following highway 546.",
    "geohash": "c3n",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/12801/reg_2016-06-23-GORGE-CREEK-LOOP-018-MOUNT-WARE-56261.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12801/reg_2016-06-23-gorge-creek-loop-002A-BLUEROCK-MOUNTAIN-56261.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/gorge-creek-indian-oils-loop-near-turner-valley-ab-12801",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 4,
        "Time": "5 hrs",
        "Total Distance": "16 km",
        "Town": "Turner Valley, AB",
        "Type": "out-and-back"
    },
    "title": "GORGE CREEK INDIAN OILS LOOP",
    "trail_id": "12801"
}