{
    "description": "NTS Maps: 083C06,083C03Actually, technically just inside Jasper National Park.  Elevation Gain: 335 m (1,100 ft).This hike is one of those \"I can't believe you get all of this for so little effort\".  After the 20 minute or so climb (1-1/2K) to the valley it's all yours. Views of the Columbia Icefields and many mountain peaks abound including a huge view of Athabasca Mountain and Glacier.  After the first 20-30 minutes it's all flat and beautiful.  The other bonus is the lack of any real destination.  You can hike a long way or a short way its up to you.  If you turn around half way to the actual pass or if you go beyond it you won't miss anything.  We just went to the pass but apparently there is a loop that takes you back to the Icefields Parkway.  We decided not to do this because you must either walk or hitchhike about 7 kilometers back to your car once you reach the highway.  We agreed it made more sense to walk back from whence we came and enjoy the splendor of the views from the opposite direction. This beautiful little hike offers hikers the opportunity of experiencing real back country Rocky Mountain hiking with a fraction of the effort normally required for these views.   Along the way we encountered a herd of about a dozen Rocky Mountain Long Horn Sheep the hikers in front of us were so close to them they could have touched them. They actually got between some of them.  The animals seemed somewhat uninterested by our presence but it was quite exciting for us hikers to be in such close proximity to these beautiful animals.  There are a few herds that apparently inhabit this valley and your chances of seeing them as we did are very good.My wife and I travel many kilometers up and down many mountain moraines to find the very landscape we found ourselves in within 30 minutes of moderate climbing. You can judge for yourself by the content of the pictures I've attached. Even experienced hikers will enjoy this easy hike.  Put it on your list of hikes to do in the Rockies. In winter please check the Avaluator(Online Trip Planner) rating is:  Challenging.  See more trip planner route details here.",
    "directions": "From Banff head north on the Icefield Parkway to the Banff/Jasper park boundary. About 2 kilometers into Jasper at Sunwapta look for the Wilcox Creek Campground Road on the east side of the highway. The trailhead is less than 50 meters off Parkway.  If you go as far as the big Icefield Centre you've gone past it.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/1280/reg_100-3450--10101.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1280/reg_IMG-0325-14636.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1280/reg_IMG-0350-14636.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1280/reg_Wilcox-pass-07-12-07-015-15110.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1280/reg_Wilcox-pass-07-12-07-018-15110_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1280/reg_Wilcox4858Resizejpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1280/reg_Wilcox4866Resizejpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1280/reg_Wilcox4873Resizejpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1280/reg_Wilcox4876Resizejpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1280/reg_Wilcoxgif.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/wilcox-pass-near-banff-ab-1280",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "12 km",
        "Town": "Banff, AB",
        "Type": "out-and-back"
    },
    "title": "Wilcox Pass",
    "trail_id": "1280"
}