{
    "description": "I'm almost 90 hikes into 103 hikes book and this is by far the worst hike I've done yet. The trail is steep, overgrown in places and covered in dead fallen trees with hardly any views. The reason for the long hike time is that you are constantly climbing over dead fallen trees.    If you must do this hike, follow the wide trail from the gate for about 30 mins and take a left onto an overgrown logging road at a sign that says Horse Trail to the right. The next 45 mins is pushing through every type of stinging nettle imaginable. Make sure you have long pants and sleeves for this section. After you've been hiking for about 1.5 hours you take a left at another fork near the park boundary sign. Heading east you soon cross a shale slide and a few minutes later the trail starts on the right. Head up until you reach another road and the trail restarts to the right on the other side, the trail is fairly well marked but the footpath isn't always easy to follow due to fallen needles and sticks and just lack of use.   Climb steady up this ridge and you will come to a viewpoint over Cultus lake. From here you head up some more and you skirt a minor summit on its east side and start to descend. After dropping around 100m you come to a saddle and begin climbing around the north side to an open slope southwest of the forested summit. There are some views from the slope but nothing from the summit. At this point you have pretty much wasted a perfectly good day and you wish you had listened to the opening paragraph.",
    "directions": "Take exit 119 off Hwy #1 and drive through Vedder crossing and over the bridge crossing the Chilliwack river. After the bridge head left onto Cultus lake rd which becomes Columbia Valley Hwy. Take a left onto Edmeston rd. and the gate is about 200m up this road on the right.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/12818/long_IMGP1447-14463.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12818/long_IMGP1449-14463.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12818/long_IMGP1450-14463.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mt-amadis-near-chilliwack-bc-12818",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 1,
        "Time": "10 hrs",
        "Total Distance": "22 km",
        "Town": "Chilliwack, BC",
        "Type": "out-and-back"
    },
    "title": "Mt Amadis",
    "trail_id": "12818"
}