{
    "description": "The southern half of the Juan de Fuca trail is a windy, hilly, trail with sporadic stops at beaches. The beaches range from rocky to pebbly to sandy and feature several level spots suitable for camping. I did this hike in two days which I believe is more ambitious than any of the other travellers I came across. The camping beaches are spaced in a way that you can break the trip up into several nights with only moderate hikes each day.  I did the trip in late July (2017) and it had been dry for at least a week prior to the hike but there was still plenty of muddy spots on the trail. That said it wasn't necessary to wear gators and I thought the trail was in pretty good shape. Had it rained gators would have been essential. There are several spots where I made wrong turns which I thought was a bit surprising considering the amount of traffic. It was obvious that many people had taken the wrong paths in three different spots as the dead end trails were well worn. Never was it difficult to track down the proper trail. I opted to do the majority of the trail in one day (29km) which was quite gruelling. Overall my elevation gain was about 4300' which comes as a surprise as the trail generally hugs the shoreline. It winds up and down many creek valleys along the way. I averaged just under 3km/h and had a pack that weighed 40lbs. I only stopped for a 25min lunch and a few picture and water breaks. I took one 1L water bottle which I was able to fill regularly from creeks all though I was careful to never let it get too low. I used a microfilter pump to clean the water and it seemed fine. The reason I only did half the trail and did not continue to Port Renfrew was that I felt I had seen what there was to see. The forest, all though beautiful, all looked the same and the beaches weren't extraordinary. The only spots the trail intersected beaches was at the designated campsites (Mystic, Bear, Chin and Sombrio). I thought Sombrio was the nicest beach and also had a spectacular waterfall on the south end (just a short walk up the creek - see pics).The campsites north of Sombrio (not shown on the GPS) are not on the water which played into my decision not to continue all the way to Port Renfrew. Also the fact that I'm old and sore and my knees suck... I've been told that the tidal pools at Botanical Beach in Port Renfrew are a highlight. On that note be sure to check out the tide schedule as most of the beaches get cut off at high tide for at least a small portion of them. This info along with maps are posted at the trailheads of each beach/campsite as well.The government parks website contains all the info you need. It is rather unspecific about the number of tenting spots available at each beach but when I was there there was always a few extra. Even though the weather forecast called for full sun I woke up with a wet tent from the mist and possible light rain in the mornings. Apparently the Juan de Fuca park is in the 'fog zone' and this is the norm for the summer months. I've been told late spring and early fall tend to have nicer weather.Overnight parking permits are $10 per person (in 2017) and can be paid in cash at the trailhead or prior to your trip online.I completed my trip with a short hitchhike back to China Beach parking lot which took literally less than 20 seconds for a ride. Maybe I was just lucky? A quick internet search will reveal shuttle options.As my first hiking trip in coastal BC I wasn't overly impressed. The park itself is very narrow so a couple of times I could hear traffic. Other times the trail is suspiciously close to logging clearcuts. I thought for the amount of work that went into the hike the scenery wasn't stunning. I suspect it's only because I'm so thoroughly spoiled from my time hiking in the interior. I would recommend this hike but I probably wouldn't do it again. Might be a good practice hike for the West Coast Trail.",
    "directions": "The trailhead is in the southern part of the park called China Beach. There is a  separate parking lot for day use and hikers and is located a short drive north of Sooke on hwy 14. Being a provincial park it's clearly marked. Sombre beach (about the half way point of the entire trail) is accessed by a clearly marked provincial park sign off of hwy 14 too.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/12819/reg_2017-07-26-at-20-23-39-35968.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12819/reg_2017-07-26-at-20-32-51-35968.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12819/reg_2017-07-26-at-20-52-34-35968.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12819/reg_2017-07-26-at-21-39-46-35968_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12819/reg_2017-07-27-at-10-00-13-35968.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12819/reg_2017-07-27-at-10-27-19-35968.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12819/reg_2017-07-27-at-10-40-29-35968.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12819/reg_2017-07-27-at-11-52-41-35968.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12819/reg_2017-07-27-at-12-48-26-35968.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12819/reg_2017-07-27-at-16-07-39-35968.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12819/reg_2017-07-27-at-17-40-55-35968.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12819/reg_2017-07-27-at-19-48-39-35968.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12819/reg_2017-07-27-at-19-48-53-35968.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12819/narrow_2017-07-27-at-09-32-19-35968.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12819/narrow_2017-07-27-at-09-45-55-35968.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12819/narrow_2017-07-27-at-11-48-23-35968.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12819/narrow_2017-07-27-at-13-44-10-35968.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12819/narrow_2017-07-27-at-16-07-51-35968.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12819/narrow_2017-07-27-at-18-08-32-35968.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/southern-juan-de-fuca-near-sooke-bc-12819",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall",
        "Stars": 3,
        "Time": "12 hrs",
        "Total Distance": "31 km",
        "Town": "Sooke, BC",
        "Type": "out-and-back"
    },
    "title": "Southern Juan de Fuca",
    "trail_id": "12819"
}