{
    "description": "*** LOOK AT THE BUS SCHEDULE ON PARKS CANADA WEBSITE TO GO BACK DOWN TO YOUR CAR FROM LAKE O?HARA.*** Bus available from June 16 till October 1 for $10/person (as of 2017). No reservation required on the way down but very busy. Make sure to be there earlier and bring cash.Completed on July 22, 2017 with several snow patches but ledges in dry conditions.Edwards Rating: IV (V) M L (mountaineering)8 to 13 hoursElevation of 1186 m NET, 1656 m TOT & max 2925 mGear: Poles (every hike), helmet (every scramble), GPS device, crampons, ice axe, climbing gear (harness, 20-30 m rope, carabiners, slings, etc.) ?*****We completed that traverse with an experienced climber and he made sure to keep us safe for an exciting trip from Lake Louise to Lake O?Hara. Proper experience/training and gear is required for this trip and we wouldn?t have done it without our friend. We tried our brand-new crampons a couple of times, learned a few techniques, and got the best views ever of Victoria Glacier. It was a unique and memorable day for us as we usually do scrambles.From Chateau Lake Louise, we took the lakeshore trail leading to Plain of Six Glaciers teahouse leaving at 4:30am to avoid rock falls on the west face of Mount Lefroy later in the day. At GR512942, we went down in the valley using the horse trail and went off-trail to reach the milky creek. We walked along it towards Victoria Glacier until we found a decent spot to cross it. We used a gully on our left to go up and towards the east face of Mount Lefroy (GR508928). There was a solid snow patch in the scree cone so we put our crampons on and avoided the scree to get to the ledge. At GR502919, we turned right and walked across a steep and exposed slope to get to the ledge. We had to cross a first exposed snow gully. That is where we roped-up to complete the east face traverse. To me this section was the crux as I was impressed with the exposure and snow gully but it was the first of three so I got used to it I guess. We traversed that exposed but wide (most of the time) ledge to the end of that wall and there were maybe 2-3 trickier steps and the end of it would have been the most difficult section but several fixed cables made it easy even though exposed. Going left around the corner we now had the best views ever on Victoria Glacier and once we were done with the exposed scrambling we took a break on a nice plateau to eat and unrope.We hiked along the cliff/glacier for a while and then used a good snow patch to go up left (west) taking another 200 metres elevation to some rock bands at about 2675 m altitude (GR498918). We turned right (south) and scrambled along those rock and cliff bands coming across cairns from time to time and making sure to stay at this elevation until we hit a rubble slope and saw the Abbot Hut to our right. We had to traverse two other exposed snow gullies using front-pointing technique and it was scary my partner and I but everything went well. We followed a faint trail in the rubble when we could see it and otherwise kept going up and to the left to stay away from what people call the Death Trap below us. Once we got to the snow, my partner and I decided to put on our crampons again to feel safer going over that Trap but the slope wasn?t steep at all. We reached the Hut from the left stepping over a long crevasse just before Abbot Pass.From Abbot Hut, we went down the col using the scree slope where several trails are available. We stayed to our right trying to avoid kicking rocks down as some groups were coming up and we used snow patches for a quicker and easier descent where possible. We took the obvious trail to the right and went down the beautiful Lake Oesa trail to get to Lake O?Hara. We turned right at the lakeshore trail and got to Le Relais day shelter for the 4:30pm bus ride down to the parking lot. This is an unforgettable trip for us but again we wouldn?t have done that without our friend to guide us and the proper gear. And don?t count on having a famous piece of carrot cake at that time of the day? They sold the last three pieces to the people in front of us ?!",
    "directions": "*** 2 CARS REQUIRED ***CAR #1:From Lake Louise, continue onto Trans-Canada Hwy going slightly left to BC. About 10 km later, you will see an obvious sign for Lake O?Hara, turn left. The parking is going to be on your right after the railroad.CAR #2:Park at Chateau Lake Louise.",
    "geohash": "c3jk",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/12811/long_Fuhrmann-Ledges-Lake-Louise-AB-O-Hara-BC-Ledges-Jul-22-2017-14-1024x541--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12811/reg_Fuhrmann-Ledges-Lake-Louise-AB-O-Hara-BC-Crevasse-Before-Abbot-Hut-Jul-22-2017-1-1024x792--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12811/reg_Fuhrmann-Ledges-Lake-Louise-AB-O-Hara-BC-Huge-Crevasses-Down-Death-Trap-Jul-22-2017-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12811/reg_Fuhrmann-Ledges-Lake-Louise-AB-O-Hara-BC-Incredible-Rock-Colors-Jul-22-2017-2-1024x683--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12811/reg_Fuhrmann-Ledges-Lake-Louise-AB-O-Hara-BC-Over-Death-Trap-Victoria-to-Whyte-Jul-22-2017-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12811/reg_Fuhrmann-Ledges-Lake-Louise-AB-O-Hara-BC-Route.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12811/reg_Fuhrmann-Ledges-Lake-Louise-AB-O-Hara-BC-Sunrise-Jul-22-2017-2-1024x742--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12811/reg_Fuhrmann-Ledges-Lake-Louise-AB-O-Hara-BC-To-Abbot-Pass-Jul-22-2017-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12811/reg_Fuhrmann-Ledges-Lake-Louise-AB-O-Hara-BC-Victoria-from-Abbot-Pass-Jul-22-2017-1024x746--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12811/narrow_Fuhrmann-Ledges-Lake-Louise-AB-O-Hara-BC-Ledges-Jul-22-2017-10-768x1024--44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/fuhrmann-ledges-from-lake-louise-to-lake-ohara-near-banff-ab-12811",
    "stats": {
        "Activities": "hike climb",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 5,
        "Time": "11 hrs",
        "Total Distance": "18 km",
        "Town": "Banff, AB",
        "Type": "out-and-back"
    },
    "title": "Fuhrmann Ledges (from Lake Louise to Lake O'Hara)",
    "trail_id": "12811"
}