{
    "description": "Completed on August 5, 2017 in dry conditions.Edwards Rating: III (IV) L M8 to 12 hours (save about 1½-2 hours if you can bike instead on Little Elbow Trail)Elevation of 1119 m NET, 1258 m TOT & max 2749 mGear: Poles (every hike), helmet (every scramble and essential here) & GPS device (bushwhacking up SE ridge).*****This traverse is mostly a nice ridge walk with easy bushwhacking to start and until you get to the last high point before the summit. From thereon, route finding is very challenging on exposed ledges, circumventing several cliffs, using exposed and narrow ridge sections with difficult downclimbs a couple of times. We missed what seemed to be the correct route on the left side of the ridge but found a way to complete our ascent. You should consider this ascent up the southeast ridge only if you feel comfortable with route finding on exposed terrain.From the day use parking lot in the campground (GR509280), we walked up the campground road and continued on Little Elbow Trail along the river for a while. A bike approach would be ideal here if you can. We crossed Nihahi Creek (GR473292) about 45 minutes later and continued up to the bridge. This is where we turned right and started bushwhacking up in the forest (GR468291). Bushwhacking was easy and we could often see a pointy peak that was the beginning of Fullerton?s SE ridge traverse so we made sure to stay under it and over the bridge using a satellite map. We finally got to a dirt slope (GR465294) and reached the ridge later on at GR462297 with great views of Mount Remus and Romulus on our left. From there it was pretty obvious and we hiked up the ridge to reach the first cairned high point (GR446314). We continued to the second False Summit (GR443317) and took a break to study this impressive series of cliff bands and ledges coming next. We scrambled straight down and were quickly stopped by a first cliff (GR442317) so we turned right and went down about 20 metres to find a decent but exposed ledge with unstable scree and rubble (they were all like that?). We sidesloped and regained our elevation gradually until we reached the ridge again close to a nice and obvious pinnacle standing in the middle of that col (GR440317). We passed it, walked on an exposed and sometimes narrow ridge and found a weakness to downclimb on our right. We followed that other ledge up to the ridge again and from now on we could stay directly on the ridge or to its left if necessary and reach the summit.Going down we followed the north ridge for a while and cut to the right on a grassy slope when it naturally turned east. We hiked down to a small drainage (GR443322), turned left and followed it until we got to a wide drainage (GR452331). We turned right and followed that one using faint trails on the left side most of the time and sometimes going back and forth from the left to the right. An official trail appeared on our left (GR468301) when the drainage narrowed down and we took it to go along a beautiful dry canyon and later on back to Little Elbow Trail. We turned left for a long but easy walk back to the car. This was worth doing it as a traverse from the SE ridge to avoid coming both ways in that interminable drainage. We thought that last section before the summit was very challenging and would rate it as difficult technically even though Kane?s book rates it as moderate. There are some cairns and we added a couple where it made sense but you are mostly on your own up there!",
    "directions": "From Calgary, follow Trans-Canada Highway/AB-1 W, take exit 161A for AB-22 S toward Bragg Creek/Redwood Meadows and go south for about 22 km. Turn right on AB-66 W and drive another 27 km to Powderface Trail junction. Turn left and drive another 1.2 km to the Elbow River parking lot entrance to your left. You can also turn right on the campground road just before the entrance and park at the day use area (sign and 5-6 parking spaces, that?s where our GPS track starts).",
    "geohash": "c3n",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/12826/long_Mount-Fullerton-Traverse-Kananaskis-Descent-Route-Aug-5-2017-1024x472--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12826/long_Mount-Fullerton-Traverse-Kananaskis-Summit-View-Remus-to-Nihahi-Aug-5-2017-1024x228--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12826/reg_Mount-Fullerton-Traverse-Kananaskis-Last-Section-from-False-Summit-II-Aug-5-2017-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12826/reg_Mount-Fullerton-Traverse-Kananaskis-Little-Elbow-River-Aug-5-2017-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12826/reg_Mount-Fullerton-Traverse-Kananaskis-Nihahi-from-NE-Ridge-Nice-Rocks-Aug-5-2017-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12826/reg_Mount-Fullerton-Traverse-Kananaskis-Route-from-Little-Elbow-Trail-Aug-5-2017-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12826/reg_Mount-Fullerton-Traverse-Kananaskis-Summit-View-Remus-Romulus-Aug-5-2017-2-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12826/narrow_Mount-Fullerton-Traverse-Kananaskis-Nihahi-Creek-Canyon-Aug-5-2017-768x1024--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12826/narrow_Mount-Fullerton-Traverse-Kananaskis-Scary-Scrambling-Sometimes-Aug-5-2017-2-768x1024--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12826/narrow_Mount-Fullerton-Traverse-Kananaskis-Scary-Scrambling-Sometimes-Aug-5-2017-3-653x1024--44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mount-fullerton-traverse-se-ascent-ne-descent-near-kananaskis-ab-12826",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 4,
        "Time": "10 hrs",
        "Total Distance": "23 km",
        "Town": "Kananaskis, AB",
        "Type": "out-and-back"
    },
    "title": "Mount Fullerton Traverse (SE Ascent, NE Descent)",
    "trail_id": "12826"
}