{
    "description": "Completed on July 29, 2017 in dry conditions.Edwards Rating: III (IV) M M5 to 9 hoursElevation of 1078 m NET, 1146 m TOT & max 2998 m on Peak 4 (2989 m Peak 3)Gear: Poles (every hike), helmet (every scramble and essential here), GPS device, bug repellent and sunscreen on a hot 30 degrees day.*****This is wonderful and more technical scramble with exposed ledges, climbing, chimneys, route finding, rockfalls & breathtaking views! We reviewed several trip reports and Kane?s book before so it seemed quite obvious but otherwise it can be a challenging day (route finding). If other parties are in the main gully before you are, this can be extremely dangerous as rockfalls are inevitable.From the parking, we followed the trail going straight up and kept going up at the first junction, following the creek on a steep slope. At some point, it turns left and goes flat for a while until it reaches the creek where we crossed it (GR427233) to continue on a good but sometimes bushy trail. We followed the trail crossing the forest for a few minutes until we got to a clearing below the drainage we were going to use for our ascent (GR424236). We reached the drainage and turned right to start gaining elevation. When the terrain started to steepen at the first rock band we went left and up the rock band (GR426240) to start and then on some slippery dirt slope. We reached another forest and went straight through to get to the upper slope where we used rock bands going slightly left to get under Peak 5. We went up on the right side of one of many pointy rock bands (GR430247) where scrambling was still very easy. We hiked up a few more metres to the left and traversed a first wide gully using some good ledges with quite a bit of scree but stable enough to make it quick and easy. We reached a second-wide gully now just under Peak 4 (our main objective today) and hiked using ledges again gaining the last bit of elevation to get to the gully between Peaks 3 and 4. We started an awesome scramble with what was for us the crux today climbing the first rock band. The ascent was okay but the downclimbing later was more challenging for us. I used a wall with good holds on the left and my partner used the right part of it. We came across another rock band and then it was mostly scree and slippery dry dirt for a while, using the rock bands on each side for more stability when available. We should have seen cairns on our right at some point but we only saw cairns almost at the highest point of that gully. We turned right and went along some ledges until we reached a good rock band to our left. We climbed that stairs-like but steep band and got to the ridge leading to the summit. We turned right and walked to the summit cairn. The views were spectacular and as I wanted to do Peak 3 I studied its ledges from there before we started our descent.Using almost the exact same route to start, we got to the gully and my partner waited there while I was doing Peak 3. I started too high and found a chimney on my right leading to the ridge. Problem was this lead me to the false summit and a cliff blocked me from getting to the true summit. I returned the same way and went down to a narrow ledge maybe 2-3 metres lower. I walked along it until I got past the false summit cliff and saw a chimney going up in between the two peaks. I climbed up there and then climbed on my left to reach the ridge and get to Peak 3 summit (GR432244). Same route on the way down but I realized I could have used a wider ledge a few metres lower. We followed the cairns on our left to avoid some of the climbing sections and downclimbed our crux before getting out of that gully for the day. We went almost straight down from there following some grey scree at first and then going right to find some more decent scree but these rock bands were everywhere and prevented us from a quick descent as we hoped. We got to the forest and went down staying close to that drainage until we decided to go left and cross the drainage (GR423244) thinking we might find a better way than that dry slippery dirt slope. It was a mistake as bushwhacking was terrible and we had to circumvent a cliff band to the left. At some point, we just sidesloped to the left to get to the next drainage. We stayed in that one and got back on the main trail (GR421241). From there, we used the official trail to get back to the car. This is not an easy scramble and even more difficult to describe. Even though cairns helped, route finding skills are essential here.",
    "directions": "From Lake Louise, continue onto Trans-Canada Hwy for about 2.3 km and take the Alberta 93 exit toward Jasper. Continue for approx. 28.5 km and park at the gravel parking lot on your right just after Helen Creek.",
    "geohash": "c3jjz",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/12820/long_Dolomite-Peak-4-Icefields-Parkway-Summit-View-Cirque-Watermelon-Jul-29-2017-1024x235--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12820/reg_Dolomite-Peak-3-Icefields-Parkway-Great-Scrambling-Here-Jul-29-2017-1024x901--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12820/reg_Dolomite-Peak-3-Icefields-Parkway-Great-Scrambling-Here-Jul-29-2017-3-1024x747--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12820/reg_Dolomite-Peak-3-Icefields-Parkway-Route-Peak-3-Jul-29-2017-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12820/reg_Dolomite-Peak-3-Icefields-Parkway-Summit-View-Watermelon-Bobac-Jul-29-2017-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12820/reg_Dolomite-Peak-3-and-4-Icefields-Parkway-Ridge-Jul-29-2017-44639_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12820/reg_Dolomite-Peak-3-and-4-Icefields-Parkway-Route-Up-Jul-29-2017-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12820/reg_Dolomite-Peak-3-and-4-Icefields-Parkway-View-Andromanche-Hector-Bow-Jul-29-2017-1024x787--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12820/narrow_Dolomite-Peak-3-and-4-Icefields-Parkway-Descent-Route-View-Crowfoot-Jul-29-2017-768x1024--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12820/narrow_Dolomite-Peak-Icefields-Parkway-Crux-to-Start-Jul-29-2017-768x1024--44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/dolomite-peak-peak-3-and-4-near-banff-ab-12820",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 5,
        "Time": "8 hrs",
        "Total Distance": "10 km",
        "Town": "Banff, AB",
        "Type": "out-and-back"
    },
    "title": "Dolomite Peak (Peak 3 and 4)",
    "trail_id": "12820"
}