{
    "description": "Completed on August 12, 2017 in dry conditions.Edwards Rating: IV (V) M L9 to 13 hoursElevation of 1490 m NET, 1647 m TOT & max 2908 mGear: Poles (every hike), helmet (every scramble and essential here) & GPS device (heavy bushwhacking and difficult route finding). Bug repellent was a must on a very hot day.*****This is one of the most difficult scramble we have done so far. I thought it was more difficult than Mt Carnarvon, Arethusa, Storelk, Lougheed Traverse, etc. It involves frustrating bushwhacking in the first 3 km and difficult route finding on exposed terrain for over 4 km. It is intense and an error or lack of route finding skills can get you in a lot of trouble (I almost did?). My description alone will not help at all but along with my GPS track and some pictures hopefully you?ll do better than us!From the parking lot, we crossed the road and walked on the right side of the meadows trying to stay close to the beginning of the ridge. We slowly went right to avoid the worse of the bushwhacking. We got to the ridge (GR860770) and followed a decent trail to a first high point. We scrambled up to have a better idea of what was coming next. We kept going on a sometimes-faint trail toward these huge vertical slabs (GR859777) and turned left to go along them for a few minutes until we saw a weakness to climb up (GR859779). After climbing it we kept going up a scree-rubble slope and reached the summit ridge. We went around the first high point to the right and then came back on the ridge for some already narrow and exposed sections. It involved a bit of easy climbing but a mistake there could be fatal and it was just the beginning. We stayed on the ridge up to the highest point so far and went down to the right side (GR858785) for about 70 metres elevation loss thinking the next section of the ridge might be too difficult. My partner decided to call it a day there so I sidesloped across a gully and followed up a rock band (GR858786) leading me back to the ridge. I used both the ridge and a ledge on the left side to start with but at some point I went too far left and had to come back on a col where I realized ledges on the right side could potentially lead me to the summit. I used 2 or 3 different ledges overall coming across a few useful small cairns and I added 4-5 cairns as well. When I got very close to the summit, I had to use a dirt ledge that was slippery with not much handholds and I didn?t like it so I went down and made the worse mistake as I had to do a 2-moves lateral climb on a wall and it scared the hell out of me. I had to take 20-25 minutes break as I couldn?t see a way out of there and two trail runners arrived. They were seeing clearly and indicated that I could use a good line down to my right to then come back up to the slippery ledge where they were (the one I should?ve stayed on?). I saw it and finally got out of there. After the dirt ledge, we kept going for a few steps and saw a trail going left (GR854800) overhead so we cut to the left and reached back the ridge. The very last section was again exposed but easier than most other before and we got to the summit.I used the same ledges for the descent but realized I could have taken the ridge almost 90% of the time. There are only 2 sections that seem impossible to do. I met my partner 30 minutes later and we took almost the same route down but sidesloped along some of the several high points as we were exhausted. You will see on my GPS that at least 2 or 3 times we took a different route. We also descended earlier from the ridge and it was a HUGE mistake. We had to circumvent a couple of rock bands, bushwhacking was much worse than on our way up. That?s why I think it might be smarter to use the drainage between Cockscomb Mountain and Mount Ishbel 1.7 km before the meadows on the 1A to avoid all bushwhacking and try to find a way up the very beginning of that ridge. It will probably be longer in distance but much faster that way.",
    "directions": "From Banff, follow the Trans-Canada Highway 3 km west and take the exit for Johnston Canyon. Drive on Bow Valley Pkwy/AB-1A W for 11.9 km and park on the left side of the road at the Meadows parking lot. An alternative could be to park at 10.2 km instead and bushwhack up the drainage.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/12834/long_Mount-Ishbel-Banff-Summit-View-Ridge-and-Cockscomb-Aug-12-2017-1024x232--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12834/long_Mount-Ishbel-Banff-Welcome-Route-from-the-Road-Aug-12-2017-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12834/reg_Mount-Ishbel-Banff-Route-Finding-from-Now-On-Aug-12-2017-1--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12834/reg_Mount-Ishbel-Banff-Route-Finding-from-Now-On-Aug-12-2017-2-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12834/reg_Mount-Ishbel-Banff-Summit-in-View-Approximate-Route-Aug-12-2017-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12834/narrow_Mount-Ishbel-Banff-Crazy-Smoke-from-Wildfires-Aug-12-2017-2-770x1024--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12834/narrow_Mount-Ishbel-Banff-First-Climb-Not-That-Easy-Aug-12-2017-1-769x1024--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12834/narrow_Mount-Ishbel-Banff-Fun-but-Exposed-Scrambling-from-the-Beginning-Aug-12-2017-1-768x1024--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12834/narrow_Mount-Ishbel-Banff-One-of-Many-Climbs-Aug-12-2017-319x479--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12834/narrow_Mount-Ishbel-Banff-Summit-Aug-12-2017-2-768x1024--44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mount-ishbel-near-banff-ab-12834",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 3,
        "Time": "12 hrs",
        "Total Distance": "15 km",
        "Town": "Banff, AB",
        "Type": "out-and-back"
    },
    "title": "Mount Ishbel",
    "trail_id": "12834"
}