{
    "description": "This is an awesome adventure or exploration to do in the CBHNP.  I had noticed a he fall on satellite imagery.  It was located a little bit further upstream of the third pool on the Salmon Pool trail in the CBHNP.   The exploration comes in at about 16km total with 330m of ascent...so bring your man bike to shave off some precious time on the trail.  The trail is open to bikes until a sign says that you can't go further with it.  Stash it and continue on foot.  At the end of the trail (third pool).  Now the fun begins......Itès bout 800m of bushwhack to get to the tributary.  The only hard part is near the head of the third pool as the river has high cliffs and a small brook comes out of the man.  Use a bit of scrambling skills to get through that part.  Then its an easy walk on the side of the river as the forest opens up a bit more.  the tributary to follow is unnamed but on the north side of the river (same side as the trail).   Its easy to see if you are on the right one has there is a 40ft fall within about 150m from the Cheticamp River.  Climb either side of the fall...the east side has the best view but a denser forest.  Once at the top, follow the brook to an area where a small fall of about 10-15ft blocks your way.  there are tall rock walls on either sides.  At this point you need to scramble up the slope and bypass the stream for about 200m.  Carefully climb back down to the stream and another 300m or so leads you to a massive slide off the ravine slope.   Lots of trees are in the middle of the stream at this point but.....Just a few more 100m takes you to the foot of the massive fall.  At the time I went there wasn't much water so the first 100ft or more of the fall was dry and composed of huge boulders everywhere.  I climbed that part and then stood at the foot of the very vertical part of the fall.  The stream leaved the rock wall in the upper reaches and then it cascades down on the rock surface for the last third of the height. I would estimate the height at about 150ft and way more of there is water in the lower part.   BTW some part of the hike on the ravine slope can be tricky as there is lots of hidden holes so watch out for your ankles.   This hike is not for everybody and make sure to allow enough tome to return to the start point in the daylight.",
    "directions": "The Salmon Pool trail begins at the back end of the CBHNP campground near Cheticamp.   Follow it to its conclusion and then bushwhack on the same side of the river to the first fall at;  N46 38 16.5 W60 52 12.1and the massive fall at;  N46 38 32.9 W60 52 08.1",
    "geohash": "f8k9",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/12845/narrow_DSC-4324-1--27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12845/reg_DSC-4347-1--27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12845/narrow_DSC-4311-1--27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12845/narrow_DSC-4312-1--27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12845/narrow_DSC-4319-1--27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/cheticamp-river-tributary-falls-near-cheticamp-ns-12845",
    "stats": {
        "Activities": "hike mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 5,
        "Time": "4 hrs",
        "Total Distance": "16 km",
        "Town": "Cheticamp, NS",
        "Type": "out-and-back"
    },
    "title": "Cheticamp River Tributary Falls",
    "trail_id": "12845"
}