{
    "description": "This is one outhouse brooks in Cape Breton where people have seen the valley from the Cabot Trail but no one bothers to explore its confines.  Looking at some sat imagery I could see a massive drop in a tributary of MacDonald Brook.  I drove close to the tributary and set off in the woods towards the ravine.  there were rose droppings all over in the forest.  The descent was steep but manageable in a super nice deciduous forest.  At the bottom, I followed the stream and was soon rewarded by standing atop of a 50ft waterfall.  I bypassed the fall and cliffs by walking further into the woods and soon stood at its foot.The rest of the valley to get out is not very fun and offers a few smaller fall but nothing fantastic. There are lots of opportunities though to twist an ankle or worst.  Find;ly I escaped into the main ravine of MacDonald Brook.  I had a hunch there could be more falls upstream from this point.  I walked in the now wide ravine amid tall maple and beech trees.   Soon enough another reward lay ahead.  A very scenic 35 ft fall with a deep pool at its base.  I ended up following the brook further upstream but never found more falls.  although as you can see I still had some ways to go to walk the whole brook.  I climbed out of the ravine in steep but manageable location until I returned to the Highlands Rd.",
    "directions": "Crowds Man Rd or the Highlands Rd off the Cabot Trail on top of Hunters Mountain.  Drive to a secondary rd at; N46 09 33.5 W60 51 29.0.  Turn to the left when you have a choice so you end up somewhere like; N46 09 45.0 W60 52 05.4.  this is the end of a logging rd.  The biggest fall is at; N46 09 47.3 W60 52 29.3 and the other on the main branch is at; N46 09 31.4 W60 52 41.8.  there could be better ways to see both falls by means of other logging roads but the description above is the route I took since I didn't know exactly where the falls were located.  I would appreciate an email if you go on this adventure and find more falls on this brook!",
    "geohash": "f8hw",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/12846/reg_DSC-4354-1--27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12846/reg_DSC-4359-1--27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12846/narrow_DSC-4357-1--27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/macdonald-brook-falls-near-baddeck-ns-12846",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "4 km",
        "Town": "Baddeck, NS",
        "Type": "out-and-back"
    },
    "title": "MacDonald Brook Falls",
    "trail_id": "12846"
}