{
    "description": "Completed on August 17, 2017 in dry conditions.Edwards Rating: II (III) S M4 to 8 hoursElevation of 1123 m NET, 1143 m TOT & max 2141 m Gear: Poles (every hike, especially here), helmet (every scramble) & GPS device (easy route finding).*****Considered as a moderate scramble in Kane?s book, it is short but very steep all along with some fun scrambling toward the end. Using one of the gullies to get to the ridge can be very challenging and turn into a difficult one technically.From the other side of the Trans-Canada Highway, we crossed the road and followed an obvious road to the trailhead on the right side of a rock band (GR447978). We followed a good trail up along that crest with several faint trails. We made sure to stay in line with the summit gaining elevation quickly. We circumvented 2 other rock bands following a trail to the left (GR452974 and GR453973) as my cousin was doing her first scramble ever so we avoided technical scrambling when possible but they could be scrambled straight through I think. We got to the grassy and steep slope and kept going up until we saw a cairn (GR455972) showing us the way to the left in the forest and then sidesloping along cliff bands for a while. We then scrambled up a steep scree-dirt slope and kept following the trail along cliff bands after. Once at the first dried up drainage with nice folds of rock, we followed cairns and flags but I went too far and made it way more difficult than it should have been by going up an exposed gully. The best way to go here is to turn right once past the folds of rock and follow a steep but good trail up that spine in between gully 1 and 2. It will get you to a rubble slope later on and up to the ridge. Once at the ridge, we turned right (GR465966) but stayed away from the views as my cousin was feeling dizzy with all that exposure. We followed games of trails up to the base of the false summit where my partners waited for me. A cairn to the right (GR463965) showed me the way and then I turned left and scrambled up scree and slabs to the false summit. I continued to the first huge cairn on my left and then walked on this nice grassy ridge up to the true summit (GR457968) on the right. I had no summit views because of the heavy wildfire smoke but we really enjoyed that scramble overall. As mentioned above, we went down the spine between the first and second gully as it was much easier and followed the same trail back to the car.",
    "directions": "From Jasper, head northeast on AB-16A toward Edmonton for about 51 km and turn right at the Jasper National Park sign on a dirt road (about 800 m past the Park gate, hard to see from the road). Park at the trailhead on your right. We parked on the other side of the Trans-Canada Highway by the sign as I didn?t know we could park at the trailhead then.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/12841/long_Roche-a-Perdrix-Jasper-Summit-Aug-17-2017-4-1024x230--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12841/long_Roche-a-Perdrix-Jasper-Where-it-Begins-and-Ends-Aug-17-2017-2-1024x534--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12841/reg_Roche-a-Perdrix-Jasper-First-Ridge-Aug-17-2017-3-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12841/reg_Roche-a-Perdrix-Jasper-First-Ridge-Morning-Aug-17-2017-1024x830--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12841/reg_Roche-a-Perdrix-Jasper-Welcome-Aug-17-2017-2-830x1024--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12841/reg_Roche-a-Perdrix-Jasper-Welcome-Route-Aug-17-2017-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12841/narrow_Roche-a-Perdrix-Jasper-Some-Exposed-Scrambling-Wow-Sof-Aug-17-2017-1-768x1024--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12841/narrow_Roche-a-Perdrix-Jasper-Some-Exposed-Scrambling-Wow-Sof-Aug-17-2017-2-710x1024--44639_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12841/narrow_Roche-a-Perdrix-Jasper-Where-it-Begins-and-Ends-Better-Route-Aug-17-2017-768x1024--44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/roche-a-perdrix-near-hinton-ab-12841",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "7 hrs",
        "Total Distance": "8 km",
        "Town": "Hinton, AB",
        "Type": "out-and-back"
    },
    "title": "Roche a Perdrix",
    "trail_id": "12841"
}