{
    "description": "This is a full day backpack with abundant options for exploring in the Alpine. The trail also links with the Greenbush Lake trail to the east, and overnight options From the alpine linking south to Tsuius Mountain and the Sawtooth Range.For the most part the trail is clear and easy to see, but lingering snow and vegetation may obscure the trail at certain times of the year. Initially, the trail follows the creek, then crosses, and continues along a tight valley bottom with willow and avalanche slopes on both sides. (Plus lots of bear sign, so make noise!) Hike through past a little lake, still following the tight valley bottom. Just past the lake, watch for a junction in the trail where you turn right for Joss Mountain. The faint trail that continues straight, connects to Greenbush Lake and the headwaters of the Shuswap River. Taking the clearer right trail, begin to climb, and traverse the west slope. When the trail finally levels on a bench amongst open forest, watch for another fork in the trail. Take the right trail here, once again climbing up and eventually breaking out of the forest into the sub-alpine. At the first open area below a cliff face, the trail climbs up to the right (north). Watch for intermittent signs of the trail and rock cairns climbing steadily up into the meadows and talus slopes beyond. On a clear day, the summit is obvious to the north as the trail weaves its way upward. Eventually, the old dominion forestry lookout (recently rebuilt), becomes evident at the summit, along with lengths of old wire along the way that used to link the lookout by telegraph to a lower relay cabin.Return the way you came, or create your own extended alpine circuit exploring the ridgelines to the west. The Tsuius Mountain route heads south from the open alpine near the larger tarns. Route finding and experience with alpine mountain travel is necessary.",
    "directions": "Turn south off Hwy 1 onto the Three Valley/Mabel Lake Forest Service Road, just west of the rest stop on the south bend of Three Valley Lake (between Sicamous and Revelstoke). Drive 4.3 km (watching for forestry traffic), and just past Frog Falls Rec site turn left/east onto the Three Valley/Mable/South Pass Forest Service Road. Reset your odometer to 0 km here. The road climbs. At 5 km stay right, and at 10 km continue forward on the main Forestry Road (past the road on left). At 10.4 km stay left past road on right, cross bridge, and at 12.3 km park and look for the trail on the right side of the road (look for a trailhead sign mounted high atop of a stripped tree trunk on the side of the road, and a gap in the willows usually marked with some flagging).CAUTION: Access is via steep forestry roads, 4wd recommended. This is a serious alpine backcountry hike requiring experience in wilderness preparation, travel, and navigation. Grizzly country.",
    "geohash": "c35c",
    "photos": [],
    "source_url": "https://trailpeak.com/trails/joss-mountain-near-sicamous-bc-12840",
    "stats": {
        "Activities": "mtn-bike hike",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 5,
        "Time": "12 hrs",
        "Total Distance": "8 km",
        "Town": "Sicamous, BC",
        "Type": "out-and-back"
    },
    "title": "Joss Mountain",
    "trail_id": "12840"
}