{
    "description": "*** Annual road closure (AB-40) between December 1 & June 14.Completed on August 26, 2017 in dry conditions (wide but exposed ledge used between false and true summit).Edwards Rating: III (IV) S M4.5 to 8 hoursElevation of 1023 m NET, 1245 m TOT & max 3092 m (about 1100 m total normally)*** GPS TRACK is showing quite a bit of route finding as I found another way up with moderate-difficult scrambling to the first ridge and I used two different routes on the summit block.Gear: Poles (every hike), helmet (every scramble) & GPS device (some route finding on summit block).*****This is more of a moderate-difficult scramble in our opinion with some exposed hands-on, loose rocks on steep terrain and a bit of route finding to get to the summit from its base. It is enjoyable but dangerous with lots of loose rocks on a popular scramble as we met 3 other groups.From the car, we followed the obvious trail going up on the left side of the drainage gaining some elevation quickly to arrive into the valley. The trail splits at some point and we stayed high and under the false summit connecting ridge. The easy way to go is to follow our descent route going down to the valley, hike to its end and turn left up solid rock outcrops as early as possible to stay away from potential rockfalls if other scramblers are descending. Back to our ascent route, I made things a little more complicated as I thought the rock looked solid and fun to scramble. We turned left at GR458044 and started scrambling up ledges and across gullies with some hands-on and mild exposure. I added about 7-8 cairns on that route to help you if you want to make things more challenging prior to the false summit. On the first cliff band we met, we went up a ledge (GR458046) and then turned right to traverse a gully (GR458047). We then found another good ledge (GR458049) and went up all the way to the ridge. I retraced back a few steps and found a weakness on that cliff band with some exposed downclimbing (GR458050). I went down but as my partner couldn?t complete that section I came back up, we found good slabs below us (GR458049) to scramble down and left and reach the easy route minutes later. We started going back up on the first solid rock outcrop (GR459050) we came across and went straight up to the ridgeline. We turned right and followed the ridge to the false summit using a good trail and scrambling up slabs with debris just below this peak. Looking on the other side, I saw that wide and exposed ledge a few metres down and reached it to hike along the ridge connecting to the true summit up till the end (passed the summit). Realizing it might not be the best option, I scrambled back down this last slope I had just came up from and found some weaknesses on slabby terrain just before the summit block. I went up and toward the summit and another scrambler showed me the way up exposed hands-on to the ridge. Once on the ridge, some hands-on and loose rocks lead to the summit. Some people will go down just below the summit as an alternative route explained in Alan Kane?s book but I downclimbed (some exposure and small holds, GR458059) on the other side to reach back the main ledge and met my partner that was waiting for me below the ridge. Some people went up a chimney just below the summit and it might be the easiest option but I haven?t tried it.From the false summit, we followed scree trails when possible but as a group was coming up below us and lots of rocks were falling, we had to leave good descent trails and follow the ridge to avoid that group. Again, the best way is to go up the ridge as early as possible using the outcrops rather than the scree-rubble trails that are better suited on the way down. We descended in the valley directly to give our feet a break from that rubble and reached back the main trail later staying on the right side of the creek. This is a very nice scramble but I consider that some sections are rather difficult and rockfalls are very dangerous here.",
    "directions": "From Calgary, follow Trans-Canada Hwy/AB-1 W to Kananaskis Trail/AB-40 S. Take exit 118 and start your odometer at the Casino entrance for about 71 km or 3.3 km passed Highwood Pass parking lot where there?s a pull-off on both side of the road (Lost Lemon Mine sign). Park on the left side at the trailhead (GR451037). There?s a flag on the left side of the drainage.",
    "geohash": "c2yr",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/12848/long_Storm-Mountain-Highwood-Kananaskis-Aug-26-2017-23-1024x402--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12848/long_Storm-Mountain-Highwood-Kananaskis-My-Way-Up-Aug-26-2017-1-1024x610--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12848/long_Storm-Mountain-Highwood-Kananaskis-Ridge-from-Highwood-Ridge-to-Joffre-Aug-26-2017-1024x306--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12848/long_Storm-Mountain-Highwood-Kananaskis-Summit-View-Highwood-Peak-Mist-and-Storelk-Aug-26-2017-1024x260--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12848/long_Storm-Mountain-Highwood-Kananaskis-Summit-Views-From-Mist-to-Arethusa-Aug-26-2017-1024x221--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12848/reg_Storm-Mountain-Highwood-Kananaskis-Climbed-Down-under-Summit-Not-the-Best-Idea-Aug-26-2017-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12848/reg_Storm-Mountain-Highwood-Kananaskis-Summit-Aug-26-2017-4-1024x646--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12848/reg_Storm-Mountain-Highwood-Kananaskis-Valley-and-Highwood-Ridge-Aug-26-2017-1-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12848/narrow_Storm-Mountain-Highwood-Kananaskis-Along-Wide-Exposed-Ledge-Summit-Block-Routes-Aug-26-2017-768x1024--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12848/narrow_Storm-Mountain-Highwood-Kananaskis-My-Way-Up-Crux-Aug-26-2017-777x1024--44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/storm-mountain-highwood-near-kananaskis-ab-12848",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 4,
        "Time": "6 hrs",
        "Total Distance": "8 km",
        "Town": "Kananaskis, AB",
        "Type": "out-and-back"
    },
    "title": "Storm Mountain (Highwood)",
    "trail_id": "12848"
}