{
    "description": "Flower Ridge is an excellent hike that offers panoramic views of Strathcona park. The hike requires no technical skills and there is no exposure making the hike accessible to anyone who is willing to put in the work. The first 6km of the trail is through a steep forest section which is quite exhausting and you find yourself chasing the open sky indicating the ridge is close. Once you break through the tree line you are instantly rewarded with fantastic views of the surrounding peaks.The ridge can be followed for several hours, put quite simply the further you go the more breathtaking sights you will see. Please keep in mind that water is in limited supply and it is well worth filling up at a creek (about 1.5 hours into the woods) and at a clear tarn (about 1.5 hours on the ridge). Flower ridge is an excellent hike and gives a great orientation of Strathcona park.",
    "directions": "Simply follow Highway 28 through Campbell river and past the Ralph River camp ground. Trail head is clearly marked and will be on your left side a few minutes after passing Ralph River camp ground.",
    "geohash": "c0y",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/12844/reg_IMG-6605-52797.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12844/reg_IMG-6612-52797.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12844/reg_IMG-6613-52797.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12844/reg_IMG-6671-52797.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12844/reg_IMG-6678-52797.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/flower-ridge-near-campbell-river-bc-12844",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 4,
        "Time": "12 hrs",
        "Total Distance": "30 km",
        "Town": "Campbell River, BC",
        "Type": "out-and-back"
    },
    "title": "Flower Ridge",
    "trail_id": "12844"
}