{
    "description": "Completed on September 9, 2017 in the clouds with rain (extremely slippery).SUMMIT REGISTER: Please bring a pen and a Ziploc bag for the register!GPS TRACK ends about 1.3 km from the car on the descent route as my battery was dead. Return the same way you came using animal trails between the drainage and the road.Edwards Rating: II (II) M M8 to 12 hoursElevation of 1358 m NET, 1400 m TOT & max 2776 mGear: Poles (every hike), helmet (every scramble) & GPS device (bushwhacking and some route finding).*****This is not a popular scramble and we know why, this is a terrible approach. It was our third attempt after a first one trying to go up straight under the summit from the road and a second one where we turned back because of avalanche hazard. Fall is the right time to complete it if you dare as it involves a lot of bushwhacking and some route finding. A fire and flood damage makes Ranger Creek the worst drainage approach we have ever done.Starting from the pull-off area we crossed the road, turned left and walked about 100 metres until we saw a flag (GR857740). It doesn?t really matter as long as you get to Ranger Creek since most trails are animal trails and getting there as quickly as possible is the best way to go. We should have just gone straight up from the car. We reached the main drainage a few minutes later (GR857752) and stayed in it for the next 2 hours in hell. Deadfall, washed-out trail on the left side and crossing the creek several times makes it for an awful hike. We used the trail on the left every time it was possible, used that old ladder at some point as well and got in front of that main ridge finally. We saw a cairn (pretty much the only one here) and turned right to scramble up a steep slope in a moss forest (GR878782). We reached what seemed like a dried-out waterfall (GR880781) and scrambled up to the treeline. The best way to go would have been to use the drainage just before that ridge and avoid this bushwhacking. Once on the ridge, it started raining with strong wind and we were in the clouds a few minutes later. We then relied on our GPS and sidesloped along the right side of the ridge later on but the best way to go is to stay on this ridge all the way to the summit. We came back to it passed the false summit and it naturally led us to the left where a short walk led us to the summit (GR890770) with no views.On the way down, we stayed on the ridge all the time until we reached the false summit we had avoided on our ascent route. We turned right from there (GR887774) and down a steep slope that was quite challenging because of the rain but would otherwise be easy. We reached that lower col and turned left (GR888775) to go down a good dirt-scree slope and lose the first 400-500 metres of elevation quickly. When it changed to rubble, we went to the left and used the grassy slope to get down to the drainage and later on back to Ranger creek on our left (GR880784). I think I would have preferred to use that route also for the ascent and scramble up ledges and rock bands rather than bushwhacking in the moss forest. I added some indications on the pictures in case you want to do this. As mentioned above, my GPS track stops in the forest about 1.3 km away from the car as my battery went dead but we just used animal trails to get back to the road from that point.",
    "directions": "From Banff, follow the Trans-Canada Highway 3 km west and take the exit for Johnston Canyon. Drive on Bow Valley Pkwy/AB-1A W for 10.9 km and park on the left side of the road at the pull-off area.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/12859/long_Cockscomb-Mountain-Banff-Ascent-Descent-Views-Sep-9-2017-1024x621--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12859/reg_Cockscomb-Mountain-Banff-Descent-Gully-Hidden-Sep-9-2017-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12859/reg_Cockscomb-Mountain-Banff-Old-Ladder-Sep-9-2017-1024x970--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12859/reg_Cockscomb-Mountain-Banff-Summit-Sep-9-2017-3-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12859/reg_Cockscomb-Mountain-Banff-View-Ridge-to-Ascent-Sep-9-2017-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12859/reg_Cockscomb-Mountain-Banff-Welcome-From-Hwy-1A-Sep-9-2017-899x1024--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12859/narrow_Cockscomb-Mountain-Banff-Face-Shape-Rock-Sep-9-2017-749x1024--44639_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12859/narrow_Cockscomb-Mountain-Banff-Nice-Waterfalls-Sep-9-2017-1-490x1024--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12859/narrow_Cockscomb-Mountain-Banff-Nice-Waterfalls-Sep-9-2017-2-768x1024--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12859/narrow_Cockscomb-Mountain-Banff-Terrible-Bushwhacking-Sep-9-2017-768x1024--44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/cockscomb-mountain-near-banff-ab-12859",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 1,
        "Time": "10 hrs",
        "Total Distance": "16 km",
        "Town": "Banff, AB",
        "Type": "out-and-back"
    },
    "title": "Cockscomb Mountain",
    "trail_id": "12859"
}