{
    "description": "Look at some satellite imagery, you can see a headland jutting out to the Bay of Fundy just south of the Mavielllete Provincial Park.  I decided to walk the shore to see the exposed cliffs and possible sea caves.  The first part of the hike is the least fun as the cliffs are the drumlin kind and there is very ;little to see.  After just 15minutes you finally get to the cliffs.  there are fantastic.  the colours are psychedelic and there are numerous small sea caves to see.  As you progress along the cliffs there are not many options to get out as the cliffs are pretty vertical so watch for the tides before setting off.   At some point there is a huge shall type rock jutting out from the rock wall which is very impressive. The only mistake I did is that I opted to get to the top of the cliffs to return to my starting point.  The vegetation ip there is out of this world.  The bushes and pricey bushes are shoulder high and so dense you feel like you can almost swim on top of them.  Dont try it!",
    "directions": "Highway 1 at Salmon River northeast of Yarmouth.  Drive to Davids Cove Road and park at the end and reach the beach below the best way you can.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/12851/reg_DSC-4388-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12851/reg_DSC-4405-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12851/narrow_DSC-4398-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12851/narrow_DSC-4402-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/davids-point-near-yarmouth-ns-12851",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "2 km",
        "Town": "Yarmouth, NS",
        "Type": "out-and-back"
    },
    "title": "David's Point",
    "trail_id": "12851"
}