{
    "description": "Completed on Sep 2, 2017 in dry conditions.Edwards Rating: II (III) S M6 to 9 hoursElevation of 1335 m NET, 1340 m TOT & max 3080 m Gear: Poles (every hike, particularly steep here), helmet (every scramble and essential here with rockfall hazard), GPS device (some route finding), etc.*****This is a fine scramble for its views of the many surrounding glaciers, some interesting route finding at the beginning and good scree on the way down to lose over 600 metres of elevation quickly. Route finding, rockfall hazard and mild exposure on steep slopes makes it for a good moderate scramble technically.From the pull-off area, we crossed the highway and walked along the road (going left or north) for about 450 metres when we saw a yellow flag on a tree (GR308360). We started bushwhacking straight up and came across a drainage (GR309361). Our mistake here was to keep bushwhacking passed it as we should have turned right and followed it for a while. We came back to it minutes later and used that drainage up to a waterfall. There?s a good but bushy trail on the right side that is not so obvious so we used it only on our way down. We rather went up a dirt slope on the left side (GR314364) and over that waterfall. We then turned right and hiked down to another drainage that we crossed (GR314365) to hike back up a steep treed slope. We continued on that crest straight up in between two drainages until we reached a boulder field (GR317366). From here, pay attention to the two huge boulders to remember where you came from. We hiked up the boulders and rubble slope until we faced two obvious gullies going up to the ridge. We followed the left one leading almost directly to the summit using good rock on the right side of it sometimes to make the ascent easier. When we got closer to the skyline, we went further right to use good rock bands and scree ledges to complete our ascent to the ridge. The summit was a minute away on our left from there (GR324375). After enjoying tremendous views with so many glaciers and lakes around us, we returned the same way going down the ledges first and reaching back the main gully half way down to use some good scree. I did trigger a rockslide that lasted for about a minute and it was impressive and a bit scary so be careful as it can be unstable. Luckily, no other parties were on Mount Weed today. We then followed approximately the same route but first we went in the centre of the boulder field where good red-brown scree facilitated our descent. We cut to the right when it became rubble and used a dirt-scree slope for a while closer to the forest. We then returned to the boulder field and down the treed slope. Once at the drainages junction over the waterfall, we went to our left and found a good trail going along a steep slope and down on the other side of the waterfall this time. Once we lost most of our elevation and because the trail was narrow and bushy, we went back into the drainage for a while until it also became bushy. We went back in the forest and followed a faint trail down to the highway and back to our car.",
    "directions": "From Lake Louise, continue onto Trans-Canada Hwy for about 2.3 km and take the Alberta 93 exit toward Jasper. Continue for approx. 48 km and park at the small pull-off area on your left.",
    "geohash": "c3jn",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/12855/reg_Mount-Weed-Banff-Summit-Sep-2-2017-12-1024x682--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12855/reg_Mount-Weed-Banff-Welcome-Sep-2-2017-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12855/long_Mount-Weed-Banff-Glacier-Paradise-View-Silverhorn-Observation-Sep-2-2017-1024x477--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12855/long_Mount-Weed-Banff-Summit-View-Mistaya-Waterfowl-Lakes-and-Aries-White-Pyramid-Chephren-Sep-2-2017-1024x503--44639_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12855/long_Mount-Weed-Banff-Summit-Views-Sep-2-2017-1-1024x228--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12855/long_Mount-Weed-Banff-Summit-Views-Sep-2-2017-2-1024x230--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12855/long_Mount-Weed-Banff-View-Bow-Glacier-Thompson-Jimmy-Simpson-Peyto-Caldron-Patterson-Chephren-Sep-2-2017-1024x361--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12855/reg_Mount-Weed-Banff-Route-Sep-2-2017-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12855/narrow_Mount-Weed-Banff-Sep-2-2017-26-707x1024--44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mount-weed-near-banff-ab-12855",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 5,
        "Time": "8 hrs",
        "Total Distance": "9 km",
        "Town": "Banff, AB",
        "Type": "out-and-back"
    },
    "title": "Mount Weed",
    "trail_id": "12855"
}