{
    "description": "The Wesley Ridge area, on the north side of Cameron Lake, between Port Alberni and Parksville, has several summit destinations accessed from the Wesley Ridge trail system.  The hike along the Wesley Ridge is well known, as is the hike to Mt Wesley itself. However, there is another often-missed summit, about 2.5 km east of Mt Wesley,  which is typically referred to as the 'Wesley RIDGE summit\".  In my view it offers some of the better perspectives of the various peaks in the area and makes a great out-and-back hike from the east end of Cameron lake.  This peak, being a bit of a side step off the Wesley Ridge traverse, is not often visited but it should be.I attached a Google Earth screen grab to this report to highlight the various paths and destinations on Wesley ridge. The route up to the Wesley RIDGE summit referred to in this report is coloured LIME GREEN.  The route to Mt Wesley with the traverse is in BLUE and the Wesley RADIO tower is also labeled for reference.",
    "directions": "Proceed on Hwy #4 from Parksville parking at a very obvious gravel siding about 0.8 km EAST of Cameron Lake.  The old alberni rail tracks are next to the gravel siding.  Walk about 200 m WEST along the tracks, crossing the old rail trestle above the river. About 50m from the west end of the trestle you'll see a very well used but unmarked path heading of the tracks to your right. Turn there and head up hill, very strenuously, for about 500m to a clearing where local hikers have placed beautiful park benches for views of Cameron lake.  Enjoy the views, you have about 3.5 km to ridge the Wesley RIDGE summit, if you also take in the RADIO tower viewpoint.",
    "geohash": "c0z2",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/12858/long_trestle-55777.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12858/long_wesley-ridge001-55777.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12858/long_wesley-ridge004-55777.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12858/long_wesley-ridge006-55777.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12858/long_wesley-ridge007-55777.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12858/long_wesley-ridge019-55777.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12858/long_wesley-ridge023-55777.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12858/reg_Wesley-Routes-55777.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12858/narrow_wesley-ridge002-55777.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12858/narrow_wesley-ridge024-55777_best1_.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/wesley-ridge-summit-near-parksville-bc-12858",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "5 hrs",
        "Total Distance": "12 km",
        "Town": "Parksville, BC",
        "Type": "out-and-back"
    },
    "title": "Wesley RIDGE Summit",
    "trail_id": "12858"
}