{
    "description": "I often get to work in Cheticamp so I am always looking for my next adventure in this part of the province. A new satellite imagery of the Cheticamp River has revealed a Shangri La of waterfalls. The only problem is that they are all far from civilization and usually in pretty tricky spots to explore (i.e. climbing skills are usually required).This is an exploration of a ravine which is accessible via some snowmobile or ATV trails near the Cape Breton Highland NationalPark. I decided to set off on my man bike as I had about 6km of dirt road and an elevation of 400m to tackle to get to a point where th bushwalking had to begin. The trail was in very good shape but I wasn't. This stretch took me a little bit over 1 hour to complete. Most of the uphill is very very steep so you end up pushing your bike.Once at the crest of the highlands, a short flat stretch of 100m or so lay ahead before the descent into the ravine began. Even though a small trail was in front of me, I decided to ditch the bike in the woods and continue on foot. Soon I reached a burn out cabin and the bushwhack began. My gps had the interesting spot about 500m away. A short walk in the woods in a mixed forest going downhill brought me to a clearing over looking the valley. Soon I entered the slopes and was navigating some very very steep slopes. I did the mistake of aiming to drop by the foot of the fall but the whole area was riddles with cliffs and thus not passable. I went up and back to where I started in the clearing and chose another way to get down. Unfortunately it also ended on a cliff with too many branches in front to make a good picture but the falls was in full view. It has multiple drops of 20, 30 and 70 ft before it ends in a deep and circular pool. after the pool it looks like there is another significant slider type fall.As with most explorations, I had a turn around time and I was almost there so instead of trying to find another way down, I retraced my steps and vowed to come back one day to stand at the foot of this magnificent fall. BTW retracing the steps I noticed that a gulley by the burned out cabin leads far away from the foot of the fall but its probably the best way to access it. Unless you go for the full bushwhack from the Cheticamp River up which would be ok if you had enough time as it is about 3.5km to get to the base of the fall.BTW; the descent and 6km mtn bike ride back to the Cabot trail was wicked fast and fun!UPDATE June 2018Because of dwindling daylight and my turn around time, I was unable to see the falls on Dauphinee Brook last fall. I was able to get back to this area in June 2018 and used a different route to get to the waterfalls and gorge of Dauphinee Brook.Using the same dirt road as last time, I left the Cabot Trail at; N46° 38' 38.9\" W60° 57' 48.7\" and mountain biked for 3km. At this point, the road takes a 90 degree turn and parallels Faribault Brook. Ditch your bike here and go down to the side of the Cheticamp River. Immediately, you will need to cross the Faribault Brook. There is a nice gorge about 100m upstream of this point with a 20ft fall and a deep pool.Crossing the Faribault Brook in times of higher water may be a challenge but not the day I was there. I then followed the Cheticamp River upstream for about 1.1km?there are large sandy bars in the forest you can follow and that walk is easy and pleasant. At this point the Dauphinee Brook enters the Cheticamp River. Follow it upstream. Within about 350m you enter a conifer forest and the stream has a few waterfalls one of which looks like a natural water slide. About 1km more upstream that the natural waterslide will be the next fall. This one is about 20ft. I went to the right of it and climbed above. Right after this on the left hand side of the brook are two tributaries (N46° 37' 25.5\" W60° 54' 04.9\") that have carved deep paths in the woods down to sheer rock. The second one has a long single drop about 150m above Dauphinee Brook.Now the fun begins, the main stem of Dauphinee now exits a nice gorge and you will explore falls after falls on a small stretch of this brook. I went on the left side of the river and accessed all of the falls (at least 3-4 significant ones) that way. At the end of the gorge is the terminal fall which I would judge to be about 75 ft. The right side of the fall area (looking upstream) is sheer rock walls and I could finally see where I got stuck last time I was here.",
    "directions": "Cabot trail from Cheticamp towards the Cape Breton Highlands National Park. A unmarked dirt road on the right at 46.644151, -60.963452 is the one to follow to get into the mountains by the side of the Cheticamp River. In google maps its called Brashure Rd. The massive fall is at; 46.621567, -60.901060.",
    "geohash": "f8k9",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/12857/narrow_35348038-1122216984584811-8149203202911240192-n-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12857/long_35241116-1122216577918185-7977041088118521856-n-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12857/long_35299839-1122216607918182-1812117427408863232-n-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12857/reg_21433026-963271260479385-1494169336669393270-n-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12857/narrow_21370976-963271250479386-8424736448865101748-n-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12857/narrow_35242152-1122217167918126-3216316345855508480-n-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12857/narrow_35251092-1122216977918145-6329371155245301760-n-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/dauphinee-brook-falls-near-cheticamp-ns-12857",
    "stats": {
        "Activities": "mtn-bike hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 5,
        "Time": "4 hrs",
        "Total Distance": "12 km",
        "Town": "Cheticamp, NS",
        "Type": "out-and-back"
    },
    "title": "Dauphinee Brook Falls",
    "trail_id": "12857"
}