{
    "description": "This hike is also in 103 hikes book. It says 6 km in the book but my gps said 10km probably at the time we could drive the rest of the logging road past the current parking area. The hike is tough,1000 m elevation and no switchbacks. And when you break into the alpine you are going along the big cliffs of illusion peak. Going up here is tough knowing you have to go back down this loose sandy and rocky ground. Poles are very usefull here and i recommend helmets especially if you are in a group as rocks will fall. They did with me anyway if someone is below they may get hit. The views are great of Mt Slesse and Mt Baker beyond it. Its a tough hike be prepared.",
    "directions": "Directions are exactly the same as Slesse memorial trail (same parking area). Exit 119 on Vedder road. Drive south until the Vedder bridge which now has been replaced and there is a round about now before the bridge. Dont cross the bride, take the next exit on the roundabout which is Chilliwack river road. Drive 31 km past riverside recreation site, turn right on the forest road( there are signs for Sleese trail) and cross the bridge then turn right again. Follow this until the end at a parking area well marked with both trails. Left is Mt Rexford.",
    "geohash": "c29",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/12862/reg_IMG-2535-42566.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12862/reg_IMG-2541-42566.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12862/reg_IMG-2547-42566.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12862/reg_IMG-2549-42566.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12862/reg_IMG-2551-42566.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mt-rexford-near-chilliwack-bc-12862",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 5,
        "Time": "5 hrs",
        "Total Distance": "10 km",
        "Town": "Chilliwack, BC",
        "Type": "out-and-back"
    },
    "title": "Mt Rexford",
    "trail_id": "12862"
}