{
    "description": "Completed on Sep 16, 2017 and snow covered above 2600 m altitudeEdwards Rating: II (III) S M6 to 9 hoursElevation of 1270 m NET, 1281 m TOT & max 3125 mGear: Poles (every hike), helmet (every scramble), GPS device, ice axe and microspikes if snow covered.*****This is one of the best scrambles we have ever done! The views were spectacular early in the day and this offers incredible summit views of Hector Glacier and lake, Mount Balfour, Molar Mountain, Mt Andromache just to name a few. The approach is easy on a great trail and along a nice waterfall with some nice scrambling on steep slabs if you wish.From the roadside pullout, we crossed the road and reached Hector Creek drainage to find an excellent trail on its right side (GR478170). We stayed on that trail all the way to the waterfall where the trail goes to the left and up some rock bands (GR487174). We did some mildly exposed hands-on following some cairns and got back on the trail going to the right and along a gray cliff band. We crossed the waterfall and kept going up the official trail leading to the valley surrounded by Mount Andromache to the left and Little Hector to the right. We left the trail here (GR489173) and started going up a steep slope staying under steep slabs for a while. We reached an obvious cliff band and completed the ascent to that first ridge where we could easily see where to go next. The slope was snowy but we could see the switchbacks going up to the summit ridge. We should have brought our microspikes as it was a bit exposed and trickier toward the end of that slope. We then followed cairns and a good trail up that last rubble slope to reach the summit.On the way down, we followed the same route until we got to the plateau and instead of going back to the steep slabs we went straight down a scree-rubble slope (GR497166) and then turned left to reach the valley. We got back to our ascent route close to the waterfall and even though we followed a different trail to begin with, we ended up on the same trail but avoided the hands-on scrambling this time as we stayed on the trail all along. There were obvious signs of the presence of a bear around here but no encounters today. This scramble can actually be easy in dry conditions and following our descent route both ways in my opinion as the trail is excellent most of the time. This should be on everyone?s to do list.",
    "directions": "From Lake Louise, continue onto Trans-Canada Hwy for about 2.3 km and take the Alberta 93 exit toward Jasper. Continue for approx. 20 km and park at the roadside pullout on your left at Hector Creek.",
    "geohash": "c3jm",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/12866/long_Little-Hector-Icefields-Parkway-Hector-Creek-Waterfalls-Sep-16-2017-3-1024x428--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12866/long_Little-Hector-Icefields-Parkway-Summit-Panorama-From-Hector-to-Andromache-Sep-16-2017-1024x228--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12866/long_Little-Hector-Icefields-Parkway-Summit-Panorama-from-Bow-Lake-to-Hector-Sep-16-2017-1024x269--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12866/long_Little-Hector-Icefields-Parkway-View-Bow-Peak-and-Andromache-Sep-16-2017-1024x346--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12866/reg_Little-Hector-Icefields-Parkway-Route-Sep-16-2017-1-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12866/reg_Little-Hector-Icefields-Parkway-Route-Sep-16-2017-2-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12866/reg_Little-Hector-Icefields-Parkway-Summit-Hector-Lake-Balfour-and-Bow-Lake-Sep-16-2017-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12866/reg_Little-Hector-Icefields-Parkway-Summit-Mount-Hector-and-Glacier-Sep-16-2017-1-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12866/reg_Little-Hector-Icefields-Parkway-Welcome-From-93-North-Sep-16-2017-1024x790--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12866/narrow_Little-Hector-Icefields-Parkway-Short-but-Fun-Hands-on-Scrambling-Sep-16-2017-768x1024--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12866/narrow_Little-Hector-Icefields-Parkway-Summit-Hector-Glacier-Crevasses-Sep-16-2017-818x1024--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12866/narrow_Little-Hector-Icefields-Parkway-Tricky-with-the-Snow-Sep-16-2017-1-768x1024--44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/little-hector-near-banff-ab-12866",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 5,
        "Time": "7 hrs",
        "Total Distance": "9 km",
        "Town": "Banff, AB",
        "Type": "out-and-back"
    },
    "title": "Little Hector",
    "trail_id": "12866"
}