{
    "description": "I was in this area to revisit a large fall on the New Prospect Brook (described previously on trailpeak).  After finishing that visit I decided to visit a tributary of the same brook.  I was already at the top of the Cobequids so I only needed to bushwack my way 300m to the top of the brook and follow it to discover what lay ahead!Immediately I was pleasantly surprised with a few nice 5-15ft drop.  However what lay ahead was the best part.  the brook then plunges into a narrow ravine.  I was able to scale down a very very steep slope on the east side and found myself at the foot of the 25 ft fall which careen down the rock wall.  A pool is in front of it and then the brook looses about 6ft to the top of another 20ft fall.  I bypassed this one by going on the east side again and made it to the foot of it. Finally another 20ft drop blocked my passage.  I actually downclimbed this fall as the water was low but it would be very hard at times of high water to do this.   There are no easy way to get to these falls except by climbing in the fall themselves or downclimbing like I did so be careful.  Afterwards there are a few slider type drops but nothing spectacular.  follow the brook as it crosses the ATV path.",
    "directions": "Highway 2 towards Parrsboro.  turn on Prospect Rd and immediately park.  There is an ATV trail that starts on the north side of the road.  Follow it until it crosses a small 6ft wide brook.  follow it upstream or climb the whole Cobequid Hill and then drop from the top like I did in the post.  The bulk of the falls are centered around;  45°26'6.53\"N,  64°16'22.10\"W",
    "geohash": "f8463",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/12861/reg_DSC-4550-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12861/reg_DSC-4543-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12861/reg_DSC-4554-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/west-tributary-new-prospect-falls-near-parrsboro-ns-12861",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "3 km",
        "Town": "Parrsboro, NS",
        "Type": "out-and-back"
    },
    "title": "West Tributary New Prospect Falls",
    "trail_id": "12861"
}