{
    "description": "This trail is in 103 hikes book. I was surprised to see it wasnt on this website yet. EDITOR'S NOTE: there is Elsay Lake hike which is same area but not the peak (use our search with keyword Elsay in it). The book says 500 m elev gain but that is not correct because you have to go down again and up again about 4 times, so according to my gps it is about 1000 meters of ascending total. It was much harder than I thought. You start at Seymour parking and you do Seymour mountain to past the second pump, going down the gully at the left, instead of heading up to 3rd pump you go left and follow flagging.From here the trail goes down through slippery roots and rocks, and then goes around Seymour and up again behind Seymour and then down again to another gully with rock slide with snow still in september. Here it can be confusing if you go up the rock slide you would end up at runner peak, so you have to go across towards the left in the forest. Goes up again steeply until you get in the pass between Elsay and Runner peak. Now at this point you have to go up another 200m to the summit which is a nice peak to explore. You can see Elsay lake down the cliff, Mt Seymour back side. Now back down from the peak to the pass you have to choose to go back where you came or do the loop by going down the huge boulder field going down to join Elsay lake trail. If you do the loop think about how tired you are because going down the boulder field is tough, Elsay lake trail is very worth it but then the uphill slog is a killer to go back up towards Seymour.Very nice hike if you like a real challenge.",
    "directions": "Take hwy 1 to Seymour park way and make your way up to the ski hills parking.  See GPS right, and consult the above notes and the other alternate listing for this hike on this site.",
    "geohash": "c2b",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/12860/reg_IMG-2519-42566.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12860/reg_IMG-2520-42566.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12860/reg_IMG-2522-42566_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12860/reg_IMG-2525-42566.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12860/reg_IMG-2526-42566.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12860/reg_IMG-2527-42566.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mt-elsay-near-north-vancouver-bc-12860",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 5,
        "Time": "9 hrs",
        "Total Distance": "16 km",
        "Town": "North Vancouver, BC",
        "Type": "out-and-back"
    },
    "title": "Mt Elsay",
    "trail_id": "12860"
}