{
    "description": "A nice tundra hike in the northern part of Tombstone Park in the Blackstone Range. The view includes the wide open valley of the Blackstone River as it meanders north and the surrounding rolling hills which give way to more dramatic mountain ranges beyond.From the parking area, head up the open slope towards the top of the low ridge, staying on the right side of the small creek to avoid having to bushwack through the willows. There is somewhat of a trail at the beginning but this peters out within a few minutes. The terrain is quite hummocky at the beginning in the tussocks. Before the top of the low ridge take a left through a small opening in the willows and follow an animal trail through a meadow leading up a small hill. Continue up the slope now heading south towards the mountain, towards a small saddle midway along the mountain ridge. Once at the saddle you can see into the other valley and south down the Dempster Highway. Follow the ridge up towards the small peak of Surfbird Mountain which lies to the southwest. From the peak, there are beautiful views towards Blackstone Mountain and Mount Auston. Wildhorse Creek winds its way below to the south. You can return the way you came up, but it is also nice to head back along the ridge and continue north-east towards the other end of the mountain and descend towards a rock tower on the north-east facing slope. There are beautiful views looking north over the Blackstone River and the mountain ranges beyond. The slope is gentle and spongy making for a nice descent. You will need to cross a few small streams and willow sections to get back to the parking area, but it is easy to find animal trails to avoid the bushwacking.Thanks to yukonhiking.ca for this excellent description. Do wear waterproof hiking boots as there are numerous wet spots in the spongy tundra. We did see a few Surfbirds, but they were gone before I could get a photo.",
    "directions": "At kilometer 98 of the Dempster Highway, follow the spur road on the left side (if heading north) all the way up to a microwave tower. Park here, and make sure to allow enough space for work vehicles to access the tower.",
    "geohash": "bg",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/YT/12869/reg_DSCN2258R5-56032.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/YT/12869/reg_DSCN2277R5-56032.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/YT/12869/reg_DSCN2280R5-56032.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/YT/12869/reg_DSCN2282R5-56032.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/surfbird-mountain-in-tombstone-park-near-dawson-city-yt-12869",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "7 km",
        "Town": "Dawson City, YT",
        "Type": "out-and-back"
    },
    "title": "Surfbird Mountain ? in Tombstone Park",
    "trail_id": "12869"
}