{
    "description": "Easier than it looks, but don?t be fooled... this short scramble includes a creek crossing and some brief cliff edge exposure.At first glance, it would seem impossible to access any lake above Bow Glacier Falls, but with careful attention you will be rewarded.To get to Iceberg Lake, take the trail towards Bow Hut from Bow Lake. Just past the turnoff to Bow Glacier Falls, cross the large rock on the left and once back down at creek level, cross the creek and head up the trail on the left side of the moraine. Before reaching the top of this first moraine, watch out for the rock ledge on the left. It is not near as scary as it looks from below. The first 70 metres is very wide and then there is a slightly exposed portion of only about 3 metres. Then climb through a number of treed cliff bands, arriving at a lovely little protected plateau. Go left again to find another cairned route up this second moraine in front of you. Upon reaching the crest at another large cairn continue left as Iceberg Lake opens up before you. It is only about 5 km with an elevation gain of 350 metres.The lake is fed by Bow Glacier and drops out over the ledge as Bow Glacier Falls, to all the sightseers below.",
    "directions": "Park at the Num Ti Jah Lodge located on the north side of Bow Lake approximately 40kms north of Lake Louise on the Icefields Parkway.",
    "geohash": "c3jj",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/12875/reg_DSCN1607Rsz5-Iceberg-Lake-56032.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12875/reg_DSCN3256Rsz5-56032.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12875/reg_DSCN3260Rsz5-56032_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12875/reg_DSCN3269Rsz5-56032.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12875/reg_DSCN3303Rsz5-56032.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12875/reg_DSCN3316Rsz5-56032.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12875/narrow_DSCN3331Rsz5-56032.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/iceberg-lake-above-bow-lake-bow-glacier-falls-near-banff-ab-12875",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 5,
        "Time": "6 hrs",
        "Total Distance": "15 km",
        "Town": "Banff, AB",
        "Type": "out-and-back"
    },
    "title": "Iceberg Lake (above Bow Lake & Bow Glacier Falls)",
    "trail_id": "12875"
}