{
    "description": "I've often read that the Alpine Circuit Rates as one of the Top Day hikes in the World and now that I've done it twice, once with blue sky and once with a few inches of snow on it, I have to agree. There are variations of the Alpine Circuit (so you'll see different mileages depending on which route is taken). The GPS I've submitted is for the Wiwaxy Gap/Huber Ledges, Yukness Ledges & All Soul's Prospect combined Circuit as this would likely be the reasonably possible dayhike. Abbott Pass would involve a huge scramble and Odaray, while possible to physically also do in one day has special limits in place. note- the GPS track submitted originally had a portion of the Odaray/McArthur Lakes trail on it but has been cropped from it, therefore start & end times will have a time gap in it.Lake O'Hara is, thankfully, quite protected from over use. For more information on getting there, or getting an overnight permit, go to the Parks Canada website:http://www.pc.gc.ca/en/pn-np/bc/yoho/activ/randonnee-hike/oharaDescription from the Parks Canada Website:There are five alpine routes above the O'Hara basin for experienced hikers who are comfortable with route finding, heights and traversing exposed terrain. Alpine routes are often shown by cairns, and may involve scrambling on scree slopes or over boulder fields where the way is marked by painted blue and yellow symbols. Expect early season closures on the alpine routes due to avalanche hazard. Hikers must be aware of avalanche conditions year round and follow protocols for travelling in avalanche terrain. ?Wiwaxy Gap / Huber Ledges  ?Yukness Ledges  ?All Soul's Prospect ?Abbot Pass  ?Odaray Grandview* *Note: A voluntary program is in place to limit use of the Odaray Highline Trail which provides access to this route. Please hike other trails first to help protect a vital wildlife corridor. TRAILMAPhttp://www.pc.gc.ca/en/pn-np/bc/yoho/activ/randonnee-hike/ohara/~/media/4C94D033C6B44BD5A19D5D1B6C571CEA.ashx?w=595&h=414&as=1",
    "directions": "Both day trips and overnight adventures to Lake O'Hara begin by bus. Parks Canada?s Lake O'Hara bus runs mid-June through the end of September or early October. Reservations are required for your in-bound journey only. The bus departs from the Lake O?Hara parking lot, 12 km west of Lake Louise, Alberta or 13 km east of Field, B.C.",
    "geohash": "c3jk",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/12878/reg_IMG-5502-57706.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12878/reg_IMG-5547-57706.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12878/reg_IMG-5554-57706.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12878/reg_IMG-5569-57706.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12878/reg_IMG-5572-57706.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12878/reg_IMG-5589-57706.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12878/reg_IMG-5597-57706.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12878/reg_IMG-5598-57706.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12878/reg_IMG-5599-57706.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12878/reg_IMG-5600-57706.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12878/reg_IMG-5618-57706.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/lake-ohara-alpine-circuit-near-field-bc-12878",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 5,
        "Time": "6 hrs",
        "Total Distance": "13 km",
        "Town": "Field, BC",
        "Type": "out-and-back"
    },
    "title": "Lake O'Hara - Alpine Circuit",
    "trail_id": "12878"
}