{
    "description": "This is one of those magical places that occur deep in the highlands of Cape Breton Island.  I had been pouring over some satellite imagery of the branches of North River to try to find some gorges and falls to explore.  The main reason was that the East Branch North River is the location of the massive and well known North River Fall (and provincial park!) and if there was a fall on that branch there should be more falls on the other seldom visited branches.  Therefore the hike described below is not the same location as the provincial park..it lies approximately 4km  south of the well known fall.The satellite imagery was showing a lot of white spots and grey bands which usually indicated sheer rock walls.  I was super intrigued, excited at this prospect.  however it seemed a bit remote to attempt on my own.  Luckily a fellow explorer (Andrew H) was available to explore this hidden gem!We drove the logging road as far as my subby could and then set off on foot on the remaining 200m or so of logging road in front of us.  We entered the forest and traversed through a mixture of hardwoods and softwoods and saw flagging tape indicating we were entering a wilderness area.  Within 400m of leaving the logging road we crossed a tributary to the West Branch.  this tributary shows some falls at its end before it enters the West Branch.  sure enough, there were 3 distinct plunges of which you can stand at the base of the top two to shoot pictures.  the last drop is all the way to the river far below.  You can see from this spot the lowest of the three major  falls on the West Branch.Immediately to the NE of the tributary is a ravine and I tried to follow it down but it was too steep.  We had to climb up and circumvent the ravine.  Which was a good decision as the ravine ends up at the head of a 40ft drop into the pool of the lower fall and so it would be impossible to access anything from that ravine.  Climbing down towards the base of the lower fall we spotted the second fall on the West Branch and it looks massive.  We were able to make it to the base of the lower fall by walking on  a wide, rocky, and forested ledge to the base of the pool.  You can see the lower fall at this point as well as the lower fall of the tributary we first encountered.Had the water levels been not so high we would have attempted a crossing and tried to climb up the very steep but forested opposite bank to get to the base of the second fall.  But we couldn't and the only view we had of the second or middle fall is through the forest and from its top.To get to the top of the second fall requires an upclimb to the top of the tributary falls.  Once at the top of all the fall you can traverse on top of the ridge and bypass some rock slides and then easily down climb to the top of the middle fall.  We were disappointed  that there were no places to downclimb from this point to the base of the middle fall.  However I had spotted at top fall which I though could be the best of the lot as it showed as a straight drop!Only a few hundred meters of light bushwhacking brought us to the base of the third and best fall of all.  The fall is a straight plunge of over 50ft or more into a deep poll surrounded by steep cliffs, the pool exits the canyon like feature with a smaller 4ft drop in a narrowing of the river.  the picture doesn't do this place justice as it is just spectacular!  From that point on it a steep upclimb to the top of the highlands and a short bushwack to the logging road.You need good navigation, climbing skills and stamina to make it to this place so be careful.",
    "directions": "Take the highlands Road from hunters Mountain and drive all the way to a secondary road on the right at;  46°22'42.00\"N,  60°48'54.57\"W.  This secondary road is only about 400m before you get to the Fielding rd.  Drive the secondary road for approx 9km to  46°20'6.56\"N,  60°43'52.57\"W.  the lowest fall described in this post is at;  46°20'12.10\"N,  60°43'11.48\"W",
    "geohash": "f8hz",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/12879/reg_WESTBRNACH-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12879/reg_WESTBRNACH2-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12879/narrow_WESTBRNACH1-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/west-branch-north-river-falls-near-baddeck-ns-12879",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 5,
        "Time": "3 hrs",
        "Total Distance": "3 km",
        "Town": "Baddeck, NS",
        "Type": "out-and-back"
    },
    "title": "West Branch North River Falls",
    "trail_id": "12879"
}