{
    "description": "An island favourite that combines forest hiking with a ridge walk that culminates in a short, but exposed rock climb to to get you to the summit of Mt. Arrowsmith. On a clear day, the summit view extends from the east to the west side of Vancouver Island encompassing views of the Broken Group Islands in the Pacific to the islands of the Inside Passage.  The hike starts in steep forested terrain that brings you to a col between Mt. Cokely and the Arrowsmith massif. Once you reach this col, you are fully in the alpine with wonderful panoramic views on all sides. The trail steepens significantly as it climbs the \"Bumps\", two or three minor peaks on the way to the main summit. On the last \"bump\" the route descends steeply bringing you to the base of the \"Nose\". This is an exposed climb with a 200m drop down one side and a 400m drop down the other. There is a 60m section that is rated as a low Class 5 climb. Feels like about a 5.4/5.5. We have climbed it in the rain so it cannot be too had. There are two very solid belay/rappel stations at the halfway point and the top of the 60m section. The descent is either down the Judges Trail or re-trace the climb. Re-tracing requires one or two rappels depending on the length of the rope(s) you have with you. Total rappel length is 60m and can be broken up into two 30m rappels.",
    "directions": "Follow highway 4 out to Port Alberni, at the top of the bump before Port Alberni you will see a sign for Arrowsmith Ski Hill sign, make a left here. In about 20 minutes you will be at the trail head, watch for logging trucks. Drive about 3 km and then turn left on Pass Main. You will now start heading up a bit of grade. The road itself is in good condition in this area and the Arrowsmith Col trailhead is approx 8km past the Cameron Main and Pass Main Junction.",
    "geohash": "c0z2h",
    "photos": [],
    "source_url": "https://trailpeak.com/trails/arrowsmith-summit-via-cokely-col-and-the-nose-near-port-alberni-bc-12870",
    "stats": {
        "Activities": "hike climb",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 4,
        "Time": "4 hrs",
        "Total Distance": "4 km",
        "Town": "Port Alberni, BC",
        "Type": "out-and-back"
    },
    "title": "Arrowsmith Summit via Cokely Col and the Nose",
    "trail_id": "12870"
}