{
    "description": "This is a great hike to see numerous hidden and unknown falls in the Twelve O'Clock Mountain area of Cape Breton (near Egypt Falls!).   I had spotted some great falls on satellite imagery and decided to go check them out with a fellow explorer (Andrew H).  The gpx shows up as a circle and the description should be read by going around the circle like a clock.  The first bushwack was horrendous.  I have seldom seen such thick but gnarly black spruce and there was some cursing heard by Moose on that day.   That being said, the cursing stops after 400m as you enter a beautiful and mature hardwood forest.  the terrain soon descends into a ravine and then the fun begins.  the first mini falls and canyon like feature is here; N46.21526° W61.00031° but the best is the next spot around here; N46.21322° W60.99727°.   Within that location, this tributary drops hundreds of feet in a series of waterfalls.  all but the most downstream fall can be accessed by carefully climbing along the stream.  the last drop is too sharp and you need to upclimb and bypass the gorge and then drop back down in front of the last waterfall.We had finished taking some pictures and then decided that instead of cutting across the plateau to the car, we should follow the main branch upstream as it lead in the general direction of the car.   That was one awesome decision!  The stream in this area goes through two distinct gorge like area. The lowest area was too steep and flooded to access and so we only saw the falls from up above except for the more upstream one where you can stand at its base easily (approx N46.21027° W61.00178°).  Walk upstream another 150m and you will see the best of the lot.  the fall here is hidden behind a rocky curtain.  It's hard to get access to its base but well worth it (N46.20965° W61.00400°).  We walked upstream some more and saw a few 5-6ft falls but nothing spectacular.  The hike back to the car was via some moose trails and then a softwood stand that was so easy to traverse in comparison to the first stand we crossed that day.",
    "directions": "Highway 395 in Upper Margaree.  Take Egypt road and drive and park approximately at; N46.21469° W61.01008°",
    "geohash": "f8hwg",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/12883/reg_MACRAE-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12883/reg_MACRAE1-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12883/reg_MACRAE4-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12883/narrow_MACRAE2-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/macrae-brook-gorges-and-falls-near-port-hawkesbury-ns-12883",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 5,
        "Time": "3 hrs",
        "Total Distance": "8 km",
        "Town": "Port Hawkesbury, NS",
        "Type": "out-and-back"
    },
    "title": "MacRae Brook Gorges and Falls",
    "trail_id": "12883"
}