{
    "description": "*** Annual road closure (AB-546) between December 1 & May 14.Completed on October 7, 2017 with some snow over 2000 m altitude, icy and wet slabs. Possible bike approach with a couple of steep slopes.Edwards Rating: II (III) L L8 to 13 hoursElevation of 1174 m NET, 1762 m TOT & max 2789 mGear: Poles (every hike), helmet (every scramble and essential in chimney and along the cliff), GPS device (some route finding), microspikes, crampons and ice axe if snow covered.*****This is a very long day and if you plan to do it early or late in the season make sure to bring your winter clothes, gear and leave early. It is more of a moderate scramble technically in our opinion with some mild exposure on steep terrain and slabs and maybe difficult if using the chimney straight up to the main ridge. It was an enjoyable scramble with great views most of the time but this approach is painful (at least on a good trail?). If you need a trail and cairns to guide you it will be a problem as there were none passed the main trail and we didn?t add cairns as we didn?t have much time left to come back and the wind was extremely cold. From the road, we walked to the end of the parking lot to reach the trailhead (sign and map) and started hiking up Bluerock trail. We stayed on the most obvious trail at all times and going right at a fork at GR598087. The trail goes down to Bluerock creek and back up right away on a steep slope and then along the left side of that ridge till the end of the official trail at the opening. From there, we started scrambling up to the right of what people call Ram Mountain (first high point) where a rubble slope seemed easy to ascent with that snow. From the top, we could see that long and huge cliff band so we stayed on the ridge and reached it quickly to stop below an impressive system of chimneys (GR558132). Knowing that some parties have used the chimney on our right to get to the main ridge, we tried it but stopped at the crux where some climbing was involved. It was snowy, rocks were falling once in a while, we had forgotten our helmets and snow was melting so we had to deal with wet rocks. We turned back down and followed the cliff band losing a lot of elevation to get where it ends and turned right (GR556126) to start going up behind it and eventually on top of it. We sidesloped scrambling on slabs at first but then we saw an opening where a rubble slope seemed to lead to the ridge. We scrambled up to reach that opening at GR555129. We were now on the spine of that cliff band and followed it up to the ridge. From there, most of it is obvious as we could see the false and true summit after a few minutes hiking on the ridge. Some sections can be avoided on the left side but we stayed as much as possible on the ridge and scrambled on slabs. It was mildly exposed and sometimes tricky because of the ice and water but doable. From the false summit to the summit, it is easy and straightforward. We got back to that rubble slope below the cliff spine using the same route and from there descended almost straight down staying on the right side of that slope (GR555128). The goal was to use some scree to make it easier but the fact is that it is a mix of scree, rubble and hidden rock bands so it was not that easy after all. Once we got closer to the trees and creek, we came across a very good animal trail and turned left (GR553126) to sideslope back to Bluerock trail. That way we avoided a lot of extra elevation gain as we were tired and it was late in the day. We stayed at about 2040-2080 m altitude and used the best animal trails available in that range. We came back at sunset and by the time we were in the car it was dark. The drive back on AB-546 was very interesting as the cows were going crazy sometimes crossing suddenly, jumping around like bulls and running. We had to drive very slowly as there were at least two dozen cows on the road and lots of deer as well.",
    "directions": "From Calgary, follow Trans-Canada Highway/AB-1 W, take exit 161A for AB-22 S toward Bragg Creek/Redwood Meadows and go south for about 22 km. Turn left on AB-22 S and continue for 19.5 km. Turn right on AB-22 S for 27.4 km to Turner Valley. Turn right at the intersection onto Sunset Dr. NW/AB-546 W and drive for another 38 km to the Bluerock Equestrian Campground on your right. DO NOT park there if the gate is open as you could get a ticket. We parked by the side of the road.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/12887/long_Bluerock-Mountain-Kananaskis-Nice-Cave-Oct-7-2017-1024x284--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12887/long_Bluerock-Mountain-Kananaskis-On-Cliff-Band-Opening-to-Ridge-Route-Oct-7-2017-1024x516--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12887/long_Bluerock-Mountain-Kananaskis-Ridge-Walk-Passed-Cliff-Routes-Oct-7-2017-1024x368--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12887/long_Bluerock-Mountain-Kananaskis-Route-Down-Oct-7-2017-1024x615--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12887/long_Bluerock-Mountain-Kananaskis-Summit-View-Ware-Prairire-Junction-and-Highwood-Oct-7-2017-1024x234--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12887/reg_Bluerock-Mountain-Kananaskis-Chimney-from-the-Top-Difficult-Route-Oct-7-2017-1024x653--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12887/reg_Bluerock-Mountain-Kananaskis-Oct-7-2017-19-945x1024--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12887/reg_Bluerock-Mountain-Kananaskis-Ram-Mountain-Oct-7-2017-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12887/reg_Bluerock-Mountain-Kananaskis-True-Summit-Far-Ahead-Route-Oct-7-2017-1024x693--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12887/reg_Bluerock-Mountain-Kananaskis-Viewed-from-Mt-Ware-Summit-Taken-on-Nov-5-2016-1024x996--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12887/narrow_Bluerock-Mountain-Kananaskis-Chimney-Attempt-Oct-7-2017-2-768x1024--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12887/narrow_Bluerock-Mountain-Kananaskis-Chimney-Attempt-Oct-7-2017-3-683x1024--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12887/narrow_Bluerock-Mountain-Kananaskis-Scrambnling-on-Slabs-Oct-7-2017-768x1024--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12887/narrow_Bluerock-Mountain-Kananaskis-Toward-Cliff-Band-Oct-7-2017-768x1024--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12887/narrow_Bluerock-Mountain-Kananaskis-Up-Ram-Mnt-Oct-7-2017-768x1024--44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/bluerock-mountain-near-turner-valley-ab-12887",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 3,
        "Time": "12 hrs",
        "Total Distance": "25 km",
        "Town": "Turner Valley, AB",
        "Type": "out-and-back"
    },
    "title": "Bluerock Mountain",
    "trail_id": "12887"
}