{
    "description": "This is a hike to add when planning to see the massive falls on the West Branch North river (another post on trailpeak!).  I had some intuition that there might be some good falls to explore on a tributary of the Middle branch as it plunges from the Highland Plateau, losing over 100m in height within 500m distance.Immediately to the south of the brook is a mixed between an open forest and a bog.  The brush is high but there are only small trees here and there to block your 360 degree viewpoint.  soon you descend into the ravine created by the brook.  the brush is thick throughout the hike but the rewards are plentiful.  the brook has 3 major waterfalls and countless other smaller ones.  The gpx track for this hike shows a path on the middle Branch...do not go there....we thought there might have been a waterfall on the West Branch but a difficult hike to this place revealed......nothing!  We had to bypass some very high cliffs to make it there but it was a dud!",
    "directions": "Highland Rd from Hunters Mtn, turn on secondary road on your right at; N46.37831° W60.81503°.  Drive to a tertiary road on your left at; N46.34372° W60.75371°.  Drive to a parking around N46.35157° W60.74114°.  the lowest and largest fall is at; N46.35552° W60.73476°. there are a few more upstream of that point.",
    "geohash": "f8hz",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/12880/reg_TRIB-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12880/reg_TRIB2-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12880/narrow_TRIB1-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/tributary-to-middle-branch-north-river-near-baddeck-ns-12880",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "5 km",
        "Town": "Baddeck, NS",
        "Type": "out-and-back"
    },
    "title": "Tributary to Middle Branch North River",
    "trail_id": "12880"
}