{
    "description": "This is an exploration of some cliffs on Lake Chezzetcook near Musquodoboit Harbour.  I had noticed some grey areas on the north end of the lake.  They looked like cliffs and since some of the premiere areas for climbing are nearby on Paces Lake, it made sense that there could be more similar features nearby.  I couldn't see any ATV trails going where I wanted to go so instead I used my kayak to cross the length of the lake.  I tried to find a public launch on the lake but wasn't able to find any.  Instead I set off on the rocky run that empties the lake into the Chezzetcook River.  The river can be shallow and rocky so best to just have shoes handy so you can get wet and pull your kayak or canoe through.  Better yet, find someone who will let you use their property to access the lake!The paddle was kind of boring at first.  Lots of houses and not many features to look at.  However about 3km north of the start, the lake goes through a narrowing where it is only about 8m wide. Aafterward you get to an area where the hills to the east are filled with scree slips and some outcrops.  Before getting to the cliffs you will spot on the east side of the lake a good size cliff which rises from the lake itself.  Continuing to the last part of the lake, you will finally see a great looking cliff on the east side only about 100ft from shore.  I found a place where I could get out of my boat and then immediately I was strolling through huge boulders just begging to be climbed.   These are just south of the cliffs you see from the lake.   After playing around in those, I climbed to the top of the cliffs on the right side (if looking up the hill).   On top of that cliff you will have a superb 360 view of the area.  Just below and to the north are the cliffs you could see from the lake.  Those ones would be suitable for climbing and one part has a nice 6 foot roof towards the end of the climb.",
    "directions": "Take highway 7 in Porters Lake heading east.   The Chezzetcook river bridge is just ahead at; N44 45 33.7 W63 13 22.1.  Set off from there.",
    "geohash": "dxgn",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/12897/reg_lAKE5-1--27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12897/long_lake2-1--27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12897/reg_lAKE3-1--27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12897/reg_lake1-1--27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12897/reg_lake4-1--27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12897/reg_lake6-1--27177_best1_.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/cliffs-of-lake-chezzetcook-near-halifax-ns-12897",
    "stats": {
        "Activities": "climb river-canoe hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 5,
        "Time": "2 hrs",
        "Total Distance": "11 km",
        "Town": "Halifax, NS",
        "Type": "out-and-back"
    },
    "title": "Cliffs of Lake Chezzetcook",
    "trail_id": "12897"
}