{
    "description": "This is a hike which leads you to two separate waterfalls on the Barachois river near Tarbotvale, Cape Breton Island.   I had never heard of anybody exploring for waterfalls on this major river.  I spotted some spots which looked interesting both on sat imagery and the topo maps.  I noticed a road which led to within 800m or so of the first spot I wanted to explore.I set off from the well maintained gravel road and into the mature hardwood forest.  UI crossed a small brook and lined up towards the river.  I crossed into a patch of evergreen trees which grow alongside the rim of the ravine.  this cannot be prevented as evergreen will dominate all the way to both falls. I ended up really high with a clear view of the river below, a fall in the distance framed by sheer rock walls,.  the fall was in two parts and maybe about 20ft or so.  I didn't have time to find a way down to it as I was pressed for time but I am sue it would be do-able from a distance downstream as the sheer rock walls prevent a descent near the base of the fall.My GPS was pointing to the topmost fall in about 200m.  I pushed through the evergreen and then decided to come down to the river just after the canyon like feature of the first fall.  I should have turned around and stood at the head of the first fall but I didn't.  I proceeded upstream by staying  on the side of the river.  Depending on water height this might not be an option as some of the walls can be quick straight at times of high water.  Regardless, I finally made it to the topmost fall which has a 30ft drop with a huge pool in front of it.  It is quite scenic and easy to reach",
    "directions": "Cabot Trail towards North River in st Anns Bay.  continue towards Ingonish and turn on West Tarbotvale Rd. A bridge appears to your right but continue on the left for 1.6km. Do not drive to the end of the road as it is someones property.  You could also set off from the bridge and walk upstream.  the topmost fall is at N46.36502° W60.59512°.",
    "geohash": "f8hz",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/12894/reg_22554853-984492261690618-5819303222249564787-n-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12894/reg_22554937-984492265023951-3239265040091501863-n-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12894/narrow_22519056-984492268357284-4550217579322891682-n-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12894/narrow_22549571-984492321690612-5389176604643238930-n-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/barachois-river-falls-near-baddeck-ns-12894",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 5,
        "Time": "2 hrs",
        "Total Distance": "3 km",
        "Town": "Baddeck, NS",
        "Type": "out-and-back"
    },
    "title": "Barachois River Falls",
    "trail_id": "12894"
}