{
    "description": "This challenging in-and-out hike in the Terence Bay Wilderness Area takes you to Crow's Nest, a dramatic cliff overlooking the Bay.",
    "directions": "Take the 333 out of Halifax (from St Margaret's Bay Road) towards Peggy's Cove. Take the turnoff for Terence Bay and then after you've come down the hill, turn left on River Road. Follow River Road past the first lake on the left and around the bend to the settlement near the second lake (Little Lake). There's parking at the lake or a little before the lake near the trailhead. Use the GPS to find the trail head (it's subtle). The foot trail will take you around Little Lake to join an ATV trail. Follow this ATV trail to Quarry Lake, ignoring the first turn to the right that would take you back around Little Lake) and the trails going off to the left (which would take you to the windmills and Brophy?s Front Lake).At Quarry Lake, take a footpath to the left (the path to the right leads to Grover Cove/Quarry Lake waterfall and bouldering area?it's worth a side trip).This footpath will cross a stream (Brophy?s Run) as it enters Quarry Lake. In the spring it can be a challenge to cross, but the rest of the year you don't need to get your feet wet. You then walk uphill on a large rock face, joining and continuing on the ATV trail that has come up from Quarry Lake. You?ll see a peak more or less ahead; you?re headed for this. The ATV trail splits at a spot where there?s a waist-high rock face on your left. Take the right branch, and as you follow, look for a spot on the left where there?s a rock on a boulder and another similar up the hill. This will lead you up onto some exposed rock faces that you cross (alternating rock and wading through short brush), heading towards the peak. You?ll come up on a boulder just under the ridge. Drop down from the boulder and find any convenient spot to scramble up to that peak.From here, you wind your way from rock face to rock face across the broad, high land between the unnamed round lake and Whale Cove Lake on your right and Long Lake and an unnamed L-shaped lake on your left. Sometimes there are rocks set up to help you see where to drop down into the trees or brush. Sometimes not.You can probably cross this area in many different ways, but the GPS trail is the easiest route I?ve found after several years of trying different options. Basically, it will feel like you?re heading somewhat downhill and slightly to the right, before coming up on another granite hill strewn with boulders (from a distance you see an ATV trail in the lichen on this granite slope). Here there is another ridge ahead?if you take it for the view you can re-join the GPS trail later?but otherwise, start heading down any convenient ridge slightly to the left. There?s a convenient animal track over the relatively dry bog next to the unnamed L-shaped lake. Follow this and continue along a brief rock exposure to find a large boulder on your left. Turn left here, jump across the stream, and walk across the leatherleaf bog to the next large boulder you see. At this point turn right?the GPS trail goes up on the rock ridge, but you can stick to the right of this ridge and look for an animal trail heading off a little to the right. Take whichever animal trail you find to head off a little towards the right?the best track is a little before the one shown on the GPS. You?ll then follow animal tracks through an area of very low, granite hillocks and low brush until you come around the bottom of a very small, unnamed pond. You?ll be watching another peak ahead of you?head very briefly through a few trees and then follow whatever animal tracks you find through the bush to come up on this peak.You now see Crow?s Nest in its glory across a valley (which either drains into or out of the southern tip of Whale Cove Lake). Maybe it?s possible to skirt this valley to the left and avoid the climb down and up, but I just climb down and up.My route goes to the left of the two small boulders you see on the granite hill you?re on, and avoids the exposed rock hill (in the valley) that you see more to your right. Drop down the first step into a lovely sphagnum moss grove. Head a little left and come up again on an exposed rock face. Repeat a couple of times, finding faint foot paths and animal tracks where possible. You might find some trail marking tape that's fallen off the trees it was once attached to... Once you cross the bog at the bottom of the valley (the wettest one of the whole route), you join the ATV trail that comes off the south tip of Whale Cove Lake. It?s an easy climb up to Crow?s Nest from there. Visit the Climb Nova Scotia website for information about the claiming routes on Crow?s Nest.",
    "geohash": "dxft",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/12892/reg_CRW-0934-58181.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/crows-nest-terence-bay-near-halifax-ns-12892",
    "stats": {
        "Activities": "hike snowshoe climb",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 5,
        "Time": "6 hrs",
        "Total Distance": "11 km",
        "Town": "Halifax, NS",
        "Type": "out-and-back"
    },
    "title": "Crow's Nest, Terence Bay",
    "trail_id": "12892"
}