{
    "description": "This is a hike to see a fall which I had first read in an ice climbing guidebook (Thanks R Fage!).  The brook is called  Tumbledown so I knew it would be a good one to go and see some falls.   Unfortunately, unless you have some rappel gear, you cannot just follow the brook to the seashore as it plunges 40ft over straight rock and there is no other way down except for rappelling.I followed the two mile brook located 2km east of the fall.  I was pleasantly surprised to find a fine fall of about 15ft in the middle of it.  There are numerous smaller falls throughout this brook.  Once on the seashore head west for 2km to the tumbledown brook fall.  On the way there, another surprise.  A taller fall was on the cliffs.  this one about 60ft high!Both of the falls on the seashore are from small brooks so it would be better to go after a large rainfall.  also you need to access the sea at low tide to make it there and back",
    "directions": "From Joggins drive west to Apple River.  Park at a dirt road at; 45.511957, -64.719551.   Beat your way to the Two  mile brook and follow it downstream to the seashore.  Main fall at; 45.519808, -64.745011",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/12903/reg_22792381-989298574543320-1930404722236029974-o-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12903/narrow_22730582-989298581209986-8711092679562830264-n-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12903/narrow_22815398-989298577876653-5593434033966757318-n-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/tumble-down-falls-near-parrsboro-ns-12903",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "8 km",
        "Town": "Parrsboro, NS",
        "Type": "out-and-back"
    },
    "title": "Tumble Down Falls",
    "trail_id": "12903"
}