{
    "description": "This is a description of the three sisters which is a true gem of Nova Scotia.  There are some official trails to get you above the area called the three sisters but in order to be truly amaze, you have to walk on the seafloor and see these sleeping giants!There is a trailpeak post for the official trails here; http://www.trailpeak.com/trail-Eatonville-Hiking-Trails-Cape-Chignecto-near-Parrsboro-NS-6791.My journey was quite different.  I wanted to access the base of the Three sisters.  From the parking lot, I bushwhacked may way to an area I thought would be good to access the sea floor.   That area has cliffs of more than 150ft and one area had trees going down a gully.  I know better than to try these things blindly.   Luckily I didn't go down in those and I saw after they ended up 50ft from the seafloor!I walked along the edge of the cliffs in a semi open forest and then found a ravine which led gradually to the beach!  Step 1 was complete.  There was one stack to the right and then I walked towards the left to access the three sisters.  I couldn't see them as they are a further 500m away and around a few headlands.To get around, two hours before low tide, I had to walk a lot on algae covered rocks.  One place even had a choke point.  The waves were crashing about 12ft below and spraying up an algae covered ledge I had to scramble to be able to get around a headland (chokepoint on picture provided).  Maybe at low tide, you can get around the whole thing but not at the time I was there.  all along the headlands are numerous sea caves which are fun to visit.After finally rounding off another headland, I was standing at the base of the sisters..What an amazing site.  there is one particular column which is super narrow and very high which will not be there forever.  In the same area are one long sea cave and a perfect circular arch.  A bit further is the last sea stack.  Rounding off the headland after the last sea stack, is one dual passage through rock and then a wall of rock stands in front of you.  In the wall is a small cleft you can squeeze through instead of going around the headland.  On the other side a small downs limb of about 8ft leads to a beautiful sand beach below.  There was a scree slope right there and I climbed it to get back to the trails above.",
    "directions": "From Amherst.  Drive to Joggins.  after follow signs for Apple River.  after apple River follow the signs for Eatonville and/or chignecto province park.",
    "geohash": "f81f6",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/12902/reg_22791713-989303514542826-3314393466322204363-o-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12902/reg_22792400-989303567876154-7973203365221646830-o-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12902/reg_22792423-989303584542819-7186044118668426248-o-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12902/reg_22861537-989303511209493-3708008623592807459-o-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12902/reg_threesisters-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/three-sisters-near-parrsboro-ns-12902",
    "stats": {
        "Activities": "hike sea-kayak",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 5,
        "Time": "2 hrs",
        "Total Distance": "2 km",
        "Town": "Parrsboro, NS",
        "Type": "out-and-back"
    },
    "title": "Three Sisters",
    "trail_id": "12902"
}