{
    "description": "The White River Riparian Trail, a single-track hiking trail along the north side of the White River upstream of Consort Creek, traverses mostly old-growth forests, often follows the trails of Roosevelt elk, provides many beautiful views of the White River and spectacular views of Warden and Victoria Peaks.The White River Riparian Trail starts adjacent to the old crossing of the White River on Stewart Main.  The shorter near-span of this double span bridge was removed a couple of years ago.  A road widening immediately prior to the bridge is often used by vehicle campers.From the start of the trail marked by a VI Spine Trail signpost, the trail drops off the road fill onto a flat river terrace.  At less than 100 metres in, you must either wade a small back channel or cross on a log.The first 1.8 km is located mainly on higher river terraces (photo 02), but the trail does drop down briefly onto the active floodplain in a couple of spots (photo 03, 04).  One low terrace barely above the regular flooding level supports a rather unusual forest community of Douglas-fir with some remnants of pioneering black cottonwoods (photo 05); a somewhat lower area in behind is regularly inundated as evident from fresh deposits of sand, drift materials and current markings.  The absence of decaying logs and organic surface soil is indicative of the early seral nature of this forest (i.e. this is the first forest to occupy this site).  At 1.8 km, the terraces and floodplain are pinched out where the White has cut into the valley side on the outside of a major river bend.  For the next 200 metres, the trail is across a very steep sidehill.  At the western end of this steep section, the hiker drops down to cross a small side creek, then along a short narrow ridge before regaining the flat river terraces.Near the mid-point of the trail (at 4.6 km), it intersects a logging road and briefly (i.e. for about 100 metres), the hiker must walk along this road (White River Main).  From the road edge down onto the White floodplain is a short, loose, slippery fillslope.  Almost immediately, you will cross a back channel on a log and then drop onto floodplain that supports a very dense shrub cover of salmonberry and red-osier dogwood (photo 06, 07 cleared).  280 metres along the trail is a large redcedar log (photo 08 to do) across a tributary that provides a crossing of this surprisingly deep creek.  The trail continues right along the river channel edge on a sandy levee, with exposed sand on the river bank and thick salmonberry under an open red alder stand on the floodplain behind (photo 09).  The virtually bare sandy levee provides a number of suitable summer (low water) camping spots; the best about 100 metres past the log crossing.  This section is due north of Warden Peak; steep slopes rise uninterrupted for 1200 metres in elevation (almost 4,000 feet!) to the north shoulder of this peak (photo 10), which obscures views of the summit at this point but seen elsewhere along the trail.Within another couple of hundred metres, the trail regains and stays very largely on higher river terraces that support an old-growth stand dominated by very tall amabilis fir (Pacific silver fir).  Indeed, it is on such old, high fluvial terraces that this species attains its greatest size.  You may well appreciate the amount of work involved in cutting through large dead and down trees (photo 11, 12) in establishing this section of trail.The trail continues along the higher river terraces to the 8-km mark, where you will encounter an old river channel of the White.  This was the main active channel of the White until 2-3 decades ago when it cut across an old river meander in a new straight channel and abandoned the pre-existing meander bend.  The first (of two) crossings of the old channel has standing water and is crossed via a large walk-log elevated a couple of metres (photo 13).  As can be seen in the photo, the adjacent floodplain vegetation is thick salmonberry (photo 14), but this lightens up as you enter an island of older coniferous forest prior to the second crossing of the meander scar, which is dry gravel most of the year.Past the old meander scar, the trail goes across another river terrace which merges with a large fluvial fan deposited by a major side creek.  This fan was logged and now supports a young second-growth stand (photo 15).  Soon the trail is again on river terraces with large old-growth, dropping down at one point onto a low terrace with widely spaced redcedar and thick salmonberry and a great view of the river and Warden Peak.  The last 100 or so metres of this trail before it rejoins the logging road (White River Main) is across a steep sideslope pinched between the river and the road.  You pop out onto the road just before the junction of White River and Kokummi Main roads.  The White River Main turns sharply to the south to a bridge over the White River and Kokummi Main continues straight ahead.If you wish to follow the Spine Trail route any further, go straight ahead along Kokummi Main and continue up this road to the head of the Kokummi Creek valley.For most of its length, the White River Riparian Trail is separated from the White River Main logging road by an extensive complex of wetlands, including marshes, shallow ponds and swamps (wooded or forested) ? good habitat for both bears and elk.  Other than at flood stage, the White is a beautiful, crystal-clear river that will impress you again and again (photo 16, 17).",
    "directions": "The White River Riparian Trail is part of the White River section of the VI Spine Trail.  If you wish to do a day-hike of this trail, it is accessible from Sayward Junction on Highway 19, 64 km north of Campbell River (i.e. from the bridge over Campbell River).?\tTurn left off Highway 19 at Sayward Junction and go south to cross over the White River.?\tJust across the bridge, turn right onto Hern Road and go past White River Court.?\tWhere Hern Rd. bends sharply to the left, go straight ahead for about 40 metres to a T-junction.?\tGo right at this junction for about 200 metres to another T-junction at White River Main.?\tTurn left (uphill) onto White River Main and follow it for 27 km to Stewart Main.  Ignore numerous side roads.  White River Main turns sharply right (and downhill at about 17 km [note signposts are at all even-kilometer points]) to cross over the White where Victoria Main goes straight ahead.  After crossing this bridge, bear sharply left to continue along White River Main.?\tAt about 27 km, go left down Stewart Main for about 200 metres to where the bridge has been removed.The start/eastern end of the White River Riparian Trail is marked by a VI Spine Trail signpost on the edge of a road widening used for parking/camping.To drive to the western end of the trail, continue along White River Main to just before its junction with Kokummi Main; the trail leaves the road just before an old quarry that you see on your right, which continues to the junction.N.B.  White River Main is a regularly used active logging road; you will encounter loaded logging trucks on weekdays and potentially during weekends.  Always assume active hauling and drive with extreme caution.  Pull over and stop, well off the traveled surface of the road (in a turn-out if possible), whenever you meet a loaded or empty logging truck.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/12912/long_05-Levee-trail-sharpening-44723.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12912/long_06-Thick-brush-on-Fp-past-midpoint-44723.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12912/long_09-Levee-trail-past-midpoint-44723.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12912/long_11-Windfall-patch-44723.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12912/long_12-Dave-cutting-windfall-44723.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12912/reg_02-High-terrace-edge-trail-44723.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12912/reg_03-Elk-pasture-Large--44723.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12912/reg_04-Trail-on-Fp-before-midpoint-44723.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12912/reg_07-Thick-Fp-brush-cleared-44723.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12912/reg_13-Walk-log-Large--44723.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12912/reg_14-IMG-0921-Large--44723.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12912/reg_15-Trail-on-Ft-before-midpoint-44723.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12912/reg_17-White-R-clear-water-Large--44723.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12912/reg_18-White-River-og-Gil-Parker-Large--44723.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12912/narrow_10-IMG-0825-Large--44723.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/white-river-riparian-trail-near-sayward-bc-12912",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 3,
        "Time": "6 hrs",
        "Total Distance": "10 km",
        "Town": "Sayward, BC",
        "Type": "out-and-back"
    },
    "title": "White River Riparian Trail",
    "trail_id": "12912"
}