{
    "description": "Grilse Creek Riparian Trail is a single-track hiking trail along Grilse Creek, often following elk trails, that accesses a stand of impressive old-growth fir and red-cedar on a very productive alluvial site, and provides many scenic views the Grilse Creek tributary of the Salmon River.Grilse Creek Riparian trail is a new (so far, a little used) single-track trail.  For much of its length, it is located on flat terraces flanking Grilse Creek.  There are 3 steep sections.  The longest is a 100-metre section where the trail descends rapidly from the trailhead for about 100 metres down to the flat terraces flanking Grilse Creek.  There is a similar steep slope at the far end where the trail comes back up to the road (still Menzies Main).  And, there is a very short but very steep pitch up where the trail leaves the river terraces at the far end of ?Grilse Grove? as described below.  On the river flats, much of the trail follows heavily-used game trails of Roosevelt elk.The trail is marked with square fluorescent orange trail markers.  Where the trail follows elk trails, it is easy to follow.  Elsewhere, largely because it is a new trail, it can be somewhat obscure; but as the ?riparian? name implies, it follows fairly closely along Grilse Creek (if you can?t always see the creek, you can hear it), so if you find yourself off the trail, continue upstream and you should soon be back on the trail.Grilse Creek is a major tributary of the Salmon River.  It is named after grilse, which are precocious male coho salmon that return to their natal stream to spawn after 2-3 years rather than the normal 4 years.From 35.5 km on Menzies Main, the trail first drops quite quickly downslope to follow close along the banks of Grilse Creek.  This area is heavily used by Roosevelt elk and for the most part, once down on the flats, the trail follows along pre-existing ?elk highways? in many places right along the riverbank.  The second-growth forest hereabouts has been thinned (standing trees were killed by girdling) to a variable density so as to create openings that eventually will provide forage for the elk.  After crossing a small back channel on a split cedar boardwalk (to come), you enter some open forest as far as the South Fork Main logging road.Cross directly over this main road (a bridge over Grilse Creek is just to your left/to the south.  The riparian trail (marked by a steel Spine Trail sign-post) continues, straight ahead at first, then following around a wide bend of Grilse Creek on a high terrace (a couple of metres above the river channel) before dropping down to follow a back channel on the Grilse floodplain vegetated with red alder and salmonberry.  The salmonberry on such a rich, fertile site is usually at least head-high; but here the regular browsing by elk keep it down to less than a metre high. Since the salmonberry grows in so quickly and is pretty well controlled by the elk, this next section of trail is not cleared ? just follow the trail markers along the margin of the back channel to a point where it splits and is crossed by a small arch bridge.  This back channel has been enhanced for salmon (coho rearing) by the placement of a dozen or more triangular log structures that modify flows so as to create pools and riffles.  It is this so- called off-channel habitat (i.e. off the mainstem of Grilse Creek) that provides escape and shelter from the flood flows in the main channel without which small salmon fry and smolts could well be swept right out of the system.  After crossing over the arch bridge, the trail soon enters an old-growth stand on a rich alluvial site.  Tree species include Douglas-fir, western redcedar and Sitka spruce with diameters of 1.5 to 2. 5 metres (i.e. the biggest are almost 8 metres in circumference.  The slightly higher terrace is almost free of shrubs with a diversity of ferns, herbs and mosses.  Lower levels and old back channels support a red alder-salmonberry community as seen prior to the bridge.  Soon after passing a large Sitka spruce adjacent to the main Grilse Creek channel, the trail crosses a wet area and quickly ascends a steep slope produced by the undercutting of Grilse Creek when formerly flowing at this location.   This steep pitch corresponds to a change to a second-growth forest with a blueberry-moss type of understory .  The trail passes through this younger forest mostly at some distance above Grilse Creek for about 2.5 km.  It then passes through an old-growth stand of western hemlock, redcedar and balsam (amabilis fir) for another 0.5 km.  The hiker then abruptly enters an open area which has been repeated disturbed by a series of small landslides originating from a road a short distance upslope (very steep); the most recent slides were in the winter of 2016-17 .  Three hundred metres past this, the trail re-enters forest and soon climbs up to the road above ? Menzies Main.  The Grilse Riparian Trail is part of the Vancouver Island Spine Trail.  If you wish to follow the Spine Trail route any further, the hiker then follows Menzies Main for 1.8 km to the site of a former bridge across Grilse Creek (removed in 2016).  A walk-log crossing has been built to replace this bridge.",
    "directions": "The Grilse Creek Riparian Trail is part of the Salmon River section of the VI Spine Trail.  If you wish to do a day-hike of this trail, it is accessible by a combination of Highway 19 north from Campbell River and the Menzies Main logging road west from the highway:?\tTake Highway 19 north from Campbell River for 12.5 km; at this point you will see Western Forest Products offices on your right and the WFP shop and marshaling yard on your right.  ?\tTurn left onto Menzies Main logging road and almost immediately bear to your right to go around the WFP yard/industrial site.?\tContinue along Menzies Main for 35.5 km (be prepared to meet loaded logging trucks).  There are km signs posted every 2 km along Menzies; if you see the 36-km post, you have gone past the trail.?\tThe trail is on your left (downhill side of the road; watch for a green and white VI Spine sign and a fluorescent orange marker).",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/12911/long_DS-Photo-4-Grilse-Bridge-44723.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12911/reg_02-Grilse-from-South-Fork-Mn-bridge-44723.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12911/reg_DS-Photo-8-Fir-Cedar-44723.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12911/reg_DS-Photo-9-OG-Fir-44723.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/grilse-creek-riparian-trail-near-campbell-river-bc-12911",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 3,
        "Time": "5 hrs",
        "Total Distance": "5 km",
        "Town": "Campbell River, BC",
        "Type": "out-and-back"
    },
    "title": "Grilse Creek Riparian Trail",
    "trail_id": "12911"
}