{
    "description": "Runners Trail is a combination of trails on old grades and new single-track trail that follows a historic trading route of the Tseshaht and Ditidaht First Nations.  It also passes through the remains of Franklin Camp,  an historic logging camp that was once one of the largest logging operations in the world.This trail description starts assuming you have walked in at the beach access road at Frances Lake, which the Runners Trail crosses at about 250 metres.  Go right along a broad short trail to the beach (photo 03a).  You will have to wade a creek to actually get onto the beach proper!  Going left on Runners takes you alongside a creek towards Darlington Lake (watch for the sign ?1Km Trail to Darlington Lake? photo 05).  Soon after you lose sight/sound of the creek, watch on your left for remnants of an old logging camp cookhouse.  Scattered about on the forest floor you can see pots and pans, coffee pots, cups, bowls and plates ? mostly with the blue with white spotted enamel finish so prevalent in the early part of the 20th century.  The nearby creek was undoubtedly the water source for the cookhouse.  As you continue towards Darlington Lake, you might notice remnants of an old corduroy road underfoot, or maybe they are remains of rotted out railway ties?  The spacing suggests a corduroy road, the type often used in very early logging, possibly by teams of oxen. ?Teams of oxen, often as many as 14 yolked together, would haul 4 or 5 logs at a time over greased skid roads.  To transport the logs, the oxen needed to be coaxed and encouraged by the ?bullpuncher?. Accompanying the bullpuncher in this effort were the ?pigman?, who was responsible for chaining the logs together and the ?skidgreaser?, who had the smelly task of greasing the skid roads!? (from Museum at Campbell River webpage). \"The oxen you know, was a peculiar animal - he had no speed in him. He would just plod along. He had his plodding gait and that was all. All the cursing and swearing and goading with the goad stick made no difference. He would let a bellow out of him as he rolled one shoulder to the other.\" ? from Charles H. Grant interviewThe trail soon comes close to the shoreline of Darlington Lake where the hiker will see some impressive old red cedar stumps (photo 04) with springboard notches (springboards allowed the faller to stand well up above the ground to cut through a tree above the butt swell, thereby cutting down on the falling work effort).  In the early part of the 20th century, large red cedar logged hereabouts would likely be used for the milling of shingles and shakes, commonly used not only roofing but also for house siding in those times.From the shoreline, the trail climbs some distance upslope before returning down to the valley floor at the westerly end of the lake.   The next 1.8 km section of trail between Darlington Lake and the former Franklin Logging Camp (photo 06) passes through rich, productive sites/soils with lush ferns and a diversity of herbs (photo 07), although some of the wetter valley floor supports poorly drained skunk cabbage sites, often flooded during the winter.  Here too, keep an eye out for remains of the old corduroy road.All that remains of Franklin Logging Camp today are the concrete foundations of the larger buildings (workshops mainly) and a series of four old residential streets.  Most of the smaller buildings and houses were placed on log skids/log foundations, either long gone or rotted away.  The bulk of the train crews and logging crews lived in the bunkhouses, and this labor force was mobile and ever-changing.  Supervisory and management personnel more likely lived in the ?married quarters? of the residential streets that you can still follow, where you can see the remains of gardens ? the flowers, shrubs and trees that look very foreign in comparison with the surrounding forest.  In its heyday (photo 08), Franklin was one of the largest logging camps on Vancouver Island (for a time in the 1950?s, it was the largest logging camp in Canada!).  It was established in 1934 by the Bloedel, Stewart and Welch Company (forerunner of MacMillan Bloedel Co. that most called ?MacBlo?) that logged the surrounding forest by a network of railways.  Railway logging continued until 1957, when modern logging trucks took over the hauling of logs from the woods to the log dumps at tidewater.  In the transition period, logging trucks transported logs from the steeper terrain and off-loaded them to stake-cars on the railway mainlines in the valleys, a practice still used in the Nimpkish valley of northern Vancouver Island.  Franklin Camp was finally closed in 1957 when trucks took over from the railway as a method of transporting logs.  Immediately on leaving Franklin, Runners crosses over Coleman Creek on an old logging railway bridge.  From this bridge westerly for the next 3 km, the trail is situated 75-150 metres upslope of the Bamfield Main logging road; and passes through a mix of young forest, both conifer-and alder-dominated, plantations and regeneration (photo 09, 10).  The trail then veers away northwards to a bridge crossing of a tributary (north fork) of Coleman Creek.  The approach to this crossing on both sides of the tributary valley is on old rail grades, except for the final steep descent to the bridge which tends to be obscured by a thick, lush growth of sword ferns.To the west of the north fork of Coleman Creek, the trail is forced to jog steeply upslope and then even more steeply downslope back to the old railroad grade, in order to get around the scar of a substantial landslide (slump) that carried away a section of the old grade.Once back down on the old grade, the hiker will follow it through 70-80-year-old second-growth forests for 2 km or so before breaking out into the more open area of a younger plantation (photo 11) that provides some good views across the valley to a mosaic of old-growth forest patches and regenerating cut blocks with Douglas-fir plantations similar to that which the trail now traverses.  As before, this 2-km section of trail is only 100 or so metres upslope of the Bamfield Main road; however, it is for the most part not possible to walk down to the mainline because of high, vertical and very steep cut slopes flanking Bamfield Main.  Also, in this 2-km section, Runners Trail crosses one side road (BM-100) and another smaller tributary of Coleman Creek that flows within a rocky gully that supports some large old-growth Douglas-fir which the early loggers were unable to safely cut.Runners Trail continues along a more recently used road (BM-83) through this plantation that has a good cover of grasses and is flanked by small red alder (photo 11).  The grass cover is the result of erosion-control seeding following road deactivation on completion of logging, a common practice in the last couple of decades.  When you come to a T-junction with BM-80, go to the right up and over a hill and on down to where the trail hooks to the left and follows along a low, wet area.  Here the trail narrows to single-track and is prone to brushing in with salmonberry, thimbleberry and stink currants until it re-enters second-growth forest at the western end of the planted and regenerating cut block.Back into second-growth, Runners follows another old grade for almost a kilometer to where the trail drops down a steep slope to cross over Heather Creek.   Immediately across the bridge is also a very steep but short slope to a single-track trail through similar second-growth forest.  From the slope break out of the incised creek valley ahead to Heather Main and Bamfield Main, WFP will likely be logging a cut block in 2017.  A temporary trail closure and re-routing will be necessary in this section while logging is active.  A triangular-shaped cut block situated between Bamfield Main and Headquarters Road, on both sides of Parsons Creek is also planned for logging by a WFP contractor in 2017.  During this logging activity, hikers will have to walk along Heather Main, turn right onto Bamfield Main across the logging road bridge over Parsons Creek to the junction with Headquarters Road, then turn sharply left to hike along HQ Road for just 1 km.  Because of this temporary detour, you will miss an impressive trail bridge over Parsons Creek (photos 12, 13, 14); and the detour will take you around a smooth curve so as to be heading northwards towards Alberni Inlet.  Because of this detour, you will miss seeing some old relics being reclaimed by the forest (photos 15, 16).Once this logging is completed, VISTA will repair the trail to and from the Parsons Bridge.  Also, on completion of logging both Bamfield Main and Heather Main will provide additional points to access the trail.Headquarters Road follows directly along the old Canadian Northern Pacific Railway right-of-way (CNPR) and as a result is characterized by its narrow width, long smooth curves and straight tangents typical of railways.  The grade is also gentle to flat and this is achieved by a series of through-cuts (i.e. with cut slope on both sides of the grade) through numerous bedrock knolls and outcrops.  Although the CNPR grade was finished all the way to Port Alberni, track was never laid past Kissinger Lake at the west end of Cowichan Lake.  One kilometer along HQ Road, Runners Trail single-track trail resumes on the right (i.e. on the east side of the road).  This 325-metre section of trail again intersects HQ Road where the trail crosses over to the west side of the road for an additional 265 metres to where it re-crosses HQ Road to the east side.  Runners Trail parallels HQ Road on the east side for just 2.0 km to its starting point (although it does just touch HQ Road and one point, but stays on the east side at this point).  This 2-km section is a single-track trail that climbs up and down over hummocky and hilly terrain, through a mature coniferous forest that includes scattered, much larger diameter, Douglas-fir veterans, some with fire scars.Optionally, the hiker may choose to walk the full length of Headquarters Road from Bamfield Main to its end (3.4 km) where it merges with the original CNPR grade (now vegetated with mosses and ferns), since this is a pleasant walk along a narrow road, fully shaded by the forest which crowds in throughout its length.",
    "directions": "Runners Trail is accessible by a combination of public roads and logging roads from Port Alberni (see the Port Alberni satellite view - https://www.maps-streetview.com/Canada/Port-Alberni/satelliteview.php)The southern edge of the Port Alberni residential area is mostly defined by Ship Creek Road; it can be accessed from town via 3rd Avenue or from Redford Street via 10th Avenue and Anderson Ave.  Ship Creek Road becomes the Franklin River Road adjacent to the parking lot for the Alberni Inlet Trail.  Take the Franklin River Road past the Cox Lake rural residential area for 4.6 km to a major intersection adjacent to Western Forest Products Mid-Island Operation offices, workshop complex and marshalling yard.  The public road ends at this intersection.  Bear to the right and continue to follow the Franklin River Road which will take you past an old airstrip and a small sawmill/shingle mill.  Keep left as you pass the turn-off to China Creek Marina (6.3 km from the WFP complex), straight ahead as you pass Museum Main (as well as numerous smaller branch logging roads), then bear left as you pass the turn-off to the mouth of Franklin River (Bell Rd. not signed though, 11.3 km past the WFP complex).  By now you will be seeing kilometer signposts along Bamfield Main.  Stay on this obvious main route (always follow the powerlines!), passing many more logging side roads.  After a long downhill grade, the road flattens off for several hundred metres to the intersection with Headquarters Road (past the 25-km signpost).To go to the western end of Runners Trail (northern with respect to the Spine Trail), bear right and follow Headquarters Road 3.4 km to its end, where a private driveway is situated on your left.  Park on the roadside without obstructing the private driveway. GPS Coordinates:  49° 02' 13.4\" N 124° 49' 58.2\" W(Runners Trail joins proposed Stage 3 of Alberni Inlet Trail)To go to the eastern end of Runners Trail (southern with respect to the Spine Trail), bear left at Headquarters Road to drop downhill and cross over Parsons Creek bridge.  Continue along Bamfield Main for another 10.5 kilometers to the major road junction of Bamfield Main and Carmanah Main.  You will pass by Heather Main and BM-80.  Turn left onto Carmanah Main (0.0 km; it is largely blacktopped but the surface is often broken up, rough and rolling) and continue past the old Franklin Logging Camp (large open area, one street light remains at 2.2 km), then past Darlington Lake (on your left) for a short distance to the west end of Francis Lake (2.8 km from junction; if you see a second lake on your left, you have gone too far!).  Just before Francis Lake, watch for a spur road that drops quickly to the valley floor (and a creek) on your left (photo 01).  If you have a 4-wheel drive vehicle, you can drive down this old spur road across the creek (photo 02) and park adjacent to where the trail crosses the road; some folks drive further, down a creek bed and right onto the beach at the end of Francis Lake.  Without a 4x4, park well off the travelled portion of the road in a turn-out.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/12913/long_DS-Map-S-end-access-44723.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12913/long_DS-Photo-11-Runners-cleared-BM80-44723.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12913/long_DS-Photo-16-Old-Ford-on-Runners-44723.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12913/long_DS-Photo-2-Francis-Lake-Access-and-Ford-44723.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12913/reg_01-Francis-Lk-access-parking-Large--44723.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12913/reg_08-Franklin-Camp-1959-44723.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12913/reg_DS-Photo-1-Francis-Lake-Parking-44723.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12913/reg_DS-Photo-10-Runners-44723.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12913/reg_DS-Photo-12-Parsons-Bridge-44723.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12913/reg_DS-Photo-3-Beach-Frances-Lake-44723.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12913/reg_DS-Photo-5-Darlington-Lk-sign-44723.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12913/reg_DS-Photo-9-Runners-near-BM100-44723.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12913/narrow_DS-Map-N-end-Access-44723.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12913/narrow_DS-Photo-15-Old-car-nr-BM-main-44723.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12913/narrow_DS-Photo-4-Cedar-stump-and-Bob-Williams-44723.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12913/narrow_DS-Photo-6-Franklin-to-Darlington-44723.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12913/narrow_DS-Photo-7-Franklin-to-Darlington-44723.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/runners-trail-near-port-alberni-bc-12913",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 3,
        "Time": "7 hrs",
        "Total Distance": "21 km",
        "Town": "Port Alberni, BC",
        "Type": "out-and-back"
    },
    "title": "Runners Trail",
    "trail_id": "12913"
}