{
    "description": "This is the result of an exploration hike in an area near Wards Fall.  Anyone who's been to Ward's will know that there are some really unique slot canyons above the fall.  With this information, I looked t some geological maps of the area to try to find similar geology which would have a brook carving through it.I found one called Glasgow Book,  which is only 1.5km as the crow flies, from Wards Fall.  I parked at the edge of a huge blueberry field and made my way down the ravine.  At the  bottom I found a carved out area with a two step falls.  There are about 10 ft each and has a nice rock walls on either side.  I decided to push my way further upstream and although the ravine walls pressed close to the stream, there wasn't any slot canyon but at least there was one last 10ft fall at the top of the ravine.  From there I was only 750 m from the blueberry field and my car.Don't drive all the way here just for this hike but it's a nice addition if you are going to Wards Fall or George Fraser Brook Fall.",
    "directions": "Highway 209 towards Cape DèOr from Parrsboro.  Turn right on Ramshead River Rd and then turn right on York Rd.  Follow it to a dirt road on your left at;  45°26'50.4\"N 64°26'11.2\"W.  The main falls are at; 45°26'51.7\"N 64°26'52.8\"W with more upstream,",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/12916/reg_wbdiligent1-1--27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12916/reg_wbdiligent3-1--27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12916/reg_wbdiligent4-1--27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12916/narrow_wbdiligent2-1--27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/glasgow-brook-falls-near-parrsboro-ns-12916",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "2 km",
        "Town": "Parrsboro, NS",
        "Type": "out-and-back"
    },
    "title": "Glasgow Brook Falls",
    "trail_id": "12916"
}