{
    "description": "This trail climbs up to the fire lookout on Longworth Mountain, overlooking the Fraser River Valley and giving gorgeous views. It starts in a beautiful cedar, douglas fir and hemlock forest on old skid row. After 2.3km it changes into a single track.  Elevation gain is about 3535 ft.",
    "directions": "To reach this trail, you will need to drive 17km from the Yellowhead Bridge in Prince George on Hwy16 East, and turn left on Giscome Rd. It will be 64.4 kilometers to the single lane wooden bridge over the Fraser River. (On this stretch, the you will go through the small community of Willow River at which point the name of the road heading east will be called Upper Fraser Rd. After Willow River there are several other small communities such as Aleza Lake, Newlands etc.) After crossing the bridge over Fraser River, take the road to right which is Longworth Rd. You will follow it 32.8km to community of Longworth, and turn left at the Longworth Community Hall at the 4-way junction. In under 1km, the road goes over railway tracks and continues another 800 m to the trailhead which is in a little gravel pit.  The trail is located on the northwest edge of the gravel pit.",
    "geohash": null,
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/12915/reg_IMG-4282-45311.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12915/reg_IMG-4294-45311.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12915/reg_IMG-4306-45311.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12915/reg_IMG-4324-45311.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/longworth-lookout-near-prince-george-bc-12915",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 4,
        "Time": "7 hrs",
        "Total Distance": "13 km",
        "Town": "Prince George, BC",
        "Type": "out-and-back"
    },
    "title": "Longworth Lookout",
    "trail_id": "12915"
}