{
    "description": "This West Knob hike, on Black Mountain, begins close to the Trans Canada Upper Levels highway in West Vancouver and goes north up past Whyte Lake, and ends up at a lookout over Howe Sound just below the popular Eagle Bluffs.  The hike is approximately 12 KM return with about 668 meters of elevation gain, and will take about 6 hours at a leisurely pace.The first section from the trail-head is the steepest and most difficult to navigate with few trail markers, but a GPS of route has been included.  The only way-points of consequence are an old wooden helicopter pad about one third of the way to Whyte Lake (1.4 KM from start), and an over-sized sign indicating Exclusion of Liability by the landowners, British Properties (2.3 km from start).  Once at Whyte Lake, with a conspicuous outhouse on a nearby hill, follow the signs to Baden Powell trail.  The trail offers occasional views of Howe Sound. The next waypoint to look for is a ?forest fire water supply? tank (about 0.9KM from Whyte Lake) on the left hand side of the trail-this is about one third of the way from Whyte Lake and the West Knob.  It is 3.2KM from Whyte Lake to West Knob.  Continue on the Baden Powell trail to the West Knob.  For an easier return back to the trailhead rather than doubling back on earlier route, at Whyte Lake follow the signs for the Trans Canada Trail and follow south to the trailhead on a well marked and signed trail.",
    "directions": "Follow Trans Canada Highway 1 towards Horseshoe Bay and take exit 4 and bear left after exiting, toward the intersection.  Go straight along Westport Road and after crossing under Trans Canada, and after going about 1.9 KM from the first intersection, the parking lot for the trail-head is on your right hand side, bordering the Trans Canada Highway.",
    "geohash": "c2b2g",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/12926/reg_IMG-0002-26421.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12926/reg_IMG-0004-26421.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12926/reg_IMG-0007-26421.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12926/reg_IMG-0008-26421.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12926/reg_IMG-0012-26421.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12926/reg_IMG-0013-26421.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12926/reg_IMG-0016-26421.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12926/narrow_IMG-0001-1-26421.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/west-knob-black-mountain-near-vancouver-bc-12926",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 4,
        "Time": "6 hrs",
        "Total Distance": "12 km",
        "Town": "Vancouver, BC",
        "Type": "out-and-back"
    },
    "title": "West Knob, Black Mountain",
    "trail_id": "12926"
}