{
    "description": "Cole Hill is between Durrance Lake and Gowland Todd Regional Park, with the Rifle Range to the immediate South. It is a nice hike, with several options for how to get to the top. You can start at Durrance lake and head up into the woods 3/4 of the way along the Northern lake path. Once into the woods of Partridge Hill, you can go immedately right and then loop around the southern edge of Cole HIll and up, or you can continue north in Partridge Hill, until you are North of Cole Hill, and then turn right and head up. The third option is to park at the end of Durrance Road, and head North towards Todd Inlet, before turning left and heading up.There are a lot of different paths up, some steeper, some more winding, some wide, some narrow, some muddier, some very wet when there is a lot of run-off. Like other hikes in this area, the arbutus trees are beautiful.",
    "directions": "From West Saanich Road, turn onto Wallace Drive near the Red Barn. If you want to start from the lake, immediately turn left onto Willis Point Road and continue until you see the sign for Durance Lake Parking. If you want to start from Durance Road, continue on Wallace Drive for a minute before turning left onto Durance Road. Continue up to the very top of the road, where there are pull-outs on both sides. Take care as this is a single lane, steep and curving road.",
    "geohash": "c28hn",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/12935/reg_IMG-2737-2-47757.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12935/reg_IMG-4813-2-47757.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12935/narrow_IMG-2706-2-47757.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12935/narrow_IMG-4825-2-47757.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/cole-hill-near-saanich-bc-12935",
    "stats": {
        "Activities": "mtn-bike hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "4 km",
        "Town": "Saanich, BC",
        "Type": "out-and-back"
    },
    "title": "Cole Hill",
    "trail_id": "12935"
}