{
    "description": "This Trail was built in 1993 as part of the Clayoquot sound protests. It's beautiful but not maintained and therefore much of the trail is entirely grown over. The logging road to the trailhead is also not maintained and contains many washouts so the first portion6-7 km of the hike will follow old logging roads to reach the trail head. This area can be walked or biked. At the trailhead, you'll find a broken down shelter with a map of the trail. the trail proceeds to the left in front of the hut and follows an often overgrown trail that is relatively well marked with flagging tape for the first 6-7km until you hit solstice lake and murrelet lake. After this point, the trail essentially disappears and, if you choose to proceed past this point you know know that the trail has been entirely reclaimed by the forest and you will be bushwacking through salal and devils club or walking through the rivers from here on. The first portion is worth doing, the rest was a wet, isolated, and potentially dangerous slog. It took me 3 days to go end to end with long days of walking and a very light pack. I wouldn't recommend any more than the first portion of the trail to solstice lakes.",
    "directions": "When coming from Port Alberni, reset your odometer at the T-intersection when you turn towards Tofino. Drive 44.7km and watch for an unmarked logging road on your right just before you cross a bridge. (there should be a stop sight at the exit of the logging road onto the highway). Turn off here. You drive off the road and within 50-100 meters, park your car in a small clearing where several roads branch off. Yours will be the road that is at the back left corner of this opening from where you drive in. Follow this logging road on foot or on mountain bike (note, you won't be able to get more than 20-30 min on bike before it's too overgrown). try to go straight on this road and don't take any exits to the left (down to the river) or right (up the hill) of this logging road. You'll know you're on the right track if you cross a large old 2-lane wooden bridge within 1 hour of your car that once carried logging trucks. you shouldn't need to cross the river unless you are on that bridge. Continue following this logging road as it becomes progressively more overgrown until you reach the cabin that marks the beginning of the actual trail.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/12933/reg_DSCN0321-60988.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12933/reg_DSCN0338-60988.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12933/reg_DSCN0354-60988.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/12933/reg_IMG-3726-60988.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/witness-trail-near-port-alberni-bc-12933",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 2,
        "Time": "28 hrs",
        "Total Distance": "35 km",
        "Town": "Port Alberni, BC",
        "Type": "out-and-back"
    },
    "title": "Witness Trail",
    "trail_id": "12933"
}