{
    "description": "I am always searching for a new adventure of a new place to explore.  Off Blomindon, I noticed a place called big Eddy.   The topographical map showed some good contours.  I looked at the area on satellite imagery and confirmed some very high cliffs.  Zooming in closer I could see some stacks that had been left after the erosion of the cliffs.  These were just due west of Big Eddy.   I found some logged area that would bring me close as well as some faint ATV trails that could be discerned into the woods.It was on a cold but sunny January that I set off for this destination.  A rare event for me, I even had two fellow explorers joining me for the day!   We found the logging road and parked a little ways in.  We continued on foot on a well maintained logging road going uphill.  It soon branched and we took the small atv size trail on the left.   After going more uphill and in always in a logged area we finally reached the edge of the untouched forest.  The trail continued and so we followed it to a next Y intersection.  We took the left hand trail as it was pointing mew towards some of the possible stacks I saw.   At the end of the day, we realized that having continued straight instead at that intersection would have led us immediately to the only place where you can easily reach the sea floor.The trail we took went uphill a little and then after a few hundred meters was clearly overgrown.  We then veered off from it and towards the coast.  The mistake here was trying to go through a very thick evergreen stand.  No need to do this at all except if you like having a needle shower! We finally arrived at the top of the cliffs and for the next 1.5km or so we followed them due east.  We noticed some very cool features along the way.  Some crevasses and the stacks could be seen as we walked along the edge of the cliffs.   There are view points to the beach throughout the journey.Across from us was some sites I have previously described on trailpeak...such classics as Partridge Island, Clarks Head, Wassons Bluff, Cape Sharpe (Maiden cave).   We finally reached an area I had marked as easy way down...and it was!   This area also had the end of the ATV trail we should have followed in the first place.  The descent is through a wide u shaped ravine filled with tall hardwoods.  Once you clear this area you need to go down a steep section which this time around had a rope...a few minutes later you stand on the sea floor. We walked towards the largest of the stacks we had spotted from the top.  Then it took a bit of effort to climb to them as the scree slope is very steep here but there are sections which have stands of alders to help you go up.  Once I reached the top, I was amazed.  In this particular area there are at least 3 main stack one of which is huge.  Getting behind thew stacks is beautiful as you are sheltered from each sides with the huge cliffs in thew background.  I did not have enough time to visit the other stacks I noticed or the big Eddy so I will have to return! BTW a low tide is a must for this hike so look at a tide chart before setting off.",
    "directions": "Drive to Cape Split Provincial Park.  In Scots Bay turn on Rodgers Road and follow it until you need to park.  Follow the gps track and you will get to the stacks!  Main one is at; 45.310098, -64.360743.  UPDATE December 2018.  I was just made aware that the end of Rodgers Road is private property so either knock on a door to get permission or get to the stacks via Blomindon Provincial Park.  Just follow the top of the bluffs all the way to the area where you can safely come down to the shore",
    "geohash": "f841",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/12943/reg_DSC-7792-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12943/reg_DSC-7803-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12943/narrow_DSC-7764-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12943/narrow_DSC-7784-27177_best1_.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/gotham-castle-blomindon-near-wolfville-ns-12943",
    "stats": {
        "Activities": "climb snowshoe sea-kayak hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 5,
        "Time": "4 hrs",
        "Total Distance": "11 km",
        "Town": "Wolfville, NS",
        "Type": "out-and-back"
    },
    "title": "Gotham Castle (Blomindon)",
    "trail_id": "12943"
}