{
    "description": "Length: 25 Km (15 Miles)Time: 1-2 Days / 0-1 Night in TentDifficulty: ModerateTrail Type: Semi-Wilderness Mountain TrailThe Humber Valley Trail follows along the hilltops above the north side of the lower Humber River Valley, from the western trailhead near Ballam Bridge to Wild Cove road, Humber Village and the eastern trailhead near Humber Valley Resort.The trail begins with a 2.5km (1.5mile), 300m (985ft) ascent to the top of the ?Old Man in the Mountain,? offering a breathtaking view overlooking Shellbird Island in the fast flow of the Humber River. The city of Corner Brook and the Humber Arm are laid out below and to the northwest. Following the ridge, the trail offers panoramic views of Western Newfoundland, from the far end of Deer Lake to the east, Blow-Me-Down Mountains to the west, North Arm Hills to the north, and Marble Mountain ski hill to the south. On the eastern end the trail is routed atop a gorge carved into the landscape before intersecting with a Humber Valley Resort service road.Vistas from the Humber Valley Trail are particularly pleasing in autumn when the brilliant colors of changing leaves intermingle with the coniferous greens. In summer hikers will discover the beautiful wild orchids, such as the pink lady slipper.All iInfo taken from IATNL site.The western trailhead of Humber Valley Trail is located near Ballam Bridge at the entrance to Corner Brook?s Riverside Drive and the Bay of Island?s north shore highway, Admiral Palliser?s Trail, Route 440.The eastern trailhead is located on Goose Arm Road, 3km (1.8miles) east of Humber Valley Resort. An additional access point is on Wild Cove road, 6km (3.6miles) east of Ballam Bridge. It is also hoped that an access trail will be developed at Humber Village, 5km (3miles) east of Wild Cove road and 11km (6.6miles) west of Humber Valley Resort.",
    "directions": "See description and / or GPS",
    "photos": [],
    "source_url": "https://trailpeak.com/trails/humber-valley-trail-near-steady-brook-nf-12942",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "6 hrs",
        "Total Distance": "25 km",
        "Town": "Steady Brook, NF",
        "Type": "out-and-back"
    },
    "title": "Humber Valley Trail",
    "trail_id": "12942"
}