{
    "description": "1500m Elevation gainStarting from the parking lot, you follow a well walked path west until you reach the second drainage from the mountain (wood bridge is present). Turn South before the bridge and follow a very faint trail up. handrailing the creek, which is on your right-hand side. You can't see it, but you know it's there. Once above where the water flows, descend into the creek where it seems reasonable(steep and loose) and continue following the drainage up the mountain. You will most likely see old avalanche debris as you go.You will reach a Y in the drainage. Following either path is ok, the left side has less elevation gain. Both require moving through forested area to get to a clearing in the bowl below Mt. Elliot and Sentinel Mountain.*Great camping spot* if you are planning to take it chill and do it in 2 days.!Now it get's more physically demanding!!This is the second part and it took almost twice as long as the first!From the basin, walk up the rocky bowl to the cliff band. Cut a zig-zag through to climbers right on the flat-er parts and then back towards climbers left when you are above the main cliff band. *This rock is loose and semi scree, so be watchful*You can either follow the scree up the rest of the way and finish up climbing the larger blocks to the summit or but across to the larger blocky rocks towards the summer if you prefer. There may be a small waterfall there, watch for slippery stuff.There's a small cairn at the summit, open spot for a 1 person tent to camp uncomfortably and a beautiful view.Enjoy parts of the scree run down to the basin and the hike out. You've earned it!",
    "directions": "South of Rockies Heli Skiing ( Clearwater County, AB T0M 2H0 ), go south over the bridge crossing the Cline River. A few hundred meters further you will find a pull off to the right to a 'parking lot'. That's your starting point.Make sure all your food is in a closed cooler because small animals will get into your car and eat your stuff...",
    "geohash": "c3m0",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/12941/reg_trail2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/12941/narrow_trail1.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mt-elliot-nordegg-alberta-near-rocky-mt-house-ab-12941",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer spring",
        "Stars": 5,
        "Time": "14 hrs",
        "Total Distance": "8 km",
        "Town": "Rocky Mt House, AB",
        "Type": "out-and-back"
    },
    "title": "Mt. Elliot - Nordegg - Alberta",
    "trail_id": "12941"
}