{
    "description": "\"Katahdin, in all its glory forever shall remain the mountain of the people of Maine.\" So goes the mission statement for Baxter State Park, Maine.\nThis would mark the last trip for the summer. My vacation was winding down, and we've been wanting to do this one for a while now. Despite what you spontaneous types might argue, any trip, if to be thoroughly enjoyed, needs a bit of research. The bit we did told us to book well ahead and to avoid the weekend crowds. \nBriefly, Baxtor State Park is located in Millinocket, Maine, USA. It is home to Mount Katahden, the highest peak in the state. (5,267 feet) Also worthy of note is the Appalachian trail. It goes through the park and over the mountain to conclude the US's portion of the continental route. Wirthin the park, there are several peaks, notably Mount Katahdin, but others include Hermit Peak, Doubletop Mountain and The Owl.\nWe did a reconnaissance trip last thanksgiving, taking the kids with us and driving through part of the park to do some canoeing. While there, we picked up a small sketch of a park map, and that was pretty much it. Mind you, it was absolutely beautiful with brilliant blazing leaf color and a few mountains around us. We didn't see nearly the half of it, and we didn't stay very long. Such are missions of that sort...\nTheir web site is www.baxterstateparkauthority.com. There, they have a rather odd system of camp reservation, and that was our only read hurtle. (less the day-hike up the mountain) Their system of reservation is based on you calling them to find available tent sites for the dates you want to visit. From there, you go on-line and download a PDF form. Fill it out and mail it back with a cheque for the total amount. They subsequently call you back confirming your reservation, if no one got your site ahead of you. Despite the somewhat luditic method, we managed to book two campsites prior to a weekend, but not in the same location.\nThis park is truly one kept in a natural state. There is no running water except for the streams, brooks and lakes. There is no power. Only pit toilets. That was no problem. Since we were car camping, we brought a 20L reservoir of water and plenty of hand sanitize. Of course you could hike to the park from the AT trail, but we didn't take that option this time.\nWe were told that the park had early morning line ups during the weekends, so we opted for a thursday, friday stay. We were also told that hikers would fill up the day-use parking lot (20 cars max) starting at 7AM. When the parking lot is full, the trail is closed. This is one of their ways of monitoring over-use. Note that we didn't have a campsite at the same place for two nights, so we had to get our car to that lot ASAP the morning of our hike.\nWe arrived at the park and took in some wonderful canoeing. They rent the gear for a dollar per hour. And that's on an honour system. We had beautiful, clear weather which made for some great pictures of the mountain we'd be hiking the next day. We noted some backcountry tent sites available exclusively by canoe, and there were cabins too, When we found our car camping spot at Katahdin Stream, we looked jealously at the lean tos, They are platforms with a roof on one side, big enough to pitch a small 2-man tent. Very rustic, but not on our accommodation itinerary. -Next time for sure! Shannon, my girlfriend, (Yes, we have the same name) noticed a hiker's log entry in the warden's journal book, that read, \"I can't believe I'm here, 115 days later!\" Well, that put perspective on what we were planning on doing.\nAfter buying a topo / trail map, (one usedless for my GPS) we made ready for the night with great food and a campfire. We slept soundly until around three in the morning when Shannon woke me to what sounded like a car! We had flash backs to the research about the parking lot filling up and the trail closing. So  we decided to move the car to the day-use area. Damned if we were to drive all that distance from PEI only to be turned away by a fullparking lot. The day-use area was only a football field away, and the next morning, we'd be able to shunt our gear easily enough on foot. At least we'd sleep easier for the rest of the night knowing our place on the trail was guaranteed.\nThe next morning brought hazy warmth. The parking lot was filling with people of all ages. By 7AM about 20 people had past our site on the way to the mountain's peak. I saw people in sandals, boots, big wooden sticks, high tech hiking poles, external frame packs, and day packs. The gear spanned all eras. We finally got our camping things pached away, and set out on the Hunt Trail by 8AM. \nThe trail starts in the forest. But like all mountain hikes I've experienced, this one, early on, beats you up by slowly wearing you down with its stony and rooty terrain. It is a technical trail. You're walking up and along what is essentially a dried up creek bed. What soil that was ever there, has been washed away by the combination of run off, and steady foot traffic. Roots and boulders pound back at your feet, every step of the way.\nYou climb at a steady rate. Still in the forest, you pass Katahdin Falls, and then \"The Cave\" where a huge piece of tallus (morrane?) has fallen to make the shelter formation. As you assend, the rocks get bigger, and the trees get more sparse. Finally you reach an inclined face of rock where to ascend, you need to make use of the bar holds have been bolted to the rock. Upon climbing this, you quickly get the sense of exposure. Looking each way, there are 10-15 foot drops. It's a quick transition from forest trail to rock scramble. Things get much more barren from this point on. I guess what ever does grow, is delicate, so straying from the trail is not a good idea.\nAs you continue, there are more climbs and level spots. Getting to the Tableland is a neat experience. You ascend a rocky ridge that, given a low perspective, is like the corner of an egyprian pyramid. The last push is an incline that gets you to Katahdin's peak. There is a carne and a plaque showing the Appalachian Trail distance info and the elevation. The views are incredible. The space is a little crowded however. \nThe Knife Edge\nThe spur route, called the Knife Edge, is quite remarkable. This is a trail that runs the mountain's perimeter and eventually drops back down the side of the chain toward a lake at the bottom. it is, at best, a jagged, 7 foot wide, highly exposed rock scramble. At some places, you could be a foot or so from the edge of a pretty dicy drop. That sense of vertigo plus the wind and the weight of a day pack after 4 hours of hiking might make some think twice. We ventured out to do a bit more than half of the Knife Edge. it was an incredible place to be. (see map route)\nUpon departing from the peak, we chose a different route back for some variety that involved the Saddle Cutoff Trail and the Baxter Peak cutoff. In all, the hike took us 9 hours with the lunch breaks and photo ops combined. In retrospect, taking only 2 liters of water each wasn't enough. I took a chance and refilled (untreated) from the katahdin falls on our return, so that I wouldn't run into trouble. I never did get sick.\nThat evening, we relocated to our new campsite in Nesowadnehunk, and found another lake near by to rent a canoe. There, we saw a female moose in the water, eating lake grass. Another terrific sight. Afterward, we found a great spot for a swim, and called it a day. \nEpilogue:\nIn total, we bagged the mountain, did part of the Knife Edge, saw a moose, and did some great paddling. For what more could you ask? Maybe next time, we'd add some white water canoeing. We definitely anticipate returning next year. \nWhen we do return, we plan on climbing the peak from the other side. We would hike the Chimney Pond trail and camp at Chimney Pond campground for two nights. From that base camp, we'd do the Dudly trail and the Knife Edge, leading to Mt. Katahdin's peak. We would then return to camp via the Cathderal Trail. At least that's one plan. There certainly wern't any negatives with what we did.\n \nShannon Burt\nEast coast editor\nTrailpeak.com",
    "directions": "www.baxterstateparkauthority.com\nTake I-95 and turn off at Millinocket, Maine.",
    "geohash": null,
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/ME/1294/long_katahdinfrlakejpg.jpg",
        "https://trailpeak.com/storage//content/trails/US/ME/1294/reg_katadyn2.jpg",
        "https://trailpeak.com/storage//content/trails/US/ME/1294/reg_moose.jpg",
        "https://trailpeak.com/storage//content/trails/US/ME/1294/topo_katadyn1.jpg",
        "https://trailpeak.com/storage//content/trails/US/ME/1294/topo_mtkatahdin.jpg",
        "https://trailpeak.com/storage//content/trails/US/ME/1294/narrow_best1_exposure.jpg",
        "https://trailpeak.com/storage//content/trails/US/ME/1294/20180611999297.jpg",
        "https://trailpeak.com/storage//content/trails/US/ME/1294/20180611999254.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/hunt-trail-baxter-state-park-mt-katahdin-near-millinocket-me-1294",
    "stats": {
        "Activities": "climb hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 5,
        "Time": "7 hrs",
        "Total Distance": "14 km",
        "Town": "Millinocket, ME",
        "Type": "out-and-back"
    },
    "title": "Hunt Trail, Baxter State Park, Mt. Katahdin",
    "trail_id": "1294"
}