{
    "description": "General description: This hike can be done by a person of average physical fitness and novice level hiking experience.  The total distance is approximately 12 kilometers and can be done in 6 - 8 hours. Altitude is gained rapidly in the first 2 k. The elevation rises from 100 feet, at the bridge crossing Barachois Pond, to 1150 feet at the summit of Erin Mountain. The first 1 k is on a well-marked trail over dry solid ground, with boardwalk crossing wet areas and stairways up the steeper trail. Upon leaving the trail at the top of the mountain, you may encounter wet or boggy conditions and thick tuckamore.?\tLocation of Erin Mountain: Erin Mountain is located in Barachois Provincial Park, which is approximately 8.5 kilometers along the Trans Canada Highway, east of the intersection with Route 490 to Stephenville, Newfoundland.",
    "directions": "General description:  Advanced knowledge of topographic map reading is required, in order to understand the UTM grid reference numbers and compass bearings given in the route guide. A concise explanation of grid reference is usually printed in the right margin of most Canadian topographic maps.  Navigation equipment such as map and compass is a necessity. If you venture onto the route without it, getting lost is a real possibility. Before you leave, make sure someone knows your route plan and report back to them upon your return. If you plan to overnight in the backcountry you are required to report to the attendant on duty upon your departure and return. The recommended campsite is outside the park boundary, so a camping fee is not needed. ?\tTopographic map needed: All references to Erin Mountain are from Canadian 1:50 000 topographic map \"Main Gut 12 B/8\", Universal Transverse Mercator grid zone 21 U, square identification VD, mean declination 1985 (center of map) 23º 50' W, annual change decreasing 6.3'. Compass adjustments must be made accordingly in order to navigate accurately. The bearings can be read as they are given in order to verify location on the map. 6-digit UTM grid references are given to help pinpoint major points on the route and may be used with a GPS to aid in navigation. It would also be useful to plot your course on the map before leaving. Note that elevation is given in feet and horizontal distance is given in meters and kilometers. Older Canadian topographic maps are printed like that. More recent publications give both horizontal and vertical measurements in meters. A list of map dealers may be available from Natural Resources Canada website:http://www.nrcan.gc.ca/earth-sciences/geography/topographic-information/maps/10995?\tGear and equipment suggestions: A 25 liter day pack should be sufficient to carry all you will need for a day trip. Carry a camera, binoculars, standard first aid kit, snacks or a substantial lunch if you intend to make it a day. A walking staff may be among your list of essential equipment. Since the trails are not marked beyond the top of the mountain, a map and compass must be used to navigate the described route. Depending on the season, the amount of clothing you need will vary. Determine the weather forecast before departure, and act accordingly. During any season, dress for the current weather conditions. However, be prepared for sudden changes in the weather. Carry extra clothing such as wind pants and jacket, even in the summer. At least, light hiking boots are recommended; waterproof boots would be better, some parts of the route may be wet. Even though water is plentiful, it is highly recommended that you carry your own drinking water, or include some means of filtering or otherwise purifying it. Giardia is rare but not unknown in this area. In addition to beaver and muskrat, larger animals such as moose and caribou are active in and around the waterways. Moose and caribou sightings are highly likely. Smaller animals such as fox, beaver, muskrat and squirrel, as well as a variety of birds, make this area their home. On the mountain tops you may spot rock ptarmigan or arctic hare. ?\tMinimum environmental impact policy:It is recommended that hikers observe a minimum environmental impact policy. Avoid open fires, leave wild flowers for others to enjoy, be cautious of wild animals and carry out whatever you carry in. Detailed route guide: To get to Erin Mountain from Stephenville, drive 20 kilometers south on route 490 to the Trans Canada Highway, UTM 975670. On the TCH continue another 8.5 kilometers east to the entrance to Barachois Pond Provincial Park. 048708 Upon entering the park, proceed to the registration kiosk. You may have to pay a day-use fee, and if you plan to camp in the park, a daily camping fee is charged. Park personnel at the kiosk, if an attendant is on duty, can give directions to the trail head. Drive straight on through the check-in point to the end of the peninsula. The trail head and a small parking area can be found there. 067703 Upon crossing the bridge, with Erin Mountain directly ahead, the trail enters an evergreen forest. Within 200m the hard dry trail gives way to boardwalk, with steps up the steeper slopes. The walk through the forest is pleasant, with glimpses of Erin Mountain through the trees on the left. After about an hour of steady walking, most of the hard climbing is over and a good place to catch your breath is on the rocky outcrop at 073688. Here you catch the first good view of the Long Range Mountain wilderness. Up the valley to the south, a small pond nestles between the hills. Look carefully, you may spot a caribou or moose. Both are superbly adapted to life in this environment and blend in well with the rocks and vegetation. It is at this point that you should emerge on your return, if you follow the route outlined in this guide. You can clearly see the moose/caribou trail, to the south, leading up from the valley, meeting the main trail near the rocky outcrop on which you stand. You must continue on to the summit of Erin Mountain, almost directly north from here at 073694. You get a good view of Barachois Pond and surrounding area from this vantage point. Here is where most hikers turn around and return to the park. However, the more adventurous press on into the wilderness of the backcountry. From here the route unmarked. At first glance the countryside appears heavily vegetated and almost impenetrable. Caribou have been living here for centuries and their trails inevitably lead from hill to hill through the densest tuckamore. Following their trails is the easiest way to hike this terrain. When you come to an area that looks difficult to cross, look for a caribou trail. If the caribou haven't been there, then maybe you shouldn't! Pick your trail through the tuckamore and underbrush, between the two small ponds to the southeast at 075691. From here plot a course of 109º to the top of the hill at 082688 The next prominent hill on the route is at 083676, on a bearing of 171º, just over 1 k away. This hill is just outside the park's southern boundary. If you are planning to camp out, a suitable campsite can be found at 081667, 201º, on a small peninsula between two ponds. Continue along the ridge, on a bearing of 171º for about 900m to 085667 The next prominent feature is the hill at 081659, on a bearing of 206º, just over 1350 feet above sea level. You cannot approach this hill directly, but must diverge a little toward the west around a pond. As you approach the hill, a well defined caribou trail will get you safely through the thick tuckamore on a southeasterly route. As the tuckamore thins out and the slope decreases, you can press on to the summit. It is from this hill that you begin to turn and head back to Erin Mountain. As you descend toward the west, and before you lose elevation, take a bearing on the narrow isthmus between the two ponds at 076661. You may also encounter a very good caribou trail crossing at this place also. Follow that trail over the ridge to the north to 075669. Following a compass bearing may not be possible because of the vegetation and terrain. Stay on the highland as much as possible, and follow the caribou trails, until you get to 072683, overlooking the pond at 073684. Follow the shoreline to the outlet. Your objective is to find the intersection of the main trail at 073688. A caribou trail ascends the steep riverbank through the alders to the rocky outcrop on the main trail. Once you find the main trail, the way is clear, continue on down to the bridge and the parking lot where your transportation is waiting.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NL/12953/reg_bar02-31020.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/12953/reg_erin02-31020.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/12953/reg_erin04-31020.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/erin-mountain-near-stephenville-nf-12953",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 4,
        "Time": "6 hrs",
        "Total Distance": "12 km",
        "Town": "Stephenville, NF",
        "Type": "out-and-back"
    },
    "title": "Erin Mountain",
    "trail_id": "12953"
}