{
    "description": "This is a nice and short hike to a beautiful waterfall deep in the woods near Maitland.  I set off from the end of Selma Rd and although the road appears in topo maps and in google earth..it soon becomes more or less a logging road with deep pools and muddy centres....probably good if you like going off road in jeep or own an atv.I followed the road for a while until I saw a secondary branch leading north and towards the stream where I thought there might be a waterfall.  The stream has carved a nice lyle ravine with some exposed banks...I decided to follow it upstream as there seem to be better contour lines that way.  I followed it for a while bu it was difficult because it was winter and the stream was half frozen...After a while, I emerged from the tight ravine and was discourage to see some small one footer fall.   I did the smart thing and pushed another 200m or so and bam there it was a beautiful multi tier waterfall of about 12-15ft.  The height is not important here as the fall is quite picturesque and has a large pool in front so you can probably go for a dip in summer.  I noticed that the pool was almost too perfect..and it was someone has taken out all the small shrubs on the sides and there s no deadfall in the way.  At the top of the north side, I saw a large atv rack that probably links up to the old Selma logging rd.   My track doesn't get back to the car immediately has I was looking for another potential fall on a secondary brook...dont bother, its not worth it.The funny part about this exploration is that when I came back home and downloaded my gps track in google earth...it showed another track I made a long time ago leading to the exact same fall....I didn't remember it at all!",
    "directions": "Go to Maitland and continue to Selma.  Take Selma Rd until it becomes a muddy track.  Continue on it and make your way to the fall at; 45.290331, -63.547463.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/12965/reg_28070466-1056090061197504-2365840294866186031-o-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12965/reg_28162276-1056090147864162-7428611602486100322-o-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12965/reg_28164667-1056090064530837-5988340173821646126-o-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12965/reg_28165221-1056090047864172-7985140368450255117-o-27177_best1_.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/east-sterling-brook-fall-near-truro-ns-12965",
    "stats": {
        "Activities": "snowshoe hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "3 km",
        "Town": "Truro, NS",
        "Type": "out-and-back"
    },
    "title": "East Sterling Brook Fall",
    "trail_id": "12965"
}