{
    "description": "This is a hike to some unvisited falls and large cliffs located in the Cape Breton highlands National Park.   I wanted to visit this brook as it had a large dark spot showing in the satellite imagery.  The brook looses hundreds of feet of elevation in a short distance so I knew it would be waterfalls and cliffs to explore in that area.Setting off in February 2018...yes February!  There wasn't any snow at the foot of the highlands and as the ascension progressed, there were patches of snow and some ice but nothing very deep for this time of year.  I started on the trail access point across from the parking lot and made it to the bridge over the brook.  Once at the bridge I started to follow the north branch of the brook.  I had previously visited a massive waterfall on the south Branch with a bonus loop to the top of Jerome Mtn (see trailpeak post for that one!).I criss crossed the brook a few times and approximately 1.5km after leaving the car, I chose the branch of the brook which was going east...the other branch is not shown on the topo maps at all but it is present and it seems to go on further in a wide valley.  As soon as I started going up the branch, there was a first fall of about 30ft.  the ascent was steep on the side of the fall but very manageable.  Once passed the first fall its just a short journey passed some more smaller falls to the topmost fall I visited that day.  this one is about 45ft and framed by rock walls.  O the north side of the brook are huge rock cliffs that have gaps which were filled by vertical  ice at the time of my visit..almost chute like features!The chute like feature immediately next to the fall is the only way I could easily bypass the frozen fall.  However the ice and the sun setting down prevented me from exploring above the 45 ft fall.  And that a shame because on my way back down and far from the falls, I turned around and saw a massive ice pillar just above the area I explored.  i am sure there is at least a 75ft fall just above the gps track below.I followed the branch of the brook which doesn't show up on the topo for a little bit but again I had to turn back since it was getting dark and I was on my turn around time!  I will return to this brook one of these days!!!!!!!  Especially that on my return I followed an easier, established but forgotten path on the south side of the brook all the way to the bridge...",
    "directions": "Take the Cabot Trail into the CBHNP in Cheticamp.  At the Cap Rouge parking lot (N46° 42.879' W60° 56.055'), follow the trail to the bridge over Aucoin Brook.  Top fall I visted was at; N46° 42.348' W60° 54.989'  but there is a bigger one just ahead!",
    "geohash": "f8k9",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/12962/narrow_27857789-1052497424890101-1618224031015968875-n-27177_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12962/narrow_27867543-1052497411556769-3832468806823591822-n-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12962/narrow_27972224-1052497461556764-1405859399656960209-n-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12962/narrow_27972343-1052497344890109-7761677953822193085-n-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/north-branch-anthony-aucoin-brook-falls-near-cheticamp-ns-12962",
    "stats": {
        "Activities": "climb hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 5,
        "Time": "2 hrs",
        "Total Distance": "5 km",
        "Town": "Cheticamp, NS",
        "Type": "out-and-back"
    },
    "title": "North Branch Anthony Aucoin Brook Falls",
    "trail_id": "12962"
}