{
    "description": "This is a hike to explore a cool looking valley near Rawdon gold Mines.  I had flown over this valley via helicopter and it looked impressive.  the valley is in a straight line for about 2km..I wanted to check it out for potential waterfalls or rocky cliffs.The start of the hike is not fun as beavers have flooded the forest so it is best to hike on the slope which on the top had been logged and on the side is dense with evergreens  but after just a few minutes of effort you stratégique to see the walls of the ravine close off on both sides.  Why I noticed the most immediately and during the whole hike is that this valley has protected some of the larges hardwoods I have ever see in this province.  Some of the trees are so large that it would take two or more people to circle them with their arms.Bonus on this hike is that there are two small brooks entering the north side of the valley which have created some falls of between 10-15ft.   The south side of the valley have some exposed rock formations but never high enough to call them cliffs.   All in all a good exploration to see some magnificent trees...and you are on the same road to visit the Herbert River Fall located close by.",
    "directions": "Highway 14 to Rawdon Centre.  Take douglas Rd.  It will be a muddy road in the spring and fall and continue to where you see a sign that the bridge is closed.  At this point Douglas Rd continues to the left.  Follow it until a bridge over Gold Brook.  Park before the gate on the bridge and follow the brook upstream",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/12967/narrow_28056105-1056670914472752-8175440210800005478-n-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12967/narrow_28058897-1056671064472737-6343875750456926910-n-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12967/narrow_28167055-1056671157806061-4799479927133427569-n-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12967/narrow_28279728-1056671027806074-3571244446189011579-n-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12967/narrow_28378244-1056670974472746-1830064458585262225-n-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/gulf-brook-falls-near-halifax-ns-12967",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "5 km",
        "Town": "Halifax, NS",
        "Type": "out-and-back"
    },
    "title": "Gulf Brook Falls",
    "trail_id": "12967"
}