{
    "description": "This is one of those falls that is spectacular, unexpected and so easy to reach.  I had been here a number of years ago but for a reason or another never posted it on trailpeak. The trail strass off a well maintained but at times muddy road in East Noel 9near Maitland).   Look for a flagging tape on the side of the road.  The trail is wide enough fo an ATV and follows the lip of the deep gorge all the way to the fall.  It is very impressive that in this area of the province there are cliffs of this height to a river down below.  Within a minute you will be going down hill to the two main falls.  The lower is the largest but hard to access the pool in front of it.  The upper fall is right in front of you as you finish the trail and you can follow the river 100ft to stand right in front of it.  If its winter or summer or you don't mind getting wet, it is a good idea to cross the river in front of the upper fall, head into the woods and cime down to the front of the lower and larger fall.   Careful as there is a set of barb wire in the woods all the way to the river.  there are old and almost at an ankle level.",
    "directions": "Drive west from Maitland towards Noel.  turn on Northfield Rd and look for the flagging tape or follow the gps track int this post.  the falls are approximately at; 45.294429, -63.695279",
    "geohash": "f849w",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/12966/reg_28070383-1056094527863724-5987876484507941111-o-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12966/reg_28234893-1056094537863723-422908972261203531-o-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12966/reg_28337052-1056094564530387-1939576158686545433-o-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/east-noel-river-falls-near-truro-ns-12966",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 5,
        "Time": "1 hrs",
        "Total Distance": "1 km",
        "Town": "Truro, NS",
        "Type": "out-and-back"
    },
    "title": "East Noel River Falls",
    "trail_id": "12966"
}