{
    "description": "This is a path through the woods on the west side of Grover and Whale Cove Lakes to the sea-side cliff of Crow's Nest. For hikers, it's a spectacular half-day out. For climbers, it passes through the Grover Cove bouldering area and several undeveloped bouldering and climbing areas to reach the Crow's Nest crag. It's a properly tended trail, no bush-whacking required--at a fair clip, it's 1.25 to 1.5 hours each way. But allow time for the view and the Grover Cove waterfall. There's a scrambly bit at the base of the cliff over Round Pond.From the trail head, take the footpath around Little Lake to join an ATV trail. Turn left on the trail and follow it to Quarry Lake. Ignore ATV trails going off to the right (towards the other side of Little Lake and the previous trail to Grover that was ruined in Hurricane Juan) and to the left (towards the windmills).At Quarry Lake, take the foot path to the right around the lake to the top of the waterfall. You can cross the falls at the top when the lake run-off isn't bad, in the middle any time, or at the bottom at low tide. The gps track takes the middle: stay on the same side of the waterfall and descend over some ridges left by quarrying to cross the stream mid-way down. Continue right-ish alongside the stream until you see blue blazes to your left--follow these through the woods until the trail splits off to the right with some flagging (to pass slightly west of what the boulderers call the Lake Boulders). This path brings you to the base of the cliff over Round Pond. (There's a gully here you can scramble up to get a fantastic view from the top.) There is a scrambly section--watch your footing as you pass through a small boulder field. You then skirt the lake at the bottom of the cliff, which involves a little daring on a rock face that drops into the lake. But you have good foot and hand placements on it. (Watch the slippery lichen if it's wet.)The path continues clearly through the woods, generally up hill; then it descends towards a stream flowing out of Whale Cove Lake. The path turns left along this stream to find rocks you can hop across. Once across the stream, you come up through some brush to a path in the woods again that passes underneath a cliff overlooking the lake. (There are side paths that can take you on top for the view over Whale Cove Lake and a glimpse of Loon Cove Lake.)The path continues through the woods until you reach a path that joins Whale Cove Lake and the unnamed cove between Loon Cove and Whale Cove. Follow that path and then take a smaller footpath to the left that skirts just above the Cove and heads up through the brush and birch to an exposed rock face that is clearly visible on satellite views. Follow the top ridge of that exposed face, pass one last time through some woods, and emerge onto the barrens with a lovely view of Crow's Nest. The footpath descends through ankle-high shrub to a small rock ridge above a boggy spot, and then you join an ATV trail and turn right for the final ascent to Crow's Nest. From the top of Crow's Nest (just down from the peak), the descent trail to the base of the cliff is to the left.",
    "directions": "Come to Terence Bay from Halifax on the 333. Take the Terence Bay turnoff, and then turn left on River Road. Take this around until you see the second lake on the your left. Park there and walk back to the trail head.",
    "geohash": "dxft",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/12961/reg_27993615-10155161414397093-1641180537501073615-o-58181.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12961/reg_CRW-0926-1--58181.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12961/reg_IMG-0248-58181.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12961/reg_IMG-7063-58181.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12961/reg_IMG-7068-58181.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/best-route-to-crows-nest-near-halifax-ns-12961",
    "stats": {
        "Activities": "climb hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 5,
        "Time": "4 hrs",
        "Total Distance": "9 km",
        "Town": "Halifax, NS",
        "Type": "out-and-back"
    },
    "title": "Best route to Crow's Nest",
    "trail_id": "12961"
}