{
    "description": "This is a very nice hike to a beautiful and unknown waterfall on the north Branch of Blues Brook.   I am calling it the North Branch as I have already explored and posted on trailpeak another set of fall set in a gorge on Blues Brook as well as another hike to a Hanging valley Fall on the main branch of Blues Brook.This one started with me looking at satellite imagery..It was;t showing very much except for one little white spot.  The topo maps were showing anything in that area that could be a fall but the 1:50 000 topo are too wide apart sometimes to make that distinction.  Lastly, I need something in Cape Breton in  April and there was still too much snow in the Highlands to properly explore there.This hike starts on the TCH at the entrance of a gravel pit.  Make your way to Blues Brook.   From there, the North Branch will come into the main stem from the right hand side.  Follow the north branch to a small ravine or gorge with a few five ft falls.   After the small gorge like feature, the valley opens up again in a nice U shape.  the hills are filled with mature hardwoods.  After only  few hundred metres you will come up to a three tier waterfall at the head of the valley blocking it off.  The top fall is about 10ft, it plunges another 20ft and then plunges another 60 ft to so to the valley floor.   Rock Walls frame the whole thing.  there is another small cascade stream flowing out of the south side but there is no real fall here even at the top.",
    "directions": "TCH towards Whycocomagh.  Near Blues Mills, look for Mountain Rd.  Head about 750m east of Mountain Rd.   Thats the branch of Blues Brook you need to follow.  The entrance to the gravel pit is just a bit more east.  Dont forget to take the north tributary of the brook or you will instead find yourself into a bigger gorge like setting on another trailpeak entry (https://www.trailpeak.com/index.jsp?con=trail&val=12279)",
    "geohash": "f8hmr",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/12979/narrow_cbi-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12979/narrow_cbi2-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/north-branch-blues-brook-fall-near-port-hawkesbury-ns-12979",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 5,
        "Time": "1 hrs",
        "Total Distance": "3 km",
        "Town": "Port Hawkesbury, NS",
        "Type": "out-and-back"
    },
    "title": "North Branch Blues Brook Fall",
    "trail_id": "12979"
}