{
    "description": "Near Bridgetown, a lot of people drive by and stop to look at the Bloody Creek monument.   I was looking at the top map of the area and the hills surrounding Bloody Creek upstream of the monument look big enough for some falls to occur. I did have a hint or two from Ryan but there wasn't anything else online about it.We drove a dirt road to a sand quarry.  We continued on foot from the quarry on an old and overgrown by alders road.  That road passed close to the creek and you could see some of the falls.  I had spotted a dam upstream so we made it all the way there before visiting the falls.the dam is in really good shape but the old wooden pipe is not so much.   The first falls are where the dam is located...after going downstream a bit you can spot more smaller falls and then a larger one that has at all vertical wall on its western side.   Afterward is another fall of about 20ft where there is a large rectangular rock at its base perfectly placed to takes photos...If all this weren't enough, the last fall is a two tier beauty as it plunges twice in about 5m to a deep looking pool framed by rock wall on every side.   From there its about 300m through the woods back to the quarry.  This is well worth the effort and drive!",
    "directions": "Take exit 21 on highway 101.  Turn to go south on Rice Rd.  At the 90 degree turn to the right, continue straight instead on a dirt road, passed an orchard and go up first hill to park at the sand quarry at the top",
    "geohash": "dxcwf",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/12978/reg_DSC-8434-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12978/reg_DSC-8445-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12978/reg_DSC-8455-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12978/reg_DSC-8486-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12978/reg_DSC-8503-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12978/narrow_DSC-8508-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/bloody-creek-falls-near-bridgetown-ns-12978",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 5,
        "Time": "1 hrs",
        "Total Distance": "3 km",
        "Town": "Bridgetown, NS",
        "Type": "out-and-back"
    },
    "title": "Bloody Creek Falls",
    "trail_id": "12978"
}