{
    "description": "So this hike took me about 7km but it will be shorter for you if you only want to see the waterfalls.   The reason I explored this brook is that the 1890's map was showing a gorge.  I set off on a well maintained logging road and followed it to a nice bridge over the brook.  I continued on the opposite bank and turn on a secondary trail on the left at the top of the hill.  the trail continued towards a small lake (Moose Lake).  There is a small fall on the brook which empties this lake.  I continued further upstream for another 2km to look for the gorge but only found a few straight walls which were well away from the stream.  The forest in the end of the gpx track is not fun to walk in as it is very dense.  On the way back I followed the opposite bank and fond another small stream and fall in the middle of two logged areas opposite moose Lake.  Back at the bridge I first crossed I noticed a 5ft fall immediately downstream which is pretty scenic.",
    "directions": "Highway 7 to Twin Bridge Loop in spry Harbour.  Take the logging road heading northwest from there.  The main fall is at N44° 51' 04.5\" W62° 38' 04.0\" and secondary falls at; N44° 51' 19.0\" W62° 38' 29.7\"",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/12975/reg_18422459-895899687216543-6422914538733612692-o-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12975/reg_18423967-895900030549842-824733957893532977-n-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12975/reg_18446509-895899757216536-4901373705504529626-n-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/west-taylor-bay-brook-fall-near-halifax-ns-12975",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 2,
        "Time": "2 hrs",
        "Total Distance": "7 km",
        "Town": "Halifax, NS",
        "Type": "out-and-back"
    },
    "title": "West Taylor Bay Brook Fall",
    "trail_id": "12975"
}