{
    "description": "I was looking for a close to home adventure and decided to follow one of the brooks which flows into Porters Lake.  Most of the journey is on ATV trails but the middle part is just a bushwhack of about 1km by the river as the ATV tracks were going across the river and I wasn't getting a soaker in March by following it.  The path is most of the time in a very nice hemlock stand with a full canopy overhead.   One of the surprise on this hike was a small tributary coming out of the hillside about 1.75km after setting off.  the tributary has a nice 20ft fall on it which is big for anything on the eastern shore.Pushing further upstream, I galled at the top map and saw a possibility of a fall or at least a loss of elevation further upstream.   At some point, you will leave the atv trail but still follow the river and you will end up on an overgrown atv path for a while.  There is a big still water and then upstream a well constructed bridge.  Follow the stream wth the bridge for another 500m or so to the second fall of this hike.   The fall or cascades loose about 15 ft in a slider type of fall.  btw I did follow another branch for about 500m towards Grassy Lake but did not spot any falls.",
    "directions": "Porters Lake on the Eastern shore.  follow Myra Rd to its conclusion.  Just before the bridge over west brook is a large parking..this is the start of the trail.  Trib fall is at N44 49 09.3 W63 24 07.0. Main stem fall is at; N44 49 56.3 W63 24 59.6",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/12971/reg_westbrokk-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12971/narrow_westbrooktrib-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/west-brook-falls-near-halifax-ns-12971",
    "stats": {
        "Activities": "mtn-bike ski-xc hike",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 3,
        "Time": "3 hrs",
        "Total Distance": "10 km",
        "Town": "Halifax, NS",
        "Type": "out-and-back"
    },
    "title": "West Brook Falls",
    "trail_id": "12971"
}