{
    "description": "This is a nice hike to do when you don't have enough time to escape from the city.  The hike has no trail so I call it moderate but the forest is actually very nice to walk through so it is really easy.  You will need toc cross the stream so after a few rainfalls it might be swollen but where the fall are located there is usually a narrowing of the river which permits a crossing.I ended up on this brook because of some rocks and white colours I spotted on satellite imagery.  Rocky Brook flows into King Brook and King brook flows into Grand Lake.  there is already a post called King Brook Fall on trailpeak.  This hike will take you on the tributary called Rocky to a series of falls.You have to park on the dirt road where you think its appropriate.  You cannot take it all the way to the end as it becomes someones driveway.  From where I park, I climbed through the forest to the top of a small hill, then it was a sharp descent onto King Brook.  Soon after, rocky brook appeared on the opposite side of the river.  I crossed King Brook and followed Rocky Brook for 150m to a series of unexpected falls (these weren't what I saw on the sat imagery).  these falls drop in three main tier and are located at N44 54 05.6 W63 38 00.5.I continued further upstream on Rocky Brook and there were many more 4-5 ft falls along the way.  Then the brook slowed down a bit and had a few stillwaters.  Further upstream was the final fall.  The one I wanted to see in the first place.  Its a 4 tier fall with about a 25ft total drop if you add all the drops together.   The gpx track then shows me doing a cross country tour towards Haunted lake as there is another fall there.  I will do a separate post on Haunted Lake fall.  The overland track was moderate in difficulty and apart from a few stands of red pines and hemlock was a bit boring",
    "directions": "Highway 2. In Wellington, turn on Kings Road and follow it as it becomes Sleepy Cove Rd.  Don't drive all the way as it becomes someone's driveway at the end.  I parked near N44 53 57.1 W63 37 41.9.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/12987/reg_rocky11-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12987/reg_rocky3-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12987/reg_rocky4-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12987/reg_rocky5-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12987/reg_rocky6-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12987/reg_rocky7-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12987/narrow_rocky1-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12987/narrow_rocky2-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/rocky-brook-hrm-falls-near-halifax-ns-12987",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "6 km",
        "Town": "Halifax, NS",
        "Type": "out-and-back"
    },
    "title": "Rocky Brook (HRM) Falls",
    "trail_id": "12987"
}