{
    "description": "As I was driving back from the Wentworth Valley towards Truro, I could see a large loss of elevation and I began to think that maybe I had missed a few waterfalls along this river. The Folly River has two well known falls; the Toblerone and the lower Folly river fall but I thought that there should be more. During the winter of 2018, I spotted a small area in the upper reaches of the Folly River which had 4 white spots on sat imagery that were close to each other. The 1:50 000 topo were no help has there wasn't even a change of colour line in that area.There is a well maintained dirt road leading to about 500m of this spot. I also made some inquiries with some white water paddlers and they confirmed my hunch! Finally spring arrived and I decided to check these out. A short walk along a secondary brook leads to the Folly River from the dirt road. There is even a scenic 20ft fall on the tributary! Immediately downstream a gorge began and I wasn't disappointed. there are lots of falls, rapids and rock walls in a section measuring about 100m. Some of the landscape down even look like Nova Scotia! There is one larger, single drop fall in the middle but I couldn't get to the front of it has the water levels were quite high! You can't miss it as it has a large square boulder right downstream of it giving the name of the fall; Grandfather clock!",
    "directions": "Highway 4 towards Wentworth, turn right on Stevens Rd and again turn right after the bridge over Folly River. You will drive by a stone quarry and then spot a well maintained dirt road leading up a hill on the left. Park there but continue on dirt road in a straight manner and find a culvert going under this dirt road. Follow the tributary downstream. Main falls are at; N45° 30.970' W63° 32.135'.",
    "geohash": "f84ff",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/12983/reg_folly-upper3-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12983/narrow_folly-upper-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12983/narrow_folly-upper1-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12983/narrow_folly-upper2-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12983/narrow_folly-upper4-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/grandfather-clock-near-truro-ns-12983",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 5,
        "Time": "1 hrs",
        "Total Distance": "1 km",
        "Town": "Truro, NS",
        "Type": "out-and-back"
    },
    "title": "Grandfather Clock",
    "trail_id": "12983"
}