{
    "description": "This is a nice and short hike to three distinct waterfalls mere steps from the TCH in Whycocomagh.   I had previously explored the lower part of this unassuming brook for a cave but came up empty handed.  I also didn't even have a clue there could be beautiful waterfalls on this brook.So what changed between these years?  Two words..Goggle Earth!   The imagery for that area revealed three white spots that looked like waterfalls.  Bonus; There is a logging road and or an ATV path that passes only 400m from the falls.  Unfortunately in late April, that road is still not possible with a vehicle. So I parked and started walking on the road.  It gains elevation pretty quickly and is set in a gorgeous mature hardwood forest.  After walking about 1km, it was the time to head into the woods.  It just so happened a guy on an ATV was coming by.  I told him what I was looking for and he replied he didn't know about waterfalls in that area.So a short walk in the woods led me to the lip of a long descent into the ravine below and as luck would have it, I finished right in front of the lower fall.  This on is about 30ft high.  Scramble to the top of this one and you will have a nice pool in front of another fall of about 25ft.  The third fall is set about 175m further upstream and its just a small one of about 15ft.",
    "directions": "TCH towards Whycocomagh.  Take the Skye Mountain Road and park where you can and begin hiking on the Skye Man Road.  The main falls are at; 45°56'56.4\"N 61°09'44.7\"W.",
    "geohash": "f8ht2",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/12980/reg_30709412-1089677611172082-7573151915609948160-n-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12980/narrow_30724418-1089677607838749-7848978671023947776-n-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12980/narrow_30725648-1089677564505420-2834295390176542720-n-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/macaskills-brook-falls-near-port-hawkesbury-ns-12980",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 5,
        "Time": "1 hrs",
        "Total Distance": "3 km",
        "Town": "Port Hawkesbury, NS",
        "Type": "out-and-back"
    },
    "title": "MacAskills Brook Falls",
    "trail_id": "12980"
}