{
    "description": "This is one of those places I always wondered if there was a fall.  I decided to visit this gorge that is super accessible via the hydro plant road.  As soon as you cross the brook, look for the guard rail which begins on the right hand side of the road.  As it starts, park there and make your way too the brook.  there are three main falls.  the first two you should be able to climb around as I did.  the last one is harder to get to but it is the highest of them all at about 45ft.  The walls of the gorge for the last 150ft before the falls are shear walls and you need to make your way to the base of the fall by walking in or on the side of the brook.  Alternatively, if you drive the dirt road all the way up the hill and park, you can actually see the tall fall through the trees but there is no way to get down to the base around there unless you would rappel down a great height.",
    "directions": "Cabot Trail towards Ingonish.  Turn on the Wreck Cove Rd (power plant).   Drive to the Y intersection and go left on the Y as if you go right the road ends at the power plant.  Cross the brook on the bridge and park before the road starts to go uphill.",
    "geohash": "f8m0",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/12997/reg_GOPR0002-2-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12997/reg_wreck-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12997/narrow_GOPR0003-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12997/narrow_wreck1-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/wreck-cove-brook-falls-near-ingonish-ns-12997",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "2 km",
        "Town": "Ingonish, NS",
        "Type": "out-and-back"
    },
    "title": "Wreck Cove Brook Falls",
    "trail_id": "12997"
}