{
    "description": "During the winter, I was looking over some google earth imagery when I spotted some massive white streaks on a tributary of Little River in Cape Breton.  I also spotted an individual page falls further upstream.  I bid my time all winter and finally in spring, I was able to explore these features.I started on the side of an abandoned home on the 90 degree turn of the Little River Rd.  My idea was to beat my way to the river.  However, within 100m I found myself on an established path.  I continued on this narrow path, down under the power lines and all the way too the tributary I wanted to follow.  The path seems to follow an old road on the side of Little River.As soon as I left the path, I started to go a bit uphill.  soon I was in front of the first fall..only about 10 ft.  Stay always on the right hand side of the gorge as you climb the ravine slopes...there are so many falls o ethos brook I stopped counting.  the pictures do not do it justice...my wide angle lens crushes the height of the falls.  After a while you finish seing falls and the forest becomes very thick...continue pushing for about 200m or follow my gps track to the magnificent top fall.   I actually then bushwhacked my way to the top of the Highlands and then came down the extremely steep slope along MacQueen Brook.  I will post this on another post (MacQueen Falls).  One way ascent on this was about 200m with 50m worth of descent.",
    "directions": "Cabot trail towards Ingonish.  Turn on Rear Little River Rd.  Park at 90 degree turn by the abandoned house.  Top fall of the post is at N46 26 32.2 W60 30 09.9.",
    "geohash": "f8kbp",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/12994/reg_littleriver8-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12994/reg_Screen-Shot-2018-05-14-at-7.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12994/reg_littleriver-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12994/reg_littleriver5-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12994/reg_littleriver6-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12994/reg_littleriver7-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12994/narrow_littleriver1-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12994/narrow_littleriver2-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12994/narrow_littleriver4-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/little-river-tributary-falls-near-ingonish-ns-12994",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 5,
        "Time": "3 hrs",
        "Total Distance": "6 km",
        "Town": "Ingonish, NS",
        "Type": "out-and-back"
    },
    "title": "Little River (tributary) Falls",
    "trail_id": "12994"
}