{
    "description": "Here is an easy exploration to a beautiful two tier falls of about 50ft in total.  The sand bank road gets smaller and becomes an ATV rail.  Park there and walk towards the shore.  Cross a small brook and beyond is a nice grassy area.  On the left of the grassy area is a path to the beach...this is the most difficult part...you loose over 75ft of elevation on a loose slope but there is a rope and lots of alders.  On the beach walk east about 700m to Andrews Brook.  The lower part of the fall hugs the rock wall and plunges into the Bay of funny at hight tide.  above this apron fall is a drop type fall of about 20ft.  Further east is McNeily Brook.  Looks like it has a single drop fall of about 35ft into the ocean.  I couldn't go there because of the high tide.",
    "directions": "From Highway 1 east of Middleton. Take Victoria Rd until it ends on highway 221.  turn right and immediately left on highway 362.  Go up N Mountain.  Go straight on Sand Banks Rd instead of continuing on highway 362.  After the 90 degree turn continue past last house on left and then park close to a steel gate.  The atv path is to the right of the gate...don't block the path or the gate when parking.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/12996/reg_GOPR0005-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12996/reg_vale5-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12996/narrow_vale1-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12996/narrow_vale3-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/andrews-brook-fall-near-middleton-ns-12996",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "1 km",
        "Town": "Middleton, NS",
        "Type": "out-and-back"
    },
    "title": "Andrews Brook Fall",
    "trail_id": "12996"
}