{
    "description": "This is a series of falls that are vastly unexplored in Cape Breton Island.  I was hiking for falls on nearby Little River.  I cut across the top of the Highlands to the headwaters of MacQueen Brook.  The terrain up there is no fun at all...its very thick and shrubbery but sometimes you get into an area where you can see 360 degrees around you.So from the top the brook looses elevation slowly until it gets to an area where it looses over 250ft of elevation in rapid succession of falls.  some have true drops while others hug the rock wall.  I mad my way down (up for you), on the northern side of the brook....the south side of the brook has a very steep slope and you cant easily access the base of some of the falls.Once down from the falls, I followed the brook as it exited the valley....Once there I passed under the power lines and then entered another forest and cut across it until I hit Rear Little River Rd and my parked car.   Falls are approximately at; 46°26'05.0\"N 60°29'42.8\"W",
    "directions": "Cabot trails toward Ingonish.  turn on Rear Little River Rd and park before then end and follow your gps to the falls.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/12998/narrow_macqueen-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12998/reg_Screen-Shot-2018-05-14-at-7.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12998/narrow_macqueen1-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12998/narrow_macqueen2-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/12998/narrow_macqueen4-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/macqueen-brook-falls-near-ingonish-ns-12998",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "5 km",
        "Town": "Ingonish, NS",
        "Type": "out-and-back"
    },
    "title": "MacQueen Brook Falls",
    "trail_id": "12998"
}