{
    "description": "The trail head is at the Eagle Ridge exit from the Upper Levels highway (99 before Horseshoe Bay),look for the sign just off of the parking lot (see photo).  This spot is about four hundred feet above sea level.  The first few hundred yards of trail is a singletrack trail which lasts only a 1/4 mile or so and then joins a firetrail/watershed access road. This section is within forest and parts are quite rocky, but easy to navigate since it is uphill. At the top of this hill, the trail takes a sharp right and heads into a well canopied section of forest, with a soft bark mulch forest floor and a few stream crossings. You emerge from the forest onto the first scree slope (Elev 2,000 ft) about half way to peak time. This is an open area of large rocks and boulders separated by sections of very steep switchback trail (see photos).  In numerous places the trail comes to rocks or trees growing around rocks where the step up in the trail is 2 feet or more.  On the way up there are absolutely spectacular views back over the Strait of Georgia and the Gulf Islands the best being at Eagle Bluff  (Elev 3,550 ft) you get an incredible sweeping view where you can see all the way from Mount Garibaldi in the north (near Whistler) out over the Sunshine Coast and the Gulf Islands, Vancouver Island and the entire Strait of Georgia, the Olympic Mountains in Washington state, Downtown Vancouver's skyline and finally Mount Baker with its classic volcano shape on the eastern skyline (see photo).  After Eagle Bluff, the trail enters high country evergreen forest, with a soft forest floor, winding around a number of pretty alpine lakes. This part of the trail is somewhat rolling, although there is in fact still a net elevation gain of 450 ft to the Black Mountain peak. There is often a lot of mud in this high country part of the trail in the summer with snow tending to stay in places well into July and August these past few years.*note time of 5 hours is round trip with experienced 5 year old hiker (estimate 4 hours if adult only)",
    "directions": "Starts at Cypress Bowl Ski area near N. Vancouver.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/13/3D_final99jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/13/3D_knee.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/13/long_PIC6.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/13/reg_IMG-3369-21374.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/13/reg_IMG-3388-21374.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/13/reg_IMG-3391-21374.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/13/reg_PIC3.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/13/reg_PIC7_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/13/reg_baden-powell-trail-21374.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/13/reg_image-43012.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/13/narrow_PIC1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/13/narrow_PIC4.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/black-mountain-eagle-ridge-e-cypress-provincial-park-near-vancouver-bc-13",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 4,
        "Time": "5 hrs",
        "Total Distance": "15 km",
        "Town": "Vancouver, BC",
        "Type": "out-and-back"
    },
    "title": "Black Mountain - Eagle Ridge E (Cypress Provincial Park)",
    "trail_id": "13"
}