{
    "description": "This is a hike which takes you on two different tributaries of the South Ingonish River.   The journey starts on a dirt road which has a metal gate.  There is a budhist camp about 1km down the dirt road so you may want to ask owners permission to use the old or alternatively follow the banks of the Ingonish River.  The second tributary you meet has no name but flows into the south Ingonish River approximately at;   46°36'54.0\"N 60°27'29.6\"W.  there is trail from the camp all the way to this tributary.  On the way there you will also pass a small brook which has a rail leading upstream to a series of falls.The furthest brook, unnamed, has no trails leading to the falls.  I chose to go on the right hand side of the brook to go upstream...however that option was not good as pretty soon I was on top of a massive cliff with the brook way down below and no way to come down. The plus side is that if you go that way after the sheer rock walls there are too smaller and scenic falls you can see.  Once you finnish these two falls, the tallest fall lies downstream (where the massive cliffs were located).  I was able to go down a steep scree slope from the top two falls all the way to the base of this 60-70ft fall.  Once I finished there, I noticed a tree downstream on top of a small 3m cliff which used to have rope attached to it.  I scrambled to the top of that cliff without rope using my bouldering skills and soon was making my way back to the outlet of the stream into the South Ingonish River.In order to see the massive fall, you will need to carefully make your way down either the scree slope or a 3m small drop which has some foot and hand holds to use.  Massive fall is about;  46°36'45.6\"N 60°27'35.9\"W.  You can see it in google earth...there are two more falls upstream of it and probably more falls further (1-2km) upstream.",
    "directions": "Cabot trail to Ingonish Beach.  Turn on Smokey Ridge Rd at 46°37'36.9\"N 60°25'58.8\"W.  Ask permission at camp to get on trail or follow closely the south Ingonish River.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/13000/reg_32293762-1102093619930481-215632711451148288-n-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13000/long_Screen-Shot-2018-05-14-at-7.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13000/reg_32266317-1102093533263823-6217894128026386432-n-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13000/reg_32286544-1102093509930492-1226100411526545408-n-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13000/reg_32293419-1102093566597153-5801109260376997888-n-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13000/reg_32293717-1102093493263827-6956445361237917696-n-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13000/narrow_32228778-1102093563263820-6347511473605967872-n-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/south-ingonish-tributary-fall-near-ingonish-ns-13000",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "7 km",
        "Town": "Ingonish, NS",
        "Type": "out-and-back"
    },
    "title": "South Ingonish Tributary Fall",
    "trail_id": "13000"
}