{
    "description": "This is not a typo...Its a 20km hike of which about only 5km is on a trail.  This leaves 15km of pure bushwhack where you will go up and down numerous ravines, cross rivers and brooks and attempt to see the many waterfalls on Warren Brook and on Roper Brook (tributary to Dundas Bk).The reason I put the two together is that once you finish visiting Warren Brook Falls, you are only about 2km from the start of the ravine of Roper Brook.  The trail straits at Warren Lake.  Take the trail on north side of lake until the bridge over Warren Brook.  Cross the bridge and then enter the forest ...following Warren Brook for about 2.5km.  At this point the ravine closes off and there are multiple falls and cascades with some boulders big as houses.  At this point, I would suggest to cross the river and be on the north side.  If you do that then you will be able to stand at foot of first large fall.  A good 45ft drop framed on each side by seer rock walls.Get above this falls and you will see (not very clearly) another slider fall above...then a bit further upstream you can  recross brook to south side in front of a 20ft fall.  Above that fall is the jewel of the stem...Its a noble fall.  A rock island separates the two 40ft plus waterfalls.Once you finish there, you can head up towards Roper Brook by going southeast up a small hill and then down the next ravine to Roper Brook.  soon the valley get narrow and the stream emerges fro ma canyon.  The lower part of the canyon has lots of falls of no more than 25ft or so....the best part is yet to come....Climb as best as you can following the brook.  At some point get on the north side of the ravine or if its summer just get wet and continue in the ravine.  Rocks walls get elevated all around you until you may be able to reach the tallest fall in the system..a true drop of over 60 ft.  From there, on the left side is a scree slope.  I couldn't go that way on that day because water was too high.  I stayed on the north side of the brook and climbed a lot of elevation.  I reached a very nice 40ft or more cascading fall.  I was able to downclimb to its base.  From there I crossed the brook and went downstream to see a 40ft drop.  The river then turned again for the last drop...I couldn't get to the base of that fall (thats the one I mentioned which has the scree slope on one side).  I went back up to the cascading fall and on a hunch went a bit more upstream and was rewarded by a final fall of 50ft plus which seems to come from the top of the highlands.  You cannot see anything else higher than the top of the fall..very neat!On my way back, I followed roper Brook as it flowed into a small ravine and then into Dundas Brook.  I followed Dundas for a few km until my gps was pointing towards the bridge of Warren Lake trail.  From Dundas to Warren Lake bridge, I went over a small hill.  All in all to to this you need to have stamina, food, bouldering skills and a bit of craziness like me! Total ascent was 720m (2300ft) and total descent was at 670m.  Left at 8am and returned around 115pm.",
    "directions": "Go to the Cape Breton Highlands National Park and get to the Warren Lake trail.  top fall on Warren Brook is at 46°43'24.3\"N 60°26'48.8\"W;  and top fall on Roper Brook is at;  46°43'07.4\"N 60°28'31.2\"W",
    "geohash": "f8",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/13001/reg_32293913-1102619933211183-4746451311807954944-n-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13001/reg_31648718-1102619583211218-3332318516257751040-n-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13001/reg_32281386-1102619776544532-4918031995402977280-n-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13001/reg_32349977-1102619733211203-3363738422526083072-n-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13001/reg_Screen-Shot-2018-05-14-at-7.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13001/narrow_32293502-1102619833211193-5012945313741144064-n-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13001/narrow_32294261-1102619903211186-3795110721394573312-n-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13001/narrow_32337029-1102619509877892-2882415757084327936-n-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13001/narrow_32405667-1102619876544522-1579600623991521280-n-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/warren-brook-and-roper-brook-falls-near-ingonish-ns-13001",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 5,
        "Time": "6 hrs",
        "Total Distance": "20 km",
        "Town": "Ingonish, NS",
        "Type": "out-and-back"
    },
    "title": "Warren Brook and Roper Brook Falls",
    "trail_id": "13001"
}