{
    "description": "Completed on June 3, 2018Edwards Rating: II (III) M M6.5 to 9 hoursElevation of 1157 m NET, 1232 m TOT & max 2633 mGear: Poles, GPS device and/or compass, helmet, ice axe/crampons if early-late trip*****This is a very nice scramble with a direct approach in a nice valley, great hands-on on the NE ridge, some exposure before the summit and easy and quick descent option down the east face. Definitely recommended!IMPORTANT: Look at my pictures and description below as we did some unnecessary bushwhacking after reading some probably older trip reports and Nugara?s book.We started on gunnery creek trail for a few kilometers and went up that clearing to the pass. This is where we messed up by going back down as there is now an excellent trail on the left side (recent yellow flags and chopped bark on trees). Turn left (GR704878) and follow these yellow flags until you reach the first rubble slope with open views on the ascent and descent routes. From there, follow the trail and start going down the drainage aiming for the second obvious rock band on the steep grassy slope on other side. We hiked up over that second band (GR691886) all the way to the beginning of that ridge. From there, we stayed on the ridge almost 100% of the time for some fun hands-on scrambling all the way to the summit ridge. One exception was a higher rock band where I walked down about 10 metres to find a weakness on my right and go back up to the ridge line in a rubbly section of the ridge. We turned left and followed the last section of that enjoyable ridge walk with a more exposed section in the middle where it drops on both sides. With the strong winds at this point, we almost crawled over that section to be safe. The very last section seems exposed and intimidating at first but solid blocks and holds makes it very interesting and not too difficult to scramble up.For the descent, we followed a faint trail straight down the east face from the summit, sidesloped under a snow patch going right for a while to avoid some cliffs below us. Once easier, we scrambled down and started following a trail with some good scree from time to time. At about the middle of the slope, we crossed a nice waterfall and kept going down on the left side of it using 3 good snow patches glissading down making sure to look out for the several rock bands along the way. At the bottom of the waterfall where we got cliffed out, we found a nice faint trail to the left on steep terrain. We went down and across the initial drainage seeing the obvious trail in the first rubble slope we came across earlier. We gained back some elevation to make sure we get on that trail and followed a very good trail with yellow flags all the way back to the pass and the valley. Someone had chopped down so many healthy trees on the side of the trail and also chopped the bark on both sides of many other trees. Unnecessary in my opinion, the yellow flags are good enough.",
    "directions": "From Calgary, follow Trans-Canada Highway/AB-1 W, take exit 161A for AB-22 S toward Bragg Creek/Redwood Meadows and go south for about 88 km following directions to stay on AB-22 S. Just before Longview, turn right onto Highway 541 for 38.8 km where we parked on the left side of the road right in front of Gunnery Creek trailhead (GR709852).",
    "geohash": "c2y",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/13009/long_Holy-Cross-Mountain-Kananaskis-Some-Fun-Scrambling-Nice-Shot-Jun-3-2018-1024x632--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13009/long_Holy-Cross-Mountain-Kananaskis-Summit-Panorama-Jun-3-2018-3-1024x235--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13009/reg_Holy-Cross-Mountain-Kananaskis-Glissading-Down-East-Face-Jun-3-2018-2-1024x976--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13009/reg_Holy-Cross-Mountain-Kananaskis-Path-from-Rubble-Slope-Jun-3-2018-1024x659--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13009/reg_Image-1-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13009/reg_View-Holy-Cross-from-Gunnery-Mountain-on-Dec-26-2016-1024x709--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13009/narrow_Holy-Cross-Mountain-Kananaskis-Boiling-Rock-Superb-Jun-3-2018-768x1024--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13009/narrow_Holy-Cross-Mountain-Kananaskis-Endless-Waterfall-East-Face-Jun-3-2018-4-768x1024--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13009/narrow_Holy-Cross-Mountain-Kananaskis-To-More-Exposed-Terrain-Summit-in-View-Route-Jun-3-2018-744x1024--44639_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13009/narrow_Holy-Cross-Mountain-Kananaskis-Trail-Seen-from-Cliff-Jun-3-2018-768x1024--44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/holy-cross-mountain-near-longview-ab-13009",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 5,
        "Time": "8 hrs",
        "Total Distance": "14 km",
        "Town": "Longview, AB",
        "Type": "out-and-back"
    },
    "title": "Holy Cross Mountain",
    "trail_id": "13009"
}