{
    "description": "One of the most recognizable peaks on the western skyline as seen from Calgary. This adventure has it all; a stunning ridge walk, interesting rock formations and fun scrambling.  The majority of the trail is a long hike along Bastion Ridge. Once reached, the cliffs can be followed around (helmet recommended) to the south gullies where you start your scrambling ascent. The scrambling in the gully is straightforward but the rock is loose and route finding is required. Stay in the main gully until you head climber's right through the \"devil horns.\" The crux gully then comes into view. Technically not scrambling, the crux is rated as low fifth. At one point at least, a ladder has been placed at the crux, it is not very sturdy and seemed to be more hazardous than helpful, others may disagree. The crux is overhanging but not too difficult, my husband did it with relative ease, however, I am under 5'3\" and found it to be a bit awkward. There is a bolted rap station at the top of the crux. Rappelling the way down is the safest way to go. It would have been terrifying and probably quite dangerous without a rope to get back down. After the crux, it is fun scrambling to the top. Mostly 3rd class, maybe some 4th but never overly exposed. Descend the way you came. Travel with caution in the gullies in case a group is coming up below you. The rock is extremely rotten and doesn't see enough traffic to clean the route.",
    "directions": "Take highway 1A west for about 13.5 km and then turn North onto to the Forestry Trunk Road which also called Highway 40 and Secondary Road 940. Follow it for about 22.7 km to a gated gravel road on the West side. The road is about 100 ? 200 m past a major curve to the North and the turn off for Richards Road. The road has a large gate made from metal pipe and it is on the South side of the Bar Cee Ranch. Stay on the main road for about 16.5 km to the Big Hill. The road down the hill is steep and can be heavily rutted and covered with large rounded river bed rock, 4 x 4 is recommended past this point. Follow the 4x4 road to marker 39. Vehicle travel past marker 39 is prohibited.",
    "geohash": "c3n",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/13003/reg_20170902-113509-50330.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/devils-head-near-ghost-lake-ab-13003",
    "stats": {
        "Activities": "hike climb",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 5,
        "Time": "12 hrs",
        "Total Distance": "21 km",
        "Town": "Ghost Lake, AB",
        "Type": "out-and-back"
    },
    "title": "Devil's Head",
    "trail_id": "13003"
}