{
    "description": "The Mackenzie River is one of the main rivers located in the Cape Breton highlands National Park.  It exits the mountains near Pleasant Bay.  As you drive from Cheticamp to Pleasant Bay, you catch some glimpses of this wonderful gorge from the Cabot Trail itself.  Of course, such a large gorge will probably contain waterfalls.  As of the moment, I couldn?t  any details of waterfalls explored in this system.  Within a few kilometres of the exit of this river into the gulf of St Lawrence, you can spot some falls on sat imagery but it would be a full day expedition to get there.I didn?t have this amount of time in early June 2018 so I decided to explore something a bit closer to a road.  I woke up at 5am and drove to the Benjies Lake trail parking lot.  Started the trail down to Benjies Lake and where it turns sharply to the right, I continued straight on an abandoned trail.  It did not take very long that this trail ended and I entered an area which had a small brook to cross and lots of alders to whip you in the face.I had mapped out a route to a tributary of MacKenzie River which looked like a gorge.   I had mapped the route with satellite imagery to avoid the very thick forest (tuck) and use the open bog areas as much as I could.  On my way there, I made a few wrong turns and soon was in very thick tuck.  This forest is so dense it is almost impossible to bushwack through.  I persevered and soon found my way through bogs and as I approached the tributary, the forest finally opened up and I could easily walk.  I found a lot of moose track that went in the general direction I wanted and I followed those.Soon I was on the edge of a ravine.  I made my way down and was immediately upstream of a 30ft fall.  I crossed the stream and made my way on a narrow ledge in front of the first fall.  The second and largest fall was just below but I couldn?t see it.  I then went up the hill to go around some steep scree and descended to the front of the 90ft fall.  Unfortunately, it was raining and I had to get back to work so I only spent a few minute at the base.  The forest in the ravine is a wonderful deciduous, mature forest.  I was at the bottom of the fall by about 635am so it took me around 75 minutes to get there.  On the way back, I chose some better routing and was back in my truck in about 40minutes.  All in all, a great place to explore?a bit but not too much remote.  Navigational skills are required, map, compass?all that good stuff!",
    "directions": "Cabot Trail from Cheticamp.  Park at Benjies Lake Trailhead; N46° 44' 46.0\" W60° 49' 18.0\".  Fall and ravine are approximately at; N46° 45' 15.2\" W60° 47' 20.0\".",
    "geohash": "f8k",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/13015/narrow_35228490-1121374621335714-1577400226346434560-n-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13015/reg_35168721-1121374801335696-6808467872281526272-n-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13015/reg_35239698-1121373758002467-4893371693348683776-n-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13015/narrow_35243334-1121374688002374-9119250480432676864-n-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mackenzie-river-benjies-lake-area-fall-near-cheticamp-ns-13015",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 5,
        "Time": "2 hrs",
        "Total Distance": "7 km",
        "Town": "Cheticamp, NS",
        "Type": "out-and-back"
    },
    "title": "MacKenzie River (Benjies Lake area) Fall",
    "trail_id": "13015"
}