{
    "description": "Day one: start in the afternoon from Johns Brook Lodge trailhead (Garden parking lot) and hike easy 8 km in to Lower Wolf Jaw; overnight at Lower Wolf Jaw lean-to.Day two: start early for a difficult 8 km across Armstrong, Gothics, Saddleback and Basin peaks; overnight at Slant Rock lean-to.Day three: summit Mt Marcy and then return by relatively flat and leisurely 16 km jaunt.Be sure to bring water or a filter. There is not much in the way of water between Armstrong and Slant Rock.",
    "directions": "Directions to the Garden parking lot at the Johns Brook Lodge trailhead:From the North or South to Keene Valley: Take the Adirondack Northway (I-87) to Exit 30. Turn north on Route 73 and proceed 12 miles to Keene Valley.From the West to Keene Valley: Take Route 3 or Route 86 to Saranac Lake. Continue on Route 86 through Lake Placid. At the third traffic light, turn right onto Route 73. Proceed through Keene to Keene Valley.From Keene Valley to the Garden Parking Lot: Look for High Peaks Trailhead sign (next to the AuSable Inn). Turn onto Adirondack Street. At 0.6 miles the road turns right, crossing Johns Brook on an iron bridge. Continue uphill following signs to the Garden. The pavement ends as the road approaches the Garden parking area. From the trail register, it is a 3.5-mile hike to Johns Brook Lodge.The Garden Parking Lot is operated by the Town of Keene. Parking is limited and there is a daily parking fee in season ($7 a day in 2016)",
    "geohash": null,
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/NY/13010/reg_IMG-4406-61593.jpg",
        "https://trailpeak.com/storage//content/trails/US/NY/13010/narrow_IMG-4399-61593.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mt-marcy-near-keene-ny-13010",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 4,
        "Time": "14 hrs",
        "Total Distance": "32 km",
        "Town": "Keene, NY",
        "Type": "out-and-back"
    },
    "title": "Mt Marcy",
    "trail_id": "13010"
}