{
    "description": "Completed on June 16, 2018. Lots of snow after the pass and snow patches on Mount Field.Edwards Rating: II (III) M L6 to 10 hours up to Mount Field summitBurgess Pass: Elevation gain 947 m total & 7.04 km one-way.Mount Field: Elevation gain of 1371 m NET, 1499 TOT & max elevation 2643 m.Gear: Poles, helmet, ice axe/microspikes if early-late trip (lots of avalanche debris, not recommended if too much snow)*****The views are worth the effort but this is physically demanding and technically easy-moderate because of the climb up the highest rock band (considered easy in Alan Kane?s book). Be aware that we missed the trail close to Burgess Pass because of the snow at the pile of deadfalls (trail goes left and we turned right). We also tried a few different ways up the summit block but quickly realized the soft snow and loose rocks made it too difficult.The parking lot is not obvious to see from the road so start your odometer for 1.4 km from Parks Canada building in Field and you?ll get there easily. Following the Burgess Pass trail for 600 m (GR355945), we turned right at the intersection and kept going up to the col where we enjoyed incredible views of the valley on the other side with Mount Carnarvon, The President, Michael Peak as well as the impressive Wapta Mountain (on the same ridge than Mount Field). We turned right on the col and got to Burgess Pass. We kept going following the indications for Yoho Pass where there was still a lot of snow. Just passed the Burgess shale sign, we turned right and started going towards Mount Field summit block. We tried a few different routes but the snow and rock were terrible so the very best way to do it was to go directly to the SW ridge and go up more stable scree-shale, some rock bands and tremendous views of Mount Stephen and higher up Cathedral Mountain. Once at the rock band, the weakness is right along the ridge. There is a 3 sections hands-on scramble with good holds. The second one can be trickier to down-climb for some but again, holds are obvious and solid. Once up that band, we kept going straight up on the boulders to reach the summit. The views are just stunning up there, very rewarding after that distance and elevation gain. Going down the SW ridge we were looking for scree for an easier descent. There was some decent scree but nothing exceptional and the snow patches were too soft for a glissade.",
    "directions": "From Field, take the Trans-Canada Highway East for 1.4 km where you'll have a gravel road on your left. At the junction, turn left to get to the trailhead parking lot (GR359949).",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/13014/long_Burgess-Pass-Yoho-At-the-Pass-Jun-16-2018-1024x312--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/13014/long_Mount-Field-Yoho-Summit-Panorama-View-Stephen-Burgess-Carnarvon-The-President-Wapta-Stunning-Jun-16-2018-1024x292--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/13014/reg_Burgess-Pass-Yoho-View-Wapta-Mnt-from-Pass-Jun-16-2018-1024x869--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/13014/reg_Mount-Field-Yoho-Crux-Hands-on-Jun-16-2018-4-1024x816--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/13014/reg_Mount-Field-Yoho-Glacier-on-Mt-Stephen-Jun-16-2018-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/13014/reg_Mount-Field-Yoho-View-Route-Jun-16-2018-1024x714--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/13014/narrow_Burgess-Pass-Yoho-View-Walcott-Peak-from-Col-Jun-16-2018-730x1024--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/13014/narrow_Mount-Field-Yoho-Crux-Hands-on-Jun-16-2018-3-768x1024--44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/burgess-pass-to-mount-field-near-field-bc-13014",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 4,
        "Time": "8 hrs",
        "Total Distance": "19 km",
        "Town": "Field, BC",
        "Type": "out-and-back"
    },
    "title": "Burgess Pass to Mount Field",
    "trail_id": "13014"
}