{
    "description": "Completed on July 1, 2018. Snow patches on Howard Douglas but not a problem at all but a great opportunity to avoid scree-rubble and save our knees on the descent.Edwards Rating: II (III) M L7.5 to 11 hours (probably 4-6 for Eagle Mtn alone & 5-8 for Howard Douglas alone)Elevation of 1212 m NET, 1797 m TOT & max 2877 m (For Howard Douglas, 2775 m for Eagle Mnt)Mount Howard Douglas alone: About 1250 m elevation gain total & 16 km returnEagle Mountain alone: About 1150 m elevation gain total & 12 km returnGear: Poles & helmet a must here.*****Bagging those two peaks makes it for a challenging day in terms of total elevation gain. Even though the technical scrambling is minimal (crux behind summit block of Howard Douglas-HD), I thought it was sometimes mildly exposed to rock or cliff bands but bad weather might have made me feel like it was more difficult than it actually is: Hail, heavy snow at one point and heavy rain. The views are tremendous on Eagle Mountain but summit of HD was completed in clouds and a whiteout that followed. It is worth a visit, Eagle alone would be a quick uneventful and easy ascent but with rewarding views. Route finding might be challenging if not having much experience as there?s no trail and very few cairns overall, but any experienced scramblers will have no issue scrambling up the rock bands and around-back the summit block.From the Sunshine Village parking lot, we hiked up the ski-out road for about 3.5 km to Goat?s Eye Station. We then followed the lower ski runs connector heading south until it turned SE at the last ski run. We found a faint trail on our right (GR867601) and went down to the creek, crossed it and followed the drainage up to the cirque where it opened up on Howard Douglas. We started going up in the bowl using snow patches to avoid rubbles and scree. We got to the first rock band and scrambled up to the right side of the black rocks (GR881599) for some easy scrambling. We kept going up trying to use solid rocks when possible but scree-rubble was inevitable. We reached the left side (north end) of the summit block and saw the opening to scramble up the scree ledge (GR885600). I continued alone from that point and followed the scree ledge under the summit block to turn left at the end of the band. I scrambled up scree and rubble, passed an interesting cave and reached the ridgeline. I turned left and went back up along the summit block a few minutes and reached the north side. It seemed like a possible route but with the snow and wet rock, a fall there would be fatal with a vertical gully down there. I turned back and realized that a trail was going up straight to the summit cairn involving 3 moves of climbing. After that climb, I reach the summit in no time (GR885601). Going down the same way in a whiteout was not fun but surprisingly quick. I met my partner waiting at the scree ledge and we descended first on our right and then traversed to the left going after some good scree for a quick descent to the boulder field towards Eagle Mountain on our right. We crossed the boulders to reach the forest as soon as possible. We headed up directly towards Eagle Mountain and saw a great drainage with white rock bands and slabs for some easy and fun scrambling looking to attain the left end (west) of a cliff band. Once around and over that cliff, we painfully scrambled up the last rubble slope straight to the summit (GR878614).Going down Eagle Mountain, we headed west and then straight down to the chairlift and then down the closest ski run that brought us back to Goat?s Eye Station, and down the road to the parking lot. Looking at the overall trip the route is quite obvious but don?t expect official trails up there.",
    "directions": "Follow indications to the Sunshine Village Ski Resort parking lot.",
    "geohash": "c3jd",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/13024/long_Eagle-Mountain-Banff-Summit-Panorama-View-Bourgeau-Sundance-Fatigue-Jul-1-2018-1024x259--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13024/long_Mount-Howard-Douglas-Banff-Down-in-the-Snow-Jul-1-2018-1024x430--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13024/long_Mount-Howard-Douglas-Banff-Summit-Panorama-Whiteout-Coming-Jul-1-2018-1024x232--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13024/long_Mount-Howard-Douglas-Eagle-Mountain-Banff-Jul-1-2018-14-1024x563--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13024/long_Mount-Howard-Douglas-Eagle-Mountain-Banff-View-Route-Jul-1-2018-1024x424--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13024/reg_Eagle-Mountain-Banff-Summit-View-Howard-Douglas-Assiniboine-in-the-Clouds-Jul-1-2018-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13024/reg_Mount-Howard-Douglas-Banff-Route-Jul-1-2018-1024x746--44639_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13024/narrow_Eagle-Mountain-Banff-Great-Slab-Rock-Bands-Scrambling-Jul-1-2018-2-768x1024--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13024/narrow_Mount-Howard-Douglas-Banff-Crux-Jul-1-2018-768x1024--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13024/narrow_Mount-Howard-Douglas-Banff-Nice-Cave-by-the-Ridgeline-Jul-1-2018-768x1024--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13024/narrow_Mount-Howard-Douglas-Banff-Rock-Band-Easy-Scrambling-Jul-1-2018-2-768x1024--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13024/narrow_Mount-Howard-Douglas-Banff-Unstable-Rocks-and-Some-Exposure-Jul-1-2018-768x1024--44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mount-howard-douglas-eagle-mountain-loop-near-banff-ab-13024",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 4,
        "Time": "9 hrs",
        "Total Distance": "18 km",
        "Town": "Banff, AB",
        "Type": "out-and-back"
    },
    "title": "Mount Howard Douglas & Eagle Mountain Loop",
    "trail_id": "13024"
}