{
    "description": "You'll walk on that ATV road for 650m to a junction. Take a left on continue 500m to another junction. Take a left again, after 500m, you'll see a junction to your right, don't take it and continue straight ahead for 250m to a junction. Take a right this time for 600m and you'll see another junction, continue straight ahead for 150m. This is where I started my bushwhack at 47.191982 and -71.667635. You'll have to bushwhack for around 350m to the summit at 47.19004 and -71.68006.",
    "directions": "This mountain is a little bit complicated for access. One needs to get a key to unlock a gate to get to the trailhead. To get the key, you need to call Secteur Tourilli at 418-843-9355 to reserve a fishing or a hunting day on one of their lakes. Secteur Tourilli is a part of the Réserve faunique des Laurentides that is run by the Huron-Wendat nation of Wendake. The HP is not on Secteur Tourilli property but on the ZEC Batiscan-Neilson. To get to the secteur Tourilli, you need to drive through that section of the ZEC Batiscan-Neilson. It will cost you around 40$ for a day of fishing, so if you are in the mood, do the HP and continue on to Secteur Tourilli for a day of fishing! Once you make your reservation, your name will be in the books at the dépanneur Alimentation Duplain next to Esso station at 710, Cote Joyeuse in St-Raymond-de-Portneuf. You'll get the key there.But first, you need to get to St-Raymond-de-Portneuf between Trois-Rivières and Québec City. There is multiple ways to get there, I took exit 281 from highway 40 on route 365 to the north. It leads directly to St-Raymond. Route 365 is called Grand Rang and then Cote Joyeuse once arriving in St-Raymond. Stop at Alimentation Duplain to get the key, and then continue on route 365 (Cote Joyeuse) for 2 km. Stay straight ahead, the route changes name to route 367, you cross the river to the first street to your right on rue Monseigneur-Vachon. Take rue Monseigneur-Vachon which changes name to Rang du Nord for around 16 km to a bridge where there is a gate. Unlock the gate and lock it behind you, and then continue on the main good gravel road always following the directions for Secteur Tourilli for around 27 km for the TH at 47.201271 and -71.691360. You can park at the side of the road and you'll see an ATV road.",
    "photos": [],
    "source_url": "https://trailpeak.com/trails/mont-du-lac-chezine-near-saint-raymond-pq-13027",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "3 km",
        "Town": "Saint-Raymond, PQ",
        "Type": "out-and-back"
    },
    "title": "Mont du Lac Chezine",
    "trail_id": "13027"
}