{
    "description": "*** LOOK AT THE BUS SCHEDULE TO RESERVE YOUR SEATS WELL IN ADVANCE ON PARKS CANADA WEBSITE OR ADD AN EXTRA 11 KM WALK (ONE WAY) TO GET TO THE TRAILHEAD. BUS MOST LIKELY AVAILABLE ON THE WAY DOWN FOR $10/PERSON.*** Bus available from June 16 till October 1 for $15/person (round-trip, as of 2017). Make sure to be there earlier and bring cash.Completed on July 7, 2018, some snow patches but mostly clear/dry despite the bad weather.Edwards Rating: II (III) M S4 to 6 hours (Add 20 minutes return when starting from Le Relais & an extra 4-5 hours return and 22 km if you?re not taking the bus)Elevation of 877 m NET, 896 m TOT & max 2928 m (from Elizabeth Parker Hut)Gear: Poles, microspikes might be useful, ice axe and crampons if more snow. Bug spray was the most essential thing at that time of the year?!*****We always get terrible weather in this area but it?s still worth it as the views are always spectacular even though the sky is rarely entirely clear. The scrambling section is very interesting and somewhat exposed, requiring a bit of route finding even though a ton of cairns well located can help less experienced scramblers. We decided to stay closed to the cliff where we found that rocks and ledges were solid to go up safely in not so good conditions. Take your time to analyse the route from the hut (see picture).We started from the Elizabeth Parker ACC hut where we had spent the night and followed directions to Odaray Highline and Grandview hikes. After a couple of right turns, the third one lead to a sign where we had to register (Parks Canada controlling everything here). Having the mountain to ourselves as it was pouring rain, we quickly attained the end of Highline trail and turned left to go up to Grandview. Then we turned left again aiming for what seemed to be a steep and exposed section at first with a cliff on our right and hanging over another cliff band leading to a wide plateau on our left. Once we reached that scrambling section, we realized rock was good, scree quite stable with a system of ledges to scramble up quite easily. We stayed closer to the right cliff following cairns when it made sense in these wet conditions. We came across a couple of hands-on sections and finally reached the ridge. We climbed up the snow slope as this section was not exposed and stable (seemed to be an accumulation over a scree slope). Once on the summit ridge, we turned right and followed it to the summit (GR434891) making sure to stay away from the cornice. A scary rock avalanche was triggered under the true summit, sounding like this mountain would collapse but fortunately we were not in the way. Going down was much easier for some reasons even though snow and hail started and we used a couple of safe snow patches for an easier and quicker descent back to the official trail. This scramble is probably moderate technically and a lot of fun, totally worth it and I am sure the views would be amazing on a clear day.",
    "directions": "From Lake Louise, continue onto Trans-Canada Hwy going slightly left to BC. About 10 km later, you will see an obvious sign for Lake O?Hara, turn left. The parking is going to be on your right after the railroad.",
    "geohash": "c3j",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/13029/long_Little-Odaray-Lake-O-Hara-Yoho-Ridge-Cornice-Lake-O-Hara-McArthur-Jul-7-2018-1024x264--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/13029/long_Little-Odaray-Lake-O-Hara-Yoho-Route-Seen-From-Hut-Jul-7-2018-1024x596--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/13029/long_Little-Odaray-Lake-O-Hara-Yoho-Summit-Panorama-in-the-Clouds-Lake-McArthur-Visible-Jul-7-2018-1024x238--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/13029/long_Odaray-Grandview-Lake-O-Hara-Yoho-Lake-O-Hara-to-McArthur-Superb-Jul-7-2018-1024x436--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/13029/long_Odaray-Highline-Lake-O-Hara-Yoho-Wiwaxy-Schaffer-Behind-Jul-7-2018-1024x313--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/13029/reg_Little-Odaray-Lake-O-Hara-Yoho-Closer-View-Route-Jul-7-2018-1024x679--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/13029/reg_Little-Odaray-Lake-O-Hara-Yoho-Crux-Hands-on-Some-Exposure-Jul-7-2018-2-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/13029/reg_Little-Odaray-Lake-O-Hara-Yoho-Crux-Hands-on-Some-Exposure-Schaffer-Lake-Below-Jul-7-2018-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/13029/reg_Little-Odaray-Lake-O-Hara-Yoho-Lake-O-Hara-Mary-Schaffer-Jul-7-2018-1024x768--44639_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/13029/reg_Little-Odaray-Lake-O-Hara-Yoho-Scary-Noise-from-Rock-Avalanche-While-on-Summit-Jul-7-2018-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/13029/narrow_Little-Odaray-Lake-O-Hara-Yoho-Ridge-Cornice-Glissade-in-Safe-Spot-Jul-7-2018-2-768x1024--44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/little-odaray-walter-feuz-peak-from-odaray-highline-and-grandview-near-field-bc-13029",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 5,
        "Time": "5 hrs",
        "Total Distance": "10 km",
        "Town": "Field, BC",
        "Type": "out-and-back"
    },
    "title": "Little Odaray (Walter Feuz Peak) from Odaray Highline and Grandview",
    "trail_id": "13029"
}