{
    "description": "After exploring for a while in NS...the opportunities to see significant falls diminishes a bit and you have to bushwack farther into the woods.  The Antigonish highlands have revealed quite a few falls over the years (Cuties, Bear Brook, Brown Mtn, Brierly etc) but I know there are more out there!I decided to check out a smaller tributary of James river that had nice contour lines indicating a drop.   I set off from a logging road on my mtn bike and was immediately into the James River watershed protected area.  I followed the ATV track for a while going uphill and through a mature hardwood forest.  After biking about 1.5km, an older track appeared to the left (N45° 36' 11.3\" W62° 09' 52.5\").  This track is overgrown so ditch the bike and follow it until it ends in a large cleared area N45° 36' 13.0\" W62° 08' 40.5\". Then bushwack your way through a mixed forest towards the fall located at N45° 36' 19.5\" W62° 07' 55.1\".  Its a nice two tier of about 40ft in total.  On one side its framed by a rock wall covered by ferns.   It doesn't have a lot of water so only go after a rainfall.  I decided to follow the brook downstream and then go back towards my bike by following another branch of the brook.  Unfortunately I didn't see any more falls on that route and was eaten alive by mosquitoes as my bug juice wore off!",
    "directions": "Highway 104.  in Marshy Hope, take the Strathglass road, the road is a dirt road but well maintained.  Same road to take to Cuties Hollow btw.   After about 3.3km turn right on secondary logging road and drive 1.5km.  The ATV path should appear on your left at N45° 36' 11.3\" W62° 09' 52.5\".",
    "geohash": "f85g",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/13031/narrow_36536664-1139901576149685-1004672904429830144-n-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13031/long_36494260-1139737532832756-8511915471686074368-n-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13031/narrow_36442637-1139901609483015-7207674413745963008-n-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/james-river-tributary-fall-near-antigonish-ns-13031",
    "stats": {
        "Activities": "snowshoe hike mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "11 km",
        "Town": "Antigonish, NS",
        "Type": "out-and-back"
    },
    "title": "James River Tributary Fall",
    "trail_id": "13031"
}