{
    "description": "The Bass river of five Islands was one of the first brooks I explored for falls a while ago.  The main reason is that there are two falls on the 1:50 000 topo maps.  I visited those and put up a post on trailpeak. Fast forward a decade and now satellite imagery is getting very precise.  I noticed some white spots downstream of the falls I had already been to.  so of course I decided to check those out.  The descent into the ravine is moderate and you can follow a secondary stream which has a 15ft drop.  Once you reach the river, you can either follow it and sometimes get a bit wet or stay on the slope.    The first white spot was just large rapids but the next one at N45° 27' 24.1\" W64° 02' 45.7\" had a nice 1ft drop.  Further upstream was another white spot but again just rapids.  finally i reached the best part of the whole river ...a large fall located at; N45° 27' 41.9\" W64° 02' 46.0\".  Its the nicest and tallest of all the falls on this river and for a strange reason its not the ones mapped out on the topo maps!  I ended the hike by going back to one of the marked falls which I had been previously and then bushwacked my way to my car.",
    "directions": "Highway 2 in Five Islands.  Take New Britain Rd and turn left on secondary road at; N45° 27' 04.5\" W64° 02' 04.4\".  Drive 600m or so and park.  Bushwack west to the ravine...",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/13034/reg_36512426-1140975976042245-7851074511985180672-n-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13034/reg_36585188-1140975956042247-6003184847428780032-n-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13034/reg_36591847-1140975989375577-1200961001575415808-n-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/lower-bass-river-of-five-islands-falls-near-parrsboro-ns-13034",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "5 km",
        "Town": "Parrsboro, NS",
        "Type": "out-and-back"
    },
    "title": "Lower Bass River of Five Islands Falls",
    "trail_id": "13034"
}