{
    "description": "Completed on July 8, 2018 in dry conditions with a few helpful snow patches.Edwards Rating: II (II) S S3.5 to 6 hoursElevation of 788 m NET, 797 m TOT & max 2731 mGear: Poles, GPS device, bug repellent a MUST at this time of the year.*****This is a tremendous short scramble with decent scrambling through rock bands (but avoidable) and stunning views of Dolomite Peak, Crowfoot Mountain, Bow Lake, Bow Glacier, Iceberg Lake, etc. This peak is not official but got this name from its closest neighbour Mount Jimmy Simpson. Route finding skills required while bushwhacking through light forest using several faint trails. Don?t try to look for a trail here, use whatever seems easier for you.From Bow Glacier Falls trailhead, we walked about 700 metres looking for a faint trail on our right. As soon as we saw one (GR363251) that was in line with our objective we started bushwhacking up using many faint trails and missing that easier ascent up a gully (we used it on the way down). As long as you go up north, you?ll get there but a GPS could be useful if you?re not used to bushwhacking and route finding. Once out the treeline, we decided to go straight up even though most parties seem to go left and along the ridge. We did that to use very nice rock bands for some fun easy scrambling. There?s a huge cave at some point in the middle of the slope where we passed to its right and kept going straight up. Once at the summit block, we went up this obvious chimney in the middle and got to the summit (GR347261) on our right immediately. The views are just spectacular and we were lucky enough to have a tremendous sunny day with no wind so we stayed longer than expected taking this all in. We went down SW towards Bow Glacier to make sure we get the best views all the way down this ridge. Longer but so much nicer with a beautiful tarn between Junior and Mount Jimmy Simpson and a long and impressive waterfall. We also used a long snow patch for the best glissade ever as it was safe and steep so we saved a few minutes there while having a blast! Once down a plateau, we scrambled down a grey rock band for some moderate scrambling but totally avoidable by going back a few steps and down to the forest from there. We were lucky enough this time to find that gully (GR357257) and went back down to Bow Lake using faint trails again.",
    "directions": "From Lake Louise, continue onto Trans-Canada Hwy for about 2.3 km and take the Alberta 93 exit toward Jasper. Continue for approx. 36 km and turn left just after Bow Lake. Park just before Simpson's Num-Ti-Jah Lodge. The trailhead is passed the lodge.",
    "geohash": "c3j",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/13030/long_Jimmy-Simpson-Junior-Banff-Marry-Scrambling-Down-View-Bow-Glacier-Superb-Jul-8-2018-1024x571--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13030/long_Jimmy-Simpson-Junior-Banff-Summit-Dolomite-to-Bow-Glacier-Stunning-Jul-8-2018-1024x530--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13030/long_Jimmy-Simpson-Junior-Banff-Superb-View-Bow-Iceberg-Lakes-Crowfoot-Bow-Glaciers-Jul-8-2018-1024x418--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13030/reg_Jimmy-Simpson-Junior-Banff-Best-Snow-Glissade-Ever-Jul-8-2018-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13030/reg_Jimmy-Simpson-Junior-Banff-Mt-Olive-Saint-Nicholas-Gordon-Portal-Jul-8-2018-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13030/reg_Jimmy-Simpson-Junior-Banff-Route-Seen-From-Lakeshore-Jul-8-2018-1024x716--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13030/reg_Jimmy-Simpson-Junior-Banff-Scrambling-up-Chimney-on-Summit-Block-Jul-8-2018-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13030/narrow_Jimmy-Simpson-Junior-Banff-High-Waterfall-from-Simpson-Tarn-Jul-8-2018-717x1024--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13030/narrow_Jimmy-Simpson-Junior-Banff-Huge-Cave-Jul-8-2018-768x1024--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13030/narrow_Jimmy-Simpson-Junior-Banff-Some-Fun-Easy-Scrambling-Jul-8-2018-768x1024--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13030/narrow_Jimmy-Simpson-Junior-Banff-Summit-North-Peak-Jimmy-Simpson-Nice-Tarns-Jul-8-2018-768x1024--44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/jimmy-simpson-junior-unnamed-peak-near-banff-ab-13030",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 5,
        "Time": "5 hrs",
        "Total Distance": "7 km",
        "Town": "Banff, AB",
        "Type": "out-and-back"
    },
    "title": "Jimmy Simpson Junior (unnamed peak)",
    "trail_id": "13030"
}