{
    "description": "This trail is part of the Goat River Trail System and was hiked by us from the rest stop on Hwy 16 at the Goat River to the trailhead in Crescent Spur. The trail starts with a small seeping spring right at the trail sign, takes you in and out of an interesting mix of both old growth cedar and boreal forest. Sometimes it follows old roads, and at other times a meandering track. At the time of hiking it, the majority of the trail had been maintained except for a section in the middle. It required paying attention to the tree markers as at times the trail was very subtle. If you search info on this section of trail it says it is 11km in length. However, several GPS devices registered over 13km. Its a moderate hike, the forest is beautiful. There were a couple of stream beds with a little water running at end of July. You could tell there would have been beautiful views looking north and east at some points, but tree cover blocked views.",
    "directions": "From the Yellowhead Bridge in Prince George, drive 165 KM to the rest stop on the Goat River. The trail starts at the outhouses. The trail comes out at the end of Prospect Rd in Crescent Spur. If starting at Crescent Spur, park at the end of Prospect Road at a gate that has a stepladder system over and across it. There are also trail signs here. Once over the gate, you will walk down a road that will curve to the right into a gravel pit. There are markers that will lead you to where trail takes you into the forest.",
    "geohash": "c3d0",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/13046/long_vlcsnap-2018-08-01-11h08m52s457-45311.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/13046/long_vlcsnap-2018-08-01-11h13m40s117-45311.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/13046/long_vlcsnap-2018-08-01-11h14m05s692-45311.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/13046/long_vlcsnap-2018-08-01-11h15m46s712-45311.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/13046/long_vlcsnap-2018-08-01-11h18m23s413-45311.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/13046/long_vlcsnap-2018-08-01-11h19m15s139-45311.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/lower-goat-river-historic-trail-near-prince-george-bc-13046",
    "stats": {
        "Activities": "snowshoe hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 4,
        "Time": "5 hrs",
        "Total Distance": "12 km",
        "Town": "Prince George, BC",
        "Type": "out-and-back"
    },
    "title": "Lower Goat River Historic Trail",
    "trail_id": "13046"
}