{
    "description": "Completed on July 30, 2018 in dry conditions.Edwards Rating: III (III) M M6 to 8 hoursElevation of 947 m NET, 1079 m TOT & max 2517 mGear: Poles, helmet, bug repellent a MUST at this time of the year.*****Going up the NE ridge makes it for a tremendous hands-on scramble! The approach is a bit frustrating as the trail (even though easy to follow) is quite bushy but scrambling is delightful. It is at least moderate-difficult technically in my opinion as some sections we climbed were steep and exposed but the rock is solid and handholds-footholds are great. One thing we should have done differently is to go up that NE ridge a little bit later as the very beginning is bushy. Going up at the waterfall and oblique rock band would have been easier.From the pull-off (GR968385), we hiked up the bushy trail for about 3 km and as soon as we got to the base of the NE ridge we left the trail to go up a steep slope to our right (GR962364). Once we got closer to what seemed to be an impressive scramble at first, we saw almost directly on the left a good chimney to climb up to a first of several plateaus. Then we just stayed very close to the ridge line (cliff on our right) using cracks, ledges and chimneys to scramble up to the high point on the summit ridge. Going left in this whole section is probably riskier as it seems like the rock and scree might not be as stable and solid with exposure to a steep slope and a cliff down below. We turned left on the summit ridge (GR950351) and gained some elevation for that last stretch of about 2 km. We started sidesloping to the right after the boulders to avoid taking extra elevation and finally saw the true summit (GR963335) further away to the south.On the way down, we followed the north ridge staying to the right of that huge plateau, taking some elevation and then following the ridge down to a series of grey ledges with scree and boulders to start. We saw a couple of cairns so it made it easy at first but then it becomes quite obvious as there is always an easy way down on either side with some down climbing only if you wish. I would say this section is easy technically but route finding could be a challenge if someone doesn?t have much experience on that kind of terrain. Once we started seeing the top of the waterfall we headed down to our left to reach the valley, get some fresh water and get back on the obvious trail. Doing the loop that way is recommended if comfortable with hands-on scrambling as the NE ridge is incredibly fun to climb.",
    "directions": "From Waterton Lakes junction continue on AB-5 E for about 900 m and turn right on AB-6 S. Drive another 7.1 km approx. and park at the pull-off on your right.",
    "geohash": "c2x",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/13048/long_Sofa-Mountain-Waterton-Summit-Panorama-Jul-30-2018-1-1024x234--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13048/reg_Sofa-Mountain-Waterton-Delightful-Scrambling-Superb-Jul-30-2018-1-1024x760--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13048/reg_Sofa-Mountain-Waterton-Delightful-Scrambling-Superb-Jul-30-2018-3-1024x920--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13048/reg_Sofa-Mountain-Waterton-Scrambling-Section-in-View-Jul-30-2018-1024x805--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13048/reg_Sofa-Mountain-Waterton-Summit-Selfie-Jul-30-2018-916x1024--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13048/reg_Sofa-Mountain-Waterton-Summit-Selfie-Mt-Cleveland-Jul-30-2018-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13048/reg_Sofa-Mountain-Waterton-Welcome-Route-Jul-30-2018-1024x701--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13048/narrow_Sofa-Mountain-Waterton-Delightful-Scrambling-Superb-Jul-30-2018-2-768x1024--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13048/narrow_Sofa-Mountain-Waterton-Delightful-Scrambling-Superb-Jul-30-2018-7-767x1024--44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/sofa-mountain-northeast-ascent-near-waterton-park-gate-ab-13048",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 4,
        "Time": "8 hrs",
        "Total Distance": "14 km",
        "Town": "Waterton Park Gate, AB",
        "Type": "out-and-back"
    },
    "title": "Sofa Mountain (Northeast Ascent)",
    "trail_id": "13048"
}