{
    "description": "Ceci est une description d?une randonnée en direction d?une chute méconnue dans la région de Lachute.   Mes parents ont un chalet dans ce coin et je voyage fréquemment la route 327 Nord a partir de Brownsburg vers Pine Hill.  La route traverse la rivière de l?Ouest et ensuite gravis une bonne pente pour poursuivre son chemin vers le nord. La rivière de l`Ouest refait son apparition près de la route à Pine Hill.   Je me suis toujours demander si le changement d`élévation sur la route était aussi présent sur la rivière et donc la possibilité d?une chute serait aussi présente.Avec les photos satellites récentes de google earth, je voyais dans la foret des espaces blancs sur la rivière.  La carte topographique de cette région montrait aussi un changement d?élévation.    J?ai donc décidé d`aller voir par moi-même si il y avait une chute.  J?ai décidé de prendre un chemin de terre (Montée Silverson) pour aller le plus près possible des chutes.  Le chemin plus court passait dans une carrière sur la 327 nord  et donc l?accès de ce cote n?était pas bon.Une fois près de la rivière, j`ai suivi le littoral pour environ 1.2km jusqu?à la chute.  A certain moment, j?ai marche dans la rivière car la foret était trop dense.  Il y avait des signes d?anciens chemin le long de la rivière et je les ai utilisé quand bon me semblait.   Et?..j'ai finalement vu cette chute!   Elle est environ 12-15 pieds et dépendant du niveau de l`eau peut prendre toute la largeur de la rivière.  J`ai aperçu de l`autre cote de la rivière (côté ouest) des signes que ce site est surement utilise par des personne local mais je ne suis pas sur comment ils y accèdent.",
    "directions": "Route 327 Nord. Au nord de Brownsburg, tourne sur Montée Silverson (45.711605, -74.429466).  Stationne environ à 45.726934, -74.430313.  Suit la rivière jusqu?à la chute; 45.723296, -74.444650.  Chute bonus; dans le village de Brownsburg, il y a une chute très accessible ; 45.668267, -74.409443",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/QC/13059/long_37997471-1175543549252154-6272690123947638784-n-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/13059/long_38411941-1175543495918826-8731181553670946816-n-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/13059/narrow_38405294-1175543399252169-709321433846644736-n-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/13059/narrow_38448250-1175543442585498-4996657672473280512-n-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/chute-de-la-riviere-de-louest-pine-hill-near-lachute-pq-13059",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "3 km",
        "Town": "Lachute, PQ",
        "Type": "out-and-back"
    },
    "title": "Chute de la rivière de l'Ouest (Pine Hill)",
    "trail_id": "13059"
}