{
    "description": "Completed on August 1, 2018 in dry conditions.READ CAREFULLY: GPS track includes 3 route finding errors so read the description and look at the pictures for a better understanding of the overall route.Edwards Rating: III (III) L L7 to 13 hours (We hike it all but much faster if biking 9 km of total distance)Elevation of 981 m NET, 1661 m TOT & max 2489 m (West summit, East at 2453 m)Gear: Poles, helmet, bug repellent & LOTS of water/food as it is dry at this time of the year and we had a warm 30+ degrees.*****This is a long day physically and also quite demanding in terms of route finding. If you have a bike, lucky you! We did not and it made the last few hours even more painful. Route finding skills are essential here, hoping pictures and following description will help. There is some moderate hands-on scrambling up rock or cliff bands in steep gullies.From the parking lot, we walked down the road for about 3.7 km keeping left at the one intersection (GR164617) we came across to the last gas plant. 400 m down passed it, we turned right on Bovin Lake trail (GR139593). First mistake was to go too far here and therefore do the worst bushwhacking ever so hike for only 350 metres on this trail and turn right on a small but good drainage. This will bring you up to the main gully. First rock band can be circumvented on the left as we did (GR135594). Once over it, we followed a dried-out drainage to use good rocks for an easier ascent, going almost straight up or right such was a mistake. The best way to go is left as this is where you will find a weakness in the cliff band up above, at the very end of it on the left side. Up over that band, we went up and slightly to the right until we reached those beautiful colored rocks such happened to be the summit block. We walked up along it to the right and found a great gully with solid holds on our left (GR134603). We first went straight up and then cut to the right to reach the east summit (GR134604).Down and following the west ridge, I wanted to be done with that day now so I tried a SW descent but we got cliffed out. We regained this 300 m elevation and sidesloped going west to get to the west summit (GR103583) hours later. We kept going passed the summit until we were in line with Bovin Lake down on our left. We used pretty decent scree (GR092569) to get down to the forest for some light bushwhacking down to the lakeshore. We turned left and used the official Bovin Lake trail all the way back to the gas plant and the car. One thing to remember here is most gullies between the two summits are tricky and you will most likely be cliffed out every time except for that ascent gully we used. Great scramble, challenging both physically and mentally so be prepared for a long day and hopefully you have a bike you can leave at the small drainage before starting route finding up to the east summit.",
    "directions": "Well explained in Andrew Nugara?s book: ?From Pincher Creek, head south towards Waterton. About 20 km south of the south end of town, turn right (west) onto the Shell Waterton Complex road (Twp. Rd. 4-3 A; the sign is on the east side of the road). Follow the road for about 9 km, past the complex, and turn left at the Forest Reserve sign, onto Twp. Rd. 4-3. Drive 3.8 km and turn left onto Range Rd. 1-2 A. Drive 1.4 km and turn left onto Twp. Rd. 4-2. Follow this road for 5 km and turn right. You?ll find the Bovin Lake Trailhead sign about 200 m along.?",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/13050/long_1-26--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13050/long_1-28--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13050/long_Drywood-Mnt-Traverse-to-Bovin-Lake-East-Summit-Panorama-Victoria-Peak-Pincher-Ridge-Prairie-Bluff-Aug-1-2018-1024x223--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13050/long_Drywood-Mnt-Traverse-to-Bovin-Lake-Lake-from-West-Ridge-Aug-1-2018-1024x626--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13050/long_Drywood-Mnt-Traverse-to-Bovin-Lake-Tremendous-Colours-in-SW-Gully-Aug-1-2018-1024x590--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13050/long_Drywood-Mnt-Traverse-to-Bovin-Lake-West-Summit-Panorama-View-Pincher-Ridge-Summits-Stunning-Aug-1-2018-1024x273--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13050/long_Drywood-Mountain-Traverse-Castle-Wilderness-Route.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13050/reg_1-21--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13050/reg_1-23--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13050/reg_1-27--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13050/reg_1-29--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13050/reg_Drywood-Mnt-Traverse-to-Bovin-Lake-Cliff-Band-Weakness-Aug-1-2018-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13050/reg_Drywood-Mnt-Traverse-to-Bovin-Lake-East-Summit-Selfie-Aug-1-2018-1024x768--44639_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13050/reg_Drywood-Mnt-Traverse-to-Bovin-Lake-Silver-Inside-Red-Outside-Wow-Aug-1-2018-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13050/reg_Drywood-Mnt-Traverse-to-Bovin-Lake-Welcome-Aug-1-2018-1024x642--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13050/reg_Drywood-Mountain-Traverse-Castle-Wilderness-Route.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13050/narrow_1-25--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13050/narrow_Drywood-Mnt-Traverse-to-Bovin-Lake-Beautiful-Gully-Below-Summit-Superb-Aug-1-2018-768x1024--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13050/narrow_Drywood-Mountain-Traverse-Castle-Wilderness-Route.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/drywood-mountain-traverse-east-to-west-and-bovin-lake-near-pincher-creek-ab-13050",
    "stats": {
        "Activities": "hike mtn-bike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 4,
        "Time": "9 hrs",
        "Total Distance": "26 km",
        "Town": "Pincher Creek, AB",
        "Type": "out-and-back"
    },
    "title": "Drywood Mountain Traverse (East to West) and Bovin Lake",
    "trail_id": "13050"
}