{
    "description": "Revelstoke's ski resort has opened several new, well built trails allowing access right to the sub-summit of Mt Mackenzie (8,074 ft). hikers can first scamper up the punishing \"kill the banker\" trail (3.8 km, 3400 ft) to mid-mountain station or one can take the gondola up to mid-mountain, which i did . From there it is a more moderate 6.3 km hike up the Stoke's climb, just under 2,000', to below the sub summit. This trail is newly opened and it's the one I did. The route is mostly forested and so much nicer than just trudging up a ski hill service road. Beyond the Stoke climb is the new sub-summit loop which was not yet open. The advantage to all of these is the ability to ride down, thus extending the working life of one's kneesThe Stoke's climb is a well built, nicely switchbacked route with amazing views of the columbia river valley, the Monashee mountains to the west and Selkirks to the south. It's all good and most recommended, especially if you're finding the long crushing hikes to the alpine getting a bit tough on the ol' body.",
    "directions": "Take the main roads in the town of Revelstoke, BC to the ski resort Gondola. From there you can either climb up the first trail (\"Kill the Banker\") or more sensibly take the ride to the mid mountain. From the mid mountain station it is a nice 6.3 km moderate hike up.",
    "geohash": "c3",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/13052/long_20180708-092058-55777.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/13052/long_20180708-110401-55777.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/13052/long_20180708-112502-55777.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/13052/long_20180708-120802-55777.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/13052/long_map-55777.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/stokes-climb-revelstoke-near-revelstoke-bc-13052",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 4,
        "Time": "5 hrs",
        "Total Distance": "12 km",
        "Town": "Revelstoke, BC",
        "Type": "out-and-back"
    },
    "title": "Stokes Climb - Revelstoke",
    "trail_id": "13052"
}