{
    "description": "Completed on August 4, 2018 in dry conditions. Road closure in winter.Edwards Rating: II (IV) S M3.5 to 6 hoursElevation gain of 842 m (2763 feet) NET, 1054 m (3458 feet) TOT & max 2807 m (9209 feet) (for Piegan, Pollock at 2802 m (9193 feet) approx.)Gear: Poles, helmet.*****This scramble is technically easy most of the time (class I or II) but becomes more challenging as you scramble up at the west end of Pollock?s summit block (class IV). I have been told once at the summit that I had to down climb the crux so be prepared if you find the climb challenging on the way up in that narrow chimney. Views are exceptional with all those colourful rocks and several waterfalls and glaciers.Starting on Lunch Creek trail, we went up to the first cliff band with a waterfall and turned right on easier terrain. We left the trail and went straight up to Piegan summit from there using good rock bands with multiple weaknesses. From Piegan summit, we went down towards the Pollock-Piegan col descending along the NW ridge. The rock is solid again and it involves some easy hands-on scrambling down boulders and rock bands. At the end, we circumvented a rock band on the right and came back on the ridge to go down to the col. We hiked back up towards Pollock?s beautiful summit block and followed a good trail in the scree below it trending left. When we got close to the end of the block, we looked on our right and saw a few cairns and stairs-like red rocks to scramble up heading right into the summit block. We got to a point where the only viable option was to climb in a very narrow and at one point almost vertical chimney. First couple of moves are quite easy but the next two were more difficult technically. My partner waited for me at the platform below while I completed that ascent. Up there, an obvious scree trail led me to the summit a couple of minutes later going along a cliff to start and then to the left on easy terrain. As my partner was waiting for me and being told by another group this was the only safe way back I went down the same way. Otherwise you can consider going NW to bag another named high point, Bishops Cap.We went back down to the low point of the col and followed a good scree trail straight down to the valley to our right. Once almost done with that slope, I made things a little more complicated as a gully on our right was the easy way to go but I wanted to scramble along Piegan Mountain using moderately exposed ledges. We sidesloped for a while until we saw a weakness down and completed our descent back to the main trail. This loop is a lot of fun and challenging at times, route finding was not too difficult and the approach is quick, worth a visit for sure!",
    "directions": "From West Glacier Entrance head northwest on Glacier Rte 1 Rd/Going-to-the-Sun Rd for 2 miles toward River Bend Dr and turn right. Continue on Going-to-the-Sun Rd for 30 miles to Logan Pass and an extra 0.8 miles to park at the Lunch Creek parking area on your right. Get there early as it is extremely busy. We were the second car to park arriving at 8:30am.",
    "geohash": "c2xjh",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/MT/13053/long_1-11--44639.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/13053/long_1-18--44639.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/13053/long_1-22--44639.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/13053/long_1-27--44639.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/13053/long_1-6--44639.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/13053/reg_1-19--44639.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/13053/reg_1-21--44639.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/13053/reg_1-26--44639.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/13053/reg_1-4--44639.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/13053/reg_1-5--44639.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/13053/reg_1-7--44639.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/13053/narrow_1-16--44639.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/13053/narrow_1-9--44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/piegan-to-pollock-mountain-loop-from-lunch-creek-near-west-glacier-mt-13053",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 5,
        "Time": "5 hrs",
        "Total Distance": "7 km",
        "Town": "West Glacier, MT",
        "Type": "out-and-back"
    },
    "title": "Piegan to Pollock Mountain Loop (From Lunch Creek)",
    "trail_id": "13053"
}