{
    "description": "Three days on the river Peace and quiet followed by gunshots and ATVsThe GPX file lays out nicely where we camped, but this is just a trail I made on the computer to get an idea of distances and where we would need to camp.the first campsite on the island was already established; we enjoyed the river view and some loser ripping around the backroads in his or her loud truck.The second day was an excellent time on the river until we started hearing gunshots that seemed very close. we started yelling at the top of our lungs around every corner. Eventually, we spotted the guy. He couldn't hear us because of his earmuff.. so he continued to shot the river until he saw us. Then I asked him if he wouldn't mind waiting until we made it around the next corner before he continued to try and kill the river... I left out that last bit. So we carried on with our backs turned to him as we paddled down the river. Hoping no one would eventually find out bodies floating along the north sask. was found a lovely sandy beach that night and watched the sunset and the northern lights come out.In the morning the tent was frozen, we warmed up and hit the river, Shortly after it seemed ATVs were on every bank and again gunshots all around.by the time we got to the take-out point, we were ready to go home.when you look at the map, you would think this section on the river is isolated, Not the case.",
    "directions": "In at Riverview CampgroundOut at Willey West Campground",
    "geohash": "c3q",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/13058/long_DSC00037-40928.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13058/reg_Camp-2-morning-40928.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13058/reg_Drying-out-at-camp-2-40928.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13058/reg_Northren-Lights-40928.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13058/reg_day-3-40928.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13058/reg_on-the-water-after-day-2-40928.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13058/reg_these-rapids-had-us-bailing-watter-40928.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/rocky-mountain-house-to-devon-on-the-north-saskatchewan-river-near-rocky-mountain-house-ab-13058",
    "stats": {
        "Activities": "river-canoe",
        "From": "",
        "Seasons": "fall",
        "Stars": 4,
        "Time": "21 hrs",
        "Total Distance": "130 km",
        "Town": "Rocky Mountain House, AB",
        "Type": "out-and-back"
    },
    "title": "Rocky Mountain House to Devon on the North Saskatchewan River",
    "trail_id": "13058"
}