{
    "description": "This is a fun and short adventure in the Wentworth valley area.  A long time ago, a rail line was constructed on the slopes of the hills.  Sometimes, when a brook needed to be crossed, they bored tunnels through solid rocks and infilled the natural valley.This hike takes you on a dirt road at first that is used as an ATV trail.  The atv trail bisects the rail line after about 300m of going uphill.  At this point, follow the railing eastward or to the left if facing uphill.  Within 20m, veer to the south and into the deep valley. At the bottom you will see the brook and entrance to the tunnel.  Upstream of the tunnel is a nice 20ft fall too!  The tunnel is very high, and wide.  Most of the times the water level is quite low and you could make t almost the whole way with dry hiking boots but there are some deep holes where you can get water up to your knee.  The tunnel has a few places where the ceiling is higher and an area where the workers built a pillar.",
    "directions": "Highway 4 in Wentworth Valley.  turn on Valley station Rd.  Continue on Valley station Road until you see a dirt road on the left at; N45 37 08.4 W63 35 50.4.  The tunnel is at; N45 36 58.0 W63 35 51.9",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/13066/long_40088282-1201227543350421-5059714140340224000-n-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13066/reg_40071134-1201227523350423-6279962152119828480-n-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13066/reg_Screen-Shot-2018-08-26-at-9.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13066/narrow_40051399-1201227566683752-1852189910367207424-n-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13066/narrow_40101620-1201227603350415-1805589270392471552-n-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/caldwell-brook-tunnel-near-truro-ns-13066",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "1 km",
        "Town": "Truro, NS",
        "Type": "out-and-back"
    },
    "title": "Caldwell Brook Tunnel",
    "trail_id": "13066"
}