{
    "description": "I first visited this fall about twelve years ago.  Took a few pictures and posted on the now forgotten panoramio website which linked the pictures into google earth.   It was about that time that I first started posting on trailpeak.  For a reason that escapes me, I forgot to post the directions to this much unvisited fall in an area which doesn't have very many falls to start with.The hike is very easy...there isn old woods road you can follow for a while and then a light bushwhack of about 100m gets you to the river (Steele Run).  Then you just walk a bit downstream to a 20ft slider type fall.  I would wait after big rainfall to make it more impressive.  Upstream of the fall on the right hand bank (looking upstream) is a quasi cave or maybe the start of an old adit.Downstream of the fall is the confluence with Coal Mine Brook.  There is a nice 10-15ft fall on this small tributary to check out as well at approx (N45 29 28.9 W63 01 53.6).",
    "directions": "Highway 104.  Exit at Mt Thom and take old highway 4 towards Salt Springs.  The woods road exits on highway 4 approximately at; N45 29 52.8 W63 01 28.3.  The fall is approximately at; 45°29'42.7\"N 63°01'57.6\"W",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/13063/reg_39249494-1192257337580775-225355301933547520-o-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13063/reg_39400699-1192257270914115-1829842929238147072-o-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13063/reg_39467829-1192257294247446-8368107133253713920-o-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/steele-run-fall-near-new-glasgow-ns-13063",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "2 km",
        "Town": "New Glasgow, NS",
        "Type": "out-and-back"
    },
    "title": "Steele Run Fall",
    "trail_id": "13063"
}