{
    "description": "Completed on August 14, 2018 in dry conditions.Edwards Rating: III (IV - III if avoiding summit block scrambling) S M4 to 7 hoursElevation of 929 m NET, 966 m TOT & max 2477 m Gear: Poles are a must here with that steep slope to begin with. We should have brought our helmets with that scrambling along a cliff band. Ticks are all over the place in early season so bug repellent is a good idea in spring.*****This is a moderate scramble that might involve some bushwhacking and route finding depending on your experience and how vigilant you are. Great cairns are in strategic spots on the way up and I added 3-4 more on the way down in case you don?t look back once in a while (as we always should). Flagging (orange, pink and blue) helps in the forest but games of trails can be confusing. As always, sticking to the ridgeline is a great idea. Following our GPS makes it for a moderate to difficult scramble technically as I attempted 3 lines in the cliff band below the summit. You can circumvent the band on the left and avoid difficult scrambling.We made the whole Opal traverse in 2014 and didn?t realize that we only missed the last 100 metres to the north peak so we thought we would do it again. From where we parked, we cut straight in the forest not seeing the beginning of the trail that was hidden in the trees about 150 m to our right. We bushwhacked up an extremely steep slope going to the right when we saw a clearing (GR292333). We went straight up in that clearing and saw the trail to our left minutes later (GR293333). We started following it from there and got to the treed ridge after 350 m elevation gain in 700 m, pretty steep. We turned right (GR296333) and followed blue flags staying close to the ridgeline and got to the scrambling portion with a first rock band easily scrambled up slightly to the left. We hiked toward an impressive cliff band going right to use good rock bands for an easier ascent physically (but not technically). We turned right at the band and scrambled up along it using a ledge between the two sections and getting to the side of the mountain. We turned left and scrambled almost straight up to the summit ridge and up that rock band on the right to get to the plateau. We hiked south toward the summit block and I attempted 3 different lines straight up the cliff. The first one had solid holds but exposure made me uncomfortable so I went back down a bit and followed a ledge to the left to find a way I was more comfortable with while my partner circumvented the whole thing on the left in lower elevation to go up easy terrain on the left side of the summit. I finally found a nice gully but debris and loose rocks made it a bit challenging. I completed that ascent and got to the summit (GR306315) minutes later.On the way down, we followed the trail almost all the way to the car but this is sometimes tricky to follow. I got distracted and went off-trail once but we got back to it quite easily. If it wasn?t for the first steep slope, this would be a fine scramble. It is short and involves a great deal of interesting scrambling.",
    "directions": "From Calgary, follow Trans-Canada Hwy/AB-1 W to Kananaskis Trail/AB-40 S. Take exit 118 and start your odometer here for 35.5 km down south. No good parking spot so we parked along the right side of the road in the grass (GR291333).",
    "geohash": "c3n15",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/13060/long_Opal-Ridge-North-Peak-Kananaskis-Ridge-to-Summit-Aug-14-2018-900x255--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13060/long_Opal-Ridge-North-Peak-Kananaskis-Route-from-Highway-Aug-14-2018-900x448--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13060/long_Opal-Ridge-North-Peak-Kananaskis-Scrambling-Route.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13060/long_Opal-Ridge-North-Peak-Kananaskis-Summit-Panorama-View-Kidd-Wedge-Mackay-Fisher-Aug-14-2018-900x233--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13060/reg_Opal-Ridge-North-Peak-Kananaskis-Complete-Route-from-Highway-Aug-14-2018-900x735--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13060/reg_Opal-Ridge-North-Peak-Kananaskis-Exposed-Line-Attempt-Back-Down-After-10-min-Beautiful-Rock-Aug-14-2018-900x675--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13060/reg_Opal-Ridge-North-Peak-Kananaskis-First-Easy-Scramble-up-Rock-Band-Aug-14-2018-900x675--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13060/reg_Opal-Ridge-North-Peak-Kananaskis-Scrambling-Route-Aug-14-2018-900x675--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13060/reg_Opal-Ridge-North-Peak-Kananaskis-Scrambling-up-Summit-Block-Loose-Rocks-Aug-14-2018-900x675--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13060/reg_Opal-Ridge-North-Peak-Kananaskis-Summit-Block-Route-Aug-14-2018-900x675--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13060/narrow_Opal-Ridge-North-Peak-Kananaskis-3-Metres-Rock-Band-Aug-14-2018-533x900--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13060/narrow_Opal-Ridge-North-Peak-Kananaskis-Very-Steep-Slope-to-Start-350-m-for-700-m-Aug-14-2018-675x900--44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/opal-ridge-north-peak-near-kananaskis-ab-13060",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 4,
        "Time": "6 hrs",
        "Total Distance": "7 km",
        "Town": "Kananaskis, AB",
        "Type": "out-and-back"
    },
    "title": "Opal Ridge North Peak",
    "trail_id": "13060"
}