{
    "description": "Completed on August 25 in snow conditions on the easier routes, about 5 cm.Edwards Rating: III (III) S M ? Exposed almost all the time on the ridge route5.5 to 9 hoursElevation of 1018 m NET, 1043 m TOT & max 3218 m Gear: Poles. Helmet essential as it is a busy trail with loose rocks. I would also consider bringing an ice axe, crampons and microspikes if early-late season trip.*****This is a fine scramble and I understand why it so busy here. I do think that going up the ridge route all the way is more of a moderate-difficult scramble technically with some climbing and exposure but you will avoid the crowd and rock falls danger. Using our descent route both ways would make it for a moderate scramble at most with a few trickier or more exposed sections still before the summit. We thought snow would be a problem but it didn?t stop us from summitting and using the snowy but easy route back down. Even though the ridge is exposed, the rock is so much better so I personally think that staying on the ridge all the time is the way to go. You also avoid potential injuries from rock falls but some route-finding skills will be required.From the parking lot, we followed the main trail keeping right and turning right at the Ptarmigan Cirque sign to cross the highway and keep going up to this beautiful cirque. We kept going on the obvious scree trail on the left side of the waterfall and attacked the scree slope as soon as possible turning left using rock bands (under debris) for an easier ascent. We were lucky enough to be alone at this point so kicking rocks was not an issue. Once at a higher dark ledge, we followed the wall to the right and reached the col. We used the ridge about 95% of the time to go up worried about the snow on the easier routes (like four of them and very obvious from the col). Scrambling is almost always exposed on that ridge but holds are usually very good. We reached the huge pinnacle or false summit quickly and attempted to climb it almost straight up but it didn?t work for us. We looked to the right and followed a ledge to see that chimney people are referring to with the chockstone at the top. The last section is trickier and steeper but holds are good. Once out of this chimney we scrambled down a small rock band and hiked for a few seconds to turn left into another chimney leading to the ridge. We scrambled another exposed section and went down that false summit. Here there might be a few options to go back up right away on another big pinnacle but I had exhausted my partner?s ability to take on exposure and climbing so we went down a gully of loose rocks on our left. We reached the highest of the easier routes, used it up to the oblique slabby terrain and scrambled back up to the ridgeline. We then followed the ridge all the way to the summit with again some exposed moves from time to time. There?s always options to go to the left a bit lower and follow some trails but I always trust ridges better and the snow made it an easy decision for me today.From the summit, we scrambled down the ridge for a few minutes and just before the oblique slabs we started going down following games of trails. The snow was not an issue here and trails were solid and easy to follow. We sidesloped all along and back to the col and saw a good scree trail right away on our left to descend quickly and easily to the cirque. This would have been a terrible idea if others were below us but luckily, we were alone on the slope. The scree and dirt was actually decent here even though steep at times. BC wildfires smoke prevented us from getting probably stunning views at the top but this is an incredibly fun scramble when sticking to the ridge.",
    "directions": "From Calgary, follow Trans-Canada Hwy/AB-1 W to Kananaskis Trail/AB-40 S. Take exit 118 and start your odometer at the Casino entrance and drive for about 67 km to Highwood Pass parking lot on your right.",
    "geohash": "c2ypz",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/13068/long_Mount-Rae-Attempt-Ptarmigan-Cirque-Kananaskis-Welcome-Jul-14-2018-900x559--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13068/long_Mount-Rae-Kananaskis-Incredible-and-Always-Exposed-Ridge-Scrambling-Aug-25-2018-1-900x477--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13068/long_Mount-Rae-Kananaskis-Scrambling-up-Loose-Rocks-Aug-25-2018-2-900x440--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13068/long_Mount-Rae-Kananaskis-Summit-Panorama-View-Tyrwhitt-Pocaterra-Elpoca-Aug-25-2018-900x214--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13068/reg_Little-Arethusa-Kananaskis-Summit-Panorama-Selfie-Mt-Rae-Arethusa-and-Storm-Mnt-Jul-21-2018-900x784--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13068/reg_Mount-Rae-Kananaskis-Route.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13068/reg_Mount-Rae-Kananaskis-Very-Interesting-Climbing-Scrambling-up-Chimneys-Cracks-Aug-25-2018-1-900x675--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13068/reg_Route-2-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13068/reg_Route-3-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13068/narrow_Mount-Rae-Kananaskis-Incredible-and-Always-Exposed-Ridge-Scrambling-Aug-25-2018-2-633x900--44639_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13068/narrow_Mount-Rae-Kananaskis-Incredible-and-Always-Exposed-Ridge-Scrambling-Aug-25-2018-3-465x900--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13068/narrow_Mount-Rae-Kananaskis-Very-Interesting-Climbing-Scrambling-up-Chimneys-Cracks-Aug-25-2018-2-664x900--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13068/narrow_Mount-Rae-Kananaskis-Very-Interesting-Climbing-Scrambling-up-Chimneys-Cracks-Aug-25-2018-3-574x900--44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mount-rae-near-kananaskis-ab-13068",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 5,
        "Time": "7 hrs",
        "Total Distance": "9 km",
        "Town": "Kananaskis, AB",
        "Type": "out-and-back"
    },
    "title": "Mount Rae",
    "trail_id": "13068"
}