{
    "description": "I have hiked into the East Branch Folly River (EBFR)  a few times over the last ten years.  It all started on an exploration of Long Brook Fall which is a 40ft or so fall located where Long Brook empties into East Branch folly river (it?s in another trailpeak post; N45° 31' 22.4\" W63° 30' 27.5\").  In the spring of 2018, I also explored a beautiful 20ft fall on the upper reach of the EBFR and posted it on trailpeak.This time around I decided to visit a few different spots along the EBFR.  From where it empties into the Folly river to a point about 5 km upstream.  I started off a logging road and hiked to the confluence of the two rivers at; N45° 29' 49.4\" W63° 31' 40.4\".  The trick is to get into the ravine of the EBFR before it empties into the folly river because the last section of this brook is framed by sheer rock walls and you wont be able to get down easily.  There are a few small falls in this section but the beauty lies in the rock walls surrounding you.  The bonus here is once you reach main Folly River and if the water is low you can easily reach the Grandfather clock fall upstream at; N45° 29' 56.1\" W63° 31' 45.7\" (already described in another trailpeak post).  From there I backtracked to the EBFR and walked upstream to an area where power lines are over the river at N45° 30' 22.9\" W63° 31' 13.0\".  In this area are a few small falls but nothing major.  I ended up walking back up to my car and travelling on a logging road and parked again around N45° 30' 58.4\" W63° 30' 07.9\".  From there it?s an easy walk in the forest to the river about 500m away.  The river around N45° 31' 01.7\" W63° 30' 30.5\" has some sheer rock walls on the west side but no fall?.however I travelled about 200m upstream and found the best fall of the whole East Branch river.   It?s a magnificent 25ft fall with a huge and deep poll in front of it.  The fall is framed by rock walls on either sides.  If you are going only for one fall on this system?this is it?its approximately at; N45° 31' 04.8\" W63° 30' 28.3\".Hiked back to my car and drove a bit further north and parked.  Then followed a small brook where it crossed the road?it?s easy to spot, the culvert was removed so you can?t drive over it.  I hiked into an area approximately at; N45° 31' 30.9\" W63° 30' 16.8\" and followed the brook upstream.  There were a few small falls but nothing major until an area around N45° 31' 52.4\" W63° 29' 57.7\" where there are 3 falls in a row.  The middle would be the tallest at around 20ft or so.",
    "directions": "Highway 4 towards Wentworth.  Turn on Plain Rd in  the Debert Direction and then turn left on Reid rd.  Drive Reid Rd towards north.  Turn left on Folly Mtn Rd and then turn right on logging road at; N45° 29' 15.2\" W63° 30' 18.3\".  Drive on this logging road to a secondary logging road on your left (it?s about 150m BEFORE going under the power lines).  Turn on it and drive as far as you can and then aim for the East Branch Folly River.",
    "geohash": "f84",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/13077/reg_40429729-1205030689636773-2117718730069770240-n-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13077/reg_40433207-1205030729636769-9190236351281233920-n-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13077/reg_40500747-1205031449636697-45458105659555840-n-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13077/reg_40509531-1205031209636721-1312878580769751040-n-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13077/reg_40516409-1205031556303353-1876584242276728832-n-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13077/reg_40517740-1205030926303416-315271120880140288-n-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13077/reg_40528421-1205031029636739-6747385070736113664-n-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13077/reg_40538914-1205030782970097-4621727471576809472-n-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13077/reg_40583785-1205031136303395-765821565416767488-n-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13077/narrow_40463400-1205030989636743-621142607048736768-n-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13077/narrow_40479114-1205031196303389-3808115448575164416-n-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/east-branch-folly-river-main-fall-and-micro-explorations-near-truro-ns-13077",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 4,
        "Time": "5 hrs",
        "Total Distance": "8 km",
        "Town": "Truro, NS",
        "Type": "out-and-back"
    },
    "title": "East Branch Folly River ? Main Fall and micro explorations",
    "trail_id": "13077"
}