{
    "description": "*** Annual road closure highway 40 South (Highwood), from December 1st till June 14th ***Completed on September 8 in dry conditions. I wouldn?t try that scramble with rain or snow.Edwards Rating: III (IV) S S3.5 to 6 hoursElevation of 782 m NET, 843 m TOT & max 2693 m Gear: Poles, helmet essential as it is a steep busy trail with loose rocks. GPS might be useful for route finding, no cairns (except some useless ones on the ridge showing the obvious?) and many options.*****This is a wonderful short scramble, technically difficult in my opinion: Exposure, stunning ridge walk, loose rocks, hands-on, route finding and fine views on top of that. I really enjoyed it and I apologize for the confusing GPS track. You will see that it goes up in three different places, all possible routes but the first two with great exposure to cliffs where my partner was not comfortable today. The last one on the right is the easier option with one 3 metres climb with good holds leading up to the ?dome?.From the parking lot, we walked back passed the gate on the gravel road for about 260 metres, passed a pink flag we didn?t care to follow. We saw a good trail on our right (GR382119) and followed it to a drainage. The drainage was mainly dry but there are options on either side if waterflow is an issue. We scrambled up that drainage, staying on the right one at the fork (GR381124). Once both Gap and Elpoca started showing up, we left the drainage and sidesloped towards the base of Gap Mountain. We took some time to analyze our options from the col and headed straight to the first cliff band, going over to the left for some exposed hands-on on good rocks. We turned back down and scrambled to the very next crest on the right to try this one but it was also greatly exposed and my partner decided to call it a day. I traversed right to the next gully (GR378133) and went straight up to a 3 metres rock band to the right, climbed it and reached the ?dome? going up a steep rubble slope. I turned left and stayed high along the cliff band till the very end of the mountain. I looked up to my right and saw some good hands-on scrambling in a gully (GR377131) leading to the ridgeline. I turned right on the ridge and stayed on it all the way to the summit and passed it thinking the summit was the very last peak but it is the one just before. The ridge scrambling is exposed at times but rock is good so it is mostly a walk with one section of hands-on. When I returned, I did use the scree trails on the west side from time to time to go faster. I returned the exact same way to the col but then we went down the very first dark dirt slope on our right to take advantage of it for a fast and easy descent. Most times we stayed on the left side where dirt was better than the small drainage itself. At some point when most of the elevation was lost, we saw the trail on our left and hiked back to the gravel road and parking lot. The left routes are exposed to impressive cliffs but the rock is great. The route I took is less exposed but loose rocks can be a problem if it is busy, be careful. There were no cairns on my route so I added 4 or 5 on the way down hoping this helps if you choose this option. Tremendous scramble, lots fun and strongly recommended. The views of Kananaskis Lakes are stunning!",
    "directions": "From Calgary, follow Trans-Canada Hwy/AB-1 W to Kananaskis Trail/AB-40 S. Take exit 118 and start your odometer at the Casino entrance and drive for about 60 km to Little Highwood Pass parking lot on your left.",
    "geohash": "c3n0",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/13076/long_Gap-Mountain-Kananaskis-3-Metres-Wall-Easy-Climb-Sep-8-2018-900x422--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13076/long_Gap-Mountain-Kananaskis-Different-Routes-from-Col-Sep-8-2018-900x483--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13076/long_Gap-Mountain-Kananaskis-Scrambling-up-Gully-to-Ridge-Sep-8-2018-900x556--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13076/long_Gap-Mountain-Kananaskis-Summit-Panorama-Fine-Views-Elpoca-Rae-Sep-8-2018-900x222--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13076/long_Gap-Mountain-Kananaskis-Summit-Panorama-View-Kananaskis-Lakes-Pocaterra-Fox-Sarrail-Indefatigable-Wintour-Sep-8-2018-900x212--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13076/reg_Gap-Mountain-Kananaskis-Route-2-Also-Exposed-Sep-8-2018-900x675--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13076/reg_Gap-Mountain-Kananaskis-Route-up-Gully-to-Dome-Sep-8-2018-900x675--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13076/reg_Gap-Mountain-Kananaskis-Welcome-Sep-8-2018-900x675--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13076/narrow_Gap-Mountain-Kananaskis-Route-1-Exposure-Hands-on-Sep-8-2018-675x900--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13076/narrow_Gap-Mountain-Kananaskis-Some-Rain-Rainbow-Beautiful-Sep-8-2018-675x900--44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/gap-mountain-near-kananaskis-ab-13076",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 5,
        "Time": "5 hrs",
        "Total Distance": "5 km",
        "Town": "Kananaskis, AB",
        "Type": "out-and-back"
    },
    "title": "Gap Mountain",
    "trail_id": "13076"
}