{
    "description": "The Tobique is one of the more popular canoeing rivers in New Brunswick. Its head waters begin at Mount Carelton Provincial Park, where the Little Tobique winds its way through a wilderness area. At a location called the Tobique Forks, near Nictau, it grows with the meeting of another two rivers to become the Tobique River proper. From there, it meanders through Plaster Rock, and onto its end where it joins the Saint John River near Perth Andover.\r\nBecause I had never been on this river before, I sought out some advice. A man named Ivan Hicks  organizes the annual Fiddles on the Tobique; a musical boat ride down the river, where several canoes go down together, accompanied by fiddlers. http://www.ivanhicks.com/tobique.htm I'm sure it would be quite the experience. He was able to put me in contact with a couple of different people who know the river, and through some e-mails and phone calls, we settled on a route. Our initial plan was to camp, but a couple by the name of Helen and Doug Edger told us of a great let in spot in Riley Brook, and a great place to stay for the night. -Their old farmstead in Oxbow. Not only that, but they also offered to shuttle our car from our launch point right down to our final let-out spot past Plaster Rock. This was generosity beyond belief!\r\nIt was late in the morning when we arrived in Riley Brook and started arranging items in the canoe. Because we were offered a farmhouse, we dropped most of the bulkier items off there. The only thing to carry in the canoe besides Both Shannon and myself and her son Ryan, were a set of drybags containing our food and dry clothes and such. Thanks to Heather from Halifax's MEC who sent down a 30L \"Bag of Fundy\" drybag for the trip. It was a great contribution to our limited collection. Look for the gear review on the canoe section of the website.\r\nDay 1\r\nWe got underway at around noon and and paddled for about three and a half hours. The gps data that Gord, (one of our gps gurus and co editors from Calgary) sent me was a huge help in positioning us on the map. There were the occasional signs pointing out the various pools which helped too. Our speed was around nine or ten km's per hour according to the GPS. The river had a deceptive current. Most of the time, you could see the rocks flying by on the river bottom. Never the less, Shannon paddles like she's in a race, so I'm sure that accounted for our mid afternoon arrival.\r\nThere is a lot of development along the water. A few full sized homes and several very nice chalet style cottages  (They call them camps) and lodges dotted the water. Just about all of them had 21 ft square-backed canoes with motors mounted on them.\r\nAll that development didn't make for much of a wilderness paddle experience, but there were sections that gave a sense of isolation. If we started further up on the Little Tobique, it would have given us that sense. But despite that, the leaf color was fantastic, and the rolling hills made this river a great attraction.\r\nIt was at around 3:30 when we hit our let-out spot for our night's stay at the farm house. The property was about a 500m  hike away, and it was then that we appreciated not having to carry the big container of stuff from the canoe. The drybags were great for lugging. They're built to take a fair bit of abuse. For example, I dragged the bags pretty much all the way from the let-out spot, through some woods, and across a field. They showed no signs of wear.\r\nThe Farm house was really the highlight of the trip. We had a full kitchen and a wood stove to at our disposal. Doug and Helen lend its use to International Appalachian Trail hikers who find themselves traveling through the area often headed toward the Gaspe region of Quebec. The travel journal called the couple \"trail Angels\" and based on our experience, they certainly are just that.\r\nDay 2\r\nAfter a great night's sleep, we headed out on our second and final leg of our canoe trip. The Oxbow area must take its name after the huge bow in the river's path. The first part of our travel this day would be to paddle through the huge near-loop in the river. It was good that the wind wasn't as strong as the previous day. Another geographical feature of the area is Blue Mountain. It wasn't anything tall, but with the autumn forest color, its hills were carpeted in golds and reds.\r\nThis day's paddling amounted to about 5 hours. some spots were pretty shallow. On a few occasions, we had to get out and drag the canoe along.  At other locations, and especially the area near Plaster Rock, had what probably amounted to class 1 rapids. It wasn't a rock garden by any means, but a rapid here and there made for a moment's excitement amid the mundanness of a slow river. I think the spring time would really change the face of the river. Maybe we'll come back next May long weekend.\r\nOur let-out spot wasn't clearly marked on my GPS, and that was my fault. So as we passed Plaster Rock, we weren't absolutely sure what how much farther to go. My worst fear was to paddle past the location and wind up far beyond the actual take out spot. Things were looking fairly isolated past Plaster Rock until we came around a bend. Doug said that the Motel had its lawn running right down to the river, so I figured that would be a pretty good landmark. Sure enough, we came around the bend, there was what looked like motel structures. There even was an old sign leaning against the back of one structure that gave it away. I was pleased to see it. It put an end to the only uncertain variable of the trip.\r\nIn all, we paddled around 51km from Riley Brook to the Motel past Plaster Rock. The amount of hours in the water weren't that bad, and I figure we could stand to be paddling longer per day the next time we go tripping in the canoe. I certainly wouldn't take my cedar strip down this river. One shallow spot is one too many for that boat. It's a relaxing trip if you ride the current. This is one river I plan to return to. \r\n\r\nShannon Burt\r\nEast Coast Editor for Trailpeak \r\n\r",
    "directions": "From Highway 2 in NB, turn to Florenceville, and then follow the st. John River to Perth Andover. From there, follow the Tobique River along the highway through Plaster Rock,  and Riley Brook. You can let in there.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NB/1307/long_tobique1jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/1307/long_tobique4jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/1307/reg_tobique2jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/1307/reg_tobique3jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/1307/reg_tobique5jpg.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/tobique-river-near-glassville-nb-1307",
    "stats": {
        "Activities": "river-kayak river-canoe",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "14 hrs",
        "Total Distance": "51 km",
        "Town": "Glassville, NB",
        "Type": "out-and-back"
    },
    "title": "Tobique River",
    "trail_id": "1307"
}