{
    "description": "A long time ago, I explored the Debert River and posted a trailpeak post about it.  Long storu short is that I hiked along ways to see some small falls...nothing high like most of the rivers flowing on the south side of the cobequid hills.   Fast forward a few years and I am still haunted by the river and potential fall that I may have missed.  The old map mention a fall of about 35 ft in an area just downstream of a logging road bridge.  so its an easy hike...no bushwack involved.  I was in the area exploring the Folly river and decided to drop in to the Debert river to see that potential fall.I parked around N45° 32' 01.1\" W63° 26' 29.2\"\", and headed for the bridge.  I followed the river downstream.  A small 5ft fall is just downstream of the bridge.  Soon after you enter a mini gorge like setting.  the river here has carved its path through sheer rock walls.  On the downstream end, I could see remnants of rock walls.  the tallest fall in this area is a only a few feet so disappointing in that aspect but the gorge makes it up for scenery.  So the conclusion here is the old map were describing a fall that was probably only present when a dam was constructed along this part of the river...my new topo map actually have a small dam icon at this location!  BTW the best fall to see on Debert is at; N45° 30' 52.8\" W63° 26' 22.5\" or on a tributary (at time of high water only)  at N45° 29' 46.3\" W63° 26' 56.8\".",
    "directions": "In Belmont. Take Belmont Rd heading north.  continue straight on Upper Belmont Rd and turn right at Y intersection at; N45° 30' 13.2\" W63° 23' 12.2\".  continue heading west until you drive down a hill and see a bridge on your left; N45° 32' 01.1\" W63° 26' 29.2\"",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/13078/long_20180831-140624-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13078/long_20180831-140814-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13078/long_20180831-141135-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/debert-river-upper-fall-and-gorge-near-truro-ns-13078",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "1 km",
        "Town": "Truro, NS",
        "Type": "out-and-back"
    },
    "title": "Debert River Upper Fall and gorge",
    "trail_id": "13078"
}