{
    "description": "*** Annual road closure highway 940, from December 1st till April 30th ***Completed on September 15, 2018 in dry conditions.Edwards Rating: II (III) M M, only a hike to first summit5 to 8 hoursElevation of 860 m NET, 1086 m TOT & max 2537 m for the south summit (North at 2466 m)Gear: Poles and GPS useful for route finding on the way down.*****We are biased in our rating I am sure as the scenery today was astonishing! Clouds and rain covering the East, we were never expecting Mount Burke to block them all offering us the most beautiful views ever with a blue sky almost all day! This is mostly a hike on a good trail up to the south summit and then some easy to moderate scrambling if attacking all walls and outcrops straight on the col and down the SW crest. There?s always an easy way to avoid them but the rock is good, exposure almost inexistent and hands-on is fun. Bushwhacking and route finding involved on the way down.From the parking lot (GR716728), we crossed the road and followed the closed campground road for 900 metres and turned right after the bridge following a good trail in the grass (GR723733). After about 300 metres, we saw a trail going up on our left (GR726732) and followed it all the way to the treeline. There is an old trail at some point going straight up but we didn?t bother and followed the best trail switching back and forth a dozen times maybe. The route is obvious along the ridge to the fire lookout from there. From the South Summit we continued north and lost maybe 30 metres of elevation going left (West) to find a weakness in the cliff band below us (GR762738). We down climbed and came back right away to the col and followed the ridge all the way to the north summit (GR757753). There?s always an easier way on the left but we climbed all bands and outcrops for some fun hands-on staying on the ridge all the time. We went down SW following a crest with again some interesting outcrops we climbed to make it more interesting but they can be circumvented on the left if you prefer to avoid them. Once at the treeline, we continued to go almost straight down thinking that we could be cliffed out on either side eventually. We got into some terrible bushwhacking by doing so at some point and started sidesloping to the right to get out of there and finally found a faint trail along a small drainage (GR740742). It was much better there so we followed it down to a creekbed. We turned right (GR733741) following animal trails on the right side until we got to a clearing (GR728741) on the left side of the creekbed that we traversed to reach the Cataract Creek Campground. We took the right fork and that eventually led us back to where we started. The descent was fun until we got to the treeline so I would suggest trying to stay left and follow the cliff/rock ribs as long as possible. It may bring you back to the ascent route faster avoiding some frustrating bushwhacking.",
    "directions": "From Calgary, follow Trans-Canada Highway/AB-1 W, take exit 161A for AB-22 S toward Bragg Creek/Redwood Meadows and go south for about 88 km following directions to stay on AB-22 S. Just before Longview, turn right onto Highway 541 and drive 43.1 km, turn left on highway 940. Continue on this road for about 13.5 km and park in the parking lot on your right if the campground road is closed (on the left).",
    "geohash": "c2yw",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/13080/long_Mount-Burke-Loop-Kananaskis-Marry-Scrambling-Incredible-Scenery-Sep-15-2018-900x317--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13080/long_Mount-Burke-Loop-Kananaskis-Ridge-Rainbow-Cloud-Stunning-Sep-15-2018-900x203--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13080/long_Mount-Burke-Loop-Kananaskis-Some-Fun-Scrambling-Sep-15-2018-3-900x481--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13080/long_Mount-Burke-Loop-Kananaskis-South-Summit-Panorama-Wow-Sep-15-2018-900x257--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13080/long_Mount-Burke-Loop-Kananaskis-South-Summit-Selfie-Sep-15-2018-4-900x386--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13080/long_Mount-Burke-Loop-Kananaskis-View-2-Summits-Beautiful-Sep-15-2018-900x211--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13080/reg_Mount-Burke-Loop-Kananaskis-Close-View-Sea-of-Clouds-Superb-Sep-15-2018-900x675--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13080/reg_Mount-Burke-Loop-Kananaskis-Some-Fun-Scrambling-Sep-15-2018-5-900x675--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13080/reg_Mount-Burke-Loop-Kananaskis-South-Summit-Ridge-Blocking-Clouds-Sep-15-2018-1-900x675--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13080/reg_Mount-Burke-Loop-Kananaskis-Welcome-Sep-15-2018-900x675--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13080/reg_Mount-Burke-Loop-Kananaskis-Welcome-View-from-Road-Sep-15-2018-900x781--44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mount-burke-loop-south-to-north-summit-near-longview-ab-13080",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 5,
        "Time": "6 hrs",
        "Total Distance": "14 km",
        "Town": "Longview, AB",
        "Type": "out-and-back"
    },
    "title": "Mount Burke Loop (South to North Summit)",
    "trail_id": "13080"
}