{
    "description": "This is a hike to a mostly unknown waterfall.  The location was shared to me by another explorer (A Crowley).  After a long day exploring falls on this shore of Cape Brewton Island, I finished it at Pathend Brook.  I wasn?t sure there would be falls but the satellite imagery showed a lot of potential.   The walk upstream is simple as you just follow the brook in a deeply incised V shape valley.  The walk can be moderate sometimes as there are lots of large boulders to contend with.  After walking about 1.54km you finally arrive at some decent falls.  I was able to climb the side of the lower fall and get into a small gorge at the top of it.  At the end of this gorge is the tallest waterfall.  The whole area is surreal?the gorge has straight rock walls on every side and the last fall hugs the wall on its descent and is partially hidden at the back of the gorge as there is a large and possible deep pool.",
    "directions": "Cabot Trail from Baddeck towards Ingonish.  Park just before you go up Cape Smokey (in the only 180 degree turn).  Park at; N46.58336° W60.39635°  Falls at;  N46.58944° W60.41349°",
    "geohash": "f8m11",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/13087/reg_100.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13087/reg_DSC-1757-1--27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13087/reg_DSC-1790-1--27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13087/narrow_115_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13087/narrow_DSC-1765-1--27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/pathend-brook-fall-near-ingonish-ns-13087",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 5,
        "Time": "2 hrs",
        "Total Distance": "5 km",
        "Town": "Ingonish, NS",
        "Type": "out-and-back"
    },
    "title": "Pathend Brook Fall",
    "trail_id": "13087"
}