{
    "description": "Edwards Rating: II (III) S MNet elevation of approx. 972 m, TOT of approx. 1221 m and max 2686 m4 to 7 hoursCompleted in dry conditions on September 28, 2014 and with rain and snow on September 22 2018. Even though snow increases the level of difficulty, it is doable as exposure is minimal here and accumulation was under 10 cm below the summit.****This is an easy scramble but the only reason some people rate it as moderate is probably because of the bushwhacking, route finding and rock bands. Technically, it's not too challenging. Views are fine (back of the Three Sisters, Peter Lougheed and Spray Lakes) and there's no one there as they all go the other way to the popular Windtower.Starting on the Wind Pass trail, walk for about 1 to 1.4 km. As soon as you see the rock bands starting to get higher, you'll discover some faint trails on your left. Your goal here should be to bushwhack sidesloping without taking too much elevation until you see a large cliff band. If you get higher before getting to it, you may find that this cliff is more of a climb and go back down to its very beginning down the tree line like I did. Once at the cliff, I went above it and then view opens up on a rubble slope that you can just hike up to the summit ridge. Then, you go left and will have to scramble up small rock bands and turn right to attain the summit towards the end of the ridge.You can go down the same way but I suggest that you take this obvious scree slope down, it's easier for the knees and faster getting you down the tree line where you go on your left to gain back the beginning of the cliff band and bushwhack back to the official trail.My GPS data shows 2 different trails and both are fine, as I cleared waypoints from some extra route finding I did along the cliff. I would really just recommend that you get off the official trail as soon as you are close to the tree line.",
    "directions": "From Canmore, follow Spray Lakes Road for about 22 km starting your odometer at the Bow River Bridge. You can park on both side of the road and the trail starts to the left side of a dry drainage.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/13084/long_1-3--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13084/long_1-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13084/long_1-5--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13084/long_1-6--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13084/long_1-8--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13084/long_Rimwall-Summit-Kananaskis-Sept-28-2014-1-900x506--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13084/long_Rimwall-Summit-Kananaskis-Summit-View-of-The-Three-Sisters-Sept-28-2014-900x506--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13084/long_Rimwall-Summit-Kananaskis-Summit-View-of-Wind-Ridge-Pigeon-Sept-28-2014-1-900x506--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13084/long_Rimwall-Summit-Kananaskis-Welcome-Sept-28-2014-900x517--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13084/reg_0-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13084/reg_1-4--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13084/reg_1-7--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13084/narrow_1-9--44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/rimwall-near-canmore-ab-13084",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 3,
        "Time": "5 hrs",
        "Total Distance": "7 km",
        "Town": "Canmore, AB",
        "Type": "out-and-back"
    },
    "title": "Rimwall",
    "trail_id": "13084"
}