{
    "description": "This is a hike to two different areas on timber Brook, Cape Breton Island to explore for waterfalls.   The first part of the hike will get you down into a deep gorge like setting to see about 6-7 waterfalls all located within 500m or so.  I used the atv/ snowmobile trail located at; N46.31870° W60.64118°.  I hiked on it going uphill until I veered into the woods on the left hand side of the trail.  I carefully made my way down the gorge at approx. (N46.32815° W60.65213°) ?if you go too far upstream, there are sheer rock walls on the side of the river preventing an easy descent.  Once at the bottom of the gorge, I was amazed by the many many many waterfalls.  I followed the brook and waterfalls going upstream until I exited the stream at the ATV  bridge.    This whole part can be tricky in times of high water.  The drops are beautiful and accessible by scrambling on rocks the whole way upstream. Then I just continued on the ATV trail going uphill to approximately N46.34368° W60.65355°. I went down into the woods on the right until I hit the brook.  Around N46.34397° W60.64992° is the most beautiful waterfall on this brook?it?s a single true drop of over 50ft with sheer rock walls on both sides.",
    "directions": "Cabot Trail to Oregon Rd (same rd as going to the North river Fall trailhead.)  An ATV path starts off this road on the  right at;  N46.31870° W60.64118°",
    "geohash": "f8hz",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/13089/reg_DSC-1802-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13089/reg_DSC-1803-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13089/reg_DSC-1809-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13089/reg_DSC-1822-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13089/reg_DSC-1829-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13089/narrow_DSC-1792-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/timber-brook-falls-near-baddeck-ns-13089",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 5,
        "Time": "4 hrs",
        "Total Distance": "8 km",
        "Town": "Baddeck, NS",
        "Type": "out-and-back"
    },
    "title": "Timber Brook Falls",
    "trail_id": "13089"
}