{
    "description": "I have seen a lot of waterfalls so far in my life but this is one that truly stands out.  I?ll tell you why in a bit but first a few words of caution.  The last 500m or so of this hike had me using a lot of bouldering skills in some very exposed cliffs on the way to the base of the fall.  The water level was very high at the time of my hike and because of that I had to choose one side of the river for the whole hike.  Judging from satellite imagery, I kind of knew  it was going to be difficult on the north side of the brook.  That being said, I?ll describe my own hike but I think the better way would be using the forest on the south side of the river to get to the LARGEST waterfall on the Corney Brook system.This exploration started a while ago as I was looking at a new series of satellite imagery of the Highlands of Cape Breton.  One cannot fail to notice a huge white spot set in a ravine or gorge like setting on the main branch of Corney Brook.   BTW, another trailpeak entry in this watershed was done by myself a while ago (Secret Corney Brook Fall).  I wanted to do this hike in the summer to have more daylight but only managed to get there in mid-afternoon in October so I really had to hurry.  My turn around time for the hike was 2 hours one-way so I could get out and back at trailhead around 6pm as sunset was at 630pm.  The start of this hike is the Corney Brook trail in the CBHNP.  The first 3.5km are the official trail which finished at the small (20ft) but scenic Corney Brook (tributary) Fall.  Then the fun begins.  Cross the small tributary brook and follow the main Corney Brook upstream.  The first 1.2km or so is quite easy but still requires a bit of bushwacking in a largely deciduous/mature forest.  Then you finally come to a point where you cannot just follow the edge of the brook you have to climb uphill quite a lot as there are sheer rock walls on both sides of the brook (46.718470°, -60.881391°)   NOTE; if I had a choice this where I would have crossed to the south side of the brook to continue BUT that option wasn?t available on the day of my hike.Once high enough above the water, I was super lucky to find a small narrow ledge that took me to the cliff?s edge and after a few bouldering moves, I was able to climb back down to the brook",
    "directions": "Cabot Trail north of Cheticamp.  In the CBHNP, park at Corney Brook trailhead (46.725164°, -60.925042°)",
    "geohash": "f8k9",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/13092/long_20181016-150656-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13092/long_20181016-155458-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13092/reg_44310970-1233887236751118-6437667677577150464-n-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13092/narrow_20181016-152235-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13092/narrow_44382272-1233887210084454-1740807067486126080-n-27177_best1_.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/corney-brook-largest-waterfall-near-cheticamp-ns-13092",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 5,
        "Time": "4 hrs",
        "Total Distance": "11 km",
        "Town": "Cheticamp, NS",
        "Type": "out-and-back"
    },
    "title": "Corney Brook - Largest Waterfall",
    "trail_id": "13092"
}