{
    "description": "This is a rare treat for me.  I explored on a hunch a part of a river in the Annapolis valley and was extremely lucky to find a beautiful, and wide waterfall set in a gorgeous mature evergreen ravine.  This waterfall is on Delanceys Brook.  This particular brook flows a good distance before it empties into the Annapolis River.  On its way it looses a lot of elevation down the South Mountain.  I had previously explored a small portion of this brook and added a trailpeak post on it.  That fall even made it in my waterfall guide, however this one described below is even better than the one in my guide!  Note to self; a good one for volume 2!To access the river, I used a road that passed by some farms, fields and then entered the forest.  I didn't continue much further as I wanted to get to the river as quickly as possible because I wasn't sure if there were any falls on it. I had mapped out a few waypoints to check that looked promising.  Immediately, I was on an old logging road that was overgrown but I could see a faint path.  Further ahead was a hunting blind so you want to avoid this area during hunting season.  Right after the blind, the old logging road descends and ends by the side of the river.   From the car to the river, its only about 400m.  Then I followed the brook upstream for another 500m or so.  Within than 500m there were some interesting rock walls and some small cascades.  The best was for last, as I soon saw this massive (for the Annapolis Valley) fall set in an evergreen ravine.  The left side is framed by a rock wall while the right side has a nice mossy slope.   I spend a good while taking pictures before getting out of the ravine to try to cross the river above the fall.  That's when I noticed a small cottage like structure set back into the woods.  This cottage is probably accessed via the logging road intersection where I had left my car.",
    "directions": "Highway 10 south in Middleton.  Turn on highway 201 heading west.  Turn on Neily Rd and drive about 1.3km to where the logging roads have a Y intersection.  Don't take those but rather take the overgrown looking track heading west and right to the river (see my gps track).",
    "geohash": "dxcxr",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/13095/reg_delanceys8-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13095/reg_delanceys-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13095/reg_delanceys1-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13095/reg_delanceys2-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13095/reg_delanceys3-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13095/reg_delanceys4-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13095/reg_delanceys5-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13095/reg_delanceys6-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13095/reg_delanceys7-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/delanceys-brook-lower-fall-near-middleton-ns-13095",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 5,
        "Time": "1 hrs",
        "Total Distance": "3 km",
        "Town": "Middleton, NS",
        "Type": "out-and-back"
    },
    "title": "Delanceys Brook Lower Fall",
    "trail_id": "13095"
}