{
    "description": "This is a hike along an unassuming brook flowing under the Trans Canada highway in Cape Breton.  Thousands of people every day pass right by the hidden waterfalls located on this brook.  I have been guilty of the same but finally took a chance and hiked upstream to see if I could discover/ explore some possible waterfalls?.spoiler alert; I wasn?t disappointed!The walk starts in a mixed forest and is uphill for about 2km and gains about 700ft.  Once you have left the side of the highway, you bisect the power line corridor.  Once close to the stream, you enter and never really leave a mature hardwood forest.  The trees are widely spaced apart and the forest floor is covered by ferns.  The brook for the first 1km or so from the highway does not have any waterfalls .  however as soon as you reach the first one, the fall keep coming like clockwork every 100m or so.  This brook has a surprisingly large number of them.  The most scenic fall is almost at the top of the hill with a nice two tier drop of about 35ft or so (N46.02892° W60.98567°).Once I finished the hike I climbed the top of the ravine.  Made my way at the top of the hill in some cleared areas filled with blackberry brambles and eventually crossed a logging road that took me right down close to the highway and me vehicle. This was a very nice surprise to me.  The only caveat is that the brook is fairly small so only attempt after a rain event or during spring melt.",
    "directions": "Trans Canada highway to where MacIver Brook crosses the road at; N46.02203° W60.97660°.  there is a house on the right side of the brook so park about 100m before you reach the house (heading east) and start walking in the woods from there.",
    "geohash": "f8htu",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/13093/reg_44244072-1233897650083410-3997437211845853184-n-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13093/reg_44269443-1233897910083384-5422842849144078336-n-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13093/narrow_44172248-1233897693416739-6711583559091486720-n-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13093/narrow_44243075-1233897880083387-4319849991460880384-n-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/maciver-brook-falls-near-baddeck-ns-13093",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 5,
        "Time": "1 hrs",
        "Total Distance": "4 km",
        "Town": "Baddeck, NS",
        "Type": "out-and-back"
    },
    "title": "MacIver Brook Falls",
    "trail_id": "13093"
}