{
    "description": "his is one of the greatest waterfall hike to do in Cape Breton.  The number and types of waterfalls on this brook put it in my top ten.  Follow the powerline corridor towards Goose cove Brook on the left side (300m) of the road.  After about 1.2km, of bushwack on the top of the ravine (don?t follow the brook before this point), the terrain finally descends to the height of the brook.  There is a small 10ft fall here.  Further upstream you will pass a large gypsum outcrop in the river.  Further upstream  (2km after leaving your car), you will come up to where two main branches of Goose Cove Brook meet.  I went on the north Branch first as there was a small 20ft fall right there.  Above it is a massive multi tier 70ft plus series of drops?above that are more and more smaller falls until you get to the most scenic of all the falls?a single true drop of about 40ft or so at;   N46.26642° W60.66328° From this point, I decided to try to meet up the other branch without losing any elevation.  The bushwacking was moderate to easy and soon (250m or so) I was at the other branch.  This branch has a massive fall at N46.26394° W60.65882°.  From the top of this fall you can actually see all the way to the Kelly Mountain lookoff and vice versa?I have seen this fall from the lookout when leaves are down from trees!",
    "directions": "Cabot Trail to goose cove.  Turn on Meadow Rd and continue 1km to power lines overhead (N46.26783° W60.63532°)",
    "geohash": "f8hz",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/13090/reg_DSC-1671-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13090/reg_DSC-1689-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13090/reg_DSC-1728-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13090/narrow_DSC-1702-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13090/narrow_DSC-1721-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13090/narrow_DSC-1727-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/goose-cove-brook-falls-near-baddeck-ns-13090",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 5,
        "Time": "4 hrs",
        "Total Distance": "8 km",
        "Town": "Baddeck, NS",
        "Type": "out-and-back"
    },
    "title": "Goose Cove Brook Falls",
    "trail_id": "13090"
}