{
    "description": "Whenever I plan an exploration hike, I try to see if there are more things to explore nearby.  After finishing exploring the massive fall above Uisge Ban fall, I decided to check out an unnamed tributary running to the north of Falls Brook.  I could see some weird topography on the sateilte image but not telltale sign of a fall (like a large white spot!)This tributary to the North Branch Baddeck River is only about 500m from Falls Brook so it makes sense to visit both on the same day if you are travelling from far away.  This brook has 3 major drops all within 100m.  the problem is that the uppermost drop can only be seen from the upstream portion.  The two bottom drop may be seen by circumnavigation the cliffs surround them (see my track)Setting off from the landing strip make your way to N46.21838° W60.79256° by using the overgrown logging roads.  From here cut towards the unnamed brook trying to get to a point around (N46.21948° W60.78946°) since the further upstream you are, the easier the walk down the ravine is.  The first drop is at N46.21899° W60.78798° and is a single drop of about 35ft.  Then the water runs into a small opening and out to some cliffs.Art this point climb back up the ravine side and find your way down around N46.21742° W60.78681°.  Even here you have to be careful, the slope is very steep.  A small ephemeral stream guide you down the slope.  Then traverse the slope all the way back to the unnamed brook.  There is a first drop at N46.21888° W60.78598° which is set in a hardwood forest and is about 2ft.  then go upstream to the biggest drop of them all on this brook.  It has three different tiers but the topmost one is really hard to get to or see as you have to climb on the right hand side of the brook to explore it (approx. N46.21911° W60.78731°).The track I took that day was about 4km to airstrip or less if you are also doing Falls Brook Falls next door!   The elevation gain/loss was a whopping 2000ft!  Not bad for Nova Scotia!",
    "directions": "Highlands Road in Cape Breton to the emergency landing strip at;  N46.21988° W60.81158°",
    "geohash": "f8hyb",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/13101/narrow_45636433-1247090732097435-7489139142664650752-n-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13101/narrow_45674710-1247090695430772-1596091812349476864-n-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13101/narrow_45693278-1247090738764101-2048417405524246528-n-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/airstrip-falls-near-baddeck-ns-13101",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 5,
        "Time": "2 hrs",
        "Total Distance": "4 km",
        "Town": "Baddeck, NS",
        "Type": "out-and-back"
    },
    "title": "Airstrip Falls",
    "trail_id": "13101"
}