{
    "description": "I had been dreaming about this place for a while and I finally had the opportunity to explore Falls Brook in Cape Breton.  Falls Brook is mostly known for the celebrated Uisge Ban fall (and provincial park).  A nice trail leads you to a beautiful waterfall in that provincial park.  But this post is NOT about Uisge ban fall.  Rather this post describes what you will see if you decide to go off trail and visit the remote valley located upstream of Uisge Ban fall.  Spoiler alert; you will see two falls on this 5km hike which has about 1600ft of elevation change in total.As I mentioned there are no trails on this hike.  You start near the emergency air strip on top of the Highlands which is reachable via the highlands (logging) Rd.  Park at the strip and follow my track on an overgrown logging road heading southeast end then east.  The track attached below is a loop and I will tell you about the optimal way to get to the falls.  There is a large rocky cliff at the lower fall and of course there is two ways to get down to the base of the fall.  I did both sides of the river and one side is WAY easier than the other.Walking on the overgrown road, there is a small tributary at N46.21742° W60.80421°.  This tributary has a fall where it meets Falls Brook (N46.21401° W60.79670°).  It will be easier to come back via this tributary than to follow it downstream (like I did!).  Instead continue on logging road to N46.21929° W60.79585°.  Here the road split in two.  Veer to the right and hike 300m to its conclusion.  From this point aim your GPS to this waypoint (N46.21575° W60.79396°).  If you do, you will find yourself into a small ravine that leads you all the way to the base of a massive 60ft fall.  You will know you are in the right spot if the whole way down you have a rock wall on the right hand side.  The slope is mostly scree close to the rock wall but it?s manageable.The waterfall here is magnificent (N46.21417° W60.79361°).  It I framed by rock walls on both sides and has a huge boulder at its base with some water running right in the middle of it.  The forest surrounding you is a mature hardwood with a high canopy.   If you follow my track, it will take you downstream a bit and then go up the ravine side to bypass the cliffs.  One more thing?if you like high places, you can actually get to the top of the waterfall with a vantage view of the valley at; N46.21417° W60.79361°.If you don?t like high vantage points, just continue up the valley passed many cascades until you meet the tributary to your right.  It has a 30ft high fall at this point.  Then just follow the brook upstream and back to where it meets the logging road.  Enjoy!",
    "directions": "Highlands Road in Cape Breton to the emergency landing strip at;  N46.21988° W60.81158°",
    "geohash": "f8hyb",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/13100/narrow_45561374-1247054348767740-8907845717607841792-n-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13100/narrow_45565711-1247054448767730-3916885916253159424-n-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13100/narrow_45572515-1247054235434418-8439024284625534976-n-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/falls-brook-fall-near-baddeck-ns-13100",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 5,
        "Time": "2 hrs",
        "Total Distance": "5 km",
        "Town": "Baddeck, NS",
        "Type": "out-and-back"
    },
    "title": "Falls Brook Fall",
    "trail_id": "13100"
}