{
    "description": "*** Annual road closure highway 40 South (Highwood), from December 1st till June 14th ***Completed on November 3, 2018 in winter conditions but avalanche danger inexistent today.Edwards Rating: II (II) S S3 to 4.5 hoursElevation of 584 m NET, 609 m TOT & max 2432 m Gear: Poles, microspikes, GPS device with no cairns and many animal trails. There are some flagged trees.*****Northern peak on elk range, passed Mount Pocaterra. This scramble requires bushwhacking and route finding as you?ll have access to many animal trails so it can become quite confusing. Focus on the end goal, choose a line up once below summit-false summit block and go straight up to the col (opening to the right side of the block). That?s not what we?ve done instead looking for a good trail and it was a waste of time. Nice short scramble with some brief exposure between the false and true summits. Views of Kananaskis Lakes and surroundings are tremendous.From the parking lot, we went down the slope and turned right on the fire road. We followed it for approx. 1.2 km and saw a trail on our left (GR369113) going up east and along Roberta. We followed that trail and turned right at some point to go up a treed ridge. The best option is rather look for a wide gully on your right, about 400-500 metres onto that good trail. Some trees are flagged but we missed them on the way up. We used animal trails to go up to the col and turned left to scramble up the false summit. Then the true summit is just a few minutes away and involves minimal exposure. We had our microspikes on as there was quite a bit of snow up there.Going down, we followed the same trail to the col, went down maybe 100 metres on the treed ridge and looked for an opening to our right to reach that avalanche gully (GR375107) below the false summit. We went down the gully for a quick descent to the forest. We bushwhacked a few minutes until we crossed that good trail we came up from. We turned left and back to the fire road.",
    "directions": "From Calgary, follow Trans-Canada Hwy/AB-1 W to Kananaskis Trail/AB-40 S. Take exit 118, start your odometer at the Casino entrance and drive for about 58.2 km and turn right at the parking lot. There is no indication but it is quite obvious and if you get to Little Highwood Pass parking lot you just missed it by 2 km.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/13102/long_Mount-Roberta-Kananaskis-Down-False-Summit-Nice-Nov-4-2018-900x346--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13102/long_Mount-Roberta-Kananaskis-Kananaskis-Lakes-Mt-Sarrail-Fox-Foch-Lyautey-Nice-Nov-4-2018-900x357--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13102/long_Mount-Roberta-Kananaskis-Summit-Panorama-Gap-Elpoca-Rae-Pocaterra-Nov-4-2018-900x210--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13102/long_Mount-Roberta-Kananaskis-Up-to-Summit-Nov-4-2018-900x357--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13102/reg_Mount-Roberta-Kananaskis-Welcome-Route-Nov-4-2018-900x689--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13102/narrow_Mount-Roberta-Kananaskis-Female-Grouse-Hiding-up-a-Tree-Nov-4-2018-675x900--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13102/narrow_Mount-Roberta-Kananaskis-Some-Exposure-False-to-True-Summit-Nov-4-2018-675x900--44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mount-roberta-near-kananaskis-ab-13102",
    "stats": {
        "Activities": "hike snowshoe",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 3,
        "Time": "4 hrs",
        "Total Distance": "6 km",
        "Town": "Kananaskis, AB",
        "Type": "out-and-back"
    },
    "title": "Mount Roberta",
    "trail_id": "13102"
}