{
    "description": "This is a very nice hike to two different waterfalls located in the Boisdale hills/ Islandview area of Cape Breton.  MacMullin Brook and Dugald Brook both have magnificent waterfalls before they join Indian Brook.I accessed both of them via an old ATV trail sometimes called Beaver Cove Rd on maps.   This ATV trails starts in Eskasoni but it crosses Indian Brook immediately after the village and with all the rain of the 2018 fall season, I was afraid it would be impassable that way.  So instead I accessed the ATV trail via some logging roads that start off the Bourinot Rd.  The road is quite long and can have many potholes but nothing outrageous.  Take your time and you?ll make it there no problem or use mtn bikes to increase the self-propelled distance!I left my car and immediately saw some flagging tape in the general direction I wanted to take.   Sure enough, a very overgrown skidder track is flagged from the end of the logging road all the way to the ATV path (Beaver Cove Rd).  Once on the ATV path go right or left but make sure to do both.  I went to the left first to reach MacMullin Brook.  Once the trail intersected the brook, I followed it downstream to a waterfall constituted of 3 major drops (N45.99896° W60.55584°).  The first one is easy to get to and photograph.  The second one is a bit more tricky but manageable.  As you take pictures of the second one, the third drop is right beside you and you can get a good sense of its great height!  There are fossils in the rocks and a great exposure of rock on the north side of the brook where the major drop is located.  I eventually made my way to the bottom of the last drop but there was so much water and spry that it was hard to take a great picture.  The last fall would drop probably a good 40-50ft.Returning to the ATV path, I followed it to Dugald Brook.  Where the path intersects the brook, you just follow the brook downstream.  There are some smaller falls at first of 6-10ft and then the most beautiful single drop can be reached a bit further downstream.  The last drop is not very high?maybe 25ft but so gorgeous as it is framed by rock walls (N45.98780° W60.57495°).",
    "directions": "On the Bourinot Rd, turn on Loon Lake Rd and follow 15.5km of logging roads all the way to an area at; N45.99530° W60.56979°.",
    "geohash": "f8hv",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/13105/reg_45539880-1247681725371669-8698810776003018752-n-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13105/reg_45613464-1247652102041298-1172109318246367232-n-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13105/reg_45626254-1247653542041154-5652844966389481472-n-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13105/reg_45630786-1247653402041168-618475200429686784-n-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13105/reg_45651810-1247653148707860-7188711664982687744-n-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13105/reg_45679777-1247681752038333-1511067578900938752-n-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13105/narrow_45569152-1247653738707801-7010358187329060864-n-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/dugald-and-macmullin-brook-falls-near-sydney-ns-13105",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 5,
        "Time": "4 hrs",
        "Total Distance": "4 km",
        "Town": "Sydney, NS",
        "Type": "out-and-back"
    },
    "title": "Dugald and MacMullin Brook Falls",
    "trail_id": "13105"
}