{
    "description": "This is an easy exploration hike to a seldom visited waterfall near Grand Lake, Halifax.   I was looking at this stream for a while on topographical maps and I had a hunch that there could be a fall in one particular section.  Satellite images weren't revealing anything so I decided to check it out.  the dirt road I took had lots of potholes but is passable to a point where beavers have flooded a good section of the road.From there, I set off on foot and decided to follow another tributary to see if there would be more falls.  This smaller tributary looses some elevation but there are no falls on it.  This smaller stream ends up flowing into Slaty Brook.   I followed slaty Brook upstream and was immediately walking in a mature evergreen forest with high banks on either side of the brook.  Soon enough I emerged in front of a two tier fall of about 20ft. Between the two tiers, there is an exposure of slate that is quite scenic.  The forest all around also has a deep cover of moss that is tremendous.  There are a few more small falls upstream of the main one.  I left the river when I got to a fall which had an old campsite setup on its bank.",
    "directions": "Highway 2 in Enfield.  Turn on Old Enfield Rd.   Go over highway 102 and turn right continuing on Old Enfield Rd and then left on Renfrew Rd which becomes More Vista Rd.  continue on Monte vista Rd to a dirt road on the left (sometimes called Scott Paper Rd).  Follow the main road to an intersection at 44.960133, -63.618948 and turn left on a smaller road at this point.  The road his flooded at; 44.955405, -63.614595.  Leave your car and walk to the fall at;  N44.95230° -W63.60428°.",
    "geohash": "dxfz",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/13108/reg_slaty-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13108/reg_slaty3-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13108/reg_slaty4-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13108/reg_slaty5-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13108/narrow_slaty2-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13108/Capture.JPG"
    ],
    "source_url": "https://trailpeak.com/trails/slaty-brook-fall-near-halifax-ns-13108",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 5,
        "Time": "1 hrs",
        "Total Distance": "3 km",
        "Town": "Halifax, NS",
        "Type": "out-and-back"
    },
    "title": "Slaty Brook Fall",
    "trail_id": "13108"
}