{
    "description": "Completed on November 17, 2018, snow coveredEdwards Rating: N/A, Hike4 to 7 hoursElevation of 710 m NET, 846 m TOT & max 2165 m Gear: Poles, microspikes, GPS device and/or compass (can be useful in winter conditions).*****This is a nice hike but I would probably only consider doing it again snowshoeing when we lack hiking-scrambling options. There are many ways to complete this hike and I wouldn?t recommend following our descent path down Fir Creek as it involves some bushwhacking above the creek on steep slopes. There are hundreds of trails and some are very good but there?s a lot of animal trails also. I am sure it is obvious when not snow covered though.Starting from the pull-off, we walked a minute west and saw a good trail on our right (GR753863). We went up for a while following the most direct trail. At some point we reached a plateau with views of the hills and continued down the forest turning right at an obvious junction (GR748871) with the goal to reach the eastern shoulder of the hills. We followed a fence (GR748874) going almost straight up to the first high point (GR744881). We continued up following the ridge to the second high point (GR742888), a wide plateau with clear views of the summit. We kept following the ridge now going west to reach the summit (GR726886) and continued to another hill further west. Here the best option would have been to go down south under the summit. Another good option would have been to keep going west and down Gunnery Creek to follow a good trail back to the road but it would have added an extra 2 km probably. We decided to follow a good trail till the end of the ridge passed Fir Creek and go straight down from there with some frustrating bushwhacking and about 2 km back to the car once we reached the road. We came across about 5 high points throughout the day so it makes it for a decent 800+ metres elevation gain. Nothing exceptional here but a nice hike with decent views of Mount Burke, Holy Cross Mountain, Mount Head and so on.",
    "directions": "From Calgary, follow Trans-Canada Highway/AB-1 W, take exit 161A for AB-22 S toward Bragg Creek/Redwood Meadows and go south for about 88 km following directions to stay on AB-22 S. Just before Longview, turn right onto Highway 541 for 34 km where we parked on the right side of the road after the Kananaskis sign where there is a pull-off.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/13111/long_Bull-Creek-Hills-Loop-Kananaskis-Route-Visible-Now-Nov-17-2018-900x314--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13111/long_Bull-Creek-Hills-Loop-Kananaskis-Routes-Nov-17-2018-900x560--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13111/long_Bull-Creek-Hills-Loop-Kananaskis-View-Gunnery,-Holy-Cross-and-Mt-Head-Nov-17-2018-900x374--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13111/reg_Bull-Creek-Hills-Loop-Kananaskis-Closer-View-Holy-Cross-and-Mt-Head-Nov-17-2018-900x675--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13111/reg_Bull-Creek-Hills-Loop-Kananaskis-Impressive-Peaks-West-Nov-17-2018-900x675--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13111/reg_Holy-Cross-Mountain-Kananaskis-Summit-Panorama-Jun-3-2018-3-900x613--44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/bull-creek-hills-loop-east-to-west-near-longview-ab-13111",
    "stats": {
        "Activities": "snowshoe hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "6 hrs",
        "Total Distance": "13 km",
        "Town": "Longview, AB",
        "Type": "out-and-back"
    },
    "title": "Bull Creek Hills Loop (East to West)",
    "trail_id": "13111"
}