{
    "description": "These are the Coquitlam trails recently mapped and plotted for all to see in exquisite detail. I will also add, and I think many in the mountain bike and hike community would agree/Port Moody, that Coquitlam is a hidden gem! It is so close to Vancouver, and hiking trails such as Halvor Lunden are world class.\nCoquitlam has both excellent hiking (see Halvor Lunden trail and Diez Vistas on map and pics) along with North Shore style great mountain biking.  Plenty for everyone, and the unmentioned heroes who sent in this map have also posted some great signage in the area. The trails in Coquitlam also give year round escape to the city-worn! \nOne can access alpine lakes to stunning 360 views of local mountains, to a very well maintained network of trails. Is this Vancouver's hidden Shangri-la, where both mountain bikers and hikers have paradise at their doorsteps.\nIt's one of my favourite areas featuring lung-busting climbs, old growth forests, hidden streams and waterfalls, and, views down Indian arm. On the mountain bike side, trails like four lost souls, and, fat bastard are pure North Shore! Hats off to the trail map submitters!",
    "directions": "Two approaches, one from the Buntzen Lake Parking area (and a long hike up Halvor Lunden trail as indicated on map - not start of Halvor Lunden is cut off, but we'll add the GPS data for it).  Other approach is off Plateau Blvd in Port Moody, or under Power lines at top of Eagle Mountain Drive, then up one od the bike trails.  Note although there is a \"restricted access\" sign at plateaus Blvd, many people ignore this).\nFor directions to Buntzen Lake parking lots and Halvor Lunden hike, here are the complete directions. \nHead east through Port Moody/Coquitlam either from Highway 7a (from the Trans Canada) or from the Barnet Highway from Hastings Street and turn left onto Ioco Drive. Follow Ico Drive around the north shore of Burrard Inlet and follow the signs for Anmore and Buntzen Lake. \nOnce at the parking lot, park near your first entrance to the parking lot area, near the hydro gates.  Once parked, make your way back to the hydro access road where you will see the trailhead map and sign.  Halvor Lunden trail goes up and up and it's easy to follow, easy to find from the parking lot (the furthest area away from the beach - in case it's not clear above).  Just keep going up!  Thanks to trail maintenance groups in the area, there are signs just about at every trail junction, and new connectors now allow you to hike through to the \"mountain bike trails\" and exit (or start) from other areas.",
    "geohash": "c2b8",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/1311/long_Panorama-small-22328.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1311/reg_Coquitlam-Cypress-view.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1311/reg_IMG-1440-16183.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1311/reg_Picture004jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1311/reg_best1_cypresslake.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1311/reg_pg21a.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1311/reg_pg222.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1311/topo_coquitlam.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1311/narrow_Picture003jpg.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/coquitlam-trails-near-coquitlam-bc-1311",
    "stats": {
        "Activities": "hike mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 5,
        "Time": "1 hrs",
        "Total Distance": "15 km",
        "Town": "Coquitlam, BC",
        "Type": "out-and-back"
    },
    "title": "Coquitlam Trails",
    "trail_id": "1311"
}