{
    "description": "I was seeking a waterfall to see on my way to Cheticamp in December 2018.  Snow has come early this year and I wanted something to explore close to the shore AND that would be short because of the limited amount of daylight at this time of year.  Looking at some satellite imagery, I lucked out on Pembroke Brook as I could see some kind of faint white streaks in the woods on an older imagery set.  This was perfect as it was close to a well-travelled road (ie plowed road).  Setting off without prior knowledge, I walked the road that was climbing steeply towards the general area of the fall.  Of course, where I park was another smaller trail on the left that looked like it could go in the right direction but I wasn?t sure.  Anyways, I walked on the road for a while as it climbed up towards the highlands.  At some point, I knew I had to get down into the ravine on the left.  I carefully made my way down on a moderately, snow-covered, steep slope.Walk to s the stream and followed it upstream on something like an overgrown track.  Within 100m I had to cross the stream has the ravine walls are steep on the side I was walking.  The stream was fast flowing and deep so we had to use some fallen trees to cross over.  After crossing, another 0m led to the base of this impressive fall.  It has three main tiers and a total height drop of over 70ft between all the tiers and cascades.  It looks like the upper tier falls into a deep pool where in the summer you could soak in and take in the view.  The falls are approx. at; 46.502146°, -61.046829°.",
    "directions": "Drive from Margaree Hbr towards Cheticamp on the Cabot Trail.  In Cap Le Moine, turn right on McGarry Rd.  Continue on it as it becomes Ch. Des Pierrot. Park at; 46.501358°, -61.055061°.  This is an intersection of a few roads.  Take the  ATV size  one leading to the left into the woods.  Don?t take the one that has a slope or the one on the right if facing the mountains (see my track).",
    "geohash": "f8k8d",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/13116/reg_pembroke1-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13116/narrow_47316569-1266515313488310-8624446505354264576-n-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13116/narrow_47391797-1266515360154972-3954858941887807488-n-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/pembroke-brook-falls-near-cheticamp-ns-13116",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "3 km",
        "Town": "Cheticamp, NS",
        "Type": "out-and-back"
    },
    "title": "Pembroke Brook Falls",
    "trail_id": "13116"
}