{
    "description": "The Gold River has many named falls.  The easiest way to access them is via white water kayak.  I don?t have one so this is how to get to Salmon Fall via the land routePark at approximately; N44.67427° W64.40782°.  On the west side of the road is a Xmax tree farm.  Follow the dirt road in the farm until you reach the woods at the other end.  Get into the woods towards a woods road located at approximately N44.67080° W64.41561°.  Follow this road for about 2km.  this is where it ends?in front of a brook feeding Muddy Lake.  You need to backtrack a bit from here as the stream is wide and deep.  I found a passage via some beaver dams a bit upstream (see my gps track).From there it is a matter of pointing your compass or GPS towards the fall at N44.65655° W64.45292°.  The forest is mostly easy to navigate with some section with shrubs.  About 400m before you get to the gold river, you will cross an old road running parallel to the river.  After the road, you are getting closer to the river and you will see some massive evergreen trees.  You finally get to the fall which is like a cascade type or slider type fall.  There is a large rocky outcrop on the side.  Further downstream are some large boulders on the side of the river and one small rapid like feature.  Unfortunately, the river was running very high in late November and I couldn?t get across. The plan was to see the potential falls on a brook that flows out of Holden Lake and into Gold river.  I would presume the falls to be around?N44.65383° W64.45942°.  Please drop me a note if you do get to see those!",
    "directions": "From highway 101, take highway 12 north towards New Ross.  Near Seffferensville, park at approximately; N44.67427° W64.40782°.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/13115/reg_47044364-1263788503760991-4056044437191524352-n-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13115/reg_47069104-1263788690427639-881426919495565312-n-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13115/reg_47110640-1263789040427604-5299708301431275520-n-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/salmon-fall-near-chester-ns-13115",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "11 km",
        "Town": "Chester, NS",
        "Type": "out-and-back"
    },
    "title": "Salmon Fall",
    "trail_id": "13115"
}