{
    "description": "Completed on January 12, 2019 ? Winter conditions but route mostly dryEdwards Rating: II (III-IV) S S3 to 5 hoursElevation of 720 m NET, 788 m TOT & max 2139 m Gear: Cleats, hiking poles and GPS useful as there is no obvious trail nor flagging system.*****This involves some route finding and bushwhacking but as we improvised today and didn?t know yet where we were heading there might be better options. Our descent route is the GPS I am adding to this page and the most direct route. This is the one I will describe here. It was actually a fun scramble with great rock, hands-on and some exposure towards the end. I have done some research after completing this scramble and even though there are cairns on the two high points, I didn?t see anything about it except for the kilowatt crag, such is the cliff you go up along all the way, nice spot for beginner climbers as there would be a lot of easy routes up that wall.From the highway, walk straight in the clearing until you reach an obvious drainage (GR325474) leading to a gravel road with a TELUS tower. Keep going straight up along the left side of the drainage for a few minutes until you see a scree slope on your left (GR327474). Start going up this slope to reach the rocky ridge, some good hands-on scrambling involved here already. Once up this rock band, turn right and go up along the cliff. There are a few places with short climbs on rock bands and slabs, you can avoid them on the left in the forest if you prefer. We continued up the cliff line all the way to the first high point (GR333467) and the second high point (GR334464). In summer time, it would have been interesting to attempt a climb up the east shoulder of Wasootch Peak and maybe summit Wasootch from there but with the snow, we were not comfortable with the obvious exposure on steep terrain.",
    "directions": "From Calgary, follow Trans-Canada Hwy/AB-1 W to Kananaskis Trail/AB-40 S. Take exit 118, start your odometer at the Casino entrance and drive for about 18.4 km. We parked on the other side of the road by a clearing at GR322478.",
    "geohash": "c3n1u",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/13124/long_Wasootch-NNW-Ridge-Kananaskis-Route-to-Summit-Jan-12-2019-900x381--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13124/long_Wasootch-NNW-Ridge-Kananaskis-Summit-Panorama-View-Wasootch-to-Baldy-Even-Rundle-Far-West-Jan-12-2019-900x209--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13124/long_Wasootch-NNW-Ridge-Kananaskis-Welcome-Detailed-Jan-12-2019-900x545--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13124/reg_Wasootch-NNW-Ridge-Kananaskis-Marry-Scrambling-up-Slabs-Jan-12-2019-895x900--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13124/reg_Wasootch-NNW-Ridge-Kananaskis-Remains-Animal-Bones-and-Wolf-Tracks-it-Seems-Jan-12-2019-1-900x675--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13124/reg_Wasootch-NNW-Ridge-Kananaskis-Sunset-on-Lorette-and-Mary-Barclay-Beautiful-Jan-12-2019-900x581--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13124/narrow_Wasootch-NNW-Ridge-Kananaskis-Marry-up-Crux-Exposed-to-Cliff-Nice-Jan-12-2019-675x900--44639_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13124/narrow_Wasootch-NNW-Ridge-Kananaskis-Up-Crux-Nice-Jan-12-2019-675x900--44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/wasootch-nnw-ridge-gr334464-near-kananaskis-ab-13124",
    "stats": {
        "Activities": "climb hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "4 hrs",
        "Total Distance": "5 km",
        "Town": "Kananaskis, AB",
        "Type": "out-and-back"
    },
    "title": "Wasootch NNW Ridge (GR334464)",
    "trail_id": "13124"
}