{
    "description": "A lot of people think that I only explore for waterfalls but I actually seek out many other natural splendors such as caves, natural arches, sea stacks, old mines and adits and cliffs and crags.  January 2019 as so far produced a lot of snow in cape Breton so my trips to waterfalls in that area have to wait until spring.  Therefore I decided to explore for some cliffs and crags near Halifax in an area near Gibraltar Rock, Musquodoboit River.My ultimate goal were some cliffs I cold seen on satellite imagery of George Lake.  This lake has no trail or road access.  The closest logging road to it actually has a barrier at its start so I decided to bushwack my way from Highway 357 to the lake.  I spotted a few large cliffs or boulders on the sat imagery on the way towards the lake and took a path to them instead of going in a straight direction to that lake.From highway 357 it was a short climb on an ice covered road to the top of the hill.  Where it plateau?s I saw some large and interesting rocks to the right and climbed up there.  Nothing major in terms of sport route but it may have some large boulders to check out.  From then on I bushwacked my way to a logging road and followed it for a whole until I stepped off into the woods and buchwacked to Gibraltar Lake.  The lake was frozen but groaning a lot!  A small feeder stream into Gibraltar Lake 9near a cabin) was where IO steeped off the lake and bushwacked to a few large boulders in the woods (nothing jaw dropping) and ultimately made it to Lake George.  The best climbing on that Lake will be done on a crag on the northeast corner of the lake (where it has a stream that discharges the lake into Saddleback Lake.  Approximately at N44° 51.698' W63° 16.849'.  The south end of the lake and the western side of the lake would offer more bouldering opportunities than anything else.I bushwacked my way back to Gibraltar Lake and made my way to the only cliffs I could spot on that lake at N44° 51.805' W63° 14.864'.  there is definitely potential for climbing here and in January 2019, there was some good ice forming at one spot.My track then shows me going towards the brook that empties Gibraltar Lake into the Musquodoboit River.  There are a few small but scenic falls there.  The river wasn?t frozen enough to cross to the highway so I followed the base of the hills back towards my car.stats for this hike; 19.5km - 6h18min - 1939ft ascent - 1964 descent",
    "directions": "Highway 357.  There is a logging road 1.5km south of the bridge over the Musquodoboit river near Gibraltar Rock or go here; N44° 51.662' W63° 12.866'.",
    "geohash": "dx",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/13126/reg_50534686-1301917343281440-4533533831436697600-n-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13126/reg_51158887-1301920909947750-6357822783845564416-n-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13126/narrow_50396362-1301936063279568-1600393913586155520-n-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13126/narrow_50599226-1301936276612880-2011953773131333632-n-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13126/narrow_50860009-1301936243279550-134615317417558016-n-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/cliffs-and-crags-at-george-lake-near-halifax-ns-13126",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 4,
        "Time": "6 hrs",
        "Total Distance": "20 km",
        "Town": "Halifax, NS",
        "Type": "out-and-back"
    },
    "title": "Cliffs and Crags at George Lake",
    "trail_id": "13126"
}