{
    "description": "Completed on January 1, 2019 ? SnowshoeingEdwards Rating: II (II) S S (Hike but some bushwhacking and route finding involved)2.5 to 4 hoursElevation of 454 m NET, 457 m TOT & max 2197 m Gear: Snowshoes, hiking poles and a GPS useful as views are very limited most of the way in the forest.*****Nothing fancy there and some route finding/bushwhacking (no flags, maybe a trail in summer?) involved but very nice views at the beginning of this low treed ridge of nearby Mount Kent, Black Prince, Blacksmith Ridge? Unobstructed views of Gap Mountain, Rae, Pocaterra and so on further away SE.From the Day Use Area, we snowshoed down to the creek (GR262197) and turned right to find a good recent snowshoe track up a first slope. At the plateau (GR261196), we turned right (west) and then followed the track going SW for a while. We started going up on our right (NW at GR257192) reaching the beginning of the ridge. At this point, we had to open the track and snow was about 4-5 feet steep. We kept going left (north at GR253195) up the ridge until we reached its high point (GR250201) just before it starts going down again. There were no views so we turned back quickly at the beginning of the ridge where views are more interesting. We thought of cutting straight down east but decided to return the same way using our opened track.",
    "directions": "From Calgary, follow Trans-Canada Hwy/AB-1 W to Kananaskis Trail/AB-40 S and take exit 118. Drive south for about 50 km and turn right on Kananaskis Trail/AB-742. Follow that road for about 11.8 km and park on the left side of the road at the Smith-Dorrien Creek Day Use Area (roadside, closed in winter).",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/13122/long_Black-Prince-Outlier-Kananaskis-Ridge-Marry-Looking-at-Mt-Kent-Jan-1-2019-900x309--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13122/long_Black-Prince-Outlier-Kananaskis-Snowy-Ridge-Cougar-Tracks-Jan-1-2019-900x237--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13122/long_Black-Prince-Outlier-Kananaskis-Summit-Panorama-Jan-1-2019-900x214--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13122/long_Black-Prince-Outlier-Kananaskis-Welcome-Jan-1-2019-900x458--44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/black-prince-outlier-near-kananaskis-ab-13122",
    "stats": {
        "Activities": "hike snowshoe",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 3,
        "Time": "3 hrs",
        "Total Distance": "5 km",
        "Town": "Kananaskis, AB",
        "Type": "out-and-back"
    },
    "title": "Black Prince Outlier",
    "trail_id": "13122"
}