{
    "description": "this hike will lead you into the hills running along Uniacke river in an area seldom explored.  The area contain numerous ATV trails that are suitable for mountain bike as well.  The path I took in February 2019 ;ld me on the dozen Uniacke River which helped to decrease the time bushwhacking.  Total hike about 14km, 3.5 hours and about 400m ascent.Start along highway 101 and follow a well maintained road almost to the cellular tower.  Before reaching the tower, an ate splits off on the right.  follow it as it goes downhill and after a while crossed two batches of the Uniacke river with (at that time) well maintained ATV size bridges.Once across follow the main logging road towards Big Indian Lake until your gps points towards Christie hill and the falls.  the first fall is actually not where my gps was pointing.  Its the outlet of Brunswick Lake and has a nice fall at approximately N44 51 40.5 W63 54 28.5.  From there follow the brook towards the lake and cross it on the ice if you are there in the winter.  After its a large logged area thats not super fun but I wanted to check out a huge split rock I could see on sat imagery at; N44 52 09.1 W63 54 48.4From there get into the woods and go down a fairly good slope in a tall evergreen forest towards the brook draining Beeswanger Lake.  I found a small fall full of debris at around; N44 52 05.8 W63 54 26.6.  From there I made it back to the river which I followed on the ice until I found an ATV trail at; N44 52 39.6 W63 54 03.7 which led me back to the main logging road.",
    "directions": "Highway 101 north.  Past the Mt Uniacke exit park close to N44 53 15.2 W63 52 41.5 and follow the road to the cell tower or better yet download the gpx track!",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/13138/reg_51936937-1315607518579089-3712007407774203904-o-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13138/reg_51954183-1315607478579093-1226455570962186240-o-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13138/reg_52011226-1315607505245757-2212042280678719488-o-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/christie-hill-falls-near-halifax-ns-13138",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "4 hrs",
        "Total Distance": "14 km",
        "Town": "Halifax, NS",
        "Type": "out-and-back"
    },
    "title": "Christie Hill Falls",
    "trail_id": "13138"
}