{
    "description": "I often travel for work along the south shore of Nova Scotia.   I?ve bushwacked my way to some of the larger falls in that area (Big Fall, Roseway River Fall, Broad river Fall etc) and I am always looking for some more hidden gems in that area.   I was looking at some sat imagery and saw a few interesting spots just west of Shelburne.   There were spots on Birchtown Brook and next door on Ackers Brook.  Setting off from the highway, I found an ATV trail that was parallel to Birchtwon Brook.  I followed the trail for about 300m and then went to the brook.  There was a small drop (N43° 45.234' W65° 22.966') and lots of foam which explained what I saw on the imagery.  I then bushwacked my way straight towards Ackers Brook.  Not the most pleasant route?.it might be better to get back to the highway instead.I reached Ackers Brook and there were actually some net spots to check (around N43° 45.108' W65° 23.417').  The brook must sometimes have a high flow as the banks of the stream are sometime devoided of vegetation in a very wide area.  There are a few drops in there to check.  The water doesn?t leave the rock face but it?s still scenic nonetheless especially for that are of the province.",
    "directions": "Highway 103, Birchtown brook is located 4.5km west of the exit to Shelburne",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/13130/long_43660720-1230226917117150-5066958264109891584-n-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13130/long_43665209-1230226957117146-8727847705566511104-n-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13130/long_43739990-1230227003783808-6879280166321782784-n-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13130/narrow_43694637-1230226847117157-4308676823018897408-n-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/ackers-brook-fall-near-shelburne-ns-13130",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 2,
        "Time": "1 hrs",
        "Total Distance": "2 km",
        "Town": "Shelburne, NS",
        "Type": "out-and-back"
    },
    "title": "Ackers Brook Fall",
    "trail_id": "13130"
}