{
    "description": "Many mountain bikers begin their bike odyssey in Phoenix and make their way to Sedona, what has become mecca #2 after Moab for great Spring riding. This is great, but, what mountain bikers should not overlook is the excellent riding close to your landing point in Phoenix.  Here you have South Mountain Phoenix and McDowell Mountain above Scottsdale with perhaps some of the best local trails.  South Mountain is central and a real treat.  Although I?ve been to Sedona a number of times to hike or ride, via Phoenix, I never got around to South Mountain.  It?s a fairly big mountain range, right in the middle of the city, and I had heard about it.  Well this time I had the chance, and, I was inspired by riding this classic desert single track.  I was worried it would be crowded and, I think some of the hiking trails do get crowded on weekends.  The hardcore riders probably go early. 9 miles out, and, same back unless you take the cutoff I did back to the shop.In my case, I wasn?t up for the upper technical trails like National, I wanted what I normally seek out, some great desert flow with some technical, lots of cactus, and, the feeling of being surrounded by classic desert-scape.  After all, I was flying in from one of the snowiest winters the east coast has seen in a while.  The trail I rode is called Desert Classic and, it has many side spurs and loops that can make for a great day of riding.  The beginning of my journey was the Curbside Cylery bike shop (4855 E. Warner Road #10 Phoenix, Arizona 85044 480-598-6778), where I have to say, I think I?ve met the friendliest owners and staff of any bike shop I've visited.  Mike?s reputation as one of the best (if not the best) wrench in the valley precedes him, I ran into one rider on my way back to the shop to return my bike, when a rider passing me pointed me in the right direction and offered up some compliments for Curbside.  The shop is well known.  Most riders find a form of sanctuary at the shop close to the trails, and this one is it for South Mountain.  You can also exit the desert classic on your way back fairly close to E Warner for your return trip to the shop and that's what I did. They'll be able to give you all the local info on other places to ride in Phoenix as well.Back to the desert classic ride, after picking up my bike at the shop, I was given directions to the trail head and off I rode directly on 48th street to the trailhead, at the lower slopes and beginning of the mountain terrain at the north end of South Mountain.  Finding the trail head involves taking a golf course road (Pima Canyon - with parking on side of road or at the trailhead). You can just ride in to the trail head as I did.  Look for the large map and washrooms that everyone seems to start and end at.  From here, it?s very simple to get on Desert Classic just exit the washroom to turn left! I did worry a bit about crowds.  That worry was unfounded, however, it was a Saturday in February and a bit cool.  Just the same, I think I maybe came across a dozen or so riders and half-a-dozen hikers the whole time.  It gave me everything I hoped for and more.  Up and down into washes, no excessive sand to contend with, some super fun gravity bowls, twists turns, amongst Saguaro laden single-track. This is what you came for!As you start, you have housing to the left but by the time you reach the water tank and not much further, you lose civilization, or so it seems.  That?s about 45 minutes in, and, it felt great.  At that point, some side spur trails appear which take you up South Mountain to some vistas. You can keep climbing, or loop back down to Desert Classic.  Lovely.  Technical in spots, but, nothing too difficult this is the trail for you for a nice day out of single track.  2-3 hours later, depending on your speed, with some nice descents, you reach the lower parking lot, you?ll see the communications towers up on the peaks, marking the end.  Return here and sample a few alternate return paths, always rejoining Desert Classic.  In my case, about half way back, an exit on the plains put me back on for an easy return to the shop.  So much fun, and my first ride of the new year.  I was happy with that ? if you are in Phoenix to start your mountain bike trips give the local rides a try.  If you need any bike shop help  - beginner and serious riders alike will get everything they need at Curbside, tell them trailpeak sent you!Side Story: As I walked the bike out of the shop to start my ride, I mentioned I ?had a screw loose?, confusing the mechanic on duty, I added, ?not just on my cleats?, and received a good laugh.  So the shoes were fixed up gratis and off I went.  I only regret I only had that day to ride, as he mentioned an area off McDowell mountain that is becoming a real hotspot with great flow.",
    "directions": "Many ways onto South Mountain, if you want to start where most do, it's the Pima Canyon trailhead.  Go up E Pima Canyon Road and park along the side (golf course) or at the official parking lot and trailhead. Many hikers and bikers start here, go to the main map and kiosk where the washrooms are, and, you'll see Desert Classic immediately to the left of the washrooms if exiting.  It's singletrack, very fun!NOTE: if you see the semi-circle loop in the GPS map, that is what leads you on E Warner Elliot to S warner Elliot the bike shop when you exit!",
    "geohash": "9tbm",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/AZ/13146/reg_IMG-1774-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/13146/reg_IMG-1775-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/13146/reg_IMG-1778-5_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/13146/reg_IMG-1780-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/13146/reg_IMG-1781-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/13146/reg_IMG-1782-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/13146/reg_IMG-1785-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/13146/reg_IMG-1786-5.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/desert-classic-near-phoenix-az-13146",
    "stats": {
        "Activities": "hike mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "26 km",
        "Town": "Phoenix, AZ",
        "Type": "out-and-back"
    },
    "title": "Desert Classic",
    "trail_id": "13146"
}