{
    "description": "This trail starts near Kananaskis Lakes in Peter Lougheed Provincial Park in Kananaskis, Alberta, travelling over the Divide and down to Elk Lakes Park in BC, returning by a slightly different route.From the trailhead, walk up the wide gated gravel road, then along the power lines for a further .5 km. After crossing Fox Creek you gradually climb along a now older and narrower road to long and narrow West Elk Pass.Keep straight ahead in the meadows where a trail to the right proceeds up to cross country ski trails. A few hundred meters later- at 5 km- take the signed trail on your right, then left a few hundred meters later to Fox lake.Once past Fox Lake it is mostly downhill to the footbridge over Elk River near the outlet of Upper Elk Lake (9 km). For a longer trek you can proceed right up to Petain Basin. For the trip as described turn left and proceed to Lower Elk Lake Campground at just over 10 km. Elk Lakes is worth spending a few days at. If you ever do this trail, backpack if possible, since the nicest areas are on the BC side, near Elk Lakes. I have heard that the trail up the valley to Petain basin is great, but there is often a problem with high water levels washing out the trail and the campsites upriver(as there was when I did this trip). A lot of wildlife around too- bears (both types), elk, etc.To return, continue down Elk River for another km, turning left at the Wardens' Cabin. You then proceed up to the junction with the trail to Fox Lake mentioned above. Return via West Elk Pass and the power line road.The climbing opportunities are admittedly in the area, not right on the trail as described. For example, Fox Mountain provides scrambling and climbing, but you have to fork off the trail described near the Fox Lake Junction to get to it. Skiing (and snowshoeing) is possible on the trail described plus on some branch trails; likewise for biking.",
    "directions": "Drive south from Canmore on either Highway 40 or Spray Lakes/Smith Dorrien Road. The latter is gravel, but scenic and provides access to many Trails, including one to Mount Assiniboine.The trailhead is on your left about 12 km from the junction of Highway 40 and Kananaskis Lakes Trail (ie Road).",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/1314/reg_DSC00689-7279.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1314/reg_EL1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1314/reg_LowerElk1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1314/reg_P1010038-11674.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1314/reg_P1010059-11674.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1314/reg_UpperElk1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1314/reg_map.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1314/narrow_TrailnearMtFoxgif.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/west-elk-pass-near-kananaskis-ab-1314",
    "stats": {
        "Activities": "climb hike ski-bc mtn-bike",
        "From": "",
        "Seasons": "winter summer",
        "Stars": 4,
        "Time": "6 hrs",
        "Total Distance": "18 km",
        "Town": "Kananaskis, AB",
        "Type": "out-and-back"
    },
    "title": "West Elk Pass",
    "trail_id": "1314"
}