{
    "description": "This is a hike to a series of waterfalls on Roxbury Brook, most of which are seldom visited by humans.  Setting off from Roxbury Rd, take whatever path you want to get to the river.  The first fall are Roxbury Book are at;    N44.83890 W65.18402 From this point, just follow the river upstream to 44.835231, -65.183278.  This is where the west branches of Roxbury Brook (sometimes called Paradise Book) join the south branch Roxbury Brook.  The west branch has more water and at the lat and long above is the most massive series of waterfalls.  there are at least 4 distant drops all located close to each other.  there are also massive boulders on one side of the river which are covered by ferns and have small openings at their bases.   The west branch also has a smaller connection to the south branch just a bit more upstream at; 44.834830, -65.183186 (50m more upstream).  At that location is also a smaller but scenic fall.  Upstream another 100m or so leads you to another three smaller drops on the south branch Roxbury Brook.Following the west branch above the four successive fall, you can see more smaller drops.  I followed the brook another 1.5km or so and saw too many too count falls.  They are smaller but the first is mature and a pleasure to walk through.  I stopped at what could be the last fall or rapid at;  44.825169, -65.198161.",
    "directions": "Highway 201.  turn on Roxbury Road and drive 2.75km or so and park approximately at; 44.840976, -65.180177.  Find your way to the river by going downhill in the woods and follow brook upstream.",
    "geohash": "dxcxh",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/13154/reg_56184388-1350447501761757-2618690626077589504-o-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13154/reg_56226095-1350447078428466-8496592364108775424-o-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13154/reg_56485685-1350447285095112-4400240655276703744-o-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13154/reg_56793247-1350447448428429-5928241744037543936-o-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13154/reg_56887071-1350447111761796-711009197080182784-o-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/roxbury-brook-upper-falls-near-middleton-ns-13154",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 5,
        "Time": "3 hrs",
        "Total Distance": "7 km",
        "Town": "Middleton, NS",
        "Type": "out-and-back"
    },
    "title": "Roxbury Brook (upper falls)",
    "trail_id": "13154"
}