{
    "description": "I was lucky enough to fly over the eastern shore of NS in the fall of 2018.  From the air, I spotted what looked like a waterfall to the northwest of Sheet Harbour.  After looking at some maps and imagery, I narrowed down the list of places where this occurrence was hidden.  There are not a lot of falls on the eastern shore so finding a new one is usually hard!A logging road takes you to within a few hundred metres.  The road is passable as of spring 2019.  Walking on an overgrown secondary logging road, you reach a wide logged area.  Push through the woods to the stream and head upstream.  Within a few minutes of effort, you will reach the waterfalls.  It?s the eastern shore so don?t expect a whopping dropper.  The stream here is separated by a huge rocky island so you get two different waterfalls.  One on each side of the island.  Drops are about 6ft in height but still very scenic",
    "directions": "Highway 224 north from sheet Harbour.  Turn on logging road on the left at; N44.94271° W62.59181°.  continue on it until a large wooden bridge at N44.92869° W62.63859°.  Immediately after bridge turn right and continue until you see a secondary logging road on your right.  Hike to the falls approximately at; N44.93231° W62.64867°",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/13151/reg_55560360-1346064185533422-3537091518865080320-n-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13151/reg_55604045-1346064068866767-6769476870678249472-n-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/grand-lake-brook-falls-near-halifax-ns-13151",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "2 km",
        "Town": "Halifax, NS",
        "Type": "out-and-back"
    },
    "title": "Grand Lake Brook Falls",
    "trail_id": "13151"
}