{
    "description": "This is a hike to two different areas of Tom Brook.  The first waypoint was in my gps for a while as it was a geocache at a roadside (almost) fall at ; N45.34722 W61.50453.  There are 3 drops here just by the side of the highway but hidden by vegetation that most people don't see it.Now Tom Brook has enough elevation change that NS Power has dammed the lake to create a hydroelectric station.  Therefore I knew there could be some more unexplored fall on this brook... had to just bushwack to them.  I parked at a very steep logging road and followed it for a while until my gps pointed me to what I thought could be the most upstream fall potential.  Yes there is a small drop here but the lack of water made it not terribly exciting! (N45.33756 W61.50443).Moving downstream, I found the motherload of falls. There are at least 4 drops here and they are all scenic! (N45.33892 W61.50907).  I then followed the brook further downstream but it wasn't pleasant.  The forest is very thick and full of deadfall.  Didn't see any more significant falls after that area above.",
    "directions": "Take Larrys River Rd south of Guysborough.  If you see the hydroeletric plant you are in the right area.  the logging rd mentionned above is at; N45.34403 W61.50035.",
    "geohash": "f8h3b",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/13168/reg_tom-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13168/reg_tom1-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13168/reg_tom2-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13168/reg_tom3-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13168/reg_tom4-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13168/reg_tom5-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13168/reg_tom6-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/toms-lake-brook-falls-near-canso-ns-13168",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "4 km",
        "Town": "Canso, NS",
        "Type": "out-and-back"
    },
    "title": "Toms Lake Brook Falls",
    "trail_id": "13168"
}