{
    "description": "This hike could be shorter than 12km.  I had to park and walk a ong way on a logging road because of its super soft condition but in summer you might be able to drive al the way to the end.  So I won't talk about the logging road part except that sometimes I passed some seriously tall hardwoods!  At the end of the logging road, aim for the stream with your gps and say your prayers.  The first part is no fun at all.  If you are lucky it's moderate but there are some part that are extreme bushwacking.  The evergreen here really are thick!  If you can bypass those areas and take a longer route...do it!I eventually made it to the river and followed it to fall after fall after fall.  Beacuse of the geology here, you won't find more than a 20ft drop BUT the geology also gives you some unique falls.  Falls with gigantic boulders in them!  There are also house size boulders scattered trhoughout the forest.  Once I finished with the last fall, I aimed to get out by folowing a tributary uphill.  And there were some more drops on that tributary too!  My way out seemed easier than the way in.  The scenery here is really unique.  a cross between Cape Breton highland plateau and Peggy's cove barrens.",
    "directions": "Drive on the Lundy-New Harbour River Rd to a logging road at; N45.27478 W61.50159 if you can drive all the way to;  N45.26234 W61.56330.  Folow gps track to falls.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/13169/reg_efs-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13169/reg_efs1-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13169/reg_efs2-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13169/reg_efs3-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13169/reg_efs4-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13169/reg_efs5-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/eastern-forks-stream-falls-near-canso-ns-13169",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "4 hrs",
        "Total Distance": "12 km",
        "Town": "Canso, NS",
        "Type": "out-and-back"
    },
    "title": "Eastern Forks Stream Falls",
    "trail_id": "13169"
}