{
    "description": "This is an area close to Halifax I wanted to visit for a while.  Just to the east of the airport lies the Clattenburgh Brook wilderness area.  NS environment writes of this area; Clattenburgh Brook Wilderness Area protects ecosystems of the Quartzite Hills and Plains Natural Landscape, an inland landscape, in which changes in forest, bog and barren ecosystems parallel changes in bedrock.Setting off the ATV trail still had lots of snow so I parked early and started to walk.  The first few km are boring as you are essential following the ATV trail.   Around this position (N44.87348 W63.41045) , the trail dissapears and the fun begins!  there is an old concrete culvert at the first stream crossing which was in use back in the days where there was the road that appears in my gps but is now engulfed by vegetation.  I was still absle to kind of follow it to an area where I thought there could be a fall (N44.87394 W63.42113).  There is a 4-5 ft fall here and for this area it is as good as it gets.I wanted to check out some more falls more downstream so I followed the river as it drained into lakes towards my destination.  Yep the area is spectacular with large quartzite cliffs and boukders everywhere.  The stream and lake sides are devoid of forest so unless the area is flooded (it happens), follow the edge of the waterbodies.  The forest is usually thick and hard to traverse in this area. Where Cousin Meadows Brook flows into North Lake (N44.86508 W63.42274) there are some very nice boulders that beg to be bouldered!   The stream crossing can be tricky.  I used a long wood pole and did some olympian pole vaulting across! At the downstream end of North Lake, a brook plunges into the forest and I was tryely impressed to find a few waterfalls with a total height of 25ft plus...ok not 25ft in one drop but rather as a series of small drops.  The forest around there is fun to walk through with giant conifers!To head back to my car, I followed Cousin Meadow Brook.  The walking was actually very good that way.  And you will get to see the tallest drop of all the fall on this journey at N44.86946 W63.41572.  It's only about 10ft but it's gorgeous.  A short bushwack brout me bach to the concrete culvert mentionned before.",
    "directions": "Highway 212 in Geoff (south of Hfx airport) to  logging or atv trail at N44.90357 W63.43051.  Drive as far as you dare!",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/13167/reg_cla2-1--27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13167/reg_clat-1--27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13167/reg_clat1-1--27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13167/reg_clat3-1--27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13167/reg_clat4-1--27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13167/reg_clat5-1--27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13167/reg_clat6-1--27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/clattenburgh-brook-wilderness-area-and-falls-near-halifax-ns-13167",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "5 hrs",
        "Total Distance": "14 km",
        "Town": "Halifax, NS",
        "Type": "out-and-back"
    },
    "title": "Clattenburgh Brook Wilderness Area (and falls!)",
    "trail_id": "13167"
}