{
    "description": "I didn't have much to go on when I looked for falls on this brook.  A single point on an 1890s map saying fall 18.  I gathered that meant a waterfall of 18feet.  The topographical map for this area shows a decent size ravine and the sat imagery doesn't show anything.  I used a logging road to get close to the  ravine and after walking no more than 150m, I was at the edge of it.  It really is a good size one!  the slope can be actually steep in some section.  Made it down to the fall and then followed it upstream.  I had a gps point where I thought the fall could be but it turned out to be series of cascades.  However a few more hundred metres, and I was finally at the falls.  Its a series of small drops that are ok BUT the best part is that the river there has carved a mini gorge.  the gorge is covered by moss on one side and sheer rock walls on the other.  the trip to the gorge is well worth the effort.  After the gorge I aimed my gps to the logging road and traversed an evergreen wall (really dense evergreens!) just before the road that had me cursing a little!",
    "directions": "In Cross roads Country Harbour area (highway 316) , turn on Melrose country Harbour Rd and then turn left on West Side Rd and drive over southwest brook or sometimes called Shingle Brook and turn on logging road at N45.26264° W61.88757°.   Falls are approximately at;",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/13177/reg_GOPR1605-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13177/reg_sw3-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13177/narrow_20190421-102137-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13177/narrow_20190421-102141-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13177/narrow_sw1-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13177/narrow_sw2-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/southwest-brook-falls-near-cochrane-hill-ns-13177",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "3 km",
        "Town": "Cochrane Hill, NS",
        "Type": "out-and-back"
    },
    "title": "SouthWest Brook Falls",
    "trail_id": "13177"
}