{
    "description": "I left my car where the Sheddley Rd became more of an ATV trail.  I followed it for a while until my GPS pointed me to a fall on Horse Brook (N45.25277° W64.42343°).  The bushwack is easy with well spaced trees.  Funny sidebar is that I made it to within 200m of this fall but turned around about ten years ago.  I was snowshoeing for about 8km to get to this point and decided that whatever falls could be on this brook were the tiny ones I had seen already.  Big mistake, the biggest fall was just ahead!  That?s a general lesson in waterfall hunting.  You just never know if a bigger fall is just ahead!Came back to Sheddley Rd ATV track and followed it towards Sheddley Cove.  At one point, I could hear the humming of a fall and turned to the left and cut across about 200ft of forest.  There at the bottom of a small ravine was a two tier fall of about 25ft in total at; N45.25430 W64.43366.  I hiked out the rest of the brook to the cove and returned to my car via the ATV track.",
    "directions": "Highway 358 towards Scots Bay.  Turn left on Sheddley Rd and go past the house and farm.  The road is public (I asked a local) although it doesn?t appear to be.  Drive as much as you want or as much as your car can take.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/13189/reg_59305752-1370238216449352-3695690431879708672-n-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13189/reg_59330319-1370235779782929-4839531331945758720-n-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13189/reg_59767987-1370238206449353-6146771239131152384-n-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/horse-and-sheddley-brook-falls-near-canning-ns-13189",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "3 km",
        "Town": "Canning, NS",
        "Type": "out-and-back"
    },
    "title": "Horse and Sheddley Brook Falls",
    "trail_id": "13189"
}