{
    "description": "Over the last twenty years, I have explored the beautiful province of Nova Scotia.  I am still amazed that I can still have epic hikes to new places after all this time.  This (no trail) hike will leads you to the massive gorge and waterfalls on one of the largest rivers in Cape Breton; The Mackenzie River.  Stats for the hike (return); 8.7km, 3h7min and 3500ft elevation!  I put in my own times but you may want to give yourself more daylight to explore this place.The hike starts at one of the looks off (N46.80336° W60.84363°) near Pleasant Bay.  If you look in the distance and along the river way down the valley, you can spot where the hike will lead you.  Off in the distance is a rocky hill and the fall is set and its foot.  Basically aim yourself to the river and follow a small ephemeral stream as you come down a height of more than 300m from the look off to the river.  At first, it?s an evergreen forest but soon you enter a majestic hardwood forest where trees are far apart and the canopy really high above your head.  I followed the brook to the river but really look at my track because once at the river, I had to climb back up a way to go around a cliffy section on the river.Within about 1.5km after leaving your car, you will cross Benjies Lake Brook. There is a super nice gorge and fall but I?ll describe those in another post.  After passing Benjies Brook, follow the river?s edge.  Sometimes you may need to boulder a bit or get wet or get higher on the slope to pass by some cliffy sections.  There is a quasi cave on the side of the river you should be able to spot it if you see an island in the middle of the river.The hiking is moderate to easy at times.  Lots of ghost holes here.  These are holes that are hidden by moss so be careful.  I saw a few moose carcasses too which reminded me to be careful with my footing. The huge falls and gorge are at; N46.79378° W60.81510°.  there are a few smaller falls of about 30ft in total in the lower portion of the gorge while the main fall is hidden from your view by tall rocky cliffs of about 200ft.  Carefully climb those cliffs and peer inside the gorge to spot the massive fall.  Main fall is a slider type of height between 60-80ft.",
    "directions": "Cabot Trail from Cheticamp towards Pleasant Bay.  The look off you are looking for is at N46.80336° W60.84363° and is located really close to the trailhead for Fishing cove trail (the steep trail).",
    "geohash": "f8k",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/13198/reg_mck1-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13198/reg_MACKENZIE-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13198/reg_MACKENZIE1-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13198/reg_macelevation-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13198/reg_mck-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13198/reg_mck2-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13198/reg_mck4-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13198/narrow_mck3-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mackenzie-river-falls-near-cheticamp-ns-13198",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 5,
        "Time": "3 hrs",
        "Total Distance": "9 km",
        "Town": "Cheticamp, NS",
        "Type": "out-and-back"
    },
    "title": "Mackenzie River Falls",
    "trail_id": "13198"
}