{
    "description": "Completed on May 21, 2019 ? Trail mostly dry with solid snow patches passed 1600 metres of altitudeEdwards Rating: I (I) S M ? Mostly a hike3 to 5 hoursElevation gain to col 933 m & max 1970 m, End of Official Trail (*** GPS track has an extra 400 m up to the west summit but cornices and steep snow was too much for today, we turned back) Gear: Cleats, hiking poles. Wind was pretty strong & cold still at this time of the year, we were prepared for winter hiking anyway.*****It always seems like the hardest thing to do in BC is to find or get to the trailhead! This one is easy. After we parked at the end of Canyon Trail, we walked up the gravel road for 200 m, turned right then left 50 m later where we saw a wooden sign on a tree. This is mostly a steep hike mildly exposed to steep slopes and some easy scrambling on stairs like rock bands close to the col. The views of Fernie and surrounding peaks like the Three Sisters are worth the effort. We tried to continue to the highest point to the west but we turned back because of the cornices and steep snow. It seems like a full traverse on this ridge would be moderate to difficult scrambling even in dry conditions. You gain elevation rapidly on the forested east ridge but the best part is when you finally get out the forest and hike across multiple gullies with opened views. The last portion leading up to the bench at the col is short but fun with some easy scrambling.",
    "directions": "From Fernie?s Visitor Info Centre on Highway BC-3 just before Fernie, continue for 500 m and turn right on Canyon Trail. Drive for another 350 m and turn right to stay on Canyon Trail. Continue for 500 m and park at the end of the street making sure you?re not blocking the gate.",
    "geohash": "c2y1",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/13196/long_Mount-Fernie-Ridge-Hike-Fernie-BC-Summit-Panorama-May-21-2019-900x205--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/13196/long_Mount-Fernie-Ridge-Hike-Fernie-BC-View-Fernie-May-21-2019-900x389--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/13196/long_Mount-Fernie-Ridge-Hike-Fernie-BC-Welcome-May-21-2019-900x518--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/13196/long_Mount-Fernie-Ridge-Hike-Fernie-BC-West-Ridge-Panorama-May-21-2019-900x240--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/13196/narrow_Mount-Fernie-Ridge-Hike-Fernie-BC-Easy-Scrambling-Below-Col-May-21-2019-564x900--44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mount-fernie-ridge-hike-near-fernie-bc-13196",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 5,
        "Time": "5 hrs",
        "Total Distance": "8 km",
        "Town": "Fernie, BC",
        "Type": "out-and-back"
    },
    "title": "Mount Fernie Ridge Hike",
    "trail_id": "13196"
}