{
    "description": "I wanted to explore some of the massive cliffs you can spot when you are in Parrsboro looking towards Cape Blomindon.  There is one place in particular that juts out with a right angle.  It sites high overlooking the phenomenon/ place called the Big Eddy.   You have to check out the tide tables before setting off so you will not get caught by rising waters.  Although there is no pinching point as in other places, a high tide would make the hike very difficult.From the parking lot, follow the cliffs passing by a few moderate size waterfalls.  Then a col section of high sandstone, red colored, cliffs.  The walk becomes subsequently harder as the terrain becomes cobble size beach.   The scenery is fantastic and makes it worthwhile.  There are so many minerals to be found on this hike too!  Midway to the cliffs above big Eddy is the only significant brook you will see. It?s Indian Spring Brook.  After the brook, the walking becomes easier.  Then you pass more red sandstone gulleys and all the time you can see towering above the  gulleys are tall white/ grey cliffs.  These will be or destination today!Once I could see the square looking cliffs above, I very carefully made my way to it on some very very steep scree slopes.   You have to be careful here as a tumble down would prove to be very dangerous.   Once at the cliff base, I hiked along the base towards Indian spring Brook.  There are a few monolith of rocks along the way as well as numerous raccoon size caves.  The view from up here is fantastic!  Just before Indian spring Brook, I saw a rock chute with which I climbed out and made my way to the top of the cliffs.  I emerged almost at the last look off platform on the Joudrey Trail.  Taking the trail, it led me back all the way to the campground of the provincial park and my car down at the beach access point.",
    "directions": "This exploration starts at the beach parking of the Blomindon Provincial Park; N45.25664° W64.35175°",
    "geohash": "f84",
    "photos": [],
    "source_url": "https://trailpeak.com/trails/big-eddy-near-canning-ns-13190",
    "stats": {
        "Activities": "climb hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "4 hrs",
        "Total Distance": "14 km",
        "Town": "Canning, NS",
        "Type": "out-and-back"
    },
    "title": "Big Eddy",
    "trail_id": "13190"
}