{
    "description": "Completed on May 26, 2019 ? Dry conditions except for a snow gully on the way down from Anklebiter Ridge summit. Wonderful shoulder season scramble!Edwards Rating: II (II) S S3 to 6.5 hoursElevation of 829 m NET, 864 m TOT & max 2102 m (1900 m for Bluemat Hill)Gear: Cleats, hiking poles & bug repellent (ticks? season, some bushwhacking). Wearing a helmet would have been safer down the cliff below the summit as other parties were kicking rocks.  *****This is one of the nicest scrambles we?ve ever done! Great easy to moderate scrambling up slabs, cracks and rock bands all along the way up to the summit ridge. It?s probably considered as easy because there seems to be always a way to circumvent rock bands on either side and avoid hands-on scrambling. There are many trails along the way so it is confusing sometimes. We didn?t do well towards the end of our descent with some extra unnecessary bushwhacking.From the parking, follow the Grotto Canyon Trail for about 100 metres or so and turn right on a good trail just before the drainage (GR258585). We came across a couple of intersections and stayed left. It then opened on this rocky ridge going up north with several options but we preferred to stay as high and centered as possible scrambling on solid rocks. We reached a plateau before the false summit and went straight up to reach the ridge. We turned right and through a series of ups and downs before reaching the summit (GR257604). For our descent, we went down east and avoided a cliff band by sidesloping to the left until we reached a snow gully. We went down the snow and turned right to reach back the ridge immediately. We stayed on the right side of the ridge as much as possible keeping an eye on Bluemat Hill, an obvious clearing to the SE. We followed a series of decent faint trails and got the summit of Bluemat Hill (GR266601). From there, we followed the open ridge for a few minutes keeping right and reached an awesome scree trail. We lost a lot of elevation in a few minutes and followed the trail to the left when scree became rubble. It would have been much easier to rely on our GPS and follow the open ridge straight down after the scree. We bushwhacked more than necessary and at some cut back to our right to avoid deadfall and a dense forest. We went straight down to the highway at this point and turned right to go back to the parking lot about 700 metres away.",
    "directions": "From Calgary, follow Trans-Canada Hwy/AB-1 W and take exit 114 toward Seebe/Exshaw/Stony Indian Park. Continue for about 4 km and turn left on Bow Valley Trail/AB-1A West. Drive another 10.8 km and turn right in the Grotto Mountain Pond/Canyon Trail parking lot.",
    "geohash": "c3n4",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/13197/long_Anklebiter-Ridge-Kananaskis-Clouds-from-McGillivray-to-Grotto,-Stunning!-Jul-21-2019-900x327--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13197/long_Anklebiter-Ridge-to-Bluemat-Hill-Loop-Kananaskis-Anklebiter-Summit-Panorama-View-Grotto-Gap-Fable-May-26-2019-900x211--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13197/long_Anklebiter-Ridge-to-Bluemat-Hill-Loop-Kananaskis-McGillivray-Pigeon-Lougheed-Behind-Marry-May-26-2019-900x275--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13197/long_Anklebiter-Ridge-to-Bluemat-Hill-Loop-Kananaskis-Welcome-Our-Route-May-26-2019-900x453--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13197/reg_Anklebiter-Ridge-Kananaskis-Lougheeds'-&-Rimwall-in-the-clouds-Jul-21-2019-900x675--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13197/reg_Anklebiter-Ridge-Kananaskis-McGillivray-in-the-Clouds-Jul-21-2019-900x675--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13197/reg_Anklebiter-Ridge-Kananaskis-Over-the-Clouds-Now-Jul-21-2019-900x675--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13197/reg_Anklebiter-Ridge-to-Bluemat-Hill-Loop-Kananaskis-Nice-Scrambling-Marry-May-26-2019-1-900x675--44639_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13197/narrow_Anklebiter-Ridge-to-Bluemat-Hill-Loop-Kananaskis-Nice-Scrambling-up-Crack-Chris-May-26-2019-688x900--44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/anklebiter-ridge-to-bluemat-hill-loop-near-canmore-ab-13197",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 5,
        "Time": "4 hrs",
        "Total Distance": "7 km",
        "Town": "Canmore, AB",
        "Type": "out-and-back"
    },
    "title": "Anklebiter Ridge to Bluemat Hill Loop",
    "trail_id": "13197"
}