{
    "description": "Nestled on the picturesque north shore of Lake St. Francis, the Cooper Marsh Conservation Area is the proud Legacy of the late Mr. William Cooper Sr., a past Chair of the Raisin Region Conservation Authority. This cherished wetland is part of the larger Charlottenburgh Marsh - one of the most significant wetlands in all of Ontario. The Raisin Region Conservation Authority protects, enhances and restores this natural area. \r\n   Follow the wetland boardwalks to explore the treed swamp and isolated ponds. Climb the viewing tower and centre the camera blinds to enjoy the more than 130 species of birds that call Cooper Marsh their home.  \r\n      Approximately 100 or so species can occasionally be sighted as they migrate through the area including the magnificent Osprey, the Great White Egret and Black-Crowned Night Heron \r",
    "directions": "The Cooper Marsh Conservation Area and Visitor's Centre are located 18 kilometers east of Cornwall on County Road 2 near South Lancaster, and 102 kilometers west of Montreal. From Highway 401, exit onto County Road 34 (Lancaster interchange) then turn south onto County Road #2 and proceed 3 kilometers to the main entrance",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/ON/1320/reg_blueirisSmalljPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/1320/reg_boardwalk2SmallJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/1320/reg_marsh2SmallJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/1320/topo_map2gif.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/coopers-marsh-near-cornwall-on-1320",
    "stats": {
        "Activities": "snowshoe hike ski-xc",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 2,
        "Time": "3 hrs",
        "Total Distance": "4 km",
        "Town": "Cornwall, ON",
        "Type": "out-and-back"
    },
    "title": "Cooper's Marsh",
    "trail_id": "1320"
}