{
    "description": "If you have been reading my trailpeak posts for a while, you know that I love to look at sat imagery to find waterfalls.  I was looking for some in a remote valley near Black Brook, Middle River when I spotted a series of them in an area I had previously visited.  That area was upstream of the super nice two tier fall on Black Brook.  I have already a post on that one and it?s even included in my waterfall guide book.I decided to check out the other features that I could now clearly see on sat imagery.  Getting to the lower fall was easy. It?s an unofficial path all the way with flagging tape and a rope to get down to the fall.  It?s a quick fall to visit ?only about 12min from your car.  Once at the fall, I decided to go on the right bank (facing upstream) to bypass the falls.  It?s a bit tricky to get behind those but doable.  There is a large overhang here and there is an old pot by a fire circle.   From there, I continued along the right hand side again and because water was a bit low was able to cross at the foot of a hidden small fall.  Getting around a super large boulder, I could see another fall hidden in a narrow canyon.  This fall is nice and can be seen form above but the nicest part is immediately upstream.  Just a few metres above is a large pool and a massive fall of about 45ft (N46.12202° W60.97908°).  I would say it?s probably the nicest of all the falls on this river.  You can opt to just see this one by going on the left bank from the lowest fall and easily get to it.  The right hand side becomes very cliffy very quick and going along it is not advised.  There were a few more smaller falls upstream of this on until about N46.11984° W60.98071°.  I returned to my car via the nice hardwood hill above the river.Stats for the hike; 3.7km, 1h33min and 1476 ft total elevation",
    "directions": "Drive on Middle river West Rd and take Gairloch Mtn Rd and park at N46.12834° W60.97703°.  Find the flagging tape and trail to the fall.",
    "geohash": "f8hwk",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/13202/reg_bb-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13202/reg_bb-elevation-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13202/reg_bb1-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13202/reg_bb2-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13202/reg_bb3-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13202/reg_bb4-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13202/reg_bb5-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13202/reg_bb6-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13202/reg_bb7-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/black-brook-gorge-and-falls-near-baddeck-ns-13202",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 5,
        "Time": "2 hrs",
        "Total Distance": "4 km",
        "Town": "Baddeck, NS",
        "Type": "out-and-back"
    },
    "title": "Black Brook Gorge and Falls",
    "trail_id": "13202"
}