{
    "description": "Corney Brook in the Cape Breton Highlands National Park already offers a nice trail to a small waterfall.  I have explored some other parts of this valley before and posted two more trailpeak entries;  one is secret corner brook fall on the southwest branch and the other is the massive corner Brook Fall on the main branch approximately 1km upstream of where the trail ends.Corney Brook valley also has another secret spot.  When there are no leaves around you can usually see some falls way up on the side of the hills from the Cabot Trail and also once you set off on the hiking trail too.  There is no trail to these falls.  Basically hike the regular trail and once your gps points to the falls, cross corner Brook.  I used some large stone and was across without getting wet.  If the water is too high, hike to the footbridge and then bushwhackdownstream from the bridge until you get to the tributary.Then its easy to navigate as you follow the stream up the hill.  Some parts re pretty steep and of course there are some holes under the moss.  However the rewards are great as there are at least 4-5 main falls to see of more than 25ft.  the ladtfall is approximately 70ft!",
    "directions": "Cape Breton Highlands National Park.  From Cheticamp, drive to Corney Brook trailhead.  Take that trail.  The topmost falls are located at;  N46.71292 W60.90107.  The gps will bring you to all the fall and then access the cool plateau and goes towards more falls that I need to explore some other time.",
    "geohash": "f8k9",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/13207/narrow_DSC-5143-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13207/long_20190606-194345-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13207/reg_Screen-Shot-2019-06-07-at-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13207/narrow_DSC-5119-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13207/narrow_DSC-5122-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13207/narrow_DSC-5126-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13207/narrow_DSC-5132-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13207/narrow_DSC-5146-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13207/narrow_Screenshot-20190606-202100-Canada-Maps-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/corney-brook-valley-bonus-falls-near-cheticamp-ns-13207",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 5,
        "Time": "2 hrs",
        "Total Distance": "6 km",
        "Town": "Cheticamp, NS",
        "Type": "out-and-back"
    },
    "title": "Corney Brook Valley Bonus Falls",
    "trail_id": "13207"
}