{
    "description": "This is a short hike you can do with practically anybody.  The whole hike is on the seafloor of the Bay of Fundy so of course you need to check out the tide tables before setting off.  I became intrigued on checking a brook for waterfalls when I spotted it?s name; Whitewater Brook.I drove a well maintained gravel road to a small access point to the Bay.  I hiked towards the east at first as that was the location of Whitewater Brook (about 1km down the seashore).  On the way there, I couldn?t help noticing all the cool minerals lying on the ground or embedded in the cliffs.  There are a few small sea caves along the way which make for great photo opps.  Ok so, I don?t know how Whitewater Brook got its name?definitely not for its terminal fall.  It?s nice enough at about 15ft in total for a two tier fall (N45.19089° W64.65591°).On the way back, as I was facing due west, I spotted some more falls on the west side of the cove where I started.  So instead of finishing the hike at my car, I followed the cliffs but this time due east.  Within about 250m there was a first fall that didn?t have a lot of water but has definitely an adit or two on the left side of it.   A further 400m or so from there and you will be facing the tallest of the three falls of this hike (N45.18546° W64.67551°).",
    "directions": "Highway 221.  Take Burgess Mountain Rd.  Go up the north Mountain and turn right on Hiltz Rd.  Turn left on Chipman Brook Rd.  continue until the seashore where Chipman Brook empties into the Bay of Fundy at; N45.18668° W64.66767°",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/13212/reg_fund-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13212/reg_fund3-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13212/reg_fund4-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13212/narrow_fund5-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/whitewater-brook-falls-near-berwick-ns-13212",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "3 km",
        "Town": "Berwick, NS",
        "Type": "out-and-back"
    },
    "title": "Whitewater Brook Falls",
    "trail_id": "13212"
}