{
    "description": "Edwards Rating: III (IV) M S6 to 8 hoursElevation of 707 m NET, 833 m TOT & max 2258 m GPS track is all over the place, avoid back & forth routes, read the full description and look at our pictures. Route finding skills essential here.Completed on August 4, 2019 in dry conditions.Gear: If scrambling up the south face as described, consider wearing a helmet. As always, poles were useful and bug repellent/sunscreen essential with hot weather and bushwhacking. I wouldn?t do this traverse in ticks? season. *****This is a real scramble when doing it from the south face of the southern outlier as seen on my picture: Difficult route finding up exposed and loose gullies, steep terrain, no cairns or routes at all and some bushwhacking and route finding on the way down as well. Make sure you are always considering going back down the same way as terrain seems to always get more difficult/exposed and steeper when getting higher.We parked just before the gate to Victoria Ridge (GR124660) and walked for 1.5 km on the road as per Nugara? book. You could keep walking a hundred meters or so and turn right on the road. We rather cut straight in the bushes (GR110654) and up to the south face of the southern outlier making sure to stay in line with our objective avoiding tall bushes as much as possible. Don?t even look for a trail for the day, some faint trails are useful but they can confuse you if you trust them rather than you own expertise. Once at the base of the wall, we went left and under the red rock band to try out 3-4 steep gullies, it was a mistake and we took almost 45 minutes just to go back down and out of danger. We went along the face to the right and turned left under the mid-section of the outlier toward the end of the red rock band (small drainage below us at that point). We then sidesloped on the left side until we reached a steep but easier gully up to the grassy slope. Looking up, we aimed for the forest and followed it on its left to gain the ridge line. We turned right and scrambled up the ridge looking for easier terrain to its right for the first few steps. We crossed the ridge line at this point and walked on a wide but exposed ledge on north side. After about a minute or so we looked up to our right and regained the ridge with some easy scrambling up good rocks. Minutes later we finally reached the top of the outcrop. Walking straight north we followed the ridge line, later on turning right and using the plant?s road for a while. At the junction we turned left and kept going to the next plant. We walked along to the left of the plant and went up left to the next high point just before the summit. We hiked up to summit for the last bit of elevation gain.Going down, we followed the beautiful south ridge for a while scrambling down a few rock bands, going right when necessary. When we reached some black scree, we used it to go down quickly in the valley to our right. Our mistake here was to stay here and cut to the right following a faint trail that led to some frustrating bushwhacking and route finding. The best thing to do would have been to stay high and look for a trail to the LEFT SIDE of the south ridge. We saw a decent trail going that way but ignored it, it was the best way to go as that side has a clearing going straight down to the road and 400 metres away from where we parked. I strongly recommend you go left and use clearings as soon as it is safe to do so when you?re going down the south ridge. Entertaining day but this involved some serious route finding and exposure.",
    "directions": "From Pincher Creek roundabout, take AB-6 S towards Waterton for about 22.3 km, turn right on Township Rd 43A (Shell Waterton Complex Rd) and continue on this road for about 9.2 km. At the junction with the Forest Reserve sign, turn left and continue for about 5.5 km. Park at the clearing to the left, about 100 metres before the gate. Another possibility is to turn right at the plant and park about 400 meters later where you will end up coming back from if you don?t make the same route-finding mistakes we?ve made.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/13241/long_IMG-9140-900x443--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13241/long_IMG-9197-900x212--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13241/reg_IMG-9150-900x675--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13241/reg_IMG-9157-800x600--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13241/reg_IMG-9164-800x600--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13241/reg_IMG-9169-800x600--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13241/reg_IMG-9170-800x600--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13241/reg_IMG-9171-900x675--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13241/reg_IMG-9175-900x596--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13241/reg_IMG-9190-900x675--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13241/reg_IMG-9206-900x675--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13241/narrow_IMG-9201-675x900--44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/prairie-bluff-traverse-south-face-to-south-ridge-near-pincher-creek-ab-13241",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 4,
        "Time": "7 hrs",
        "Total Distance": "13 km",
        "Town": "Pincher Creek, AB",
        "Type": "out-and-back"
    },
    "title": "Prairie Bluff Traverse (South Face to South Ridge)",
    "trail_id": "13241"
}