{
    "description": "Yet another of the paddle selections from \r\n\"The Vancouver Paddler\" book that I reviewed this May 2004.\r\n\r\nThe 2 times I've paddled this pretty lake have been gorgeous sunny days. Buntzen really sparkles under those conditions! It's not long about 3 kms one way and will only take 1 hour of paddling each way but I challenge you to resist the urge to dally along the way, either fishing or soaking up the sun on one of the beaches or rocky promontories or taking a short walk on the surrounding trails.\r\n\r\nThe scenery is awesome. The lake however is a reservoir on BC Hydro's power grid and is fed by \r\nrushing mountain streams. In fact, if there is snow on the North Shore Mountians, Buntzen will be \r\nicy cold once away from the shallows near the beaches! Dress accordingly... During a training \r\nsession for the Bowron Lakes circuit I volunteered to tip my canoe to try (notice the word \r\nTRY?) & show my less experienced friends how to right the boat and climb back in. This was in early May and the shock of hitting such icy water drove the breath from my lungs leaving me \r\ngasping and in \"mild shock\". The attempt to right the boat was a failure and a sobering reminder \r\nof why canoeists drown in supposedly familiar waters.\r\n\r\nThe lake is extremely popular for paddling and canoes or kayaks can be rented there. Fishermen/women are common along the shoreline and often found hogging the docks. Watch out for their lines as they are not appreciative of inattentive paddlers that foul them. Only electric motors are allowed so noise and boat wash are not present. There are booms and warning signs where BC Hydro's facilities present a danger to swimmers or boaters - pay attention!\r\n\r\nTake a picnic lunch along and make a pleasant afternoon here. Because of the park's popularity expect a lot of company in the area but North beach will usually be more peaceful since they have to either hike, ride or paddle to get there.\r\n\r",
    "directions": "From Vancouver/West Vancouver - Take the Barnet Hwy through North Burnaby & Port Moody and then \r\nturn North on Ioco Road. towards Ioco & Anmore. Follow the signs they will eventually lead you to Sunnyside Road in Anmore. Head North past White Pine Beach at tiny Sassamat Lake.\r\n\r\nFrom the Fraser Valley side take the Lougheed Hwy west through Port Coquitlam. It will turn into the Barnet Hwy near Ioco Road. Once on \r\nIoco Rd. follow those signs again\r\n\r\nThere's lots of parking!",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/1324/reg_BuntzenlookingNfrNbeach.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1324/reg_BuntzenlookingS.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1324/reg_BuntzensandNbeach.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1324/reg_Snow-scene-Large--47414.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1324/narrow_BuntzenNbeachfrsuspbrdg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1324/narrow_image-52424.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/buntzen-lake-near-vancouver-bc-1324",
    "stats": {
        "Activities": "river-canoe sea-kayak",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "6 km",
        "Town": "Vancouver, BC",
        "Type": "out-and-back"
    },
    "title": "Buntzen Lake",
    "trail_id": "1324"
}