{
    "description": "This is bushwack to a series of falls on an unnamed tributary of the Middle river located close to the First Gold Brook.  I wanted to explore there because I saw some interesting features in google earth that led me to believe that there were a few falls on this brook.I set off on the old gold brook road which led me to some fields by the side of Middle River.  I went around the fields to the edge of Middle river and walked upstream a few hundred feets.  Across the river, I saw a small brook and a valley carved by the brook leading to the top of the highlands.I crossed the brook which had surprisingly deep water in a dry spell of August. I then just followed the brook to explore all the falls.  The first fall you encounter is the tallest and probably the most scenic (approx.; 46°14'57.59\"N, 60°55'13.79\"W).  It is about 50ft. I carefully made my way upstream on the right hand side of that fall and explored way too many to count falls on the way up the ravine.   Some of them I could climb inside the fall as the water was low but that was a bit tricky has the side walls are moss covered and very slippery.  I mostly made my way upstream on the right hand side (facing upstream)  to the terminal falls I saw on sat imagery at; 46°15'9.63\"N, 60°55'20.49\"W.Instead of retracing my steps down, I followed a contour line but the walking wasn?t as easy as I thought.  There is actually a pretty dense undergrowth in this forest (see gps track).  Overall this unassuming brook was a real treasure of waterfalls.  The first one is the easiest to reach and probably the nicest one.  The fording of Middle River at times of high water might be very tricky though.  Total elevation gain on my route was about 800ft.",
    "directions": "Cabot Trail in Middle River.  Turn on gold Brook Rd and drive until you see a driveway leading to the right and an old dirt road continuing to the left.  The left hand side road is the one to take but leave your vehicle here (46°14'23.81\"N, 60°55'13.44\"W).   The brook you need to follow empties in Middle River at; 46°14'42.34\"N, 60°55'6.83\"W.",
    "geohash": "f8hxj",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/13249/reg_68784540-1452732791533227-1326525182222794752-n-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13249/reg_trib-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13249/narrow_68413260-1452733001533206-3150847467872845824-n-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13249/narrow_68424683-1452732761533230-2853826715300397056-n-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13249/narrow_68431772-1452732958199877-1968456921337823232-n-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13249/narrow_68865253-1454399338033239-364753430507421696-n-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13249/narrow_69048378-1452732898199883-4486783705125224448-n-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13249/narrow_69497952-1454399391366567-4126864625381670912-n-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/bens-middle-river-tributary-falls-near-baddeck-ns-13249",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 5,
        "Time": "2 hrs",
        "Total Distance": "4 km",
        "Town": "Baddeck, NS",
        "Type": "out-and-back"
    },
    "title": "Ben's Middle River Tributary Falls",
    "trail_id": "13249"
}