{
    "description": "Edwards Rating: III (III, IV if climbing crux) M M6 to 10 hoursElevation of 1078 m NET, 1239 m TOT & max 2385 m GPS track involves traverse of Middle Waterton Lake in kayak.Completed on August 27, 2019 in dry conditions.Gear: Hiking poles, helmet (loose rocks), we always have bear spray and definitely essential here. We used a kayak but mountain biking approach from Wishbone trail might be faster. Quite bushy, might be nicer early season but be aware of ticks then.*****This is the scrambling approach of Vimy Peak, moderate to difficult depending on your experience and route-finding skills as well as your level of comfort on deadly exposed terrain. We avoided the most exposed sections but this is still a moderate scramble for sure. No cairns, no faint trails, you?re on you own here!As we don?t have mountain bikes, we decided to use an inflatable kayak to cross Middle Waterton Lake and get to that ascent gully directly. We might have saved an hour or so, but at least 2 hours of hiking with still 17.34 km overall (which 5.76 km was for the kayak traverse). From Driftwood Beach, we aimed for the first of 2 obvious white gullies on the north face of Vimy Peak. After safely putting away our gear, we started going up that gully until we reached waterfalls. We scrambled up steep terrain on the left, using a dried-out drainage going SE to avoid more complex and exposed terrain around that gully. Reaching a plateau, we were now at the junction of the described route in Nugara?s book. We started climbing up moderately exposed ledges with loose rocks straight in the middle for about 20 metres elevation. We turned right and went over and across a very steep gully on loose scree, about 4 steps here. We then scrambled almost straight up that scree gully using solid rocks on either side when possible for more stability. Once we reached easier terrain, we kept going almost straight up ledges and then we hiked up boulders-rubble to the weakness in the impressive cliff band under the summit, as explained in Nugara?s book. After assessing the first 10 metres or so of good holds/rocks but exposed to an almost vertical slab, we lost a bit of elevation and circumvented the crux, by going along the wall to the left and then up to the summit ridge. From there, easy steep hiking to the summit staying close to the cliff band. Views are spectacular! It is worth going down a bit below the summit for better views of the three Waterton Lakes. Going down, we had no intention of scrambling so we tripled the distance (but it was twice as fast) using the easy and very obvious trail leading down the valley and eventually to the main intersection where people taking the Wishbone trail approach leave their bikes. We turned left there (Crypt Lake trail) and walked another 2 km or so back to our gully, then right and down to Middle Lake to get back in our kayak for the traverse. If you have bikes, the other approach will be much easier. Leaving the bikes at the main intersection, you could reach our gully by continuing on the Crypt Lake trail like we did on our way back. You will cross a first gully at a clearing, the one described in Nugara?s book. You can go up that gully if you prefer, it would be much faster from there. You would then reach our route between these two beautiful gullies higher up. We only took that other gully as it was closer to the beach where we started.",
    "directions": "From Waterton Park?s gate, we drove 6.2 km and turned left to park at the Driftwood Beach (tried other roads before the beach but no direct or allowed access to lakeshore). If using bikes from Wishbone trail, continue for 900 metres passed Waterton Park?s turnoff and turn right to keep going on AB-6 South for about 500 metres. There is a parking on your left and the trailhead is across the highway.",
    "geohash": "c2x",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/13251/long_Vimy-Peak-North-Face-Ascent-Waterton-Middle-Lake-Ascent-Route-2-Gullies-Superb-Aug-26-2019-800x321--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13251/long_Vimy-Peak-North-Face-Ascent-Waterton-Summit-Panorama-3-Lakes-Crandell-Anderson-etc-Aug-26-2019-800x179--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13251/reg_Vimy-Peak-North-Face-Ascent-Waterton-Complete-Route-Aug-26-2019-800x600--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13251/reg_Vimy-Peak-North-Face-Ascent-Waterton-Crux-Not-Today-Aug-26-2019-800x600--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13251/reg_Vimy-Peak-North-Face-Ascent-Waterton-Osprey-Ascent-Route-Aug-26-2019-800x600--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13251/reg_Vimy-Peak-North-Face-Ascent-Waterton-Osprey-Vimy-Welcome-Aug-26-2019-800x600--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13251/reg_Vimy-Peak-North-Face-Ascent-Waterton-Red-Rocks-Crandell-and-Middle-Lake-Wow-Aug-26-2019-800x600--44639_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13251/reg_Vimy-Peak-North-Face-Ascent-Waterton-Route-Scramble-Aug-26-2019-800x600--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13251/reg_Vimy-Peak-North-Face-Ascent-Waterton-Route-from-Gully-Aug-26-2019-800x600--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13251/reg_Vimy-Peak-North-Face-Ascent-Waterton-Summit-View-Ascent-Route-Aug-26-2019-800x600--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13251/reg_Vimy-Peak-North-Face-Ascent-Waterton-Sunrise-Several-Elks-while-Looking-for-Best-Spot-to-Start-Aug-26-2019-800x600--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13251/narrow_Vimy-Peak-North-Face-Ascent-Waterton-Rock-Band-Climb-Middle-Lake-Behind-Aug-26-2019-600x800--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13251/narrow_Vimy-Peak-North-Face-Ascent-Waterton-View-Town-Hotel-Blakiston-Far-Away-Aug-26-2019-600x800--44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/vimy-peak-north-face-ascent-near-waterton-park-gate-ab-13251",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 4,
        "Time": "9 hrs",
        "Total Distance": "17 km",
        "Town": "Waterton Park Gate, AB",
        "Type": "out-and-back"
    },
    "title": "Vimy Peak (North Face Ascent)",
    "trail_id": "13251"
}