{
    "description": "This is a cool micro exploration to waterfalls, a mining adit, a man-made tunnel (with a bonus waterfall at one end of it!).  All of these cool features are located in a tiny little area where Smith Brook meets the railroad track (N45.59553° W63.56981°)..actually just downstream of the track.Smith Brook has three distinct falls.  The lower one is a sliding type of about 8ft in total, the middle one is the most impressive at around 3oft and framed by rock walls while the third fall is man made and located upstream in the tunnel under the rail road track.Above the main fall, there is an old mining adit of about 5ft in height which seems to go at least 100ft or more.  The floor is under water so bring boots.  The tunnel is just upstream of the adit and can be easily entered.  Unless there is lots of water, your feet should remain dry if you are wearing hiking boots.  The fall at the end of the tunnel is really unique and I was able to climb out on the side of it but then again, I boulder a lot so most people will have to retrace steps to get out of tunnel",
    "directions": "There are many ways to get here but here is the easiest/ less complicated one.  Go to Wentworth Falls.  Hike up the hill to the railroad track.  Walk about 1km due north.  Smith Brook is there!   Go on north side of the brook and follow the ravine edge until you are confident you can walk down and back up",
    "geohash": "f84g3",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/13256/reg_s1-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13256/reg_s3-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13256/reg_s4-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13256/narrow_s-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13256/narrow_s2-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/smith-brook-falls-and-adit-and-tunnel-near-truro-ns-13256",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 5,
        "Time": "1 hrs",
        "Total Distance": "3 km",
        "Town": "Truro, NS",
        "Type": "out-and-back"
    },
    "title": "Smith Brook Falls (and adit and tunnel)",
    "trail_id": "13256"
}