{
    "description": "A SUP adventure starting in Burrit's Rapids on the Rideau River not far from Ottawa provides what can be a mini-epic paddling adventure to Merrickville (maybe 8km or 9km away). There are several locks to portage around, none of these are difficult, and, you'll see plenty of others either camping or tied up at the locks. The Rideau Waterway stretching from Ottawa to Kingston is a UNESCO world heritage site and is 202km long.  We only did 8km, but a very scenic leg for paddlers. Some paddle the entire distance.  Going in mid to late August was ideal, we had very few boats to contend with.The Rideau river shoreline is spectacular, there is no other way to describe it.  There may be houses up on the banks, you don't see them due to the foliage.  Not only that, there are sections that feel more remote, with no habitation, instead, plenty of lush tree lined river bank with wild-flowers and vegetation.Three of us paddled initially from a beach (very small) at Burrit's Rapids, but, what made it epic is we started on the river (not the lock side), so as we approached the dam and falls, we had some strong current to push against, before finding a path on the right to take us up to re-enter the water-way some 20 feet higher -- and not far from the spilling water over at the falls!  Yes a few nerves were calmed as we paddled away hugging the shoreline.  We continued on to some magnificent waterway stretches, and the wind that day helped us!Finally, some 3 hours later, we reached Merrickville, a very quaint and touristic river side town with history / shops / food / pubs.  We did this tour as a one way paddle, so previously  left one car at the locks (free parking) at Merrickville.  Wonderful, with SUPs on the car, off we went in town for dinner and ales.  Call it an epic day, we enjoyed exploring this waterway.",
    "directions": "Leave a car at Merrickville, back track to Burrit's rapids with your SUPs and start the adventure there (park at locks, or if you can find it, a small public beach at the micro-town of Burrit's rapids).",
    "geohash": "drfp",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/ON/13250/reg_IMG-0278-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/13250/reg_IMG-0280-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/13250/reg_IMG-0291-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/13250/reg_IMG-2138-5_best1_.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/burrits-rapids-to-merrickville-sup-near-merrickville-wolford-on-13250",
    "stats": {
        "Activities": "diving",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 5,
        "Time": "3 hrs",
        "Total Distance": "8 km",
        "Town": "Merrickville-Wolford, ON",
        "Type": "out-and-back"
    },
    "title": "Burrits Rapids to Merrickville SUP",
    "trail_id": "13250"
}