{
    "description": "This is a hike to a remote waterfall seldom visited by humans.  Fountain Lake Brook is a major tributary of the Portapique River located in Colchester Co!  The topo map doesn?t indicate anything good but the sat imagery did show something promising.  The area seems easiest to visit using the road into blueberry fields nearby but there was a large gate at the entrance so I decided to take another route.  I set off under the power lines at  45°32'16.46\"N, 63°42'54.84\"W.  The terrain immediately goes downhill to cross Gleason Brook and then heads uphill.  There is a nice swimming hole with small 2ft fall just upstream of power lines on Gleason Brook.  I continued under the lines and had lots of blueberry to eat.  About 600m after crossing the brook, a very very faint atv trail appeared on the left at 45°32'25.77\"N, 63°43'26.91\"W.  There are some other roads before that but this is the one to take.   After 500m you will find yourself out of evergreen trees and into a leafy forest at the edge of a clearing (45°32'21.58\"N, 63°43'48.03\"W).  From there go southwest bushwacking about 500m to the brook and fall.   The fall is mainly a two tier drop of about 12ft in total.  It is very unexpected but gorgeous.  There are large rocky outcrops covered by moss on both sides.  The fall is at; 45°32'14.07\"N, 63°44'7.27\"W.",
    "directions": "Drive on the Westchester Rd from Londonderry until it crosses highway 104. 400m after the overpass,  there is a small dirt road on the left at  45°32'14.33\"N, 63°44'7.27\"W that will take you to the power lines.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/13254/reg_ftn-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13254/reg_ftn1-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13254/reg_ftn2-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/fountain-lake-brook-fall-near-truro-ns-13254",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "6 km",
        "Town": "Truro, NS",
        "Type": "out-and-back"
    },
    "title": "Fountain Lake Brook Fall",
    "trail_id": "13254"
}