{
    "description": "This is a short bushwack type of hike to a series of waterfalls in the middle portion of the Great Village River located near Londonderry, NS.  I have previously explored and posted on trailpeak some more falls on this system such as Managers Park Falls and upper great village river fall. This post os for an area between those two.I spotted some good indication of falls on google earth.  I parked my car close to the most upstream one and decided to check them all out in a row?.. getting back the road at the end of the exploration and walking the road back to my car.  I made my way down a moderate slope to the river and was immediately at the sight of a tributary fall.  This one was dry but if it flows would be very spectacular.  It is a two tier fall.  Bottom is about 20ft and top is about 30ft (N45.50088° W63.62295°).Following the river is super easy and you will find numerous small cascades and huge rock walls on the side of the river.  The most scenic  and under explored fall is at ; N45.49900° W63.62100°.  the deep pool here looks very inviting for a swim.  Continuing downstream, here will be more small cascade until you get to the 8ft fall with another large pool at; N45.49400° W63.61500°. This one actually has ropes and a small trail leading back to the road.",
    "directions": "Takes Westchester Rd from Londonderry.  Once you cross the bridge over the Great Village River, drive another 1.4km and park.  Follow the gps coordinates in the post to all the waterfalls.  Or alternatively, park 400m after bridge and find faint trail to fall and then follow river upstream instead.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/13255/reg_gvr-1--27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13255/reg_gvr2-1--27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13255/reg_gvr3-1--27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/great-village-river-middle-falls-near-truro-ns-13255",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "5 km",
        "Town": "Truro, NS",
        "Type": "out-and-back"
    },
    "title": "Great Village River - Middle Falls",
    "trail_id": "13255"
}