{
    "description": "This waypoint has ben in my gps forever but I don't end up in that part of the province very often.   Driving to the area, I passed really close to Hartleys Fall which is one of my favorite fall in this area.  As soon as we left the area, the hills became less prononce and the likelihood of finding a fall seem to diminish.We took a well maintained and named dirt road and drove on it about 1km.  A turn to the left brought us to a shed of some kind which had a hum.  They probably generate electricity in there so keep well away.  On the left of the shed was an atv path.  We followed it along some kind of canal.  the water was flowing at a good clip.  Then we heard the roar of the waterfall ahead.  The water leaves the canal through a culvert, falls about 10ft and then falls another 40ft if not more to the gorge below.   I opted tp bushwhack in the dense evergreen forest on the right of the brook (facing downstream).  That maybe was mistake but I still managed to get all the way down to a small brook flowing at the base of the fall.  The small brook is the original brook and has a few small drops and cool looking rod walls.  If you follow it upstream, you will get back to the dirt road.  Above the metal bridge on the dirt road is a nice 8ft drop fall.I have put this fall as moderate because of the descent into the ravine.  Take your time.  Pick a good route. BTW I knew it would be a good fall as you can clearly see it on sat imagery!",
    "directions": "Highway 344 in Mulgrave.  continue south on 344 until you turn right on Middleton Rd.  Drive to where there are power lines and the shed at; 45.526414, -61.315526.  The fall itself are at; 45.524977, -61.311955.",
    "geohash": "f8h",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/13265/narrow_melf-1--27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13265/reg_Screen-Shot-2019-10-05-at-9.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/melford-brook-fall-near-port-hawkesbury-ns-13265",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 5,
        "Time": "1 hrs",
        "Total Distance": "1 km",
        "Town": "Port Hawkesbury, NS",
        "Type": "out-and-back"
    },
    "title": "Melford Brook Fall",
    "trail_id": "13265"
}