{
    "description": "It's Easter weekend, and Shannon and I set off to the Economy area from Charlottetown. It was eleven months ago since I had been there hiking the Kenomee Canyon trail, and exploring other waterfalls in the area. This time, we were bound for Devil's Bend trail, an 8 km hike that runs along the Economy River. Our first highlight on route was seeing three deer foraging in the field next to the highway. We stopped for a photo.\r\n\r\nApproaching Economy, we paused at the old orientation building before driving up the dirt road leading to the trail head.I set my GPS for the coordinates of Devil's Bend trail head, and watched as the distance ticked down. Bingo! We had arrived. We wern't alone either. The small parking lot had five or six cars. I guess hiking on such a beautiful long weekend wasn't the most original idea. Consequently, I was envisioning the trail packed with hikers. Funny that, as we got our gear ready and turned toward the trail, most of the cars had left!\r\n\r\nThere was a family of three who were also heading in on the trail at around the same time as us. We held back to let them gain some ground. They wern't carrying any gear, so we figured that they would make faster time. We were carrying full packs mainly as a training exercise for some of our multi day trips planned for the summer.\r\n\r\nThe trail started out seemingly like an ATV trail. We noticed some snow and ice still in the area, especially on the trail itself. I was wondering how much of the trail would be this wide. That was answered soon enough as the trail ducked down toward a creek. It got narrow very quickly. Some places were still quite slippery with ice from water run off.\r\n\r\nOnce under way, the first thing I noticed about the route was that there were few trail markers. Once in a while, we'd see waterfall signage, and some confusing distance markers. But for a major part, we were following other people's foot prints when the trail was snow covered, or the well worn trail itself. So my guess is that the trail was obvious enough, but during the winter and spring, things just wern't as easy to find.\r\n\r\n\r\n\r\n\r\n\r\nOne funny thing of note was that family we met at the trail head. Once in a while, we'd hear them or catch a glimpse of them further up the trail. Most of the time, it was the \"mother\" bitching about the trail. At one point as we passed them, the woman sat down and refused to go any further. Of course I was wondering exactly how she intended to get back to the car. They were about 6 kms in on the trail, so she would need to either backtracking on the rough terrain, or finishing the trail to the falls, and taking the easy way back via the road. Poor family...\r\n\r\nAt the enscarpment branch of the trail the guy and his daughter caught up to us, and asked how much was left of the trail. Apparently he thought the trail was merely a ten minute affair. Maybe that would explain why his wife was so upset. I showed him the map, and estimated that there was another 40 minutes to go. Hearing that, he ran back to his now \"stuck\" wife. I was still musing over their situation.\r\n\r\nThis was my first time on this particular trail. As we hiked along, and enjoyed the look-off views of the river, we were asking \"So, this must be the \"Bend?\" I especially enjoyed the rocky terrain, signs of animal life, and the winding nature of the trail. One very pretty spot has the trail running along the base of a rock wall.\r\n\r\nIn all, I wouldn't say it was an easy trail, but due to its length, isolation, and linear nature, it certainly would classify as a fun day hike. Economy is a great area for hiking and wilderness camping. The terrain is extreme, and the views, vast. I hope to come back again with some camping gear for a longer stay.\r\n\r",
    "directions": "\r\n\r\nFollow the road to Parsboro arriving at Economy. THere is a small building on the left showing where to find the trailhead. Take the dirt road opposite the building, and look for signs.\r\nUse of your GPS works very well to find the trailhead.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/1326/reg_Devil-s-Bend-Trail-012-27121.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1326/reg_Devil-s-Bend-Trail-016-27121.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1326/reg_Devil-s-Bend-Trail-024-27121.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1326/narrow_Devil-s-Bend-Trail-013-27121.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1326/narrow_scan0001jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1326/narrow_scan0002jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1326/narrow_scan0003jpg.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/devils-bend-near-parrsboro-ns-1326",
    "stats": {
        "Activities": "snowshoe hike mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "6 hrs",
        "Total Distance": "7 km",
        "Town": "Parrsboro, NS",
        "Type": "out-and-back"
    },
    "title": "Devil's Bend",
    "trail_id": "1326"
}