{
    "description": "The second lower in the title is not a typo.   I had previously explored this river for fall and describe an upper and a lower clam harbour river falls on trailpeak.  By chance I was looking at some sat imagery and noticed I had missed a major fall system on the lower reach of this river....only about 500m or less than where I was previously.I took another route completely to get there this time and the falls are super nice and deserve their own post.  I set off in a farmer's field and walked all the way to the edge of a forest about 700m or so down a gentle slope.  Close to the forest, I could hear the roar of the fall.  I carefully made my way down the steep slope and was greeted but two very nice drops of about 12 and 20ft respectively.  The lower set is the tallest and nicest and has a natural water slide at the bottom.",
    "directions": "On highway 344 near Boylston, turn on Hart Rd and drive 850m.  There is a path to a field and then an abandoned house both on your right.  Take the path to the field and go to the edge of the forest.  Fall is approx at; 45.434425, -61.451516",
    "geohash": "f8h63",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/13267/long_71498149-1496246223848550-4416550952497053696-o-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13267/long_72178240-1496246323848540-6218311250955206656-o-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13267/long_72281703-1496246267181879-5491170079401836544-o-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13267/long_72289453-1496246173848555-2983408112003710976-o-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/lower-lower-clam-harbour-river-fall-near-port-hawkesbury-ns-13267",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "2 km",
        "Town": "Port Hawkesbury, NS",
        "Type": "out-and-back"
    },
    "title": "Lower Lower Clam Harbour River Fall",
    "trail_id": "13267"
}