{
    "description": "This is a separate entry since the hike I had described years ago was for waterfalls on two different brooks.  I am keeping but updating the original post called hart lake brook fall but I am added this one for the numerous falls on Horse Pasture Brook.Basically from the parking area follow the old logging road.  the first brook you will cross is Hart Lake and you will see a fall just upstream of crossing.  Go see it and then get back on the road and follow it as it gradually begins to ascend the mountains. Once it reaches the top you will cross a brook. Follow this brook downstream to see about 5-6 different falls of all shapes and size. The last one is the biggest. The walk in the forest to these falls is very easy. Trees are widely spaced and you could probably do some nice tele turns in here as shrubs are most non existent and slope is steep enough to gain speed but not too much to loose control.",
    "directions": "Highway 4 towards Wentworth. As you go don the hill from Folly Lake take second road on your right (First one is gated). Follow this road to its conclusion in a cleared area. Head North to the start of the dirt road at N45 34 14.8 W63 32 58.9.",
    "geohash": "f84g",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/13277/reg_horse-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13277/reg_horse2-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13277/reg_horse5-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13277/narrow_horse6-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/horse-pasture-brook-fall-near-truro-ns-13277",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 5,
        "Time": "1 hrs",
        "Total Distance": "3 km",
        "Town": "Truro, NS",
        "Type": "out-and-back"
    },
    "title": "Horse Pasture Brook Fall",
    "trail_id": "13277"
}