{
    "description": "A long time ago, I was looking at some topo maps and the name of this brook stood out to me!  Fall Brook Fall!  There are a few of those in NS and they usually are aptly named!  The most famous of those brooks gives rise to Uisge Ban falls in Cape Breton.The problem is that I am seldom in the Joggins area of the province to explore.  I parked by an old logging road which had signs informing me that this piece of land was now a Wilderness Area!  I followed the path until it disappeared and then made my way towards the shore.  My descent to the Bay of Fundy was tricky so look for a better spot than my gps track?I would suggest to go all the way to the point.I then walked the shoreline until I could actually see the fall in the distance.  As I approached, I was a bit distraught to see that the fall itself was about 15ft at best.  It?s nice looking and all but not really worth my time to go explore all the way out there.  I then continued westward to the next brook (Fitzgibbons) which had a few gnarly looking geological formations around.  To get back to my car, I bushwhacked my way diagonally to the highway.",
    "directions": "In Joggins, continue west on Shulie Rd towards Apple River.  The dirt track I used is at; N45.59481° W64.58111° and the fall is at; N45.59987° W64.59492°",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/13274/reg_fallbrookfall-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13274/narrow_fallbrookfall2-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13274/narrow_fallbrookfall3-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/fall-brook-fall-joggins-near-amherst-ns-13274",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 2,
        "Time": "2 hrs",
        "Total Distance": "8 km",
        "Town": "Amherst, NS",
        "Type": "out-and-back"
    },
    "title": "Fall Brook Fall (Joggins)",
    "trail_id": "13274"
}