{
    "description": "After receiving a tip on a waterfall in the area, I set out to explore. I looked at satellite imagery and spotted a path or dirt road that paralleled the McClure's brook in Truro. I started walking on the train tracks until I found a decent spot to cut over to the path. Once I got on the path, I realised it was an old railway that was removed. I followed the old railway path to the location that was described and pushed though a small thicket to a tributary where a small creek joined. I followed the creek up to the first set of falls and then proceeded to continue to another two or three more falls. The first fall is about 5 or 6 foot, the second which could be considered either cascading or two separate waterfalls are close to 15 ft combined.",
    "directions": "In Truro head south on Willow street and park across from Crosley Carpets. head to the train tracks and walk until you get behind the Surgain feed mill. Next cut through a medium thick forest for 100ft until you reach the old railway path. Follow the path south until you reach (45.33898, -63.29497) from this point, cut through the woods until you reach the tributary on the McClures Brook 45.33865, -63.29742 Follow the stream and the first set of falls is at 45.3379, -63.29755 and the second and third are at 45.33769, -63.29813If you want to go directly to the falls then park across from Blakeney Dr at 45.33963, -63.29476 cross the tracks and cut through the forest for 100ft until you reach the path and then you can proceed as above from 45.33898, -63.29497",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/13284/reg_GOPR1539-61726.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13284/narrow_IMG-0422-61726.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13284/narrow_IMG-0432-61726.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13284/narrow_IMG-0437-61726.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/old-tracks-hike-and-waterfalls-near-truro-ns-13284",
    "stats": {
        "Activities": "ski-xc hike snowshoe climb",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "2 km",
        "Town": "Truro, NS",
        "Type": "out-and-back"
    },
    "title": "Old tracks hike and Waterfalls",
    "trail_id": "13284"
}