{
    "description": "This is an easy hike into a small valley off highway 311 just north of Earltown.  Most people would not give this place a second glance but if you are willing to do some easy level bushwhack, you will explore two beautiful waterfalls about 900m upstream of the highway crossing.I first explored here years ago but I guess I forgot post in on trailpeak so voila!   The brook doesn't have a name other than it is a tributary of Waughs River. So I usually would just call it some derivation of the river's name..like Upper tributary of Waughs River Fall but instead this time I chose to name it after someone who's been hiking a lot lately and showcasing the best of NS hiking destinations....you know who you are!Anyways back to the hike..I followed the stream pretty closely and crossed it a few times.  Overall it was easy.  The first fall cuts the valley and you will need to go up the ravine slope to the right of the fall to go above it.  The first fall is about 12ft and then just upstream of it is a  25 ft fall .  To return to my vehicle, I went up the ravine slope and found myself in a field of some sort.  I followed the outside of it for a while and then plunged back into the stream valley for the last 250m or so.",
    "directions": "Highway 311 in Earltown...head towards Tatamagouche.  You will see Ferguson Brook Rd on your left.  The brook run need to follow up is located 1.4km after this road at; N45 35 37.5 W63 12 47.8",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/13283/reg_74595040-1515592031913969-7832540920649089024-o-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13283/long_20191018-135215-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13283/narrow_75241039-1515592058580633-6357430120755494912-n-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/grants-falls-near-tatamagouche-ns-13283",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "2 km",
        "Town": "Tatamagouche, NS",
        "Type": "out-and-back"
    },
    "title": "Grant's Falls",
    "trail_id": "13283"
}