{
    "description": "If you look closely at the 1:50 000 topo maps?you will seldom find a waterfall marked on them.  In Gros Morne National Park, home to numerous tall and well know falls, there is one feature mapped out called ?High Falls? off the Mackenzie Mill Brook between Wiltondale and Rocky Harbour.  Of course there are no trails to get you there except for some well defined moose trails!  The way I took to get there and back to my car was about 10km return and 500m elevation gain.I set off on the left hand side of the brook (facing upstream) and soon was on the lip of a major landslide by the brook.  I could hear a waterfall down there but it was way down the ravine.  I marked it to check out on my return journey.  I used moose tracks most of the way and when not possible, I found the bushwack to be a moderate level to sometimes easy.After a while, you emerge on a high valley and start to see the end of the journey ahead.  The falls you see then are on another branch of the same brook but they are not the ?High Falls?.  Once at the end of the valley, you are surrounded by steep slope.  The High falls are located on the branch to the right.  I made my way up this pretty steep valley following the brook.  The falls are numerous but even going all the way to the top, I failed to see why they named these waterfalls on the topo map.  Yes it is an endless series of falls from 10-25 ft but I am sure, Nfld is filled with these types of falls.  Nevertheless, the ravine or gorge where they are located are very scenic with very forbidding rock walls on either sides.The other branch located 100m away offers a few more falls in the upper reaches a swell.  I kept on the other side of the brook to come back to my car and soon was bushwacking to the fall I could hear when I first started my journey.  That fall is located at;   49°30'21.33\"N, 57°46'59.52\"W   while high falls are finish at;  49°31'25.51\"N, 57°45'25.94\"W.",
    "directions": "Drive highway 430 towards rocky Harbour in the Gros Morne NP.  There is a picnic area for Mill Brook at; 49°30'3.26\"N, 57°47'16.95\"W",
    "geohash": "f8yc",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NL/13286/narrow_high4-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/13286/reg_high-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/13286/reg_high6-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/13286/reg_highfalls-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/13286/narrow_high1-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/13286/narrow_high10-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/13286/narrow_high2-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/13286/narrow_high5-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/13286/narrow_high8-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/13286/narrow_high9-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/high-falls-near-rocky-harbour-nf-13286",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 5,
        "Time": "3 hrs",
        "Total Distance": "10 km",
        "Town": "Rocky Harbour, NF",
        "Type": "out-and-back"
    },
    "title": "High Falls",
    "trail_id": "13286"
}