{
    "description": "Woohoo is what I was hollering as soon as I stepped out of the pasture and into the forest.  Just ahead, I could see the ground giving away into a huge ravine.  I could hear the roar of the water but I couldn?t see the falls as the ravine was so steep.  I don?t remember what clues I followed to out a waypoint in my gps for this area but I am super happy to have taken the time to check it out.  Driving on the dirt road towards the fall, you will no expect to see anything as the land is pretty flat.  I parked by a field and followed a small tributary of Wallace Brook.The small tributary has carved a huge ravine with scree slopes on either sides of the falls?Oh yes it's not just one fall, you are getting 4 falls in a row here!  Caution though is the tributary is small so only go after rainfall of 30mm or more or after snowmelt.  I was able to climb on the side of the falls to get to the top but I was using a lot of delicate footing to ensure I was not going to slide all the way down.  The easiest is to make your way down and up through the forest located 150ft away (see gps track).",
    "directions": "Highway 245 from Malignant cove towards Antigonish.  Take Cloverville Rd.  Turn on Big Marsh Rd.  Turn on West LakeVale Rd, drive 550m and park.  Follow small brook downstream.  Fall is at;  N45° 44' 38.1\" W61° 59' 56.0\"",
    "geohash": "f85ujp",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/13299/narrow_wallace3-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13299/narrow_wallace-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13299/reg_wallace-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13299/narrow_wallace1-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13299/narrow_wallace2-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/wallace-brook-falls-near-antigonish-ns-13299",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "1 km",
        "Town": "Antigonish, NS",
        "Type": "out-and-back"
    },
    "title": "Wallace Brook Falls",
    "trail_id": "13299"
}