{
    "description": "This is a cool exploration hike to two seldom seen waterfalls in the foothills of the Eigg Mountains near Antigonish.  Make sure to go after a hard rain (30mm or more) or after snow melt as I suspect these falls may go dry sometimes.  My gpx tracks show two routes...one is pure hell and the other one is just perfect.  The one to the north or closer to the stream is the one to go for.   I will explain just the better route as the other one is mainly a dense bushwack in a really difficult setting.  Park your car on McGee Rd and aim for a large pasture field (N45° 42' 20.1\" W62° 14' 07.5\") which you will not see but is located after 200m of bushwack.  Once in the field, follow the side located closest to Knoydart Brook.  Once the field stops, you will be mere steps from a secondary fall at N45° 42' 14.6\" W62° 13' 39.1\".  this one is the smaller of the two falls for this hike.Continue trying to stay high on the side of Knoydart Brook while bushwacking lightly to the next ravine.  If you go down to the brook, just follow it up upstream.  The ravine is located at; N45° 42' 14.1\" W62° 13' 23.0\".  Walk in about 150m to a beautiful series of waterfalls.  The rock here is very square so the falls are very particular.  Also the tallest fall has a large boulder right at its foot (N45° 42' 12.0\" W62° 13' 21.1\").",
    "directions": "Highway 245 from Baileys Brook towards Arisaig.  Turn right on McGee Rd. Park at; N45° 42' 21.2\" W62° 14' 19.1\".  Main Fall is at; N45° 42' 12.0\" W62° 13' 21.1\".  Secondary fall at N45° 42' 14.6\" W62° 13' 39.1\".",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/13296/reg_75246780-1545140582292447-7504534139404550144-o-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13296/reg_75588250-1545140698959102-3168717783114448896-o-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13296/reg_77019503-1545140658959106-3865021188266786816-o-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13296/narrow_77295836-1545141298959042-635559274663116800-o-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/knoydart-falls-near-antigonish-ns-13296",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "4 km",
        "Town": "Antigonish, NS",
        "Type": "out-and-back"
    },
    "title": "Knoydart Falls",
    "trail_id": "13296"
}