{
    "description": "This is a really cool area in an under explored area of the province.   Just to the north of Sherbrooke is a series of lakes near Stillwater. The Fifth Lake has some pretty good size cliffs on the opposite side from the highway.  On the northern edge of these cliffs is also a very tall multiple tier waterfall.  However, you need to see this fall after a to of rain as it may go dry at certain timers of the year.  The cliffs for rock climbing are to the south of this waterfall all along the edge of the lake.To access this area, I walked into the Nimrods campground.  At the back of the campground is a trail signed (Lake Trail).  Follow it as it crosses a brook and goes uphill right after the brook.  At some point it will descend back to the lake.  Instead, start bushwhacking towards the cliffs on the left side.   The bushwhack can be nasty in some places but the rewards will make it worth the effort.A fellow waterfall enthusiast shared this location with me; Thanks Christopher Sinclair!",
    "directions": "Highway 7 from Sherbrooke towards Antigonish. Turn right on Marine Drive (highway 211) in Stillwater.  Nimrods campground is on the left about 1.5km after the intersection from highway 7.",
    "geohash": "f85b",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/13302/reg_DSC-8751-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13302/reg_DSC-8753-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13302/narrow_DSC-8755-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13302/narrow_DSC-8756-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/fifth-lake-fall-near-antigonish-ns-13302",
    "stats": {
        "Activities": "climb hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 5,
        "Time": "1 hrs",
        "Total Distance": "4 km",
        "Town": "Antigonish, NS",
        "Type": "out-and-back"
    },
    "title": "Fifth Lake Fall",
    "trail_id": "13302"
}