{
    "description": "This is one under explored fall located near Newport Corner.   It was listed in my old maps from the 1890s but I had forgotten to check it out.   Luckily I did.  It is a beautiful 25ft drop nestled in a mature evergreen forest.As always I tried to make my way to where I thought the fall would be located using existing atv or logging path.  There was one off the collier Rd which seems like a well travelled atv path.  There were no signs posted so I used it in December 2019.  Of course if a sign comes up or a barrier is installed, than an alternative route will have to be taken to the fall.The atv path soon came to the Weir Brook.  I crossed it and then made my way to the right as the trail ascended a small hill.  I followed this path for a while until it crossed the tributary where the fall is located.  If you are lucky you may find a smaller trail located on the left hand side of the brook (atop the ravine slope) which will take you right to the fall...if not just follow the brook upstream to the fall.",
    "directions": "Take highway 1 to Newport Corner.  turn oon Collier West Rd.  Park where the atv trail meets this road at; 44°57'22.0\"N 63°57'35.3\"W.  The fall is located at;  N44° 57' 00.3\" W63° 58' 11.6\".",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/13314/reg_DSC-8866-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13314/narrow_DSC-8861-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13314/narrow_DSC-8862-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/weir-brook-tributary-fall-near-windsor-ns-13314",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "3 km",
        "Town": "Windsor, NS",
        "Type": "out-and-back"
    },
    "title": "Weir Brook Tributary Fall",
    "trail_id": "13314"
}