{
    "description": "Whenever I'm bored and cant get out of the house for an adventure, I try to search for interesting features on satellite imagery with google earth.   I spotted a large concentrations of cliffs and boulders at the north end of Long Bridge Lake as well as some on Paces Lakes as well as many to the west of those lakes.  I placed a bunch of waypoints in my gps as once you are in there it is very easy to miss a large feature by a few metres because of the thick vegetation or rolling topography.I decided to explore in the winter so I could use there lakes as hiking paths.   The forest on the eastern shore is sometimes very hard to bushwhack through so by using the lakes, I would be cursing a lot less.   Setting off from the old highway 7 between Porters Lake and Musquodoboit Hbr, I purposely hugged the shoreline to avoid any soft spots in the ice.  Since I donate see this lake very often, I do not have the unique knowledge of knowing if parts of the lake do not freeze as quickly as others.   Oh and yes btw I did go through once in the journey...but only up to the knee and it was in an area where water was not deep and full of vegetation sticking out of the ice.   This is probably why I went through in the first place...Anyways as soon as you make some way on the lake, the feature to the north appear more numerous.   Like I said I was aiming for some features to the north of the lake and I was pleasantly surprised (and quickly) to see some very large boulders and a cool overhand in an area centred on; N44° 47.771' W63° 12.388'.I followed the rounded cliffs here towards Paces Lake and saw some more lare boulders but the cliffs were a bit dissapointiung.  I went to the base of the slope and actually found an old flagged trail between Long Bridge Lake and Paces Lake.   Once in view of Paces Lake there were another set of very ;large boulders in an area around; N44° 48.201' W63° 12.885'.  Again the cliffs were not as good as I thought they would be.Setting off from there , I crossed a small section of Paces Lake and soon I could see Main Face climbing area in the distance.   I entered the woods and aimed for some more features in the middle of nowhere.  The set here actually had a lot to offer.  It is centred around; N44° 47.899' W63° 13.419'.  The boulders are super wicked nice BUT the terrain to get there is eastern shore brutal with most of the time having to navigate through thigh or waist high shrubs!I made a line towards the Long Bridge Lake towards the end and opted out off some of the features near the lake as I was somewhat tired of fighting the vegetation.Stats for the hike is 10km and 300m of elevation gain.",
    "directions": "Take highway 107 from Dartmouth to Musquodoboit Hbr.  at the end turn left on highway 7 back towards Porters Lake.  Drive 2km dies west and park at the bridge close to where there is a water intake for fire trucks at; N44° 46.834' W63° 12.171'.",
    "geohash": "dxgnc",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/13317/reg_DSC-8875-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13317/reg_DSC-8878-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13317/narrow_DSC-8873-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/long-bridge-lake-cliffs-and-boulders-near-halifax-ns-13317",
    "stats": {
        "Activities": "hike climb",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 5,
        "Time": "4 hrs",
        "Total Distance": "10 km",
        "Town": "Halifax, NS",
        "Type": "out-and-back"
    },
    "title": "Long Bridge Lake Cliffs and Boulders",
    "trail_id": "13317"
}