{
    "description": "After a few years of exploring in Nova Scotia, the number of waypoints left in my gps is finally diminishing. I live within HRM and therefore most of the waypoints I have left are located a few hours distant....especially in Cape Breton.\n\r\nA friend of mine knows how much I love to explore off the beaten path and offered the location of an adit in Londonderry. I checked my tracks for that area and although there are lots of tracks, not one passed by this adit. Needless to say I was pretty excited to check it out!\n\r\nFast forward a few months and I finally have the time to get out there. Since I already know of a good adit nearby, (Martin Brook adit in trailpeak!), I added that one and a few more shafts and adits close by that I had yet to visit. There are a few thousands of those in NS so it's hard to get to all of them but Ièm trying really hard.\n\r\nI left my car on a brand new logging road and within 3 minutes I was standing in the Martin Brook adit, I then followed my gps to the waypoint given to me by Rod A Mac Bhiocair! I git a bit suspicious that it would not pan out as the area I was hiking into had been clear cut in the last year. the waypoint was on the side of the brand new logging road and I didn't see any openings...although it might have been just filled in. I continued along a pre set route to a few more waypoints that I had in my gps. Most where old shafts that are now flooded or adits that are now filled in.\n\r\nUntil I hit one of my furthest waypoints. Here, even in winter, a small brook was flowing out of a partially open adit. That there would be unfrozen water probably means this one continues a long time underground. The entrance was filled in quite thickly with hard snow and having no shovel, I left the area without going into the adit.\n\nDirections:\n\r\nDrive to Londonderry, continue on Mines Bass Rd Rd heading west and turn right on Branch Rd or Upper Rd and continue with your gps pointing to the adit described above approx at; N45° 29' 11.6\" W63° 36' 57.6\"",
    "directions": "",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/13323/reg_20200218-082340-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13323/narrow_20200218-082331-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13323/narrow_20200218-085435-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13323/narrow_20200218-085941-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13323/narrow_20200218-091356-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/londonderry-adit-near-truro-ns-13323",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "3 km",
        "Town": "Truro, NS",
        "Type": "out-and-back"
    },
    "title": "Londonderry adit",
    "trail_id": "13323"
}