{
    "description": "This is a spring ski touring traverse of the heavily glaciated divide between the Ashlu and Elaho Rivers.  The trip can take three days, but would be most enjoyed with 4-5 days, allowing for side trips and extra skiing.\r\n\r\nThe traverse was originally done from N to S, but due to road washouts at mile 25 in the Fall of 2003, it is now best accessed approaching Mt Buck from the SW.\r\n\r\nAfter the 3 bridges crossing the Squamish River at mile 20, take the first 4x4 rd on the right, stopping when you can go no further.  Follow this Rd on foot until you pass a small bluff on your left.  Two mile on, and just before a creek, take an E leading Rd heading steeply upwards.  Just before the Cr, 1 mile in, start \"bush-bashing\" north along the heavily treed E slope, towards the high valley just S of the Mt Buck.  We traversed the S and E slopes of Buck, but it may be preferable to gain the S spur a mile before the saddle, and pass the peak on the W, as the E slope is topped with cornices with cliffs below making for a treacherous crossing.\r\n\r\nHead NW along the widening divide, passing to the E of  Zig-Zag to take advantage of the views from Storey Peak. From there, follow the shoulder NW, then approach Charlie-Charlie from the E.  The summit can easily be gained from the south.  \r\n\r\nFollow the northern shoulder of Charlie-Charlie across easy terrain above the eastern ice fields, making a side trip to Pykett Peak if you wish.   Head up high towards Icecap Peak, until you're well above the heavily crevassed ice field, then follow the ridge W from just below the summit, just north above and east-west headwall, to drop back down SW through a keyhole.  Ski down past a steep slope, then W to a small group of seracs on the slope south of Mt Amicus.   Negotiating a steep ice field, a col between Amicus Mountain and Peak 8273 can be gained by heading N towards the Peak, then approaching the col from the S side of Amicus.  (Alternatively, the slopes N of Amicus can be gained by passing Amicus on the E.)  \r\n\r\nFrom here, good skiing lead down ice fields.  (the stunning Ashlu Mt can be tackled as a side trip.  A gulley from the SE gains the E ridge.  A class 3 scramble will gain the summit.)  Climb the gentle slopes E of the ice field, then gain the twin peaks of Porterhouse from the N.\r\n\r\nHead S below the col, through a valley marked by a sub-peak on either side.  As the valley veers to the SW, and the glacier becomes evident, gain the S ridge (skiers Left).  Stay on the ridge until you are well below the cliffed-out broken glacier.  This is important, as you cannot see the cliffs from above.\r\n\r\nFrom below the glacier, follow the valley and Porterhouse Cr on its N side through some tight trees to cut blocks.  A logging rd at the bottom of the clear-cut will take you S back to the main Ashlu trunk rd.  Following this generally flat rd will get you the 16 miles back down the Ashlu River.  At mile 23 a bridge crosses the river, then heads down steeply on the W bank, through the Ashlu canyon, and back to the Squamish River.  The first L before the Squamish river will get you back to the drop-off point.",
    "directions": "From Squamish, head North on the sea-to-sky hwy.  Turn L at Brackendale, and follow then L a few miles on to follow the rd along the eastern side of the Squamish River.  At mile 20, cross the river on a large wooden bridge, then 3 smaller bridges.  This Rd heads along the Ashlu River.\r\n\r\nCurrent Conditions:\r\n\r\n        \r\n\r\n\r\n    \r\n        \r\n      \t\r\n\r",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/1332/reg_AUT8457JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1332/reg_AUT8538JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1332/reg_AUT8577JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1332/reg_Ashlu-Elaho-traverse-on-skis-AUT8500JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1332/reg_best0_Ashlu-Elaho-ski-traverse-squamish-8508JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1332/reg_topo_AAAshluElahomapjpg.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/ashlu-elaho-traverse-near-squamish-bc-1332",
    "stats": {
        "Activities": "ski-bc",
        "From": "",
        "Seasons": "spring",
        "Stars": 4,
        "Time": "28 hrs",
        "Total Distance": "45 km",
        "Town": "Squamish, BC",
        "Type": "out-and-back"
    },
    "title": "Ashlu - Elaho Traverse",
    "trail_id": "1332"
}