{
    "description": "One of the greatest hidden gems in Cole Harbour / Dartmouth and I am one to explore a lot of hidden places. I was looking at some satellite imagery at home during COVID19 at the time where we were not allowed to travel at all. This place was only 5km from my place as the crow flies and it had long narrow bands of rocks that looked intriguing. One of which in particular at a shade spot on one side indicating that it was not rounded off and could be quite high! I set off in an area close to it and found immediately an old overgrown trail leading to the general direction. That trail got a little bit confusing in the middle but soon we were on it again and basically facing the high cliffs to the south of us from another long series of rocks. We climbed the side of the cliffs and soon stood on top of them.\nYou wouldn't believe this to be so close to the city! There are some anchors so the rock climbing community is developing it. Another thing that is being developped is the trail to it...on the other side is a well maintained trail. We followed one of them and got out back to Bissett Rd close to where we had first started off (see blue route on picture). The problem with this trailhead is the lack of parking and the old dump site at first that you need to go across. You are better off taking a longer route off Cow Bay Rd (red route)",
    "directions": "Two routes. Longest route with parking (red route on picts) starts around 44°38'30.3\"N 63°25'28.4\"W. the shorter route with no parking (blue) starts at 44°38'58.9\"N 63°26'02.6\"W. the cliffs are at; 44°38'52.9\"N 63°26'33.0\"W .",
    "geohash": "dxf",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/13342/9582276117110118790386499100531582732599296o.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13342/Capture.JPG",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13342/1577522809027341905581116792124195046321224n.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/cole-harbour-cliffs-near-darmouth-13342",
    "stats": {
        "Activities": "hike",
        "Elevation Gain": "20 m",
        "From": "",
        "Seasons": "summer winter spring fall",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "8 km",
        "Town": "Darmouth, NS",
        "Type": "out-and-back"
    },
    "title": "Cole Harbour cliffs",
    "trail_id": "13342"
}