{
    "description": "<p>This trail provides a nice option to do a loop off of the Greenway back to Forests for the World or Greenway parking lot. The trail has extremely varied terrain - some sections appear to be overgrown roads, and others are just goat tracks. The trail is not groomed, other than most of the deadfall being removed, and therefore has areas with a lot of duff, tree roots, and some that are quite grassy. It travels through your typical Prince George forests, alternating between coniferous stands and deciduous forests, and has one large hill to walk your bike up if you are coming off the Greenway. Very hikeable, but if you don&#39;t mind occasionally getting off your bike if you aren&#39;t the most experienced mountain biker, also a nice ride.</p>",
    "directions": "Entrance from Kueng Rd is a very visible trailhead on west side of road near intersection with Crest Rd. Best to download the GPS data as there are other trails that branch off that are more hiking/snowshoeing than mountain biking.  If accessing trail from Greenway, you need to pay attention to see the trailhead from that end. Distance to the trailhead from where it branches off from Greenway will depend on where you park, and which other trails you take, but generally about 4.5 to 7km from those two parking areas. There is a Cranbrook Greenway Society sign on a cottonwood tree opposite the trailhead, and a ribbon marking entrance. No hassle parking available at Forests for the World parking lot or the UNBC parking lot.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/13353/KESQ77701.JPG",
        "https://trailpeak.com/storage//content/trails/Canada/BC/13353/XGIQ0349.JPG",
        "https://trailpeak.com/storage//content/trails/Canada/BC/13353/SYAR3313.JPG",
        "https://trailpeak.com/storage//content/trails/Canada/BC/13353/NDPZ6993.JPG",
        "https://trailpeak.com/storage//content/trails/Canada/BC/13353/TPTL5263.JPG",
        "https://trailpeak.com/storage//content/trails/Canada/BC/13353/QDFU8591.JPG",
        "https://trailpeak.com/storage//content/trails/Canada/BC/13353/USTU3668.JPG",
        "https://trailpeak.com/storage//content/trails/Canada/BC/13353/LUIM4953.JPG"
    ],
    "source_url": "https://trailpeak.com/trails/dreamcatcher-and-barrel-of-laughs-near-prince-george-13353",
    "stats": {
        "Activities": "hike mtn-bike fat-bike",
        "Elevation Gain": "83 m",
        "From": "",
        "Seasons": "summer winter spring fall",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "5 km",
        "Town": "Prince George, BC",
        "Type": "point-to-point"
    },
    "title": "Dreamcatcher and Barrel of Laughs",
    "trail_id": "13353"
}