{
    "description": "The unassuming Red Brook drains part of the North Mountain and then flows into the West Bay of the Bras d’Or Lake.  As far as hiking destinations go, this is one of the easy ones to get to the brook, but the difficulty starts once you try to photograph both falls that are located  in a deep ravine with steep slopes on either side. The brook flows under the ATV path and  following it upstream for 30 m/yd leads to the two tier falls within a matter of a minute or two.  Here the small brook has carved an impressive ravine.  The rock walls especially to the northeast are very impressive.  At times of low water it was easy for me to climb above the first fall using the brook itself.  This is required if you want to be able to have a better view of the upper fall.  The brook changes directions quite rapidly and because of this, the view of the upper fall can be obstructed.  A difficult climb on the steep slopes below the first fall may also give you a better vantage point to the upper fall but careful footing is required.   Apart from the nice waterfalls to explore, the mature hardwood forest in the vicinity of these falls is a sight to behold.  I absolutely love walking in these mature forests where the high canopy and lack of understory make travelling through them so easy.",
    "directions": "Highway 4 from Port Hawkesbury towards St Peters.  Turn left on County Line Road towards West Bay and drive 7.3 km (4.5 mi).  County Line Road becomes Marble Mountain Road.  Turn left on Cenotaph Road and drive 2.5 km (1.6 mi).  Turn right on MacIntosh Mountain Road. Drive 500 m/yd to its driveable conclusion located at the last house.  Here the road continues but becomes more of an ATV trail.   Drive or bike or walk the road to the waterfall located 1.5 km (0.9 mi) after the last house.",
    "geohash": "f8hkp",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/13363/red1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13363/red.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13363/DSC9321.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/red-brook-falls-near-port-hawkesbury-13363",
    "stats": {
        "Activities": "hike",
        "Elevation Gain": "30 m",
        "From": "",
        "Seasons": "summer spring fall",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "3 km",
        "Town": "Port Hawkesbury, NS",
        "Type": "out-and-back"
    },
    "title": "Red Brook Falls",
    "trail_id": "13363"
}