{
    "description": "This is a classic exploration that started on my computer.  I was comparing some satellite imagery and topographical maps of the MacIntyres Mountain area near Port Hastings.  One valley in particular seemed to possess closely packed contour line, which are sometimes indicative of waterfalls.  The bonus of this particular spot was the presence of a well-used dirt road leading to a quarry next to the brook.   \n\nUpon reaching an area close to the brook and the possible waterfalls, I entered the woods.  I could spot on the imagery a faint line in the woods, which usually indicates the presence of an old woods road. I was correct in my assumption since an old road could be followed as soon as I entered the forest.  The forest here was a mixture of hardwoods while the area to my right was dominated by softwoods.  The softwood stand had grown enough that the trees are now spread apart and a traverse through it is manageable without too much difficulty.  \n\nAfter 150m on the woods road, it started to descend a hill, instead I started my bushwack to the left (eastern direction) and was within less than a minute on the lip of a surprisingly deep ravine.  The downclimb into the ravine is easy to moderate since I have goat like skills.  No really, it’s not bad since there are lots of trees to hold on!  \n\nI came down at the right spot as I was soon entering a narrow ravine with high rock walls. The falls in the ravine are numerous and the tallest might be about 20 feet or so.  One of the best reason to go here is the ravine itself, it’s a nice little hidden oasis!",
    "directions": "Trans Canada Highway from Port Hastings towards Whycocomagh.  Turn left on Rhodena Rd and drive 3.5km.  Here the road curves about 90 degree to the left.  If you reach the quarry, you have gone too far.",
    "geohash": "f8hk5r",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/13361/macmaster2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13361/macmaster.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13361/macmaster1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13361/macmaster4.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13361/macmaster5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13361/macmaster6.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/macmaster-brook-falls-near-port-hastings-13361",
    "stats": {
        "Activities": "hike",
        "Elevation Gain": "50 m",
        "From": "",
        "Seasons": "summer spring fall",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "1 km",
        "Town": "Port Hastings, NS",
        "Type": "out-and-back"
    },
    "title": "MacMaster Brook Falls",
    "trail_id": "13361"
}