{
    "description": "This is a short hike to a series of impressive waterfalls set in a gorgeous Hemlock stand near the outlet of River Denys into Bras d’Or Lake.   MacLean brook drains just a small area on the north side of Marble Mountain.  However, what makes this a good waterfall brook is the location of a lake at its upstream point.  Company Lake is the source of water for this brook, which flows approximately 4km from the top of the mountain to the Bras d’Or Lake.   \n\nThe decision to explore along this brook were two fold.  In the first instance, the old maps by Fletcher indicated a fall of no height along this brook.  Secondly, the topographical map showed an area with lots of contour bunched together in an area just a few hundred metres from a well-travelled road.  Upon reaching the brook, I started to follow it on its east side going upstream.  On the way there, I distinctly remember seeing one of the largest pine tree ever.  The many trunks of it makes it a memorable sight.  Soon the terrain started to elevate and the brook flowed out of a small ravine.  The brook has carved out a nice channel through solid rock with lots of cascade type waterfalls throughout its journey.  \n\nThe forest here is dominated by hemlocks with a high canopy.  There are large boulders covered by ferns on the right side of the brook while the nicest and tallest fall is located approximately 350m/ yd upstream of the trailhead.  Here on the left side of the brook is a large rock cliff which dwarfs the 20 feet (6 m) slide type waterfall beside it.  This cliff gave rise to the name of the falls since on closer inspection one can clearly see a perfect arch set at a 45 degree angle through the cliff.   I have explored lots in Nova Scotia but I can only count on a handful of these land-based natural arches not carved by a brook.  Some of the more obscure and hard to reach brooks in the Cape Breton Highlands National Park have similar feature.\n\nAbove the last waterfall, I noticed what looks like a man made feature.  A trench has been dug into the ground in a straight line which makes me wonder if there was a mill on this brook a while ago.  It might be true since upon my return journey to my vehicle, I noticed a stone foundation in line with the trench at the base of the hill.",
    "directions": "In Orangedale take Marble Mountain Road.  Drive south towards Marble Mountain.  After the bridge over River Denys, turn left on Marble Mountain Road.   Drive 1.2 km to the stream crossing and park your car.",
    "geohash": "f8hsf",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/13362/maclean8.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13362/maclean.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13362/maclean3.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13362/maclean1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13362/maclean4.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13362/maclean5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13362/maclean6.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13362/maclean7.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13362/maclean9.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/natural-arch-fall-near-orangedale-13362",
    "stats": {
        "Activities": "hike",
        "Elevation Gain": "50 m",
        "From": "",
        "Seasons": "summer winter spring fall",
        "Stars": 5,
        "Time": "1 hrs",
        "Total Distance": "1 km",
        "Town": "Orangedale, NS",
        "Type": "out-and-back"
    },
    "title": "Natural Arch Fall",
    "trail_id": "13362"
}