{
    "description": "This is a great hike to perform when short on time.  This waterfall is located mere steps from a well travelled road in Cleveland.  Ferguson Brook is one of those brooks where a waterfall is totally unexpected.   The main branch of the brook, upstream of County Line Road flows over a small hill losing over 20 m (60 ft) of height in a short distance.  Unfortunately, the waterfall is not 20 m (60 ft) but it is a rather beautiful multi tier falls of a total height exceeding 7 m (23 feet).  The brook is well hidden from the road and I parked right over its culvert without even realizing it.  The walk in the brook or on its side is easy as even if the forest is quite dense in places, the distance is very short to reach the fall. \n\nThe geology is quite remarkable as well as upon reaching the base of the fall, you start to notice the slate like type of geology.  The brook is continually carving out the rock from under the falls and leaving the discard pieces at the base.  This brook does not drain a large area and therefore a visit after spring melt or a heavy rainfall is highly recommended.",
    "directions": "Highway 4 from Port Hawkesbury to Cleveland.  After crossing the bridge, turn left on County Line Road and drive 600 m/yd.  The waterfall is hidden in the woods on the northside of the road.  The brook flows in a culvert under County Line Road.  Follow the brook upstream to the fall.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/13364/ferguson.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/ferguson-brook-fall-near-port-hawkesbury-13364",
    "stats": {
        "Activities": "hike",
        "Elevation Gain": "20 m",
        "From": "",
        "Seasons": "summer winter spring fall",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "1 km",
        "Town": "Port Hawkesbury, NS",
        "Type": "out-and-back"
    },
    "title": "Ferguson Brook Fall",
    "trail_id": "13364"
}