{
    "description": "This is one of those brook where I had previously explored.  Back in 2013 or so I explored a section of the brook, found a whopping (sarcastic) fall of about 10 feet.  The topography didn't look like much more would occur close by and I needed to get back to the city so I turned around.  \n\nfast forward 2020 and I am looking at some sat imagery and sometime looks promising on the same brook.   Measuring from where I explored in 2013, it is a mere 200m more upstream.  But this happens a lot when exploring for unknown waterfalls...when do you turn back?   Go on a hunch but sometimes you are wrong and this was the case.  I approached the upper section of the brook via some logging roads off the General Line Rd.  The logging road actually goes within 200m of bushwacking to the fall, but the last 4km is fairly narrow...better to you a mtn bike or an atv.\n\nFrom the end of the logging road, follow a dry stream downstream.  It meets the main branch, hike upstream on the main branch and within a minute stand in front of a gorgeous two tier 45 ft fall!  I cannot believe I turned around withon 200m of this beauty.  It really shows to #neverstopexploring, #neverturnaround!",
    "directions": "TCH in Port Hastings towards Baddeck.  Turn left on General Line Rd.  Drive 13km.  At this point take a right and drive to the intersection with MacIntyre Moutain Rd. The road to take here is to continue heading north but this is where I parked, by a large sand pile and took my mtn bike.",
    "geohash": "f8hk",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/13360/chisholm1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13360/chisholm11.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13360/chisholm31.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/chisholm-brook-upper-fall-near-port-hastings-13360",
    "stats": {
        "Activities": "hike mtn-bike",
        "Elevation Gain": "150 m",
        "From": "",
        "Seasons": "summer spring fall",
        "Stars": 5,
        "Time": "2 hrs",
        "Total Distance": "8 km",
        "Town": "Port Hastings, NS",
        "Type": "out-and-back"
    },
    "title": "Chisholm Brook Upper Fall",
    "trail_id": "13360"
}