{
    "description": "*** Annual road closure (highway 40) between December 1 & June 15 (not certain about the dates). \n\n*** GPS: I don’t recommend our alternative descent as described below (& pics). Bushwhacking was frustrating sometimes. Coming back the same way is probably best. \n\nEdwards Rating: II (II) M M \n\n4.5 to 6.5 hours \n\n// Elevation of 601 m NET, 1014 m TOT, max 2346 m for the ridge & 2367 m for Ma Butte \n\nCompleted on June 27, 2020 in dry conditions. \n\nGear: Hiking poles. Warm clothes (strong winds) & bug repellent were a must today as well. \n\n***** \n\nWe really enjoyed that hike: Some good trails or logging roads to borrow, a long ridge walk with tremendous views of surrounding peaks (especially Crowsnest & Seven Sisters Mountains), flowers, coloured rocks, etc. You get a few minutes of scrambling up Ma Butte, otherwise it is a hike, but there’s no such a thing as an official trail here. Also, you are definitely in bear country here, but we didn’t see any even though there were signs all around. \n\nWe crossed the road and went up a logging road, turned right at the intersection after just a few minutes and then followed a decent trail under the powerline on the left. Towards the end of that steep slope, we followed a trail on the left to avoid some bushwhacking. As we reached the ridge, we turned right and found a bike trail. We followed it for a few minutes and saw a road on our left, close to the powerline. We followed it until it started turning left. We went straight up a first hill. Then we used the trail for some time again as long as it was bringing us straight north. When it turned west again, we went up another hill with some easy scrambling (avoidable). We then followed the ridgeline until we reached McGillivray’s high point. Looking west, we thought Ma Butte would only take 20 minutes... You lose about 300 m elevation as it goes up and down with the last slope being quite steeper. We stayed in the centre except on that last slope where we circumvented the forest to the left. Then we went up slightly to the right of Ma Butte’s summit block. The first 2 rock bands are no problem but the last one involves some climbing, avoidable by going right. We reach the summit block and scramble up a grassy slope on the right side of the cliff band. We reached a gully and went up on the left side where we finally got a bit of easy but steep hands-on scrambling. This may also be avoided by traversing the gully. \n\nGoing down, we went back to McGillivray’s summit and continued down east hoping to use clearings and logging roads and reach AB-40. We added about 900 m distance and lots of unnecessary bushwhacking. Views being so nice up the ridge and because the ascent route is quite easy, I recommend going down the way you came.",
    "directions": "From the bridge at the entrance of the Town of Blairmore, drive 5.8 km and turn right onto 86 St/AB-40 N. Drive another 8.9 km approximately and park at the clearing on the right side of the road (GR814085).",
    "geohash": "c2yd",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/13367/mcgillivrayridgemabuttecrowsnestpassmarryontheridgebeautifuljun272020.JPG",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13367/mcgillivrayridgemabuttecrowsnestpassmarryscramblingundermabuttejun272020.JPG",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13367/mcgillivrayridgemabuttecrowsnestpassnicerockcoloursjun272020.JPG",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13367/mcgillivrayridgemabuttecrowsnestpassourroutedownbushwhackingjun272020.JPG",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13367/mcgillivrayridgemabuttecrowsnestpassroutetoridgejun272020.JPG",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13367/mcgillivrayridgemabuttecrowsnestpasssummitblockroutejun272020.JPG",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13367/mcgillivrayridgemabuttecrowsnestpasssummitimarrylookingatmabutteospreypackjun272020.JPG",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13367/mcgillivrayridgemabuttecrowsnestpasssummitipanoramajun272020.JPG",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13367/mcgillivrayridgemabuttecrowsnestpasstecumsehcrowsnestsevensistersflowerseverywherestunningjun272020.JPG"
    ],
    "source_url": "https://trailpeak.com/trails/mcgillivray-ridge-and-ma-butte-near-coleman-13367",
    "stats": {
        "Activities": "hike scramble mtn-bike",
        "Elevation Gain": "1014 m",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 4,
        "Time": "6 hrs",
        "Total Distance": "14 km",
        "Town": "Coleman, AB",
        "Type": "out-and-back"
    },
    "title": "McGillivray Ridge and Ma Butte",
    "trail_id": "13367"
}