{
    "description": "The first part of the hike is pretty straight forward: Get on your feet (unless you own a rock crawler) at 49°44'06.7\"N 125°31'24.2\"W and walk the logging road towards the gorge that drains out of the Alexandra Peak west bowl. There is a flag on a tree that starts the not-so-obvious trail at the logging road. At 49°44'17.1\"N 125°31'00.5\"W go up the slash and towards the forest – the flagging through the slash is fairly obvious but somewhat spaced out. Once you get out of the slash and into the forest, the flags are tiny and barely noticeable. Follow the flags or make your way up through the bush until you get out of the bush and into an open gorge that will either be fully snow-covered, or snow and water running down from Alexandra Peak west bowl (depends on time of year). Follow the river up, and cross over to the right of the falls. Even if you don’t step on flagged route, just stay close to that creek and follow it up. \nApproximately at 49°44'13.1\"N 125°30'11.0\"W you will reach the top of that gorge and will be able to see Alexandra Peak and her famous thumb on the right. Now, pay attention here, as there are three options how to summit in front of you and your choice depends of your skill level. Pick the right one for you or you might get into trouble. \nOption 1: Hardest. Shoot for very left notch that’s between the summit massive and rock massif to the left. It’s going to appear as the easiest and shortest route, but from the bottom of the notch and up, there is an exposed section that can be fatal if you slip. We tried this route but turned around when we assessed the danger. \nOption 2. You won’t confuse this one; it’s the notch between the thumb and summit massif. We took this route and it had lots of snow for the majority of the way up (in June). I had crampons and an ice axe that seemed pretty mandatory to complete this section. It’s a steep route with lots of loose rock; I was struggling to keep traction and the rock was so deteriorated – once you’re 100m from the top, anything I grabbed fell apart like a fossil sedimentary rock. At this point my hiking partner was beyond her comfort zone and decided to wait for me on a ledge while I continued to the top.\nOption 3. I saw part of this route when I got up the notch to the left of the thumb and was on my way to summit. Note that I did not do this route, but it looks like it may be easiest. Basically, you can go to the right of the thumb, step on the ridge it “grew” from and go behind it. You’ll get to this same spot if you had taken Option 2. You’ll be right on that notch between thumb and summit. From here, continue along to the summit just like in Option 2.\nMy route tracks that I’ve presented are from summit down to the vehicle through option 2.",
    "directions": "Reach Campbell River then turn west onto HWY 28, once reached Buttle lake, keep going along the lake on Westmin Rd. At 49°45'54.3\"N 125°35'02.6\"W turn left on Buttle Bluffs logging road, there gonna be a gate which is almost always closed. Check here status of that gate https://www.mosaicforests.com/access. If its closed, no big deal, there is a steep road goes right behind and around the gate. You gonna need 4x4 from here and skills to drive it. There are lots of rockslides part blocking the road, its long way up but you’ll be able to get pretty close to trailhead at elevation of 1000-1100 meters, I think. Many times you’ll be driving close to the edge side of the road with nerve tickling drops, but I must say that was the most beautiful ride I ever had on logging roads, views are stunning and continuous. Drive up to this point 49°44'06.7\"N 125°31'24.2\"W.",
    "photos": [],
    "source_url": "https://trailpeak.com/trails/alexandra-peak-near-campbell-river-13388",
    "stats": {
        "Activities": "scramble",
        "Elevation Gain": "750 m",
        "From": "",
        "Stars": 5,
        "Time": "6 hrs",
        "Total Distance": "9 km",
        "Town": "Campbell River, BC",
        "Type": "out-and-back"
    },
    "title": "Alexandra Peak",
    "trail_id": "13388"
}