{
    "description": "After exploring for more than a decade mainly on the mainland of Nova Scotia, new falls are becoming a species at risk for me.  The Eigg Mountain/ James River wilderness area is well known for Cuties Hollow fall and I was hoping to find something similar as I was looking carefully at satellite images and topo maps for some potential waterfalls.  I hit the jackpot …there was an area that was definitely showed some white streaks through the canopy; a long lost and secret fall!!!!!!\n\nThe journey there is faster if you bring a mountain bike.  There are many ATV trails in that area that will bring you close to the river in question.  The trails are in goo condition and the bike is just a faster way to get there.  You will need  to leave the main trail at; N45.68489° W62.17390° and go on an overgrown but still bikeable (in 2020) trail.  Ditch the bike and start bushwacking to the river.  It will not be pleasant as the area was logged about 10-15 years ago.  Once on the river, follow it downstream…at first the forest is quite closed but opens up and is absolutely gorgeous.  I saw some mature maps and birch in there that would take more than two people to go around the trunk.\n\nFrom far away, I noticed an odd rectangle nailed to a tree by a rocky outcrop…it must have been put in place by some mining prospectors perhaps.  This was in the middle of nowhere…really strange!  I finally reached the top of the fall (N45.67820° W62.15596°) and was happy to find an unknown waterfall.  Unfortunately there is lots of deadfall in the way and the picture do not do it justice.  The bw ratio (bushwack to waterfall ratio) is in the moderate range for this fall…ie the bushwacking is not too horrible but the fall is perhaps not the most scenic one you can see in this area (go for Vameys Brook Fall instead!)  I travelled further downstream and found another 10 ft fall with a nice pool at the bottom N45.67443° W62.15168°.",
    "directions": "Highway 245.  Take Arbuckle Rd.  continue on it as it becomes Browns Mountain Road.  Drive on the new road leading to the wind turbines on top of the mountain.  Park at; N45.67551° W62.19852° where an signed ATV trail begins.  Take the ATV trail.  It will go down a hill and up to a T intersection.  Turn left at the intersection and go downhill until you hit another intersection.  Turn right and bike to N45.68489° W62.17390°.  That is the overgrown trail you need to go on to get to an area close to South Right River",
    "geohash": "f85g",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/13382/DSC9459.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13382/DSC9460.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/south-rights-river-falls-near-antigonish-13382",
    "stats": {
        "Activities": "hike mtn-bike",
        "Elevation Gain": "250 m",
        "From": "",
        "Seasons": "summer spring fall",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "12 km",
        "Town": "Antigonish, NS",
        "Type": "out-and-back"
    },
    "title": "South Rights River Falls",
    "trail_id": "13382"
}