{
    "description": "Wooohooo is what I shouted when I spotted this largely unknown waterfall located just a few hundreds of metres from the Cabot Trail near Ingonish.   Of course everyone is eager to get to the CBHNP but sometimes it pays off to slow down and do some exploring.   Redhead Brook drains part of Cape Smokey and therefore looses a lot of elevation.  In one little area you will find 5-6 drops one of which is at least 30ft.\n\nI set off from the Cabot Trail and immediately found n old path in the woods that was paralleling the brook.  I followed it for a while as it was loosing a lot of elevation and finally saw the brook on my right.   I down climbed the steep side wall and found myself immediately in front of a slider type fall with a huge pool in front.  I climbed up the fall on the right and then was astounded as the next fall is the largest at about 30ft in total, deep pool in front of it and a super high and straight rock wall on the right.\n\n\nI climbed up this fall on the left by using my mtn goat skills.  Upstream of the fall lies more, smaller, drops and you can follow them until you are back to the Cabot Trail.  Then just bushwhack back to your car.",
    "directions": "Cabot Trail towards Ingonish.  After passing Cape Smokey Provincial Park and the decent into Ingonish Ferry.  Park in front of the Castle Rock Inn and follow my gps track to the falls.",
    "geohash": "f8m160",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/13393/DSC9611.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13393/DSC9599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13393/DSC9602.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13393/DSC9608.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13393/DSC9617.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13393/DSC9621.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13393/DSC9625.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/redhead-brook-falls-near-ingonish-13393",
    "stats": {
        "Activities": "hike scramble climb",
        "Elevation Gain": "120 m",
        "From": "",
        "Seasons": "summer winter spring fall",
        "Stars": 5,
        "Time": "1 hrs",
        "Total Distance": "2 km",
        "Town": "Ingonish, NS",
        "Type": "out-and-back"
    },
    "title": "Redhead Brook Falls",
    "trail_id": "13393"
}