{
    "description": "This is not a description of an alpine climb - it explains how to get to the toe of Charlton/Unwin glacier. To proceed beyond this point you should possess alpine climbing skills.\n\nFirst, you have to paddle. The \"trailhead\" (a little beach) is ~ 14 km from Maligne Lake boat launch (almost) across Fisherman's Bay backcountry camping site.\nTo access the glacier, follow the creek bed (there will be some bushwacking involved) and stay as much as possible on the right hand (west) side. Depending on water levels, you might be able to walk straight through the creek bed. Once you get closer to the rock bends, choose a drainage/gully on your right hand side and go up (you could also keep going more to the right). Once you are high enough you can utilize some of the ledges on your left and walk towards the moraine (or you could go higher to reach the moraine edge (glacier views from here are even better), but in that case you'll have to descend a bit, and that could be quite slippery.\nOnce you pass the ledges just stay on the right side of the stream until you reach the glacier.",
    "directions": "Find a little beach by Charlton/Unwin stream, leave your canoe/kayak there. Bushwack for some 700 m (it should be on the right hand side of the stream), and then depending on water levels follow the creek bed.\nAs you go, you'll see the waterfalls in front of you (more to the left), keep going to the right, via obvious drainage/gully. Once you are high enough look for passable ledges and traverse to the left into the basin. Once there just follow the creek, stay on the right hand side (this is where there are a quite nice bivi spots for those who would climb Charlton/Unwin).\nReturn the same way.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/13396/DSC07531.JPG"
    ],
    "source_url": "https://trailpeak.com/trails/charlton-and-unwin-glacier-approach-near-jasper-13396",
    "stats": {
        "Activities": "scramble",
        "Elevation Gain": "500 m",
        "From": "",
        "Seasons": "summer",
        "Stars": 3,
        "Time": "4 hrs",
        "Total Distance": "8 km",
        "Town": "Jasper, AB",
        "Type": "out-and-back"
    },
    "title": "Charlton and Unwin glacier approach",
    "trail_id": "13396"
}