{
    "description": "Completed on Sep 13, 2020 in dry conditions\n// Edwards Rating: II (III) M M\n// 5.5 to 8.5 hours\n// Elevation of 1143 m NET, 1237 m TOT & max 3002 m\n// Gear: Poles. Helmet recommended. If others are going down the gully, rockfalls can be dangerous here. Same for some of the rock or cliff bands.\n*****\nAfter completing Mount Andromache last weekend and seeing Noseeum Lake we couldn’t wait to get back there. Unfortunately, US wildfires smoke made the ascent more challenging and we had no views but just for the lake it was worth it. Steep terrain, several routes available and cliff bands… This is definitely a moderate scramble and we enjoyed it. \n// From the parking, we walked back down to the creek and crossed it to take the trail along the right side all the way up to the waterfalls. We followed the first cliff band to the left and crossed a waterfall to go up in the forest. It is steep and involves a bit of bushwhacking. We slowly went up to the left until we got over the treeline. There we saw several cairns to the left and started going up slowly, staying in line with the steep gully we would use to reach the summit ridge. When we got a direct view on the gully, we went straight up and then turned right on the ridge. We passed two high points before the last stretch to the real summit. \n// On the way down, we returned the same way until we got out of the gully. Then we kept going straight down to the lake. Lots of interesting rock bands and slabs with some cliffs to circumvent. We ended up in what looks like a dried-up creek bed leading to the lake. This place is absolutely beautiful! We saw some interesting bugs swimming in the lake. After doing some research, it seems like they were Bert’s Predaceous Diving Beetles, which we never seen before. We should have gone up the first slope to reach back our ascent route after our break but we continued toward Molar Glacier and found a weakness down the first cliff band. Then we turned right and went along the second cliff band until we saw a trail down below. We followed it to the first waterfall and finally down between the two waterfalls. It was steep and a bit slippery, not as easy as our bushwhack up. Down to the last cliff, we cut to our right and crossed the waterfall again to come back down in the forest. There was a couple of down climbs people seem to use in the cliff band but we were not comfortable with the steepness, loose rocks and lack of holds. Might be easier to climb up but we missed them in the morning. We then reached back the main trail by the creek. Some people go up the SE ridge but I read some trip reports mentioning that it was more difficult technically and we wanted to keep this a moderate scramble at most.",
    "directions": "From Lake Louise, continue onto Trans-Canada Hwy for about 2.3 km and take the Alberta 93 exit toward Jasper. Continue for approx. 22 km and park at the roadside pullout on your right at Noseeum Creek (GR470192). You’ll see the 1 km sign for Mosquito Creek Campground.",
    "geohash": "c3jm",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/13408/noseeumpeakicefieldsparkwaybanffsummitospreypackmarrysep132020.JPG",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13408/noseeumpeakicefieldsparkwaybanffmereadyforglacialfootbathsep132020.JPG",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13408/noseeumpeakicefieldsparkwaybanfffunscramblingtothelakesep132020.JPG",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13408/noseeumpeakicefieldsparkwaybanffcloseupviewnoseeumlakesep132020.JPG",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13408/noseeumpeakicefieldsparkwaybanfflongwaterfalliiisep132020.JPG",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13408/noseeumpeakicefieldsparkwaybanffnoseeumlakestunningfromcreekbedsep132020.JPG",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13408/noseeumpeakicefieldsparkwaybanffobviousrouteuptoridgesep132020.JPG",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13408/noseeumpeakicefieldsparkwaybanffoutofforestsep132020.JPG",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13408/noseeumpeakicefieldsparkwaybanffrouteswaterfallssep132020.JPG",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13408/noseeumpeakicefieldsparkwaybanfftonsofbertspredaceousdivingbeetles...ithinksep132020.JPG",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13408/noseeumpeakicefieldsparkwaybanffwelcomeviewfromandromacheridgesep132020.JPG"
    ],
    "source_url": "https://trailpeak.com/trails/noseeum-peak-near-lake-louise-13408",
    "stats": {
        "Activities": "hike scramble",
        "Elevation Gain": "1243 m",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 4,
        "Time": "7 hrs",
        "Total Distance": "14 km",
        "Town": "Lake Louise, AB",
        "Type": "out-and-back"
    },
    "title": "Noseeum Peak",
    "trail_id": "13408"
}