{
    "description": "Completed on Sep 27, 2020 mostly in dry conditions (some fresh snow) // *** Annual road closure (AB-546) between December 1 & May 14 // Edwards Rating: II (III) M M // 6 to 9 hours // Elevation of 1012 m NET, 1289 m TOT & max 2625 m // Gear: Poles. GPS and/or compass, bike if you want to save some energy and an hour or so.\n***** This is a moderate to difficult scramble going up the north ridge as it involves route finding, hands-on scrambling and exposure. DO NOT take the drainage on the way down, RETURN THE SAME WAY. It was suggested in Nugara’s book and another trip report but the 2013 flooding made this route a true nightmare. The scrambling is awesome, but there was some scary sections. Staying on the ridge line all the way makes it for a difficult scramble for sure. // From the parking lot, we should have walked back up the loop and take the fire road, but we decided to go along the river to explore other avenues. This is actually where Nugara’s northeast ascent is but we continued along the river, hiked back up a steep slope and reached the fire road. We hiked all the way to the bridge at about 3.8 km.\nGibraltar Mountain looks phenomenal from here! We did take a secondary trail at some point but it reached back the fire road minutes later. Right after the bridge, we looked to our left and followed a faint trail going up in the forest. There was tons of trail here but we kept going mostly up and slightly to the left. We started seeing some pink flags and went up to the southeast until we got to a rubble slope. We turned right and scrambled up to get to the north ridge. This looked scary but we decided to go straight ahead and give it a shot. The first section had a bit of fresh snow and a slip there could have been fatal with the exposure on our left. But footing was good and we climbed up to the next plateau. We continued on the ridge for a few minutes but it became too exposed so we went down to the right on easier terrain. We stayed about 10-20 metres lower for a few minutes and climbed back up a rock band to the ridge. We stayed closer to the ridge from that point on and angled left to get to false summit #1.\nWe continued to the east and terrain was actually easier on the ridge line to get to false summit #2. From there, we could see the summit that we reached quickly by staying on the ridge line. // On the way down, we took that drainage you can clearly see from false summit #2 but it was horrible and took us forever to get back to the bridge. A better option is to return the same way but from false summit #1 go down some more on the left to follow easier trails, sidesloping all the way back to the forest. We saw a few cairns and flags but most of the time route finding is required. We really enjoyed this scramble and may go back to try the NE ridge another time.",
    "directions": "From Calgary, follow Trans-Canada Highway/AB-1 W, take exit 161A for AB-22 S toward Bragg Creek/Redwood Meadows and go south for about 22 km. Turn left on AB-22 S and continue for 19.5 km. Turn right on AB-22 S for 27.4 km to Turner Valley. Turn right at the intersection onto Sunset Dr. NW/AB-546 W and continue on that road till the end (approx. 38 km) to park at Sheep River lower parking lot.",
    "geohash": "c2yr",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/13413/ShungalasheKananaskisFalseSummitMarryandOspreyPackSep272020.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13413/ShungalasheKananaskisMeScramblingSteepSectionSep272020.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13413/ShungalasheKananaskisMarryScramblingupSteepandFunRockBandsSep272020.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13413/ShungalasheKananaskisMarryScramblingupBouldersSep272020.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13413/ShungalasheKananaskisMarryonExposedRidgeSep272020.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13413/ShungalasheKananaskisGibraltarandBridgeSep272020.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13413/ShungalasheKananaskisGibraltarandRaefromRidgeSep272020.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13413/ShungalasheKananaskisImpressiveCavesSep272020.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13413/ShungalasheKananaskisMarryandEasyBushwackingSep272020.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13413/ShungalasheKananaskisMarryinFirstExposedScramblingSep272020.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13413/ShungalasheKananaskisNastyDrainageSep272020.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13413/ShungalasheKananaskisRouteAlongRidgeSep272020.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13413/ShungalasheKananaskisStrangeWaterColourinDrainageSep272020.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13413/ShungalasheKananaskisSummitViewGibraltarRaeBurnsBluerockSep272020.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13413/ShungalasheKananaskisTurningBackandDownRightSep272020.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13413/ShungalasheKananaskisWelcomeSep272020.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/shunga-la-she-near-turner-valley-13413",
    "stats": {
        "Activities": "scramble",
        "Elevation Gain": "1289 m",
        "From": "",
        "Seasons": "summer spring fall",
        "Stars": 4,
        "Time": "7 hrs",
        "Total Distance": "16 km",
        "Town": "Turner Valley, AB",
        "Type": "out-and-back"
    },
    "title": "Shunga-la-she",
    "trail_id": "13413"
}