{
    "description": "It seems that Cape Breton is bursting at the seam with waterfalls.  This is a hike to get to an unknown series of waterfalls on Cape Dauphin Mountain near the hike to the Fairy Hole.  I chanced upon these waterfalls because I was looking at different imagery dates and one of them showed a whopper of a fall high up on the mountain.   \n\nThe walk start surprisingly on an old road and not by bushwacking!   After walking 1.4km or so, it is time to leave the old woods road and start bushwacking.  At first it is through a mature conifer forest with a deep moss carpet.  A small downhill comes next, crossing the stream that gives rise to the falls further upstream.  You can follow the stream or aim your gps through the woods and after perhaps 400m after leaving the road, you should be at the foot of the mountain.\n\nImmediately a scree slope appears on the right and a nice two tier fall is accessible.  Above the two tier fall is a narrow canyon and downclimbing into it is very hard,  in there are a few falls varying from 10-20ft.  Above the canyon is another fall of 15 ft but the piece of resistance comes last where a 50ft fall tumbles from the top of the mountain! Instead of following the river down, I used the scree slopes on the left of the brook (looking upstream) and the nice open forest beside it to get back to the old woods road.",
    "directions": "New Campbleton Road until the second entrance to Mine Road.  Have a look at the gpx track.  It is passed the summer camp.",
    "geohash": "f8jp2",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/13416/1202289082117963669586842526450774898063681o.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13416/Capture.JPG",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13416/new.JPG"
    ],
    "source_url": "https://trailpeak.com/trails/cape-dauphin-mountain-falls-near-baddeck-13416",
    "stats": {
        "Activities": "hike scramble",
        "Elevation Gain": "330 m",
        "From": "",
        "Seasons": "summer winter spring fall",
        "Stars": 5,
        "Time": "2 hrs",
        "Total Distance": "5 km",
        "Town": "Baddeck, NS",
        "Type": "out-and-back"
    },
    "title": "Cape Dauphin Mountain Falls",
    "trail_id": "13416"
}