{
    "description": "I can only count an handful of explorations where I use the word epic and this is definitely one of them.  I often spend my idle time looking at satellite imagery coupled with 1:10 000 topo maps to seek out new features to explore in Nova Scotia.  This particular spot on the Cheticamp River has been haunting me for the last two years.  Because of its somewhat remoteness and the fact that I live about 4.5 hrs away, it took that long for me to finally quench my exploration thirst.\n\nOver 99% of my exploration are done solo but I decided to add a safety fact on this one and invited a few waterfall addicts to tag along (Kevin and Paula Camus and Marcel Forgeron).  The imagery seemed to indicate perhaps the newest tallest fall in NS or at least the one with the most volume of water.  the imagery also revealed what looked to be massive cliffs close to the fall so a route may from those was chosen. I could see on the topo, a small brook descending in an area 100m downstream of the massive fall and decided that was the way to go.  A few hundred metres from the road bushwhacking in a somewhat open forest led to the brook.  Such a pleasure to follow it down as a countless number of moose have created one of the better trail I have yet encountered in the wild.  \n\nReaching the river is therefore quite easy.  Once there a large rocky hill appears on the north side.  Below it is the start of an impenetrable gorge.  A few small falls can be circumnavigated until you reach the more upstream true drop fall of about 20ft that is fully surrounded by  rocky cliffs.    A decision was made to go up the uber steep slope above the rocky cliffs until we could find a way down to the main fall.  Once you reach the top, you get a view of the fall that set my off on a 450km journey from home.  A careful descent was made using the numerous small trees as leverage.   The thing is once at the bottom we could see a fairly better route up.  Just before the cliffs start, there is a good valley to go up or down with a high canopy and thigh high ferns all the way.\n\nThe fall is just magnificent but it is not the tallest in NS.  The imagery led me astray as this is actually a huge slider type fall.  Volume wise it probably is the topmost or at least top 3 in the province as the Cheticamp River carries an enormous amount of water.  Luckily, I had my little drone to get some high vantage shots as there is another true drop of 20-40 ft upstream of the slider but is hidden by the rock walls.  The rock wall on the south side of the river are just absolutely huge.  A portion of them were weeping water and this makes me believe that ice climbing there would be just incredible.  Rock climbing a bit harder as the rock cliffs plunges right into the deep pool at the base of the fall.\n\nThe way back to the vehicle was using the valley mentioned above.  Once the climbing was all done it was easy enough to use navigate the open spaces to reach the vehicles.  Stats for the hike 4.5 km return, 30m ascent (960ft), max slope 49.5%.",
    "directions": "Hunters Mountain in Cape Breton.  Take the Highlands Road, until you turn left on Park Spur Road.  Drive and park at these coordinates;   N46° 36' 42.7\" W60° 46' 42.9\".   Falls are at;  N46° 37' 24.6\" W60° 46' 21.6\"",
    "geohash": "f8kc",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/13412/DSC0475.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13412/DSC0477.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13412/DSC0482.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13412/DSC0488.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13412/DSC0493.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13412/DSC0495.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13412/ScreenShot20200927at7.54.47PM.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13412/DJI00204.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/cheticamp-river-gorge-falls-near-cheticamp-13412",
    "stats": {
        "Activities": "hike scramble",
        "Elevation Gain": "300 m",
        "From": "",
        "Seasons": "summer winter spring fall",
        "Stars": 5,
        "Time": "3 hrs",
        "Total Distance": "5 km",
        "Town": "Cheticamp, NS",
        "Type": "out-and-back"
    },
    "title": "Cheticamp River Gorge Falls",
    "trail_id": "13412"
}