{
    "description": "The Cape Breton Highlands never cease to amaze me.  Looking again at the satellite imagery, I could see a sharp drop off on Leblanc Brook.  Leblanc Brook is a major tributary of the lower part of the Cheticamp River.  The trailhead is a s far as you can get into the Highlands road system.  This is a very remote area of the province.  Planning and preparation are key to a successful outing.  The terrain is unforgiving and you should have good navigation and scrambling skills to attempt this one.  I invited a few waterfall explorers on this one; Kevin and Paula Camus and Marcel Forgeron.\n\nIt starts easy enough though with a gentle walk in a somewhat open forest.  After 300m or os, you reach the lip of the ravine created by the brook.  Descend into it.  If you follow the brook on the left hand side, there is a super small area where it is possible to reach the top of the fall.  Which I did but since the fall is a true drop, you cannot really see it from that vantage point.  \n\nFrom the top of the fall then it is a miserable upclimb along a sheer drop to try to circumvent the cliffs near the falls.  You can see my gpx route and choose the one further from the brook to avoid all this unpleasantness.  Upon reaching the top of a small open valley, it was as simple as downclimbing it.  Of course there are lots of ghost holes and slippery moss all over in a steep slope so be careful.  The fall is absolutely gorgeous and my friend Kevin flew his drone to calculate a height of 36m! \nStats for the hike; 5km, 330m ascent and 330m descent (that’s 2200 ft in vertical feet).",
    "directions": "Hunters Mountain.  Take the Highlands Road until you turn left on Park spur road.  Drive all the way to this waypoint and park;  N46° 37' 26.5\" W60° 49' 46.0\" .  The waterfall is at  N46° 37' 55.0\" W60° 50' 30.7\".",
    "geohash": "f8k9",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/13415/1203498192116806803035867730406046166606082o.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/leblanc-brook-fall-near-cheticamp-13415",
    "stats": {
        "Activities": "hike scramble",
        "Elevation Gain": "330 m",
        "From": "",
        "Seasons": "summer winter spring fall",
        "Stars": 5,
        "Time": "3 hrs",
        "Total Distance": "5 km",
        "Town": "Cheticamp, NS",
        "Type": "out-and-back"
    },
    "title": "Leblanc Brook Fall",
    "trail_id": "13415"
}