{
    "description": "Second Fork Brook Fall is a somewhat known fall located on a tributary of the Margaree River. The usual route to it is a multi hours trip where you need to ford the Margaree river in order to reach Second Fork Brook. I decided to check out a more express route via Cape Clear. Cape Clear is Nova Scotia's Shangri-La of climbing routes too! Setting off close to the end of the road at Cape clear, I crossed a recently logged forest and made it to the edge of the ravine. It is super important that you find the small stream (look at my gps track) to follow as this small brook will give you a very steep access but still manageable to the brook way below. This brook has some nice cascade type fall along the way.  Any other small brook in this area may just lead to a very cliffy area instead. this main one has carved a nice thoroughfare in a rock wall which enables you to scramble down. It only took 20 minutes for me from my truck to the base of the fall but that was with a wicked elevation change of over 260 m (850 ft) and remember you have to use the same route to come back up so keep some energy! The forest once you follow the small brook down the hill is absolutely gorgeous with mature hardwoods everywhere. On the right side you will soon se some very tall rock walls that would prevent any descent that way. Once you reach Second fork Brook, head upstream for perhaps 30m to the gorgeous slide type 90 ft fall. There are more falls upstream but never has big as this one.",
    "directions": "Drive to Cape clear. I parked here N46° 28' 35.6\" W60° 52' 41.9\" and this was as close as you can drive to the small brook you need to follow into the ravine ahead. Fall is at; N46° 29' 05.8\" W60° 52' 39.0\".",
    "geohash": "f8k8q",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/13424/DJI0488.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13424/DJI0472.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13424/20201106083744.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13424/20201106084013.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13424/20201106093203.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13424/DJI0485.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/second-fork-brook-fall-near-northeast-margaree-13424",
    "stats": {
        "Activities": "hike scramble",
        "Elevation Gain": "260 m",
        "From": "",
        "Seasons": "summer spring fall",
        "Stars": 5,
        "Time": "2 hrs",
        "Total Distance": "3 km",
        "Town": "Northeast Margaree, NS",
        "Type": "out-and-back"
    },
    "title": "Second Fork Brook Fall",
    "trail_id": "13424"
}