{
    "description": "I was in the area of Fielding Road, overnighting at the awesome new chalets called Vally View and add about 2 hours before sunset. I decided to hike up Bens Brook next door. It has carved a deep valley but unfortunately no real fall. I popped out of the valley at the top of the mountain and onto Fielding Road. Luckily I had loaded my GPS with some waypoints on Nile brook running right next to the road. I had enough daylight and here is what I found...\nI used an ATV track which went towards Nile Brook. After a few minutes, the ATV trail went right and I went left and descended a fairly steep slope all the way to Nile Brook...about 200m in total descent. Upon reaching Nile Brook, there were a few cascade types of falls of about 6-10 ft in height....walking downstream, another 300m I soon reached a small gorge like feature with a main two tier fall of about 20ft or so. If you look at sat imagery the fall cannot be seen but a long slide in the mountain next door can be readily seen. To get back to fielding road, I just climbed the hill next to the fall and followed a contour line back to the ATV trail. If you hurry like me because the sun is setting, it will take about 50 min in total.  BTW I call it lower Nile Brook has I have already explored some fall in the upper part of the Brook",
    "directions": "In NE Margaree, turn on Fielding Rd. Drive uphill. Once past the Valley View Chalets, drive another few minutes to the ATV trail on the right at; N46° 21' 26.1\" W60° 56' 19.5\"",
    "geohash": "f8hxt",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/13425/20201105191706.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/lower-nile-brook-fall-near-northeast-margaree-13425",
    "stats": {
        "Activities": "hike scramble",
        "Elevation Gain": "200 m",
        "From": "",
        "Seasons": "summer spring fall",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "3 km",
        "Town": "NorthEast Margaree, NS",
        "Type": "out-and-back"
    },
    "title": "Lower Nile Brook Fall",
    "trail_id": "13425"
}