{
    "description": "The West River is a tide controlled waterway that runs for about twelve kilometers before it empties along with two other river systems into the Northumberland Strait. It is one of the more popular routes for kayakers and canoeists, who visit for an afternoon's paddle, or an over night excursion.\r\n\r\nThe two most popular let ins are in Dunedin, and in the village of Bonshaw. Both locations offer easy water access given a high tide. For the more adventuresome, in the Spring, one could run the spring snow melt much further upstream at Riverdale or even higher. My GPS route was taken from Riverdale in September, and it was a bumpy ride with low water in places.\r\n\r\nThe waterway is really nice because it meanders through a deeply cut set of banks with forest and farmer's fields on either side. The Spring offers high water, while the summer offers warm weather and swimming. Fall of course, offers rich leaf color. If you were to camp along the way, it would be wise to bring along your own water due to the brackish nature of the tidal zone.\r\n\r\nSome features along the way include the Bonshaw trail system, Saint Catherine's Canoe and Kayak rentals, Bonshaw Provincial \"picnic\" Park and Strathgartney Provincial Park and campground.  Strathgartney, if you search Trailpeak, has a couple of really nice trails.\r\n\r\n-S Burt\r\nEast coast Editor",
    "directions": "20 minutes from Charlottetown on the Route 1 TCH to Bonshaw. Look for the church by the bridge, opposite side of the river from St. Catherine's Road.",
    "geohash": "f84",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/PE/1342/reg_WestRiver2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/1342/reg_WestRiver3.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/1342/reg_best1_WestRiver1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/1342/topo_WESTRIVER.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/west-river-near-charlottetown-pe-1342",
    "stats": {
        "Activities": "river-kayak river-canoe",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "9 km",
        "Town": "Charlottetown, PE",
        "Type": "out-and-back"
    },
    "title": "West River",
    "trail_id": "1342"
}