{
    "description": "Here is a description of a few climbing crags near Musquodoboit Hbr. I had my eyes on what looked like cliffs on sat imagery. I finally got the chance to go for them. The first part is boring. It's an old road, turned into an atv track. I used my mtn bike to shave off time. To the end of the road is about 4km. then the fun begins. You need to cross the Salmon River. A times of low water it might be easy but not the day I was there. the water was high and I used a trail along the river to find a suitable spot for crossing. There are a few old boats wrapped around rocks . You will eventually reach a series of falls downstream from Salmon River lake. The river here braids into three sections. I was able to cross by using rocks and logs downstream of the falls. Now comes the not so fun part where you bushwack into an eastern shore forest. I'm sure you have all done it before and it's just a nightmare of small shrubs and ghost holes everywhere. Most of the time you can see one of the crags in the distance which makes it palatable. My route goes for crags 1 (N44° 48' 26.8\" W63° 05' 00.6\") and 2 in a straight line but that may be a mistake as the terrain goes up and down quite a bit. On the flip side, there are huge boulders to check on the way! You finally reach the base of the crag and make your way up. This is the smallest area. Further north, staying o nthe same ridge you will reach the larger crag (#2) (N44° 48' 30.4\" W63° 05' 04.0\") in about 100m of bushwacking. this is the best one. It has lots of elevation and a huge stemming crack, some overhangs. There are a few huge boulders at the bottom too! From here, you will spot a small bog. A the top end of the bog is climbing crag 3 (N44° 48' 31.3\" W63° 05' 19.6\"). Not as high but still nice and long. My gps track to leave the area uses the bog and is just an easier route altogether.",
    "directions": "Musquodoboit Harbour. continue east towrds Ship Harbour. Right after the bowling lanes, turn on the dirt road going uphill (same side of the road as the bowling) and into the Long Lake wilderness area. Park once you feel your car cannot go more and start walking or mtn biking",
    "geohash": "dxgnu",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/13436/DJI0663.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13436/ScreenShot20201206at11.20.04AM.png",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13436/DJI0643.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13436/DJI0647.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13436/DJI0669.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13436/DJI0678.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13436/DJI0680.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/salmon-river-crags-near-musquodoboit-harbour-13436",
    "stats": {
        "Activities": "hike scramble climb",
        "Elevation Gain": "450 m",
        "From": "",
        "Seasons": "summer spring fall",
        "Stars": 5,
        "Time": "4 hrs",
        "Total Distance": "12 km",
        "Town": "Musquodoboit Harbour, NS",
        "Type": "out-and-back"
    },
    "title": "Salmon River Crags",
    "trail_id": "13436"
}