{
    "description": "This is a description of a hike and bushwack to a few spots I could see on satellite imagery.  The first part is easy as it follows the Admiral Lake Loop from the railway trail, passed the rolling rock and the trail (for me) ends at the Talus cave.  The area in front of rolling rock is well known for climbing and the talus cave (N44° 48.394' W63° 08.606') is not really a cave but a cool little cliffs with some big pieces that fell over creating some small passages.\n\nFrom the talus cave, the bushwack journey begins.  On the way from there are countless number of small walls for climbing with some being actively developed while others are still hidden away.  I was lucky enough to stumble on an incredible sight just a few minutes after the talus cave.  Here the cliff face has a huge block that separated and landed in such a way to create a perfectly triangular space beneath it..ie Ben's Cave!  It must be at least 20ft long and the floor is perfectly flat.  There is a small crevasse ringing the outer perimeter that adds to the sight!  The cave is at; N44° 48.292' W63° 08.629'.  this is only about 200m from the well worn Admiral Trail!\n\nIf you follow my gps track, you will see some more walls, some weeping some not and I stumbled upon a climbing  area at; N44° 48.480' W63° 09.000'.  Then another cool little feature close to a trail at; N44° 48.525' W63° 09.183'",
    "directions": "This is the Musquodoboit Harbour trails.  Start at the parking lot and suffer the first few hundred metres of boring rail to trails before finally accessing the real trails!",
    "geohash": "dxgn",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/13432/20201127121956.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13432/20201127113356.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13432/20201127113709.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13432/20201127115605.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13432/20201127121835.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13432/20201127122321.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13432/20201127123753.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13432/20201127132504.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13432/20201127131301.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/bens-granite-cave-near-musquodoboit-harbour-13432",
    "stats": {
        "Activities": "hike",
        "Elevation Gain": "270 m",
        "From": "",
        "Seasons": "summer winter spring fall",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "8 km",
        "Town": "Musquodoboit Harbour, NS",
        "Type": "out-and-back"
    },
    "title": "Ben's Granite Cave",
    "trail_id": "13432"
}