{
    "description": "This particular fall location has been in my dreams and in my GPS for many many years.  Due to its location far from my home and the lack of opportunity to get there, I let years passed before finally attempting it.  The hike is a 10km return with a whopping 600m elevation gain AND loss.  The bushwacking is actually very very easy, I would rate it as a 0 or 1 on a scale of 5.   Difficulty wise it's not too bad.  I was there in times of very high water (50mm plus the day before). Therefore I could not cross the river to get too an easier side to walk and had to climb up the bank q few times to circumvent some rocky parts.  However most of the hiking is done in a gorgeous hardwood stand where you can see far ahead and the under brush is minimal if any at all.\n\nThe hike starts either at the bridge over the river on the Cabot Trail or just a few hundred metres to the north where a restaurant was in operation for a few years.  It is now closed down (2020) and a trail leading to the French River valley is located on the side of this building.  either way that you take will lead you towards the valley, passed the power line corridor.  Once you reach the valley where the walls are on either sides of you the gorgeous hard wood stands begin!\n\nThere are numerous small tributaries to explore with countless cascade types of falls.  there are scree slopes close to the river and sometimes, the water will gush out from under rocks.  The water seeps under the scree slopes and pops out in the middle of nowhere.  Some of the tributaries also just disappear and reappear within a few hundred feet.  Continue along the river until you reach the beginning of the small gorge like feature.  In times of low water you can continue in the gorge and without getting too wet reach the foot of the 90 ft fall.  However in times of high water, this will be impossible but you can reach a super nice vantage point f you are not too afraid of heights.  \n\nI have added a sat imagery with lots of words in the pictures to help you reach the fall or the vantage point if the water is too high.  From the entrance to the gorge, you can follow the ridge line as it goes uphill on the right of the brook giving you better and better vantage to the fall.  The best vantage point (N46° 29' 37.0\" W60° 29' 30.3\"). is beside an evergreen which is located on a small rocky but moss covered ledge just in front of the fall.  The ridge line is almost like a knife's edge in some point as a small brook is carving the valley beside French River.  \n\nAfter viewing the main fall make a line for another great 45ft fall located just next door at;  N46° 29' 44.6\" W60° 29' 21.4\".  You can see my gps track that close to the parking I went towards a few more cascade type falls on the side of the mountain and then made my way to some karst topography near the ponds.  Karst is an area of gypsum actively eroded by water where you can find some caves.  There were some really dangerous tube caves in there so be careful if you venture in there.",
    "directions": "Cabot Trail from Indian River towards Wreck Cove.  You will cross a bridge over French River.  Start here or at the old woods road by the restaurant at;  N46° 29' 24.7\" W60° 26' 41.4\".  Of course if the property is in use, you will have to knock on the door to ask permission to use the woods road.",
    "geohash": "f8",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/13438/french.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13438/ScreenShot20201223at8.30.48AM.png",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13438/ScreenShot20201223at8.28.16AM.png",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13438/frenchriver.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13438/ScreenShot20201223at8.25.54AM.png",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13438/french1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13438/frtribfall.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13438/DSC1179.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13438/DSC1179copy.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/french-river-falls-near-wreck-cove-13438",
    "stats": {
        "Activities": "hike scramble",
        "Elevation Gain": "610 m",
        "From": "",
        "Seasons": "summer winter spring fall",
        "Stars": 5,
        "Time": "3 hrs",
        "Total Distance": "10 km",
        "Town": "Wreck Cove, NS",
        "Type": "out-and-back"
    },
    "title": "French River Falls",
    "trail_id": "13438"
}