{
    "description": "These falls were a complete surprise.  I was in the area to explore some climbing crags (another post) and stumbled upon these beauties.  The first part of the journey is boring as it is an old road, turned into an aTV path.  Take your mtn bike to make that journey faster.  There are a surprising number of hills on that road and the descents will be fast!\n\nAt the crest of the last hill, you will hear the roar of the river in front of you.  Go to the end of the road where an old camper is gutted.  Here there is a small man made trail along both sides of the river.  Upstream near the lake is a nice 8ft but downstream is the main event with a series of drops totalling about 25 ft.  There is a large boulder in the middle of all the falls with a bunch of ferns on it.  There are also a few capsized boats above and below these falls!  I was able to cross the river by going just a bit downstream of the falls and crossing via rocks and logs.  At time of low water, I'm sure it would be easier to cross!",
    "directions": "Musquodoboit Harbour.  continue east towrds Ship Harbour.  Right after the bowling lanes, turn on the dirt road going uphill (same side of the road as the bowling) and into the Long Lake wilderness area.  Park once you feel your car cannot go more and start walking or mtn biking",
    "geohash": "dxgnu",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/13435/20201204085046.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13435/20201204090133.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13435/20201204090627.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13435/20201204090850.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13435/20201204114106.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13435/20201204114301.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/salmon-river-falls-near-musquodoboit-harbour-13435",
    "stats": {
        "Activities": "hike",
        "Elevation Gain": "200 m",
        "From": "",
        "Seasons": "summer winter spring fall",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "8 km",
        "Town": "Musquodoboit Harbour, NS",
        "Type": "out-and-back"
    },
    "title": "Salmon River Falls",
    "trail_id": "13435"
}