{
    "description": "Note: this is the first leg of the East Coast Trail . The trail begins at Fort Amherst on the South side of St. John's Harbour, about an hour's walk from downtown. A World War II gun battery reminds hikers of the Nazi threat from long ago. A historic lighthouse as well as a teahouse can also be examined before heading onto the trail, which ascends steeply to roughly the same elevation as Signal Hill on the opposite side of the 'Narrows'   a term referring  to  the  last  narrow  section  of  the  Harbour  before  the  open  sea.  From  this  vantage point there  is a beautiful view of the city. The lighthouse at Cape Spear is visible in the distance and the day's task of hiking looks daunting. \nAlso note the GPS data attached is a route, not a track log, so the actual trail will be somewhat different.  We do expect a actual tracklog in the near future.\nTwo small ponds are soon in view and make fine swimming holes on a hot day. One of the ponds is actually an artificial reservoir formed   by  a  wooden dam, built for a coal power generation facility (now defunct) located near the trail head at the bottom of the hill. After passing the ponds, there are a couple of interesting patches of lichens on the rocky terrain. \nAfter hiking for another hour, I met up with a group of Americans that are slightly lost. It's clearly the dad's fault  but his son explains to me that for the sake of harmony they were willing to follow him down (what turned out to be) the wrong path. At about lunchtime we arrive at a barachois that extends across Freshwater Bay. ('Barachois' is a word I'm not familiar with, but definitely sounds like an appropriation from french). The barachois consists of a long pile of rocks that extend across the bay and serve as a breakwater to protect boats that at one time must have been stationed there. Other than the breakwater, there is little trace of the community that once existed at Freshwater Bay. At this point I separate from my American hiking companions after an amicable dispute about which path to follow. They wish to follow a well marked path that extends into the forest away from the coast. Unfortunately, no one remembered to bring an ECTA map, so we part company. \nRunning out of drinking water, I am ecstatic to discover the town of Blackhead, which is only an hour's walk from Cape Spear. After consuming a soft drink at a souvenir shop, an elderly gentleman sunbathing in front of his house points out a freshwater spring that is purported to be a clean source of drinking water. Here in Blackhead I meet a young Quebec couple that, like me, lives in Montreal. Although they speak little English they decided to take a vacation in Newfoundland, camping and exploring the coast. They hitchhiked all the way from Montreal, and took a ferry from the mainland to Argentia. My American friends also catch up to us at this point. All roads lead to Rome, as the saying goes! The others were sensible enough to bring along filters for their drinking water, an excellent idea since giardia can be a risk. \nShortly after Blackhead we stumble onto a patch of blueberries that are full of mid August fruit. After eating our fill we continue up a steep hill and view two large piles of rocks that resemble house foundations. During World War II there was a decoy built at this site   a dummy fort, constructed to confuse any German planes that might make their way across the ocean. The sites were once equipped with fake guns and skeleton buildings.\nArriving at Cape Spear, a rest is needed before exploring the lighthouses after the long day's hike. Cape Spear, a national historic site with two very interesting lighthouses, is located at the Easternmost point of North America, and is a perfect spot for admiring waves as they crash against the rocky shore. The first lighthouse is a fully functional, modern facility, while the second is a historic monument dating back to 1836 that one can tour for a small fee. A World War II battery on the perimeter of the grounds can also be explored, with a huge cannon that lies in decay.",
    "directions": "The trail head starts at Fort Amherst, across the harbour from downtown. I walked from downtown, but you can park a few minutes away from Fort Amherst near a small boat dock.For more on the East Coast Trail, see the East Coast Trail Association website.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NL/1343/long_narrows.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/1343/reg_FortAmherst.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/1343/reg_capespear.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/1343/topo_trail.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/fort-amherst-to-cape-spear-part-of-the-east-coast-trail-near-st-johns-nf-1343",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 4,
        "Time": "8 hrs",
        "Total Distance": "14 km",
        "Town": "St. Johns, NF",
        "Type": "out-and-back"
    },
    "title": "Fort Amherst to Cape Spear (part of the East Coast Trail)",
    "trail_id": "1343"
}