{
    "description": "Trying to solve a waterfall mystery. South of Halifax on Highway 306 between Harrietsfield and Sambro, you cannot miss the sign for Broadfalls Park. A long time ago, I stopped at the bridge and went upstream but only found a few sets of rapids. \n\nThis time I was determined to find them Broadfalls! The 1:10 000 NS topographic maps actually shows a fall downstream of the neighbourhood (see map attached with the wavy symbol indicating a fall). And now with satellite imagery, I could see way further downstream some white spots below the Two Lakes lake and before Ragged Lake. \n\nI could also spot some ATV tracks which I hoped led to the falls. Of course, they did not but still helped me to lessen the bushwhack of this exploration hike. Total was 7.1km, 200m elevation gain in some terrain that I would qualify as extreme bushwacking! So the mystery is partially solved as I found no falls where the symbol indicated one except for a rapid or two and then an actual fall downstream of the Two Lakes. \n\nBonus was a small bouldering opportunity and some cool looking openings in granite rock at;  44.5132, -63.6580",
    "directions": "Highway 306 (Old Sambro Rd).  Turn on Steven Murphy Rd and park at is conclusion where an ATV path starts (44.520, -63.644).",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/13443/1329445512539066760809862706332257757010788o.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13443/1335717502539068060809738371932826875798337n.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13443/1335596662539062727476934574996251941542969o.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/broadfalls-near-halifax-13443",
    "stats": {
        "Activities": "hike",
        "Elevation Gain": "200 m",
        "From": "",
        "Seasons": "summer winter spring fall",
        "Stars": 3,
        "Time": "3 hrs",
        "Total Distance": "7 km",
        "Town": "Halifax, NS",
        "Type": "out-and-back"
    },
    "title": "Broadfalls",
    "trail_id": "13443"
}