{
    "description": "Avion Ridge is a classic Waterton trail that is usually done as a long day hike but can be turned into a weekend backpack trip, as there are a couple of nice back country campsites enroute. If you choose to do hike Avion Ridge as a day trip, I would recommend doing so in the autumn when you're not sweating away litres and litres. The larch forests on Avion's slopes are simply beauftul in autumn and are reason enough to reccommend this hike in late September or early October. I first did this hike as a backpack trip on a late Sept. weekend in 2003 with my buddy Warren and his dog Oscar.The first night, we hiked the 8 kms to Snowshoe Campground from the Redrock Canyon Parking lot and proceeded to freeze our butts off. This first part of the trail is level and mostly through forest, following an old dirt road to the campsite. The next campground at Twin Lakes is only an hour from the Snowshoe site, and the view there is supposedly quite spectacular, but unfortunately the skies opened up on us with rain and hail, and so we decided to pass on Twin Lakes and ended up hitting our tents at around 7:30 PM. The next morning the precipitation waned, and after packing up our wet clothes and packs we hit the road. From the campground, the trail goes Northward through a forested path marked by a trailhead at the campsite. There is a side-trail to Lost Lake that we bypassed.After 30 minutes or so from the campsite we reached a signed fork that says \"Avion Ridge, 1.6 km\".  Make sure to find this point,  the trail continues on and on and on, following along the continental divide into the Castle area. Following the sign to the right, the trail to Avion Ridge starts to gain elevation a bit more steeply. To our luck, blue skies greeted our morning hike and as we reached the larch forest at the base of the ridge, we began to take notice of the spectacular views unfolding below. From the beginnings of the ridge, you can see Lost Lake and the valley, and other peaks to the South. In the larch forest, the path actually crosses the park boundary and passes into the Castle Mountain area. The larches end about a half hour from the peak of Avion Ridge - a rocky, wind blasted spot marked by a cairn at the top. Although there are great views in every direction, the peak of Avion Ridge would be a crappy place to be on a windy day, and the cliff on the North edge of the Ridge is pretty creepy -  a steep drop-off of about 1500 ft. From the peak, the trail drops to a saddle and the hugs the West side of a mountain. From this vantage point, the cliffs of Avion Ridge looked quite spectacular and we spotted a group of mountain goats feeding far below. Towards the end of this part of the trail, the path becomes quite narrow as it curves around a mountain pass. A couple of rock ptarmagins seemed oblivious of us as we concentrated on not slipping to our deaths on the icy path. We continued on the narrow path until we cleared the cliff-face to a saddle, where a signpost signalled our re-entry to Waterton Park with the path to Goat Lake appearing below. After a short snack break, we decided ditch our packs for a while and to explore the Easternmost peak above Goat Lake (this we found out later to be called Newman Peak). For our efforts we were rewarded with great views of Spionkopf ridge and the mountains in the Castle area to the North. Mountain goats entertained us in the late afternoon, feeding on the cliffs above Goat lake as we set up our tents and relaxed around the campsite. Again we hit our tents early (7:30ish), this time due to fatigue moreso than due to adverse weather.Thick fog greeted us in the morning, but luckily the hike out from Goat Lake is a relatively easy and decidedly downhill affair. It took us about an hour to drop down to the dirt road that leads back to the parking lot.I did Avion Ridge again this past fall 2004 (and again this 2008!) as a day hike with the Chinook Outdoor Club from Lethbridge, AB. One family was resourceful enough to bring along some mountain bikes (which they hid next to the trail beside the Goat Lake signpost) and they looked like geniuses, cycling away, seemingly carefree and weightless as the rest of us trudged along on the flat path for the hour or so that it takes to get back to the parking lot from the Goat Lake trail marker. We came across a young couple that hiked to Goat Lake just to try their hand at some fly fishing. Again, we saw mountain goats below Avion Ridge, and were quite amazed to see those crazy goats scale three quarters up the sheer cliff-face of the North side of the ridge!Note: The Avion Ridge hike described was done as a loop but there are various other options for gaining the ridge. For example, the hike could be done the opposite way, ascending via Goat Lake, although the elevation gain going up the Goat Lake trail is more abrupt than the way described. If one wanted to minimize the amount of hiking required on the cart trail, they could bike to the Goat Lake turnoff and hike up to the ridge via Goat Lake and return the same way. Hint: Bicycles are allowed on the trail as far as the Snowshoe Campground.Current conditions:NTS Map: 082G01Elevation gain: 1,000 m (3,280 ft).",
    "directions": "End of Redrock Canyon Road (hike starts at the footbridge following an old cart road).",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/1344/long_IMGP38796-7960.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1344/reg_IMGP38871-7960.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1344/reg_image004.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1344/reg_image007.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1344/reg_map.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1344/regimage001.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1344/topo_image003_best1_.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/avion-ridge-near-waterton-park-gate-ab-1344",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 4,
        "Time": "8 hrs",
        "Total Distance": "26 km",
        "Town": "Waterton Park Gate, AB",
        "Type": "out-and-back"
    },
    "title": "Avion Ridge",
    "trail_id": "1344"
}