{
    "description": "After exploring for waterfalls for more than a decade, I didn't think the valley had any more secrets for me.  How wrong I was!  Acting on a hunch and looking at topo maps of the area around Joe Brook, I decided to explore that small narrow valley.  The brook at the Bay of Fundy looks like any other and you dont really see any hills close by to let you know about potential falls.  The start is no fun with lots of prickly bushes but after just 200 m or so they disappear.  From then on its a bushwack along the river to 3 magnificent falls and countless other smaller rapids and smaller falls.  \n\nthe first significant fall is at N44 51 30.2 W65 26 13.7 and I thought that was probably the only fall on the brook at first...This one is gorgeous and stands at about 18ft or so.  It takes up the whole width of the brook and looks so close to Neely Brook fall its uncanny!  Nest upstream are more smaller falls and then one with a small cave like structure on its side.  The valley narrows and mini rocky cliffs on the sides appear from time to time.   And then the final and tallest fall appears!  It must be at least 60ft in total height and that's tall for the valley! (N44 51 10.8 W65 26 00.1)  There are two tributaries that meet in the fall and that could lead to a twin fall in times of high water!  The fall looks a bit like Paradise Brook fall near Lawrencetown.",
    "directions": "Shore Rd intersects with Youngs Mountain Rd.  Continue 2 km east of the intersection where Joe Brook flows at N44 51 53.8 W65 26 29.5",
    "geohash": "dxcr",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/13444/DSC1362.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13444/DSC1346.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13444/DSC1373.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13444/DSC1384.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13444/DSC1406.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13444/DSC1410.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13444/DSC1422.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13444/DSC1428.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/joe-brook-fall-near-annapolis-royal-13444",
    "stats": {
        "Activities": "hike",
        "Elevation Gain": "150 m",
        "From": "",
        "Seasons": "summer winter spring fall",
        "Stars": 5,
        "Time": "2 hrs",
        "Total Distance": "5 km",
        "Town": "Annapolis Royal, NS",
        "Type": "out-and-back"
    },
    "title": "Joe Brook Fall",
    "trail_id": "13444"
}