{
    "description": "Nicomen Mountain now has a fully marked route to the summit (and to a couple of viewpoints that are just beyond the summit).  This is the peak directly across the Norrish Creek valley from Dewdney.  At 1221 metres, it is one of the higher peaks in Mission. \nThis is an out and back route with some travel on FSR’s, and some steep hiking through the forest. Though we have marked a route the entire way, don’t think there is a “trail” – you are going to be walking over lots of debris and underbrush in some areas.  EDIT:  I've done a lot of improvements/maintenance since I first finished marking this route in July, 2020.  \nStart at Norrish Creek and hike the standard route up to the top of Raven Bluffs (at the fork with “Little Nicomen” stay right – don’t go up to the cabin/paraglide launch – that’s the wrong way). When you reach the top of Raven Bluffs, continue on a bit and you’ll see orange flagging tape in the forest on your left. There you will also see the sign for Nicomen Peak with approximate one way km and elevation gain on it from that point. Follow that path through the forest until you come out to a very old decommissioned logging road – you’ll find another sign there pointing to the left. Continue following the old FSR until you come to an intersection, where you will find another sign indicating you turn right to Nicomen. Continue on that road for a bit and you will come to a fork – turn right - there is an arrow there and lots of flagging tape. Continue up that old FSR to a creek washout; cross the creek and continue up to the very end of the FSR. There you will a flagged route through the clearcut. From there you just continue up the mountain, following the flagging tape.  At around 900m you will find a nice viewpoint. Continue past it, following the tape, and when you find “The Wizard”, you’ve finished most of the elevation gain. Continue on to the summit (there’s a sign to mark it). There is a tiny view from the actual summit, but you will want to continue on to one or both of the viewpoints – look for the viewpoint sign and follow the flagging tape. When you get to a tree with three orange flagging tape stripes on it, you will see that you can go to the right or to the left. Do both! They are only a couple hundred metres in distance – the viewpoint to the right is pretty limited, but the viewpoint to the left is expansive.\nWhen we started route finding for this, there were plenty of deadfalls on the lower decommissioned FSR, massive alder overgrowth smashing our faces on the upper FSR (you literally could not see in front of you), no discernable path and lots of prickly vines wrapping around our legs through the clearcut. We’ve cleared most of that up to make the route viable. Above the clearcut, the route can be rough – it is very steep, with mossy rocks, sticks, logs, etc. The first part after the clearcut is the worst; it definitely gets better (though stays really steep pretty much the whole way up). Some of the route is close to deep gullies – follow the flagging tape and watch your footing.\nProper hiking footwear and long pants are a necessity. Poles recommended.  Bugs can be pretty bad, especially lower down at the start of the hike.\nI think most fit hikers could do this in 6-8 hours return, but that’s just an estimate. \nIf you do the hike, please share! I’d like to hear how it was.  Thanks to Kasmira Bresett, Jude Bresett, Ken Nickel and James Johnson for their help in creating this new route.\nOne way distances and elevation gain according to GaiaGPS app:\nSuicide Creek to top of Raven Bluffs – 2 km / 335 m\nRaven Bluffs to first FSR intersection – 1.62 km / 10 m\nFirst FSR intersection  to top of clearcut – 3 km / 320 m\nTop of clearcut to summit – 2.81 km / 500 m\nTotal – 9.41 km / 1162 m",
    "directions": "Directions are above.\nPark on Hawkins Pickle Road in Mission, hike up to the top of Raven Bluffs, then follow my well marked route to the summit and the viewpoints just beyond.",
    "geohash": null,
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/13453/14192627933964411471279205468312271139156281n.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/13453/10707763928609911240062617571197182927827680o.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/13453/10753377128609880740065662807119571763350034o.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/13453/10735411828609883306732074793348136974099880o.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/13453/1075211872860988804006493328596597994146324o.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/13453/10764094628609890440064692730567066814464980o.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/13453/10742137028609908873396182664083608996277660o.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/13453/14493956834143750053345348145743974062940202o.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/13453/14232016333964411771279175681229684622813601n.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/13453/14227757633964413504612333676057208454547994n.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/13453/1423128473396441290461239199593202487576729n.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/13453/14251201233964410471279303336239705553487691n.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/nicomen-mountain-near-mission-13453",
    "stats": {
        "Activities": "hike",
        "Elevation Gain": "1162 m",
        "From": "",
        "Seasons": "summer winter spring fall",
        "Stars": 5,
        "Time": "8 hrs",
        "Total Distance": "19 km",
        "Town": "Mission, BC",
        "Type": "out-and-back"
    },
    "title": "Nicomen Mountain",
    "trail_id": "13453"
}