{
    "description": "Another in the series of places I would not explore but was clued in by a waterfall explorer.  thanks to Mike Whalen who has over the years given me a couple of unknown falls to pursue in the Annapolis Valley.  \n\nA few ways to explore here but here is what I did.  From Elliot Rd, follow the really small stream on the side of the road all the way to the Bay of fundy.  At the shore is a fall of about 15 ft or so.  Head west for 200m on the shoreline and you will stand at the foot of the terminal fall on Number Five Brook.  It's a great drop of about 25 ft and then at the top it angles at 45 degrees giving this fall even more height.  follow the brook upstream and don't do like me and turn around too quickly...in the small gorge you will get to is a beautiful waterfall that Mike has explored previously and I have only seen in picture!  This is a good lesson, never turn back too quickly, around the next bend might be the best fall to come!  Looking at past GPS tracks, I also saw that I had been at that terminal fall before when exploring the massive sea caves at Keatings Sand Beach (another trailpeak post; https://trailpeak.com/trails/keating-sand-beach-caves-and-cliffs-near-bridgetown-ns-12302) but it might had been dry at the time has I did not have a picture of it.",
    "directions": "Park on Elliot Rd where it does a 90 degree turn and becomes Shore Rd at; N44° 57' 41.4\" W65° 13' 02.9\"",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/13458/20210226113519.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13458/20210226114317.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/number-five-brook-falls-near-bridgetown-13458",
    "stats": {
        "Activities": "hike",
        "Elevation Gain": "120 m",
        "From": "",
        "Seasons": "summer winter spring fall",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "3 km",
        "Town": "Bridgetown, NS",
        "Type": "out-and-back"
    },
    "title": "Number Five Brook Falls",
    "trail_id": "13458"
}