{
    "description": "This a nice bushwack along an unassuming brook that runs into the heart of Whycocomagh.  I cannot say for certain but I think that this fall is not known except for bushwacking nuts like me!  I started on an ATV trail that led to the power lines.  Then I cut across towards the brook.  I ended up walking in the brook (low water in February) since the snow had a crust that I would go through at every step and catch my snowshoes if I tried wearing those.\n\nAfter 1 km of bushwacking or so I actually made it to a gorgeous fall.  It is set in the back of a small rock rimmed gorge.  It's not super tall at about 20ft with a second drop of about 10 ft just above but the scenery is just gorgeous.  To get a plunging view go on the right (facing upstream).  Since I had no info on this brook, I walked another 1 km or so upstream wishing for more falls but really the one I described above is the best one ...there are a few more upstream but nveer more than 8-10 ft.  \n\nOn the way back, I just followed the brook and also saw a very nice two tier fall of about 15 ft or so located just upstream of the power line corridor.",
    "directions": "In Whycocomagh, turn on Milford Rd and drive almost to the end.  The brook runs on the side of this road.  Pick any spot to meet up with the brook and walk upstream",
    "geohash": "f8ht9",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/13455/DSC1463.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13455/DSC1462.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13455/DSC1458.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13455/ScreenShot20210218at3.02.00PM.png",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13455/ScreenShot20210218at3.03.45PM.png"
    ],
    "source_url": "https://trailpeak.com/trails/whycocomagh-fall-near-whycocomagh-13455",
    "stats": {
        "Activities": "hike",
        "Elevation Gain": "200 m",
        "From": "",
        "Seasons": "summer winter spring fall",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "5 km",
        "Town": "Whycocomagh, NS",
        "Type": "out-and-back"
    },
    "title": "Whycocomagh Fall",
    "trail_id": "13455"
}