{
    "description": "This is stone dust covered (and two bridges) rail trail from Pakenham to the hamlet of Blakeney, where you take a break at the Blakeney rapids park before your return. It's rail trail, so it's flat, and, it's also multi-use which means you could see ATVs (and in winter snowmobiles). Mostly runs through farmland and a bit of forest, it's pleasant. This is only one section, in fact you can take this rail trail from Carleton Place to Smiths Falls, and, connect with other loops such as the K&P. But our adventure had a brewery stop in mind, at the Cartwright Springs Brewery not far from Pakenham. One can find a number of rail trails within easy cycling (or post ride) drive distance to a brewery. but I digress.\nAs you cycle through old Blakeney as the road twists down to the river and bridge, you may wonder about it's past.  Apparently Blakeney supported three different mills and various businesses including flour mills, a sawmill, a grist mill, tannery, brewery, cobbler shop and store. Later, a hotel was built. Three dams were built across the three channels of the river below the bridge. One dam served the sawmill, one the flower mill and one the woollen mill. \nMore to come!  (next up, the K&P near Calabogie).",
    "directions": "Drive to Pakenham and park at the river front at Pakenham beach and look for the bridge and trail from there.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/ON/13461/IMG3796.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/13461/IMG3798.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/13461/IMG3801.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/13461/IMG3804.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/13461/IMG3809.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/ottawa-valley-trail-pakenham-blakeney-near-pakenham-13461",
    "stats": {
        "Activities": "hike mtn-bike",
        "Elevation Gain": "10 m",
        "From": "",
        "Seasons": "summer spring fall",
        "Stars": 3,
        "Time": "3 hrs",
        "Total Distance": "22 km",
        "Town": "Pakenham, ON",
        "Type": "out-and-back"
    },
    "title": "Ottawa Valley Trail Pakenham-Blakeney",
    "trail_id": "13461"
}