{
    "description": "If you followed my adventures for a while on trailpeak, you know that I get a lot of my hints to explore by looking at satellite imagery and topographical maps.  Again this is one of those spots where I decided to check out based on those information.\n\nThe start is on a logging road.  Drive as far as you feel comfortable or just hike it.  I spotted a faint path in the woods heading where I wanted to go (Pine Lake).  I followed it a yep for sure it led to the lake and a couple of canoes locked up to trees.  I then heard some voice coming from the lake and bushwacked to an ATV trail where a couple of fishermen had just arrived via ATV…..so there is an ATV path…it probably is located a bit further down the main road…..that’s for you to find out!\n\nAfter the ATV path, I bushwacked along Pine Lake…word of advice stay away from near the shore as the brush is punishing and about chest high!  Try to spot the larger mature trees in the back and follow those instead.  At the outlet of the lake is a faint path that actually led to more canoes!   After the canoes, the path becomes more like a deer path but still way easier to walk here than by Pine Lake.  On the side of the stream are a few rock walls but nothing worth the effort for climbing so far…that comes later!\nUpon reaching the inlet into McCaffery Long Lake you will find…try to guess….more canoes!  But the best part is to the right facing the lake a series of cliffs that look great for climbing!  Oh and I was forgetting…just before reaching McCaffery Long Lake on the west side of the brook at N44° 52' 42.2\" W63° 09' 15.4\" is a really cool climbing feature.  It starts with a roof of about 55 degrees for 12 feet and then goes vertical to the top out maybe another 15-20ft.  And right in the middle is a crack of about a foot separating the whole thing in two pieces.  \n\nThere is a small feature by the canoes too but the main feature is right next door at N44° 52' 36.9\" W63° 09' 13.3\".   The rock looks super solid and dry as it faces due south.  Bugs were ok but in a few days I have no doubt it will be DEFCON 5.  I returned pretty much the same way.  Bringing a canoe would help to avoid the bushwack at Pine Lake.",
    "directions": "Highway 357.  Turn on Lays Lake Road.  At the T intersection turn right towards Grand Lake.  At Grand Lake take the secondary road going uphill on your right at; N44° 54' 07.6\" W63° 10' 01.3\"",
    "geohash": "dxgp6",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/13469/20210429100019.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13469/18018956120263736108358061956941540250100053n.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13469/DJI0958.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13469/202104290935181.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13469/20210429085323.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13469/20210429093629.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13469/20210429095143.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13469/DJI0955.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mccaffrey-long-lake-cliffs-near-meaghers-grant-13469",
    "stats": {
        "Activities": "hike climb",
        "Elevation Gain": "225 m",
        "From": "",
        "Seasons": "summer spring fall",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "7 km",
        "Town": "Meaghers Grant, NS",
        "Type": "out-and-back"
    },
    "title": "McCaffrey Long Lake Cliffs",
    "trail_id": "13469"
}