{
    "description": "This is a nice little hike to a seldom visited area right close to Halifax.  These days we are under a no travel directive from our counties so I’ve been exploring my own backyard.  This hike is suitable for just about anybody because there are no great elevation change and there is shockingly no bushwacking required! You will end up at what is probably the largest bog within 50 km of downtown Halifax.\n\nTake the same entrance as for the spider Lake mountain biking rails but as soon as you are under the power lines, head east (on your right).  Continue for 1km.  Here the power line corridor does a 90 degree turn and starts to go south.  Continue under the lines for approximately 500m.  There is a wet spot to traverse and then up the hill where you will find a secondary ATV trail on your left going northeast towards the bog.\n\nYou will reach the bog within 400m.  Looking around it feels like you are on top of the Cape Breton Highlands.  There are some open water spots in the middle which give rise to cool color schemes.",
    "directions": "Highway 318 (Waverley Rd) from Dartmouth towards Lake William.  Turn right on Spider Lake Rd and park at the corner of this street and Willow Hill Ridge",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/13473/DJI0020.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13473/trail.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13473/DJI0012.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13473/DJI0026.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/caribou-bog-near-dartmouth-13473",
    "stats": {
        "Activities": "hike mtn-bike",
        "Elevation Gain": "20 m",
        "From": "",
        "Seasons": "summer winter spring fall",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "5 km",
        "Town": "Dartmouth, NS",
        "Type": "out-and-back"
    },
    "title": "Caribou Bog",
    "trail_id": "13473"
}