{
    "description": "NTS Map: 082G01Note: A popular winter destination for skiers from the Chinook Outdoor Club of Lethbridge. \r\n\r\nAt the trailhead, there is a picnic area that contains a woodstove and well-stocked, free supply of firewood. There is normally a posting from Parks Canada describing avalanche conditions, which is of particular interest to telemarkers if proceeding on to Forum Ridge or the Summit Lake area. From the parking area, there is a choice of following a groomed trail that goes behind the picnic area through the forest (parallel to the highway), or following the highway itself. There are typically a few feet of snow on the highway at this point from mid-November onwards. After 45 minutes of level skiing, the paths intersect at the Akamina trail crossing, marked by a signpost and map. The highway itself continues to Cameron Lake, and there are ungroomed cross-country trails worth exploring that go around the North side of the Lake or up to Summit Lake on the South side.\r\n\r\nThe ungroomed Akamina trail breaks away northward from the highway and starts going uphill. It's at this point that you get a good workout (and curse the fact that you have the wrong wax on your skis). I go waxless myself, but the signpost intersection always seems to be a good spot for a last minute wax adjustment, or putting clothes on or taking clothes off. The uphill portion is a good grunt for another 30 minutes or so, but it always seems longer. After this initial slog, the trail levels off and you pass a snow gauge station maintained by the park. \r\n\r\nContinuing along the trail, you eventually cross the Alberta/B.C. border into Akamina Provincial Park and there is a sign-in book at the border crossing. A 15-minute side trip to Forum falls in the winter at times reveals an interesting icicle display. \r\n\r\nA signpost signals the path to Wall Lake, which forks to the left off the Akamina trail. At this point the trail becomes a rolling and fun, cross-country ski. For first-timers, be careful not to bump into any trees (and if taking on this trail early in the winter, take care to avoid any deadfall that is usually buried later in the season). It usually takes 2-2.5 hours total to reach Wall Lake from the parking area, making it a good lunch spot. Note: there is 50 m or so of avalanche chutes that must be crossed before reaching Wall Lake. The chutes terminate at the bottom on the ski-trail, so during the worst part of avalanche season, put on some hiking boots and try something more secure in Waterton (e.g. try hiking to Horseshoe Basin, or the Boundary Bay trail etc. If in doubt or in need of safe alternatives, stop by the warden's office before the Waterton Village on your way in). \r\n\r\nOn the return leg back to the cars, often skiiers will turn Westward to continue down the Akamina path to extend the day, since it is considered bad form to drink beer before 4 PM.\r\n\r\nHint: The Kilmorey Lodge in Waterton is a good spot for après ski (they are less crowded in the wintertime).\r\nCurrent conditions:\r\n\r",
    "directions": "Drive up the Akamina Highway towards Cameron Lake as far as the road will take you (in the winter, the snowplows clear the road about 2.5 kms from the Wall Lake/Akamina trailhead.) Park your car in the small parking lot next to outhouse or on the road.",
    "geohash": "c2wy",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/1347/reg_map.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1347/reg_walllake1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1347/narrow_walllake2-norm.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/wall-lake-near-waterton-park-gate-ab-1347",
    "stats": {
        "Activities": "snowshoe ski-xc",
        "From": "",
        "Seasons": "winter",
        "Stars": 4,
        "Time": "6 hrs",
        "Total Distance": "12 km",
        "Town": "Waterton Park Gate, AB",
        "Type": "out-and-back"
    },
    "title": "Wall Lake",
    "trail_id": "1347"
}