{
    "description": "Presenting My own COVID 19 mtn bike trail.  Yeah like most of you I'm bored during this time and unable to travel to the places UI want to explore.  In my neighborhood between Morris and Russell Lake there have always been mtn bike/ hiking trails.  However, some of the trails now are really full of roots so its hard to make any speed on the bike.  I decided to create one of my own.  It's still evolving and will add to it!\n\nStarting from the cul de sac on Portland Estates Blvd West, I used the main path for a few hundred feet and then started to create my own...this part is newer and I haven't flagged it so it might be hard to find since there are lots of hiking paths everywhere.  However make it to this location and the path becomes more used and defined ( 44°39'29.95\"N,  63°31'1.21\"W),  Here someone had started to create a path for 100m but quit some time ago...I used that path but then extended it for another 750m...basically until you come out onto the service rd.  The path stays high on the hill before dropping the height in one particular spot going over a small scree slope then some zigzags in an open forest.  It meets an old woods road, you follow it for 40m and then turn to the left into the woods...this part needs to be better defined..it's rideable just needs some more work.\n\nFolow the sercie Rd east until a 4 way instersection.  Here turn right (south) and ride a smaller road until you see a fence in the distance.  Get to the fence and take the path on the left of it.  Continue on path for 5 m and then the fence stops but a cut trail continues along the same heading all the way to Morris Lake.  Take this old fence line trail but only for 5m or less.  Here you will see flagging tape on the right and on the left.  To make it more flowy, take the right hand trail.  (you will get on the left trail later)\n\nContinue on this trail for 300m.  here will be a fork, go to the right and bike another 200m.  Return to the fork and go downhill towards the fence cut line.  I have added a picture of the trail system with arrows to help with the visualization.  At the cut line, go uphill 100m.  Here take a trail on the right. (this is the trail I mentioned earlier).  this small section flows well this way with a gradual downhill all the way to the service road.  to get out you can continue towards Diana Grace ave as there is a public path that you can take between house.\n\nI've strived to cut down the least amount of vegetation by using deer tracks.  The trail is close to DND land but there are no signage preventing access to these trails and you will see a lot of other people around using other trails to hike, run or walk their dogs.",
    "directions": "End of Portland Estates Blvd in Dartmouth",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/13476/Capture.JPG"
    ],
    "source_url": "https://trailpeak.com/trails/morris-lake-near-dartmouth-13476",
    "stats": {
        "Activities": "mtn-bike",
        "Elevation Gain": "150 m",
        "From": "",
        "Seasons": "summer winter spring fall",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "4 km",
        "Town": "Dartmouth, NS",
        "Type": "out-and-back"
    },
    "title": "Morris Lake",
    "trail_id": "13476"
}