{
    "description": "A long time ago now, a fellow climber (Leigh Martell) told me about these remote cliffs he could see on satellite imagery in the White Lake Wilderness Area. The cliffs were located just one km from the large feature known as The Promised Land.  I had been previously to the Promised Land and made a post on trailpeak (https://trailpeak.com/trails/promised-land-aka-salmon-river-cliffs-near-halifax-ns-12258).  The hike to it was punishing as expected in the Eastern Shore forest but the worst part was the drive on the logging roads from Lays Lake. That road has not been repaired in a while and is more or less an ATV road than anything else these days.\n\nOk so that’s a long intro, sorry!  But it helps explain the path I took to the cliffs below.  Since I did not wan to take the logging road, the closest access point is through the Musquodoboit Trailway system, specifically the south Granite ridge Trail.  The start of the journey is quite boring on the rails to trails but it does pass by some of the traditional climbing crags near Rolling and Skull rock.  Persevere on the flat trail to the entrance to the south Granite ridge Trail at N44° 48' 47.7\" W63° 09' 24.3\".\n\nHere the fun begins as you walk on this path for 3km.  Once you get to the Admiral lake lookoff you can actually see the climbing features you are trying to reach in the distance as well as a few more that you can also see as potential on the sat imagery (see pict attached).  From the lookoff the trail goes downhill for a little bit and then you will see the 3 km market.  At this point it is time to whip out your GPS or compass and aim for an area draining northwest lake into Admiral Lake at N44° 49' 42.2\" W63° 09' 02.6\".\n\nThe descent to this waypoint is brutal…actually most of the journey is brutal with shrubs that are about chest high and the soil full of ghost holes (holes where you go through up to your knee or deeper!) .  At the brook draining the two lakes, I could spot some flagging tape and an old trail linking the two lakes.  Leave this area and aim for a waypoint at N44° 50' 06.1\" W63° 09' 05.5\".  On the way there will be many large boulders and some small cliffs around N44° 49' 57.7\" W63° 08' 55.6\".  \n\nThe best feature is at N44° 50' 06.1\" W63° 09' 05.5\".   Where you will have a super view to Admiral Lake and a crag of at least 50-60 ft.  Have a look at the images I obtained with the drone and see me at the top for scale. The bugs on the day I was there were at a DEFCON level 5 state!  Absolutely ridiculous as they pelted the hood of my coat like hail!  On the descent from the feature towards Wildcat Lake there were the largest boulders I saw on my whole journey at around N44° 50' 05.4\" W63° 08' 50.2\".  One of them was seriously the biggest one I’ve seen in NS!  I took a better waypoint and reach out to me if you need it.\n\nAs I reached Wildcat Lake, there was of course another boat cache!  Here there is a trail between Wildcat and Admiral Lake and people are stashing boats in the woods to access their fav fishing spots!\n Across the lake and in an area around; N44° 50' 07.4\" W63° 08' 41.9\" are more boulders to check out and then you need to aim for this waypoint; N44° 50' 13.2\" W63° 08' 15.3\".  again the walk will be mostly brutal with some respite at a small bog like feature which unfortunately only last about 100m of the 1 km journey between Wildcat and the feature. You start to see the cliffs in the distance, which gives you some hope.  A descent into a valley at its foot and then a climb up the side of it is all that remains of the journey!  With the bugs being so ridiculous that day, I only spent about 10 min at the top on a journey that took 3 hours!  From that vantage point you can see the side of The Promised Land cliffs as well as Admiral Lake in the distance!  The (Martell) cliffs themselves are definitely climbable and solid.  A mixture of slab ands straight edges.  My drone video on youtube is the best way to ascertain the climbing levels.  https://www.youtube.com/watch?v=KOSCFzu7b50",
    "directions": "Go to Musquodoboit Harbout Trailway system entrance.",
    "geohash": "dxg",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/13471/18368409620332827168115623311991017579358441n.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13471/18257184520335712567827084168219701243613763n.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13471/Capture.JPG",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13471/Capture1.JPG",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13471/202105070915331.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13471/20210507104147.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13471/20210507105049.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13471/20210507111219.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13471/202105071133031.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13471/DJI0001.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13471/DJI0988.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/byron-lake-aka-martell-cliffs-near-musquodoboit-harbour-13471",
    "stats": {
        "Activities": "hike climb",
        "Elevation Gain": "790 m",
        "From": "",
        "Seasons": "summer winter spring fall",
        "Stars": 5,
        "Time": "6 hrs",
        "Total Distance": "16 km",
        "Town": "Musquodoboit Harbour, NS",
        "Type": "out-and-back"
    },
    "title": "Byron Lake -aka Martell - Cliffs",
    "trail_id": "13471"
}