{
    "description": "This is the route I took one day to visit a few falls…or what I thought might be falls in the upper reaches of the North Baddeck River.  That’s the same river where a tributary about 10 km downstream give rise to the Uisge Ban falls.\n\nOf course if I am going to bushwack far from my house, I plan to check out more than just one place at a time.  I could see a main tributary flowing into the North Branch in an area about 200 m upstream of where I wanted to go so I decided to see if there would be falls on the tributary as well.  The Crowdis Mtn Rd leads you to a secondary road at N46° 15' 19.9\" W60° 49' 08.3\" (take the one going east) .  Take it and follow it by car or foot for as long as you can to approx.; N46° 15' 59.6\" W60° 48' 23.7\".  Now the fun begins!   \n\nI started to bushwack heading towards the tributary located west of that road.  The walk at first is super pleasant as the trees are widley spaced.  Once you reach the streams, the forest crowds in a bit but it’s not too bad (bad like the eastern shore!)  Ultimately you will be looking for a 5 ft, 15 and 25 ft fall on the tributary all around this waypoint;  N46° 16' 06.4\" W60° 48' 59.3\".  Why did I end up following this tiny tributary?  Well I could see some hint of a fall on sat imagery.  \n\nFrom this tributary continue downstream about 1 km to two falls back to back.  First one to reach will be about 15 ft and then the next is the best of them all at about 30 ft in a nice pyramid shape.  This fall occurs at approx.; N46° 16' 18.6\" W60° 48' 07.1\".  Then I finally reached the Baddeck River and followed it downstream.\n\nWell downstream was the white spots I saw on sat imagery but instead of massive falls I had imagined, there were a few 8-10 ft falls but the river here has carved a really cool canyon.  Unless you swim you have to scale really high up on the side to be able to peer inside.   This feature is about here; N46° 16' 01.0\" W60° 47' 49.7\"\n\nFrom here scale up the hill and traverse a mature hardwood forest all the way to the secondary logging road you started on.",
    "directions": "Cabot Trail going towards Middle river. Turn on Crowdis Mtn Rd and drive 16.6 km to a road on the right AND left.  Take the one on your right….",
    "geohash": "f8hz0",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/13482/1994066743527916828591518013598280235423650n.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13482/2005048083527914628591731747726523666224425n.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13482/1994567793527912395258621166270108959709743n.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13482/1990274643527912328591966950619829835796525n.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13482/1921663953533141594735705369375307052085350n.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13482/1313472713533140961402432510396716901244485n.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/north-branch-baddeck-and-tributaries-falls-near-baddeck-13482",
    "stats": {
        "Activities": "hike",
        "Elevation Gain": "200 m",
        "From": "",
        "Seasons": "summer spring fall",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "6 km",
        "Town": "Baddeck, NS",
        "Type": "loop"
    },
    "title": "North Branch Baddeck and tributaries falls",
    "trail_id": "13482"
}