{
    "description": "The plan that day was to reach a few spots on the south Fishing Cove river in the CBHNP to check out some possible falls I saw on sat imagery.  To get there, I could use the old Cabot trail that ran from where I park below to the Skyline Trail entrance.  Setting off I could see the old road had not been maintained.  The trees are overcrowding the roadway byt enough moose are travelling through to get some type of trail maintained.  At the bottom of the first hill is the main branch of fishoing cove river and the entrance to the old trail that hugs that river all the way to the cove.  Here is a nice curved bridge in half decent shape.  On the other side of the river, you need to climb back up to the plateau.  On the plateau, there is one more bridge to cross but a big hole in the centre makes it necessary to go gown the ravine and then back up.\n\nAfter the second bridge, the trail gets overcrowded by alders and the best route is through the forest near the road.  Near the south Branch you can finally get off the road and start traversing a wide open area all the way to the edge of the ravine.  A descent into the ravine is steep but manageable especially if you find a moose trail like I did.  After that I followed the river for about a km and saw a few falls but nothing that rally warrants the effort…sorry!  The best series of falls set in a small gorge like setting is at; N46° 45' 44.9\" W60° 51' 56.8\".  I did see a moose walking in the woods and was attacked by a few partridge-type birds guarding their young so beware!   On my return trip, at the broken bridge, I followed the tributary down to the main Fishing Cove River and stopped at a 10ft fall with a deep pool around N46° 45' 31.3\" W60° 50' 11.3\".  I then used the old trail to get back to the first bridge mentioned above.\nStats for the hike is 9.2km and 420 m ascent AND 420m descent!",
    "directions": "Cabot Trail from Cheticamp to Pleasant Bay.  Park at the old road coming in at; N46° 45' 42.6\" W60° 50' 03.3\"",
    "geohash": "f8k",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/13487/2062119423601648454551687554810032204861999n.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13487/2051512533601647387885123984175519167957472n.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/south-fishing-cove-river-falls-near-cheticamp-13487",
    "stats": {
        "Activities": "hike scramble",
        "Elevation Gain": "420 m",
        "From": "",
        "Seasons": "summer winter spring fall",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "9 km",
        "Town": "Cheticamp, NS",
        "Type": "out-and-back"
    },
    "title": "South Fishing Cove River Falls",
    "trail_id": "13487"
}