{
    "description": "Nice seashore exploration near Noel.  I didn't expect anything for this hike and spoiler alert, it was great!   Setting off towards a bluff in the distance to the west, I saw a few small cave like features but nothing more than 2-3 ft deep.  I also stumbled upon a 20 ft fall that was almost bone dry.  The best part of the hike is located at the bluff.  Here a long and high ceiling sea cave is located.  The wasps are cool with conglomerate on the ceiling.  Continue heading west after the main des cave to another one.  This other one which is smaller has two windows to craw in and out or just use the main entrance which is a good 10 ft high but hidden behind the corner.  Continue along the  seashore to where Rennie Brook empties itself and to a nice overhand of rock by its eastern side.   A few hundred metres more will get you to a 15 ft fall but it could be dry.  Retrace your steps or push further to Clements Cove had...another cool cave with a pillar is located there. (another trailpeak post exists for it)",
    "directions": "Highway 215 from Noel towards Walton.  At the United church take, Church St (or 1st Ave in google map).  Drive to an obvious grassy parking with a stair leading to the ocean.",
    "geohash": "f849",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/13489/20210625103612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13489/20210625100318.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13489/20210625102846.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13489/20210625103914.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/13489/20210625104225.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/rennie-cove-sea-cave-near-noel-13489",
    "stats": {
        "Activities": "hike",
        "Elevation Gain": "10 m",
        "From": "",
        "Seasons": "summer winter spring fall",
        "Stars": 5,
        "Time": "2 hrs",
        "Total Distance": "5 km",
        "Town": "Noel, NS",
        "Type": "out-and-back"
    },
    "title": "Rennie Cove Sea Cave",
    "trail_id": "13489"
}