{
    "description": "Completed on June 26, 2021 in dry conditions\n*** Bike-N-Hike ***\n\n// *** Campground gates opened from May 19 to September 19. Extra 10 km return biking if first gate is closed. \n// Edwards Rating: II (III) L L \n// 5.5 to 9 hours\n// Elevation of 1277 m NET, 1542 m TOT (including biking) & max 2975 m\n// GPS: DO NOT use the right trail, go left rather, we missed a turn…\n// Must-have gear for this one: Poles, bug repellent at this time of the year and bear spray\n\n*****\nThis is a moderate scramble technically but a long day so hopefully you got a bike to get to the trailhead. It is mostly a steep hike, seems like it never ends! On the summit ridge, you got a few minutes of fun scrambling with some exposure. We were slow due to the 30+ degrees temperature, didn’t have enough water (4 liters) and forgot our poles, long day… I recommend that one only if you have bikes. I am glad I’ve done it for sure but I wouldn’t do it again, way too many peaks to do!\n\n// From the parking lot (gate at the end of the campground), we biked for 8.2 km and locked our bikes close to the flagged tree on the right side of the road (at GR156404), by a creek. We started walking up the hill to the right following a faint trail. It is bushy so make sure you carefully look around not to miss it. It leads to the main gully and then you’ll have a first intersection with a gully on your left, turn here. We missed it, went up quite bit on the right arm of the summit ridge and had to lose elevation later to reach the other ridge on the left. It could have been possible from where we were but snow under the false summit was risky/steep. It seemed like a difficult scramble IF doable and we didn’t have the energy to guess. Once you’re in that gully, follow it until it opens up and then traverse it to the left to hike up the forest and avoid rubble for as long as you can. It is pretty much a straight line from there with at least a couple of decent trails in the rubble. We liked using the one closer to the gully leading directly to the beginning of the summit ridge. Then, we turned left on the ridge to reach the false summit. We scrambled down a col and back up the true summit, where hands-on scrambling was involved. Holds are good in general but some rocks are loose, use caution and test them out first. A fall there could be fatal, when you look down the huge vertical slab below, but I would consider it moderate still as this is not direct exposure.\n\n// On the way down, we used the correct route this time, staying on the same ridge till we reached the forest, Then we turned left and saw a waterfall in the gully, we took another 3 liters of water there as we were completely dehydrated and I felt sick, it was hot… We reached that intersection I was referring to earlier, the one we missed, and went back down to the bikes quickly from there.",
    "directions": "From the Canmore Nordic Centre entrance, continue on Spray Lakes Road AB-742 for 13.9 km, turn right on West Side Road, continue for 5.4 km where’s there is a parking on the left (when campground is open).",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/13492/mountnestorkananaskissummitpanoramasparrowhawkbogartbullerjun262021.JPG",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13492/mountnestorkananaskismarrybikingalongspraylakesviewbullerjun262021.JPG",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13492/mountnestorkananaskismarrygullyintersectionfortrailpeakjun262021.JPG",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13492/mountnestorkananaskismarrysheepmtfrenchjun262021.JPG",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13492/mountnestorkananaskismarryupcruxbelowsummitnicejun262021.JPG",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13492/mountnestorkananaskismescramblingupundersummitjun262021.JPG",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13492/mountnestorkananaskissummitmarrysospreypackjun262021.JPG",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13492/mountnestorkananaskissummitviewmtalcantaraassiniboinejun262021.JPG"
    ],
    "source_url": "https://trailpeak.com/trails/mount-nestor-near-canmore-13492",
    "stats": {
        "Activities": "hike scramble mtn-bike",
        "Elevation Gain": "1300 m",
        "From": "",
        "Seasons": "summer",
        "Stars": 3,
        "Time": "7 hrs",
        "Total Distance": "24 km",
        "Town": "Canmore, AB",
        "Type": "out-and-back"
    },
    "title": "Mount Nestor",
    "trail_id": "13492"
}