{
    "description": "Completed on July 3, 2021 in dry conditions\n*** Hike-N-Bike or going with 2 cars highly recommended (about 9.6 km from the junction of Powderface Trail/campground road - Ford creek/Prairie creek) ***\n// *** Highway 66 and Powderface Trail closed Dec-May.\n// Edwards Rating: III (IV) L L \n// 8 to 12 hours\n// Elevation of 913 m NET, 1257 m TOT (or 1448 m including biking or hiking back on Powderface Trail) & max 2530 m\n// GPS: Starting from campground C where we stayed the previous night. I stopped it at Powderface Trail, but walked back to the campground (about 31 km total)\n// Must-have gear for this one: Poles, helmet (we should have…), bikes, bug repellent & bear spray\n\n*****\nThis is a moderate to difficult scramble technically with lots of exposure on most of this long ridge with some hands-on scrambling along the way. I wouldn’t recommend this one to unexperienced scramblers and make sure to have bikes or a car at the end to come back to Little Elbow if you want to avoid an extra 11 km walk on Powderface Trail like we did (long story…!). Ideally you want to stay on the ridge, even though exposed, safer and more efficient than taking trails down below in most cases. This traverse is awesome!\n\n// From the campground, we kept going on the dirt road until we saw the Nihahi Ridge sign on the right. We followed signs until we got to the ridge, where we preferred the left trail to stay high and go directly under the false summit. Then, we climbed a 10 metres rock band on our left and reached the false summit. There is a way up there, but we weren’t 100% confident so we hiked on a ledge to join the “official” trail and scrambled up the crack. From there, we stayed on the ridge and reached the first summit quickly. Not much to say except that following the ridge line for the dozen+ peaks along the way is ideal, but you will see a trail on the left side sometimes and can use it to avoid some exposed sections or save some energy by avoiding ups and downs. At some point, you’ll have to down climb a rock band. We went down on the slabs a few meters, then  down climbed a line going NE and reached back the ridge after. We did bypass the last 3-4 peaks as we were tired and worried about a potential thunderstorm. Below the summit (GR 457362), there is still some fun scrambling to do with a bit of loose rocks but nothing worrisome if you got to that point.\n\n// On the way down, we continued on the ridge going NW for just a few steps and saw some scree to our right, which we used to go down that bol. We struggled finding good scree so we traversed it going west hoping to reach the grassy slope as soon as possible. But with rubble everywhere, only once we got to the trees did it get easier. We could have tried the brown-orange ridge just below the summit, it seemed like a more direct way to reach the drainage. We walked to the drainage and followed it for a while using faint trails mostly on the left side of it. We lost the trail many times with the deadfalls and bushes, so we focused on going east and sometimes following decent trails until we reached Ford Creek. We followed that trail and got to the road. Then we walked back to Little Elbow. We hoped we had brought our bikes as initially planned, it was painful!",
    "directions": "From Calgary, follow Trans-Canada Highway/AB-1 W, take exit 161A for AB-22 S toward Bragg Creek/Redwood Meadows and go south for about 22 km. Turn right on AB-66 W and drive another 27 km to Powderface Trail junction. Turn left and drive another 1.2 km to the Little Elbow River parking lot. Follow the campground dirt road to the Nihahi Ridge map.",
    "geohash": "c3n",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/13494/nihahiridgetraversekananaskissummitpanoramabryanttoglasgowjul32021.JPG",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13494/nihahiridgetraversekananaskisclimbupbeforefalsesummitjul32021.JPG",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13494/nihahiridgetraversekananaskiscloseviewoncruxtpjul32021.JPG",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13494/nihahiridgetraversekananaskisdownclimbcruxbehindtpjul32021.JPG",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13494/nihahiridgetraversekananaskisdownthebowlroutejul32021.JPG",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13494/nihahiridgetraversekananaskismarrycarefullyadvancingonsteepridgenicejul32021.JPG",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13494/nihahiridgetraversekananaskisrarelyanobvioustrailherejul32021.JPG",
        "https://trailpeak.com/storage//content/trails/Canada/AB/13494/nihahiridgetraversekananaskiswelcomewholeridgeviewedfromtheroadtpjul32021.JPG"
    ],
    "source_url": "https://trailpeak.com/trails/nihahi-ridge-traverse-near-bragg-creek-13494",
    "stats": {
        "Activities": "hike scramble mtn-bike",
        "Elevation Gain": "1257 m",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 4,
        "Time": "10 hrs",
        "Total Distance": "18 km",
        "Town": "Bragg Creek, AB",
        "Type": "out-and-back"
    },
    "title": "Nihahi Ridge Traverse",
    "trail_id": "13494"
}