{
    "description": "There is an interesting view of St. John's harbour from Cape Spear, which I admire before continuing down the path to Petty Harbour. The trail is gently rolling and every so often I hear the 'fwoosh' of an August whale \nspouting. Humpbacks and smaller pothead whales are in abundance from mid-July to mid-August. The humpbacks are feeding on capelin, small fish about 6 inches long, which travel in schools and spawn by the thousands on black sandy beaches in June. The humpbacks usually resurface a number of times after their initial spout, sometimes with a splash of their tail. Pothead whales pop up periodically as well, but usually disappear after a single spout. \nA small stream meanders its way parallel to the coast and in the distance the terrain is dotted with dozens of boggy ponds and heath Aa term referring to the shrubby wasteland that is common to the boggy soils of the Avalon Peninsula.) Junipers, blueberries, alderberries and short fir trees sprout along the path. After walking for a couple of kilometres alongside high cliffs, the path descends softly to the ocean and follows a stretch of each line for a few hundred metres. \nEven though it's a hot day, a cool breeze blows off the sea and the air feels quite comfortable. At Little Herring Cove, I meet a group of 3 hikers. One lady left Newfoundland when she was a teenager and like myself, now lives on the mainland. At this particular cove, there is a group of 3 or 4 humpbacks feeding and the whales keep surfacing quite close to shore, perhaps only 40 or 50 metres away. Every couple of minutes there's another spout of water, and a tail is exposed as the whale goes back down. Some potheads are in on the fun as well. We sit and marvel at the sight. We are lucky that the whales are feeding so close to shore and so late in the summer. \nPetty Harbour looks like a place that time forgot. Old style wooden houses line the shores of Maddox Cove and the harbour provides refuge for a handful of small fishing boats. Although the cod fishery has been largely shut down by the moratorium, a limited 'sentinel' fishery remains, and a limited number of licensed fishers are allowed to set their nets and fish for cod. There is also a viable crabbing industry as well. Following the highway from Maddox Cove to Petty Harbour, it's about a half hour walk from the trail to the town proper.",
    "directions": "Cape Spear National Historic Site (look for the trailhead marker at the end \nof the boardwalk, just past the old lighthouse).",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NL/1364/long_pettyharbour2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/1364/topo_pettyharbour.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/cape-spear-to-petty-harbour-part-of-east-coast-trail-near-st-johns-nf-1364",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "12 km",
        "Town": "St. Johns, NF",
        "Type": "out-and-back"
    },
    "title": "Cape Spear to Petty Harbour (part of East Coast Trail)",
    "trail_id": "1364"
}