{
    "description": "Well, if you're in the neighborhood, it's a ride.  Not a ride I would give a high-rating on, but a ride nonethless with some interesting terrain.  We decided on this one for a couple reasons.  The historic town and mine of Lille was there, now there is just a stone foudation of the hotel and some slight remnants of house foundations.  Interesting enough.  The second reason was it was a 23km loop through the southern Rockies.  Well, it was supposed to be a loop but I ran into a gate across the trail about 6km out.  Most curious were the signs, so I don't know if it was a legal closure or not.  But there seemed little doubt they didn't want trespassers coming through and I hate gettin' shot at so we turned around.Up to that point it was a pleasant enough ride, crossing Gold Creek several times, sometimes on bridges and others points where you could ride through the stream.  We came across a nice waterfall that made a good place for a rest.Best to check with the local visitors bureau regarding trail closures or the status of gates or how to proceed. NTS Map: 082G09Elevation gain: 140 m (459 ft).",
    "directions": "There are are several other trails I've heard of in the area.  Get yourself to the general vicinity of The Crowsnest Pass (you can't miss it, 1/2 way between Lethbridge & Fernie on Hiway 3).  Stop in Blairmore.Drive a couple km East on #3 until you see the road on the north side of #3 to the Frank Slide Interpretive Center.  Follow that road up nearly to the top where there will be a hairpin turn to the right and a poor road with a cattle guard off to the left.  Cross the Texas gate and park anywhere you want.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/1377/long_2032-sm-42859.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1377/long_lilleprofileJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1377/reg_1938-sm-42859.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1377/reg_crow1jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1377/reg_crow2jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1377/reg_crow3jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1377/reg_crow4jpg_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1377/topo_lilleplanJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1377/narrow_2174-sm-42859.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/lille-ghost-town-near-blairmore-ab-1377",
    "stats": {
        "Activities": "snowshoe hike ski-xc mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 1,
        "Time": "1 hrs",
        "Total Distance": "12 km",
        "Town": "Blairmore, AB",
        "Type": "out-and-back"
    },
    "title": "Lille Ghost Town",
    "trail_id": "1377"
}