{
    "description": "The hike to the Plain of Six Glaciers is one of Banff National Park's classic hikes. There may be huge crowds at the start of the trail but the scenery is so good that if you can bear it, I think it's something you can be forgiven for hiking just once in your life. The hike begins at Chateau Lake Louise, amidst the hundreds and thousands of people streaming off of the tour buses to snap the Lake and the mountains behind. Follow the lakeshore trail to the far end of Lake Louise. There will likely be far less people at this point! We hit this trail fairly early in the day, and in contrast to the hike we did to Larch Valley  the previous day, we saw practically no one on the trail all morning. From the parking lot, it's 5.5 kms to the Plain of Six Glaciers Teahouse. Continue another 1.6 kms along the trail to the viewpoint for a closer view of the glaciers. On the morning of our hike it was a bit foggy, and we couldn't see the tops of the mountains. But we sure could hear the avalanche! No one warned us and it scared the crap out of us. From the viewpoint we returned to the teahouse for a lunch break and learned that avalanches are a normal occurrence and that some days they hear them from the teahouse every hour or so! I'm not sure where exactly they are taking place, but the hike itself to the Plain of Six Glaciers is secure in the summer, so enjoy the distant rumble (if avalanches can possibly be enjoyedÂ?) but don't go beyond the viewpoint where the trail ends. For those wishing for a close up view of Victoria Glacier, there is an unmarked trail not far from the teahouse. About 100 m past the footbridge look for a not-so-apparent trail just beyond an avalanche chute leading up. The trail goes up 2115 feet in just 2 kms! After numerous switchbacks the trail sort of peters out in a field of softball sized scree. We heard another avalanche at this point and paused to pray. Not very pleasant walking over the scree, but the glacier itself is less than a km away.  Continue over the scree and take a close look at the deep crevasses and the true size of the Victoria Glacier. Don't be stupid and hike onto the glacier unless you have the appropriate gear and know what to do if you fall into a hidden crevasse!!! Glacier fields are dangerous and should not be taken lightly.In winter please check local avalanche conditions and bulletins.NTS Map: 082N08Elevation gain: 1380 ft / 420 m (+2115 ft / 645 m to Victoria Glacier)Distance: 14.2 kms round trip (an additional 4 kms round trip to Victoria Glacier)",
    "directions": "Follow Lake Louise shoreline to the far end and look for a trail marker.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/1385/long_IMGP33601-7960.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1385/long_IMGP33678-7960.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1385/reg_408-16132.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1385/reg_412-16132.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1385/reg_6glacier1a.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1385/reg_6glacier2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1385/reg_6glacier4.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1385/reg_6glacier4a.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1385/reg_DSC01937-7759.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1385/reg_DSC01951-7759.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1385/reg_DSCN2361-31043.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1385/reg_DSCN2363-31043.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1385/reg_IMGP33599-7960.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1385/reg_PlainOfSixGlaciers-LakeLouise-June-13-2--44639_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1385/reg_extra6glacier0.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1385/reg_map.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1385/reg_pikkaJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1385/reg_victoriaglacier.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1385/reg_victoriaglaciercloseup.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/plain-of-six-glaciersvictoria-glacier-near-banff-ab-1385",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 4,
        "Time": "7 hrs",
        "Total Distance": "14 km",
        "Town": "Banff, AB",
        "Type": "out-and-back"
    },
    "title": "Plain of Six Glaciers/Victoria Glacier",
    "trail_id": "1385"
}