{
    "description": "Distance: 24.4 kms from Paint Pots to Tumbling Creek to Numa Creek Campsite, not including sidetripsÂ?\r\n\r\nWe did this backpack trip in August 2004 and spread it out over 3.5 days. While possible to do a day-hike to Tumbling Pass, you gain and lose approximately 2700 ft. and while the views at the Pass are quite spectacular, much of the trail is forested. I would not recommend this route unless you are either extremely fit and have no limits time-wise. \r\n\r\nAn advantage of camping at the Tumbling Creek site is that you have the time to explore the rest of the Rockwall TrailÂ? For those with loftier ambitions, the entire 54.8 km Rockwall trail can be hiked in 3-4 days from Floe Lakes to the Paint Pots. We chose to use the Tumbling Creek site as a base camp to explore further afield, rather than lugging our gear along the entire time.\r\n\r\nParking at the Paint Pots trail parking lot, the trail crosses a stream and heads into the forest. After 1.6 km there are interpretive signs explaining the significance of the paint pots (ochre beds) to Native Indian culture and history. The trail passes through forest for much of the way along the 10.7 km trail to the Tumbling Creek campsite. We did this hike in early August and there were huckleberries and blueberries galore along the trail, which slowed us down considerably. (Note: I was told that you're only permitted to pick a small volume of berries in Canada's national parks. Something like half a pintÂ?) The trail to the Tumbling Creek campsite passes by the picturesque Tumbling Falls, which are close to the campsite (~1.3 kms away). The campsite has a couple of pit toilets that were chewed by a porcupine. That rascal made a huge hole in the floor of one of the toilets and one had to be careful not to fall in!\r\n\r\nThe weather was drizzly the first night so we all went to be early and I read an entire novel while waiting for it to get dark (\"The Five People you meet in Heaven\" - not a bad camping book - short and sweet!)\r\n\r\nThe next day it was foggy and mysterious and so we ditched our backpacks and packed lunches and explored Wolverine Pass as well as the Rockwall Trail going towards Helmut Falls. The Rockwall lives up to its name (see photos)! The sun broke through the clouds every now and then and we were treated to views of the Glacier above Tumbling Creek as well as the full view of the Rockwall. We went offtrail and explored the ridges across from the Rockwall walked our way to the end of the ridge, which was adjacent to the far end of the Rockwall.\r\n\r\nThe next day the sun came out and we made a daytrip to Tumbling Pass, which is in fact quite a ways from the Tumbling Creek campground. Again we went offtrail and headed straight up to the top of the ridge across from the Tumbling Creek Glacier and were treated with fantastic views with the Rockwall in view further to the Northwest and views down the lush green valley of Numa Pass towards Floe Lakes. Feeling adventurous a couple of us decided to wade the glacier fed stream to get back to the campsite as a shortcut instead of going the extra 200 m or so to cross the bridge to get back to camp. Let me tell you, that water is cold!\r\n\r\nOn the last day, to get back to our cars, we split up and some went back the same way we came returning to the Paint Pots on the Tumbling Creek Trail while three of us followed the Numa Creek Trail, which allowed for one last view of Tumbling Pass, followed by a very punishing-on-the-knees descent back to the highway via the Numa Creek Trail.\r\n\r\nNote: Reserve campsite well in advance by calling Kootenay National Park.",
    "directions": "Access Point: Paint Pots trailhead parking lot off Highway 93 (plus car shuttle at Numa Creek picnic site).",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/1386/reg_DSCN1963-59541.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1386/reg_DSCN2014-59541.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1386/reg_DSCN2037-59541.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1386/reg_day3c.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1386/reg_day3e.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1386/reg_hikingthruforest.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1386/reg_rockwall3.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1386/reg_rockwall4.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/tumbling-pass-part-of-the-rockwall-trail-near-invermere-bc-1386",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 4,
        "Time": "49 hrs",
        "Total Distance": "0 km",
        "Town": "Invermere, BC",
        "Type": "out-and-back"
    },
    "title": "Tumbling Pass (Part of the Rockwall Trail)",
    "trail_id": "1386"
}