{
    "description": "NTS Map:92K5.\r\nKusam Klimb Trail Description\r\n\r\nThis is a general guide to be used in conjunction with the Kusam Klimb map.  For the annual official Kusam Klimb Event the trail will be marked with signs and flagging tape.  Weather, natural hazards, animal traffic as well as other factors can alter the trail and the trail markings.  Be alert and careful.  Always travel in the backcountry well prepared and be sure to let someone know your plans and when you are expected back.\r\n\r\nEach leg distance in the descriptions below will be the distance from the last checkpoint.\r\n(Elevations from sea level)\r\n\r\nLeg 1:  Heritage Hall Start & Finish Line (9m) TO ?Have you had enough yet? checkpoint 1 also known as the first View Point (390m)\r\n3.7km- 2.2km pavement, 1.5km steady steep up wide trail.  Elevation Gain is 381m.\r\nHeritage Hall is located on Sayward Road 3 km from the Sayward Junction on the left hand side (just past the fire hall on the right).  Proceed on the shoulder of Sayward Road continuing from the Heritage Hall towards the Village of Sayward for 2 km to Sabre Road turning right at the Coral Reef Pub. Follow the pavement uphill to where it dog legs right. Turn left onto the gravel road 100meters and see a trail sign on the right.  Bill's trail rises steadily to a clear cut block, traveling down for a couple of steps and then switchbacks up and steady into the trees.  The foot bridge is 1/2 km from the trail head of Bill's Trail.  The outhouse is at the 1km mark (there are no facilities at the checkpoint) and the ?Have you had enough yet? checkpoint is at 1.5km.\r\nTOTAL DISTANCE TRAVELED FROM HERITAGE HALL START IS 3.7KM\r\n\r\nLeg 2:  ?Have you had enough yet? checkpoint 1 (390m) TO ?Join us at the Top? Checkpoint 2 (1482m)\r\n4.0km- Rough, Steep, Cliffs, probable snow year round.  Elevation Gain- 1092m \r\nAfter the Have you had enough yet Checkpoint, the trail immediately narrows and becomes steeper.  A few sections offer ropes for assistance.  Note that these ropes are for aid only and that you should not rely on their strength for safety purposes.  There are several short lookout side trails at the .5km, .6km, 1.0km and just before the helicopter pad at 1.1km.  Each is only 10-20m off the trail and offer spectacular views as well as an enjoyable spot to catch your breath.  Elevation at the helicopter pad is 841m.  You have just climbed 451m in 1.1km.  It's pretty well steady uphill as you pass an old growth plateau to the top of Keta Lake View rock at 2.2km at 1270m elevation. Elevation gain in the last 1.1km is 429m.  The trail slowly side hills to the right at a steady but not as steep incline.  Keep right at the Springer Peak junction sign.  At 2.9km, elevation 1440m, you will be able to see the col (mountain pass) ahead, an alpine lake below the col and a spectacular view of the Salmon valley below.  It is a short (400m) steep descent down to the lake at 1353m. From the lake a short 700m takes you steadily up to Checkpoint 2.  Hazards - Depending on the season, there can be a lack of moving water between Checkpoint 1 and Checkpoint 2.  Drink your fill at Checkpoint 1 and Pack Water, at least one litre.  Most times of the year it is very dry for the first 3.0 km of this leg.\r\nTOTAL DISTANCE TRAVELED FROM HERITAGE HALL START IS 7.7km\r\n\r\nLeg 3:  ?Join us at the Top? Checkpoint 2 (1482m)  TO ?Fisherboy Park? Checkpoint 3 (750m) \r\n5.0km- Steep descent through old growth 2.6km, steady descent old road trail 2.4km\r\nElevation loss-732m\r\nKeep to the centre of the gully as the trail from the top drops quickly within another old growth section. Always keeping the creek on your left, you will descend 2.6km steeply to a single log bridge into an open area.  The trail is noticeably less steep as it follows an old logging road on your left side, switch backing down and crossing the main creek several times.  Fisherboy Park Checkpoint 3 is at the parking lot terminus of the Stowe Main logging Road.\r\nTOTAL DISTANCE TRAVELED FROM HERITAGE HALL START IS 12.7km\r\n\r\nLeg 4:  ?Fisherboy Park? Checkpoint 3  (750m) TO ?Junction? Checkpoint 4(268m)\r\n5.0km of gravel road.  Elevation loss: 482m\r\nFollow a 4x4 deactivated gravel logging road steady down.  The first switchback at 400meters is very loose; proceed around this corner with caution.  There are dozens of dippsy doodles (or cross cuts made in the road to deactivate or discourage vehicle access).  Vehicle traffic Hazard.\r\nTOTAL DISTANCE TRAVELED FROM HERITAGE HALL START IS 17.7km\r\n\r\nLeg 5:  ?Junction? Checkpoint 4(268m) to Heritage Hall(9m)\r\n5.5km- 2.5km gravel road & pavement, 3.0km mostly gentle down trail.  Elevation loss: 259m\r\nThe route follows an old overgrown logging road mostly in a straight line gently downhill for 1.8km.  It is wide and grassy with several creek dippsy doodles.  Creek levels will vary.  At the Cottonwood ?wood? sign (just past the junction with the Cottonwood Loop) the trail narrows along new growth alders.  Watch out for tripping hazards from the cut off small stumps.  After crossing a small creek the trail decline increases over flat rock and follows beside the creek (you can usually hear it, not see it).  Watch for the sharp right turn onto a freshly cut rougher trail and onto a tree bridge with a tree growing out it!  This will take you almost to the other side of the creek depending on water level.  The trail rudely goes straight up the steep loose dirt bank for about 50m.  At the top you are at the boundary of a newly cut forest.  Ignore the trees with red ribbons on them as they are boundary markers, not part of the trail.  The trail roughly follows in a diagonal 100m on your left to the end of a logging gravel road.  Follow the roads down 1km to a stop sign and the top of Cottonwood Road.  Turn left at the junction and down on Ryan's Road.  Another Left at Sayward Road and .5km FLAT! To the Heritage Hall.\r\nTOTAL DISTANCE TRAVELED FROM HERITAGE HALL START IS 23.2km\r\n\r\n\r\nGPS Locations:\r\nHeritage Hall Start & Finish: N50?20.212 x W125?54.702\r\nHave you Had Enough Yet Checkpoint: N50?21.010 x W 125?53.054\r\nJoin us at the Top Checkpoint:  N50?20.585 x W125?50.689\r\nFisherboy Park Checkpoint:  N50?19.665 x W 125?49.145\r\nJunction Checkpoint:  N50?18.865 x W125?15.736  \r",
    "directions": "Heritage Hall is located on Sayward Road 3 km from the Sayward Junction on the left hand side (just past the fire hall on the right). Sayward is 75km north of Campbell River.  The start of Bill's Trail is 5km from the Sayward Junction.  Turn right at Sabre Road to the top of the hill where the road doglegs right.  Turn off the road here to the left onto a gravel road.  The Trail head is marked about 200meters from the road.",
    "geohash": "c0y",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/1390/narrow_kimjohnrickuprockjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1390/narrow_nearthetopjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1390/narrow_saywardvalleyjpg.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/kusam-klimb-bills-trail-near-campbell-river-bc-1390",
    "stats": {
        "Activities": "climb hike hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 5,
        "Time": "8 hrs",
        "Total Distance": "23 km",
        "Town": "Campbell River, BC",
        "Type": "out-and-back"
    },
    "title": "Kusam Klimb Bills Trail",
    "trail_id": "1390"
}