{
    "description": "Cape Chignecto is located in Central North \r\nEast Nova Scotia, separated from New \r\nBrunswick by Chignecto Bay, a smaller arm \r\noff the Bay of Fundy, home to the world's \r\nhighest tides, and odd ball currents. \r\nBesides being a kayaker's playground, \r\nthis is a geologist's dream. This area is host \r\nto a rugged coast line due to the Cobiquid \r\nfault line, giving way to fossil and rock \r\nhounding. The hills reach upwards to 200m \r\n(highest in mainland NS) and offer up basalt \r\nsea stacks, mixed forests, and a cross \r\nsection of the earth's geographic changes \r\nover millions of years. \r\nI've paddled this region a couple of \r\ntimes, and one thing to note is that the Bay \r\nof Fundy can have some rough seas even on \r\nthe nicest days. Be prepared for fog, weird \r\ncurrents, wind, and rough seas.  On both \r\noccasions, I've experienced it all. Be aware of \r\nthe tide patterns too, as it is best to plan \r\nyour launches and arrivals on the dominant \r\ncurrent flow.\r\nThe big attraction to this paddle is the \r\nbasalt sea stacks called The Three Sisters. \r\nOne legend tells how the native god \r\nGloosecap turned his sisters into stone on \r\nhis departure from the land.) At high tide, \r\nyou can play around them by kayak. At low \r\ntide, you can beach and explore these and \r\nother rock formations, and caves in the area. \r\nHere, there is strong evidence of the tectonic \r\nactivity when the continents were seperated \r\nsome forty million years ago. \r\n\r\nOn my first trip, we drove to Apple River, and \r\ntaking a secondary dirt road, drove all the \r\nway to Spicer's cove. There, we met an \r\nelderly couple who watched over our car, \r\nwhile we ventured out for a two night stay in \r\nSeal Cove, right in the Cape Chignecto \r\nProvincial park. We had to register and pay \r\nfor our site at the administrative office in \r\nperson, so that made for a lot of extra \r\ndriving. When we finally launched off, seeing \r\na potential back country site right in the little \r\ncove by the Three Sisters had me wishing we \r\nhad picked that spot to set camp. It's very \r\nclose to the main attraction. Either way, the \r\nlocation is still in the park, and thus \r\nregistration is a must. This can be done by \r\nphone.\r\n\r\nOur second trip, we launched further back \r\nright in Apple River Bay where there is an old \r\nbus converted to a shelter. That area \r\nprovided a great beach launch site, and a \r\nplace to get changed and fueled up for the \r\ntrip. (see map and waypoint) On our return, it \r\nwas a site for sore eyes!\r\nThe currents in the area really reflect the \r\ngeography of the coast line. Coming out of a \r\nprotected cove gives rise to areas of rough \r\nseas, that on one occasion, literally drew us \r\nin, as we debated an alternative route. When \r\nin doubt, paddle... hard! \r\nFollowing the coast line is truly a \r\nwonderful visual experience. Most of the \r\nterrain is high cliffs with hidden rocks here \r\nand there along the coast depending on the \r\ntide levels. There were lots of features that \r\nwould make for a slow explorative doddle up \r\nthe coast. There isn't much to offer for \r\nemergency landings, so if seas are getting \r\nworse, have an emergency escape plan well \r\nin advance.\r\nOur site at Seal Cove had pit toilets and \r\na water source, all the amenities typical of a \r\nback country site run by the Province.  It is \r\nalso a major site for the 50k Cape Chignecto \r\ncoastal trail, so expect to see hikers tenting \r\nor passing through. On our second visit, \r\nwhen we landed at what is called Eatonville \r\nHarbor, right at the Three Sisters, the major \r\nwater source (Eatonville Brook) was brackish. \r\nIf you look around enough, you will find a \r\ntrickling water source from the rocks toward \r\nthe south. Treat it accordingly, but the water \r\nis good. You may also find my lost GPS unit, \r\nnow likely a gift to the sea gods!\r\nThis trip is definitely worth a two+ \r\nnight's stay. make a base camp and go \r\nexploring up and down the coast. There are \r\ndocumented let in spots along the hiking \r\ntrail, making it possible to work your way out \r\nof Chignecto Bay.\r\nShannon Burt",
    "directions": "Head to West Apple River from the \r\n209 from Amherst, or from Truro, head \r\ntowards Parsboro, and continue on to Apple \r\nriver. Head toward Spicer's Cove.",
    "geohash": "f81f",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/1393/long_kayaks.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1393/long_sealcove.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1393/reg_cape_C_kayakroute.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1393/reg_sisters.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/cape-chignecto-by-kayak-near-amherst-ns-1393",
    "stats": {
        "Activities": "sea-kayak",
        "From": "",
        "Seasons": "summer",
        "Stars": 4,
        "Time": "4 hrs",
        "Total Distance": "20 km",
        "Town": "Amherst, NS",
        "Type": "out-and-back"
    },
    "title": "Cape Chignecto by kayak",
    "trail_id": "1393"
}