{
    "description": "Although the traverse is sometimes started from Whistler or Singing Pass, it is usually done starting from the lift accessed top of the Blackcomb Glacier.  From the top of the glacier, drop down towards the Decker Glacier, staying low heading S.E.  Cross the northern glaciated slopes of Mt Trorey.   Good camping can be found here.  Mt Pattison can be passed by the northern col or by climbing a short but steep west facing chute south of the peak.  Cross the high on the Tremor Glacier, and climb to a narrowing slot between Tremor and Shudder Mountains.Head S.E on high ground across the Platform Glacier, past good camping sites, to a col just  west of Quiver Peak. Traverse the upper western slopes of the Ripsaw Glacier, until you come to a keyhole on the glaciers southern edge.  Drop down from here onto the Naden Glacier, passing Mt MacBeth on your right until you reach the top of the Macbeth Glacier, just north of Couloir Ridge.  Keeping to the skiers left, drop halfway down the glacier, passing a keyhole view of the Iago Glacier, to gain a south leading ridge.  Climb the ridge and follow it south until easier ground enables you to drop down onto the Iago Glacier.  Traverse the top of the Iago glacier, and climb the eastern slopes of Mt Iago, until you can drop down onto the Diavolo Glacier.  Circumvent the southern slopes of Mt Iago, and Mt Fitsimmons, passing good sites for camps.  Veer westward and then decide between climb the southern slope Mt Benvolio, onto the Benvolio Glacier, and climb the glacier to a point just east of Overlord.  Alternatively, you can take a more direct but steeper route climbing to the col between Mt Fizsimmons and Mt Benvolio.  Either way, this will get you to the top of the Fitzsimmons Glacier.Stay on high ground, approaching Overlord Mountain from the east, passing north of a steep eastern spur off the peak of Overlord, and dropping down onto the Overlord Glacier a little down from the cliffs SW of the main peak.  Traverse the upper slopes of the Overlord Glacier, past good camping sites, and climb the mellow slopes west past Whirlwind Peak to a point just south of Fissile Peak.  Once on high ground, drop down the shallow west leading valley between of Fissile Peak and an unnamed bluff.  Head down this gentle valley towards Russet Lake, easily identified by a cabin on its northern banks.  Keeping to the high ground south of the Lake, climb Cowboy Ridge and drop down to the upper reaches of Melody Creek.From this point you have two options.  You can follow the Singing Pass trail north down the western banks of Melody Creek, leading to a well maintained trail above Fitzsimmons Creek, and then the lower slopes of the resort.  Alternatively, you can continue in a westerly direction to climb the slopes of the Musical Bumps, Oboe, Flute and then Piccolo, giving you the entire vertical descent of Whistler ski resort to finish the day.There are many variations on this traverse.  In good conditions a multitude of peaks offer short side trips.  Many of the glaciers offer enjoyable skiing.  It should be noted that the glaciers are likely to be crevassed, and that this will cause considerable additional challenges should there only be a shallow snow pack.  All being said, though, in fair weather with a deep stable snow pack you are likely to share this area with day trippers, other campers, and helicopter skiers, because the excellent skiing and outstanding views make it to the top of my list of outstanding traverses B.C. has to offer.",
    "directions": "This is a late winter or spring traverse of the range surrounding the valley that separates Blackcomb and Whistler Mountains.  Due to it's easy lifted access, and proximity to Whistler Village, it is probably the most often travelled traverse on the west coast.  Whilst in fine weather it has been often completed in a single day by the more advanced backcountry traveller, it usually takes 3-4 days.  When the weather closes in and visibility is reduced to a few metres this traverse can prove very hazardous.  Route finding, avalanche dangers, glacier travel, technical terrain and high winds may all add to the difficulties you may encounter.  This traverse is not recommended for the inexperienced or in any but the best of conditions.(N.B. the gps file for this trail is a peak log only, not a track or route log)",
    "geohash": null,
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/1395/reg_Spearhead_Traverse_8813_backcountry_whistler.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1395/reg_Spearhead_Traverse_8815_backcountry_whistler.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1395/reg_Spearhead_Traverse_8818_backcountry_whistler.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1395/reg_best1_Spearhead_Traverse_8820_backcountry_whistler.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1395/topo_map_of_the_spearhead_traverse_backcountry_whistler.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/spearhead-traverse-near-whistler-bc-1395",
    "stats": {
        "Activities": "ski-bc",
        "From": "",
        "Seasons": "spring winter",
        "Stars": 5,
        "Time": "21 hrs",
        "Total Distance": "25 km",
        "Town": "Whistler, BC",
        "Type": "out-and-back"
    },
    "title": "Spearhead Traverse",
    "trail_id": "1395"
}