{
    "description": "The Fundy Foot path cuts along the shore of the New Brunswick's side of the Bay of Fundy.\nThe hike is a strenuous three to four day linear trek along the coast and meanders to follow the region's topographical features. It consists of steep cable steps, jagged cliffs, mixed forests, and tidal rivers to ford. Be aware of tide times. Elevation change is from water level up to 300m. Depending on which end you begin, it starts at Fundy National Park, and runs for a total of 50K. (42K from park boundary) Nine kilometers worth runs within the park along the Goose River Trail, and upon fording the Goose River and exiting the park boundaries, continues as kilometer zero of the Fundy Foot Path proper. For 42Kms, it runs through to St. Martins where it ends at a cable bridge and an interpretive center at Big Salmon River. (Which closes after October, adding an additional 11K to your trip to a parked car.)\nI've done more than half of the trail by starting in St. Martins as part of one hiking party. If you went in two car groups, each could set out from either end of the hike, meeting in the middle to swap keys and trail highlights. Other alternatives include kayak support for gear shuttling, or use of a shuttle service. On another trip, I managed to visit Kilometer zero and snapped a shot of the car which gave that spur trail its name.\nHeading from St. Martins, and registering at the trailhead with the staff, ($7.00, includes trail descriptions and aerial map package,) one seemingly long slog got us all the way to Cradle Brook. (the 10 K and change makes us sound like Rookies!) We determined that it was far enough when we descended a steep set of cable steps and felt it too unsafe to continue on our weakened legs. By that point, we were exhausted. The trail up to that point was fairly difficult, with steep terrain that just beats you up.\nWe made Cradle Brook our base camp, and used our middle day to hike pack-free to Little Salmon River and back. Getting there, we wanted to explore up-river to find a set of waterfalls (eye of the needle), but we never got far enough. On the river, however, we did encounter ATV users.\nBased on our distance covered, I believe that a full day of backpack hiking wold get you from Cradle Brook to Goose River, at the National Park's boundary. Two options from there would be to ford the river and continue the 9K to finish the Goose River Trail within the National Park, or to take the \"White Car\" spur trail (Spur trails are flagged by yellow blazes) which takes you to a secondary fire road.\nThere are groups who provide shuttle, lodging and to some degree, support services for the fundy trail. The original creater of the path, a man by the name of Alonzo Leger can be reached at (506) 386-2867 or via email at leger@nbnet.nb.ca\nShuttle services can made through:\nAdair's Wilderness Lodge Ltd. (506) 432-6687\nOther trails linked to the area, include the Dobson Trail, the Fundy Parkway, and the numerious routes associated with the Fundy national Park, all searchable via Google, and maybe by next summer, here on Trailpeak.com.\nShannon Burt",
    "directions": "From St. Martins, look for signage to the Fundy Parkway.\nFrom The Fundy National Park, start on the Goose River Trail.",
    "geohash": "f81",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NB/1399/reg_IMGP5436-19416.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/1399/reg_IMGP5439-19416.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/1399/reg_IMGP5465-19416.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/1399/reg_cradlebrook.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/1399/reg_crossbrook.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/1399/reg_whitecar.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/1399/reg_woods.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/1399/narrow_bigrock.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/fundy-foot-path-near-st-martins-nb-1399",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 5,
        "Time": "21 hrs",
        "Total Distance": "42 km",
        "Town": "St. Martins, NB",
        "Type": "out-and-back"
    },
    "title": "Fundy Foot Path",
    "trail_id": "1399"
}