{
    "description": "Moose Mountain is named after the shape of the double hump that resembles that of a moose's back. I have no idea how this \"bump\" of a mountain was formed, but given the flatter areas around, it's a guess that it could be an old volcano cone. It really stands out topographically. It's mixed forest makes for a beautiful autumn hike, and ease of access make it a fun locale for an afternoon go on snowshoes. On this occasion, we wanted to test the winter gear and spend the night. It was our first winter camping experience.\nThe best route up the slope is to follow the logging roads that spiral its sides. The trail head starts at the private home of the Maybee's. When they saw us hauling out the big packs and snowshoes from the car, they wished us the best of luck, but wondered why we'd ever want to spend the night outside in the middle of winter.\nWe had hiked the mountain the autumn before so, we knew the basics of the route. we never did hit the true top until this time around. It took about an hour and a half of snowshoeing to reach it. The last portion had a truly steep incline that was quite a challenge on snowshoes. Somehow, we managed. Going back down, later on, was a lot of fun.\nWhen we topped out, we found a great little flat spot that would fit our tent. We trampled down a foot print crater for the ground sheet and set up camp for the night.\nThat night it went down to minus seven degrees C, yet it was around ten degrees in the tent before we tucked into our sleeping bags. I guess the small space being heated by two bodies made all the difference. Little wind either.\nThat night it snowed, and we slept soundly. It was great to awake to fresh snow on the tent, and the stove frozen to the ground. Nothing like fresh hot coffee in the chilly alpine air.\nThe return home went very fast, and we were back in the car in no time. When you're going downhill in snowshoes, you just fly. Soon enough we made it back for a home cooked lunch at the in-laws.",
    "directions": "Head to Florenceville, and look for the mountain.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NB/1401/reg_2ovusjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/1401/reg_moosemtn.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/1401/reg_snowdayjpg.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/moose-mountain-near-bath-nb-1401",
    "stats": {
        "Activities": "snowshoe hike mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "3 hrs",
        "Total Distance": "3 km",
        "Town": "Bath, NB",
        "Type": "out-and-back"
    },
    "title": "Moose Mountain",
    "trail_id": "1401"
}