{
    "description": "FRANCAIS(english follows)\r\nC'est un sentier magnifique qui n'est pas très fréquenté. La poudreuse est au rendez-vous! On est entouré de montagnes, de cascades de glace. Sur le chemin on croise un lac en altitude, pour aller au point culminant de la montagne du Dôme un sommet rocheux et dégarni. Très beau, attention la descente se fait dans un ruisseau et il y a quelques point d'eau non gelé sur le sentier...\r\n\r\nENGLISH\r\nThis is a magnificent trail that is not really known. There is a lot of snow to be expected! You will be surrounded with mountains and frozen streams. On the road, you will come accross a lake then you will reach the summit: a dismantled rock dome. Very beautiful. Watch out on your way down as the exit is done along a not so frozen stream...\r\n\r",
    "directions": "FRANCAISDe Québec prendre la 175 nord jusqu'a La Malbaie puis prendre la 361 jusque dans le parc des grands Jardins à l'arrivée dans les montagnes, portez votre attention sur un stationnement à gauche. Immédiatement après, vous trouverez un petit stationnement à droite.\r\n\r\nENGLISH\r\nFrom Quebec city, take the 175 north until you reach La Malbaie. Then take the 361 until you get to the Parc des Grands Jardins. Once you get in the mountains, keep your attention for a parking on your left, the small parking for le Dome is after that on your right.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/QC/1405/long_topdome.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/1405/reg_dome2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/1405/topo_ledome.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/le-dome-near-quebec-pq-1405",
    "stats": {
        "Activities": "climb snowshoe hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "4 hrs",
        "Total Distance": "8 km",
        "Town": "Quebec, PQ",
        "Type": "out-and-back"
    },
    "title": "Le Dome",
    "trail_id": "1405"
}