{
    "description": "The Della Falls Trail near Port Alberni leads hikers from the head of Great Central Lake to the base of the highest waterfall in Canada (440 metres high, 1443 feet), a cascade from Della Lake. \nThis 16 km trail, by way of Drinkwater Creek, is a long hike taking about 7 hours one way, and suitable for intermediate level hikers. The trail was originally built by a trapper, Joe Drinkwater, who also started the Ark Resort. Della Falls is named after his wife.\nThe trail starts at the lake head's eastern shore at the north western end of the lake.  BC Parks has developed a camp ground with a bear-proof cache and a pit toilet. Along the trail, all the suspension bridges have been replaced with timber bridges. Much of the 16 km trail follows an old roadbed left behind from logging and mining early in this century. The first 7 km follows a flat road bed through a mixed second growth forest to Margaret Creek. Once across the bridge at this creek the road bed continues through some old growth forest for 4 km, gently gaining elevation.\nEleven kilometres up the valley a new bridge over a nice gorge crosses Drinkwater Creek and from there the trail continues more roughly to a bridge at 12.5 km. Beyond this bridge the roughest section of the trail passes through a rock slide which pushes you close to the creek. Gaining elevation again, the road bed leads up to the Love Lake trail/Mount Septimus junction at about 15 km. The last kilometre to Della Falls emerges from open old growth forest into an avalanche run-out zone to the base of the falls. Camp fires are permitted, but discouraged.\nMap: NTS Map 92F5",
    "directions": "Great Central Lake is a 13 km drive west of Port Alberni on Highway 4. Continue on Great Central Lake Road for 8 Km (don't make the mistake of turning towards Sproat Lake) 20 minutes later, around 1km past the  Creek Hatchery, you'll arrive at Ark Resort, where you can park (for a fee) and take their water taxi service to the Della Falls Trail head. \nThe trip will need 3 to 4 days if you're crossing the Great Central Lake by powerboat, and six or more days if you're crossing by canoe.\nThe Della Falls trail is recommended from late June until mid-September.  Any earlier, and you can find yourself hiking through deep snow, and crossing numerous avalanche run-out zones, though the higher water levels associated with the spring melt can make for spectacular viewing of Canada's highest single drop water fall.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/1441/narrow_dellafalls14jpg.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/della-falls-near-port-alberni-bc-1441",
    "stats": {
        "Activities": "river-kayak river-canoe hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 3,
        "Time": "21 hrs",
        "Total Distance": "32 km",
        "Town": "Port Alberni, BC",
        "Type": "out-and-back"
    },
    "title": "Della Falls",
    "trail_id": "1441"
}