{
    "description": "NTS Map: 082J14Starting from the *very* popular Ribbon Creek, this trail was a pleasant surprise.  On a nice Sunday afternoon, all the other people in the parking lot must have taken the Evan Thomas or Ribbon Creek trails, this one was nearly empty.  Got lucky with the wax choice and application area, nailed it perfectly first try.If you're more adventurous then us (hey, be nice!  it was our first ski of the season, maybe 2 seasons), there are at least three other trails starting from the same parking lot (the full Hidden Trail, Evan Thomas, Ribbon Creek + variations) and you can do two or more on the same trip.The main drawback to this trail is it is pretty much all up or all down.  It is 95% up on the way out, but reasonably gentle, nothing a few herringbones won't fix.Generally it is all out & back, you can make a couple mini-loops if you want some fresh.  In the waypoints, Y02a joins up with Y02 and Y01 joins up with the Nakiska Boundry near the Cabin.  (NOTE:  Cabin - term used loosely).  With some more serious off-roading, you should be able to connect up to the Ribbon Creek trail BUT I DIDN'T TRY THIS so you're on your own.",
    "directions": "West of Calgary on #1 to hiway 40 (Nakiska / Kananaskis Village).  South for 23 km to the K-co village road where  you turn right.  2km in to the Ribbon Creek parking area.  Start on Hidden Trail (trailhead on NE end of furthest west parking lot.  400m up at the first map (waypoint Map1), go left.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/1447/reg_facilitiesjpg_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1447/reg_trailstrjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1447/regskyjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1447/topo_coalmap1JPG.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/coal-mine-hidden-ribbon-creek-near-kananaskis-ab-1447",
    "stats": {
        "Activities": "snowshoe hike ski-xc mtn-bike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "7 km",
        "Town": "Kananaskis, AB",
        "Type": "out-and-back"
    },
    "title": "Coal Mine (Hidden) (Ribbon Creek)",
    "trail_id": "1447"
}