{
    "description": "Plateau Mountain stands out in my mind as one of the more memorable hikes I've done in the Canadian Rockies. There are cool views but what I found really interesting were the wildflowers and plants at the top (somewhat reminiscent of a tundra).   The top of the mountain is a large plateau (hence the name - duh!), covered with lichen-covered rocks. Heading across the plateau, there is a road of sorts made up of large rocks (very difficult to walk on) where lots of yellow flowers are growing. The sight will make you sing Â?follow the yellow brick road' in your head. Follow this road and there is a descendible-route back to the gas road at the base of plateau mountain.NTS Map: 082J01Elevation Gain: 527 m (1,729 ft).",
    "directions": "Forestry Trunk Road 940 at Wilkinson Summit (reference: Kananaskis Country Trail Guide, by Gillean Daffern). The first part of this hike follows an old gas road for 4 kms or so (mountain biking would be a good idea for the old gas road). The road ends at the base of a rather impressive looking ridge (see photo; this is Plateau Mountain). Some route finding required here - look for a path ascending up the right shoulder of the mountain. Some minor scrambling required.Information on the access point was referenced from: Kananaskis Country Trail Guide, Gillean Daffern. Rocky Mountain Books. Daffern's books are highly recommended if you are going to visit any part of K-Country!",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/1455/reg_mg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1455/reg_plateaumtn1jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1455/reg_plateaumtn2jpg_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1455/reg_plateaumtn3jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1455/reg_plateaumtnjpg.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/plateau-mountain-near-kananaskis-ab-1455",
    "stats": {
        "Activities": "hike mtn-bike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 4,
        "Time": "7 hrs",
        "Total Distance": "15 km",
        "Town": "Kananaskis, AB",
        "Type": "out-and-back"
    },
    "title": "Plateau Mountain",
    "trail_id": "1455"
}