{
    "description": "Elevation Gain: 569 m (1,867 ft)[Note: This trail is located in Glacier-Waterton International Peace Park, in Montana, about 45 minutes South of the Canadian border).\nThe trail passes a couple of ponds at the start and heads into the forest towards the hills. After about a half hour of level walking, there is an intersection (turn right; north), walking parallel with the mountains. After another hour of level walking, there is another intersection. Hang a left (west). This leads out of the forest and upwards towards the mountains. \nSoon you find yourself in a dry valley and the highpoint at the far end is Firebrand Pass.\nThere are climbable peaks on both sides of the pass (the one on the left is called Calf Robe Mountain) and the one on the right is possibly called Red Crow Mountain, although I am not certain! We deviated from the trail at this point and scrambled up the ridge to the right. It did not take long to reach the top of the ridge and we had our lunch with some great views to the North. We followed this ridge westward and dropped down to the Pass, then walked up the ridge on the other side of the valley (although we did not continue all the way up to the top of Calf Robe Mountain). Saw some bighorn sheep and enjoyed some interesting views.\nWe did this hike in mid July and there were still some patches of snow to traverse when we entered the main valley that makes up Firebrand Pass.",
    "directions": "Access: Drive 10.3 km down from the town of East Glacier and pull off at the unmarked turnoff onto a dirt road just past the marker for mile #203 (adjacent to the rail). Park your car here. Cross the train tracks on foot and look for the signed trailhead (access past a fence that delineates the park boundary).\nInformation on the access point was referenced from: Glacier-Waterton International Peace Park by Vicky Spring. Moutaineers Books. 2nd edition (2003)",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/MT/1456/reg_firebrandpass1jpg.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/1456/reg_firebrandpass2jpg.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/1456/reg_firebrandpass4jpg.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/1456/narrow_firebrandpass3jpg.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/firebrand-pass-montana-near-east-glacier-park-mt-1456",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 3,
        "Time": "7 hrs",
        "Total Distance": "15 km",
        "Town": "East Glacier Park, MT",
        "Type": "out-and-back"
    },
    "title": "Firebrand Pass (Montana)",
    "trail_id": "1456"
}