{
    "description": "This is an all season trail up Phelix Creek to the Brian Waddington Hut.   Good ski terrain and a plenty of material for many a day trip from a pretty little lakeside VOC cabin.\nThe trail was rebuilt in the summer of 2007 to stay on the west side of the creek.  This route offers better all season access and avoids the sometimes troublesome creek crossings of the previous route.  The trailhead location is the same, and the new trail should be obvious to anyone who is familiar with the old trail.\nFollow the logging road up Phelix Creek. The logging road starts on the west side of the Creek, crosses to the east side, and then forks.  Take the left fork and cross back to the west side where the road forks again.  This time, take the right fork.  Up to this point, the going is fairly easy, but there are deep water bars across the road from here to the final clear-cut.\nEventually the road peters out through a couple of cut blocks.  Once through the second cut block, cross avalanche slope pick up the marked trail heading north along the western bank of the creek.  The trail stays on the west side of the valley, climbing steeply in the western fork of the creek.  This section is pretty slow going, and even more interesting (steep tree skiing) on the way back, but after a few kilometres you reach a high valley and the first lake.  At the far end of the lake is a small VOC cabin, surrounded by the rocky bluffs of Mounts Gandalf, Aragorn, and Shadowfax. \n1:50,000 NTS Map: 092 J/10\nCabin (WGS84): UTM10 0522643E 5608795N\nCar Park: UTM10 0524800E 5601800N\nDifficult: Difficult B/C Ski trip.  Moderate Hike in summer.",
    "directions": "Head past Pemberton, and through the township of Mt Curry.  Continue straight at the junction towards the town of D'arcy.  Take the Blackwater Rd heading towards Birkenhead Lake.  You'll pass Blackwater Lake on your left, and then just before Birkenhead Lake, about 13km from the paved road, and  near the entrance to the Birkenhead Lake Provincial Park there bridge over Phelix Creek, and a logging road heading north along its western side.  The road is usually navigable to a plowed turnaround at this point all winter.\nCurrent Conditions:",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/1458/reg_AUT5717bJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1458/reg_AUT5725JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1458/reg_best3_AUT5718bJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1458/reg_hut-close-up-14243.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1458/reg_phelix-gandalf2-14243.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1458/topo_PhelixCreekMapgif.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1458/narrow_AUT5605rJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1458/narrow_atop-summit-14243.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/phelix-creek-near-pemberton-bc-1458",
    "stats": {
        "Activities": "snowshoe hike ski-bc",
        "From": "",
        "Seasons": "winter summer spring",
        "Stars": 4,
        "Time": "14 hrs",
        "Total Distance": "20 km",
        "Town": "Pemberton, BC",
        "Type": "out-and-back"
    },
    "title": "Phelix Creek",
    "trail_id": "1458"
}