{
    "description": "Elevation Gain: ~3,000 ft\nRising abruptly out of the prairie on the north east edge of Glacier National Park is Chief Mountain. While not one of Glacier's higher peaks, (9080'), it is a spectacular mountain nonetheless. Besides its obvious visual amenities, it holds considerable additional allure to those interested in the historical and cultural aspects of the area. \nChief Mountain is visible and easily distinguishable from most points in southern Alberta. As such it becomes one of those \"I've got to climb that one\" mountains. In years past and to some extent today, Blackfoot youths used to climb this mountain as a rite of passage into manhood, to fast and experience their 'vision quest'. We just wanted to climb it. \nThe trail is mostly of your own design, although in some places an actual trail does exist. Due to recent rock slides (the mountain is apparently very unstable), there is a lot of rubble to negotiate. The trail starts on the ridge just above and to the right of the camp ground where the short road ends. There is no trail head marker, but the trail is plainly visible. There are often prayer flags tied to trees along the trail. Be respectful of the traditions of others by not disturbing these flags. \nThe trail is narrow and well travelled here, but not very wide. It wanders down the ridge and up through dense trees for about 3/4 of a mile and then levels off into a sub-alpine area where there are some small till lakes. \nFrom here, the trail becomes a bit difficult to follow, due to a rock fall that caused a lot of destruction several years ago. The trail runs up through the open meadow along the right shoulder (north side) of the peak, and around to a large talus slope on the side opposite the trail head. Just keep the mountain on your left and stay low and you should be fine. For those that like to boulder hop, you can go higher, but be careful. \nThe hiker should work around the mountain to the top of the ridge which joins Chief Mountain to some smaller pointed peaks to the south. The trail up the scree slope begins at this point, straight up. \nThe next 300 to 400 yards is a scramble up through loose, softball sized rocks, to a large set of ledges. The ledges are a bit loose and require some handwork, but they are welcomed relief from the scree slope below. The climber moves up the ledges, to the left, through a wide, obvious route that leads to an area called the gap. The \"Gap\" is just what it sounds like, a gap or a saddle in the rocks where you can look down the east side of the peak toward the trail head. This area is fairly exposed and the wind can be quite strong. \nAfter moving through the gap, to the right, the climber needs to stay to the left and climb up through the rocks. The route moves up through some cliffs, around the east side of the peak. Ropes are not required for the ascent, but can be used for safety, to calm a concerned climber. The drop off is sharp and the ground is loose, so care must be taken. There are 2 Summits about 8 feet wide and usually windy. The views are spectacular of the Belly River Valley to the west, Swiftcurrent Valley to the south, and the prairies to the east. \nReturn the way you came. Although the scree was a pain going up, it makes for a quick, fun descent, just not long enough. \nPhotos courtesy of Wally Chinn and Chris Coffey.",
    "directions": "The trail head for the climb of Chief Mountain is located at a Native American camp ground near the base of the mountain. Travel on highway 89 about 4.5 miles north of Babb Montana and turn left on highway 12 (Chief Mountain Highway). At about 9 miles turn left on a dirt road (West). Alternately, travel south from the Chief Mt. border crossing to where you cross a cattle guard. The access road is soon after, on the right. There is a signboard referring to the camp ground (\"Non-tribal camping is prohibited\"). This road can be travelled by car if careful for about 3 miles to the camp ground. As the road enters the camping area a small road will turn up the hill to the right for about 100 yards to the trail head and parking spot back in the trees. This short road is VERY rough. Climbers in cars may want to park along side the road before entering the camping area. Remember, this is private property and care should be taken not to intrude in the camping area. \nThe Blackfeet require a permit ($10) to enter tribal lands, but we seem to have forgotten that part. It's up to you.",
    "geohash": "c2xn",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/MT/1465/long_TheGroup2.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/1465/reg_ChiefMountain-top.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/1465/reg_ChiefMtn01.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/1465/reg_ChiefMtn05.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/1465/reg_ChiefMtn06.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/1465/reg_ChiefMtnHike-05.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/1465/reg_ChiefTop1.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/1465/reg_DSC00249.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/1465/reg_chiefmt0009.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/1465/reg_chiefmt0010.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/1465/reg_topofchief3b.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/1465/narrow_ChiefMtn08.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/1465/narrow_DSC00246.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/1465/narrow_aaronskullantlersontopofchief.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/chief-mountain-near-babb-mt-1465",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "8 hrs",
        "Total Distance": "16 km",
        "Town": "Babb, MT",
        "Type": "out-and-back"
    },
    "title": "Chief Mountain",
    "trail_id": "1465"
}