{
    "description": "NTS Map: 082G01Elevation gain - 1300 m (4,270 ft).Alan Kane calls this 'easy with one moderate step'. Kane's route (from \"Scrambles in the Canadian Rockies\") follows the BC-AB boundary cutline, turning left at the boundary marker, up Forum Ridge. That route can be seen in the first photo, the ridgeline on the far right. Forum Peak, the east end of Akamina ridge is at the upper right of the photo. We decided to take an easier route, up from the back of Forum Lake. The trip starts and ends in Alberta, but the finest portion crosses into British Columbia. The ridge looks relatively flat when viewed from Wall Lake but it is deceptively unflat, with 3 pretty good bumps along its crest. Forum Peak, at the upper right corner of the rock wall at the end of Cameron Lake is the easterly end of the ridge. Impressive peaks in nearby Glacier Park, Montana. And, yes, we did meet a moose at Forum Peak. This ridge can be reached much easier by reversing these directions and going to Wall Lake first, follow the trail around the lake to the right, follow the trail to Bennett Pass up to the ridge. Going this way and back would be a very long day to do the entire ridge. Generally only part could be accomplished this way, but still spectacular views. (Editor's note - see also  Akamina Ridge - 2).(2nd Editor's note - Kane has withdrawn his original ascent route in favour of the one described here. This is because of too much deadfall along the route.)Note: This is a scramble. Be aware that scrambling can injure or kill you. Be prepared, know your limits and make sure somebody knows where you're going. Current conditions:",
    "directions": "Take the Akamina Parkway in Waterton Lakes National Park, to the Akamina Pass trailhead. Follow the trail to the Forum Lake trail, turning left. The trail leads up from Forum Lake to the ridge (signed). A bit of scrambling is involved near the top, but this is minor. Follow the ridge to the east for views of Cameron Lake and sign the register on Forum Peak. Then retrace your steps west and follow the ridge to the west end and drop down into Wall Lake and return to the trailhead from there. Trail is a 20km loop.",
    "geohash": "c2wy",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/1466/reg_Akamina-sm2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1466/reg_CameronLake.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1466/reg_akamina-from-carthew.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1466/reg_akamina03_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1466/reg_akamina04.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1466/reg_akamina05.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1466/reg_map.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1466/narrow_Akamina3-1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1466/narrow_Akamina5.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/akamina-ridge-near-waterton-park-gate-ab-1466",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 5,
        "Time": "10 hrs",
        "Total Distance": "20 km",
        "Town": "Waterton Park Gate, AB",
        "Type": "out-and-back"
    },
    "title": "Akamina Ridge",
    "trail_id": "1466"
}