{
    "description": "NTS Map: 082H04\nNote: time and distance are out and back. Elevation gain - 1070m (3,510 ft).\nThis trail in Waterton Lakes National Park is the first leg of the  Alderson-Carthew Trail. The trail begins at Cameron Lake. Turn left for the trailhead, across the footbridge. Follow the lakeshore and quickly enter a forest of towering spruce and fir. Soon the trail begins a series of four long switchbacks, each taking about 10 minutes. They allow an easy ascent of the steep forested slope. Catch glimpses of Cameron Lake and the rock and ice of Mount Custer and Forum Peak (see Akamina Ridge  trail) through the trees as you climb. \nAt 3 km, the switchbacks end and the next 1 km is largely level walking through meadows and open subalpine forest, with views ahead to Chapman Peak. At 4 km you reach Summit Lake, backed by Chapman and Custer to the south. At the trail junction turn left for Carthew and Alderson Lakes. \nClimb away from Summit Lake on a stony path of broken mauve rock, and the steady climb continues as you traverse a steep forested slope. You are heading for barren Carthew Ridge, directly ahead. Views south of Chapman and other peaks grow more and more impressive as you get higher and the trees become more stunted. \nAt 8 km, crest the ridge to stand atop 2,310 m Carthew Ridge. Look east over Carthew Lakes, flanked by Mounts Carthew (left) and Alderson (right), with a glimpse of flat prairie in the distance. To the south are the awesome lakes and mountain views that accompanied you up the scree. But the wind on the ridge can be fearsome and, if it is, even the fabulous views may not persuade you to linger up here for long. When the weather is good, follow the boot-beaten path along the ridge to a bluff for an even vaster panorama. \nFrom this point you can descend c.50m then ascend Mt Alderson or turn left and scramble up Mt. Carthew (the easier of the two). Head straight up the scree and angle right at a hole (small cave?) in the mountain. You will soon reach the ridge from which it is an easy climb to the summit (elev. 8,650'). \nImpressive views to the prairies (east) and into Montana (west). \nReturn the way you came or continue west along the ridge and drop down to meet the trail back to Summit Lake (a nice ridge walk). \nA third option is to continue the main trail east to the Alderson and Carthew Lakes and the on to Waterton townsite (12km). This option will require vehicle shuttling. \nNote: This is a scramble. Be aware that scrambling can injure or kill you. Be prepared, know your limits and make sure somebody knows where you're going.\nCurrent conditions:",
    "directions": "Cameron Lake, at the end of Akamina Parkway in Waterton Lakes National Park. A hiker shuttle runs to the trailhead from Waterton Park townsite ($8 per person)for those who wish to do the entire trail from Cameron Lake to Waterton. Buy tickets from the outdoor shop at Tamarack Village Square. The trail ends at Cameron Falls in the townsite.",
    "geohash": "c2wy",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/1473/long_CarthewPan.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1473/reg_Carthew1-1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1473/reg_Carthew2-1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1473/reg_Carthew41jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1473/reg_CarthewRidge.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1473/reg_CarthewRidge2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1473/reg_CarthewRidge3.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1473/reg_CarthewRidge4.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1473/reg_CarthewSummit.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1473/reg_Carthewjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1473/reg_MtAlderson.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1473/reg_map.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mt-carthew-near-waterton-park-gate-ab-1473",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 5,
        "Time": "8 hrs",
        "Total Distance": "20 km",
        "Town": "Waterton Park Gate, AB",
        "Type": "out-and-back"
    },
    "title": "Mt. Carthew",
    "trail_id": "1473"
}