{
    "description": "FRANCAIS (english follows)\r\nCe sentier s'effectue seulement l'hiver parce que l'on doit traverser des lacs gelés. Il faut prévoir environ 300 m de dénivelé par jour. Quand le sentier est tracé tous va bien mais si personne n'est passé avant vous soyez prêt à partir tôt. Une simple averse de neige et le sentier diparaît! Sur les lacs le vent souffle assez fort. Les différents points de vue du cap Ã?ternité vallent vraiment la peine. Les refuges accomodent 12 personnes alors apportez vos bouchons! Le luxe est au rendez-vous!\r\n\r\n\r\nENGLISH\r\nThis trail can only be done during winter because you need to cross several frozen lakes. You will face 300m of difference in height per day. When the trail has been traced, everything is fine but if no one has passed before you, consider waking up early as the snow is quite harsh. A simple drop of snow and the trail disappears! On the lakes, the wind blows quite strongly. The different views from Cap Ã?ternité are really worthy! The trail offers several refuge that can contain up to 12 person (bring your earplugs!) However, these feel pretty luxurious!\r\n\r",
    "directions": "\r\nFRANCAIS\r\nPrendre la 138 vers la Malbaie, puis la 170 vers Riviere Ã?ternité. Le stationnement se situe a 47 km de la 138. Vous devrez revenir sur le pouce ou prendre un taxi.\r\n\r\n\r\nENGLISH\r\nTake the 138 to la Malbaie then the 170 to Rivière Ã?ternité. The parking is located at 47km of the 138. Please note that you will need to hitchhike or to take a taxi to get back.\r\nwww.SEPAQ.com",
    "geohash": "f2w",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/QC/1486/reg_saguenaychicchocs006JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/1486/reg_saguenaychicchocs022JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/1486/reg_saguenaychicchocs031JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/1486/reg_saguenaychicchocs066JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/1486/reg_saguenaychicchocs075JPG.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/sentier-des-caps-du-saguenay-near-chicoutimi-pq-1486",
    "stats": {
        "Activities": "snowshoe hike",
        "From": "",
        "Seasons": "winter",
        "Stars": 4,
        "Time": "19 hrs",
        "Total Distance": "32 km",
        "Town": "Chicoutimi, PQ",
        "Type": "out-and-back"
    },
    "title": "Sentier des Caps du Saguenay",
    "trail_id": "1486"
}