{
    "description": "Mont Hog's back is a mountain in the Chic Choc Range \r\n\r\nGaspesie national park, Quebec. \r\n\r\nThe Hill that whipped our butts!\r\n\r\nWe were spending a few nights in the area, and wanted to explore a mountain with the Karhu Pyxis back country skis. Little did we know it was a telemark paradise!\r\n\r\nThe weather was approaching zero degrees, and the cloud level was pretty low, so visibility was not the greatest that day.  Plus, the snow under foot was beginning to break down, exposing rocks and earth in some places.\r\n\r\nWith the GPS running, we got the skins attached, signed in, and started up the trail. The path was like an old cart way with a 15 foot wide cut through the trees to guide us along. It forked a couple of times, and we found the route that got us toward the top.\r\n\r\nSome of the sections were really steep, and with only day packs, we were struggling to ascend. Other groups on the trail were snow shoeing up or using a telemark setup with heel risers to ease their way. I think snow shoes were the best way to go up.\r\n\r\nAt one point, it started snowing, and there was no visibility to speak of. We'd walk by a slope, and when we were right up along the edge, you realized that there was a drop off. It was then that we decided to stop for lunch under some sheltering trees.  from our vantage point, we saw the free heelers going up to the higher point, and watched some come down.\r\n\r\nThe photos pretty much tell the rest of the story. The people we encountered on the trail were very friendly.  \r\nGoing back down was a blast, though we weren't telemarking. \r\nThis is definately a place we will return to, and be more prepared for. the Chic Choc range has plenty to offer any skier.\r\n\r\nshannon Burt\r\ntrailpeak.com",
    "directions": "On the 299 highway that runs through the Gaspesie national Park. Mont Hog's Back is nestled among a group of peaks. A parking area is provided, and there is clear signage.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/QC/1487/reg_best1_hogsbackjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/1487/reg_hogsback3jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/1487/reg_skis.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/1487/reg_withskisjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/1487/topo_mont_hog_sback.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/1487/narrow_hogsback2jpg.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mont-hogs-back-gaspesie-quebec-near-matane-pq-1487",
    "stats": {
        "Activities": "snowshoe hike ski-downhill ski-bc mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "4 km",
        "Town": "Matane, PQ",
        "Type": "out-and-back"
    },
    "title": "Mont Hogs Back, Gaspesie, Quebec",
    "trail_id": "1487"
}