{
    "description": "Back in 1991, the winter Canada Games were hosted in PEI. That event brought forward the construction of Brookvale Ski Park, a Provincial Park in the central region of the province.\r\nThe construction created both an alpine ski center and a nordic ski center.\r\n\r\nBrookvale has 25.5 Kilometers of groomed recreational trails, along with 7.5 Kilometres of competitive trails and biatholn courses. The Nordic site provides a complete rental shop, lodge, biathlon range and toboggan hill. There are also heated wax huts and the latest in trail grooming equipment. Just over two kilometers of the trail is lit for nighttime skiing. A night skiing program is run once a week and visitors are more than welcome to join. There are a number of events throughout the winter including moonlight skiing, the Nordic Festival, school ski day races, and the annual Loppet. The \"loppet\" is one of the more popular events.  All these amenities makes Brookvale, PEI the destination of choice for x-country skiing in the Maritimes.\r\n\r\nthe following trails have been made on the site:\r\n\r\nCanada Games Maple Leaf Trail 7.5Km (black diamond)\r\nPaul's Plunge Loop 1.6 Km (black diamond)\r\nPlantation Trail 4.6Km (easy)\r\nHardwood Trail 4.3 Km (intermediate)\r\nBlue Rec Trail 4Km (easy)\r\nRed Rec Trail 4.3Km (intermediate)\r\nYellow Rec Trail 8Km (black diamond)\r",
    "directions": "From the Confederation Bridge, follow route #1 to Crapaud, and turn left to Route 13.  From Charlottetown, take Route #1 to North river, and turn right onto route #248. Immediately afterward, turn left onto route # 235. Continue for for about 15 minutes until you reach route #13. Within minutes, you will see the signs.\r",
    "geohash": "f84z",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/PE/1488/topo_brookvale1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/1488/topo_brookvalemapjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/1488/narrow_brookvale1.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/brookvale-nordic-park-near-charlottetown-pe-1488",
    "stats": {
        "Activities": "snowshoe hike ski-downhill ski-bc ski-xc",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "6 hrs",
        "Total Distance": "35 km",
        "Town": "Charlottetown, PE",
        "Type": "out-and-back"
    },
    "title": "Brookvale Nordic Park",
    "trail_id": "1488"
}