{
    "description": "On the schedule this time was a leisurely long weekend at my favorite place in the province-- Pollett's Cove. This was one of the few times we didn't have a plan or a timeline or a goal. We just wanted to get into the Cove and see where the coastal breeze takes us. \nNo matter how many times I've done it, or how prepared I think I am, there's something about the trail from Red River to Pollett's Cove that always poses a challenge. I think that first long, winding ascent (Heart Attack Hill) will always leave me gasping for breath and sweating so much I'd be embarassed if I were anywhere else at the time. \nBy the time I'd reached the top of hill, Kris and Matt S. were already forming a fair lead. I was in the middle of the pack, still sweating. The sun was beating down, and the day was steadily warming up. I reached Otter Brook in time to find Kris and Matt S. already starting on the next leg. I took the time to sit down and have a small drink. Eventually Dave, Sheena, and Matt M. caught up with me. This was fortunate as Dave quickly discovered I had torn a large hole in the left seat of my shorts. How embarassing! There I was flaunting my underwear to everybody! I quickly ducked behind a hill and changed into something a little more intact. \nThe next stretch of trail is somewhat easier, so I was cruising along at a good clip before I stopped for a little break. Dave and Sheena caught up and told me that Matt was starting to lag behind. They kept on and I waited for Matt. He had muscle pains in his leg and his discomfort was obvious. I followed behind him silently to make sure he would keep moving. I eventually lent him my walking stick as we made the initial descent towards the Cove. \nThat last hill before the Cove seems designed to slowly deliver the best view of the area as you approach. I was pleased to see that we were the first campers to arrive. It would later prove to be unusually quiet that weekend. Only 3 other parties were present in the Cove at any one time. As I made my way down the hill, I saw Kris and Matt S. make their way across the fragmented river. I stopped with Dave and Sheena at the base of the hill while we tried to decide where to camp. \nAfter some discussion and much dilly-dallying, we chose our site and pitched our tents. Then, in keeping with our long weekend philosophy, we did absolutely nothing. It was great. Except for the slowly developing sunburns we were all getting. We like camping out in the meadow for the views and the breeze, which keeps the bugs away. The downside is the complete lack of natural shade. The afternoon sun is oppressive. \nWe rode out the afternoon as Kris discovered some damage to his toes. In treating some blisters he somehow made it worse, as the area on his toe was now bright red and causing him pain when he walked around. \nThe next day Sheena, Dave, Matt S. and I decided to explore up the Pollett's River. I've been to the Cove several times and this was the first chance I had to finally explore this river. Kris could not join us since his toes caused him considerable pain. Matt M. also stayed behind since he doesn't enjoy water all that much. We marched upriver. We had to resign ourselves very early to the fact that we were going to get wet eventually. After you reach that conclusion any river becomes easy to hike. \nIt wasn't long before we happened upon a second meadow along the river's edge. This one was home to a moose-hunting cabin that was locked down pretty well. The meadow was covered in morning fog, but once in a while you could catch a glimpse of the mountains that loomed above us. This meadow used to be home to a few farming families, evidenced by outlines and foundations in the grass. I envied whoever those people must have been, to live and work every day in such a place as Pollett's Cove. \nA little snooping around revealed a footpath that went up a hill above the river. We followed this for some distance, anxious to see at least one moose. No such luck. The trail encountered a brook where we stopped for a break. The water looked inviting, until we tried to swim in it and my ankles went numb. \nWe followed the brook where it re-joined the Pollett's River and we continued on. Every stretch of the river was crystal clear and looked so inviting. We stopped for another break and tried to go swimming. Again to no avail. My skinny frame offers me no resistance to cold water. Dave, on the other hand, didn't hesitate to strip to his underwear and do a cannon-ball off a log. That image will haunt me forever. \nFrom here we only continued a little further. We knew it was a lofty goal to try to reach the end of the river. But, no worries, this was a leisurely weekend. C'est la vie. We felt like turning back so we did. On the return trip Matt S. and I walked in the river. It became a bit of a sport in the sections where the current picked up. Nobody was permitted to go any shallower than ankle-deep or fall in. I wagered whoever fell the most would treat the other to dinner, and then I fell in. Luckily Matt S. fell in too and we broke even. \nWe arrived back at camp at mid-afternoon with the sun finally beating off the fog. It became obvious we were going to have to build some kind of shelter from the sun. Dave engineered a hasty shelter and we all huddled underneath, keeping body parts within the shade. There was much goofing off. \nEventually I had enough of lying around and made an attempt to swim in the ocean. The water was cold, but tolerable if you kept moving. Sheena couldn't handle it for very long, but Matt S. stuck with me. We took some time to drift down the coast and explore the shore. It was some distance when we stumbled upon a waterfall emptying out onto the rocky shore. It was no great chute, but we felt proud to have found it. So much so that Matt S., who was wearing the proper footwear, scampered up the rockface. This part of the shore was lined with high cliff faces, but in no time Matt S. was at the top and signalling that would walk back to camp from up there. I wished him luck. The terrain there is steep and thick with trees. Plus he had no shirt on. Ah, the recklessness of youth. \nI walked back along the beach and Dave and Sheena looked at me puzzled. They saw me head out with Matt S. earlier. Well, I went up the hill where I expected him to come out, with his shirt and towel in my hand. Half an hour passed and still no sight of him. It should not have taken him so long. It was then that I saw him coming up behind me. He had scurried halfway up a mountain and come down on the other side! Ah, the recklessness of youth. \nWe sat down to a hearty supper and a quiet evening. The next day greeted us with still more sunlight. Dave, Matt S. and I decided to climb the bald mountain and maybe journey to a neighbouring peak along the coast. Everybody else stayed behind to devise ways to stay cool. \nThe trail up the mountain is challenging, but short. It only takes 45 minutes to reach the summit, but you'll be wheezing by the end of it. We reached the top and took a quick breather. Matt S. immediately found a discarded moose antler, which Dave decided would be a good thing to take back home with him. He tied it to his pack and we continued our exploration of the peak. There was still more uphill to be tackled, which we did. From there we tried to find some route to another nearby mountain peak, but the area was covered in thick, dead trees. They scraped against us painfully as we tried several times to poke our way through. \nRealizing it was going to be very difficult, we returned to the spot where the trail arrives at the mountain top. From here we followed a different ridgeline south and took in the view of the Blair River valley. After sitting for a break, it was somehow decided that we should just descend the mountain by the most direct route. The mountain summit is quite round, so that it was hard to see the base of the mountain from where we stood. Yeah, we're stupid. \nMatt S. bounded from rock to rock while Dave and I, both afraid of heights, held tightly to any grass or rocks that would tolerate our existence. The mountainside was terraced in just such a way that we would be able to reach the tree line and then have much more available to slow our fall. One mistake and we could have gotten down a lot faster. \nAfter we reached the tree line we swung from branch to branch like drunk monkeys. While we were now safe from any serious falls, it was still very steep and took some time to reach the very base of the mountain. But when we did we emerged in the other farm meadow and turned to behold the enormous slope we had just descended. Yeah, we're stupid. \nWith Dave's antler still intact we returned to camp by mid-afternoon to find the others cowering under the hot sun. We erected another sun shelter which Matt S. and I took full advantage of, taking long afternoon naps while the others went upriver to find someplace to cool off. By the time I awoke the clouds were starting to come in. The sun began to disappear periodically and it threatened to rain. We made supper as the wind picked up and the temperature dropped. By the time everybody was tucked in for bed the first bolts of lightning struck out over the ocean. The lightning and the obscured sunset combined to produce eerie orange flashes over the water, followed by very low rumbling. \nThat same storm eventually hit land and brought the rain with it. As I fell asleep I found it a fitting end to the weekend. \nIn the morning we packed up our damp things and started our trek back to the trailhead. Kris felt he had to hurry in order to make the most out of his injured toe before it complained too loudly. Kris, Matt S., and Matt M. left us behind fairly quickly. I was still on my leisurely weekend and was in no rush. The morning was hardly underway when we all caught up with Kris at the trailhead before tidying up and heading out, moose antler and all. \nFrom Matthew Hogg, halifax, NS\nGPS:\nPollett's Cove\n0675872E 5197949N\nEditor's Note:\nThe trail to Pollett's Cove is linear, and runs 7.25K along the coast. It can be done as a day hike there and back; probably 3 hours in and 2 hours back, but why would you do that and miss out in the experience of being there in such a peaceful setting? I suggest staying two nights, to give a day to explore.\nThe trail itself is strenuous in places due to the climbing, rocks, and some exposure along steep terracing, especially under a heavy pack. Saying that, it's a very well built trail that needs no markers. If you have a dog, you'll be happy to know that there are several opportunities for it and you to get fresh water.\nIf you are driving from any distance to do this hike, it certainly is worth it, but you can make the trip go further by visiting Cape Breton for three or four nights. Do two nights in Pollett's Cove, and then move on to Meat Cove to a drive-in base camp, and day hikes a plenty. We have some of those trails in our Trailpeak database.\nWe traveled from PEI, so our initial night was at Laurie's Motor Inn in Cheticamp, where we lucked in on a whale cruise. It gave a close up view of what we saw out in the water as we camped on the hills overlooking Pollett's Cove the next day.\n-Shannon Burt, East coast editor",
    "directions": "Head to Cape Breton, crossing the causeway, and take your shortest route to Cheticamp. Keep going toward the National Park, (no need to pay a fee) and keep driving toward Pleasant Bay. (You'll exit the park again) and look for Red River Road on the left. Follow the pavement, and keep going when it turns to dirt. Follow it past the monistary and shrine, until the road's end, at a small parking lot that barely fits 7 cars. The trail goes in starting with the width of an ATV trail. You pass a yellow cottage landmark. Soon the trail narrows.",
    "geohash": "f8kf",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/1496/long_polletts-elevation-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1496/reg_01.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1496/reg_02.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1496/reg_06.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1496/reg_09.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1496/reg_Cape-Breton-152-27121.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1496/reg_Cape-Breton-155-27121.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1496/reg_Cape-Breton-175-27121.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1496/reg_IMG-5185-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1496/reg_IMG-5218-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1496/reg_IMG-5221-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1496/reg_IMG-5268-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1496/reg_IMG-5304-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1496/reg_P8160063-22378.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1496/reg_P8160084-22378.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1496/reg_P8160109-22378.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1496/narrow_08.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1496/narrow_Cape-Breton-150-27121.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1496/narrow_otterbrook-6702.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/polletts-cove-near-cheticamp-ns-1496",
    "stats": {
        "Activities": "snowshoe hike ski-bc",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 5,
        "Time": "6 hrs",
        "Total Distance": "7 km",
        "Town": "Cheticamp, NS",
        "Type": "out-and-back"
    },
    "title": "Pollett's Cove",
    "trail_id": "1496"
}