{
    "description": "\"Eetwass varry cold lass night, ah?\" asks our neighbour in the adjacent campsite. In New Brunswick, you never know if the person you're talking with is going to answer in English or in French. People are truly bilingual in this province, and he politely accommodates me and my native tongue. \nIt certainly was a cold night. I had perhaps been a little too eager after such beautiful weather the day before. Overnight the temperature plummetted and this morning the overcast sky threatens today's hike. I patiently watch the sky as the trailers around us each fire up their noisy generators one by one, trying to recover from last night's chill. I did not drive all this way from Halifax just to be rained out, so with cautious optimism Angel and I pack up our gear for the day. \nFortunately, by the time we pull up to the trailhead the sun begins to poke through the clouds. Mount Sagamook looms directly above us, a wall of trees so close I have to crane my neck just to see the top. This hike is described as the most challenging in the park, and it's becoming obvious why. The trail ascends 777 metres to the summit in just one kilometreÂ? you do the math. The uphill climb forces Angel to catch her breath every couple of minutes, but I let her lead and patiently wait for her to press on. \nWe pass a few people on the trail as they sit down for a break and after what seems like an endless series of switchbacks, the trees begin to thin out somewhat. Our view of the surrounding area improves with every footstep. The trail starts to wander over tumbled boulders, marked with spraypaint to show the way. Definitely a hazard for the ankles, making Angel hesitate. After a little prodding she leads the climb, boulder by boulder, until the view behind us opens up completely. \nThe clouds still haven't decided if they're coming or going, but the view is clear. Lakes Nictau and Little Nictau lie directly beneath us, and we're getting our first sight of the Appalachian mountain range that is characteristic of the region. The mountains are ancient: worn down and carpeted in trees. The landscape rolls into the distant haze, an undulating surface of trees scarred occasionally by logging activityÂ? both past and present. Impressive as this view is we still haven't reached the summit, so after we catch our breath we continue climbing. \nSoon after, the trail levels off and the trees close in again. The setting becomes surreal. A mound of rock rises above the trees, comprising the grand summit of Mount Sagamook. The hike this far has certainly been challenging, so I stop for a well-deserved snack. From our position we have a spectacular 360 degree view of endless rolling mountains. Only Mount Carleton itself is higher than us, now visible four kilometres to the south. I can see the fire tower perched on its rocky peak but borrow Angel's binoculars for closer inspection. In between us and that summit is Mount Head, sticking up in a halfhearted bid for attention. Somewhere down there is the Mount Head trail, which will take us from Sagamook to Carleton. \nGetting down off of Sagamook means scrambling over more rocky terrain, which Angel still doesn't enjoy. I take each step with care and eventually the trail bottoms out. Once we reenter the forest the trail is actually very level and our pace is a vast improvement over the sluggish climb up Sagamook. We soon pass the side trail to Mount Head, our eyes on a bigger prize today. Our progress is swift and soon the trail winds around the base of a rocky hilltop. Once we get halfway around it, I glance up and see the fire tower looking back at me. It takes me by surprise, but I'm reinvigorated for the final climb to the peak. \nAfter yet another sprint through a field of boulders, we arrive at the summit of Mount Carleton. The wind is blowing, but the sun has finally come out for good. I know it's a fairly arbitrary designation but here we were standing 820 metres above sea level, the highest point in the Maritimes. Arbitrary or not, I feel as if some sort of goal has been achieved. At any rate, it's a milestone for today's hike. The view from the tower (used by fire rangers until the 1960's) is indeed like no other in the Maritimes. No other mountain I've ever hiked can compare to this elevation, and the panorama is appropriate for such a distinction. It's one of those spectacular scenes that looks so incredible you think it must be fake. The stiff breeze, however, reminds me that this is very real. \nAngel is resting her back and stretching her legs. I've really given her workout that she hasn't been used to for some time. I take my boots off to give my feet a quick rubdown, putting them back on before I get too comfortable. We still have some distance to cover if we want to get off this mountain. \nRetracing our precarious steps down the rocks we rejoin the trail below, following a relatively easy cart track down the mountain. The descent is gradual and a pleasant way to finish off our trek. We stop to investigate the old fire rangers' cabin on the way, and have a friendly chat with a man from Bathurst on his way up. The rest of the descent is a leisurely stroll when compared to the gruelling route up Mount Sagamook. As we approach the trailhead at the bottom, we encounter more people starting their climb. Lying in the grass here and resting my feet would be a nice way to end our hike, but we still have a long slog down the road before we reach the car. \nThe sun is oppressive, and the long walk is anticlimactic. We're making progress, albeit somewhat unenthusiastically. After a couple hours of this, my pace is slowing and my feet ache. Angel and I hear a car rumbling in the distance behind us, and I stick out my thumb halfheartedly. The car slows down but I really don't think they're going to stop. Fortunately for us, they're good Samaritans. Our hero does come to a stop and generously rearranges the cargo in their backseat to make room for us. We chat with the friendly couple for a few minutes and before we know it we're dropped off within ten minutes of our car. \nHaving renewed energy, we walk the final kilometre back to the Mount Sagamook trailhead and with a celebratory kiss our hike is over. \nBack at camp we treat ourselves to a gluttonous meal and stay off of our feet as much as possible. That night the commotion of generators and jovial Acadians envelopes me as I bend over, washing traces of the hike from my face. The sights and sounds of long-weekend festivities crowd my mind, until I look up and see Mount Sagamook in the distance, bathed in the rosy light of the setting sun. \nMatthew Hogg\n(used with permission)\nMount Sagamook - 0660283E 5252498N\n\tMount Carleton, highest point in the Maritimes (820m) - 0660307E 5249147N\n\tTrailhead (Mount Sagamook) - 0660567E 5253572N\n\tTrailhead (Mount Carleton) - 0658528E 5246169N",
    "directions": "The provincil park is located 40 Km east of St. Quentin, on Highway # 180",
    "geohash": "f82m",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NB/1498/reg_01jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/1498/reg_04jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/1498/reg_080jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/1498/reg_08jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/1498/reg_10jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/1498/reg_Mount-Carleton-039-27121.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/1498/reg_Mount-Carleton-043-27121.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/1498/reg_Mount-Carleton-047-27121.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/1498/reg_Mount-Carleton-049-27121.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/1498/reg_Mount-Carleton-054-27121.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/1498/reg_Mount-Carleton-062-27121.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/1498/reg_Mount-Carleton-073-27121.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/1498/reg_Mount-Carleton-075-27121.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/1498/reg_Mount-Carleton-081-27121.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/1498/reg_Mt-Carleton-6702.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mount-carleton-nb-near-saint-quentin-nb-1498",
    "stats": {
        "Activities": "snowshoe hike",
        "From": "",
        "Seasons": "winter fall summer",
        "Stars": 5,
        "Time": "5 hrs",
        "Total Distance": "7 km",
        "Town": "Saint-Quentin, NB",
        "Type": "out-and-back"
    },
    "title": "Mount Carleton, NB",
    "trail_id": "1498"
}