{
    "description": "Woodville Hiking Trail\r\nWoodville sits in the shadow of North Mountain in the Annapolis Valley. The local trail system here is a series of old, intersecting logging roads scattered all over the mountain. After some difficulty identifying the correct rural road, we find the Burgess Road trailhead marked with a simple sign and some snowmobile tracks. \r\n\r\nThe snow on the trail is deep in places but well-packed by any snowmobiles that've come before us. The first thing I notice is the abundance of animal tracks left in the snow. Everywhere we look we find bird, rabbit and deer tracks criss-crossing our path. Occassionally Kris can't help but stop and flesh out the history of a certain set of tracks he sees. Indeed, it's exciting to see so much evidence that wildlife can thrive while bounded on all sides by human settlement. \r\n\r\nEspecially considering the small area this trail system actually covers. In the blink of an eye we arrive at the look-off of the aptly named Look Off Trail. We have a wide view looking south towards the Annapolis Valley, perched high above farmland and apple orchards. The sky is clear and the sunlight is blinding as it reflects off of the snow-covered landscape. I rub my eyes and take a few pictures before we continue on our way. \r\n\r\nWe don't spend long on the Indian Trail before we end up back on the Main Trail heading west. The trail wanders through some quiet forest before intersecting with a wide road running south. We're excited to discover the waterfall down a short spur trail. Unfortunately winter is in full swing and the waterfall is just one large blob of ice covered in snow. While Kris makes his way downhill to take some pictures, I explore up above. I rethink my steps once I notice the faint babbling of water underneath me. It appears not all the water has frozen over... \r\n\r\nThe road continues south until we reach a quarry and some private land. Here we find the trailhead for the Lower Trail, which hugs the base of the mountain as you stroll through the open fields of a local orchard. The trees are gnarled and barren but for a few well-seasoned shriveled apples. The snow in the open field shines like glass, even while I'm wearing my sunglasses. Unfortunately any sign of the trail has also disappeared. It's quite possible that no one has been through here since the snow fell. Rather than fumble around in the woods looking for the right way we opt to double back up the mountain following the Indian Trail. \r\n\r\nThe trail leads straight up the mountainside and takes my breath away. Luckily the shortness of breath doesn't last long and before we know it we're back on top again. We head north once more, this time following the Cabin Trail. Somewhere at the end of this trail is a log cabin but it proves difficult to find. This area has been thinned out from logging in the past and covered with cart tracks heading off in multiple directions. We encounter several confusing intersections made harder to interpret with all the snow cover. Eventually we unexpectedly emerge from the woods and stumble onto Burgess Road about a kilometre north of where we parked. How embarassing. \r\n\r\nWoodville is a great place to go for a leisurely hike. The trail system covers a small area and offers many route choices. Your hike can be as short or as long as you like. The landscape is remarkably diverse given its size, but is representative of the beauty to be found in the Annapolis Valley. \r\n\r\nUsed with Permission by Matthew Hogg\r\n\r\nWoodville Hiking Trail Descriptions\r\nTrailhead (Burgess Road) - 0369682E 4998685N\r\nTrailhead (Quarry) - 0368703E 4997891N\r\n\r\nThe community of Woodville, has planned and marked a series of hiking trails on private property. These trails take the hiker underneath the escarpment of the North Mountain, up the Mountain and through the woods on top of the Mountain. The trails are signed at the the major entry and turn points but it is recommended that you have a map and compass with you if you are not familiar with the area. This area has many woods roads that are not part of the trail system.\r\n\r\nVehicles sometimes use some of the woods roads in this area with includes part of the trail system. Some of the trails such as the Indian Trail and the Look Off trail are not suitble for vehicle use and we would ask that ATV's and trail bikes not use them. ATVs damage the trail and create excessive erosion when the trails are wet.\r\n\r\nTrail Descriptions\r\nMain Trail (gray) \r\nThis trail is the longest and gives access to the other trails. It can be approached from on top of the North Mountain off Burgess Road or from below the mountain beside the old stone quarry at the end of the road branching to the north from Arnold Road (Arnold road parallels the North Mountain and starts at the bend of the road as you travel north on Bligh Road from Kinsman's Corners) . The western end of the trail climbs the mountain behind the buildings at the end of the road. The east end of the trail starts in the Lacey's tree farm. \r\nThe Main Trail is reasonably level except on the west end where it rises from the Annapolis Valley. At that end it provides access to the Waterfalls and a look off to the Valley over the nearby stone quarry. Access to the southern end of the Cabin Trail is from this trail.\r\n\r\n\r\nLower Trail (green) \r\nThis trail also begins and ends at the same places as the Main Trail but most of its length is on the slopes below the Mountain. This is the most strenuous hike of the trails due to its length and changes in elevations. At its lowest point the elevation is 60 metres while its highest is 195 metres. This climb of 135 m (442 ft) takes place in the distance of a kilometre.\r\nAccess at the western end is from the grassy parking area below the end of the road where the Main and Indian trails start. You cross the stream then just as the Indian trail heads up the Mountian, the Lower Trail heads up and over the open field and enters the woods on the other side. The western access is either from Burgess Road directly (it is only a few feet from the west side of the road on the way up to the Main trail entrance. Or, you can use the Main trail get to the trail near the intersection with the Look Off Trail. The advantage of this access is that there is better parking off the road on the Main Trail. \r\n\r\n\r\nIndian Trail (red) \r\nThis is a short steep trail up the mountain from the trail head below the old stone quarry. It ends on the Main Trail and provides access to the Look Off Trail. This trail rises 80 m (263 ft) in its 1 km length. It is rough and rocky in sections and prone to erosion so vehicles should not be on this trail. \r\n\r\nLook Off Trail (darker blue) \r\nThis 1.2 km trail follows the edge of the mountain and takes a hiker from the Main Trail to the Indian Trail. This trail provides the shortest access to the Look Off from the tree farm on Burgess Road. Along its western sections, the path is soft and wet during rainy seasons so wear good boots. Vehicles should not be used on this trail. About half-way along the trail there is a short side trail that leads to a picnic table and scenic lookout over the Annapolis Valley and the Woodville Community along Bligh Road. \r\n\r\nLog Cabin Trail (lighter blue) \r\nThere is access to this trail from Hiltz Road (at the northern end of Burgess Road) but is not marked. At the dip in Hiltz Road there is a break in the aalders where the trail gives access to a trail around the east end of the small pond. This trail is wet at times so good boots should be worn. The trail really starts at the intersection of several trails or roads near the private log building at the south end of the pond. From here travel west carefully watching your turns. This trail uses several woods roads and you must turn off on to other ones to get to the Main Trail to the South. This area of the North Mountain has been heavily cut in the recent past and there are large open areas. The southern end of this trail is marked with a sign on the Main Trail. \r\n\r\nRoad to Cabin (black) \r\nThis is not really part of the trail system but can be used by anyone using the Cabin Trail to get to Burgess Road for a walk back to the trail head at the Tree Farm. \r\n\r\n\r\n--------------------------------------------------------------------------------\r\n\r\nLoop Hikes: As you can see from the map, there are many different round trip hikes possible without retracing your steps.\r\n\r\nFrom the West Access Point (listed from shortest to longest)\r\n\r\nLower Trail to Look Off Trail returning via the Indian Trail. \r\nIndian Trail to the Main Trail back down the Mountain. \r\nLower Trail to the Main Trail and back down the Mountain. \r\nMain Trail up the Mountain to the Cabin Trail then out to Burgess Road back to the Main trail at the tree farm access and take either the Lower Trail or the Look Off and Indian Trails to the staring point. \r\nFrom the East Access Point \r\nFollow the Look Off Trail to the Indian Trail to go up to the Main Trail and back. Stop at the Look Off. \r\nGo down the Lower Trail then back up the Mountain on the Indian Trail and return via either the Look Off Trail or Main Trail. \r\nTake the Main Trail across the Mountain down to the western trail head and then use the Lower Trail return to the tree farm access. \r\nUse the Main Trail to get to the Cabin Trail which will take you to the pond near the log building where you can use the access road to get back to Burgess Road and walk along it to the tree farm access. \r",
    "directions": "see maps",
    "geohash": null,
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/1502/reg_05jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1502/reg_06jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1502/reg_best1_03jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1502/topo_Trailgraphicsgif.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1502/narrow_tn01jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1502/narrow_tn_01.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/woodville-trail-near-kentville-ns-1502",
    "stats": {
        "Activities": "snowshoe hike ski-xc mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 5,
        "Time": "5 hrs",
        "Total Distance": "12 km",
        "Town": "Kentville, NS",
        "Type": "out-and-back"
    },
    "title": "Woodville trail",
    "trail_id": "1502"
}