{
    "description": "Français\r\nTrès beau sentier traversant la montagne.  Plusieures possibilités de circuits, allant de la randonnée d'un jour a l'expédition de deux,  trois ou quatre jours (en hivers seulement).  Nous avons choisi de traverser la montagne du Nord au Sud en raquette, en trois journées facile, en passant dans la Vallée des Fantômes (par temps propice, la vallée abrite des silhouettes fantomatiques des arbres recouverts d'une épaisse couche de neige). La navette du parc nous a reconduit au départ du sentier, au nord du parc.  \r\nNotre première journée, très facile somme toute, consistait à se rendre a la tente prospecteur Le Fantôme, a 2 Km du départ.  Après un dîner près du poêle,  nous avons rechaussé nos raquettes pour aller explorer le Pic Dubuc, le point le plus haut des Monts-Valin (980m), à environ 1 Km  du refuge. Jour 1 : 4 Km.\r\nJour 2 : Départ du refuge Le Fantôme pour se rendre a la tente prospecteur Le Nelligan, à 7 Km. Sentier très bien balisé, paysages feutrés et féeriques.  Après une bonne collation au refuge,  les braves enfourchèrent de nouveau leur raquettes pour aller explorer le Pic de la Hutte, a 1.5 Km de l'abri.  Nombreux belvédères à visiter.  Jour 2 : 9 Km.\r\nJour 3 : Retour vers la civilisation. Plusieurs sentiers sont croisés mais nous optons toujours pour celui qui nous ramènera à l'accueil.  Chemin faisant, nous passons sur (ou près) le Pic du Grand corbeau, les 3 points de vue de la Tête de Chien et par le point de vue sur le Lac aux Pères.  Une randonnée toute en descente. Jour 3 : 7Km.\r\nKm Total : 20Km\r\n\r\nEnglish\r\nBeautiful trail through the mountain. Many possibilities of loops and circuits, from day hikes to overnight backpacking trips (during wintertime only). We decided to snowshoe across the mountain in 3 easy days, from north to south, passing through Fantom Valley (when the weather is right, the valley shelters ghost-like silhouettes covered in a thick layer of snow).  The snowcoach took us the trailhead, north of the park.\r\nOur first day was an easy one: 2 Km to Le Fantôme shelter, where we lunched, close to the woodstove.  We then hiked 1 Km to the summit of Monts-Valin: Pic Dubuc at 980m. Day 1: 4 Km\r\nDay 2: Leaving Le Fantôme for Le Nelligan shelter at 7 Km.  Snowshoeing on a well blazed trail through almost magical scenery.  After a nice snack at the shelter, those brave enough to get out in the cold hiked to the Pic de la Hutte, at 1.5 Km of the shelter.  Day 2: 9 Km.\r\nDay 3: Back to civilisation (and a hot shower) and its all downhill from here.  The trail passes several overlooks: Pic du Grand Corbeau, the 3 overlooks of  Le Pic de la Tête de Chien, and Lac des Pères. Day 3 : 7 Km\r\nGrand total : 20 Km \r",
    "directions": "Le parc est situé à 30 km de Chicoutimi, sur la rive nord du fjord. De Saint-Fulgence, prendre la route 172 Est (Tadoussac) sur 13 km, puis emprunter le rang Saint-Louis à Saint-Fulgence sur 17 km\r\n\r\nDe Montréal, prendre l'autoroute 40 jusqu'à Québec. Puis, à partir de Québec, emprunter la route 175 Nord jusqu'à Chicoutimi. Traverser le pont Dubuc pour vous rendre au secteur Nord et suivre les indications pour emprunter la route 172 Est, direction Tadoussac. Au village de Saint-Fulgence, à 10 km de Chicoutimi, prendre la rue Saguenay puis emprunter le rang Saint-Louis sur 17 km.\r\nThe park is located 30 km from Chicoutimi, on the north shore of the fjord. From Saint-Fulgence, take Route 172 Est (Tadoussac) for 13 km, then take Rang Saint-Louis in Saint-Fulgence for 17 km\r\n\r\nwww.SEPAQ.com",
    "geohash": "f2ts",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/QC/1504/reg_Val0046JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/1504/reg_Val0072JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/1504/reg_Val0104JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/1504/narrow_Val0010jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/1504/narrow_Val0100JPG.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/traversee-monts-valin-traverse-near-chicoutimi-pq-1504",
    "stats": {
        "Activities": "snowshoe hike ski-xc",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "21 hrs",
        "Total Distance": "0 km",
        "Town": "Chicoutimi, PQ",
        "Type": "out-and-back"
    },
    "title": "Traversée Monts-Valin Traverse",
    "trail_id": "1504"
}