{
    "description": "This is a lovely, gentle rolling loop trail that follows a network of roads and trails on the east bank of Christina Creek. The trail starts at the small access road, then drops down the bank towards the creek. It then follows the left bank of the creek, rolling through an open fir and pine forest. In places, the trail dips close to the creek allowing access to sunny sandbars and inviting pools. Across the creek the sounds of civilization slowly drop away. The trail follows a short piece of road for a time, then continues onto a flat wetland area frequented by waterfowl and beavers.This is an easy trail suitable for almost all ages and abilities. Although the trail is most frequently used by hikers, it is also used by mountain bikers and horseback riders. Most of the trail is soft and sandy, so watch your step. Poison ivy grows in patches along the creek, so keep your eyes open!",
    "directions": "From the bridge on hwy 3, in the town of Christina Lake, head northeast and look for the first road on the right, just a few metres past the bridge. Turn right onto this road, then look for the white trailhead sign immediately on the right. You can leave your vehicle here on the side of the road, or turn right and drive approx. 50 m up this small sandy road to a parking area in an excavated area. The trail starts on the right just a few metres before the parking area.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/151/reg_DSC00280-7279.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/151/reg_DSC00282-7279.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/151/reg_DSC00283-7279.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/151/reg_DSC00284-7279.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/151/Christina Crest Trail Map.JPG"
    ],
    "source_url": "https://trailpeak.com/trails/christina-creek-trail-near-grand-forks-bc-151",
    "stats": {
        "Activities": "hike mtn-bike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "3 km",
        "Town": "Grand Forks, BC",
        "Type": "out-and-back"
    },
    "title": "Christina Creek Trail",
    "trail_id": "151"
}