{
    "description": "NTS Map:92B11.  Rithet's Bog is the last of seven large bogs on the Saanich Peninsula. Many generations of the Tsawout people of Saanich traveled yearly to the bog to harvest bog cranberries, Labrador tea and Sphagnum moss, and to hunt ducks and game.\r\n\r\nThe 42-hectare Nature Sanctuary, named for R. P. Rithet who farmed this area, was donated to the people of Saanich by the Guinness family in 1994. It was previously drained for agricultural use, but is now being conserved and restored to optimize its biodiversity and recognize its heritage value for the benefit of present and future generations.\r\n\r\nRithet's Bog supports a rare forested bog community and provides a wide range of habitat for a number of rare plants and animals. People benefit from this quiet, green haven in the midst of a developed area. Thousands from all over Victoria walk the 2.8 km bog trail to enjoy the wildlife and reconnect with nature. Rithet's Bog is an asset to the entire community. \r\n\r\nRithet's Bog is part of the Colquitz Creek system. It is a fragile environment and its health depends upon the quality of runoff water from surrounding urban areas. The restoration and management of Rithet's Bog is a conservation partnership among the Corporation of the District of Saanich, Rithet's Bog Conservation Society, the Habitat Conservation Trust Fund, Fisheries and Oceans Canada, and Ducks Unlimited Canada.\r",
    "directions": "http://www.gov.saanich.bc.ca/resident/parks/pdfs/broadmead.pdf",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/1512/reg_Bogjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1512/reg_Ducksjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1512/narrow_Deerjpg.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/rithet-bog-park-near-victoria-bc-1512",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "0 km",
        "Town": "Victoria, BC",
        "Type": "out-and-back"
    },
    "title": "Rithet Bog Park",
    "trail_id": "1512"
}