{
    "description": "I had a couple free days in Saskatchewan so I threw my XCskis in the truck {insert SK downhill skiing joke here}.  I was killing time and saw the signs to Fort Carlson National Historic Site north of Saskatoon and started driving towards it.  At the last turn something funny happened to the provincial secondary highway.... it disappeared under 2 feet of snow about 2km from the Fort.  Apparently it's closed all winter.  But every door has a window of opportunity and not being a real experienced XC skier, I though it looked like it would make a good little ski down to the fort.\nA foot of pow, beautiful blue skies, and -15 warmed up to -8, not bad.  I can't say it was real silent, by the sound of it about 30 snowmobilers also thought it was a good day to be outside.  5 crossed the ski path and all gave a friendly wave.\nI tried to take a shortcut but found a fully treed ravine in my way so had to backtrack a bit.  Then I saw another 'shortcut' through the ravine.  The ski down to the bottom was OK, but the deep snow prevented me from planeing on my skinny, skinny skis, so even down a 5% grade there was no cruising.  Then there were the trees and colapseing snow at the bottom that left me turtled in 12\" of snow.  Whups, no one knows where I am, I'd better be able to get out of here.\nI found a lookout where the picture of the fort is taken, very scenic.  Probably doesn't look that different from when my great-great-uncle was here in 1882 as a NWMP constable (honest).\nPretty darn flat, only 50m difference on the enclosed track log.\nI didn't go all the way down, it was getting late but you can make this trip as long or short as you want.",
    "directions": "Take hiway 12 N of Saskatoon 40 km, go N onto Sec #312 for another 25km to Sec #683 where you go north again.  Going straight north on 683 for 22.5 km gets you to the end of the road and start of the skiing.  (WGS84 13U 399772 5858980)",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/SK/1513/reg_SKskiAltJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/SK/1513/reg_fortjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/SK/1513/reg_outjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/SK/1513/narrow_coyotiejpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/SK/1513/narrow_downjpg.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/fort-carlton-near-saskatoon-sk-1513",
    "stats": {
        "Activities": "hike ski-xc mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "7 km",
        "Town": "Saskatoon, SK",
        "Type": "out-and-back"
    },
    "title": "Fort Carlton",
    "trail_id": "1513"
}