{
    "description": "NTS Map: 083C13Elevation Gain: 1,380 m (4,526 ft).No Dogs: The Skyline Trail has been identified as critical Woodland Caribou habitat, a threatened Species-at-Risk in Canada. In an attempt to reduce stressors on this disappearing icon of the Canadian wilderness Parks Canada has banned dogs from all Caribou habitat in Jasper National Park.The Skyline Trail in is one of the premier backpacking trails in the Canadian Rockies and with 25kms of the trail at or above treeline it is easy to understand why. Can be hiked as a point to point backpack of 2-6 days or as a there and back again for a quick over-nighter. The trail is best hiked south to north from Maligne Lake, this way you avoid a long grunt up a fire road and start with a 600m elevation advantage. Be prepared for big climbs as you tackle three passes and cross the highest section of trail in Jasper Nat Pk. Connects with the Watchtower Trail at 17km. With campgrounds at 5(Evelyn Ck), 8(Little Shovel), 12(Snowbowl), 19(Curator), 30(Tekarra) and 35(Signal) kilometres you can plan for almost any ability.\nMost hikers complete the Skyline as a point-to-point backpack of two nights, staying at Snowbowl and Tekarra campgrounds en-route. But there is nothing wrong with taking your time on such a beautiful trip and stretching it out to three or four nights. The campgrounds are well equipped with tent pads, picnic tables, bear poles (with metal cables and clips) and a green throne privy (solar composting at Signal c/g). The use of gas stoves is mandatory as campfires are not permitted and dogs have recently been banned as well. By traversing the Maligne Range, not only are you undertaking a sublime Rocky Mountain adventure, you are entering the home range of animals that stand today as icons of our ever shrinking wilderness. Wolves and mountain lions, though seldom seen, roam these high valleys in search of prey. Grizzly bears can be spotted digging for ground squirrels or munching on plants in trail side meadows and as a special treat for the lucky few, woodland caribou call the area home as well.There are two ways to start the Skyline but most people choose the main trail, otherwise known as the easy way. From the parking lot at Maligne Lake (several metres to the right of the gated Bald Hills fireroad) the main trail starts with a gentle ramble through the forest, passing Lorraine and Mona Lakes before reaching Evelyn Creek bridge and campground.\nThe other way to start the Skyline Trail is by grunting up the Bald Hills via the short cut for a commanding view of Maligne Lake before heading down the fireroad and taking the connector trail to the Evelyn Creek bridge. This option adds a mere 4km and 500m of vertical to the first day.Evelyn Creek campground is nicely nestled in the forest next to the creek but unless you plan on a late start then pass it by for higher campgrounds. From Evelyn Creek to Little Shovel Pass you'll be working the legs as the trail makes the first climb of the trip. With heavy demand on Snowbowl c/g by the two night crew, Little Shovel or Curator campgrounds are a good second choice for the first night out. From Little Shovel c/g the trail enters the more open terrain of the upper subalpine and continues its climb to Little Shovel Pass at 10km. Entering the Snowbowl the trail can be seen snaking its way down through open meadows and into the trees where Snowbowl c/g is hidden. As the name suggest, Snowbowl is equally popular in winter as it is in summer. Hidden away in the valley is a small cabin called Shangrila. Built by legendary Jasper guide Donald Phillips in 1936 for skiing enthusiasts, the cabin, steeped in history is not available to summer hikers. Administered by the Maligne Lake Ski Club, Shangrila is only available in winter, call 1-780-852-3665 for more info. From Snowbowl c/g it's a long easy ascent through flower-filled meadows to Shovel Pass at 17km. In 1911 Jack Otto was guiding Mary Schaffer to her survey of Maligne Lake over this pass but found the way blocked by snow. Fashioning shovels from nearby trees the party dug their way through then left the shovels behind prompting Mary to christened it \"Shovel Pass\". The shovels are now displayed at the museum in Jasper.\n(http://www.jaspermuseum.org/) Crossing the into the Curator Basin the trail swings right and contours past the junction with the Watchtower Trail. The short trip to the top of this col is worth the view on the other side. Four kilometres down this quiet valley sits Watchtower Campground, not only a good alternate campground when Curator is booked solid but a fitting destination in its own right.Back in the Curator Basin the Skyline continues to the Wabasso Creek Trail junction at 19km. Less than a kilometre down this trail is Curator Campground followed by Shovel Pass Lodge. Unlike Shangrila, Shovel Pass Lodge (http://www.skylinetrail.com/) caters to hikers but horse trips are their forté. Both the Watchtower and Wabasso trails are good foul weather escape routes off the Skyline. Beyond the Wabasso junction the Skyline Trail passes Curator Lake then makes an abrupt ascent to the Notch at 22km the highest point on the Skyline at 2511m. The cornice that crowns this pass should always be navigated on the climbers right. To stand on or below the cornice is a risk that sensible people don't take.Your experience over the next four kilometres is entirely dependant on the weather as you are completely exposed on the crest of the Maligne Range. Completely exposed to stunning mountain scenery that is. Take your time, poke around, walk a ridge, peek down a seldom traveled valley or just kick back and contemplate life above a bejeweled lake. The downside to this utopia would be a spell of nasty weather, like the day I hiked it in a July snowstorm. The high elevation and exposed nature of the Skyline means that hikers are at the mercy of the elements. Be prepared or be cold!The descent to Tekarra c/g is down a twisted trail through a rocky valley bounded by Mount Tekarra on the left and Excelsior on the right.\nAt the head of the valley, lending its name to the creek and lakes below is Center Mountain. After skirting lower Centre Lake the trail enters Tekarra c/g at 30km. (Tekarra Lake is at the head of Tekarra Creek on the north side of the mountain... no seriously, it's on the map) From Tekarra c/g cross Centre Creek and follow the trail as it skirts the shoulders of Tekarra and Signal Mountain to the junction with the Signal Mountain Fireroad. Uphill to the left the fireroad climbs for one kilometre to the old Signal Mountain fire lookout site. (well worth the trip) Downhill to the right the fireroad passes the junction into Signal c/g then plunges into the forest for the final leg of the trip. Losing 800 metres of vertical over the final 9km is hard on the knees but a small price to pay for such a great trip. If you planned it well your car will be waiting for you at the bottom of Signal Mountain, if not you'll have to wait for the Maligne Lake Shuttle http://www.malignelake.com/shuttle.html to get back to your car. The Skyline Trail is one of the busiest in the Rockies and reservation are definitely required. Call the Jasper Trail Office at 1-780-852-6177 up to three months in advance to book your trip, fees apply. The Friends of Jasper (www.friendsofjasper.com) are a good source of maps such as Gemtreks \"1:100000 Jasper and Maligne Lake\" or you can pay twice as much and get twice the topographic detail with the 1:50000 government topos \"83C12 Athabasca Falls\" and \"83C13 Medicine Lake\". The Gemtrek map is more user friendly and contains lots of extra information about other trails in the park while the trails on the government maps are not always plotted correctly and campground locations are not included.Submitted by 'mtncat'.",
    "directions": "From the town of Jasper drive east on Hwy 16 for 2km and turn right on the Maligne Lake Road. Cross the bridge, veer left and follow the Maligne Lake Road for 8 km to the northern parking lot on the right side of the road. Despite being one of the most popular backpacking trails in the Canadian Rockies there is no road sign, other than a hiking emblem, to tell hikers they've reached the Skyline Trail. Leave your car here and get yourself to the other end of the trail.The parking lot at the south end of the trail is at the end of the Maligne Lake Road 48km from Jasper. (there's no road sign for the Skyline Trail there either... go figure).",
    "geohash": "c3k",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/1515/long_Skyline-Trail-Flickr-008-14798.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1515/reg_1040408IMGJPG_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1515/reg_CuratorLakeandtheNotch.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1515/reg_DSC01839-8058.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1515/reg_DSC01952-8058.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1515/reg_IMGP0469-8388.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1515/reg_N.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1515/reg_Skyline-Trail-Flickr-007-14798.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1515/reg_Skyline07.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1515/reg_Skyline20.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1515/reg_Skyline26.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1515/reg_Skyline29.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1515/reg_TheMaligneLakepeaksoverLittleShovelPass.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1515/reg_jasper.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1515/reg_map.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1515/narrow_Skyline-Trail-Flickr-005-14798.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1515/narrow_Skyline-Trail-Flickr-006-14798.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1515/narrow_Skyline-Trail-Flickr-010-14798.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1515/narrow_jasper.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/skyline-trail-near-jasper-ab-1515",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 5,
        "Time": "24 hrs",
        "Total Distance": "44 km",
        "Town": "Jasper, AB",
        "Type": "out-and-back"
    },
    "title": "Skyline Trail",
    "trail_id": "1515"
}