{
    "description": "Elevation gain - 985m (3,250').This 13km trail in Jasper National Park connects with the Skyline Trail . It can be done as a dayhike or overnighter, or combined with the Skyline Trail for a longer jaunt. From the trailhead you cross the Maligne River on a good bridge (recently rebuilt) and climb a series of switchbacks next to Excelsior Creek before making a turn to the SE and traversing the lower slopes of The Watchtower. At 6km you'll turn south and enter the Watchtower Basin. The view into the basin here is enticing to say the least. Plan on wet boots from this point if you visit early in the season. The trail is sometimes faint as you make your way up valley. At 9km ford the creek (a rock-hop later in the season), the campgound is a few hundred meters past the ford. The trail which continues up valley disappears in the alpine meadows but is visible ahead where it climbs a headwall leading to the Watchtower Col. 200 meters after the Col the trail connects with the Skyline Trail  at km17.Submitted by 'mtncat'.",
    "directions": "The trailhead is 20 km from the Jasper townsite. Follow Hwy 16 east from  Jasper for 2km, turn right and follow the Maligne lake road for another 18km to the trailhead.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/1516/long_image_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1516/reg_Neve-on-a-rock-2-34699.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1516/reg_Skyline29.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1516/reg_The-Bear-had-to-get-out-the-bear-spray-before-the-camera--34699.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1516/reg_TheWatchtowerBasin.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1516/topo_WatchtowerBasinfromtopofWatchtowerCol5.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/watchtower-trail-near-jasper-ab-1516",
    "stats": {
        "Activities": "snowshoe hike ski-bc ski-xc",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 4,
        "Time": "14 hrs",
        "Total Distance": "13 km",
        "Town": "Jasper, AB",
        "Type": "out-and-back"
    },
    "title": "Watchtower Trail",
    "trail_id": "1516"
}