{
    "description": "NTS Map 082N09[Note: The route described was done on backcountry skis, but the trip can comfortably be done in snowshoes as a day trip].Elevation gain: ~ 2000 ftFrom the bridge, look for a trail ascending through the trees away from the highway. Initially the ascent through the thick forest will have you huffing and puffing, but after this initial grunt the trail flattens as you follow Mosquito Creek towards Molar Pass. At 6 kms there is a campsite with picnic tables (if you are lucky to find one that is not buried in snow). We stopped for lunch here and had a close encounter with a noisy Clark's nutcracker (an aggressive gray jay  look-alike).From the campsite, the forest thickens as the trail ascends towards Molar Pass. [Hint: seek out your downward route if you aim to get some turn in the powder - in some places the trees are quite close.Eventually the forest gives way to the wide sloping meadows of Molar Pass. The meadows look like an inviting place for doing some turns in the snow, but unfortunately the conditions on this day were not great for playing around.  The snow was hard packed by the wind and I did a good face plant on a sloppy transition from windpacked snow to powder. I also fell into a couple of tree wells on my way back down through the forest. A great ski-tour, but not a great day of skiing for me (this was on account of my lack-of-skill, rather than a reflection of the route described).[Note: For other routes in the area, check out the Dolomite Peak Loop . Cirque Peak  was also skied by some people staying at the hostel].- Trevor Helwig, Trailpeak Snowshoe editorIn winter please check the local avalanche bulletins and conditions.",
    "directions": "Access Point: Mosquito Creek (parking area for day-use). Cross the road from the parking lot and look for a trail ascending into the trees near the bridge. For people staying at the hostel you can cross the bridge and begin to ski immediately. There is no need to drive the 10 seconds to the other parking lot!",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/1523/long_DSC-2981-29667.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1523/reg_003-22357.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1523/reg_004-22357.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1523/reg_DSC-3001-29667.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1523/reg_map.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1523/reg_molarmeadowjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1523/reg_returning1jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1523/reg_returningtohostel2jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1523/reg_skiingupmosquitocreekjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1523/narrow_001-22357.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1523/narrow_002-22357.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1523/narrow_DSC-2990-29667.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1523/narrow_DSC-3012-29667.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/molar-pass-near-banff-ab-1523",
    "stats": {
        "Activities": "ski-xc ski-bc hike snowshoe",
        "From": "",
        "Seasons": "winter",
        "Stars": 4,
        "Time": "7 hrs",
        "Total Distance": "16 km",
        "Town": "Banff, AB",
        "Type": "out-and-back"
    },
    "title": "Molar Pass",
    "trail_id": "1523"
}