{
    "description": "The trailhead this time is not very much to look at. Granted, it isn't officially complete yet. (editors note: As of Nov, 04, the trail has been open) For now it's nothing but a couple of warning signs and a pile of junk brought out from the trail. There isn't even a parking area-- we had to park about a kilometre away and follow the Beechville Lakeside Timberlea (BLT) rail trail under Highway 103 just to begin the hike. \r\n\r\nThe trail begins at the northern end of Cranberry Lake with level ground and a few boardwalks. It's not long before the trail ascends, taking us up above the Lake and giving us a good view of the land beyond. Already the trail underfoot is changing with every step. The trail winds through the barrens of the Woodens River watershed, shifting effortlessly between forest cover and exposed granite surfaces. These rock faces alter our pace but also provide us with many unobstructed views of the landscape around us. \r\n\r\nAfter walking the length of Cranberry Lake for some time we cross a small brook and head east towards Pot Lake. At last the sounds of the nearby highway can no longer be heard. The trail is freshly cut and very well-defined but is obscured in places due to fallen trees from Hurricane Juan back in September. We keep an eye out for other trails as we know we're approaching the intersection of the Pot Lake Loop and the Indian Hill Loop. The trail leaves Pot Lake behind us as it heads up a small exposed hill of rock. From here we can see a hillside scattered with glacial erratics. After a little poking around we find two choices. Turning south would take us around the other half of the Pot Lake Loop. Instead we follow a couple of rock cairns north, and find the trail for the Indian Hill Loop. \r\n\r\nThe trail splits in two at the southern end of Cranberry Lake so we hold a quick vote. Kris wants to go right, but Matt S. and I choose left. Democracy survives another day and the trail takes us past a small unnamed pond before entering a forest of birch trees. At the top of this hill is a large boulder maybe fifteen feet high nestled in the trees. This rock has hard edges and a flat top. Lying at its base is a makeshift ladder which Matt S. picks up and leans against the boulder. The ladder is broken so we take great care and climb with most of our weight on the solid side of the ladder. \r\n\r\nOn top of the ladder, above the surrounding trees, we can see the trail ahead of us sprinkled with even more boulders perched on small hilltops. Frederick Lake can also be seen in the distance. Eager to move ahead and explore more rock formations we climb down the shaky ladder and keep moving. \r\n\r\nThe trail meanders between different rock faces and boulder formations. Many of the rocks are very large. Some of them have huge cracks in them, and Matt S. can't resist a little exploration. On another exposed hill he climbs atop another boulder and makes it look easy, jumping from rock to rock. A sudden breeze reminds me that the warm weather is unseasonably so and I pull the sleeves of my jacket down. \r\n\r\nWe follow the trail as it overlooks Frederick Lake, gradually descending to the shore at the southern end. The water is a cold deep blue and icicles have formed on the bushes at the water's edge. We take a seat on several bench-shaped rocks to take a short break for lunch. \r\n\r\nAfter lunch we hike southeast through the scrubland surrounding Upper Marsh Lake. Far off in the distance I can see a structure and what looks like a pit or a quarry. I can't make out much more detail than that and nothing on the map resembles it, so the mystery remains unsolved. After circling the bottom of the lake we cross a stream and lose sight of the trail. The ground is littered with rocks and fallen trees and no clear trail can be seen. We wander around downstream and quickly rediscover the trail as it follows the northern shore of Lower Marsh Lake. Here the trail seems rougher to me, but who knows if it's because of hurricane damage or trail construction. \r\n\r\nWe head uphill and leave the lake behind us, letting the stone trail markers lead the way. On one section of exposed granite sits a round wall of stones about three feet high. From here the trail moves from rock pile to rock pile in a northerly direction. Things start to look familiar again as we climb the hill that is south of Pot Lake. Here we find another intersection of the two trail loops. We turn right to bring ourselves around to the eastern side of Pot Lake and hike north. \r\n\r\nSounds from the highway are getting progressively louder as we move, and houses can be seen again in the distance. I know the end is near when the trail heads downhill and rejoins our original route at an inconspicuous intersection beside Cranberry Lake. The hike out from here is quick and before we know it we're back on the BLT trail, with afternoon joggers and cyclists coming from either direction. \r\n\r\nThis trail hasn't even been finished yet and already I'm impressed. Still to be done are the Bluff Loop and the Hay Marsh Loop, but what exists now is thoroughly enjoyable. The landscape is stimulating and representative of Nova Scotia in general. The trail is also readily accessible to many people, being only a twenty minute drive from the centre of Halifax. I expect, once all the finer details have been taken care of, this trail will be one of the most popular in the province. \r\n\r\n\r\nTrailhead waypoint:(UTM)\r\nBluff Trailhead - 0438912E 4945737N \r\n-used with permission of Matthew Hogg\r\n\r\nFurther descriptions can be found at http://www.wrweo.ca/bluff/index.html",
    "directions": "The trail, entirely on Crown Land, begins inside the Woodens River watershed and climbs onto the high ground between the Woodens River watershed and the Nine Mile River watershed to the east.\r\n\r",
    "geohash": "dxf",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/1529/reg_01jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1529/reg_06jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1529/reg_08jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1529/reg_Bluff-1-44611.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1529/reg_Bluff-2-44611.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1529/reg_Bluff-3-44611.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1529/reg_Bluff-4-44611.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1529/reg_Bluff-5-44611.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1529/reg_Bluff-6-44611.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1529/reg_Bluff-Wilderness-Trail-003-14267.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1529/reg_Bluff-Wilderness-Trail-006-14267.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1529/reg_Bluff-Wilderness-Trail-007-14267.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1529/reg_Bluff-Wilderness-Trail-016-14267.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1529/reg_Bluff-Wilderness-Trail-017-14267.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1529/reg_Bluff-Wilderness-Trail-018-14267.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1529/reg_GOPR0862-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1529/narrow_05jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1529/narrow_07jpg.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/bluff-trail-near-halifax-ns-1529",
    "stats": {
        "Activities": "hike river-canoe snowshoe",
        "From": "",
        "Seasons": "summer fall winter",
        "Stars": 5,
        "Time": "14 hrs",
        "Total Distance": "30 km",
        "Town": "Halifax, NS",
        "Type": "out-and-back"
    },
    "title": "Bluff Trail",
    "trail_id": "1529"
}