{
    "description": "Kanomee Canyon is a great loop trail that skirts the gorge of the Economy River and associated feeder streams.\nThere are at least 5 creek crossings, and depending on the time of year,you should expect to get your feet wet.\nA map published by the area's trail club mentions two or three backcountry camp sites. Be careful with your food managment due to abundant wildlife. (You may be considered food as well!)\nthe hike uses a collection of trail marker styles so you must keep your wits about you. One time, an 18 K hike turned into a grueling 30K slog in all kinds of spring weather. Bring a compass just in case you get off the trail. The hike starts where it ends, at the Economy falls.\nAwsome views and definately a feeling of remoteness. A Nova Scotian \"must do\"!\nFrom Matthew Hogg: (used with permission.)\nWe're the only people parked at the trailhead of the Kenomee Canyon Trail. The sky is grey and threatens to pour rain down on us at any time. Autumn being in full swing, there is a slight October chill in the morning air. I shoulder my backpack and join Kris on the trail as we begin our overnight hike. \nThe loop starts at the top of the cliff overlooking Economy Falls. After taking a few photos and admiring the falls from above, we follow the trail across the newly built bridge spanning the chasm that is Economy River. On the other side there is no choice but to follow some switchbacks straight up the hill. Luckily the hill is short. By the time I reach the top I'm forced to remove the layers I had put on in defense against the cold. \nThe trail from here on out is relatively level, but it does meander along the side of the hill running north beside the river. Orange leaves cover every square inch of the ground, which makes the trail a little difficult for my eyes to make out in some places. Adding to the difficulty are a couple of right turns in the trail that come out of the blue and catch me off guard. I make a mental note to pay better attention and I stay on the lookout for the occassional marked tree. \nKris and I cross a couple of ATV tracks where the hiking trail intersects. The surrounding forest changes slightly as the trees stand further apart and the terrain begins to slope downhill. Before I know it I can see Newton Lake through the trees. Kris does a bit of a double-take, too. We weren't expecting to be here so soon. Our plan was to make it to Murphy Brook and camp there for the night, but it was looking like we were going to get there a little early. We take a short break by the lake's edge where I can hear dogs barking furiously from somehwere across the water. \nThere are campsites on the shores of Newton Lake, but somehow we fail to notice the spur trail as we continue on our way. Not too concerned about it, we forge ahead. I mention to Kris how we might arrive at Murphy Brook a little too soon. We'd have a lot of daylight left to kill-- most likely under a downpour. Kris exchanges a quick glance with me and we both know what the other is suggesting. Right then and there we elect to do the entire loop in the same day. Backpacks be damned. \nBetween Newton Lake and Black Brook, I get a little lazy and pay less attention to where the trail takes us. The trail is mostly well defined, but when it isn't you're left to chase one trail marker after another. These are hard to see surrounded by autumn leaves, but are also inconsistently placed. Sometimes the trail is marked with survey tape, sometimes with painted metal markers. Occasionally two markings suggest two different directions. \nAfter following the ridgeline for some time, the trail suddenly turns downhill and intersects with a river at the bottom of the hill. It should be immediately obvious to either of us that this is Black Brook, but inattention and false assumption somehow lead me to the conclusion that this is Murphy Brook. Kris doesn't ask me to justify my assetion and we take a short break at the river's edge. Thinking the waterfall should be a short distance upriver, we leave our packs behind and start a bushwhack. I'm dodging branches with sandwich in hand, and I begin to realize we can't possibly be where we think we are. While the trail was certainly rough in places, there's no way it can be so bad as to be impossible to find. Kris and I decide to turn back after reaching an anonymous bend in the river. \nWhen we return to the trail, I examine the map and try to see what I was getting wrong. I think it through logically and replay the last part of our hike when it dawns on me that Murphy Brook is a few hundred metres down the trail. We've about an hour of our day for nothing when all we had to do was hike around the next hill and read the big sign labeled \"Murphy Brook Camping Area\". The sound of hand against forehead echoes off the surrounding hills. \nA spur trails leads uphill and, just to make sure we're still paying attention, hangs a sharp right. Many small paths branch off leading to tent sites nestled in the woods. It's a scenic spot for camping, as Murphy Brook Falls can be heard rushing by at the bottom of a hill. Kris and I descend to investigate and explore before moving on. \nReturning to the main trail, we follow the trail through the hills above Black Brook as it flows west towards Economy River. West. Yeah, that's it. I have it sorted out in my head now. By now a moderate rain has started to fall and I feel chilly whenever I stop for a break. The trail eventually returns to the banks of the river, where it meets Chain Lake Stream. The last time we were here ( October 2001 ) we accidentally followed an ATV track back to the trailhead. So this time we try to be careful to stay on the trail. Unfortunately, there are no trail markers within view. We tentatively hike uphill on a rocky ATV track while looking for the trail. I get even more confused when I see flagging tape in the woods just off the ATV track. A few minutes later I notice the actual trail on either side of me. Somehow we had misunderstood the trail yet again. \nWe shrug and reenter some thick woods following a fairly level trail. The trail slowly bends to the south to follow Economy River back to Economy Falls. Once in a while a gap in the trees offers us a glimpse of the opposite side of the gorge. At this point my clothes are soaked through and I'm starting to feel a little worn down. I'm looking forward to seeing the trailhead again and drying myself off. Trail markers are getting harder and harder to see as my eyes begin to tire. \nIt doesn't help that the trail markers we can see don't inspire confidence. Several times I can see the path diverge into two different directions. They may both lead to the same place, but how do we know for sure? I have to stop and debate with Kris which way we should go because where we're both looking we see trail markers. Arguments, of course, are settled by whoever sees the biggest trail marker. \nThe remainder of the hike carries on in this way until we reach the final kilometre or two. From here on out the trail is wider and more defined as it slopes gently toward Economy Falls. The rain has been falling consistently and I'm pretty much exhausted. Kris and I aren't chatting much at this point, but we're reinvigorated to see the look-off above Econfomy Falls once more. \nDespite our mental difficulties and fatigue, the Kenomee Canyon Loop is a great trail system. I might suggest some slight improvements to their trail markers, as having to concentrate on where you're going can take away from the experience. That said, the trail takes you across all sorts of wonderful terrain. It can be done in one day, or in one weekend. It's the perfect example of the beauty to be found in the Cobequid Mountains. For me, though, it's a long day made all the more sweeter with a stash of dry clothes and heated car seats. \nEconomy Falls - 0428116E 5033011N \nNewton Lake - 0430092E 5035185N \nMurphy Brook Falls - 0430452E 5037499N \nAdditional information:\nhttp://www.halifax.cbc.ca/radio/infomorn/mikehikes/trail45.html",
    "directions": "Economy Wilderness Protected Area\n Christened for the Mi'kmaq name for the area\n Above Economy waterfall on the far bank of the river\n· From Truro, drive west along Highway #104 to Exit 11 at Glenholme. Turn onto Highway #2 and follow for 34-km (21-mi) to Lower Economy. Turn right onto River Philip Road (dirt) and travel 7-km (4.5-mi) to Economy Falls Trailhead parking area, on right. \nStay away from the road in the winter until at least the May \"2-4\" weekend. Snow cover and really soft rutted surface garentees you get stuck.",
    "geohash": "f84d",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/1530/reg_01jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1530/reg_02jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1530/reg_03jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1530/reg_06jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1530/reg_07jpg.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/kenomee-canyon-trail-loop-near-parrsboro-ns-1530",
    "stats": {
        "Activities": "snowshoe hike",
        "From": "",
        "Seasons": "winter fall summer",
        "Stars": 5,
        "Time": "7 hrs",
        "Total Distance": "18 km",
        "Town": "Parrsboro, NS",
        "Type": "out-and-back"
    },
    "title": "Kenomee Canyon Trail loop",
    "trail_id": "1530"
}