{
    "description": "Green Gardens can either be completed in parts as a long day hike, or as an over night back country trek. It can be found within the borders of Gros Morne National Park along route 431. The first entry point is Wallace Brook, and the second is Long Pond. You will need a tenting permit to over night on the trail.What you'll notice right from the start from Long Pond trailhead is the view of the tablelands from the road looks like a landscape from Mars. The iron-ore has turned the rocks red from oxidation. It's a huge scree field created by glacial movement. It's actually one of only a few places to see the earth's mandle at the earth's surface.The hike is a bit more than 14 K as a loop from Long Pond, and starts from an inland area to the coast. The views, once you get there, look suprinsingly like the coastal views in Fundy national park NB, or Cape Chignecto, NS. One nice feature of the coast line were the basalt sea stack formations left from eroding sandstone. With both access points and loop totaled, the over all distance is 19K.There are pit pivys and tenting zones all along the coastal portion of the hike, and also roaming sheep that will get into your stuff if you don't take the proper measures! I'm not sure how bright those sheep were because some stranded themselves on the sea stacks as the tide came in. I'm not sure what became of them. Only the western side of the hike has formal platforms. In the other areas, (zones 2 & 3) you must look for flat trampled grass, and pitching becomes stratigic amongst the thorns and sheep scat.Green Gardens is a beautiful hike, and a great one for a beginning back country traveler. It's full of adventure and varied views. Going from Wallace Brook trailhead, I found the path to be muddy in a lot of places. You will have to ford the river / Brook at least once, and if you plan on doing the loop but back to the same trailhead, you will need to ford the river a second time in a different spot. Don't be fearful however. In August, the water was just below the knee in the deepest parts. Wearing water shoes such as the likes of Keen's will leave you laughing as you move along.I especially liked the varied terrain between the lush wooded approach, the scenic coastal section, the beach hike, and the tundra like barrens at the bottom of the loop. This trail has it all.First Green Gardens, then The Long Range Traverse!editor's note: Because of the terrain, I have added snow shoeing, and kayaking. The camp sites are accessable by beach.",
    "directions": "Take Route 430 into Gros Morne National Park, and then take the 431 West past the Descovery Center.",
    "geohash": "f8y9",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NL/1534/reg_IMG-0979-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/1534/reg_IMG-0988-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/1534/reg_IMG-0992-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/1534/reg_IMG-0995-6702_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/1534/reg_IMG-0996-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/1534/reg_IMG-1004-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/1534/reg_IMG-1013-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/1534/reg_IMG-1014-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/1534/reg_IMG-1039-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/1534/reg_IMG-1043-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/1534/reg_IMG-1058-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/1534/reg_IMG-1070-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/1534/reg_IMG-1071-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/1534/reg_IMG-1075-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/1534/reg_Newfoundland-2011-027-37009.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/1534/reg_Newfoundland-2011-037-37009.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/1534/reg_tablelands.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/1534/topo_greengardens3.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/1534/narrow_IMG-0982-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/1534/narrow_IMG-1073-6702.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/green-gardens-near-bonne-bay-nf-1534",
    "stats": {
        "Activities": "snowshoe sea-kayak hike",
        "From": "",
        "Seasons": "winter fall summer",
        "Stars": 5,
        "Time": "14 hrs",
        "Total Distance": "19 km",
        "Town": "Bonne Bay, NF",
        "Type": "out-and-back"
    },
    "title": "Green Gardens",
    "trail_id": "1534"
}