{
    "description": "Fairmont Ridge trail is a set of six stacked loops that are go through a variety of terrain, varying from rock outcrops, gulleys and pastures to hardwood groves and bogs. Views are wonderful, and some routes (if you do all 11K in a single go) are somewhat of a challenge.Designed by master trails builder Peter Jackson, and maintained by the Antigonish Hiking and Biking Association, the footpaths climb as high a point as 1200 feet. Wildlife is plentyful, and geological formations such as sink holes can be found near by. Infrastructure includes boardwalk sections and sturdy bridges. Junction points are labeled, and loops named, along with posted topo maps showing your position. A compass may assist you in maintaining orientation, as I was confused my first time through.The signage is excellent, and the trail conditions well maintained. Given the length, options, and vistas of this trail system, Fairmount Ridge is a must-do if you are in the area. Shannon BurtEast Coast Editor,Trailpeak.comFor additional GPS data, see this post.",
    "directions": "Going from Antigonish, take the 337, 10K and look for the trailhead and parking lot on the left.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/1535/reg_Antigonish-023-38765.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1535/reg_fairmountmap.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1535/narrow_Antigonish-006-38765.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1535/narrow_Antigonish-028-38765.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1535/narrow_map.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1535/narrow_path.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1535/narrow_view.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/fairmount-ridge-trail-near-antigonish-ns-1535",
    "stats": {
        "Activities": "snowshoe hike",
        "From": "",
        "Seasons": "winter fall summer",
        "Stars": 4,
        "Time": "4 hrs",
        "Total Distance": "11 km",
        "Town": "Antigonish, NS",
        "Type": "out-and-back"
    },
    "title": "Fairmount Ridge Trail",
    "trail_id": "1535"
}