{
    "description": "Cabin Fever!\r\n\r\nWinter camping in Fundy National Park\r\n\r\nIt was the last weekend in February, and we were bound to Fundy National Park to do some snow shoeing and winter camping. In the party were myself, Stefan, and Ross. Stefan was from BC, and Ross, from Florida. Long hikes were common to Ross, but putting him with two Canadians meant adding snowshoes and winter camping to the equation. He had no problems adapting.\r\n\r\nOur ambitions were to do the Little Salmon River trail, a route that would take us to the in-land heart of the park. We'd find a handful of waterfalls and some of the most rugged terrain the park has to offer.\r\n\r\nWe arrived at the park around eleven PM, and I pitched my tent behind the cooking shelter at Headquarters campground, just past Alma. The snow was packed, and the pitching was easy. After a great night's sleep, we sought out the trailhead. We ended up meeting up with a very helpful Parks officer, who informed us of our official options. We needed to register so that when the warden found our car, we wouldn't get fined.\r\n\r\nWell, so much for ambitious plans. After meeting up with the officer, we found out what was officially in the offering, and our plan wasn't. Pretty much everything that had any interesting terrain was off-limits. Trails for the summer weren't flagged for winter trekking, so any attempt to do them would result in an intense map and compass session, and we left the topos at home. \r\n\r\nThere were groomed xc ski and snowshoe routes, but winter camping really wasn't an official option except for at Headquarters and above Tracey Lake. There were huts at the Point Wolfe campground at eight dollars a head. We had to muster a new plan. A cabin as part of the option sounded appealing to everyone. This was a different kind of cabin Fever!\r\n\r\nWe decided to snowshoe the Point Wolfe Road, and once into the coastal zone of the park, decide what we'd do from there. Goose River trail would be a possibility if we had time. Point Wolfe would be a lame trek in, but one point of interest along the way would be Dickson Falls. I brought along my climbing gear, and wanted to explore the short 25' rock face and ice fall. After taking the dicy spur trail, The three of us each had a turn at rappelling down the rocks, and climbing the cauliflower ice of the Dickson waterfall. I managed to get myself stuck at the bottom of the falls on my first rappel until Stefen helped me out wearing the crampons. It can be a lot of fun if you know what you are doing. Let's just say we had fun, and a good laugh.\r\n\r\nThe rest of the day was spent getting back onto the Point Wolfe road, and climbing some pretty steep hills. The route would have been faster if we had back country skis, but oh well.\r\n\r\nThe main photo opportunity was a red covered bridge near the end of the route. Worthy of note was the amount of ice we spotted along the cliffs that would make for a great and easily accessible ice climb. We figured we'd seen at least a half dozen potential lines.\r\n\r\nLate that afternoon, we reached the camping area, and found the shelters. Ours was fairly large, with two wood stoves, picnic tables, and cupboards with a few supplies. The firewood was stored inside, making for very dry wood. That evening, we ate, drank, and played cribbage. The sky was a rich blanket of stars, and the stove fire, toasty.\r\n\r\nThe next morning, we set out for home. The tone was set early when instead of tracing our steps back to the road, we B-lined it down over a steep bank. I seemed to be doing telemark turns in my snowshoes to keep from tumbling. With that under our belts, we decided to take on the Coastal Trail back to our car. This was a 10 K trek that skirted the ridges of the cliffs from West to East. After crossing the covered bridge again, we picked up the trailhead, and went for it. \r\n\r\nThat officer was right about one thing. Routes not supported in winter are hard to find when they aren't flagged. What appeared to be trail flags ended up being tree identification markers. We quickly lost the trail after the first switchback section in the ascent. Once we oriented ourselves to the ocean, we simply kept it on our right, and figured we would ether cross Herring Cove Road, or pick up on the original trail.\r\n\r\nThe bush whacking wasn't all that bad, with the exception of one dense softwood swath. It was pretty thick, and reminded me of Newfoundland's tangled tucamore back in Gros Morne. Never the less, we got through unscathed.\r\n\r\nWe wound our way toward Matthews Head and stopped to take a break at a look off to view Herring Cove. There we could see the vast rocky coast that ran beyond Cape Enrage. Since it was winter, we could also see ice formations, that on a low tide, could be great for climbing. It was reported to have sea caves in the area too. The seas that day were fierce, and the winds were very strong. It was to our advantage that we were traveling in the forest, sheltered from the brunt of the winds. The trail was dicy, but with the snowshoe's crampons, we had few problems.\r\n\r\nAt Herring cove, we followed a path that took us down to the water, where there was suppose to be a small waterfall. It wasn't that big, and time was pressing, so we started on our last leg. Meeting up with a couple who had hiked in from the opposite end, gave us some much needed insight on what lay ahead. The elevation changes that we saw ahead of us looked daunting because we would be climbing from sea level right back up to the cliff tops. They said it took them an hour to come in. With that knowledge and the advantage of having their tracks to follow, getting home was now a no brainer activity. Not that it wasn't challenging. At one point, we topped out on a ridge where three meters each way, were rocky drop offs.\r\n\r\nAccurate to the telling, we were back to the car within the hour. We couldn't believe how we were hauling ass over that last section. It was great to get the packs off our backs and be settled back in the car for the ride home to PEI. High-fives to everyone!\r\n\r\nThe winter experience in Fundy turned out to be a fantastic multi faceted adventure. With a group of accomplished travelers, and a thirst for real adventure, the experience we brought back was rich. Fundy national Park in the Winter will definitely be must-do every year. No regrets on this trip.\r\n\r\nshannon Burt\r\ntrailpeak.com",
    "directions": "Follow route 114 from Highway 1 or find your way to Alma and enter the park from there.",
    "geohash": "f81g",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NB/1537/reg_The3shoers066jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/1537/reg_best1_cove.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/1537/reg_elevation.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/1537/reg_ptwolfview.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/1537/topo_fundymap.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/1537/narrow_DicksonFallsjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/1537/narrow_bridgeptwolf.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/1537/narrow_dicksonfalls.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/fundy-park-winter-coastal-trail-near-sussex-nb-1537",
    "stats": {
        "Activities": "climb snowshoe sea-kayak hike ski-bc ski-xc mtn-bike",
        "From": "",
        "Seasons": "winter fall summer",
        "Stars": 5,
        "Time": "14 hrs",
        "Total Distance": "20 km",
        "Town": "Sussex, NB",
        "Type": "out-and-back"
    },
    "title": "Fundy Park winter Coastal Trail",
    "trail_id": "1537"
}