{
    "description": "Deep Cove is ice climbing location, just 40 minutes outside of Halifax, NS. There are a couple of ice flows located in the area.I took the opportunity to meet up with the people of Climb Nova Scotia on one of their \"Ice Climb Sundays\" events. Over the winter, CNS promotes Ice climbing in the region by holding sunday events. Everyone is welcome, and gear is shared, so no experience is necessary.It's a great way to see of you like the sport, and also to test a variety of gear. They also take the time to do a little bit of instruction as well, so it might be just the chance to get some experience with ice screws, or get the instruction necessary for making abala cov anchor.On this trip out, there were around 14 of us out, and it was a great mix of people. I climbed with the president of CNS (Teth) stayed on one ice flow. We enjoyed the climbing, but unfortunately, missed the better routes found by the rest of the party.This was the occasion where I tested the new Petzl Dartwin ice climbing crampons. You can find the review on this climbing portal of trailpeak.Information can be found in Ice Climb Sundays and other eastern canadian climb endevours by going to www.Climbeasterncanada.com. There are sections devoted to each of the atlantic provinces.",
    "directions": "Taking highway 103 toward Chester. Take exit 7 and head left. Cliffs on the left, with lots of parking potential.  Highway 329 from East River. Drive to Deep Cove, the cliffs are at the intersection of Deep Cove Rd and highway 329",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/1539/reg_DSC-0011-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1539/reg_DSC-0012-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1539/reg_climb1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1539/reg_climb2teth_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1539/reg_lookingforclimberssm.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1539/reg_tethrope.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/deep-cove-ice-climbing-near-halifax-ns-1539",
    "stats": {
        "Activities": "climb",
        "From": "",
        "Seasons": "winter",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "1 km",
        "Town": "Halifax, NS",
        "Type": "out-and-back"
    },
    "title": "Deep Cove Ice Climbing",
    "trail_id": "1539"
}