{
    "description": "This is quite the climbing spot!Location: First face(UTM) 0483900E, 4962700NMain Face:484000E, 49618000E UTM 20UWe went on a day trip, and forgot our routes book! We were left searching for bolts and routes within our skill level. Many of the routes were 5.10 and above, with two or three in the 5.7 range. Anchor potential is good with many a tree at the top. What is nice about this spot is that if it's really warm, you have instant cooling off potential with the lake at your feet.there are two actual climb spots here. The first face which is accessable from the dock and a foot path, and then there is the main face which is either accessable from the same spot by canoe, or by hiking in from another cottage road, further up the highway.For a great resource on climbing spots in NS, check out this extensive website:http://members.tripod.com/novascotiaclimb/",
    "directions": "Take Highway 107 up the Eastern Shore until the highway ends at Musquodoboit. At the Stop sign veer right. Follow this road until you see the little store and the RCMP station. Take a left, this will put you heading north on Highway 357. Travel up this road for 6.1 km and take a left into the second little dirt road. (The first little road is the old road, its a dead end now.) Follow the dirt road and when it forks go left. You will come up a little hill and you will see some parking on the right by the \"Take Your Garbage Home\" sign. Down at the bottom of this hill is a dock and more parking. Leave this parking for the boaters. Walk down the hill to the dock. If you want to see the face walk to the end of the dock and look to your left. The cliff can also be accessed by foot from highway 357. Park 4.8 km from the Musquodoboit Harbour turnoff and follow a trail for twenty minutes to the top of the cliff. The trail is difficult to spot from the road, but it is well marked once you are on it.",
    "geohash": "dxg",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/1541/long_paceslake.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1541/reg_belaysmJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1541/topo_bevon511smJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1541/narrow_bevonaprilCsmJPG_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1541/narrow_edgingsmJPG.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/paces-lake-first-face-near-halifax-ns-1541",
    "stats": {
        "Activities": "climb river-canoe",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 5,
        "Time": "6 hrs",
        "Total Distance": "2 km",
        "Town": "Halifax, NS",
        "Type": "out-and-back"
    },
    "title": "Paces Lake, First Face",
    "trail_id": "1541"
}