{
    "description": "Champs de Mars is a great warm up trail, and was one of the more local options we had yet to do over the past five winter visits we've done in the park.\nWe drove from New Brunswick, and arrived in the middle of the afternoon, looking to salvage the rest of the day with an activity after checking in at the gite.\nChamps de Mars trailhead is pretty close to Hog's back, and sits just outside of the park's southern border. It's a multi purpose route that can serve up something for everyone, making it the perfect warm up spot for a mixed skills group.\nWe went in to snowshoe, but discovered several options for both open face and glade skiing, as well as backcountry skiing along the plateau. \nWith several days of old consolidated snow and a recent rain before us, we found the snowshoes useless, so quickly ditched them and GPS'd the location and continued on foot over hard packed snow.\nThe trail starts in the woods, and steadily climbs. Every once in a while, you'd get the chance to look back to see Mont Olivine, and Albert, both future endevors during our time there. When the trees start to thin, you start to see Mont-Blanche to the north, with the snow bathed in brilliant sunlight. Bring some sunflower seeds and trail mix. The gray jays will feed right from your hand!\nWe wondered why there was a spur trail near the bottom, thinking there was some loop in the trail, but once we reached the top, where the avalanche zone was indicated with the adrelalin inducing signage, we understood the layout of the trails.  The concept for skiers is to skin up the steep narrow route to the top, and enjoy the ride down the open slope, catch the spur back to the main trail, and repeat!\nAlong the way up, we found at least a couple of gentle sloped glade runs that looked inviting enough for novices like myself, and as always, I thought, maybe next time, I'll bring the right gear for that.\nAnd that's what I really like about this trail. You could bring a mixed group of friends along, and everyone will find something to enjoy. There's glade skiing, open face skiing, snowshoeing, and at the top, a thin treed, open space to go exploring with your backcountry skis or snowshoes.\nIf you only have a couple of hours, or are looking for a warmup spot, Champs de Mars will be a hit.\nshannon Burt\neast coast editor\nFrom Hugo in Quebec:\nLa trail est soutenue dès le depart. Quelques tournant a enchainés et le sommet se présente. Là vous choisissez votre ligne et la poudreuse est au rendez-vous\nThe trail is steep at the beginning. the suumit comes after 40 min. of hiking, spot your line, the powder is there\nHugo",
    "directions": "Du gite du Mont Albert continuer jusqu'au stationement de Blanche Lamontagne et prendre le premier sentier à gauche \nAt the Gite du Mont Albert continue straight to the parking of Blanche Lamontagne and then take the first trail on your left",
    "geohash": "f8",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/QC/1542/reg_saguenaychicchocs122JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/1542/narrow_chicchocs124JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/1542/narrow_chicchocs127JPG.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/champs-de-mars-near-matane-pq-1542",
    "stats": {
        "Activities": "snowshoe hike ski-bc",
        "From": "",
        "Seasons": "winter",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "5 km",
        "Town": "Matane, PQ",
        "Type": "out-and-back"
    },
    "title": "Champs de Mars",
    "trail_id": "1542"
}