{
    "description": "Sentier géré par l'université Laval. Les sentiers commencent près de l'accueil autour du lac Piché. On continue ensuite le long d'un ruisseau qu'on doit traverser 30 minutes plus loin. De là, le sentier devient un peu plus abrupt sur environ 3 km. Rendus à une altitude d'environ 800 mètres on arrive à un point de vue sur les sommets avoisinants de la réserve des Laurentides. À partir de là on amorce une descente vers la chute de la rivière noire où nous attend un magnifique refuge construit à même le roc de la falaise longeant la chute. Le refuge est très convoité alors prière de réserver d'avance! Vous revenez ensuite sur vos pas pour regagner le stationnement.\r\rThis trail is managed by Laval university. Trail start near lake Piché and follow a stream for about 30 minutes. Right after we cross a little bridge, trail start being steep for 3 km until altitude of 800meters. From this place, view let you guess about nearby summits.The shelter near the rivière noire waterfall is probably one of the most popular and beautiful of Quebec. It's a one way trail so you have to get back on the same way to parking lot.",
    "directions": "From Quebec city follow 175 north for about 70 km. At km 103 turn right on route 33 for 3 km. Trail access is free for hiking and snowshoeing. \r\rDe Québec prendre la route 175 nord et au kilometre 103 tourner à droite sur la route 33 vers le pavillon de climatlogie de l'université Laval sur 3 km. L'accès aux sentiers est gratuit sauf pour le ski de fond.",
    "geohash": "f2mm",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/QC/1551/reg_fortmomonrency073JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/1551/narrow_fortmomonrency067JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/1551/narrow_fortmomonrency076JPG.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/foret-montmorency-near-quebec-pq-1551",
    "stats": {
        "Activities": "ski-xc hike snowshoe",
        "From": "",
        "Seasons": "summer fall winter",
        "Stars": 4,
        "Time": "5 hrs",
        "Total Distance": "14 km",
        "Town": "Quebec, PQ",
        "Type": "out-and-back"
    },
    "title": "Forêt Montmorency",
    "trail_id": "1551"
}