{
    "description": "I don't know of anything else quite like this in the Nova Scotia. Although nothing much of it remains today, Roxbury can still be defined as an actual \"ghost town\". In the late 1800's Roxbury was a logging community with a population of several dozens, until a poor supply of lumber and harsh winters forced people to reconsider settling in the area. \nEven to this today I find the location strangely isolated. The nearest neighbouring town of Lawrencetown is about 6 or 7 kilometres away, and I can only imagine how remote it would have been back in its day. \nKris, Matt S., Dave, Sheena and I started our hike up a gradual slope of the South Mountain. While not affording us too many views, the weather was favourable and the walking easy. The trail to Roxbury follows a muddy cart-track, something I like to think is possibly a relic from the time when it would have actually been used by the townsfolk. There's not much to note about the walk, as it was pretty uneventful. \nAfter about 5 kilometres of hiking I noticed a sign welcoming visitors to the town of Roxbury. It's a bit of a strange sight. There is reportedly a hermit of sorts who lives in the area and went about placing signage for all the points of interest for the town. Of course we never saw this person, although we did notice a couple of modern-day cabins. \nWe took a moment to review and sign the guestbook that sits in a bucket nailed to a tree, and almost immediately I noticed a rock wall trailing off into the woods. Matt S. and I followed it all the way around. I was impressed that much of the wall still remains in good shape, and surrounded a fairly large area. Along the other side of the wall we found the first of many wells. These wells are perfectly round holes, dug out of the soil and lined with moss-covered stones. They all seemed to be pretty deep. \nWe tentatively explored a cottage complete with shed and outhouse. We called out a friendly \"hello\" but got no response. Not wanting to be too intrusive to any hermits that might be observing us, we left in peace. Sheena was certain she heard noises coming from inside the cottage... \nWe continued our stroll down the cart-track, pausing occasionally to explore another well. Along this stretch of road the rock wall ran almost the entire distance of what would have been the ride through town. I tried to imagine people living here day-to-day, but I don't think my imagination could do it justice. \nSoon we came upon a clearing with yet another well, but also the collapsed ruins of a house. The house seemed not as old as I understood the town to be, but my knowledge of such things is pretty limited. If this house has been part of the town all along, then they must have been the most affluent people in Roxbury. This was a fair-sized house, now a heap of nails and shingles. We stopped here for lunch and then decided to take a short look further on to see what else there might be. \nSoon enough the forest takes over again. To the right of the cart-track is a side trail, simply marked \"cemetery\". Making our way along this trail, it soon became overgrown with deadfall and brush. As I was about to try and forge my way through it I looked down and noticed a worn headstone. I was a little surprised. This was the cemetery. \nIt was choked with branches and fallen trees, but sprinkled throughout were several headstones. These graves dated back to at least the 1860's. Some where large and inscribed, others were small and simply displayed someone's initials. One was plainly labelled \"BABY\". I took the time to carefully prop up a headstone that had fallen over. It was still in pretty good shape. After taking several pictures of this bizarre scene, we returned to the cart-track. \nBeing satisfied there was not much else to discover, we made the return trip back to the trailhead. This was definitely one of the more unusual hikes I've been on, but it was enjoyable. Hiking often gives me a thrill when I know I'm in a place not many others have seen before, but this time the thrill came from knowing that I wasn't the first to visit Roxbury. \nUsed with Matthew hogg's permission\nGPS beta\nRoxbury Cemetery - 0328545E 4963527N \nRoxbury Guestbook - 0328615E 4964311N",
    "directions": "7K from Lawrencetown, in the Annapolis Valley",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/1553/reg_01jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1553/reg_02jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1553/reg_04jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1553/reg_05jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1553/reg_DSC-3093-19174.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1553/reg_DSC-3123-19174.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1553/reg_DSC-3131-19174.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1553/reg_DSC-3137-19174.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1553/reg_DSC-3140-19174.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1553/reg_DSC-3142-19174.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1553/reg_DSC-3173-19174.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1553/reg_DSC-3194-19174.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1553/reg_DSC-3208-19174.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1553/reg_DSC-3212-19174.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1553/reg_DSC-3217-19174.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1553/reg_DSC-3220-19174.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1553/reg_DSC-3223-19174.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1553/reg_roxbury-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1553/topo_03jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1553/narrow_06jpg.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/roxbury-near-bridgetown-ns-1553",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "7 km",
        "Town": "Bridgetown, NS",
        "Type": "out-and-back"
    },
    "title": "Roxbury",
    "trail_id": "1553"
}