{
    "description": "Last weekend Kris, Matt and I set out on a waterfall hunting expedition. The area of the Cobequid Mountains (on the way to Chignecto) has no less than 15 waterfalls, of varying accessibility, just waiting to be visitid. So armed with a map, and sometimes directions, we began. \r\n\r\nWe managed to visit 10 waterfalls over 2 days. Some were easy to get to, and some were difficult. Some were spectacular and some were mundane. I was impressed by the variety, too. Each one had its own quirky personality, and the longer I spent exploring one the more impressed I would become. Read about each one below in the order they were visited. I won't give away comeplete directions, though. That would ruin all the fun.  (GPS data attached is only for Ward's Falls.)\r\n\r\nLondonderry Falls\r\nThis waterfall can easily be seen from the gravel road in the village of Londonderry. I found the waterfall to be pretty non-descript, but that may have had to do with our vantage point from the bridge a couple hundred feet above. We didn't bother trying to find our way down the steep slope, but it still counted as a sighting so we moved on. \r\n\r\nEast Bass River Falls\r\nOnce we hit the town of Bass River, we turned north, and the west down another gravel road. Taking our first right on a rougher road started us toward East Bass River Falls. We used some technology to determine the best place to get out and bushwhack. Of course, we pretty much headed for the river and the went upstream. The riverbanks were steep and muddy, but it didn't take long to get there. I hardly had time to notice the hornet's nest I had walked through, and the stings I had received! \r\n\r\nThese falls are short, but plunge into a deep, dark pool that looked ideal for swimming on a hotter day. Kris scampered around the surrounding hills and explored further upriver where another small waterfall can be seen. \r\n\r\nWest Bass River Falls\r\nReturning back to the turnoff from the main gravel road we headed further west and found the best place to stop and get out. The map shows a cart track somewhere in the area, but we were content to bushwhack straight to the river the hard way. This waterfall is much taller than its sister, and the water splits and reunites among the rocks on its way down to a shallow pool. The surroundings are much steeper, and made for interesting scrambling in trying to get to the top. Matt made it first but didn't make it easy to get a photo. \r\n\r\nEconomy Falls\r\nWe've been to these Falls before. But it's very accessible and always worth a look. These falls must have been impressive before they had collapsed, considering its power now. The water pours out of a small canyon and collects in small pools before continuing at right angles until it calms down along the river. Kris was saddened that he couldn't explore very easily upriver. The water was rushing and made for some very slippery rocks. We took some pictures and refilled our water before leaving. \r\n\r\nHarrington Falls\r\nI think this waterfall is my favorite. Turning north on the Lynn Mountain Road we looked for the proper place to park. Look for a small grassy clearing on the left. It should have survey tape and garbage piled about. From here, follow the ample survey tape as the trail begins to descend drastically. Getting there only take 15 minutes. Getting out is a little more strenuous. As we ambled down the side of the gorge, a thin water spout came into view. I was initially unimpressed. A thin little column of water? But as we reached the bottom, the whole thing came into view. A wonderful round pool surrounded by tall, overhanging cliffs. At the top was a thin stream of water relentlessly plunging into the pool below. What made it so interesting was that the water came out so far that we could walk behind it without getting wet. You can watch this water suspended in mid-air from any side. Kris was a little sad yet again as these cliffs could not be climbed, denying us a view from the top. \r\n\r\nNorth River Falls\r\nThe next morning we set out for North River Falls. If you have a good vehicle and don't care about it's appearance, you can drive most of the way to it. Kris pushed the van along a narrow track closed in by trees, branches scraping the sides loudly. We had to stop soon enough and continue on foot down and easy trail. As we descended, ropes were provided to assist on the slippery hills. \r\n\r\nAt the bottom we were greeted with a classic waterfall. A straight, vertical column of water plunging over a high precipice. There was even a slight mist in the morning air. Kris and I scrambled our way up some loose rock unitl we reached the top to take in the view from above. Definitely a nice waterfall considering its accessibility. \r\n\r\nWest Moose River Falls\r\nThis one was tough to get to. We had trouble finding an adequate spot to start the hike and ended up hiking through fallen dead trees that made our footing insecure. Next was a steep descent that was tough on my ankles. Soon we hit the river and hopped our way along the rocks until we found the falls. This is another fairly small waterfall, with water tumbling in many different directions. Further up river there was a lot of debris, which eventually leads to a dam which has seen better days. From here we decided to just go straight uphill and hit the road wherever we came out. The slope was ridiculous, but that's out style. \r\n\r\nHidden Falls\r\nThis next one had us confused for some time, as we were relying on obsolete information. After walking up one wrong dirt road and then trying another, we found our way to the waterfall by following the sound. I wasn't impressed immediately as I took pictures while standing on an old observation platform. It's only when I left its confines and scampered further in that I was rewarded. I was essentially standing in a pit with a shallow pool at the bottom, fed by a sheet of water dribbling down a sheer rockface. I got a slight sense of claustrophobia when I looked at the cliffs hanging over us. \r\n\r\nOn leaving the waterfall, we found a much easier way out. A short 2 minute walk down a wide, level path brought us back out behind the parked van. We're so competent sometimes. \r\n\r\nGreville Falls\r\nThis one was easy. Turn north in Greville and follow the road to North Greville. It turns to gravel and begins to wind uphill. As we rounded a bend we saw it. Right beside the road sits a utility pole. We got out and walked up to a short ledge. Beneath us lay a water course pouring itself through several large boulders. Kris found a tricky way to the bottom for a better photo and then we were back on the road. \r\n\r\nWard's Falls GPS Data Attached\r\nWard's Falls is actually on the Diligent River, and was the only real hiking we had to do. Starting from the trailhead we followed this level 3.5 km trail as it meandered along the river. It crossed the river at about 13 different points along the way. Having an easy time of it, we reached the falls in about 40 minutes. The waterfall itself is pretty boring. The real entertainment lies above the falls and justifies the existence of a wooden ladder bolted to the rocks. \r\n\r\nWard's Falls pours itself out of a cavern formed by the high cliffs leaning overhead. I felt like a little boy when I peeked into that dark cave. Me and Kris put on our water shoes and started to explore. The river trickles through this dark cave and is both shallow and deep in places. Wading through some cold, waist-deep water brought us to another small water spout. With Kris' help I was able to scramble straight up it, water splashing in my face. Picking our way along the rock face brought us to the end. A deep pool fed by a rushing water spout pouring from sunlit hole. We could have climbed all the way out if it hadn't been wet, steep and slimy. We had to settle for a photo that numbed my toes. \r\n\r\nWe haven't even seen all the waterfalls to be found in the area, but it was still a rewarding weekend. With some maps and a little research, you can find some of these yourself. If you need directions, I just may be able to help. \r\n\r\nUsed with permission\r\n\r\n\r\nGPS beta (UTM)\r\n\r\nEast Bass River Falls - 0439020E 5035391N\r\n\r\nEconomy Falls - 0428116E 5033011N \r\n\r\nGreville River Falls - 0378628E 5031985N \r\n\r\nHarrington Falls - 0412390E 5034107N \r\n\r\nHidden Falls - 0402626E 5031291N \r\n\r\nLondonderry Falls - 0452017E 5037437N \r\n\r\nNorth River Falls (Cobequid) - 0415354E 5031532N \r\n\r\nWard's Falls - 0388938E 5033431N \r\n\r\nWest Bass River Falls - 0436189E 5034339N \r\n\r\nWest Moose River Falls - 0405785E 5031889N",
    "directions": "Along the 209 secondary highway, from Parsboro, as well as along route 2 from glenhome in the economy region and 5 islands communities.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/1555/reg_greville1jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1555/reg_hidden2jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1555/reg_wardsfallsjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1555/narrow_NR1jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1555/narrow_economy1jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1555/narrow_harrington3jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1555/narrow_hiddenfalls-22378.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1555/narrow_londonderryfalls-22378.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1555/narrow_westmmoseriver1jpg.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/cobiquid-waterfalls-series-economy-region-near-wallace-ns-1555",
    "stats": {
        "Activities": "climb hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "21 hrs",
        "Total Distance": "10 km",
        "Town": "Wallace, NS",
        "Type": "out-and-back"
    },
    "title": "Cobiquid Waterfalls series Economy region",
    "trail_id": "1555"
}