{
    "description": "Nymph Falls is a nice place to go for a quick (1 hour or so) walk.  We have been lucky and have seen a bald eagle almost every time we have visited. In the fall there are tons of salmon making their way up the river.  Also, there are lots of nice big trees and lots of rainforest-like areas, wet moss, ferns and mushrooms.  A good viewing of them is at the falls where there is a fish ladder.  In the summer you can swim here as well.  The trails are well maintained, and scattered throughout are posts with maps on them.  The walk we do starts from the parking lot toward the river, then hang a right on midline trail.  Then at the junction make a left on lower trail.  Stop at the falls for a while and enjoy yourself.  Then keep going on now short loop, which then turns into long loop.  At the junction head left until you see a posting for midline trail, follow this until you get back to the main trail, then make a right to the parking lot.  Should take you about an hour.",
    "directions": "From highway 19 head north to Courtenay, at the second exit make a right, Piercy Rd.  Make a right at the first road it will be Forbidden Plateau Road (it might be called Piercy Rd on some old maps).  Follow this over the highway 19, keep going until you see a sign on your left for Nymph falls.  If you reach a dirt road you have gone to far.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/1559/reg_100-0390-13873.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1559/reg_100-0391-13873.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1559/reg_100-0400-13873.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1559/reg_NymphFalls2jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1559/reg_best1_NymphFalls3jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1559/topo_NymphFallsMapJPG.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/nymph-falls-near-courtenay-bc-1559",
    "stats": {
        "Activities": "hike mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "4 km",
        "Town": "Courtenay, BC",
        "Type": "out-and-back"
    },
    "title": "Nymph Falls",
    "trail_id": "1559"
}