{
    "description": "Snowshoeing at Mt Seymour is fantastic as long as you go properly prepared and follow the rules of Backcountry travel in Winter paying close attention to the Avalanche advisories that the website http://www.avalanche.ca/ puts out on a regular basis. You have to travel alongside the Mt Seymour downhill ski area at first before getting to the backcounty area. Snowshoes and/or Crampons depending on the trail conditions are needed as the backside on the way up can get pretty steep. There are many viewpoints along the way to view the lowermainland of BC and beautiful views of the Fraser Valley and beyond out into the Strait of Georgia. Second pump is far more accessible than the third pump aka the main peak as it becomes very windswept and icy and the trail can become very harrowing if a sudden west coast storm decides to drop in and prevent visibility from allowing you to safely continue. Always be prepared to spend an emergency over nighter in this case and you'll enjoy the trip a lot. Safety first.",
    "directions": "Take the Trans Canada Highway over the 2nd Narrows bridge and get off on the Mt Seymour Parkway Exit. Then follow the signs for the Mt Seymour Provincial Park Ski Area until you finally arrive at the main aprking area. Go to the very end of the parking area where you will see trails marked with orange marker tape. Follow the the trails along side the Ski Runs up and over the Maintained Downhill Ski area unitl you come to the backside of the hill and then follow closely to the trail markers and your final destination awaits you.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/1569/reg_Seymoursnowshoe1jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1569/reg_Seymoursnowshoe2jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1569/reg_Seymoursnowshoe3jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1569/reg_Seymoursnowshoe4jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1569/reg_Seymoursnowshoe5jpg.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mt-seymour-2nd-pump-near-vancouver-bc-1569",
    "stats": {
        "Activities": "ski-bc hike snowshoe",
        "From": "",
        "Seasons": "winter",
        "Stars": 4,
        "Time": "5 hrs",
        "Total Distance": "10 km",
        "Town": "Vancouver, BC",
        "Type": "out-and-back"
    },
    "title": "Mt. Seymour - 2nd Pump",
    "trail_id": "1569"
}