{
    "description": "NTS Map: 082g16Elevation Gain: 610 m (2,000 ft). A great shoulder season option! (We did this hike on March 6th, 2005).The Bob Creek Wilderness in the Whaleback area provides a number of interesting hiking opportunities. Be warned that this is a multi-use area and there are lots of ATV trails here. It's an awesome place to hike in the spring before ATV'ers are out in full force though.My GPS waypoints are provided (mapped out after the fact using Ozi Explorer). We did not follow a trail... the Whaleback is an area of wide open spaces and there are game trails all over the place, so you can easily make your own hike.We started off from the Bob Creek Wilderness Parking and crossed up the ridge to the West and into the Camp Creek valley, then climbed up  the next un-named ridge above 'Miles Coulee'.We saw several herds of elk along the way, the largest a group of about 74. The Whaleback is an important over-wintering grounds for the elk, and apparently the herds can be huge in the wintertime. Returning, we encountered a lot of snow on the North side of the ridge (there was no snow at all on the South facing slopes). We made the mistake of following the ATV trail which seemed to go up and down like a rollercoaster on the way back, which took us quite a while to drop down to the Camp Creek Valley. We followed Camp Creek for quite a ways before climbing the ridge back into the Bob Creek valley which returned us to our cars. The paths were still mostly frozen, which was good, since there could potentially be a lot of mud in those paths alongside the creeks!",
    "directions": "Driving North on highway 22, watch for the Oldman river. Cross the bridge and turn left immediately onto the dirt road that parrallels the Oldman (on the North side of the river). Pass the parking area next to the bridge and continue up  this road to the very end to the Bob Creek Wilderness area. This road crosses private ranchland but right-of-way exists to get to the Bob-Creek Wilderness area.  Do not park elsewhere along this road and hike in the Whaleback unless you have permission from the farmers! See map 82 G16",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/1574/reg_bigtreesJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1574/reg_elkJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1574/reg_lunchJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1574/reg_mountiansJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1574/reg_returningJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1574/topo_whalebackhikemapjpg.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/miles-coulee-ridge-whaleback-area-near-blairmore-ab-1574",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 3,
        "Time": "7 hrs",
        "Total Distance": "16 km",
        "Town": "Blairmore, AB",
        "Type": "out-and-back"
    },
    "title": "Miles Coulee Ridge (Whaleback Area)",
    "trail_id": "1574"
}