{
    "description": "NTS Map: 083C12Elevation Gain: 610 m (2,000 ft).No Dogs: The Bald Hills has been identified as critical Woodland Caribou habitat, a threatened Species-at-Risk in Canada. In an attempt to reduce stressors on this disappearing icon of the Canadian wilderness Parks Canada has banned dogs from all Caribou habitat in Jasper National Park.The Bald Hills Trail in Jasper National Park is a pleasant but at times steep hike up an old fire road to what is, without a doubt, the best viewpoint overlooking Maligne Lake. \tCross the paved road above the parking lot and head up the gated fire road to the old fire tower lookout site. Pretty simple, éh! Well the 480m of elevation over 5km will challenge most hikers. \tThere are several trail junctions along this fire road in the following order: 1) To the right of the gate is signed trailhead to the Skyline Trail , Lorraine and Mona Lakes Trail , Lorraine Lake Loop and the Evelyn Creek Loop. 2) 300m up the fire road on the left is the signed trail leading to the Moose Lake Loop, Upper Moose Lake Loop and the Maligne Pass trail. 3) On the right at 1.3km is an unsigned junction that leads to the Lorraine Lake Loop. This trail is too wet for summer and is almost exclusively used by x-c skiers in winter. 4) There is a signed junction on the left at 2.5km. This is the shortcut trail to the Bald Hills, it saves a kilometre but is very steep. 5) At 3.2km you'll pass the Evelyn Creek Loop trail on your right. This trail, which connects with the Skyline Trail, is another x-c ski trail and has little to offer in the way of scenery.\tThe official trail ends at the 5km mark, the site of an old fire tower long since torn down, there is an old hitching rail from the days Maligne Lake Tours used to offer horseback trips up the fire road. While the views from the lookout are fine, the obvious road/trail continues for another 2km and 130m of elevation to an even more commanding view of the area from the north summit of the Bald Hills. \tThe signed upper junction of the shortcut trail is passed 75m beyond the lookout site. Cross-country skiers who venture beyond the lookout site should be aware that they are entering avalanche terrain. www.avalanche.ca  The 10km is return distance. Elevation gain is 480m (1,580').Parks Canada produces a day hiking guide of this and many other trails in the park called \"Summer Trails\" which is available for free from the Jasper Information Centre in the Jasper townsite and  the parks desk in the Columbia Icefield Centre.As well, Parks Canada produces a trail guide of this and all other x-c ski trails in the Park called 'Winter Trails', which is available for free from the Jasper Information Centre in the town of Jasper.Submitted by 'mtncat'. In winter please check the local avalanche bulletins and conditions.",
    "directions": "From the town of Jasper drive east for 2km on Hwy 16 and turn right on the Maligne Lake Road. Cross the bridge follow the Maligne Lake Road for 47km and park at roads end.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/1581/reg_313-10963.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1581/reg_Bald-hills-Jasprer-NP--36703_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1581/reg_Cassie-Leo-Bald-Hills-1208-57752.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1581/reg_Cassie-Leo-Bald-Hills-1262-57752.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1581/reg_MaligneLakefromtheBaldHills.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1581/reg_image-44599.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/bald-hills-near-jasper-ab-1581",
    "stats": {
        "Activities": "snowshoe hike",
        "From": "",
        "Seasons": "winter fall summer",
        "Stars": 4,
        "Time": "4 hrs",
        "Total Distance": "13 km",
        "Town": "Jasper, AB",
        "Type": "out-and-back"
    },
    "title": "Bald Hills",
    "trail_id": "1581"
}