{
    "description": "NTS Map: 083G09This is 1 of 4 trails in Chickakoo Lake Recreation Area in Parkland County just 25 minutes west of Edmonton, AB.  It is a short (the route shown by map / GPS) but moderate hike and classified as an intermediate ski. There are also many other trails in the trail network (see PDF).  Activities allowed on this trail are hiking, biking, snowshowing, cross country sking, and horseback riding in summer.  For the most part this trail is 3 m wide and follows the rolling hills in beautiful parkland forest.  For skiers, there are some short but steep sections.  This trail connects with Natures Way and the more strenuous Woodland Lookout.  There are some picnic tables and benches to stop at and watch the plentiful wildlife.  In the park there is a boat launch, mainly designed for canoes.  There are pit toilets at the main parking lot, the boat launch, and at the halfway point of the trail.",
    "directions": "Quick version: take exit 355 north from Hwy 16 and follow the signs for Chikakoo Lake. In detail, from Edmonton go west on Hwy 16 or 16A to Stony Plain. Turn right (north) on Hwy 779 (exit 355 from Hwy 16). Go 6.5 km north of Hwy 16 and turn left (west) on Twp Rd 540 at the sign for Chikakoo Lake. Go 5 km and turn left (south) on Rge Rd 13 at another Chikakoo Lake sign. Rge Rd 13 turns into the Coyote Highway (Twp Rd 535). Pass the boat launch and main parking lot on the left, which is a different trail-head. Park at the recently renovated equestrian parking lot on the left.Trail maphttp://www.parklandcounty.com/Assets/Recreation/Parks+and+Natural+Areas/Chickakoo+Trail+Map.pdf",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/1582/reg_map.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1582/narrow_Chickakoo-Trail-Map-17080_best1_.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/chickakoo-cranberry-corner-near-edmonton-ab-1582",
    "stats": {
        "Activities": "snowshoe hike ski-xc mtn-bike",
        "From": "",
        "Seasons": "winter fall summer",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "33 km",
        "Town": "Edmonton, AB",
        "Type": "out-and-back"
    },
    "title": "Chickakoo - Cranberry Corner",
    "trail_id": "1582"
}