{
    "description": "NTS Map: 083C12I've hiked, biked, and skiied portions of this trail.  Bikers are advised to stop biking once they reach the swinging bridge; rough go after that point.  I've never cross country skiied or snowshoed past Big Bend Campground.Hiking (what i know best;)):We started late, nearly 7 pm.The initial 8 km are a very gradual downhill walk on a very wide open trail (an old road actually).  The trail is muddy in some sections and can supply breeding areas for mosquitoes.  Still a very good trail.  We stopped at Big Bend for five minutes before heading on to Athabasca Crossing Campground.  THIS WAS A MISTAKE.  As it was 9 pm we should have stopped and stayed at this beautiful campground.  Big Bend is a nice destination in itself, for a short and easy camping trip (or day hike).  The view of mount Quincy and Dragon Peak is beautiful (see pic).We continued to Athabasca Crossing and found the trail to be narrower but not an aweful lot rougher.  We reached Athabasca Crossing Campground (14.5 km) by 10:30 pm (an hour after sunset).Off to a late star we set out to Fortress Lake at 10:30 am.  GO EARLIER THAN THIS!  After crossing the swinging bridge, the trail becomes very rough and constantly climbs up and down.  At 18 km you have to cross the Chabba River, this is why you go early, the water level can be over knee deep and unsafe to cross.  The rest of the trail is very vague, until you cross the boarder into B.C.  An in the blink of an eye you are at Fortress Lake.  Beautiful and apparently good fishing.We returned an hour later.  Before crossing the AB boarder we came across the largest black bear I've ever seen (>400 lbs!).  The river ford was tougher as the water levels were higher (think of that -- maybe stay over night at Fortress Lake rather than Athabasca Crossing Camp)  We returned to Athabasca Crossing Camp, had a fire as there was little else to do at this uninspiring campground (actually one of the worst I've stayed at).  The next morning we were off by 10:30 (again) and on the road by 3:30 pm.",
    "directions": "Sunwapta Falls (yes the bridge you stand on to view the falls) Highway 93 Jasper National Park, 53 km south of Jasper Townsite -- aprx 50 km from north of the Columbia Icefields.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/1583/long_DSC01077-22384_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1583/long_DSC01084-22384.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1583/long_DSC01086-22384.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1583/long_FromBigBend.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1583/long_fortress-11997.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1583/reg_fortlake1-12045.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1583/reg_fortlake2-12045.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1583/reg_fortlake3-12045.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1583/reg_fortlake4-12045.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1583/reg_unamedlakeatAthabascacrossingcamp2.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/fortress-lake-via-jasper-park-near-jasper-ab-1583",
    "stats": {
        "Activities": "snowshoe hike ski-xc mtn-bike",
        "From": "",
        "Seasons": "winter fall summer",
        "Stars": 4,
        "Time": "14 hrs",
        "Total Distance": "50 km",
        "Town": "Jasper, AB",
        "Type": "out-and-back"
    },
    "title": "Fortress Lake via Jasper Park",
    "trail_id": "1583"
}