{
    "description": "Well we were in for a nice surprise when we arrived at the trailhead at Gold Run Pass which seemed to be about twice as far along the road as we had expected it to be. Turns out, the trail description in Don't Waste Your Time in the North Cascades is a wee bit out of date. We had been prepared for \"relentlessly steep\" and \"more of a route than a trail\" but what we actually got was a marvelously graded gentle climb up into the alpine.\r\rIt was stinking hot the weekend we did this trail so we tried for an early start, arriving at the trailhead around 9am. There were already a lot of cars parked and loads of names in the trailhead register so we were a little nervous about crowds. \r\rAfter a short climb through the trees, the trail breaks out of the trees giving you the first of many many views to come. After the first switchback, you head back into the trees where 4 more long switchbacks gently raise you up into the alpine. Took us about an hour and a half in serious heat with full overnight packs on. The trail branches off to Tomyhoi Lake but we continued on towards Yellow Aster Butte. \r\rThe next stretch of trail climbs gently up around the sides of the valley through meadows of beautiful wildflowers with butterflies to keep you company. It's hard to keep putting one foot in front of the other because the views are so spectacular. Baker, Goat, Shucksan... the views just get better and better. \r\rAfter crossing a stream and a couple of patches of snow, the trail turned towards Yellow Aster Butte & the beautiful tarns where you can camp. One final stretch through colorful meadows brings you to the trail to Yellow Aster Butte  on the right. (If spending the night, decend the steep trail down to the tarns to set up camp or stash your packs here & scamper up now.)\r\rThe trail climbs through meadows for a little while, then takes you up and down a few bumps before you reach the end of the raod. \r\rUnfortunately there was a forest fire burning right between Baker & Shucksan which made a nice mess of our views of those peaks, but the views to the North were beautiful. American & Canadian Border Peaks & Tomyhoi were prominent with many other minor peaks & ridges complimenting the view. Looking down on the tarns, they looked like sparkling jewels scattered among the rocks. \r\rThis trip could be done as a day trip but I wouldn't recommend it unless you only want to do Yellow Aster Butte. There's just too much to explore. We could easily have spent another day.\r\rDon't forget to pick up a parking pass at the Glacier Ranger Station on your way.\r\r",
    "directions": "From the Sumas Border crossing, turn left and go east on Halverstick Road. Turn right on to Sumas Road and right again on to Reese Hill Road which becomes Kendall Road and joins up with the Mt. Baker Hwy. Stop in Glacier for your parking pass and then continue along the Mt. Baker Highway 542 for 12.0 miles to Forest Service Road #3065 (Twin Lakes Road). The road is located on the left hand side of the highway just beyond the Department of Transportation's Shuksan maintenance facility. Turn left on Twin Lakes Road and continue approximately 4.5 miles to the Tomyhoi Lake/Yellow Aster Butte Trailhead.",
    "geohash": "c29q",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/WA/1586/long_Lunch-Spot-Gold-Run-Pass-scm-c-13724.jpg",
        "https://trailpeak.com/storage//content/trails/US/WA/1586/long_YABscm-13724.jpg",
        "https://trailpeak.com/storage//content/trails/US/WA/1586/reg_-MG-7253scm-13724.jpg",
        "https://trailpeak.com/storage//content/trails/US/WA/1586/reg_P7240028jpg.jpg",
        "https://trailpeak.com/storage//content/trails/US/WA/1586/reg_P7240036jpg.jpg",
        "https://trailpeak.com/storage//content/trails/US/WA/1586/reg_P7240039jpg.jpg",
        "https://trailpeak.com/storage//content/trails/US/WA/1586/reg_P7250095jpg.jpg",
        "https://trailpeak.com/storage//content/trails/US/WA/1586/reg_P7250107jpg.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/yellow-aster-butte-near-us-city-1586",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 5,
        "Time": "7 hrs",
        "Total Distance": "7 km",
        "Town": "US City",
        "Type": "out-and-back"
    },
    "title": "Yellow Aster Butte",
    "trail_id": "1586"
}