{
    "description": "NTS Map: 083C12Note - this is a 2-5 day trip.A canoe trip on Maligne Lake is a surreal experienced not to be missed, the farther away from the boat launch you get the better the scenery becomes. Mountains that stand back at the north end of the lake seem to creep closer with every stroke of paddle. Soon your neck is kinked from staring up at ancient glaciers and waterfalls so high that the wind can whip them away before striking the ground. Reaching the southern half of the lake, a magical transformation takes place as the water changes colour from blue to aquamarine.\r\nNestled high in the Canadian Rockies within Jasper National Park, Maligne Lake has been blessed with more than it's fair share of scenery. Home of world renown Spirit Island, Maligne Lake also sees more than it's fair share of visitors, a million annually. Despite the tour boats that ply the waters between from 9am to 6pm, this flatwater trip still scores top ratings. Besides, the tour boats only go as far as Spirit Island, leaving the last and most majestic 8kms of the lake to the paddler.\r\nAt 22 kilometres long Maligne Lake is the second largest glacial fed lake in the world and the water is understandably cold, 4 degrees celsius on average. The lake is subject to strong and sometimes erratic winds that can stir up large waves in a matter of minutes. The big mountains, especially at the south end, block the view west giving very little warning of an approaching storm. Paddlers are well advised to keep close to shore and wear a life jacket at all times. The lake tends to be calm till mid morning so an early start of 6-7am is advisable. \r\nThere are only two campgrounds along the length of the lake with a total of 16 tenting sites. Fisherman's Bay c/g is located 13km down the east shore within the protective embrace of The Narrows. While Coronet Creek c/g is 21.3km down the west shore, nearly at the far end of the lake. Both campgrounds are equipped  with a boat dock, eight tent pads and eight roomy food lockers, four picnic tables and four fire pits. There is a single cute little privy out back of each campground that goes by the nickname 'The Green Throne'. The Park does not provide firewood so most people use gas stoves. \r\nThere are also four picnic sites along the lake in the following order: 'Trapper Creek' on the west shore at 4km, 'Four Mile Point' is on the east shore at 5km, at 10km on east shore is 'Sampson and finally 'Spindly Creek' is 17km down the west shore. All four are marked by large picnic table signs, have a single table but no privy. Please go to the bathroom responsibly, if unsure how please consult the book 'How to Shit in the Woods' by Kathleen Meyer.  \r\nMoose are frequently seen along the shoreline, particularly in avalanche paths. These gangly legged creatures are regular visitors around Fisherman's Bay c/g and can sometimes be seen swimming across the lake. Grizzly Bear also roam the shore of the lake so be sure to keep your camp clean, otherwise you might have an unexpected dinner guest. Osprey can be seen circling over the water in search of trout and if you're lucky you'll see one snatch it's dinner from the lake.\r\nFishing is permitted by humans from late May through September but requires a National Park Fishing Licence. Rainbow and brook trout are the only two species in the lake and add nicely to the larder. Keeping the speckles in spring when the rainbow are spawing and vice-versa in fall will ensure that the fish won't taste...well, too fishy. Spinners and spoons work well, as does trolling a fly line, but the favorite is a medium sized wobbler followed by 30cm of line with a tied fly on the end. New fishing regulations include a ban all lead sinkers and jigs and a complete ban on bait, which includes scented oils. The Park has been toying with the idea of barbless hooks but has yet to make the change.\r\nOther than the tour boats and the Warden's patrol boat, gas powered motors a prohibited in Jasper National Park. Electric motors are permitted but require heavy batteries to run. If you are using an electric motor ensure you have enough batteries for the duration your trip and paddles or oars in case you don't. While sailboats are not prohibited, they are definitely not recommended. The erratic winds, unmarked rocks and difficulty of navigation in The Narrows makes sailing on Maligne Lake a hazardous proposition. \r\nThe campgrounds on Maligne Lake are very busy and canoeist are well advised to book their trip up to three months in advance with the Jasper Trail Office 1-780-852-6177, fees apply. Due to it's popularity the Park limits Maligne Lake canoe trips to four nights, but the trip can be lengthened by combining it with a backpacking trip up the Henry Macleod Trail. The Park also limits group sizes to six people but does make exceptions for large families.\r\n\r\n\r\nBackpacking trips can be combined with paddling here, to access some of the remote peaks of the area. An excellent option is to take along a  super light packraft from \r\nAlpacka Raft.\r\nPackrafts get you to some wild places, where lakes and rivers are no \r\nlonger an obstacle to the backpacker! \r\n\r\n\r\nFor maps of the lake, The Friends of Jasper sell the government topos @ 1:50,000, of which you'll need two 83 C/11 Southesk Lake and 83 C/12 Athabasca Falls, or the Gemtrek map called 'Jasper and Maligne Lake' @ 1:100,000. Canoes can be rented locally from fishing outfitters such as http://www.jasperoutdooradventure.com or http://www.malignelake.com/canoe.html.Submitted by 'mtncat'\r\nIn winter please check the Avaluator\r\n(Online Trip Planner) rating is: \r\n Simple.  \r\nSee more trip planner route details here.\r\n\r",
    "directions": "From the town of Jasper drive east for 2km on Hwy 16 and turn right on the Maligne Lake Road. Cross the bridge follow the Maligne Lake Road for 47km and park at roads end. The boat launch is just below the parking lot.",
    "geohash": null,
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/1588/reg_IMGP1332-28329.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1588/reg_IMGP1338-28329.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1588/reg_IMGP1344-28329.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1588/reg_IfIstandreallystill.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1588/reg_P1010179-11567.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1588/reg_SpiritIslandfromshore.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1588/reg_map.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1588/narrow_TheAlumipigonMaligneLake.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/maligne-lake-near-jasper-ab-1588",
    "stats": {
        "Activities": "river-canoe sea-kayak",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 5,
        "Time": "0 hrs",
        "Total Distance": "22 km",
        "Town": "Jasper, AB",
        "Type": "out-and-back"
    },
    "title": "Maligne Lake",
    "trail_id": "1588"
}