{
    "description": "March's Winter Paddle\r\rWell, the month was getting on, and we still hadn't made it out for our \"Once-a-month, even-in-Winter\" paddling. Last two months had put us in Souris, where the water was deep enough to keep ice, to pardon the pun, at bay.\r\rIn the party this time Â?round was of course Ian MacAdam, and new to the winter paddling crew, Shannon Farrell, the newly wed. Newly wed to none other than myself! This was her first time paddling around in ice.\r\rThe conditions were not so great for Souris's previous let ins, so we went further on to Basin Head, a destination we've been vying for a while, but had been iced in on every opportunity until now.\r\rBasin Head is a beautiful provincial park beach in the summer, and is home to a fisheries musium. A few years ago, a storm surge lifted most of the shore front warf infrastructure into haphasard heaps.The musium of course is up on the hill, and was uneffected by the storm.\r\rNot a whole lot had opened up, but we were desperate to paddle the area. The location has a channel of water running from inland sources through what looks like a canal. We chose to launch from a spot half a kilometer up stream at Dorry Warf. We'd be able to inspect the shore damage, and get out into the Northumberland Strait that was beginning to open up.\r\rBoth Shannon and I launched in a traditional way, while Ian took a more adventurous approach by using the snowey grade to slide in to the water. It was quite a ride, with no mishaps.\r\rAlong the canal, we saw a nice mini waterfall with the spray iceing up the branches near by. There are very few waterfalls on PEI. This one is probably more of a trickle, made slightly better with spring run off.\r\rOnce in the strait, we were able to paddle some open water, and with a bit of courage, headed into the thinner ice pack. It starts off like a slushy, and at some point, you have to dig  your paddle in to get purchase. Raming is yet another technique that proves useful in getting through icy sections. You paddle like crazy, and put your kayak up onto a spot of ice. If it's thin enough, you can wiggle your hips, and the ice beneath will give way. Otherwise, shuffling or using your paddle as an ice axe is another option. Most often others  simply follow the opening you've created, but since there was wind, and current involved, those openings close over, doubling the effort to get home.\r\rOur outting lasted for about an hour and a half. We headed back in a head wind, and semi strong current, but made it back to the dock with no problems.\r\rThat evening, shannon and I stayed in Souris at A Place to Stay Inn. A great spot for groups to stay. The building use to be a nunnery, and evidence of that can be seen in some of the common rooms. Our room was very quaint. We even cooked up a romantic cheese fondou. It was a great way to wrap up a day in the Souris region. Thanks Betty for the stay!\r\rSouris is trying to promote more winter activity in their region. They really grabbed ahold of our kayaking story to support their claim. Other similar adventurous outtings have been accomplished by others like kite skating on the Souris pack ice. A guy from the Magdelain Islands who runs AeroSport really liked the terrain Souris had to offer for that discipline. Souris also has a nice cross country ski area near Harmony junction too.",
    "directions": "Take Route 2 past Souris, headed East.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/PE/1590/reg_basinhead.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/1590/reg_buildings.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/1590/reg_headingout.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/1590/reg_icedup.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/1590/reg_launch.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/1590/reg_placetostay.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/1590/reg_three.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/1590/topo_musium.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/basin-head-in-winter-near-souris-pe-1590",
    "stats": {
        "Activities": "sea-kayak",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "2 km",
        "Town": "Souris, PE",
        "Type": "out-and-back"
    },
    "title": "Basin Head in Winter",
    "trail_id": "1590"
}