{
    "description": "NTS Map: 083C12Elevation Gain: 835 m (2,740 ft).Note - this is a 3-4 day backpack.The Fryatt Valley in Jasper National Park is a fantastic trip up a narrow valley lined with impressive mountains, including Brussels Peak which was among the last of the unclimbable's to be conquered in the Canadian Rockies. \tThe first 11km to Lower Fryatt c/g are far from inspiring as the trail makes a long approach trough the forest to the creek that drains the valley. Parks Canada has kindly permitted mountain bikes on this section of trail, which saves time, energy and sanity. \tLock up the bike near the campground and push-on on foot. The trail crosses the creek next to the campground and begins a long forested climb on the east side of the creek. At 16km the climb is behind you and crossing back to the west side of the creek the views improve. A couple of easy and very enjoyable kilometres later and you pull into Brussels c/g (aka: Old ACC).The c/g is blessed with a commanding view of it's namesake and much of the upper valley as well. Brussel's c/g is warm and sunny during the day and it is almost always dry. This c/g is the place to be in the Fryatt Valley.\tBeyond Brussels c/g the trail crosses a kilometre wide rock slide then passes along the west shore of Fryatt Lake. It's not too much farther to Headwall c/g at 21km but the twisting rooty track will make it seem farther than it really is. \tHeadwall c/g, nestled at the base of an avalanche slope tends to be soggy in the early season. But with a good ground sheet and the tent placed just so, you'll have the waterfall cascading down the headwall framed through the door of your tent as you sit inside hiding from the mosquitoes. \tThe headwall itself is a whopper, the trail gaining 200m in less than a kilometre. Just over the top of the rise is the Alpine Club of Canada's, Sydney Vallance Hut at 22km. http://www.alpineclubofcanada.ca/facility/fryatt.html.\tA short distance past the hut the trail crosses a creek from the right. The trail that branches right and follows the creek is a climbers trail that can be used for further exploration. Stay on the main trail as it passes through wildflower meadows, past the entrance to an under ground stream and finally to the shore of the upper lake where the trail ends at 23km. \tThere are numerous opportunities for further exploration in the valley for those with the curiosity and skill to proceed.  You'll need the 1:50,000 government topo 83 C/12 Athabasca Falls for 99% of the trail and 83 C/5 for the final 1% with includes only the uppermost sections of the valley. Or Gremtrek 1:100,000 \"Jasper and Maligne Lake\" which has the whole trail.\tThe valley is busy on long weekends but can normally be booked mid-week on short notice without too much trouble. Registration is required and fees apply, call the Jasper Trail Office at 1-780-852-6177 or drop by the Jasper Information Centre to book.Submitted by 'mtncat'.In winter please check the local avalanche bulletins.",
    "directions": "From Jasper drive south on the Icefields Parkway (Hwy 93) for 30km to the turn off at Athabasca Falls. Turn right and follow Hwy 93a for just over a kilometre and turn left on the Geraldine Fire Road. Follow this narrow bumpy road for 2km to the unassuming parking area. Marked by the Parks trailhead kiosk, the parking slips are scattered along the road.  The Geraldine Fire Road is not for vehicles with low suspension, leave the sports car at home.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/1592/reg_310.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1592/reg_311.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1592/reg_316.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/fryatt-valley-near-jasper-ab-1592",
    "stats": {
        "Activities": "hike ski-xc mtn-bike",
        "From": "",
        "Seasons": "winter fall summer",
        "Stars": 4,
        "Time": "24 hrs",
        "Total Distance": "46 km",
        "Town": "Jasper, AB",
        "Type": "out-and-back"
    },
    "title": "Fryatt Valley",
    "trail_id": "1592"
}