{
    "description": "NTS Map: 082G10\nAs shown in the attached map, there are a variety of groomed cross-country trails to choose from. Signage in the main ski area is excellent, but be aware that there is little signage in the multi use trails on the periphery, and there are other skidoo trails that branch off that are not shown on the ski map. A GPS would be an excellent accessory for the multipurpose trails in case you take the wrong path, or alternatively, leave behind some 'cookie crumb' markers in case you decide to retrace your steps. \nI did a solo ski of the outer loop, which included the 4.35 km 'Highline Trail' and was quite ecstatic to find myself back at one of the signposts in the main ski area after an hour or so of wondering if I was lost or not! This loop took a bit less than 4 hours and was about 15 kms, according to the map. Points of interest include a ski shelter as well as a biathlon range. On a clear day there should be fantastic views of Crowsnest, Mt. Tecumseh and the Seven Sisters. To extend the day, one could ski down the Deadman Pass trail for a few more hours. For more on the ski area see the website for theAllison Cross Country ski area .\nNo dogs allowed on these trails.",
    "directions": "Exit off of Crowsnest Highway 3 beyond the West end of Coleman (about 6km W of #40). Turn North and follow the dirt road that leads to Chinook Lake (about 2 or 3km) and park at the ski area near the trout breeding station (the road is not cleared all the way to Chinook Lake in the winter).",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/1594/reg_2aJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1594/reg_GE-map-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1594/reg_best1_4aJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1594/reg_kiki-1-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1594/reg_mountain-views-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1594/topo_croppedmapJPG.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/allison-chinook-cross-country-ski-area-near-blairmore-ab-1594",
    "stats": {
        "Activities": "mtn-bike ski-xc hike",
        "From": "",
        "Seasons": "summer fall winter",
        "Stars": 3,
        "Time": "4 hrs",
        "Total Distance": "15 km",
        "Town": "Blairmore, AB",
        "Type": "out-and-back"
    },
    "title": "Allison-Chinook Cross Country Ski area",
    "trail_id": "1594"
}