{
    "description": "NTS Map: 083F10This is a very well maintained trail system thanks to the \"Muskeg Flyers\" Ski Club.A warm-up shelter is at the start of the trails and you have the choice of short 1 or 2.5km loops to longer 15km or greater excursions.  You will ski through deciduous and coniferous stands and will probably not see any other skiers.When there is enough snow, the tracks are set very well with classic and skating trails side by side.  There are only a couple of small hills that require an intermediate skill level to navigate.Distances along the trail are very well marked.In the summer, the trails closest to the shelter/parking lot are dry enough for walking though the longer loops can get pretty soggy.  It is a very nice area in the fall.The GPS data includes the main trails (22.8km)and waypoints for key land marks such as the parking lot, beaver dams and bridges.",
    "directions": "Head west out of Edson on Hwy 16 for 2km past the Rodeo Road (the Town Limits) and turn right (north) on the Shlick Road.  Stay on the Schlick Road or 8.6km until you come to \"T\" intersection.  Turn left (west) and follow the road for about 1.7km to another \"T\" intersection.  Turn right (north) which is the main road and in about 600 metres you will see the warm-up shelter on your left.There are X-Country Ski signs to mark the way.",
    "geohash": "c3t1",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/1595/reg_map.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1595/topo_1595.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/hornbeck-cross-country-trails-near-edson-ab-1595",
    "stats": {
        "Activities": "hike ski-xc mtn-bike",
        "From": "",
        "Seasons": "winter fall summer",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "23 km",
        "Town": "Edson, AB",
        "Type": "out-and-back"
    },
    "title": "Hornbeck Cross-Country Trails",
    "trail_id": "1595"
}