{
    "description": "NTS Map: 082H04. Elevation gain - 650 m (2,135 ft), elevation loss - 1,015 m (3,330 ft).Note: time and distance are one way. Time shown is a non-lingering pace. You may want to stay longer on the ridge, weather permitting. However, it can be very windy on the ridge, so no matter what the weather conditions at Cameron Lake, take adequate clothing.This is one of the premier hikes in Waterton Lakes National Park. The trail begins at Cameron Lake. Turn left for the trailhead, across the footbridge. Follow the lakeshore and quickly enter a forest of towering spruce and fir. Soon the trail begins a series of four switchbacks, each taking about 10 minutes. They allow an easy ascent of the steep forested slope. Catch glimpses of Cameron Lake, Mount Custer and Forum Peak (see  Akamina Ridge)  through the trees as you climb. At 3 km, the switchbacks end and the next 1 km is largely level walking through meadows and open subalpine forest, with views ahead to Chapman Peak. At 4 km you reach Summit Lake (top left photo), backed by Chapman and Custer to the south. At the trail junction turn left for Carthew and Alderson Lakes.Climb away from Summit Lake on a stony path of broken mauve rock, and the steady climb continues as you traverse a steep forested slope. You are heading for barren Carthew Ridge, directly ahead. Views south of Chapman and other peaks grow more and more impressive as you get higher and the trees become more stunted. At 8 km, crest the ridge to stand atop 2,310 m Carthew Ridge. Look east over Carthew Lakes, flanked by  Mount Carthew (left) and Mount Alderson (right), with a glimpse of flat prairie in the distance. To the south are the lakes and mountain views that accompanied you up the scree. But the wind on the ridge can be fearsome and, if it is, even the fabulous views may not persuade you to linger up here for long. When the weather is good, follow the path along the ridge to a bluff for an even vaster panorama.It's all downhill from here. As you descend from the ridge you will encounter a series of small lakes, the Carthew Lakes, surrounded by thick, twisted spruce trees less than 3m tall. Living in this harsh environment, they will never grow any taller. Beyond these lakes is Alderson Lake with its towering 700m cliffs of Mt. Alderson. There is a campground at Alderson Lake, the only one on this trail.From here it's a long 7km trek back to the townsite through the trees, emerging at Cameron Falls.To fully appreciate this trail it should be completed end to end. This, however, require either 2 vehicles or a shuttle service from the townsite. Some photos by Wendy Devent.",
    "directions": "Cameron Lake, at the end of Akamina Parkway in Waterton Lakes National Park. A hiker shuttle runs to the trailhead from Waterton Park townsite ($8 per person)for those who wish to do the entire trail from Cameron Lake to Waterton. The shuttle only runs at 8 am, so plan for that. Buy tickets from the outdoor shop at Tamarack Village Square. The trail ends at Cameron Falls in the townsite.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/1597/reg_DCP_2435.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1597/reg_DCP_2439.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1597/reg_DCP_2440.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1597/reg_DCP_2442.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1597/reg_DCP_2446.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1597/reg_DCP_2448.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1597/reg_DCP_2453.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1597/reg_IMG-0065-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1597/reg_IMG-0073-7064_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1597/reg_IMG-5557-Large--7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1597/reg_Picture-024-21353.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1597/reg_Picture-032-21353.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1597/reg_SummitLake.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1597/reg_aldcarthew-robs-37392.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1597/reg_aldcarthew-robs2-37392.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1597/reg_map.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1597/narrow_Picture-022-21353.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1597/narrow_Picture-025-21353.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/alderson-carthew-near-waterton-park-gate-ab-1597",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "6 hrs",
        "Total Distance": "20 km",
        "Town": "Waterton Park Gate, AB",
        "Type": "out-and-back"
    },
    "title": "Alderson-Carthew",
    "trail_id": "1597"
}