{
    "description": "Mount Matier is the highest summit in the Joffre Group. It is an excellent peak for an alpine ski mountaineering ascent via the Anniversary Glacier route from Cerise Creek and Keith's Cabin.\r\n\r\nIt is possible to ski ascend the entire glacier from where you cross the left lateral moraine as you approach from the cabin. The angle is quite steep initially just to the left of a band of rocks. This route also weaves through the ice fall. An easier alternative is to gain a moderately steep slope up toward the right from the base of the glacier. This connects with an obvious bench which allows easy access to the upper Anniversary Glacier above the rock outcroppings. This bench can also be reached by going up and traversing sparsely forested slopes above the cabin.\r\n\r\nThe summit pyramid is climbed by kicking steps straight up the North Face from the Joffre-Matier col, bypassing a set of large crevices above the col. The snow slope steepens to 45 degrees near the exposed summit ridge. In winter/spring it is best to choose a line with continuous snow cover. Follow the short ridge to the summit but beware of cornices. Most parties will want to bring crampons and some may want to rope up. The ski back down the Anniversary Glacier is often be one of the best of the season on a weekend from Vancouver.",
    "directions": "Start from a parking lot on the Duffey Lake road. A newly constructed bridge crosses Cayoosh Creek within minutes. A second crossing uses a log jam. The trail emerges at the base of a clear-cut and climbs to a landing. Now follow the logging road only to where the winter trail to Keith's cabin turns into the woods (north side of Cerise Creek).",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/1598/reg_Matier_ski.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1598/reg_matier.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1598/reg_matier_map.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1598/topo_Matier_peak.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mount-matier-near-pemberton-bc-1598",
    "stats": {
        "Activities": "ski-bc",
        "From": "",
        "Seasons": "spring winter",
        "Stars": 4,
        "Time": "14 hrs",
        "Total Distance": "12 km",
        "Town": "Pemberton, BC",
        "Type": "out-and-back"
    },
    "title": "Mount Matier",
    "trail_id": "1598"
}