{
    "description": "NTS Map: 092H07 China Ridge XC ski area is a treasure.  It is also a growing MTBike area with new trails being added and promoted for summer use.  The attached track log includes both.\nThe local ski club maintains its winter trails lovingly, and, because it is in the interior just North of Princeton, the snow is often drier and more powdery than the local mountains of Vancouver.  \nThe trails are on a gentle slope, and if you take the ridge trail you can ski all day on an out and back loop.  There is plenty to enjoy in a relaxed, unhurried setting, and the nearby town of Princeton has Motels, grocery, and a number of restaurants to choose from.  There is a recommended day fee, which you place in their donation box.  For the quality of skiing, we think it is a deal.  Great views once you reach the far-end of the trails, and, there is a small lean too just  past halfway, where, you can build a fire and have lunch.  A good day ski might be take you to this point, after which you return on the mostly gentle slope down.  For more information, contact the China \nRidge XC Ski Association, Box 2118, Princeton B.C., V0X 1WO or visit their website. Note: if you use the GPS data (click \"Download GPS data\" for a preview), please note that the start is the set of points on the lower left of the preview map. This track took us from one end of the ski area (near the downhill runs) to the far-end where there is a day-use cabin that is a real treat -- great view, see below!\nDirectionsProceed along main street in Princeton once off HWY  3. Go past the main grocery store, the saloon on the left, and cross the steel bridge and river at the far-end of town (not far). Turn left and follow the signs to the China Ridge ski area, another 5km or so.",
    "directions": "See description and / or GPS",
    "geohash": "c2f",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/16/reg_KT-Slides-A23.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/16/reg_pic1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/16/topo_2DChina.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/16/narrow_KT-Slides-C12.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/china-ridge-xc-near-princeton-bc-16",
    "stats": {
        "Activities": "snowshoe hike ski-xc mtn-bike",
        "From": "",
        "Seasons": "winter",
        "Stars": 5,
        "Time": "6 hrs",
        "Total Distance": "30 km",
        "Town": "Princeton, BC",
        "Type": "out-and-back"
    },
    "title": "China Ridge XC",
    "trail_id": "16"
}