{
    "description": "This trail system contains three loop trails located on the south and west sides of Jewel Lake. The Blue Heron (2.5 km) and Roderick Dhu (5.8 km) trails run through forested terrain with some small open marshy areas. The Eholt Trail skirts a large grassy meadow surrounding the outlet stream for Jewel Lake. Although the trails were designed chiefly for winter use by x-country skiers, they receive some summer use by hikers, joggers, and mountain bikers.The trails are fairly level for the most part, but all contain short hills that add variety. The linear trail adjoining the north end of the Roderick Dhu trail is a steep continuous hill that leads to a small abandoned mine. Trail users may find the horizontal shaft and collapsed buildings interesting to explore, but there are no safety barriers, so enter at your own risk. Skiers may wish to avoid this route when it's icy.",
    "directions": "From Grand Forks, proceed west on the highway 3 to the junction with Boundary Creek Road around 28 km west of Grand Forks. Turn left onto this road, and drive 1.0 km to the junction with Jewel Lake Road. Turn right onto this road and follow it for 9.2 km to the trailheads. Look for a large trail map sign and a registration box on the left side of the road. This is the trailhead for the Roderick Dhu and Blue Heron Trails.The trailhead for Eholt Trail lies across the road and 200 m up Jewel Lake Avenue at Jewel Lake Resort. Drive through the resort, cross the bridge, then turn right into the parking area. There is another trial map sign located in the resort.http://www.grandforkschamber.com/",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/160/regJewellakepics.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/160/topo_jewellakemap.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/160/Jewel lake pics.JPG",
        "https://trailpeak.com/storage//content/trails/Canada/BC/160/jewel lake map.JPG"
    ],
    "source_url": "https://trailpeak.com/trails/jewel-lake-trails-near-grand-forks-bc-160",
    "stats": {
        "Activities": "hike ski-xc mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "10 km",
        "Town": "Grand Forks, BC",
        "Type": "out-and-back"
    },
    "title": "Jewel Lake Trails",
    "trail_id": "160"
}