{
    "description": "NTS Map: 083F03Elevation Gain: 60 m (197 ft).The Pine Management trails are a series of self-guided Forestry interpretive trails that start at the Gregg River Recreation Area.  The recreation area has one of the nicest Cooking Shelters I have ever seen.There is also an old Forestry Cabin at the recreation area.  The trails are suitable for hiking, snowshoeing and biking.  Though in the old burned area there were numerous downed trees.  You may also have to share the trail with ATV users at any time of year.  This is a busy place on weekends in the summer.The Bighorn trail starts/finishes about 2 km further up the Gregg River Road.You need to be very careful on the roads in this area as there are numerous big trucks from the logging and Oil and Gas activity going on here.West Fraser (formerly called Weldwood) has a web site with maps of this and other trails in the area. Maps also can be found at the Kiosk.  Weldwood had been maintaining the trails and recreation area.",
    "directions": "The trails start at the Gregg River Recreation Area.  Head West out of Hinton on Hwy 16 and turn south onto Hwy 40 towards Cadomin.  About 21 km down the hwy you will see a sign for the recreation area.  From here you will turn east onto a gravel road and it is another 8 km to the recreation area.  On the way you will pass the equestrian section of the Bighorn trail.The gravel road is generally good in most weather.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/1600/reg_map.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1600/topo_1600.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/pine-management-trails-near-hinton-ab-1600",
    "stats": {
        "Activities": "snowshoe hike mtn-bike",
        "From": "",
        "Seasons": "winter fall summer",
        "Stars": 3,
        "Time": "4 hrs",
        "Total Distance": "12 km",
        "Town": "Hinton, AB",
        "Type": "out-and-back"
    },
    "title": "Pine Management Trails",
    "trail_id": "1600"
}