{
    "description": "(An exerpt from Matthew Hogg)Cape Split was always one of those trails I hear about, but only recently got around to visiting. Peter, Kris and I braved the impending rain forecast and were rewarding by only overcast skies on our hike.I always knew this trail would be a bit more mainstream than I'd prefer, and I was right. As soon as we pulled up to the trailhead, the number of cars already parked there was not appealing. The main trail itself is not much of a challenge either. Mostly uphill at a gentle slope, and estimated to take about 2 hours. We covered it in about an hour and a half. The bugs were no trouble this time around, but unfortunately the trail wasn't of much interest except for a run-down shack. In short order we arrived at the Cape itself. The trail opens up into a grassy hillside surrounded by cliffs and chasms. The tide was low when we arrived, but the currents were just starting up again as the tidal cycle repeated itself. The longer we hung around, though, the more people showed up. I'm not one to enjoy crowds, least of all outdoors. I didn't feel quite right being in a place that was so... accessible. Soon enough there were as many people perched all over the hills as there were seagulls. After exploring the area and settling for a very short break, we made our way along the southern coast of the Cape. The trail was pretty overgrown in places, and clung tightly to the rugged cliff edge, providing many views. Eventually, the trail overlooked a large cove. We spotted another campsite above the rocky beach, as we made our way down to the shore. After walking along the water and playing among some interesting rocks for a time, we were eventually forced back up into the woods when the water started to come up right against the cliffs. We continued along the inland trail for the rest of the trip. The trail wound its way through the forest and was clearly under-used and poorly marked in sections. We were constantly climbing over or under deadfall every few minutes.Eventually the trail ends up parallel to the main trail right next to the water. Picking our way through a small swamp and back to the trailhead, we drove off to spend a wet and cold night playing Scrabble in a crowded tent with a pesky squirrel, sentinel of Blomidon Provincial Park. Blomidon Provincial Park (pops).Waypoints:Cape Split - 0382909E 5021093N",
    "directions": "Head to Scott's Bay:  35K from Wolfville.Off route 1 from Greenwich, take route 358 north. Passing Canning, take the Chapel Road (still the 358) eventually turn left onto the Scotts Bay Road and follow it to it's end. Turn left  to Cape Split Road  and follow it to the trail head.Along the way, you'll find a campground and a look off vantage point where you can see the vast plains to the North.On the southern side of the entrance to Minas Basin, the village of Scots Bay is a 30-minute drive north of Wolfville).",
    "geohash": "f841",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/1603/long_CapeSplitRocks-37129.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1603/long_arialcapejpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1603/long_cape-split-for-trailpeak-3-29682.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1603/reg_01jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1603/reg_03jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1603/reg_08jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1603/reg_4281-201576320300-819140300-6908195-2809604-n-26935.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1603/reg_FernGrove-37129.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1603/reg_IMG-8901-43825.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1603/reg_IMG-8924-43825.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1603/reg_IMG-8996-43825.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1603/reg_cape-split-1-44942.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1603/reg_cape-split-2-44942.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1603/reg_n568280854-237632-6442-26935_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1603/topo_04jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1603/narrow_CapeSplitjpg-37129.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1603/narrow_cape-split-for-trailpeak-1-29682.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1603/narrow_cape-split-for-trailpeak-2-29682.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/cape-split-near-kentville-ns-1603",
    "stats": {
        "Activities": "snowshoe hike ski-xc mtn-bike",
        "From": "",
        "Seasons": "winter fall summer",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "13 km",
        "Town": "Kentville, NS",
        "Type": "out-and-back"
    },
    "title": "Cape Split",
    "trail_id": "1603"
}