{
    "description": "Note - this a 4 day backpacking trip.This is a point to point hike starting near the town of Cadomin, Alberta and finishing at the Miette Hot Springs in Jasper National Park. The trailheads are almost 100km apart by road, so having two vehicles or enlisting the help of a shuttle buddy is necessary. The trail can also be done as a rewarding there and back again.The trail runs through two different jurisdictions that have very different rules. The first third of the trail to Whitehorse Pass (aka: Fiddle Pass) runs through the newly created Whitehorse Wildland Provincial Park. In Whitehorse you do not have to register, there are no fees, you can hunt during the open season and you can camp wherever you wish. Well, that's not completely true, you are not allowed to camp within one kilometre of the trailhead or within one kilometre of any established campsite in the park. The only big change with the creation of the park was the banning of 4X4's & motorcycles. Crossing Whitehorse Pass you enter Jasper National Park which is by comparison very strict: you need to register, pay money, leave your guns at home and camp only in the designated campground marked on your permit. The trail is busy on weekends but it is usually available mid-week on short notice, call the Jasper Trail Office at 1-780-852-6177.The trail starts at the Whitehorse Creek Recreation Area, a very nice horse camp and staging area  which is 5km west of the town of Cadomin, Alberta. The first 7km along Whitehorse Creek is very confusing, as there are a multitude of trails and campsites. Despite having a handy little map from a friend, I was never sure if I was on the main trail or not. Regardless, I found my way to the junction for Whitehorse Pass, which is marked by a moose antler with 'Miette Hot Springs' painted on it. Hopefully this antler will still be there as a porcupine had eaten most of it when I visited in 2003. With any luck someone will replace it or put up a trail sign soon.Turn right at the junction and follow the very rocky and sometimes muddy track to Whithorse Pass at 13km. There are two informal campsites near treeline just before the pass, the pass itself is wide, flower filled and windy. Between the pass and Whitehorse Pass c/g in Jasper National Park there are two mysteriously unmarked trails on the left at marked intersections. Both of these trails eventually join together at yet another marked intersection with an unmarked trail. This final mysterious trail seems to disappear at the top of a cute little waterfall along Cabin Creek but the trail continues 25m up the creek on the opposite bank. Meandering through the forest for another kilometre the trail arrives at the back door of the Whitehorse Warden Cabin, the view around the front is outstanding. Whitehorse Pass c/g at 17km on the main trail is next to a beautiful section of the Fiddle River, creek really. All three Parks Canada hiker campgrounds in the Fiddle Valley have four tent pads, log picnic tables, fire boxes, a bear pole with cables and a green throne privy. The hike down to Slide Creek c/g at 24km is mostly in the forest but is still quite enjoyable, gravel washes make for nice rest stops. During low water there are three easy fords of the Fiddle River near the Slide Creek Horse Camp. During high water the first two fords, which are only a short distance apart, can be avoided by following the rough trail on the east side of the river. The third ford is unavoidable, in August the water wasn't even boot deep but during high water it could be knee deep. As for the horse camp, well... I never saw it. Slide Creek hiker c/g is very nice.The stretch of trail to Utopia Creek c/g is much more interesting, crossing open rock slides and gravel washes with fine views along the way. There is a marked junction the Fiddle Warden Cabin at 28km, unfortunately the trail sign, which is small and brown is on the other side of the river. Even knowing where it was it took me a long time to find it. Fiddle Warden cabin is 150m up the trail on the other side of the river and the trail behind the cabin is the Fiddle-Mystery Connector.Utopia Creek c/g at 31km is nice but I preferred Slide Creek and Whitehorse Pass c/g's. After fording Utopia Creek beside the campground the next kilometre of trail is mostly in the open but the valley is narrow and steep sided, as you'll soon find out. With 5km to go the trail begins a serious forested ascent to Fiddle Pass (aka: Sulphur Pass) at 33.5km. The pass, despite being below treeline is very attractive and full of flowers. On the other side of the pass is a steep descent to the bridge/ford over Sulphur Creek. The trail splits after the crossing, horses taking the high trail to the staging area, hikers taking the low trail to the hot springs. With less than a kilometer to go the hiker trail arrives at the wooden boardwalk and hot spring issuing from the mountain. Pass through the abandoned aquacourt and finish the trail on a paved path to the parking lot at Miette Hot Springs.The whole trail is spread out on three 1:50,000 Govenment topos, 83 C/14 Mountain Park, 83 F/3 Cadomin and 83 F/4 Miette. For hikers doing a there and back again trip from the Miette Hotsprings 83F/4 Miette covers the trail all the way to the pass and Gemtreks 1:100,000 'Jasper and Maligne Lake' covers the trail only as far as Whitehorse c/g which it incorrectly labled as Fiddle Pass c/g. They are available from The Friends of Jasper.NTS Map: 083F04Elevation Gain: 1025 m (3,363 ft).Submitted by 'mtncat'.",
    "directions": "Drive east of Jasper on Hwy 16 for 44km and turn right on the Fiddle Road. Follow the Fiddle Road for 17km to Miette Hot Springs, leave a car there. Go back to Hwy 16 and drive east for another 28km and turn right on Hwy 40 south. Drive 48km to the Cardinal Divide Road, turn right and drive 7km, passing through Cadomin to the Whitehorse Creek Recreation Area. Drive through the campground to the trailhead.Since my last visit Elk Valley Coal has built a new haul road through the Cadomin area so the road may have changed dramatically. www.elkvalleycoal.ca",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/1607/long_ViewdowntheFiddleValleyfromWhitehorsePass2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1607/reg_FiddleTripJuly2003FiddleCreekbelowWhitehorsePassjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1607/reg_FiddleTripJuly2003SlideMtnJPG_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1607/reg_FiddleTripJuly2003ViewupPoachersBasinfromWhitehorsePassjpg.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/fiddle-river-trail-near-jasper-ab-1607",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 4,
        "Time": "32 hrs",
        "Total Distance": "37 km",
        "Town": "Jasper, AB",
        "Type": "out-and-back"
    },
    "title": "Fiddle River Trail",
    "trail_id": "1607"
}