{
    "description": "(Trail description from Mathew Hogg, published with his permission.)\nAn 18 kilometre return trail which takes you up the North River to the highest waterfall in the province. Expecting it it to take up most of the day, Kris, Dave, Matt, Sheena and I headed out early from the trailhead. \nThe trail starts out easy enough, although it was a little wet. Nice, wide path. Fairly level for the most part. We crossed a few bridges over some feeder streams of the North River below. The water everywhere was rushing, making for a constant background noise for the entire trip. Soon the trail heads downhill and levels off as we wander through the forest. About three kilometres in is an offshoot trail next to an old foundation of some kind, embedded in the ground. There was also evidence of stone walls and outhouses. We also couldn't help but notice some ginat piles of stones covered in moss. \nThe trail continues from there alongside the river when we reach the halfway point. Here we find another sign with a helpful map and some warnings. There were many river crossings that lay ahead on the Upper Wilderness Trail-- which was closed until further notice. Not a group to turn around easily, we continued forward. \nSoon enough we were crossing many tributaries with the help of old log-bridges that weren't too sturdy. We also started to come across snow still covering much of the trail. These patches of snow got up to 3 feet deep in places and made the going awkward. Maybe it wasn't a good idea to wear shorts after all. \nAfter trudging for some time, the trail rounds a bend in the river (always rushing by at a great speed). Matt and I came to a halt at the sight before us. Here we are standing on a wooden platform, looking across a rushing whitewater river at another wooden platform-- with nothing in between. The bridge was out. Very out. The platform we stood on had a few splintered planks. Now what? \nWe spent nearly an hour pacing up and down that section of the river looking for ways we might get across. Dave even waded in at one point. It was no use. It was simply too deep, too fast, too cold. We knew from the map that even if we did get across we'd have to cross back again before the falls. With that in mind, and knowing we were close, we decided to bushwhack on our side of the river. The riverbank was steep, as the river valley was constantly narrowing, and thick in places. It didn't help being able to see the trail directly across the river. With persistence we reconnected with the trail on our side. This river crossing consisted of a rope. It certainly would have been interesting if crossing this way was required. \nAt this point the trail quality quickly degraded. Deep snow, steep hills, ice, and thick deadfall made the going tough. No one had been in this far for maintenance in a long time. The roar of the falls was getting louder and louder as we continued. One more crossing over a badly damaged bridge and we were within sight of North River Falls. \nThe weather had degraded by the time we arrived, making the generous amounts of mist very cold. The spring thaw made the Falls a wonderful sight. The boom of rushing water was impressive. Unfortunately, I had come a little ill-prepared for the cold and too much exposure to the mist was hard to stand. I would go take some photos, then retreat to the cover of the woods to warm up. While I was shivering, Kris and Dave made their way up the steep hillside only to emerge on the rocks at the top of the Falls. Crazy fools! At least they got a nice view. \nBy the time they came back down the sun had come out again, making for another great photo opportunity. Before heading out, we placed another of our extreme geocaches and started back down the trail. The return trip was pretty uneventful and we made excellent time. \nAs we were arriving back at the trailhead we bumped into a couple making their way in, complete with camping gear. It was 4:45pm! I didn't think it was too bright heading out for a hike so late. We gave them our advice and warnings and I tried to keep a straight face. Our trip was over, at least. With out gear in the trunk, we headed on down the road. \nGPS Waypoints:\n\tNorth River Falls \n 0677015E 5137768N",
    "directions": "mapquest\n\n\n\n\nYou can hike this trail as part of the Hike the Highlands Festival\"  Sept 16-25 out of Ingonish, N.S. For further information, please click on the link above.Directions via MapQuest or the following from the provincial park brochure: \"North River Provincial Park is located 3.5 km off the Cabot Trail at North River Bridge.  From Hwy 105, take exit 11.  Allow 7 hours for the hike to the waterfall and the return.\"",
    "geohash": "f8hz",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/1608/reg_02jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1608/reg_05jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1608/reg_Cape-Breton-616-20754.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1608/reg_Cape-Breton-624-20754.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1608/reg_Cape-Breton-636-20754.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1608/reg_Cape-Breton-638-20754.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1608/reg_Cape-Breton-647B-20754.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1608/reg_Cape-Breton-652-20754.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1608/reg_NorthRiver-Composite-27121.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1608/reg_NorthRiver2-27121.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1608/topo_04jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1608/narrow_Cape-Breton-617-20754.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1608/narrow_Cape-Breton-626-20754.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1608/narrow_Cape-Breton-629-20754.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1608/narrow_Cape-Breton-630-20754.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1608/narrow_Cape-Breton-631-20754.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1608/narrow_Cape-Breton-639-20754.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1608/narrow_NorthRiver1-27121.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1608/narrow_NorthRiver3-27121.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1608/narrow_north-river-22982.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/north-river-falls-cape-breton-near-baddeck-ns-1608",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 5,
        "Time": "7 hrs",
        "Total Distance": "18 km",
        "Town": "Baddeck, NS",
        "Type": "out-and-back"
    },
    "title": "North River Falls, Cape Breton",
    "trail_id": "1608"
}