{
    "description": "Rather than an extreme backcountry adventure this time around, I had to settle for an easy camping experience in Meat Cove. Erin had the swing vote, after all, it was her birthday. Meat Cove is quite simply the most remote community in all of Nova Scotia. It's not all that difficult to get to, but the sense of sheer isolation you get when you're there is a result of the terrain that surrounds you. It was Peter, Erin, Angel and I who made the journey to this very odd little location. \nYou must drive some part of the Cabot Trail in order to get to Meat Cove. The community can be found outside the confines of Cape Breton Highlands National Park, north of Aspy Bay, lying directly on the boundary between Inverness and Victoria counties. This particular region is just as mountainous as any part fo the Park, sticking out into the Cabot Strait. It is also important to have reliable transportation, for once we passed through Capstick, we had to follow 8km of winding dirt road. \nThe more the dirt road crested and meandered, the further I felt I was getting from anyplace in Nova Scotia. The road bends and dips around yet another hill, and where you have just come from disappears from memory. In due time, I saw houses nestled deep in a valley below, next to sharp cliffs dropping into the sea. Peter drove his car ever deeper into the hills and we were soon parked at one of the most unique campgrounds in the province. I have to wonder what the citizens of Meat Cove do with themselves in the winter, because they certainly would not be getting out of Meat Cove. Go there some time, you'll see what I mean. \nWe set up our tents right beside the ocean. I was anticipating a very windy night as I was told they were common here. It later proved to be dead calm, but oh well. Since we still had a lot of afternoon left, we decided to hike some of the network of trails on the peninsula. There are trails which lead to places like Cape St. Lawrence, Lowland Cove, and Polletts Cove. Cape St. Lawrence is just shy of being the most northerly point in Nova Scotia. it was a good place to explore. Starting out from the campground, we ascended a hill following a very rough cart track. \nThere was no signage, but the trail was clear. It starts with a rather steep climb, but the views you get looking back are reward enough. Soon enough the trail levels off, and off to the side is a large meadow. Peter was convinced this was the way to the Cape, but I wasn't so certain. There was nothing obvious enough for me to call it a trail. After the others took some time looking around, we decided to keep going and hopefully the right turn off would show up soon. \nAfter about another half hour, there was another turn off to the right marked as an ATV hauling trail. This looked like the right way to go. The trail descended gradually for some time and Angel and I kept a good pace. As the trail wound between Big Pond and Bear Hill, it leveled out deceptively. Around another bend and the trail descends sharply. Through the trees I could see the ocean about a kilometre off. And on the hillsides we saw what looked like horses! We had heard that people let their livestock roam free year-round in this area. \nAbout halfway down the hill, Erin got winded and had to stop. She wasn't feeling very good that day and didn't feel comfortable continuing if only to do it all again on the way back. Much to Peter's chagrin they turned around and headed back while Angel and I kept going. It was too bad, as we were not that far from the end. \nSoon after we continued, the trail leveled out again. The wind began to pick up and the ocean was close. As we approached the coast, I could see a clearing beyond the end of the trail. As we grew nearer a giant horse came into view, grazing on the grass. The trees around us fell away and we were on the northern coast. The wind was strong. As we crested a small hill one horse, then another and another plodded into view. They looked up as we passed by, and we kept our distance. I was used to encountering deer and moose in the wild, but not horses! Something about the whole experience struck me as surreal. This was a very unique place and I felt lucky to be there. Off in the distance were cattle grazing. There was even a goat! \nThe animals were grazing happliy about the ruins of an old lighthouse. Nothing remains but the cement foundation, replaced by a modern light and a solar panel. Angel and I spent some time exploring our surroundings and being battered by the wind. \nSoon enough we decided to head back. It took some time to both find the opening of the trail in the trees and get around the animals who had started grazing where we wanted to go. We gave them a respectable distance and headed back up the trail. We made good time getting out and got back to the campground in time to wash up for dinner and have some birthday cake. \nIf you're looking for something in the Highlands that's off the beaten track, you can't get more un-beaten than Meat Cove. It's a great place to go camping, as well as a good starting point for a backcountry excursion, which we hope to do very soon. \nYou can hike this trail as part of the \"Hike the Highlands Festival\"  Sept 16-25 out of Ingonish, N.S. For further information, please click on the link above.\nGPS waypoints:\nCape St. Lawrence \n0682557E 5212460N\n\tMeat Cove\n0685545E 5210996N\nAnother part of the network trail sits just before the campground here.",
    "directions": "You must drive some part of the Cabot Trail in order to get to Meat Cove. The community can be found outside the confines of Cape Breton Highlands National Park, north of Aspy Bay, lying directly on the boundary between Inverness and Victoria counties. It is also important to have reliable transportation, for once we passed through Capstick, we had to follow 8km of winding dirt road.\nWatch out for moose.",
    "geohash": "f8kgt",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/1609/reg_Slide-Group-10003-21026.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1609/reg_Slide-Group-20003-21026.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1609/reg_Slide-Group-40001-21026.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1609/reg_meatcove2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1609/topo_meatcove1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1609/2020meatcove.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1609/meatcove.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/meat-cove-cape-breton-near-ingonish-ns-1609",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 5,
        "Time": "2 hrs",
        "Total Distance": "2 km",
        "Town": "Ingonish, NS",
        "Type": "out-and-back"
    },
    "title": "Meat Cove, Cape Breton",
    "trail_id": "1609"
}