{
    "description": "NTS Map: 083D16Elevation Gain: 250 m (820 ft).The forested walk to the shores of Dorothy, Christine and Virl Lakes in Jasper National Park is a great way to avoid the summer crowds. Unfortunately the boats that used to be available for rent have been removed from the lakes and a visit is not as magical as it used to be. Parks Canada produces a free trail guide called 'Summer Trails' of this and other trails in the park.Left photo is Dorothy Lake and the Maligne Range, right photo is Virl Lake and Indian Ridge. From the parking lot walk down the gated road to where it comes alongside the railway tracks. Look for the steep trail climbing up to and over the tracks, on the other side is a bridge over the Miette River. Crossing the bridge the trail turns left and runs above the river on the old railway construction tote road built by 'Foley Bros, Welsh & Stewart' in 1909, before it turns back and crosses over a ridge. Dropping down the backside of the ridge and passes a little slough  before reaching the bridge over Minaga Creek at 2.2km.Past the bridge the trail begins to climb again and at 2.7km the junction to Elysium Pass is on the left and at 3.7km the 400m spur trail to Virl Lake is on the right. Virl is a long slender lake with nice views of Indian Ridge.After the Virl junction the trail climbs a bit more for a total of 250m elevation to the shore of Dorothy Lake at 4.1km. Dorothy Lake is much larger than it first appears but with out a boat it's hard to get around. Intrepid souls can bushwhack a kilometre down the south shore of Dorothy Lake to the outlet stream that flows a short 300m down to Iris Lake.The trail continues past Dorothy Lake for 300m to the shore of Christine Lake at 4.4km. With a dozen little rocks and islands, Christine is the prettiest of all the lakes in the valley near the town of Jasper. While the old picnic site is a fine place to take in the lake, an obvious trail continues down the shore to a better viewpoint near the large island. Return the way you came.Submitted by 'mtncat'.",
    "directions": "Drive west of Jasper on Hwy 16 for 11km. The parking lot is on the right, just after the Meadow Creek bridge.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/1613/reg_DorothyLakeandtheMaligneRange.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1613/reg_Mirrored-Trees-34578.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1613/reg_VirlLakeandIndianRidge.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1613/reg_image-51744_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1613/reg_map.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1613/narrow_Path-to-Virl-34578.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/dorothy-christine-and-virl-lakes-near-jasper-ab-1613",
    "stats": {
        "Activities": "hike mtn-bike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 2,
        "Time": "3 hrs",
        "Total Distance": "9 km",
        "Town": "Jasper, AB",
        "Type": "out-and-back"
    },
    "title": "Dorothy, Christine and Virl Lakes",
    "trail_id": "1613"
}