{
    "description": "There are only a few rivers in PEI that are worth any merit when it comes to the spring run off. One of note is the Dunk River. The Dunk gets its water from the region east of Breadalbane where there is a dam. Scales Pond, another damed site lies at the head of our let in point. This also serves as a nice recreational park, and also a trailhead for the Dunk River trail. April is pretty much the High flow point of this water route, giving a few class 2 rapids, and a few rock shelves for good measure. A perfect place to practice ferrying and eddy turns because the water is not that deep, the flow moderate, and the river banks very accessible. Mistakes are very forgivable on this river.\r\n\r\nOn this occasion, the meeting was a semi organized affair, with more than a dozen paddlers meeting at the let in point. It was the revived PEI Paddle Association's first event for 2005. Even though the Dunk is a fairly narrow river, there were kayakers there with boats up to 19 feet in length! With five kayakers and five canoes, we set out for the once a year run of the Mighty Dunk. I was glad to be a part of it.\r\n\r\nOur run went for approximately 8 Kms. We passed under a couple of bridges, and ran into several eddy turn opportunities. There were no rock gardens, but the occasional rock in the middle of the course made for needed vigilance. The rock shelves were really cool too, and provided a great rush, plus a chance for some ferry practice, as well as surfing. My co paddler and myself almost buried the nose of our canoe when we nosed in and ferried across the shelf, head first. That was a blast.\r\n\r\n\r\nThe river flows an additional 6-8 Kms past our let out spot. The white water action subsides as the river widens, and there is a greater influence by the tidal zone of Summerside Harbour, where the Dunk Empties.\r\n\r\nRunning the Mighty Dunk is a narrow time frame opportunity. Look for it in April just after a big rain fall, or span of warm, snow-melting weather. If you find yourself in PEI, with a canoe or kayak, it's a must do. Go for it!\r\n\r\nShannon Burt\r\nEast Coast editor of Trailpeak.com",
    "directions": "From Summerside, take the 107, until you reach the 109. Turn right, and look for Scales Pond signage.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/PE/1622/reg_DSC00001.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/1622/reg_DSC00003.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/1622/reg_DSC00009.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/1622/reg_DSC00010.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/1622/topo_dunkriverrunjpg.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/the-mighty-dunk-river-near-summerside-pe-1622",
    "stats": {
        "Activities": "river-canoe",
        "From": "",
        "Seasons": "spring",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "8 km",
        "Town": "Summerside, PE",
        "Type": "out-and-back"
    },
    "title": "The Mighty Dunk River",
    "trail_id": "1622"
}