{
    "description": "NTS Map: 082j11Elevation Gain: 490 m (1,608 ft) to lake, 626 m (2,054 ft) to pass. Distance: 6.7 km to forks, 10.2 km to lake, 13 km to pass.The time and distance are round-trip.The hike to the Forks Campground from Upper Kananaskis Lake is a good hike for your first overnight trip of the year.  It isn't too far (under 7 km) or too steep and it puts you in easy range of Three Isle Lake and the South Kananaskis Pass.  The campground has a communal cooking area with plenty of wood an axe and lockers and hangers to keep your gear away from bears.Once you leave the Forks, the trail gets much steeper and more exposed and there are long sections of stairs to climb.  It was nice to have left our packs behind at the campground for this section, although you can also camp up at Three Isle.  The lake is nothing spectacular to look at but there is good fishing.  (If my boyfriend managed to catch oneÂ?).  While he was fishing, I continued up to South Kananaskis Pass, which, in my opinion, was the best part of the whole hike.  To get to the Pass, you walk through a forested area and eventually get to the BC Border  and a large meadow.  There is a small trail across the meadow which is filled with flowers and butterflies.  Shortly you'll reach Beatty Lake - a beautiful little lake in the trees.  It is well worth the trip.",
    "directions": "You can access the trail from the Upper Kananaskis Lake north parking lot. Cross the dam and follow the fire road to your left. Keep left at the Indefatigable Trail sign and keep right at the next junction. Follow signs thereafter.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/1634/reg_3IsleLake.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1634/reg_3IsleLake2JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1634/reg_Beatty2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1634/reg_DCP_1277.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1634/reg_SouthKanPassToAB.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1634/reg_SouthKanPassToBC2JPG.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/three-isle-lake-and-south-kananaskis-pass-near-kananaskis-ab-1634",
    "stats": {
        "Activities": "snowshoe hike ski-bc",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 4,
        "Time": "16 hrs",
        "Total Distance": "30 km",
        "Town": "Kananaskis, AB",
        "Type": "out-and-back"
    },
    "title": "Three Isle Lake and South Kananaskis Pass",
    "trail_id": "1634"
}