{
    "description": "NTS Map: 082N15Elevation Gain: NegligibleMistaya Canyon, in Banff National Park is a spectacular slot canyon close enough to the Icefields Parkway that even your grandmother could get there. It's a half kilometer (about 10 minutes) on an old logging road to a bridge over the cascading Mistaya River. At this point, the river has cut a series of rounded slots, or pockets, in the rock. It's deep and steep and very impressive, and what's more, it doesn't get nearly the volume of spectators that the much bigger Maligne Canyon gets. The river and the views at Mistaya Canyon are spectacular. We were there in the summer of '03, the year of so many forest fires, so the mountains weren't very visible then. There's a mountain close by in the upper left photo that's barely visible.This is the first leg of the Howse Pass Trail.In winter please check the local avalanche bulletins if travelling in winter.",
    "directions": "You can park on the west side of the highway 31km north of the Bow summit, 5.5km south of Saskatchewan River Crossing. The trailhead is at the north end of the parking area. If you park at or near the south end and see multiple trails heading off into the bush, resist the urge to follow them. They end shortly afterward.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/1641/reg_Glacier-Skywalk-Mistaya-Canyon-May-11-2014-6--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1641/reg_MistayaRiverjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1641/narrow_Glacier-Skywalk-Mistaya-Canyon-May-11-2014-4--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1641/narrow_Glacier-Skywalk-Mistaya-Canyon-May-11-2014-7--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1641/narrow_MistayaCanyon1jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1641/narrow_MistayaCanyon2jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1641/narrow_MistayaCanyon3jpg.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mistaya-canyon-near-banff-ab-1641",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "1 km",
        "Town": "Banff, AB",
        "Type": "out-and-back"
    },
    "title": "Mistaya Canyon",
    "trail_id": "1641"
}