{
    "description": "Jamieson is a great descent trail with a nice west coast feel to it. The ride starts in a tall humid (for Kamloops) forest, which has a much different feel than most of the rides down around Kamloops (i.e. Rose Hill). The trail starts with a short flat/slight uphill section to some structures (log ride, ladders), then more uphill/rolling section to the top of the descent. The descent starts with a roll over rock or ladder drop your choice. Then its pretty much downhill from there, not extremely steep, just steep enough to keep it interesting with small drops along the way. \r\nThe final descents are a bit steeper, looser and dry, so try to keep it together and leave some dirt on the trail - ride don't slide!\r\n\r\nIf you're after some fast descents and jumps a la Rose Hill or A-Line look elsewhere, but if you are after a moderately challenging freeriding trail a la North Shore Jamieson is pretty nice. Only draw back - the shuttling is a bit time consuming. \r\n\r",
    "directions": "The trail is past Westsyde, which is on the west bank of the North Thompson River, north of Kamloops. \r\n\r\nTrailhead: drive (or ride) 8km up O'connor Lake FSR. After the 8km signpost take the first road on your right, and then park just past a cattleguard. The trail starts some ~50m down the road on your right. \r\n\r\nFor shuttling,  park one vehicle at the trailend about 3.5km up Jamieson Creek FSR. There's an area to park on you right next to the river, which is a good place to hangout when part of your party is retrieving the trailhead vehicle. The trail ends a short distance up the road. Jamieson Creek FSR is some 20km from the beginning of Westsyde Rd (intersection with Bachelor dr and Ord rd) in Kamloops.\r",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/1643/topo_Jamieson2.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/jamieson-dh-near-kamloops-bc-1643",
    "stats": {
        "Activities": "mtn-bike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "5 km",
        "Town": "Kamloops, BC",
        "Type": "out-and-back"
    },
    "title": "Jamieson DH",
    "trail_id": "1643"
}