{
    "description": "For historical information on this body of water, check out:Hillsborough River websiteOne of the Quintessential river runs on PEI is the Hillsborough River. It's a route that goes more than 27 Kms from Charlottetown into the heart of the province. The Natives use to run the route, and portage less than 3Kms to reach the ocean on the opposite end.Our run was from Mount Stewart to Charlottetown, taking advantage of what current there was, and the tide.For anyone doing this route, the biggest consideration is wind direction. Because of the land profile, and the wider areas of the river, wind can slow you far more than the current or tides.There are a few neat features along the way, that make this paddling route memorable. Mount Stewart is home to a very nice musium, as well as the Trail Side Cafe. In the summer, it's a tourist attraction, but not a trap. The village has a nice little boat launch ramp beside the bridge, so letting in has never been easier.Along the route, there use to be a ferry that crossed the water near Scotchford. There are reminants of the infrastructure still there today, with the old roads, and a still standing pier.At the half way point, exists Oxe Island in the middle of the river. It is better known as Bird Island. This serves as a protected home for nesting Blue Harons. we stopped there to eat our lunch, and watch the wildlife.The final push to finish this historical water route is to pass under the Hillsborough bridge that connects Charlottetown to Stratford. Be aware of currents when passing under the bridge. some of the eddies created can cause your boat to become difficult to manouver and brace. The tide was pretty much at a stand still, so no problems occured. It's probably the most dangerous part of the route.depending on the time of the year, you will see seals in the water. We saw four of them.",
    "directions": "If you let in at Mount stewart, Head out of Charlottetown on Route 2 toward Saint Peters. Turn off to go to Mt. Stewart, and launch in by the bridge. Our let out spot was by the Armories area in Charlottetown. Car and trailer access is easily had in that area.This will take pretty much the whole day. We launched in at 9AM, and let out at 3:20PM. My GPS said it was 5 hours and 20 minutes moving time.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/PE/1645/long_DSC00011.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/1645/reg_DSC00006.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/1645/reg_DSC00009.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/1645/reg_DSC00013.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/1645/topo_DSC00006.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/1645/topo_hilsboroughrun2.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/the-historic-hillsborough-river-near-charlottetown-pe-1645",
    "stats": {
        "Activities": "river-canoe sea-kayak",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "6 hrs",
        "Total Distance": "28 km",
        "Town": "Charlottetown, PE",
        "Type": "out-and-back"
    },
    "title": "The Historic Hillsborough River",
    "trail_id": "1645"
}