{
    "description": "If you want to be out there, and experience the real thing, go to the Groulx.  However, be ready for the worst.  I did the Mont Groulx crossing on easter week end.  Wind, snow, Ice, be ready for it all!  From -30 on the plateau to 5c on the way Down.  At least 4 days are required. You chose you way, you ups and down!\nRemember, you bring it in, carry it out!\nIf you have questions, you can E mail me: cakebush@yahoo.ca\nPARTIE 1\nNous avons fait la traversé des Monts du Nord au Sud la fin de semaine de Pâques.  Une expérience que je ne suis pas prête d'oublier!  Prévoyez 4 jours , et c'Est vous qui choisissez vos montées et descentes.\nPour se rendre au paradis, de Québec, prendre l'autoroute 138 est en direction de Baie Comeau.  Juste avant la ville, a votre gauche, se trouve l'embranchement de la route 389 qui se dirigent tout droit vers le Labrador. Prendre cette route. Elle passe par la centrale Manic 5.  Une fois sur cette route, continuez jusqu'au km 335 pour accéder a l'entrée sud.  L'entrée nord se situe au km 368 et il y a aussi une entrée au km 348.  A toutes ces entrées, il y a un stationnement.  Nous sommes partis a 4 heures du matin et avons roulés toutes la journée.  Nous somme arrivés a l'entrée nord vers 15 :45. En passant, prévoyez avoir une crevaison, vous serez prêts!\nPARTIE 2\nPour vivre une expérience unique en son genre et se sentir au bout du monde, les monts Groulx, c'est la place.  Par contre, soyez prêts au pire, la traversé, elle n'est pas donnée.  Vents forts, glace et neige seront au rendez-vous.\nUne fois rendus a l'entrée, allez jouez dehors.  Munis d'une carte, boussole et d'une bonne expérience en orientation, vous avez la base pour découvrir ce coin merveilleux.  Il n'y a aucun point de repère matériel en chemin et on espère que cette situation demeurera!\nNe laissez pas de traces de votre passage!\nSi vous avez des questions, vous pouvez contacter avec moi par courriel : cakebush@yahoo.ca\nFaites-vous plaisir!  \nKathy Sauvageau",
    "directions": "We did the crossing from north to south. From Quebec, we took highway 138 east (north shore) until Baie Comeau. Right before the town of Baie Comeau, there is road 389 that goes north. Follow indications for Manic 5. Once on this road, carry on until km335 for the south entrance to paradise. There is also a parking spot at km 348. The North entrance is located at km 365. We left at 4 in the morning, stopped a bit for lunch and got there at around 3:45 pm. Once you reached the entrance, go and play! Compass, map and good orienteering experience are required for a life time adventure. There is no infrastructure along the way and hopefully, it will remain that way. Remember, you bring it in, carry it out! If you have questions, you can E mail me: cakebush@yahoo.ca",
    "geohash": "f3p",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/QC/1654/reg_P1000633JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/1654/reg_p1000646jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/1654/reg_p1000655jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/1654/reg_p1000666jpg.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mont-groulx-near-baie-comeau-pq-1654",
    "stats": {
        "Activities": "snowshoe hike ski-bc ski-xc",
        "From": "",
        "Seasons": "spring winter fall",
        "Stars": 4,
        "Time": "28 hrs",
        "Total Distance": "40 km",
        "Town": "Baie Comeau, PQ",
        "Type": "out-and-back"
    },
    "title": "Mont Groulx",
    "trail_id": "1654"
}