{
    "description": "NTS Map: 083F05This trail (hiking/equestrian) follows along the top of the High Divide Ridge south of Hinton and gives great views of the Eastern Slopes just outside of Jasper National Park and the Athabasca River Valley.  The trail is apparently part of the original pack/forestry trail in the area. You will gain/lose ~500 m (1,640') of elevation.This is a true wilderness trail and you are in bear country.  A brochure can be found at http://www.westfraser.com/sites/default/files/trails/Bighorn%20Trail%20brochure.pdf We took to vehicles and left on the south end of the trail. The north end of the trail has parking for about 5 to 10 vehicles and on the south side you can park on the south side of the Gregg River Road right at the bridge that marks the start/end of the trail.  There is a campsite at about km 9 (starting from the north).  However, from what we could tell there is no water anywhere along the trail except at the south end on the Gregg River.  As well, there are trail markers every km along the trail but according to my GPSMAP76, these are actually spaced about every 1.2 km.  Therefore by the time you reach the km 5 marker, you may have actually walked almost 6km.  The official brochure says the trail is 20km, we measured 23km.This trail description is described north to south which is the direction we walked.  You begin in a small parking lot just south of Hinton and about 600 metres west of the Robb Road on the Cold Creek Road.  From here you will walk along a well marked trail in spruce and aspen forest that begins very gentle and then begins a steep ascent to the first of the view points about 5 km in.  Cursing the ATV users that rutted the trail in places.At km 5, after a short switch back, you will have your first view of the Athabasca River valley and the eastern slopes.  You are now on the top of the ridge and will have some very nice views and easy walking for the next 2.5 kms.Once you reach the campground your only view is down a seismic line.  From here on you will be in very dense forest for about 2.5km.  We walked the trail in April and there was still a significant amount of snow in places, up to our waists in places and we are both 6'3\"!!).  There were quite a few downed trees as well.  Some forced us to bush whack through some very dense fir because we simply couldn't get over them.  After the 2.5 km section, you will come out along the edge of several old cut blocks.  For us at this time of year it was bad news as the snow was knee deep forcing us into the pine stands of the reserve area.  This was the beginning of our descent and finally loosing most of the snow.From the edge of the cut blocks you will rapidly descend into a very open, park-like stand of pine on what looks like an old logging road.  From the pines you walk into a gully that will shortly open into yet another cutblock that will open a good view of the mountains.From here it is an easy walk through a variation of cut blocks and reserve stands. You will cross two gravel roads and will eventually come to the junction of the horse trail.  If you take the horse trail you will be required to cross the Gregg River.  For the hiking trail, stay to the left and follow the trail markers along the edge of the cut blocks up and down eskers until you enter a young stand which is an old cut block.  You will need to watch carefully for the markers.  The trail will then take a dip into an old growth stand and you will follow the Gregg River for the last 1km to the trail end.At this end, you are 2 km from the Gregg River Cabin recreation area and the Pine Mgt. Trails.  The GPS data includes the track as well as waypoints for the view points, campground and the junction of the equestrian trail.  Keep in mind we had to bush whack on parts so the track will be off slightly in places.",
    "directions": "The North End:  Take Switzer Drive to the Hinton Training Centre.  At the lights turn right onto the Robb Road.  This will turn into a 2-lane gravel road.  Follow it south for 4 km and turn right.  This is the Cold Creek Road.  You will see the trail on your right in about 600 metres.To the South End:  Follow highway 40 to Cadomin.  The junction for the Gregg River road is 22km south of hwy 16.  Turn left and follow the gravel road for 10 km to the trail head.  You will pass the equestrian trail head as well as the Gregg River Cabin Recreation Area.  The trail head is 2 km past the recreation area just on the east side of the bridge.Be careful as these are all active logging roads.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/1665/reg_1665.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1665/reg_bighorn-map_best1_.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/bighorn-trail-hinton-near-hinton-ab-1665",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 4,
        "Time": "7 hrs",
        "Total Distance": "0 km",
        "Town": "Hinton, AB",
        "Type": "out-and-back"
    },
    "title": "Bighorn Trail - Hinton",
    "trail_id": "1665"
}