{
    "description": "NTS Map: 083E01 (083F04)The old Devona Road in Jasper National Park is closed to public vehicles but is used occasionally by railway, pipeline and parks vehicles. It passes through beautiful meadows over Jasper Lake and has some fine views. Decending past a warden cabin the trail road reaches Devona Flats in 2km. The Devona Flats area was used for the shooting of 'The River of No Return' (1954) starring Marilyn Monroe and Robert Mitchum.Please Note: The Snake Indian River next to the flats has a very strong current and steep banks. A warden once drowned here while trying to fetch water. Do not leave kids unattended.Turning right in the flats the road runs for another kilometre and ends at 3.5km next to the CNR Devona Railway Siding. Fur Trade history buffs may wish to push on with a map and a good sense of direction to see if they can find the site of Jasper House, a Canadian National Historic Site. All that remains of the old post is a mound where the chimney once stood, the dugout ramp for canoes and a few old boards. Please respect this archeological site and take only pictures.The site of Jasper House is through thick trees on the banks of the Athabasca River just downstream of its confluence with the Rocky River. Cross the tracks and follow them east for 300m. Look for a faint trail angling right across the meadow and into the trees. If you manage to get on the right path, it will lead you to a clearing where Jasper House once stood, if not, well... have fun. www.ourheritage.net Government topo 83 E/1 Snaring River and 83 F/4 Miette if you are pushing on to Jasper House, both @ 1:50,000 or Gemtrek's 'Jasper and Maligne Lake' @ 1:100,000 are good maps for the area can be purchased from the The Friends of Jasper.Submitted by 'mtncat'.",
    "directions": "Drive east of Jasper on Hwy16 for 8km and turn left on the Snaring Road. Follow the Snaring Road for 6km to the end of pavement. Follow the non-gated fire road another 8km to the stop sign where the it turns into an alternating one way road called the Celestine Lake Road . When the time is right (below), follow the road another 11km to the obvious gated road on the right. Do not park in front of the gate.Celestine Lake Road - Open May through September - Hours in: 8-9, 11-12, 14-15 & 17-18hrs",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/1677/reg_SynclineRidge-RocheMiette-JasperLake.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1677/reg_TheBosheRange.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/devona-road-near-jasper-ab-1677",
    "stats": {
        "Activities": "hike mtn-bike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "7 km",
        "Town": "Jasper, AB",
        "Type": "out-and-back"
    },
    "title": "Devona Road",
    "trail_id": "1677"
}