{
    "description": "Athabasca Falls in Jasper National Park is not the highest or the widest waterfall in the Canadian Rockies but it is the most powerful. The full width of the Athabasca River is funneled into a three metre gap and over the brink of the falls. Despite what the interpretive signs say, most of the rock is not limestone, it is actually gog quartzite, and ounce for ounce it's as strong as steel. And as you can well imagine, it would take a very powerful waterfall to cut through steel. Athabasca Falls is actually one of the major tourist stops along the Icefields Parkway and is a very busy place on a midsummers day. To avoid the crowds it is best to visit early in the morning or after dinner time. Most of the trail system is paved but stairs limit access for people in wheelchairs. There is a wonderful picnic area with ten picnic tables, kitchen shelter and washrooms.Please Note: The guard rails at natural features like Athabasca Falls are there for your own safety. The rocks near the brink of the falls may look inviting but they can be deadly slippery, as many an unfortunate soul has realized only too late. Don't become an Athabasca Falls statistic.From the parking lot it is a short walk past the washrooms to the trail next to the river. The picnic area is to the left and the falls are to the right. There are viewpoints to take in the waterfall from both sides of the river, including the bridge that spans the canyon downstream of the cataract.Over the eons the waterfall has moved back and forth in it's search for the path of least resistance, cutting and abandoning channels as it goes. One such channel has been developed with stairs and trail for easy exploration. It also gives access to viewpoints at the bottom of the main canyon and to the river bank beyond.The vast majority of people who visit Athabasca Falls do not give it enough time. They rush to the falls, snap a picture and they=re gone. Why not poke around? Explore the area looking for signs of abandoned waterfalls and other water worn rock. Stand in the spray at the closest viewpoint, or just hang out and enjoy the view.The huge mountain poised over the falls is Mount Kerkeslin, which was named by Sir James Hector of the Palliser Expedition in 1859. NTS Maps: 083C12No real elevation gain.Submitted by 'mtncat'.In winter please check the local avalanche bulletins.",
    "directions": "Drive south of Jasper on Hwy 93 (The Icefields Parkway) for 30km and turn right on Hwy 93a. Go 200m and turn left into the parking lot.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/1679/long_20151015-175313-54522.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1679/long_20151015-175513-54522.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1679/long_20151015-181636-54522.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1679/long_20151015-181913-54522.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1679/reg_ath4.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1679/reg_image-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1679/reg_map.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1679/reg_west038jpg_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1679/narrow_AthabascaFallsMtKerkeslin.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1679/narrow_CanyonBelowAthabascaFalls.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1679/narrow_GoingBackUp.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1679/narrow_ath-falls.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1679/narrow_athabasca1-16855.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1679/narrow_athabasca2-16855.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1679/narrow_athabasca3-16855.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/athabasca-falls-near-jasper-ab-1679",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "1 km",
        "Town": "Jasper, AB",
        "Type": "out-and-back"
    },
    "title": "Athabasca Falls",
    "trail_id": "1679"
}