{
    "description": "The short trip to beautiful Wabasso Lake (Trail# 9) in Jasper National Park is a nice hike, especially when the parking lot at the  Valley of the 5 Lakes is full. Wabasso is the Stoney Indian word for rabbit, and just like rabbits there is more than one lake. As the trail crosses the floor of the Athabasca Valley it climbs over a series of parallel ridges left behind by the glaciers of the Late Wisconsin Ice Age. Most of the hills are short and sweet and there is plenty of shade to keep you cool. The one long hill provides fine views back across the valley.Within the first kilometre a horse trail connects from the right, it is used by a local horse outfitter and runs to a staging area 500m south of the parking area on Hwy 93. The lake, which is normally home to beaver, loon and goldeneye is reached after three kilometres. There is an old camp and firebox along the shore that makes an excellent picnic site. Of the half dozen unnamed lakes scattered through the forest around Wabasso Lake, only one is easily visited. After following the shore of Wabasso Lake for 300m the trail bends sharply around the western corner of the lake. Look for a faint trail running north-west, near the no camping sign, for 200m to shores of a smaller lake.The main trail continues to run around to the north side of the lake to a trail junction at 4km. To the left is the continuation of Trail# 9 which connects with the Valley of the Five Lakes in another 6km and eventually leads to the Old Fort Point area near the town of Jasper, it is a great biking trail. To the right is the Wabasso Creek Trail which is best left to the horses carrying guests to Shovel Pass Lodge (www.skylinetrail.com/) on the  Skyline Trail.Parks Canada produces a free trail guide called 'Summer Trails' of this and other trails in the park. For map lovers there is the government topo '83 C/13 Medicine Lake' at 1:50,000 (trail incorrectly plotted) or Gemtrek's 'Jasper and Maligne Lake' at 1:100,000. Both are available from the The Friends of Jasper.Submitted by 'mtncat'.In winter please check the local avalanche bulletins.",
    "directions": "Drive south from the town of Jasper on Hwy 93 for 14km to the Wabasso Lake parking area on the left side of the road.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/1680/reg_042-11997.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1680/reg_043-11997.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1680/reg_MtHardistyOverWabassoLakejpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1680/reg_map.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/wabasso-lake-near-jasper-ab-1680",
    "stats": {
        "Activities": "hike mtn-bike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "6 km",
        "Town": "Jasper, AB",
        "Type": "out-and-back"
    },
    "title": "Wabasso Lake",
    "trail_id": "1680"
}