{
    "description": "The Path of the Glacier Loop in Jasper National Park is an easy way to get up close and personal with a big mountain draped with glaciers. That said, the trail, tucked under the north face of the mountain, can be a cool place even on a mid-summers day so a light jacket is a good thing to bring along.The trail is an excellent place to learn about glaciology and forest succession, but what most people take home is a new respect for the immense power of a big mountain. The north face rises over a kilometre above your head to the summit of the mountain at 3363m. At that elevation the mountain receives a dusting of snow almost every week of the year, and all that snow only has one place to go...down. Visit in the days following a storm and you'll be in for a show like no other. Avalanches stream like rivers down the face of the mountain and accumulate on the glaciers below. The extra weight on the glaciers causes them to slide a little farther down the mountain, pushing the leading edge of ice over the cliff. Once unsupported the ice beings to bend and break creating serracs, some the size of a house, teetering on the edge of oblivion. Losing the battle with gravity the ice eventually breaks free and crashes like thunder down the cliffs. Rock loosened by the falling snow and ice give in and take the plunge, crackling like gunfire as they ricochet down the mountain face. All this as you can imagine, makes the base of the cliffs a very dangerous place to be, so don't be silly and go past the \"Do not go past this point\" sign.Start the loop by climbing the stairs above the parking lot to the memorial for nurse Edith Cavell. Edith Louise Cavell never visited Canada but her work and sacrifice during the First World War will never be forgotten. Throughout the Commonwealth, mountains, schools, streets and parks have been named in her honour. Visit (http://www.stephen stratford.co.uk/edith_cavell.htm) & (http://www.greatwardifferent.com/Great_War/Cavell/Cavell_00.htm). Every year on the first Sunday in August, the Anglican Church in Jasper holds a memorial in her honour. Ahead of you the trail runs through a wasteland of glacial debris left behind by the retreating Cavell Glacier. It is easier to hike the low trail to the lake and back again. If this is the plan turn right behind the memorial and look for the path just beyond the bench. There is a braided stream from the left that must be crossed in the first 100m, look for little bridges across the bigger channels. It was among this rubble that they shot a scene from the 1954 film The Far Country starring James Stewart. (http://www.imdb.com/title/tt0048055/). After the crossings the trail becomes obvious (lined with rocks), a follows the climbers left of the creek all the way to Cavell Pond at 800m. The trail tends to be wet but not muddy, until mid-summer. Return the way you came.For people with more energy it is better to turn left at the memorial and follow the paved path next to the forest. The trail climbs past Teahouse Creek then climbs some more to the Cavell Meadows junction at 500m. Along the way you are likely to hear and see some local residents; Chipmunks and golden-mantled ground squirrels (like a chipmunk on steroids) live along the edge of the forest. While pikas and hoary marmots live amongst the rocks.  Just beyond the junction the paved trail ends and the track becomes rocky and views of the glaciers and Cavell Pond improve. Be careful on the descent to the pond, the trail is eroded and the rocks can slide under foot.Cavell Pond is a scene right out of the ice age. On the far side of the pond is Cavell Glacier, which calves off icebergs into the lake. Above the pond is Angel Glacier with its wings spread out on the rim of a cirque and the gown draps over the edge. Angel Glacier has shrunk considerably in the last century but is still quite active and ice avalanches are still common. On the main face of the mountain, on the same ledge as the angel's left wing, is Ghost Glacier. How Ghost Glaciers clings to its precipitous slope is beyond me, it looks like it should have given in to gravity long ago. Please Note: Glaciers are very dangerous and unless you have the knowledge, experience, equipment and skill to keep yourself and your children safe you should stay well clear of them. The return trail follows the creek that drains the pond. In the early season parts of this trail are over run by the creek but the water is never deep and is easy to by-pass.Parks Canada produces a day hiking guide of this and many other trails in the park called \"Summer Trails\" which is available for free from the Jasper Information Centre. For map lovers there is the government topo '83 D/9 Amethyst Lakes' (trail incorrectly plotted) and Gemtrek's 'Jasper and Maligne Lake'. These maps are available from the The Friends of Jasper. Submitted by 'mtncat'.",
    "directions": "Drive south of Jasper on the Icefields Parkway (Hwy 93), past the park gate at 7km turn right on 93a. Follow 93a for 5.5km and turn right on the Edith Cavell Road. Drive 15km to the parking lot at the end of the Edith Cavell Road. The Edith Cavell Hostel (www.hihostels.ca) near road's end is the only overnight accommodation near the mountain. Please Note: The Edith Cavell Road is seasonal and typically does not open till late June, then closes in late-September or early-October with the first major snowfall. The road is narrow, has a number of switchbacks and is full of potholes. Drive defensively.",
    "geohash": "c3k59",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/1682/narrowAngelandCavellGlaciersJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1682/reg_A-Glacier-Lake-2-30578_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1682/reg_A-Glacier-Lake-30578.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1682/reg_Angel-Falls-30578.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1682/reg_Jasper-053-21851.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1682/narrow_00019-19975.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1682/narrow_00022-19975.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1682/narrow_Jasper-063-21851.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1682/narrow_P7245575-30578.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/path-of-the-angel-glacier-loop-trail-near-jasper-ab-1682",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 5,
        "Time": "1 hrs",
        "Total Distance": "2 km",
        "Town": "Jasper, AB",
        "Type": "out-and-back"
    },
    "title": "Path of the Angel Glacier Loop Trail",
    "trail_id": "1682"
}