{
    "description": "NTS Map: 083e01The Celestine Lake Road in Jasper National Park is only open to vehicle traffic from May through September. The rest of the year it makes a nice hike through a quiet section of the park to fine views on Windy Point.Just past the seasonal gate the road crosses a wooden sluiceway and descends to Pretty Creek. At 1.5km you'll cross a recently rebuilt bridge over Vine Creek and a short distance later the Vine Creek trailhead on the left. Past Vine Creek the slopes above the road open up and at 3km the views improve across the valley. Windy Point at the four kilometre mark is the second point of land where the road skirts around a ridge at the base of Mt Greenock.Of course there is nothing saying you have to stop at Windy Point. The rest of the road is very interesting and makes for a great day trip on bikes, it's about 10km one-way to the Devona Road and 13km to the parking lot at roads end. It is possible to push on to Celestine Lake, Devona Lookout and the eastern section of the North Boundary Trail The snow is never too deep in this section of the park but x-c skiing on the road is sometimes possible right after a mid-winter storm. During the spring melt the road can be quite muddy, and when the first green plants begin to sprout, bears are common. Make noise to alert them of your presence.Map choices include the Government topo '83 E/1 Snaring River' @ 1:50,000 or Gemtrek's 'Jasper and Maligne Lake' @ 1:100,000, both available from the The Friends of Jasper.Submitted by 'mtncat'.",
    "directions": "Drive east of Jasper on Hwy16 for 8km and turn left on the Snaring Road. Follow the Snaring Road for 6km to the end of pavement. Follow the non-gated fireroad another 8km to the stop sign and gate at the beginning of the Celestine Lake Road . From this point on, when it is open, it is an alternating one way road.Celestine Lake Road is open May through SeptemberHours in: 8-9, 11-12, 14-15 & 17-18hrsHours out: 9:30-10:30, 12:30-13:30, 15:30-16:30 & 19:30-20:30hrs Please Note: The Celestine lake road is narrow, winding and very rough. Leave the sports car at home. At one point, as the road wraps around the base of Mt Greenock, you are driving along the edge of a cliff with no guard rail. The person in the passenger seat will no doubt be very nervous, use caution.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/1683/reg_LookingacrossJasperLakeattheMietteRange.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1683/narrow_DrivingaroundWindyPoint.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/celestine-lake-road-near-jasper-ab-1683",
    "stats": {
        "Activities": "hike mtn-bike",
        "From": "",
        "Seasons": "winter fall summer",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "8 km",
        "Town": "Jasper, AB",
        "Type": "out-and-back"
    },
    "title": "Celestine Lake Road",
    "trail_id": "1683"
}