{
    "description": "NOTE:  As of June 2008, Myra Canyon is fully open for business.  There may be a little bit of finishing touches so a call might be in order, but you should be good to go!The KVR (Kettle Valley Railway) is 98% open for business.  There are still several trestles that are yet to be replaced in the scenic Myra Canyon section but some were not damaged, a couple have been replaced and a bunch more are due for replacement in the summer of 2005.   It is a great time to be out there now as the trail is empty.  One local tour operator said his business dropped 75 percent in year after the Okanagan Mountain fire because people think none of the trails are rideable.  WRONG, WRONG, WRONG.. Get out there, it is a great place to go riding today.So, we started out one cloudy but so-far dry day from Kelowna and drove up to the parking area above June Springs Road (right about N49d  47.368 W119d  22.321) and rode about 4km east until the trail ends at the trestle whose remains are pictured.  We then turned around and rode back to the parking area and left our companion Buzz who had his full Border Collie workout for the day.  We then continued another 10km west, crossing over the Bellevue Creek Trestle still covered in orange fire retardant.  The trail turned into a deep puddle near Gillard Creek and we thought this was as good a place to turn around as any.The 'trail' itself is a very easy ride, it was meant for trains (old, weak trains at that) so the steepest grade you will find anywhere on the KVR is a puny 2.2%  (2 feet of rise in a hundred feet of run).  EASY riding..  Also, 15 feet wide so socializing and safety are easily accomplished.  In fact we came across a school group in a small school bus right beside the west end of the Bellevue trestle that had driven up from Vancouver.  Even though we were there on a cloudy, slightly hazy day, there are spectacular views.  You can see the scale of the damage from the fire, but as one local optimist said, \"it really opened up the views\".For the downhiller among us, there are several branches that veer off from the KVR and head down.  You can shuttle if you don't want the cardio of 400+ vertical meters of riding back up.  2km east of the parking is the trail head for the Myra Canyon Bailout trail.  About 2-4km east are 2 or 3 other trails that head downhill from there.  Bring Yer Armour, they are said to be a solid, fast down hills with allegedly a few stunts.  Best of all, they are all Ranger approved so you don't have to stress about riding on closed turf.Along the rail bed there are a number of historical points of interest such as footings from water towers, section houses and a baking oven left over from feeding the hoardes of immigrant workers building the KVR over 100 years ago.  The KVR Society has done a great job in making this an entertaining and educational ride.",
    "directions": "Many ways from Kelowna, the short answer is get yourself to June Springs Road (from McCulloch or Benvoulin or Lakeshore/Casorso).  Keep following it South and UP until it turns into a nasty uphill forestry road (sorry, I missed the name).  It is one of the prime ways to get to Myra area though and should be easy to find.  Parking as earlier mentioned is at: N49d  47.368' W119d  22.321'",
    "geohash": "c2g",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/1690/long_buzz.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1690/reg_best1_trestle.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1690/reg_burned.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1690/topo_map.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1690/narrow_Trees.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1690/narrow_view2.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/kettle-valley-railway-west-of-myra-canyon-near-kelowna-bc-1690",
    "stats": {
        "Activities": "snowshoe hike ski-xc mtn-bike",
        "From": "",
        "Seasons": "winter fall summer",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "30 km",
        "Town": "Kelowna, BC",
        "Type": "out-and-back"
    },
    "title": "Kettle Valley Railway - West of Myra Canyon",
    "trail_id": "1690"
}