{
    "description": "The Valley of the Five Lakes (Long Loop) in Jasper National Park is one of the best valley bottom hikes near the town of Jasper. The lakes themselves are striking in their beauty and varied in colour. This loop takes in all five lakes and it's not as busy, for most the most part, as the short loop.From the trailhead follow trail #9a through the forest for one kilometre to the long bridge over Wabasso Creek. After crossing the bridge turn left onto trail#9 and follow it as it climbs across an open slope. Entering the forest the trail runs through a long draw and passes a small unnamed lake on the left. Just past 3km the trail drops into a valley, crosses the creek that drains the Valley of the Five Lakes, then climbs up the other side. At 4km turn right on trail #9a towards the First Lake. At 5km the lake show begins as the First Lake comes into view below the trail. For the next 2kms the lakes parade by, each with its own distinct character and colour combinations. While the First Lake is the longest lake in the chain, it is also the hardest to get a good view of. Between the First and Second Lakes is the first junction with trail #9b, keep straight ahead on trail #9a. The Second Lake is the smallest lake and should really be called a pond. If there are diving ducks (ie: golden eye) swimming about the Third Lake you are in for unique show. The water in the lake is very clear and it is possible to watch the ducks from the trail as they dive below the surface in search of food.  Between the Third and Fourth lakes is a beautiful point of land. This is the perfect place to stop if you brought a picnic lunch, but not in May when the ticks are out. The Fourth Lake is charming but the Fifth Lake is divine. Its green waters stretch off to a hidden bay that begs to be explored by boat. The boats at the Fifth Lake are available for rent in the town of Jasper at Online Sport and Tackle (1-780-852-3630) or Curries Guiding at (http://www.jasperoutdooradventure.com/). The lakes contain brook trout but the fishing is not what it used to be. At the Fifth Lake the trail passes through an old picnic area and crosses a creek before climbing away from the lakes. One more glimpse of the Fourth Lake and it=s up and down over several glaciated ridges to the next trail junction. Keep left on trail #9a (the second junction with trail #9b) and descend the hill. At the bottom of the hill cross Trail #9 then the long bridge. One final kilometre brings you back to the parking lot where it all started.Jasper National Park produces a free day hiking guide called 'Summer Trails' of this and many other trails in the park, it is available at the Jasper Information Centre. Gemtrek produces two maps of the area 'Jasper Up Close' at 1:35,000 and 'Jasper and Maligne Lake' at 1:100,000. The Government topo '83 D/16 Jasper' at 1:50,000 shows the area as well but rare is the trail that is correctly plotted on this map.Submitted by 'mtncat'.NTS Map: 083d16Elevation Gain: 30 m (98 ft).In winter please check local avalanche bulletins and conditions.",
    "directions": "Drive south of Jasper on Hwy 93 (The Icefields Parkway) for 9km to the well signed parking lot on the left side of the road. There is a pay phone, privy and garbage can in the parking lot.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/1693/reg_PICT0024JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1693/reg_PICT0046JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1693/reg_PICT0064JPG_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1693/narrow_RockcressJPG.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/valley-of-the-five-lakes-long-loop-near-jasper-ab-1693",
    "stats": {
        "Activities": "hike mtn-bike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 3,
        "Time": "3 hrs",
        "Total Distance": "9 km",
        "Town": "Jasper, AB",
        "Type": "out-and-back"
    },
    "title": "Valley of the Five Lakes (Long Loop)",
    "trail_id": "1693"
}