{
    "description": "CBC is the crown jewel of trails for mere mortals, on Seymour Mountain, on the North Shore of Vancouver.  It deserves special attention because NSMBA (North Shore Mountain Bike Assoc.) has recently re-built it with lots of ladders that are not so tough - and others that are.  The great thing about CBC is that it makes for one nice shuttle ride as you can drive almost to the top of Seymour Parkway, catch CBC, and then your choice of lower trail (like Boogyman or Severed, Neds, or, Pangor) for a nice long ride -- as long as downhill rides go.  Often riders do CBC, Corkscrew, Pingu-pangor (or boogey).  At the entrance to corkscrew off the road (where cbc spits you out you have to ride the highway down one long arc on the road) you choose between Corkscrew or heading to the right to do neds.  The complete tour is described on trailpeak as \"Seymour overview\", as is neds, Corkscrew.To find CBC, drive up Mt. Seymour Road and go past the Parking area that most people use to access Boogyman or Ned's (close to old mushroom lot). Keep going, look for the parking area after the inside of a sharp switchback 9this used to be the parking area, it's now closed off and they want you to pay!), and just a little further up the road you'll see a microwave tower on the left -- as a landmark.  Park at the public parking area past that, it's a large paved parking lot you can't miss it. The parking area will probably be busy and the \"HuckWagon\" makes stops there - it's only $5 a ride from the bottom parking lot(s).  Access to the trail is back down the road, in behind the barrier, where the old parking area has been closed off, now go down an access trail (very short) and keep to the right of the small building/fence area which gives you access to the trail.  It's real easy to find but geeks can grab the attached GPS data. All you realy have to do is hang out in the parking lot (lower or upper) and ask, but the map we created below is pretty good too, it's on a topo map of the area. Have fun.\nDirections from Vancouver:Take 2nd narrows bridge to North Van, Shortly after crossing, look for signs to Mt. Seymour Parkway, on the right, Follow along Mt. Seymour Parkway, approx 5km, looking for Mt. Seymour Road (takes you up to the ski hill if you were to take it all the way). There is a mall - Northhlands mall, at the intersection,Just under a kilometer up Mt. Seymour Road, look for a turnoff on the left for \"Northlands Golf Course\".On the immediate right, is the parking lot, probably full of riders.For shuttlers, leave one car here and take the other up to the upper parking lots (above Neds), or further, above CBC!",
    "directions": "See description and / or GPS",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/170/reg_kurtcbc1footerwoohoo.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/170/reg_mark2cbc.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/170/reg_mark4cbc.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/170/reg_markbob.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/170/reg_nelnelcbc2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/170/reg_topocbc.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mt-seymour-cbc-near-north-vancouver-bc-170",
    "stats": {
        "Activities": "mtn-bike",
        "From": "",
        "Seasons": "summer",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "2 km",
        "Town": "North Vancouver, BC",
        "Type": "out-and-back"
    },
    "title": "Mt. Seymour - CBC",
    "trail_id": "170"
}