{
    "description": "The first is via a steep (extremely) trail leading up from just off of Chilliwack Lake Road. You will gain 4600ft, most of it in the first 2/3 of the trail if you go this way. The trail is marked with orange markers and ascends straight up. There is one brief viewpoint shortly before the intersection with the trail from Ford Mountain. If you have strong knees and even stronger lungs, take this trail. It's 6km shorter than the other route.\r\n \r\nThe other way is via Ford Mountain. You won't get too far up the Ford Mountain Forest Service Road without at least an all wheel drive vehicle. \r\nFrom the trailhead it's 1.5km to the top. The trail switches back, climbing steeply for about 45 minutes through forest.  From there, the trail is gently rolling all the way to the summit. We made it in an hour and a half from the car.\r\n \r\nThe summit is a flat plateau with the remnants of an old lookout. Views of the surrounding peaks abound with a 360 degree panorama. \r\n \r\nTo continue on the Williams, plunge back into the forest, scrambling over and under deadfall & gaining and losing the same 100 feet over and over and over again for a few hours. There are a few views of Welch, Foley, Slesse & Rexford along the way... just enough to keep you going but not enough to really diminish the misery of the trail. \r\n \r\nEventually you will come to the junction of the steeper trail on the right. Shortly after that, he trail finally stops going up and down and just went up, although not steeply except for one very steep bit. After that, it isn't too much longer before you leave the worst of the trees behind. \r\n \r\nThe views are beautiful and before long you'll leave the last of the trees behind you and break out on to the open ridge with Williams Peak right in front of you.  Welch, Foley & Goetz are to the north, and Slesse, Rexford, Webb, Macdonald, Lindeman, Paleface, Meronuik & Edgar are to the south. It is possible to scramble up Williams but you'll have to start earlier than we did as it will add a couple of hours to the trip. It had taken about 6 hours (including breaks) to get to this point. \r\n \r\nI'm glad we did it... I wish we'd been able to climb Williams Peak but I don't think I'll be going back any time soon. Maybe if I can do something about these knees I'll go up via the steeper trail. \r\n\r",
    "directions": "See description and / or GPS",
    "geohash": "c29x",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/1701/reg_DSC05895-42566.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1701/reg_DSC05896-42566.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1701/reg_DSC05898-42566.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1701/reg_DSC05900-42566.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1701/reg_chilliwacklakejpgjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1701/reg_marianwelchfoley1jpgjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1701/reg_rexford2jpgjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1701/topo_slesse1jpgjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1701/narrow_williams2jpgjpg.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/williams-ridge-near-chilliwack-bc-1701",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 5,
        "Time": "1 hrs",
        "Total Distance": "20 km",
        "Town": "Chilliwack, BC",
        "Type": "out-and-back"
    },
    "title": "Williams Ridge",
    "trail_id": "1701"
}