{
    "description": "Industrial Disease, in the West Side Trails area of Whistler, is a steep technical single track mountain bike trail that drops off of Flank Trail.  The trail is steep and flowy, with rock rolls and drops through tight trees, often on very loose dirt and rocks.  There are some sections of pedalling, but generally it's a smooth and steep downhill. (did I say it was steep?)\nThere are three trail entrances to Industrial Disease.  The middle one is sign posted, and is the preferred and official entrance.  \nThe southern entrance is really an exit for a short loop that takes the main entrance up onto the rock slab, then takes a right across clean granite to a steep drop, then more single track back to Flank.\nThe northern entrance, marked only with a bit of ticker tape, has a short initial climb with a large-ish (2x2 metre) slab of granite at the entrance.  This entrance cuts off the first km of the trail, and is an alternative way in for those coming along Flank Trail from the north.\nIndustrial Disease gets a double black diamond rating by  Whistler Off-Road Cycling Association (WORCA), so take care, and take a friend.\nThere are a couple of alternative routes for the bottom section of Industrial Disease.  When you cross the Sproatt Creek, the original Industrial Disease route climbs up steeply to the left to meet at a three trail intersection.  Danimal South continues as a more mellow route to join Lower Sproatt Trail, while Moose Knuckles, a more technical downhill trail, heads back down to Sproatt Creek.  There is now, however, a short cut trail that leaves Industrial Disease at the bridge (avoiding the climb) and follows straight down Sproatt Creek to join up with Moose Knuckles further along the trail.\nDirections\nFrom Function Junction:\nTurn into Function Junction (at the lights well south of Creekside) and follow the road across the train track.  The entrance to Flank Trail is the Coffee shop and Lordco.  Flank trail switches back steeply then straightens out a bit.  After 20-45 minutes keep your eye out for the marked entrance to Industrial Disease on your right.\nFrom Alta Lake Rd:\nTake the new road into Stonebridge, near the southern end of Alta Lake Rd above Nita Lake.  Follow this up for about 2km, taking the first (and only) left.  Ride this to the end.  On the right of the plant, follow the loose single track up steeply, staying right at the obvious intersection onto Flank Trail.  The riding gets easier from here.  Ride Flank for about a half hour until you get to the sign posted trail entrance for Industrial Disease.",
    "directions": "See description and / or GPS",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/1702/reg_Danimal-Industrial-Disease-intersection-0003-6103.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1702/reg_Moose-Knuckles-trail-head-0002-6103.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1702/reg_access-trail-to-flank-0115-m-6103.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1702/reg_best3_industrial-disease-0152-m-6103.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1702/reg_flank-industrial-disease-main-entrance-0148-m-6103.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1702/reg_flank-industrial-disease-northern-entrance-0145-m-6103.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1702/reg_flank-to-industrial-disease-0119-m-6103.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1702/reg_flank-trail-view-of-black-tusk-0124-m-6103.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1702/reg_industrial-disease-0146-m-6103.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1702/reg_industrial-disease-0150-m-6103.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1702/reg_industrial-disease-fun-slab-0149-m-6103.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/industrial-disease-near-whistler-bc-1702",
    "stats": {
        "Activities": "mtn-bike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "3 km",
        "Town": "Whistler, BC",
        "Type": "out-and-back"
    },
    "title": "Industrial Disease",
    "trail_id": "1702"
}