{
    "description": "Aside from the length, this trail is relatively easy to hike. The trail is predominantly in the open, so the views are fantastic throughout. Aside from the Berg Lake section, I did not meet a single hiker on this trail, and this was in the middle of the summer.The most scenic campsites are at Chown Creek and Twin Tree Lake.For a more complete description of this trail, here is my trip log:Day 1 -  Dropped off the bus at 4 am, and began the hike around 5 am. In the first day I hiked a phenomenal 45 km to Wolverine campsite in Jasper. The Berg lake trail made up the first half, and this was by the most gorgeous 23 km I've ever seen. Robson dominates the view most of the way, but glacial lakes and waterfalls compete for attention. The Berg Lake trail is easy and well maintained.After arriving at Berg Lake I took a short swim, and continued on into Jasper park. The hiking is relatively easy, although the trail is not well tread. Even though it is in a valley, there is little tall vegetation, so the views are generally 360 the whole way. I stayed at Wolverine campsite, which is a lack luster site  Day 2 -  I had planned to hike all the way Twintree, but once I had gotten to Chown Creek, I couldn't see the sense in missing this great campsite. There is a large bridge across the creek that provides some relief from the bugs, and the site itself is on the shore of the river. The views are 360, with the massive Mount Bess dominating view. I was lucky enough to spot a white wolf at this site, about 20m away from the site.The hike this day was just 14 km  Day 3 -  I covered 19 km, arriving at Twintree campsite in mid afternoon. This campsite was the best that I saw along the trail, at least in terms of scenery. The actual site is on the river, just at the base of the lake.  Day 4 -  This segment of the trip was probably the best in terms of scenery. From Twintree I hiked up to Snake Indian pass, where the subalpine segment is probably about 10 km. I covered 28 km, camping at Oatmeal. This site has nothing to recommend it, unless you are a fan of porcupines. I had 2 porcupines who hung out around my tent all night, making all sorts of strange noises, and generally driving me nuts.Day 5 -  This segment of the trail descends in the valley, and thus in marshes, and thus into horrendous bugs. The section just before Blue Creek Valley is the worst. This section, however, was incredibly scenic, mountains  seeming to jutt out of the with wide marshes. I hiked 28 km and camped at Blue Creek Valley.  Day 6 - I hiked 26 km to Willow Creek. Nothing remarkable about this section. The vegetation changes from boreal-type into grassland and willows. The mountains are far in the distance in this section.I was lucky enough to meet a father and son from Toronto who were willing to give me a ride to Jasper from the Rock Lake trailhead. Day 7 -  Hiked out to the Rock Lake trailhead, 14 km. Nothing remarkable about this section.",
    "directions": "Trailheads are the Berg Lake trail head in Mount Robson, and the trail can end either in Rock Lake in Alberta or another that is in Jasper National Park, maybe about 40 km north of Jasper.",
    "geohash": "c3",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/1706/reg_010-19975.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1706/reg_i12jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1706/reg_i3jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1706/reg_i4jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1706/reg_i7jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1706/reg_lowersmokeycabin.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1706/reg_map.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1706/reg_wolverinecabin.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1706/narrow_044-19975.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1706/narrow_crossing-smokey.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1706/narrow_smokey.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/north-boundary-trail-near-jasper-ab-1706",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 5,
        "Time": "168 hrs",
        "Total Distance": "192 km",
        "Town": "Jasper, AB",
        "Type": "out-and-back"
    },
    "title": "North Boundary Trail",
    "trail_id": "1706"
}