{
    "description": "NTS Map:92F1.  An easy - mostly level 8km trail that take you around Newcastle Island - first developed as a tourist resort by the CPR in the 30's - the island - a 10 minute boat ride from downtown Nanaimo is now a popular provincial park - it provides camping opportunities as well as a small concession stand and lot's of hiking and biking trails - follow the map carefully as not all trails are bike accessible.\r\nIt doesn't matter if you do it clock or counter clock wise - on this visit which was the result of me being on a cruise ship that was paying a visit to Nanaimo I did it in a counter clock wise direction - starting from the developed area follow the Shoreline past Brownie point - good views of Protection Island here - you then turn right and follow the shoreline for a km or two until you come to a junction - if short on time you can follow this to Mallard Lake and rejoin the Shoreline or Channel trail from there - if you have more time follow the trail to MCKay Point and some good views of the ferries leaving Departure Bay - no bikes on  this section.\r\nAfter visiting Mallard Lake head back to the Shoreline trail and the  Sandstone Quarry and good views across the channel to Nanaimo.\r\nFinish up with a drink or bite to eat and then take the boat back to Nanaimo",
    "directions": "From downtown Nanaimo's Maffeo Sutton Park take the shuttle boat to the Island - it's $7.00 return and operates on an hourly basis - sometimes more often if large groups are camping on the island.",
    "geohash": "c0xz",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/1722/reg_DSC00048JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1722/reg_DSC00058JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1722/reg_IMG-0724-37200.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1722/reg_newcast2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1722/reg_newcast3.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1722/topo_Newcast1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1722/narrow_IMG-0705-37200.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/newcastle-island-shoreline-trail-near-nanaimo-bc-1722",
    "stats": {
        "Activities": "hike mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "8 km",
        "Town": "Nanaimo, BC",
        "Type": "out-and-back"
    },
    "title": "Newcastle Island - shoreline trail",
    "trail_id": "1722"
}