{
    "description": "NTS Map:92F11.  Mt. Becher provides excellent views of the Comox glacier and the coast mountains across the Georgia Straight.  Hike time to the top is approximately 4-5 hours return and the distance is approximately 11 kilometers return.  The beginning of the hike is up the old ski hill and it will get you panting in no time.  From there on you follow an old 4x4 track gently heading upwards.  Once you get to the parking lot, you will notice a burnt out building and the trail starts to the right of it.  Throughout the hike look for flagging and stay to on the main trail.  From the burnt out building head up the old ski hill.  In about 10 minutes you will pass under the chair lift. In another 10 minutes you will head under the chair lift again, head straight ahead.  You are no longer going up a ski run anymore.  After 10 minutes you reach a large T-junction, head right, your grunt up hill is now more relaxed.  After 5 minutes you will come to an old T-bar lift, head under the T-bar on the path.  In a few minutes you will come to a Strathcona Provincial Park boundary sign, head to the right.  After 10 minutes you will come to a tree with 2 pieces of wood nailed to it, keep right.  In 15 minutes you will come to a directional tree, follow the direction of Mt. Becher.  After another 15 minutes you will come to a sign posted tree marked Boston Lake, head right.  In 10 minutes you will come to a sign posted tree marked Â?To The Top,' head left on the main trail, do not follow the overgrown trail to the right.  In about 5 minutes you are above a rock face that you just climbed up, stay to the right by the stream.  From here one follows the cairns and the flagging, very straight forward.  In about 30 minutes you will be on the top.",
    "directions": "From highway 19 head north to Courtenay, at the second exit make a right, Piercy Rd. Make a right at the first road it will be Forbidden Plateau Road (it might be called Piercy Rd on some old maps).  Follow this road all the way to the top.  The gravel road can be quite rough in parts, with some washboard areas.  The road is passable by all vehicles.  I have never been up in the winter time so I cannot comment on what the road condition is like.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/1726/long_MtBecher.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1726/long_becher4.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1726/reg_BecherSnowshoeApril2206020jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1726/reg_DSCN1330-28668.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1726/reg_IMG-1230-13979.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1726/reg_IMG-1237-13979.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1726/reg_IMG-1273-13979.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1726/reg_Mtbecher1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1726/reg_becher3.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1726/topo_becher2.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mt-becher-near-courtenay-bc-1726",
    "stats": {
        "Activities": "mtn-bike ski-bc ski-downhill hike snowshoe",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 4,
        "Time": "4 hrs",
        "Total Distance": "11 km",
        "Town": "Courtenay, BC",
        "Type": "out-and-back"
    },
    "title": "Mt. Becher",
    "trail_id": "1726"
}