{
    "description": "St Peter's Island is a small land mass resting about 4-5 Km off shore in the Northumberland Strait. Although deesignated as an Island, it is connected by a long thin sand bar which may have been used to support a road.\r\n\r\nThe Area makes for a fun near-circumnavagation, (I think there is a sand bar which connects to the mainland) and as you get further behind the island, it offers an attractive vista of red cliffs and soft-wood stands. There is also an automated lighthouse around the back. \r\n\r\nSt. Peter's Island would make a great evening paddle, or an afternoon jaunt with plenty of opportunities for exploring sea and bird life on shore. If you keep a look out, you might even see the occasional seal.\r\n\r\nThe island also holds potential for kayak camping, but make sure you bring your own water, as I am doubtful of fresh water sources there. Remember, leave no trace. I don't know who owns the land.\r\n\r\nFinally, the tides in the area make for some shallow areas. In addition, the wind can pick up making for a more challenging go of things. Every time I've paddled the region, I've gone up against a gusty wind. Be prepared. A morning paddle would give you two bonuses; a low morning sun on the rock, and calm seas.",
    "directions": "From Charlottetown, head to Cornwall, and head toward Route 19 to get to Nine Mile Creek. Look for the Warf road on the shore side. There's a quaint fisherman's warf with a great launch site, and plenty of room to park.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/PE/1728/reg_stpetersIslandJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/1728/reg_stpeterscape.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/1728/reg_stpeterscove.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/1728/reg_stpetersseasculpt.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/1728/reg_stpetersshot.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/1728/topo_stpetersisland.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/1728/narrow_stpeterssea.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/st-peters-island-near-charlottetown-pe-1728",
    "stats": {
        "Activities": "sea-kayak",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 3,
        "Time": "3 hrs",
        "Total Distance": "12 km",
        "Town": "Charlottetown, PE",
        "Type": "out-and-back"
    },
    "title": "St Peters Island",
    "trail_id": "1728"
}