{
    "description": "NTS Map: 92G15.  Easy access and high alpine make this a classic hike. Few hikes put you in such exceptional terrain so quickly. The route is an old road once used to access the old Diamond Head Lodge -- now a part of history. What remains is a jeep road that is still used by B.C. Parks to supply the ranger station at Elfin Lakes. It's  generally a good double-track except for some loose rock and a few muddy areas after a rain.The hiking trail-head is 16 kilometers from the Sea-to-Sky highway (99) at an elevation of 1000 metres. If you park at the trail-head the area has seen a bit of criminal activity by local dysfunctionals so be sure to take valuables with you or keep them out of site. The first 3.5-4 kilometres from the trail-head are the steepest until you get to Red Heather Meadows (1450metres). A great waterfall on the way provides a fresh cold drink.  The meadows in winter provide perfect terrain to practice your tele-turns. In another 2.5 kilometres the high point of Paul Ridge (1660metres) is reached. The vistas open up and you can see your destination another 5 kilometres in the distance.  Mt. Atwell can be seen as the diamond shaped peak to the north, the areas namesake. On the north the spire in behind is the actual summit of Mt.Garibaldi (2678metres). The route is completely surrounded by mountains: the Tantalus Range to thewest, Mt. Garibaldi and Diamond Head to the north, Mt. Mamquamto the east. All have glaciers which cascade to tree line. Before and during the last ice age about 15-20,000 years ago Garibaldi Provincial Park was one of the premier volcanic areas of the Cascades. The Garibaldi Massif is in fact an old volcano. The sides have eroded away leaving a lava plug that still stands today. Mt. Atwell (Diamond Head) is mostly composed of compressed unstable muds. Black Tusk in Northern Garibaldi Park is another example of this volcanic geology.A gentle descent to Elfin provides superb riding around granite outcrops, past stunted alpine fir and through meadows of flowering heather. Eventually, the 11-kilometre track ends atthe shelter and ranger outpost at the lakes.  Campsites in the area make the trip suitable as an overnighter. Deeper in the park, many hiking options exist. Don't forget the sunscreen. One final note, if hiking up in late July or August, the hot hike up (or ride, this is one of the few areas that allow bikes up to the Elfin Lakes shelter area), is compensated for by an incredible swim in the larger of the lakes.  On a hot end of July day, our trio made straight for the lake, and while some find it still cold, others swim.  It's clear cold water.  The adjacent lake near the Ranger station is for drinking water.Elevation Gain 850 MetresNote: Add 1000 metre if starting from Highway 99.High Point     1660 MetresHiking Options:Hike NW to the saddle between the  The Gargoyles and  Columnar Peak?  for better views of the Garibaldi Massif and if you have the energy, dip down and hike up Little Diamond Head (1750metres) the often snowy cone below Mt Atwell.Hike NE out to Opal Cone(1710metres) on the edge of the Garibaldi Neve ( permanent snowfield)  a 13 kilometer round trip from Elfin Lakes. Or continue on to Mamquam Lake further to the east which is a 22 kilometre round trip from Elfin Lakes.ApproachTravel north to Squamish on Highway 99 (Sea-to-Sky). Continue 5 kilometres  past the town cross the Mamquam River. At the third set of lights turn right on the Mamquam River Road. Follow the signs to the Diamond Head Parking Lot at 1000metres. Once the road enters Garibaldi Park it steepens. The road is maintained a few times a season but sees a lot of traffic, use the pullouts and keep and even speed to lessen the creation of potholes. Cars can easily make this trip in the summer months.Hike Breakdown0km1000m\tLeave parking lot and start hiking up to Paul Ridge3.5km1450m      Red Heather Meadows and shelter6km1660m        Paul Ridge high point11.5km1470m     Descent to Elfin LakesContactsBC Parks Squamish      1-604-898-3678  Free Through Inquiry BC  604-660-2421 If  phoning out of the lower mainland  800-663-7867Note: Rates!If you are planning to go overnight camping, reserve online at http://www.discovercamping.ca. The park charges $10 per night for staying on the campground, and $15 per night for staying in the Elfin Lakes shelter. lots of footage snowshoeing into Elfin",
    "directions": "See description and / or GPS",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/173/long_n87736547212681542465jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/173/mtb_Garibaldi_100dpi_for_kurt.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/173/reg_ElphinLakespics005ajpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/173/reg_ElphinLakespics007ajpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/173/reg_IMG-7014-9576.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/173/reg_IMG-7028-9576.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/173/reg_IMG-7079-9576.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/173/reg_IMG-elfin-evening-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/173/reg_IMG-elfin-return-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/173/reg_IMG3130JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/173/reg_IMG3137JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/173/reg_IMG3140JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/173/reg_IMG3144JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/173/reg_hikeupJU.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/173/reg_lakes2Kurt.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/173/reg_n87736547212681726563jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/173/reg_topKurt.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/173/reg_topleftKurt.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/173/reg_upperelfinlake.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/173/topo_lakesKurt_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/173/narrow_part2.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/elfin-lakes-garibaldi-provincial-park-near-squamish-bc-173",
    "stats": {
        "Activities": "snowshoe hike ski-bc mtn-bike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 4,
        "Time": "8 hrs",
        "Total Distance": "23 km",
        "Town": "Squamish, BC",
        "Type": "out-and-back"
    },
    "title": "Elfin Lakes  (Garibaldi Provincial Park)",
    "trail_id": "173"
}