{
    "description": "NTS Map: 092G11\r\nThe BCMC's Mountain Lake Hut sits in an idyllic alpine meadow surrounded by peaks and sparkling cool lakes. \r\n\r\nYou could do this as a day trip but there is so much to do in the immediate area I don't know why anyone would. Stay the night so you can roam the ridges, bag a peak or two, take a dip in the crystal clear lakes or just relax and take in the views.\r\n\r\nBC Mountaineering Club members can shave 10km of logging road off of their route by obtaining the key to the gate (email for more info: info@bcmc.ca) and driving almost right to the trailhead. \r\n\r\nDave Scanlon put this trail in and did a ton of maintenance work on the hut over 2003-2004, making this relatively rarely used area much more accessible. Located in the Fury Creek area, you can spend more time hiking and less time driving. The logging road is a bit rough in spots, likely ruling out low clearance vehicles but a 2wd with good traction and some clearance should be able to make it as far as the last .5km. After that, the water bars will keep all by the 4x4's from progressing.\r\n\r\nDrive in as far as you can, then continue hiking along the deactivated logging road. After about half an hour, hang a left onto an old, VERY deactivated logging road. The turnoff is marked with flagging tape. Don't look for a road. It's been a long time since this was a road. After another half hour of scrambling over logs and through mud, the trail opens up a bit and you come to a bend before you begin to traverse an open hill side. Continue following the road for about another 20 minutes. You'll come to some more flagging tape where the trail switches back and continues to traverse the hillside for another 15 minutes or so. Watch on your right for more tape and then plunge into the brush along the newly cleared trail which works its way up and across a steep forested slope. Watch your step as you work your way along, following the flagging tape for another 20 minutes or so before you break out into a boulder field flanked by massive cliff faces (that look like they'd be a lot of fun to climb I might add!). Beautiful views of Howe Sound can be seen from here. Rock hop along boulders following the cairns & tape. The trail is easy to follow except for one tricky bit through a small treed area just before emerging at the outflow of Windy Lake. \r\nThe rest of the trail is an enjoyable hike through heather meadows & alpine lakes with views of Mt. Sheer, Sky Pilot & Howe Sound if you go looking for it. Follow the tape & cairns and after about 50 minutes, you'll find the Mountain Lake Hut.\r\n\r\nSituated under Sky Pilot & Mt. Sheer, this well maintained cozy hut offers some of the comforts of home in a beautiful, serene setting. There is a cooking area & several stools downstairs, and room for 6 to sleep very comfortably on nice cushy thick foam upstairs. It gets very hot in the summer though so you may prefer to sleep outside.\r\n\r\nFrom the hut, Mount Sheer, Sky Pilot, Ben Lomond, and Red Mountain are all great objectives. Search Trailpeak for route descriptions (coming soon!)\r",
    "directions": "Take the Sea to Sky highway past the Furry Creek Golf Course, up the hill and then take your first right. At the 't' junction turn right. The red gate should be right there. You do need a key to open the gate. Contact the BCMC (www.bcmc.ca) to get the key. Drive for about half an hour, keeping left until you get to a stream crossing the road. Park here and continue hiking up the road until you see the trail branching off on your left.\r\n\r",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/1735/reg_12jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1735/reg_19jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1735/reg_47jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1735/reg_50jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1735/reg_6jpg.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mountain-lake-hut-area-near-squamish-bc-1735",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 4,
        "Time": "14 hrs",
        "Total Distance": "0 km",
        "Town": "Squamish, BC",
        "Type": "out-and-back"
    },
    "title": "Mountain Lake Hut Area",
    "trail_id": "1735"
}