{
    "description": "Français:Le mont Gosford est l'une des montagne de la chaine appalachienne et se trouve au nord de la frontière du Maine. Le sommet de cette montagne culmine à 1189 mètres et permet une vue à 360 degrés avec l'aide d'une tour d'observation. Il est même possible d'apercevoir le mont Washington par temps clair.\r\n\r\nLa ZEC Louise-Gosford dans laquelle le mont Gosford se trouve est sillonée de sentiers et il est donc possible de faire différents parcours qui varient de 9 à 40 km et plus encore. \r\n\r\nLe départ des sentiers se fait au refuge Rose-Délima et est bordé par un ruisseau très rafraichissant et des petites cascades douces pour nos pieds. La montée vers le sommet prend 4,5 km et au dernier elle se fait beaucoup plus abrupte. Cet effort est récompensé par la vue sur les montagnes avoisinantes et la brise. \r\n\r\nLes plus chanceux pourront apercevoir des orignaux et les autres, les nombreuses pistes lorsqu'on croise des sections de sentiers plus boueuses. Au sommet, il est possible de continuer vers le Cap-Frontière ou le Trou-du-diable et ainsi faire une boucle. Se procurer une carte est fortement conseillé, certains embranchements portent à confusion. Pour ceux qui aimerait prolonger leur séjour, il y a des lean-to et des plates-formes de camping le long des sentiers ainsi que tout près du refuge au départ des sentiers.English:Mont Gosford is part of appalachian chain and is just north of Maine boarders. The summit is at 1189 meters and allow hikers to view 360 degrees at the top of an observation tower. Sometimes when sky is clear you can see Mount Washington.\r\nThis mountain is located in ZEC Louise-Gosford and you can hike as many hours you want. To go back and forth to the summit is 9 kilometers but you could take a loop to Cap-frontiere and hike about 13 km. But you have to use a map to avoid confusion even if trailmarkers are clearly visible.The first part of the trail to the summit is boarded by stream you have to cross and little bit of mud in which you can see mooses path. Camping on the trail is easy, there's lean-to and platforms.",
    "directions": "Pour se rendre au mont Gosford à partir de Sherbrooke : \r\nSe diriger vers Lennoxville par la 143 Sud (rue Wellington Sud) \r\nAu centre-ville de Lennoxville, à la lumière, tourner à gauche sur la 108 Est (direction Cookshire). \r\nÀ Cookshire, tourner à droite sur la 212 Est (avant la voie ferrée) \r\nToujours sur la 212 Est, à environ 15km après le village de Notre-Dame-des-Bois, tourner à droite sur le rang Tout-de-joie. L'intersection n'est pas vraiment évidente. Il y a une petite pancarte qui indique le mont Gosford, mais elle n'est pas toujours visible. Il faut retenir qu'il ne faut pas atteindre le village de Woburn (~5km plus loin). \r\nSur le rang Tout-de-joie, à environ 6 km de l'intersection, l'accueil de la ZEC se situe à votre gauche (de toute façon, il y a une barrière 1km plus loin).\r",
    "geohash": "f2j9",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/QC/1738/long_montGosford009JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/1738/reg_best1_montGosford023JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/1738/reg_montGosford014JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/1738/reg_montGosford019JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/1738/topo_cartemontgosfordjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/1738/narrow_montGosford021JPG.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mont-gosford-near-megantic-pq-1738",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 4,
        "Time": "5 hrs",
        "Total Distance": "13 km",
        "Town": "Megantic, PQ",
        "Type": "out-and-back"
    },
    "title": "Mont Gosford",
    "trail_id": "1738"
}