{
    "description": "No Dogs: Maligne Pass has been identified as critical Woodland Caribou habitat, a threatened Species-at-Risk in Canada. In an attempt to reduce stressors on this disappearing icon of the Canadian wilderness Parks Canada has banned dogs from all Caribou habitat in Jasper National Park. (http://www.speciesatrisk.gc.ca/)The Maligne Pass Trail in Jasper National Park is normally tackled in one of two ways. The more popular choice is to hike the 11km to Avalanche c/g and use it as a base for explorations into the pass then retreating by the same trail. But those who do cross the pass will find a secluded wilderness valley that is much as it was when Mary Schäffer, armed with a map by Sampson Beaver, followed it to the shores of Maligne Lake in 1908.With a nice mix of forest and open views the trail is enjoyable from mid-summer through fall. In early season and after prolonged rain the trail can become muddy, especially if it sees heavy horse traffic. The bridge over the Maligne River north of Schäffer Camp as well as the Trapper Creek bridge are vital links during high water, check with the Jasper Trail Office for the latest conditions. 1-780-852-6177. Registration required, fees apply.From the Sunwapta Warden Station the trail climbs gently along Poboktan Creek gaining 200m of elevation in 6km. Turn left at the junction to Maligne Pass and follow the very attractive trail lush with heart-leaved arnica, purple aster, lousewort and paintbrush as you criss-cross Poligne Creek. One creek crossing is very scenic and the waterfall that is just visible from the trail is worth the short side trip, a great place to take a break. Avalanche c/g is reached at 11km and like all other hiker camps on the trail has: four tent pads, a bear pole with cables, fire boxes, a 'green throne' privy and tables of one sort or another.Avalanche c/g is a fantastic base camp for journeys into the broad alpine meadows known as Maligne Pass. Dominated by thick carpets of red, yellow and white heather and over twenty alpine tarns, the pass warrants much in the way of exploration. But please tread lightly in this beautiful area, the alpine tundra is fragile and takes years to recover from a single misplaced foot.From the Avalanche c/g the trail becomes faint and wet as it begins the climb to the pass. Soon the trail drys out and becomes well defined and reaches the summit of the pass at 15km. Dropping slowly down the Upper Maligne Valley the trail passes Mary Vaux c/g at 19km, Old Horse c/g at 20km and pulls in to Schäffer c/g at 29km. Old Horse is the only horse camp on the trail following the decommissioning of Trapper Creek Horse. Old Horse c/g has a table, fire pit and a green throne.Eight kilometres past Schäffer Camp is the bridge over the Maligne River and the Trapper Creek bridge is crossed at 43km. On the other side of Trapper Creek  is the c/g by the same name and the end of the long downhill jaunt from the pass. Beyond the camp the trail climbs over the ancient slide heap that created the northern half of Maligne Lake. Turning right in the last kilometre and following the Moose Lake Loop past the shores of Moose and Maligne Lakes is a  more interesting way of finishing your journey than staying on the main trail. Turn left on the shore of Maligne Lake and step back in to the 21st century. The parking lot is past the Maligne Lake Warden Station above the public boat launch. If your timing is right cold drinks await 500m down the road at the Maligne Lake Chalet. http://www.malignelake.com/restaurant.html The Maligne Pass trail is spread across three 1:50,000 Govenment topos, '83 C/6 Sunwapta Peak', '83 C/11 Southesk Lake' and '83 C/12 Athabasca Falls'. Gemtrek's 1:100,000 'Jasper and Maligne Lake' has 95% of the trail, only the area near the junction along Poboktan Creek is missing. They are available from the The Friends of Jasper.Submitted by 'mtncat'.NTS Map: 083C06Elevation Gain: 700 m (2,297 ft).In winter please check the local avalanche conditions.",
    "directions": "Sunwapta warden station is 72km south of Jasper on the Icefields Parkway (Hwy 93), the parking lot is 100m past the station on the other side of Poboktan Creek. If the bridge over the creek next to the parking lot is still out, you'll have to go around on Hwy93 and find the trail between the creek and the warden station. The horses behind the warden station were friendly and fond of the red clover I offered.For the Maligne Lake parking area drive 2km east of Jasper on Hwy 16 and turn right on the Maligne Lake Road. Cross the bridge and follow the Maligne Lake Road for 47km, park at roads end. The trail starts down on the shore of the lake, past the boat docks.",
    "geohash": "c3k",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/1745/reg_MalignePasslookingnorth.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1745/reg_MalignePasstrailheadingnorth.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1745/reg_MalingePass.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1745/reg_map.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1745/reg_waterfall.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1745/20200929085230.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1745/20200930114138.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1745/20200929110749.rotated.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1745/20200929154356.rotated.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1745/20200930150202.rotated.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/maligne-pass-near-jasper-ab-1745",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 4,
        "Time": "24 hrs",
        "Total Distance": "48 km",
        "Town": "Jasper, AB",
        "Type": "out-and-back"
    },
    "title": "Maligne Pass",
    "trail_id": "1745"
}