{
    "description": "NTS Map: 083D16Only 20 minutes from the town of Jasper, Marmot Basin provides 84 named trails\r\n  on over 1,675 acres of terrain supported by world class facilities. The mountain\r\n  offers 3,000 vertical feet of skiing and snowboarding on 100% natural, dry,\r\n  Rocky Mountain powder.\r\nThe ski area's modern lift system carries 11,931 skiers uphill per hour and\r\n  Marmot Basin is one of the least crowded ski areas of its size in all of North\r\n  America. From long, gentle, winding novice runs, to steep, high alpine bowls\r\n  and chutes, skiers and snowboarders of all abilities will find what they are\r\n  looking for at Marmot Basin.\r\nLarge, snow filled bowls are paradise for powder skiers and snowboarders.\r\n  For those who enjoy cruising, our state of the art grooming fleet keeps the\r\n  tree-lined trails groomed to perfection. Those who have already discovered\r\n  Marmot Basin come back for the relaxed and friendly atmosphere, the superb\r\n  variety of terrain, the all around affordability, first class service, and\r\n  the spectacular Rocky Mountain scenery.\r\n9 lifts - One high speed quad, one quad chair, one triple   \r\nchair, three double chairs, one T-bar, one platter, one NEW Magic Carpet.\r\nClick below for Ski Report and Weather Forcast:\r\nMarmot Basin\r\n    Web Site \r\n\r\n\r",
    "directions": "Located only 19 km South of the town of Jasper on Hwy 93 (Icefields Parkway), about 10 minutes to turn-off to 93A. Follow the signs to Marmot Basin. 25 minutes door-to-door.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/1752/reg_1135782074_pod.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1752/reg_map.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1752/reg_marmot.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1752/reg_mtn_view2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1752/reg_snowmaking.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1752/topo_403009.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/marmot-basin-near-jasper-ab-1752",
    "stats": {
        "Activities": "ski-downhill",
        "From": "",
        "Seasons": "spring winter",
        "Stars": 3,
        "Time": "0 hrs",
        "Total Distance": "0 km",
        "Town": "Jasper, AB",
        "Type": "out-and-back"
    },
    "title": "Marmot Basin",
    "trail_id": "1752"
}