{
    "description": "Taylor & Tszil are accessed via the Joffre Lakes trail so please see that trip report for that trail description.\r\n\r\nThe turnoff to Taylor & Tszil is about mid-way along the 3rd lake, just before crossing the bridge over the creek on your way to the campground. Follow the trail along the creek a little ways before entering the edge of the forest. It was quite wet when we did this trip in May but it probably dries up considerably later in the summer. From the turnoff to the col you will climb about 1700ft.\r\n\r\nThe obvious trail ran into a snow field the day we were there so I'm not sure how far it up actually continues. The route is fairly obvious however. Just head up to the col between Taylor & Tszil. Taylor is on your right, Tzil on your left. \r\n\r\nFor Taylor, go around the back and pick up a rough trail which comes and goes along the southeast ridge to the summit. The route is not technically difficult with just some easy scrambling. Elevation gain from the col is about 600ft. \r\n\r\nFor Tszil, decend to the col then simply hike up the steep western slopes. There are a few cairns along the way. Elevation gain from the col is about 800ft.\r\n\r\nTotal elevation gain from the parking lot if you climb both peaks is about 4300ft. Approx 20km.",
    "directions": "To get to the trail-head, when approaching Pemberton from Whistler (from the South), turn right at the T-junction, towards Mount Currie. In town, turn right again towards Duffey Lake and Lillooet, you will travel along a gravel road along the Lillooet River, crossing to the north side river just before Lillooet Lake. The road climbs steeply (paved), follow this and continue a short distance to the BC Parks Joffre Lake parking area.",
    "geohash": "c2by",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/1763/reg_P5280074jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1763/reg_P5280080jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1763/reg_P5280084jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1763/reg_P5280095jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1763/reg_P5280109jpg.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/taylor-tzsil-mtns-near-pemberton-bc-1763",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 4,
        "Time": "7 hrs",
        "Total Distance": "0 km",
        "Town": "Pemberton, BC",
        "Type": "out-and-back"
    },
    "title": "Taylor & Tzsil Mtns.",
    "trail_id": "1763"
}