{
    "description": "NTS Map:92F11.  Gem Lake awards you with fantastic views of Mt. Albert Edward and surrounding peaks.  You are down in the valley looking up.  Also the hike in along the creek is fantastic with lots of beautiful greenery, a rushing creek and old growth moss covered forest.  The snow cover near the end of the hike, depending on the year, can last into June, so be prepared.\r\n \r\nThe trail head of Gem Lake starts on the left on the road, you will see an area to park right in front or off to the side, just don't block the road.  Follow the old overgrown logging road for about 10-15 minutes until you get to Gem Creek.  You will have to cross this creek, so bring some sort of water footwear, the creek at most times is at knee level.  Once you cross the creek, follow the creek upwards along the creek shore line for about 10 minutes (the creek bank may be heavily overgrown depending on the time of year, just persevere), before the trail heads up and into old growth forest.  For the next two hours you will be following the creek, look for flagging and markers on the trees.  The trail at times heads away from the creek and some times close to the creek.  Always follow the west side of the creek, you never cross it (accept at the beginning) and you should always be able to seehear it.  Certain parts of the trail lead to open sections that are heavily overgrown with devils club and other prickleys.  One section is really bad as you climb over rocks by the creek.  After about 1:45 hours you will want to start to look on your right for flagging along a muddy creekstream, follow this to an open clearing with fantastic views.  Keep heading straight and you will reach Gem Lake.  If you continue along the right of Gem Lake you will go around a bend to views of Mt. Albert Edward, Mt. Regan, Jutland Mountain and Mt. Mitchell.  You cannot get lost on this hike as long as you follow the creek. Gem Lake feeds it so as long as you follow it you will come out to Gem Lake. Some hedge clippers would be useful for tackling the overgrown sections if you don't enjoy bushwhacking too much.  On a map the trail elevation is minimal but in reality the trail does a lot of ups and downs so you will use all your leg muscles on this one.  Enjoy!\r",
    "directions": "The logging road to the trail head is in excellent shape (June/05) and all vehicles with clearance can manage, cars will make it if you don't mind taking a risk and a few scrapes.  To get to the trail head go north on Highway 19 (the inland highway) to Campbell River.  About 20 minutes after the Piercy Road turn off to Courtenay, you will be coming to Cranberry Road.  Make a left here, you will be on the logging road and in a few minutes you will be at the guarded gate.  If you have your paperwork complete hand it to the guard and he will write down your vehicle information, if you don't have paper work done, then the hike is over.  Once past the gate you will stay on this logging road for the next 45 minutes (24 Kms).  Keep left at OR 1300 sign and head past 1400 sign.  You will see the trailhead on your left with parking in front of it and across it.  If you miss the trail head you will notice the road getting overgrown (Trail Head waypoint 10323202E 5509664N).",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/1765/reg_IMG_2206_Large_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1765/reg_IMG_2214_Large_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1765/reg_IMG_2225_Large_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1765/reg_IMG_2233_Large_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1765/reg_IMG_2236_Large_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1765/reg_IMG_2249_Large_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1765/narrow_IMG_2227_Large_.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/gem-lake-near-courtenay-bc-1765",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "4 hrs",
        "Total Distance": "8 km",
        "Town": "Courtenay, BC",
        "Type": "out-and-back"
    },
    "title": "Gem Lake",
    "trail_id": "1765"
}