{
    "description": "NTS Map:92F11.  The trail starts up the logging. Once you get to the clearing make a sharp right and you will see a sign painted on a rock marking Alone Mt.  You will also see Alone Mt. in the distance.  The trail is very well marked with blue spray paint and lots of flagging tape, keep your eyes open and you can't get lost.  The trail starts of going downhill for a little while but after that it is all uphill.  Your legs will burn on this one, with lots of elevation gain.  In some spots you will be using all fours to get up.  The summit is a poor looking rock mound, once there go a little further and find a nice spot with a good view.  We hiked up on a fairly cloudy day, but from the glimpses we saw the views look great.  Depending on your fitness level the a round trip hike should take 4.5 to 5 hours.  Doing the hike in the rain would be a great challenge due to the steepness but makes travel on the logging road a lot less dusty.  Enjoy.",
    "directions": "To get to Alone Mountain take Lake Trail Rd. out of Courtenay and make a right on Comox Logging Rd.  Follow this all the way to the Comox Lake dam.  Once you cross the dam it is 13.4 Kms to the Alone Mt. trail head and you will see a sign marking the start of Alone Mt, park so that you are not blocking access to the road.  The road to the trail head is a logging road, but it is not too rough and all cars will be able to make the trip.  Watch out of logging trucks and give them the right off way.  \r\n\r\nBe prepared to be turned back just past the Dam if there is active logging going on.  A guard will be posted by the gate and won't let you go on.  The guard is on duty from 6 or 7am to 5pm.\r",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/1766/reg_DSCF0015-10934.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1766/reg_DSCF0016-10934.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1766/reg_DSCF0017-10934.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1766/reg_DSCF0019-10934.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1766/reg_DSCF0022-10934.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1766/reg_DSCF0023-10934.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1766/reg_alone0380.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1766/reg_alone0382.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1766/reg_alone0387.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1766/reg_alone0396.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/alone-mountain-near-courtenay-bc-1766",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 3,
        "Time": "5 hrs",
        "Total Distance": "6 km",
        "Town": "Courtenay, BC",
        "Type": "out-and-back"
    },
    "title": "Alone Mountain",
    "trail_id": "1766"
}