{
    "description": "Will it be a one day or a two day ride? \r\n\r\n48 km total, starting with 12.5 km on the  Pekans River, then 3.3 km on a small river with 100 feet elevation rise. That will be the toughest part. Then, 5 lakes with 4 sections of river connecting the lakes and one small section of land (200 m) from Pekans River hydrological basin to Carheil River  basin. \r\n\r\nI am prepared for 2 days, but targeting to do it in one day.\r\n\r\nPatrice, fine son, drove me to the bridge over the Pekans River in the morning. Kayak loaded and ready to go at 8:00.\r\n\r\nThe section on the Pekans River was easy and fast: average speed of 7.3 kph for 12.5 km. Wind and current helping.\r\n\r\nPulling up the kayak on the 3.3 km St-Ange discharge was tougher than I thought. Took me almost three hours.  \r\n\r\nWith a north east bound wind, the sections on the St-Ange Lake, Cladonie Lake, Low Ball Lake and Carheil Lake were against the wind. The 11 km on the La Rue Lake was with the wind.\r\n\r\nIt is easy to pull the loaded kayak over the 200 m section of land between the St-Ange Lake et the La Rue Lake.  Flat, a little swampy, with grass. \r\n\r\nI stopped two times for rest:  15 minutes the first time before engaging the La Rue Lake; 30 minutes the second time, before the Cladonie Lake.\r\n\r\nReached Carheil Lake at 19:00 with a remaining 5 km to complete the ride. Again against the wind.  Had to follow the shore line.\r\n\r\nAt 20:00 I could see my pick-up and trailer near the boat ramp.  \r\n\r\nHint:\r\n\r\n-\tNo cellular phone service. I have a satellite phone.\r\n-\tHave map, GPS or compass.  The topography is pretty flat and the lakes have a lot of bays.  You can find yourself doing extra, unworthy km, searching your path.\r\n-\tWalking the rivers is tricky with very slippery rocks. Easy to hurt yourself. Have proper shoes.\r\n-\tTake gloves with you.  The rope for pulling the kayak is tougher on the hands than paddling.\r\n\r\nComments:\r\n\r\n1)\tNext time, I will do it in two days.\r\n2)\tNot bad for a 50 year old guy who discovered sea kayaking 2 years ago.\r",
    "directions": "\r\nThe bridge on the Pekans River is at KM 531 on the  Road  389 from Baie-Comeau to Fermont;  37 km before reaching Fermont.\r\n\r\nAsk to local people for the exact location of the unloading boat ramp on the Carheil Lake or see GPS trail data attached.\r",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/QC/1772/reg_arrivalcarheillake.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/1772/reg_l_balltocarheil.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/1772/reg_lakedischarge.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/1772/reg_lowballlake.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/1772/reg_pullingthekayak2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/1772/topo_sandbeachonlowball.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/pekans-river-to-carheil-lake-near-fermont-pq-1772",
    "stats": {
        "Activities": "sea-kayak",
        "From": "",
        "Seasons": "summer",
        "Stars": 3,
        "Time": "14 hrs",
        "Total Distance": "48 km",
        "Town": "Fermont, PQ",
        "Type": "out-and-back"
    },
    "title": "Pekans River to Carheil  Lake",
    "trail_id": "1772"
}