{
    "description": "Par un beau dimanche après-midi, le sentier Les Florents vous fait découvrir la diversité de Charlevoix. Le sentier est partagé par les parapentistes et les randonneurs et comme il est relativement nouveau (2003) il a gardé son aspect sauvage. Tout nouveau cette année, une nouvelle portion d'environ 5 km s'est ajoutée au 8,4 km existants. Il est donc possible de randonner cette distance ou 14 km aller seulement.\r\n\r\nAprès une montée de 25 minutes partant du stationnement derrière le Migneron, on aperçoit le fleuve et le Massif. Au tiers du sentier, après avoir croisé des arbres centenaires, il est possible de se reposer ou luncher dans une tour d'observation permettant de voir un bout des Grands-Jardins. Quelques centaines de mètres plus loin il est possible de prendre l'embrachement vers le resto Chez Laurent pour compléter les 8,4 km ou tourner à gauche et parcourir 14 km au total jusqu'au village de St-Urbain. Le reste du sentier se fait sur les crêtes des monts Florents et nos pieds foulent une tourbière. La dernière partie du sentier descend doucement le long d'un ruisseau et croise un champs pittoresque.\r",
    "directions": "Le sentier peut commencer à partir du Migneron, du resto-motel Chez Laurent sur la 138 ou de la station service Olco de St-Urbain sur la 381. De Québec prendre la 40 Est jusqu'à Baie St-Paul, à la fromagerie le Migneron dans la cours arrière il y a le départ des sentiers et le stationnement.",
    "geohash": "f2my",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/QC/1799/reg_lesFlorents023JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/1799/reg_lesFlorents030JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/1799/reg_lesFlorents036JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/1799/reg_lesFlorents042JPG.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/les-florents-near-la-malbaie-pq-1799",
    "stats": {
        "Activities": "snowshoe hike ski-xc",
        "From": "",
        "Seasons": "winter fall summer",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "14 km",
        "Town": "La Malbaie, PQ",
        "Type": "out-and-back"
    },
    "title": "Les Florents",
    "trail_id": "1799"
}