{
    "description": "Take the trail for awhile until you come to a opening where the power towers are. Continue on the trail veering to the left and follow the towers for a bit. The trail will come to a fork - take the left and head back into the side of the woods you came from. Following this trail you will come to a roofed in stack of logs. It would be best to take a right into the woods now towards the roar of the falls as going straight on the trail will take you to an abandoned cabin 100 ft away. Once at the edge of the river you can follow it down passing in front of the cabin. You will soon see the falls. This part will be the most difficult part of your trip because the sheer cliffs down to the bottom of the falls are relatively close to you on your right.If you go down to the bottom of the large falls you can make your way down river to see two more sets of smaller falls.The large falls are at: N 45° 26.876 W 066° 20.764",
    "directions": "Goto Welsford on the #7 from Saint John.  When in arriving in Welsford on the #7 take the 101 North. You will cross a bridge and quickly come up to Sullivan Rd. on your left. Take Sullivan Rd. to the end and park on the edge of the paved turnabout. The trail continues on where the road ends.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NB/1801/reg_20090101-03-42914.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/1801/reg_20090101-19-42914.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/1801/reg_Welsfordfalls1JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/1801/reg_welsfordfallsiconsjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/1801/topo_welsfordfallsmapgif.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/1801/narrow_IMG-0091-29620.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/1801/narrow_Welsfordfalls2JPG.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/welsford-falls-near-saint-john-nb-1801",
    "stats": {
        "Activities": "hike mtn-bike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "2 km",
        "Town": "Saint John, NB",
        "Type": "out-and-back"
    },
    "title": "Welsford Falls",
    "trail_id": "1801"
}