{
    "description": "The path is well worn (26 years exactly) by rock climbers.  It crosses a brook before entering the buffer zone of Camp Gagetown.  You should eventually reach a first aid/check in center where the trail will divide into two directions.  There is a nice hike to the right that runs about a kilometre and gives you access to many of the rockclimbing spots.  If you continue on the path straight ahead you'll come up to your bouldering adventure. It's probably a good idea to mark a waypoint at the first aid centre because it's hard to find familiar site markers on your way back down (most boulders look a lot alike :->) \nThis is not a trip to take a young family or seniors on. It's a good climb and you need to be someone who's not afraid of heights and sure on your feet. This isn't rock climbing so you don't need any equipment. \nGollums Cave, the destination I've chosen for this hike, is nothing spectacular when it comes to caves but it is a neat feature and it puts you at the base of the cliffs.  Gollum's Cave is located at  N 45° 26.4918 W 066° 17.8500",
    "directions": "NOTE: THIS DESTINATION IS WITHIN CAMP GAGETOWN MILITARY BASE.  You will need to call Camp Petersville at 1-506-422-2000, local 4690.  Tell the commissionaire there you are going \"Rockclimbing\" in area 40.  You may need to give your name, licence plate number and number in your party.  You may wish to ask him if you need to still call it in to Range Control or if telling him is ok.  If so call into Range Control directly at local 3121.  Again say you are going \"rock climbing\" in area 40.  If you say you are going \"hiking\" then it counts as a different classification and they will then want you to go to Blue Mountain in Brown's Flat to get a day pass - this is because \"hiking\" sounds like you will be wondering around in the woods by yourself and they want to know whether they will need to send out a search party.  These rules are new so you may end up contacting someone who's still out of the loop. NOTE: THIS DESTINATION IS WITHIN CAMP GAGETOWN MILITARY BASE.  You will need to call Camp Petersville at 1-506-422-2000, local 4690.  Tell the commissionaire there you are going \"Rockclimbing\" in area 40.  You may need to give your name, licence plate number and number in your party.  You may wish to ask him if you need to still call it in to Range Control or if telling him is ok.  If so call into Range Control directly at local 3121.  Again say you are going \"rock climbing\" in area 40.  If you say you are going \"hiking\" then it counts as a different classification and they will then want you to go to Blue Mountain in Brown's Flat to get a day pass - this is because \"hiking\" sounds like you will be wondering around in the woods by yourself and they want to know whether they will need to send out a search party.  These rules are new so you may end up contacting someone who's still out of the loop. \nWhen you arrive in Welsford on the #7 take Cochrane Lane. Follow this to the end where it turns into a gravel road. Park on the left (probably where you'll find a number of rock climbers already parked) before the \"do not park beyond this point signs\". The farmer who lives at the end of the road (who's property you'll be traveling on) has been very kind in allowing hikers to pass through his field to get to the cliffs so please leave the area the way you found it - nice and clean. \nCrawl under the fence near the posted signs and travel along the lip of the gravel pit then up through the field keeping the woods immediately on your left. You should be able to make out a worn footpath in the field to follow. When at the top of the field you'll find a trail to follow up into the woods.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NB/1802/borderwall.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/1802/long_submittedby.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/1802/reg_Gollumscave3JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/1802/reg_IMG-0086-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/1802/reg_boulderwalk-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/1802/narrow_Gollumscave1JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/1802/narrow_Gollumscave2JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/1802/narrow_IMG-0034-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/1802/narrow_borderwall-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/1802/narrow_downhome-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/1802/narrow_gollum2-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/1802/narrow_gollum3-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/1802/narrow_gollumscave-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/1802/narrow_mike-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/1802/narrow_sign-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/1802/narrow_waterfall-wall-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/1802/narrow_welsford-6702.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/welsford-cliffs-near-saint-john-nb-1802",
    "stats": {
        "Activities": "climb hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "2 km",
        "Town": "Saint John, NB",
        "Type": "out-and-back"
    },
    "title": "Welsford Cliffs",
    "trail_id": "1802"
}