{
    "description": "Sentry Mountain Hike Log, July 2nd, 2005 (Done as part of the 2005 Alberta Centennial Mountain Expedition).The Route:From the gravel pit, follow the dirt road and bear right around the first quarry. To access the ridge, continue along the gravel road that parallels Crowsnest Creek and follow it up the switchbacks. At the first switchback, we found a game trail heading through the forest towards the ridge. We chose to follow the game trail, rather than continuing up the road to the next quarry. There are game trails at the upper quarry as well, but some bushwhacking is required to find them, as I discovered on the way down. Going up through the forest, it took about an hour and a half to get above the tree line at a brisk pace. Above the tree line it was a moderate scramble with some difficult areas near the summit. The route is obvious and the ridge narrows towards the top with some exposure. The ridge has a couple of mounds that one can unsuspectingly ascend, only to discover a steep drop of 10 to 20 feet, requiring one to climb down carefully, or alternatively backtrack and traverse around the obstacle. With a bit of route-finding, most difficult sections were avoided, except for one pitch near the top. There were interesting views of Crowsnest and Tecumseh to the North; Chinook Peak to the South; as well as the giant pile of yellow sulfur at the industrial plant below.Inclement Weather!This was less of a hike than a G.I. Joe commando assault on  Sentry Mountain. It was our second consecutive Saturday attempt, our last try being rained out. The weather forecast called for showers at noon, and starting out under sunny skies at 9:30, we felt pretty confident that we could be at the peak before the precipitation would arrive. So it was that we started our hike with one common goal in mind: get to the summit quickly, weather-be-damned!Most of our group made it to the peak in less than 3 hours. At the summit it was obvious that stormy weather was on its way (see photos) but others in our group were lagging behind, so we ate our lunches and used the rock cairn at the top as a windbreak. It was strange to be under a patch of sunshine, as rain clouds were passing by the mountains on either side of us. We could feel the moisture in the air and it was obvious we were going to get wet, so we waited and speculated amongst ourselves as to how much time we had before the rain caught up to us. Finally, the last of member of our hiking party arrived, bearing with him the Alberta Centennial canister. We secured it to the rock cairn without any fanfare, merely signing our names in the new logbook and retrieving the old logbook to send to the Crowsnest Pass Museum. Incidentally, the first entry in the old Sentry log was made in 1991 by none other than Alan Kane, author of Â?Scrambles in the Canadian Rockies' - an excellent reference for this hike, by the way! The old logbook was quite deteriorated due to past soakings and some of the pages were illegible, although there were many humorous entries that were there for us to chuckle at.As we quickly placed rocks around the Alberta Centennial canister, we started to feel a few drops of rain.  To the west there were many ominous dark grey clouds so we immediately began our descent. After 20 minutes or so we saw a bolt of lightening to the west and tried our best to descend below the exposed part of the mountain before the storm arrived. We got good and soaked and received a good scare by being up so high in the mountains in the middle of an electricity storm. Never a good idea!- Trevor Helwig.  July 2nd, 2005P.S. To echo a sentiment noted several times in the old logbook, \"Thank you Alan Kane!\".Level of Difficulty: An easy hike for the first half, followed by a couple kilometers of moderate scrambling with a single pitch of class 4 near the summit.Disclaimer: This is a scramble. Be aware that scrambling can injure or kill you. Be prepared, know your limits and make sure somebody knows where you're going. Elevation at summit: ~2410 m (7,900 ft)NTS Map: 082G10Elevation Gain: 1,025 m (3,362 ft).A selection of entries from the old Logbook:Sept. 15th 1991.SENTRY MOUNTAINElevation 7,900' approx.Register left by Alan Kane [something illegible] ACCSept. 15, 1991Ascent via West ridge from open pit mine from Crowsnest Creek Road.2 hours to summit; a nice scramble. Numerous cumulus clouds but good temperature for peak-bagging. Typical fall weather. Two others descending as I neared top, the only wildlife on the route.[Someone wrote \"Thanks Alan\" on top of page.]Brian Chamberlain and Jean Walters, Feb. 25th 1992.Alberta Forest Service, Blairmore.Asecent via West Ridge from open pit. 3 hours 40 min. Lots of snow!Larry A. Farmer, Ft. Steele, B.C., March 8th 1992Took the wiener route up big scree slope on S.E. Saw 7 sheep. Wx gorgeous few scat cumulus.             June 23/1992, Jim Mamalis.Ranger Beauvais Lake Prov. Park.Ascent up North Ridge from Crowsnest Lake. 4-5 hours. A challenging solo scramble. Searing hot day moderated by ferocious winds. This mountain is a powerful place!July 19 1993 Jim Mamalis - Beauvais Lake2nd ascent in 2 years for me. This time via W. ridge and back the same way. Much more aesthetic than North ridge. Weather gorgeous and warm, no wind. Scattered cumulus clouds. Nice hike (2.5 hours). P.S. Steve is a geek.Sept. 6th, 1993. Becky Cousins, Lethbridge. Greg Hooge, Nobleford. Via NW ridge, 2 hrs up. Clear and calm???June 11, 1994.Wolf (W. Liu) - Edmonton. Crowsnest Lake Bible Camp.Psalm 95:3-5 For the Lord is the Great GodÂ? In his hands are the depths of the Earth and the mountain peaks belong to him. The sea is his, for he made it, and his hands formed the dry land. Sept. 25th 1994 Group of 4 ascended from open pit mine up west ridge. Took 3 hrs. Had a blast climbing. On to Crowsnest Mountain. Beautiful day, 30 C. Wilco Tymensen.August 14, 1994. Meghan Chalmers 11 years old. Neil Chalmers. Too Old.Beautiful day. Best views in town.I smelt sulfur! I saw sulfur! I [editor's note: expletive depletive] sulfur! I'm sulfur! 25/9/94 Patrice Audy. The Plane Boss The Plane!!! Blue skies and that beautiful wind (not!) 25/9/94 John Hachey25/9/94 Lisa Kalischuk-Tymensen was here.July 14, 1996Another \"Kill Yourself in the Canadian Rockies Scramble\" by Alan Kane. Yes, I'm feeling a wee bit bitter. Not my definition of a \"moderate\" scramble. Lots of unexpected exposure. [page ripped]. (Dave C. wouldn't likeÂ?] Derrick's knee discovered more than once that yes, rock is harder than flesh and bone. The weather is glorious! Light breeze and plenty of sun. Sure wish I knew how to do \"astral travel\" - it would make the descent so easyÂ? Yes, a worthwhile Sunday hike. And succulent red strawberries to enjoy on top (we carried them). Enjoy! Tracey Bolseng, J Lethbridge AB.Sept. 11, 1999. ACC Club Trip. Jerry Pilny. [Page mostly illegible.]Oct. 23, 1999 2:30 PM Jer, Dan, Esther.Just got down from no-name ridge and walked up here. Beautiful sunny day (shorts and a tank top) but the wind is DANG COLD up here. Gonna scree all the way to Emerald. This climb oes out to Matty and Carissa Halton BECAUSE they're getting hitched today at 5:00! I guess we should go to the wedding nowÂ? Peace out home skillet. - Jeremy (Kelowna B.C., well Calgary nowÂ? ) Allan. I'm traumatized. Jer is a ___. Wait a minute! I'm so excited! Finally I have conquered this mountain- it's only taken 8 years! What a day. Nothing like a sunny October day. - Esther.Sometimes I lie down for [clearing?] time and then stand up real fast and get dizzy and fall over! Dan.Friday Sept. 15, 2000.Frederic Labarre, Montreal, Quebec.Up in 3h30 m, but 30 min. to cross creek and 30 min lost because I headed on the ridge to the SW. Thank you Alan Kane for your great guide book. Sunny and [page ripped].July 15th, 2001. Sulphur looks like a big yellow tasty lemon cake. Think I'll go down and get me a slice. S.K.Sunny calm nice burn. Great Scramble. Praise be to Allah for the strength to levitate up here. The Great Allah today showed the late Sir Fig Newton who's boss! Glad he invented gravity though! Nirrieggah A. Hoffman and Talahassi.July 16, 2002. Caroline Munnings.God is the creator of all this beauty. He deserves the Glory. Love you God!August 21, 2002. Mike Haponik Edmonton. 1 h 30 min via North ridge.29 May, 2004. Sonny Bou http://www.ucalgary.ca/~ssbou",
    "directions": "Turn off Highway 3 at the access road for the gravel pit just past Crowsnest Lake (see map). Park away from the barricade so you don't block traffic. An alternate approach is to drive to the next turnoff and park 1.5 kms up the road, which parallels Crowsnest Creek. This would save time and avoid the first quarry but requires a creek crossing. The water level was quite high due to recent rains so we decided to hike from the gravel pit, which was not in operation.There are other routes to ascend Mt. Sentry, although the western approach that we followed was the most obvious. Others in our party had ascended from the northeast ridge 3 weeks previously. They started at Crowsnest Lake but had descended by the route that we took today. The northeastern approach is a more difficult scramble and passes close to a number of caves, which are unfortunately not easily accessible. Proper climbing equipment would likely be needed to get to the caves.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/1818/long_P8160124-001-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1818/long_Sentry-Mountain-Crowsnest-Pass-Incredible-scramble-Exposed-Ridge-Aug-16-2015-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1818/long_Sentry-Mountain-Crowsnest-Pass-Summit-in-the-rain-sun-Aug-16-2015-2--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1818/long_Sentry-Mountain-Crowsnest-Pass-Summit-in-the-rain-sun-Aug-16-2015-4--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1818/long_Sentry-Mountain-Crowsnest-Pass-Summit-in-the-rain-sun-Aug-16-2015-6--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1818/reg_1818.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1818/reg_2aMtTecumsehandCrowsnestJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1818/reg_4aridgewalknearthetopJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1818/reg_6asummitJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1818/reg_7acdescentJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1818/reg_best1_FalseSummit.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1818/topo_mapjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1818/narrow_5ablaineJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1818/narrow_Sentry-Mountain-Crowsnest-Pass-Incredible-scramble-Exposed-Ridge-Aug-16-2015-1--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1818/narrow_Sentry-Mountain-Crowsnest-Pass-Incredible-scramble-Exposed-Ridge-Aug-16-2015-3--44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/sentry-mountain-near-blairmore-ab-1818",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "6 hrs",
        "Total Distance": "10 km",
        "Town": "Blairmore, AB",
        "Type": "out-and-back"
    },
    "title": "Sentry Mountain",
    "trail_id": "1818"
}