{
    "description": "I did this route a couple of years ago and managed to get to the summit with my friend and his dog, Oscar, even though his poor paws were chewed up pretty badly from the scree (and there's lots of scree on this scramble). With a bit of route finding, most difficult scrambling can be avoided. For the first part of the hike you follow the creekbed (so make sure that the creek is dried up - do this hike in mid to late summer - wait at least until July). From the top of the creekbed there's a pretty steep scree grunt-of-a-slope, with mid-sized rocks that can be ascended. At the top of the scree, you are not far off from the summit. Either scramble to the top of Philip's Peak and follow the ridge to the summit, or bypass Philip's peak by traversing around the scrambly section to get to the ridge. At the summit there are nice views of Crowsnest, the 7 sisters and accross to Mt. Sentry and Chinook Mt.On the way down I almost had a bad mishap down a snowy avalanche chute... (I thought it would save some time by sliding on the snow, then next thing I was completely out of control and thinking, \"Man is it gonna hurt when I hit those rocks on the bottom.\" And it did! But luckily, nothing was broken except for my can of Alberta Genuine Draft.NTS Map: 082G10Elevation Gain: 1,175 m (3,855 ft).- T. Helwig",
    "directions": "For a good reference on access, see Alan Kane's book, \"Scrambles in the Rockies\" (we got lost searching for the trailhead). That said, here are my directions: access the dirt road that leads behind Phillips Pass from Crowsnest Provincial Park in B.C. Follow this road to the dried up creek that leads up Mount Tecumseh.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/1823/reg_7sistersjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1823/reg_mttemcusehjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1823/reg_ridgewalkWMtTemcumsehjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1823/reg_viewfrommttemcumsehsmljpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1823/topo_mapoftecumsehjpg.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mount-tecumseh-near-blairmore-ab-1823",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 4,
        "Time": "7 hrs",
        "Total Distance": "10 km",
        "Town": "Blairmore, AB",
        "Type": "out-and-back"
    },
    "title": "Mount Tecumseh",
    "trail_id": "1823"
}