{
    "description": "The trail begins and ends at the Mt. Shark trailhead in Kananaskis County, Alberta. It travels through two parks, two provinces and beholds the beauty of the sixth highest mountain in the Canadian Rockies, Mt Assiniboine. All users of this trail must be well prepared for a mountain wilderness trip. For those camping in Mt. Assiniboine Provincial Park there is a tenting fee of $5.00 per person per night. Cabins are also available in the park for $15.00 per person per night. Campsites and cabins are available on a \"first come, first served\" basis. Park Rangers patrol campgrounds and cabins and collect fees directly from visitors. Contact the Banff Information Centre at (403) 762-1550 for full details on this trail. In winter please check the local avalanche conditions and bulletins.Map Ref: 082J14Elevation Gain: 622 m (2,040 ft).GPS track is from Sunshine to Mount Assiniboine to Mount Shark.Mount Shark trailhead: N50 50.848 W115 21.535Sunshine trailhead: N51 06.751 W115 46.408 then bus to the trailhead.",
    "directions": "Banff National Park, Kananaskis Country, and Mt. Assiniboine Provincial Park (B.C.): The Mount Shark trailhead is on the Smith-Dorrien Road in the Spray Valley south of Canmore.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/1832/reg_1jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1832/reg_P1110157-18265.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1832/narrow_2jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1832/narrow_3jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1832/narrow_P1110171-18265.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/assiniboine-loop-near-banff-ab-1832",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "28 hrs",
        "Total Distance": "55 km",
        "Town": "Banff, AB",
        "Type": "out-and-back"
    },
    "title": "Assiniboine Loop",
    "trail_id": "1832"
}