{
    "description": "98 km one way.This trail follows the the Whirlpool River Valley, the traditional route of early fur traders crossing the Rocky Mountains. Large gravel flats and glaciers dominate the scenery in some sections. All major crossings are bridged as you climb toward Athabasca Pass National Historic Site. There is some horse traffic on this trail. Consult the Jasper trails office at (780) 852-6177 and a proper topographic map prior to your departure. Guide books are also recommended in the trail contacts section. NTS Map: 083D08Elevation Gain: 560 m (1,837 ft).Photos by 'mtncat'\"In January 1811, David Thompson, guided by Thomas the Iroquois was the first white man to cross the Rockies through this pass. Thence he led his party down the Wood River to the place on the Columbia River later called Boat Encampment. Governor George Simpson subsequently named the small lake at the top of the pass \"the Committee's Punch Bowl\" - a reference to the London Committee of the Hudson Bay Company. For almost half a century, the Athabasca Pass was part of the main fur trade route between Canada and the Oregon country.\" These word are inscribed on the National Historic Site of Canada http://www.pc.gc.ca/progs/lhn nhs/index_E.asp plaque at the summit of Athabasca Pass in Jasper National Park www.pc.gc.ca/jasper. Athabasca Pass may have seen more visitors during the fur trade than it does today, so if you're looking for a quiet escape or a chance to experience the mother of all fur trade portages, give this trail a try. The trail never breaks treeline and has a number of unbridged creek crossings,  it sees infrequent maintenance and is faint in places. Hardy historically minded hikers with some basic route finding skills will love this trail. From the parking lot the journey begins on an old fire road. At 300 m you'll pass the junction down to Moab Lake on your right. Over much of the first five kilometres the road passes through burnt forest ignited by a lightning strike back in 2000. At 6 km the first of six campgrounds is reached. This hikers only campground is called Whirlpool Camp, and it is a fantastic destination in own right. Each campground along this trail has a firebox and two logs, one suspended high in the trees to throw your food rope over and another low down for 'you-know-what'. There are no tables or flattened tent pads on this trail.Three kilometres beyond Whirlpool Camp and 100 metres from the end of the fire road, the trail branches right off the road. Up to this point you can use your mountain bike, but no further. (By the way, while there are some amazing views to be had on this trail there is also a lot of forest walking.) After several creek crossings the trail enters Tie Campground at 11 km, another camp just for hikers. From the campground the trail drops briefly to the willow flats along the Whirlpool River, or 'Riviere des trous' as the voyageurs knew it. (An area prone to flooding early in the season.) Climbing up the river bank you?ll be rewarded with a view of things to come before plunging back into the forest. At 15 km you'll pull into Tie Camp - no, you're not walking in circles, this is the historic 'Tie Camp' run by the Otto Brothers back in the 1910's. As the name suggests, this was a camp was set up to cut railway ties. Scattered about the forest are the remains of at least six old cabins, wooden boats and associated junk. Please keep in mind that even old 'junk' like tin cans are considered a cultural resource in a national park and everything at the site is protected by law. After crossing Simon Creek on a good bridge at 15 kilometres you arrive at Simon Creek campground, the first of the hiker / horse campgrounds on the trail. Horse parties are able to carry in extra 'luxuries' and someone has spent some time upgrading this campground with a chainsaw. In particular 'the log' out back is the most comfortable on the trail.Before reaching the Middle Whirlpool River the trail splits giving hikers two choices to reach the Middleforks Warden Cabin. The trail that follows the riverbank is the horse trail, it has many wet spots but provides an optional scenic route for hikers late in the season. The trail leading back in to the forest is the hikers trail, on which, about 100 metres before reaching the Middle Whirlpool River at 20 km, you may notice a spur trail angling sharply back to your right. This short side trip leads to a minor viewpoint. The hiker bridge over the Middle Whirlpool River was washed out when I went through in 2007. While not an issue by late-summer, the lack of a bridge would have been major problem if the river was in flood. Across the river the trail swings downstream and enters the meadow behind the warden cabin. In front of the cabin the very obvious horse trail rejoins the hiker trail, after crossing a dry creek bed they strike off together for the Middleforks hiker/horse campground. This junction can be confusing, as the horse trail seems to be the obvious choice for hikers continuing to the pass. Be sure to follow the trail marked by the large yellow 'hiker with an umbrella' sign. After a short jaunt through a dark forest, Middle Forks Hiker/Horse Campground is reached at 21 km. Compared to the 'improvements' at Simon Creek, Middle Forks is a fairly simple campground tucked into the trees on the edge of a large soggy meadow, across which the trail continues. Forty feet into the forest on the other side of the meadow and eight feet off to the right there is on old blaze with \"Francis 1913\" carved in it. I can find no record of who Francis might've been. Do you know? At about 25 kilometres a small cataract next to the trail is worth a closer look but keep your pack on as an unassuming ridge another kilometre up the trail offers the perfect excuse for a break. Cresting that ridge the expansive Scott Gravel Flats will open in front of you - at five kilometres in length the longest section of open terrain on the trail. To the fur traders this gravel flat was known as 'la Grande batture'. To avoid the Whirlpool's many braided channels, the hikers trail skips in and out of the forest for the first kilometre along the flats. When it finally does venture out on the flats the trail disappears altogether and hikers are advised to follow yellow makers on posts and trees, fording several side channels to where a well packed trail rematerialises in the middle of the flats. Horse parties should use caution when crossing the Scott Gravel Flats as some river channels are surprisingly deep. Scott Camp is a delightfully simple hikers campground which sits next to the Whirlpool River on the far end of the Scott Gravel Flats at 31 km. Hikers are advised to spend at least one night here as the side trip to Scott Glacier should not be missed. Between the firebox and the river there are three trails climbing into the forest. The first trail closest to the fire box, leads to the privy. The second trail is the main trail to Athabasca Pass. The third trail is right next to the river and leads to Scott Glacier.Scott Glacier Trail: 100 metres up the trail to Scott Glacier you'll find a bridge over a beautifully sculpted canyon. Once across the bridge the trail drops down to the Scott Gravel Flats and vanishes. You'll find snippets of trail along the way but except for a whiteout situation the 6 km return trip to Scott Glacier is over open terrain and very obvious. Back on the main trail, after a quick climb from the flats, the trail meanders through the forest popping out on the river bank from time to time. On this section of trail you'll pass a twisted little tree, a beautiful waterfall, a hanging glacier pouring off the Kane Icefield, and assuming you stay on the hikers trail along the north bank of the river, the mother of all Twining raspberry patches. At 39 km you'll cross a good bridge to the south bank of the Whirlpool two kilometres before reaching Kane Creek. The trail will fizzle out as it crosses the Kane Gravel wash so keep an eye out for the trail markers that will lead you to the Kane Creek ford. Use caution when crossing Kane Creek, the current is deceptively strong causing the river rock to roll downstream. This ford alone is reason enough to hike this trail later in the summer once water levels have dropped. This close to the Kane Icefield, one hot day is it'll take to raise water levels substantially. Extra precaution should be used when fording Kane Creek with children or the slight of build. One hundred metres beyond the crossing is Kane Meadows hiker/horse campground at 41 kms. Unless you've arranged for a helicopter or boat to pick you up along the Wood River or Kinbasket Lake, the rest of your journey to the pass will be unencumbered by a heavy pack. The 16 km dayhike to the pass is wet at the best of times. So lush and loaded with blueberries is this section that a bear encounter is a distinct possibility during the summer months. The trail to the pass is a bit over grown in places and faint in others so pay attention and remember to look back from time to time in preparation for the return trip. Due to the ruggedness of the terrain, it is also recommended that horse parties leave their beasties at Kane Meadows and proceed on foot. Nearing the summit of the pass the forest opens up revealing the surrounding peaks but wildflower displays compete for your attention. There are three small lakes straddling the pass but only the middle lake sits on the divide, and flows to both the Arctic and Pacific Oceans. When David Thompson crossed this pass in 1811 he was a partner in the Northwest Company and strictly against the use of alcohol. It is said that David started the tradition of drinking a toast at the summit of the pass, but it was a toast of water. By 1824, after the great fur trading merger, Hudson Bay Company governor George Simpson crossed the pass and named the lake 'the Committee's Punch Bowl' in honour of the London Committee of the Company of Adventurers of England Trading into the Hudson's Bay. Simpson one-upped Thompson and changed the toast to one of rum. At the summit of the pass there are two markers. The first is the National Historic Site plaque mentioned in the opening paragraph of this trail description. The second is a provincial boundary cairn erected by British Columbia Boundary Commission in the charge of Arthur Oliver Wheeler. Due in part to their surveying and mapmaking abilities both A.O. Wheeler and David Thompson have been commemorated as Canadians of national historical significance by the Historic Sites Monument Board of Canada http://www.pc.gc.ca/clmhc hsmbc/index_E.asp with plaques located Jasper National Park. Thompson's plaque is in a pull-off 3 km north of Athabasca Falls on the Icefields Parkway, while Wheeler's is at the Columbia Icefield Centre. If you make it to the summit of Athabasca Pass be sure to sign the log book in the orange case next to the plaque. The log is being kept during the rolling David Thompson bicentennial celebrations. Www.davidthompson200.org For adventurous parties crossing Athabasca Pass to the Wood River I can not speak from experience but I can offer the following which comes from a BC forestry officer. (2002) \"The original tread of the trail was relocated in the early 1980's and has seen several work parties since then. From Athabasca Pass, the trail loses elevation gradually in a wet, boggy Engelmann spruce, subalpine fir forest with numerous small creek crossings. It is hard to keep your feet dry in this section. The trail is evident and creek crossings have small orange triangles nailed to trees. About 1/2 way down Pacific Creek, the trail goes up and over a small height of land (dry) and descends down Jeffrey Creek. This section of the trail (\"la Grande cote\" in the fur trading era) descends steeply to about 1.5 km upstream from the confluence of Jeffrey Creek and the Wood River, where it then follows a bench to the confluence. The section down Jeffrey Creek is attractive, it is an old growth forest and on one tree is a Canadian Pacific Railway survey blaze from the 1870's. The trail ends at the confluence of Jeffrey Creek, which is very remote. \t\"From here down to the Columbia River, the trail is on the gravel flats of the Wood River. (there was never a defined trail) There are logging roads downstream on the Wood River, but they don't connect to anywhere as a private a barge is needed to cross the Kinbasket Reservoir. Alternatives are; hike back the way one came, arrange a helicopter pickup (which is expensive) or bushwhack down the Wood River until roads are met, then walk down the roads to the reservoir and have a pre arranged boat pickup. If you walk down the Wood River, do it in lower water (e.g. late August /September). Total length from Athabasca Pass to Jeffrey Creek is 13.8 km and another 14 km to where a boat can pick you up. Thompson's Boat Encampment now sits deep below the surface of the Kinbasket Reservoir\".There are number of NTS 1:50,000 maps required for this trip (83 D/9 Amethyst Lakes, 83 C/12 Athabasca Falls, 83 D/8 Athabasca Pass and 83 D/1 if you're hiking out to Kinbasket Lake), or you can opt for less detail and get Gemtreks 1:100,000 'Jasper and Maligne Lake' for the whole trail on one sheet, all of which are available from the Friends of Jasper www.friendsofjasper.com. Jasper National Park posts a weekly trail report during the hiking season http://www.pc.gc.ca/apps/tcond/cond_e.asp?oPark=100244.Submitted by 'mtncat'.",
    "directions": "The Athabasca Pass trail starts at the Moab Lake in parking lot Jasper National Park, 26 km south of the town of Jasper. Drive 7km south on the Icefields Parkway (Hwy 93), turn right after the park gate and follow Hwy 93A for 12km turning right on the Moab Lake Road before the Whirlpool River bridge.(This turn sneaks up on you) Follow the Moab Lake Road for 7 km and park at its end. There is a garbage can and privy in the parking lot, the last toilet seat you?ll see in a while.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/1833/reg_Lake-on-Alberta-side-of-the-pass-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1833/reg_Mt-Edith-Cavell-snowcapped-and-outliers-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1833/reg_Remains-of-boat-at-Tie-Camp-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1833/reg_Tie-Camp-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1833/reg_at-53538.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1833/reg_athabasca-pass-143-30706.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/athabasca-pass-near-jasper-ab-1833",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 4,
        "Time": "56 hrs",
        "Total Distance": "98 km",
        "Town": "Jasper, AB",
        "Type": "out-and-back"
    },
    "title": "Athabasca Pass",
    "trail_id": "1833"
}