{
    "description": "NTS Map:92F11.  Mt. Drabble (1357 Meters) provides excellent views of the Comox glacier and the coast mountains across the Georgia Straight. Hike time to the top is approximately 5 hours return and the distance is approximately 16 kilometers return. The beginning of the hike is up the old ski hill and it will get you panting in no time. From there on you follow an old 4x4 track gently heading upwards. \r\nThroughout the hike look for flagging and stay on the main trail. Once you get to the parking lot, you will notice a burnt out building and the trail starts to the right of it. From the burnt out building head up the old ski hill. In about 10 minutes you will pass under the chair lift. In another 10 minutes you will head under the chair lift again, head straight ahead. You are no longer going up a ski run anymore. After 10 minutes you reach a large T-junction, head right, your grunt up hill is now more relaxed. After 5 minutes you will come to an old T-bar lift, head under the T-bar on the path.\r\n In a few minutes you will come to a Strathcona Provincial Park boundary sign, head to the right. After 10 minutes you will come to a tree with 2 pieces of wood nailed to it, keep right. In 15 minutes you will come to a directional tree, go straight at this point, don't go left to Mt. Becher.  You will begin to lose elevation, enjoy the old growth forest for this part.  In about 20 minutes you will need to cross a stream, if the water level is deep use the 2 nearby fallen trees for assistance.  You will notice the trail to your left heading upwards.  In about 30 minutes you will come to a sign marking the Mt. Drabble turn off, make a right here.  In about an hour you will be on top of Mt. Drabble.  \r\nFrom this point onwards follow the flagging tape and cairns.  The trail is well flagged so just look around.  You will come some areas that will require a bit of scrambling but nothing major.  Once you get to what looks like the top of Mt. Drabble (the peak is a very large area) and if you have trouble following the cairns just head towards Mt. Washington.  The actual top of Mt. Drabble is a built up rock cairn with a Mt. Drabble sign on it.  Have your lunch here and enjoy the great views.  The hike up is roughly 3 hours and 2 hours back.",
    "directions": "From highway 19 head north to Courtenay, at the second exit make a right, Piercy Rd. Make a right at the first road it will be Forbidden Plateau Road (it might be called Piercy Rd on some old maps). Follow this road all the way to the top. The gravel road can be quite rough in parts, with some washboard areas. The road is passable by all vehicles.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/1852/reg_MtDrabbleSept4006jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1852/reg_MtDrabbleSept4015jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1852/reg_MtDrabbleSept4024jpg.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mt-drabble-near-courtenay-bc-1852",
    "stats": {
        "Activities": "snowshoe hike ski-bc",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "5 hrs",
        "Total Distance": "16 km",
        "Town": "Courtenay, BC",
        "Type": "out-and-back"
    },
    "title": "Mt. Drabble",
    "trail_id": "1852"
}