{
    "description": "Le Mont Ste-Anne est bien connu pour le ski, le vélo de montagne mais il y a quelques sentiers pédestres dont la Libériste qui parcoure 8,8 km linéaire sur la montagne jusqu'au sommet. Tout au long de la douce montée sous le couvert des arbres on croise de nombreux cours d'eau et le sentier est légèrement boueux par endroits.  La dernière partie du sentier avant le sommet est plus exigeante et elle se fait au centre d'une piste de ski donc en plein soleil quand c'est le cas! Chapeau obligatoire! La vue de ce côté de la montagne laisse apprécier les collines et monts de la réserve faunique des Laurentides. \r\n\r\nAu sommet, surprise! On peut aller caresser et jouer avec la soixantaine de chiens de traineaux  tous heureux de notre arrivée. Il y a un belvédère en haut des pentes du côté sud du mont qui nous donne une superbe vue sur l'ile d'Orléans et la rive sud du fleuve. La descente du sentier peut se faire par plusieurs sentiers dont notamment la Crête qui est assez abrupte et glissante sur de petits tronçons.\r",
    "directions": "De Québec prendre l'autoroute 40 direction Ste-Anne-de-Beaupré qui devient la route 138 et suivre les indications du mont Ste-Anne. Tourner à gauche vers le stationnement du golf  et les condos mais continuer jusqu'au bout, il y a un bout de chemin de terre et le stationnement gratuit est à gauche. Le départ du sentier est à doite du stationnement et commence dans 200 m d'un large sentier de gravelle et de terre. Chiens admis et gratuit pour tous.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/QC/1854/reg_MontSte-Anne05015.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/1854/reg_MontSte-Anne05016.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/1854/reg_MontSteAnne05009JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/1854/reg_MontSteAnne05020JPG.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/la-liberiste-mont-ste-anne-near-mont-st-anne-pq-1854",
    "stats": {
        "Activities": "snowshoe hike ski-downhill ski-xc mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "3 hrs",
        "Total Distance": "9 km",
        "Town": "Mont St. Anne, PQ",
        "Type": "out-and-back"
    },
    "title": "La Libériste Mont Ste-Anne",
    "trail_id": "1854"
}