{
    "description": "This is a beautiful trail in the Adirondack mountains.  Algonquin is second only to Mt. Marcy in height in New York.  It is a challenging and rewarding hike, starting off as an easy walk through the woods, gradually increasing in difficulty.  The last kilometer is above tree line and affords expansive views and a variety of alpine vegetation.  At the halfway point a waterfall crosses the trail. \nIn our hike, we started at the High Peaks Info Centre (LOJ Rd.) and it was initially flat but started to gain elevation (muddy) very quickly.  This is one of the toughest ADK hikes, at many times more of a stream-bed than a trail, and a lot of boulder-hopping and/or scrambling towards the top.  Very rewarding, a nice peak to bag, and the views are tremendous.  Can't go wrong once on the trail, there are many trail-heads from the parking lot, just follow the signs.  It will likely be busy in the summer.  There are primitive camp-sites just off this route, more information available at the info centre.",
    "directions": "Take US Rt 87 (north of Albany) to exit 30.  Follow signs to \"High Peaks Region\" and Lake Placid.  Left on Adirondack Road just outside of Lake Placid.  Follow dirt road to ADK parking lot.  Trailhead is at the back of the lot. \nor .... (explained differently from Lake Placid)\nFrom the West take Route 73 East from Lake Placid for 5.5 km, turn right onto Adirondack Loj road. Follow the road for 18.5 km to the gates of the AMC High Peaks Information Center. If traveling from the East take Interstate 87 to exit 31. Turn right onto Route 9N for 24 km. Turn right onto Route 73/Route 9N and follow for 3 km. At Keene continue to follow Route 73 for 17.5 km, turning left onto Adirondack Loj road. Trailhead is at the East end of the parking lot located closet to the visitors centre.",
    "geohash": null,
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/NY/1873/long_avycutes-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/NY/1873/long_best2_Vicpanorama1med-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/NY/1873/reg_2.jpg",
        "https://trailpeak.com/storage//content/trails/US/NY/1873/reg_3.jpg",
        "https://trailpeak.com/storage//content/trails/US/NY/1873/reg_4.jpg",
        "https://trailpeak.com/storage//content/trails/US/NY/1873/reg_P6105899-1-8-18338.jpg",
        "https://trailpeak.com/storage//content/trails/US/NY/1873/reg_P6105900-2-8-18338.jpg",
        "https://trailpeak.com/storage//content/trails/US/NY/1873/reg_abreak-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/NY/1873/reg_almostup-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/NY/1873/reg_best1_vicpeak-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/NY/1873/topo_1.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/algonquin-peak-near-lake-placid-ny-1873",
    "stats": {
        "Activities": "snowshoe hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "7 hrs",
        "Total Distance": "11 km",
        "Town": "Lake Placid, NY",
        "Type": "out-and-back"
    },
    "title": "Algonquin Peak",
    "trail_id": "1873"
}