{
    "description": "The trail leads up through the forest, following just to the south of Murdo Creek, until it hits a logging road (possibly Murdo FSR?). The area around this section of the trail is being actively logged and you will hit a small, recently logged area just as the trail emerges onto the logging road. Turn left onto the logging road and follow it upwards, ignoring any branches to the right. You will pass another small, recently logged area to the right. After about 30 minutes of hiking uphill, the road becomes less steep. Watch carefully on the right hand side of the road for trail makers.\r\n\r\nThe trail leaves the logging road before Murdo Creek and continues uphill through second growth forest. After roughly half an hour of walking up this trail, you will emerge at McKay Lake. This small but beautiful lake lies at the foot of a tall cliff beneath Mount St. Benedict. The trail skirts around the lake to the left for a few paces before it hits the point where Murdo Creek drains out of the lake. Several logs have dammed the mouth of the lake and you must walk across these before continuing up the trail.\r\n\r\nNow the trail leaves the lake and quickly becomes very steep. It climbs straight up through the forest to a saddle between Mount St. Benedict and a peak to the north. From here, you get your first glimpse into the neighbouring valley to the east (presumably with Cascade Creek at the bottom of this valley). The trail now leads to the right along a ridge and flattens out to a pond and very small meadow at the base of another steep cliff. The final peak of Mount St. Benedict looms overhead. The trail leads to the left of the pond, and curls around the side of the cliff, climbing to the top of Mount St. Benedict.\r\nWhen we reached the top, the view was partially obscured by clouds, however we could see Stave Lake far below to the West, and we had a brief view of the Fraser Valley, suggesting outstanding views on a clearer day.",
    "directions": "Travel east on the Lougheed Highway for about six and a half km past Mission. Turn left onto Sylvester Road (watch for the sign to Cascade Falls.) Follow Sylvester Road northwards until it ends. Do not turn right to Cascade Falls Regional Park. After about 15 km, Sylvester Road turns into Lost Creek FSR (a well-graded gravel road that is fine for 2WD vehicles). Follow Lost Creek FSR for about two or three km, watching for Davis Lake through the trees on your left. Ignore the right turn onto Murdo FSR. Once you reach Davis Lake, stop and park as soon as you reach the bridge over Murdo Creek (opposite the lake). The Trailhead is on the right-hand side, a few paces south of the bridge and is clearly marked with red tape. It heads uphill in an easterly direction away from the Lost Creek FSR.\r\n\r\nIf you have a high clearance 4wd, you may want to try following the Murdo FSR. Apparently it crosses the trail much higher up the mountainside. We tried this but quickly found the waterbars to be too deep for our Ford Escape, so we started hiking from the trailhead at Davis Lake.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/1879/reg_CIMG0655-14802.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1879/reg_IMG-0235-43941.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1879/topo_p4.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1879/reg_p1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1879/reg_BenedicttoposmJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1879/reg_p2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1879/narrow_McKay1-43941.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1879/narrow_McKay3-43941.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mount-st-benedict-near-abbotsford-bc-1879",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer spring",
        "Stars": 3,
        "Time": "6 hrs",
        "Total Distance": "15 km",
        "Town": "Abbotsford, BC",
        "Type": "out-and-back"
    },
    "title": "Mount St. Benedict",
    "trail_id": "1879"
}