{
    "description": "If you're looking for a fast track to cliffs and salt spray, but don't have time to commit to a full day, then Middle Head trail is just the ticket for a quick fix hike just before lunch or after dinner. \r\n\r\nThis interpretive trail follows the landscape as it juts out to sea, starting with a well-maintained path starting just outside of The Keltic Lodge near Ingonish. The path cuts through a mixed forest, and goes past relics of the past, including an old structural foundation, and a stone hearth. Several kiosks describe the fishing culture of the past, as well as the flora and fauna of the area, both on land, in the air and in the sea. Several areas have been cleared to make way for the view of Cape Smokey.\r\n\r\nThe trail opens up into a meadow that is about 40 meters wide at the \"neck\" of the head, and that is when the exposed rock cliffs become visible. Branch trails go off the main route to explore the coastal cliffs. Be careful of coming too close to the edge. Some areas are just mossy grass over collapsed rocks. \r\n\r\nThe head section is all rocky coast with dense forest growth. The views are probably the main attraction to this trail, having Cape Smokey's cliffs on the right, and Ingonish Island to the left. Beneath you are the crashing of waves and sounds of gulls along the rocks.\r\n\r\nAlong this trail are several bouldering problems that looked interesting. The rocks are sharp for sure, so come prepared! There are great crack, slopy and crimp features to delight in.\r\n\r\nThe route could be mountain bikable, if it were not for the volume of trail users of all ages, as well as some of the sharp tree branches along some of the trail - not to mention steep cliffs with no guard rails in some places. \r\n\r\n\r\nYou can hike this trail as part of the Hike the Highlands Festival\"  Sept 16-25 out of Ingonish, N.S. For further information, please click on the link above.\r\n\r\nShannon Burt\r\nEast Coast editor for Trailpeak.com\r",
    "directions": "Along the Cabot Trail just after Ingonish Beach. Enter the Cape Breton Highlands National Park, and turn right towards the Celtic Lodge. Follow the road and look for signage. The trail is numbered 25 in the free Park Trails Guide.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/1881/long_MIDDLEHEAD.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1881/reg_Trailpeak2ndpix046.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1881/reg_Trailpeak2ndpix051.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1881/narrow_Trailpeak2ndpix037.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1881/narrow_Trailpeak2ndpix043.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1881/narrow_Trailpeak2ndpix050.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/middle-head-cape-breton-near-ingonish-ns-1881",
    "stats": {
        "Activities": "hike snowshoe",
        "From": "",
        "Seasons": "summer fall winter",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "4 km",
        "Town": "Ingonish, NS",
        "Type": "out-and-back"
    },
    "title": "Middle Head, Cape Breton",
    "trail_id": "1881"
}