{
    "description": "This trip begins along the shore of Ingonish River. It is an easy paddle BUTÂ? there are a few tricks to avoiding the sand bars, that kayaking guide, Mike Crimp of  Cape Breton Sea Coast Adventures, can teach you in between his local stories and sea tales.  Mike is a friendly guy, offering a \"John Madden/John Goodman\" running commentary and a hugely enjoyable experience. The distance above is for a return trip. It's approx 5 kms to the harbour mouth only where you can pull out near the government docks on the South side of the entrance if you are so inclined.\r\n\r\nHeading east from your launch point and still in the estuary, you'll have a chance to see red-headed mergansers, bald headed eagles and geese, whose sentinels stick their heads up above the marsh grass to see who is invading their territory. Even on the foggy day we paddled it, you will appreciate the Nova Scotia flavor of the houses, docks and lobster boats. The water is calm with only slight winds reaching past the natural breakwater barrier at the east end of the harbor. Behind this barrier the paddling is lake like. On the North shore of the harbor is an inlet called the \"Hurricane Hole\". This has deep water on one side so that, in years past, they could pack all the boats in the harbor gunnel to gunnel into this sheltered spot to avoid the high winds that would destroy them. \r\n\r\nWe were warned by local guides that the currents through the harbor mouths often could fool you by not following tide patterns. Not so this tripÂ? we exited the mouth and headed south to explore the rocky coast for a short distance, then out around the channel marker buoy and back into the harbor. We touched ground on the backside of the breakwater barrier to change boats and carry on back to the estuary.\r\n\r\nLion's Mane jellyfish abound on this stretch of coast including the harbor. Their sting is unpleasant and painful so watch your hands around themÂ?\r\n\r\nLocal lobster boats and Police patrol vessels can leave large wakes that will surprise you long after they have passed so keep an eye out for this especially when thinking of landing to rest or while close inshore where rocks can threaten.\r\n\r\nThis is an easy but very scenic trip especially in sunny weather. A guide such as Mike can enhance your experience, especially if you are a novice or looking for local history.\r\n\r",
    "directions": "The guided tours leave from the west end of the South Ingonish Harbor after coming down off Cape Smokey while heading north. Pay attention as there is only one small sign AT the entrance of to the access road which is just to the North of the bridge over the Ingonish River.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/1882/long_INGONISH.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1882/reg_Trailpeak134.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1882/reg_capesmokey.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1882/reg_crimp.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1882/reg_eagle.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1882/topo_daveinafog.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/south-ingonish-harbour-near-ingonish-ns-1882",
    "stats": {
        "Activities": "river-canoe sea-kayak",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 3,
        "Time": "3 hrs",
        "Total Distance": "10 km",
        "Town": "Ingonish, NS",
        "Type": "out-and-back"
    },
    "title": "South Ingonish Harbour",
    "trail_id": "1882"
}