{
    "description": "White Point was a pleasant surprise for the 3 of us trailpeak editors who chanced upon it off the scenic drive north of Ingonish. It has what seems to be classic alpine tundra and meadow that you'd see on a B.C. mountain peak, only you are 100 feet off the ocean floor where waves crash through sea stacks (towers of rock), and, the hills run one after another until you reach the grave of the unknown sailor.  Above it, a white cross.  Beyond it, several unreachable Islands of a small archipaelego (The Tiddles). Washed up sailors from ship-wrecks were buried here, in simple graves adorned by unmarked granite stones, which somehow fit perfectly with the natural setting.  \r\n\r\nThe area has many features including a singletrack trail that runs away from the archipaelego to the right.  You'll find it. We were captivated, and we're no slouches when it comes to finding great scenery.\r\n\r\nThe mist that came over the hills as we walked the trail created an eery silence, as if we were transported in time to the days of masted ships and privateers, and we half-expected a schooner to break through the mist. \r\n\r\nBut we came to our senses, and, after just 1.5 hours of walking and exploring we returned on the loop trail to our car, parked just off the 'Two Tittles' Inn in the village of White Point.  Venturing now only to the great meal at Neil's Harbour to be had at the Chowder House.  \r\n\r\nWe loved this hike, and thought the singletrack would be ideal to bike on were it not for the rather sacred ground we were walking on.  The treed hills above the barren meadow would also be ideal for a small hike to the peak, or perhaps a winding mountain bike trail.  Indeed we saw some ATV tracks heading up into the hills above White Point.  Word is a town-to-town  coastal hike is in the planning stages here.  Check in with the local chamber of commerce in Ingonish.\r\n\r\nNote: We did this 1.5 hour stop after kayaking the North and South Harbour near Dingwall Harbour (village), when renting from Eagles North (there are eagles and whales to be seen from the cliffs) in Cape North nearby.  Talk to Mike & Jen Fitzgerald of Eagles North, who also lead a kayak trip to White Point if the conditions are right.  You don't want to end up alongside the other mariners on White Point, so check in with Mike.\r\n \r\n\r\nYou can hike this trail as part of the Hike the Highlands Festival\"  Sept 16-25 out of Ingonish, N.S. For further information, please click on the link above.\r\n\r",
    "directions": "From either Cape North or Ingonish, get off the Cabot Trail in the direction of Neil's harbour (if coming from Ingonish), and, drive along the coast to White Point.  Descending into town, but not to the docks, look for the \"Two Tittles\" Inn, and immediately to the right, you will find a dirt road that leads you 200m up a parking spot.  Park and continue by foot, you will really enjoy this hike/stroll as a complement to a longer hike in the area (Peak at Tenor Reef or perhaps Meat Cove, or a paddle at White Point).",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/1885/reg_TheTiddles-WhitePoint.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1885/reg_Trailpeak126.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1885/reg_Trailpeak133.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1885/reg_Trailpeak136.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1885/reg_grave.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1885/reg_summersummersummersun5-1-of-1--33739.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1885/reg_whitepoint.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1885/reg_whitepointsleepovah24-1-of-1--33739.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/white-point-cape-breton-near-ingonish-ns-1885",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "2 km",
        "Town": "Ingonish, NS",
        "Type": "out-and-back"
    },
    "title": "White Point - Cape Breton",
    "trail_id": "1885"
}