{
    "description": "NTS Map: 082J15\nElevation Gain: 250 m\nDoug Eastcott describes this ride as # 51in his book Backcountry Biking the Canadian Rockies. This is a 43kM loop that consists of double track and a short section of single-track which can be ridden in either direction.  This trail gets you back into some amazing back-country scenery that feels like you've travelled much further than you have.  In the fall, the Larch trees light up the valley floor at the summit and other points along the trip.\nIt is difficult for length and 1000m of cumulative elevation gain (and loss) but not for technicality.  The most technical aspects are the loose cobble and there is virtually no exposure to falling.\nMost people we talked with prefer to ride in a counter-clockwise direction  but we prefer to go clockwise  and have tried both . In this direction you encounter the only real technical portion of the ride in the prior to the climb to the summit  - therefore you still have strong legs. \nThe ride starts out following the valley floor and the  Elbow  River  then slowly starts to climb up the side of the mountain where the path begins to wind with numerous ups and downs which can be seen on the track profile.   The only real single-track technical section is encountered prior  to the Y junction with the three point trail. Take the right fork and the climbing begins but from this direction the actual climb is only approximately 3kM before you reach the summit.  The summit is a large flat field with a good double track running across the top and once across the summit, the downhill begins( 7km) on a good double track before reaching the valley floor. The remainder of the trail is predominately downhill following the river with a couple of minor hills to climb before reaching the gravel road at the Little Elbow campground.\nMake sure you have a good set of tires given the numerous sharp rocks  (yes we had a flat 11kM into the ride) and bring a good supply of water.",
    "directions": "From Bragg Creek drive west on Highway 66 to the Little Elbow Recreation Area. Parking is provided near the campground where the trip log begins.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/1889/reg_ElbowLoopMTBOct2011005-vi-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1889/reg_ElbowLoopMTBOct2011010-vi-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1889/reg_ElbowLoopMTBOct2011013-vi-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1889/reg_ElbowLoopMTBOct2011014-vi-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1889/reg_ElbowLoopMTBOct2011018-vi-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1889/reg_ElbowLoopMTBOct2011023-vi-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1889/reg_P1030602-Custom--6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1889/reg_map.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1889/topo_image004.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/elbow-loop-near-kananaskis-ab-1889",
    "stats": {
        "Activities": "mtn-bike ski-bc hike snowshoe",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 4,
        "Time": "6 hrs",
        "Total Distance": "43 km",
        "Town": "Kananaskis, AB",
        "Type": "out-and-back"
    },
    "title": "Elbow Loop",
    "trail_id": "1889"
}