{
    "description": "For most people, hiking to the alpine in Canadian Rockies is an insurmountable cardiovascular barrier best left to the health nuts, but... What if you could start the hike just below treeline? What if you could have mind boggling views within fifteen minutes? What if? Sure, the heart will pound and the legs will whine but even if you only go as far as the first opening, the trail to Wilcox Pass in Jasper National Park rewards all who make the trek. And boy oh boy, do lots of people make this trek. Due to the popularity of this hike the trail has become wide, braided, muddy and rutted and it's getting worse every year. Please do not add to the carnage. Please wear proper boots and gaiters, please walk through the mud and please stay on the main trail... Please.The weather this close to the Columbia Icefield is very fickle to say the least, sometimes changing frequently throughout the course of a single day. I was once caught at the crest of the pass by a snowstorm in the middle of July so be prepared. Rocky Mountain Bighorn Sheep are frequently seen feeding along the trail and I've also seen goats and caribou.The pass itself is wide and very obviously glacier scoured. Standing on the crest it is easy to imagine the great glacier that once straddled this height of land. Low parallel ridges run the length of the pass revealing the direction the ice flowed. Between the ridges a fragile layer of soil supports a myriad of wildflowers that bust to life during the brief two month growing season. Carpets of white globe flowers and anemome lead the charge in late spring, sometimes pushing up through the last of the melting snow. By summer flowers of yellow, red, blue and purple join the fray and create a scene any self-respecting gardener would be envious of.Nestled in a patch of willow on the edge of Sunwapta Pass the trailhead is quite unassuming by comparison. The trail soon enters an old forest of Engleman Spruce and Subalpine Fir and begins a moderate climb. At the first viewpoint Sunwapta Pass is spread out below you and across the valley is Mt Athabasca. The trail continues to climb through ever diminishing trees and eventually passes above the creek that drains the pass. Leaving the trees behind, it is another easy 2km to the crest of the pass which is marked by a small sign. The trail is under snow in much of June and is wet through the end of July. As the trail crosses the alpine its condition improves indicating that most hikers don't make it all the way. People become distracted by one thing or another and drift off-trail in the wide open spaces of the pass. If you fall victim to the beauty of Wilcox Pass on a hot summers day please respect the area and limit your impact by spreading out, avoiding wet areas or staying on rock. Return the way you came.The trail continue across the pass and down Tangle Creek to the Icefields Parkway for a one-way hike of 11km but without a second car most hikers don't complete the journey. If you're at the pass and have the energy, it's worthwhile to push-on 3km to the far edge of Wilcox Pass for a look down Tangle Creek. The trail can be faint but you'll find your way, just stick to the base of Mount Wilcox on the left.In the 1950's Wilcox Pass, among other areas of Jasper National Park, were used for the shooting of The Far Country starring James Stewart. See also",
    "directions": "Drive south of Jasper on Hwy 93 (Icefields Parkway) for 108km and turn right into Wilcox Creek c/g. Park in the first parking lot on the left just off the highway.",
    "geohash": "c3k9",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/1893/long_Wilcox-46005.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1893/long_Wilcox-Pass-grad-1287.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1893/reg_016-14A-31043.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1893/reg_100-0006-11124.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1893/reg_100-0012-11124.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1893/reg_100-0014-11124.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1893/reg_100-0015-11124.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1893/reg_100-0019-11124.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1893/reg_100-0021-11124.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1893/reg_100-0025-11124.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1893/reg_100-0027-11124.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1893/reg_100-0032-11124.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1893/reg_IMG-0057-46005.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1893/reg_IMG-4276-12322.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1893/narrow_010-8A-31043.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1893/narrow_DSC-2745-29667.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1893/narrow_DSC-2806-29667.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/wilcox-pass-near-jasper-ab-1893",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 5,
        "Time": "5 hrs",
        "Total Distance": "12 km",
        "Town": "Jasper, AB",
        "Type": "out-and-back"
    },
    "title": "Wilcox Pass",
    "trail_id": "1893"
}