{
    "description": "Cape Smokey is the high peak that you actually drive up and over on the way to Ingonish via the Cabot Trail (the highway that circumnavigates the highlands).\r\n\r\nOn one side, sheer cliffs to the sea, the drive up is so steep it feels like you are about to rocket into the ocean.  Once up top, you'll see a provincial park entrance to the right, it's actually fairly easy to miss, so look for the Nova Scotia flag fluttering, or perhaps even torn - it's almost always windy up top.\r\nDrive in and park, you'll see the entrance to the trail framed by a wooden entrance way - with appropriate signage. There are picnic tables and washrooms.\r\n\r\nWhen I went, I decided to ride it - please note, this is not a mountain bike trail - although there seem to be no signs indicating bikes are not allowed.  For the advanced rider, this is sweet singletrack.  For the hiker, this undulating and overall descending trail takes you to some excellent branches in the trail that lead you to the cliffs and the views.  And what views.  If it's clear, you'll see Middlehead and Ingonish Island, and, a wide open ocean.  Large swells give way to rather large waves crashing on the rocks below which can entertain for what seems like hours.\r\n\r\nOn my journey, I rode the singletrack about 3 km (of 5), in the mist.  I had very few views, barely making out the ocean below, but I could hear the Lobster boats, working on finding my dinner!\r\n\r\nThere are a few steep sections where I had to get off my bike, do not ride this trail on a weekend, it would be for hikers only.  The trail simply isn't wide enough to accomodate more than single file hikers or riders. If you are not an advanced rider, you won't be able to stay in the singletrack anyway, it's narrow.  Go to Clyburn river valley instead.\r\n\r\nThat being said, with the limited riding singletrack in Ingonish, riders who are careful to avoid peak hours and who do need a singletrack fix may consider this a great ride.\r\n\r\nVisitors will note the short stubby trees, ankle high vegetation, wildflowers, stream crossings, moose prints (I saw some), and of course, vistas. There are reportedly lynx that still remain in the highlands,  and several dwarf birch species can be found, although even these have receded to more northerly latitudes.  A full natural history may of course be found at the nearby national park office, or perhaps by taking a guided hike as part of the Sept 16-25 Hike The Highlands hiking festival. \r\n\r\nYou can hike this trail as part of the Hike the Highlands Festival\"  Sept 16-25 out of Ingonish, N.S. For further information, please click on the link above.\r",
    "directions": "Cabot Trail, top of Cape Smokey, in the provincial park parking lot on the right as you crest Cape Smokey, just before Ingonish and before the road leads down into town. Ingonish is a few hours from Sydney, and on the East side of the Cabot Trail in the wild Highlands of Cape Breton.",
    "geohash": "f8m1",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/1895/long_view2jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1895/reg_EPSON015-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1895/reg_EPSON016-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1895/reg_trail1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1895/topo_viewfriomSmokey.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1895/20120721074900.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/cape-smokey-cape-breton-near-ingonish-ns-1895",
    "stats": {
        "Activities": "hike mtn-bike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 5,
        "Time": "2 hrs",
        "Total Distance": "10 km",
        "Town": "Ingonish, NS",
        "Type": "out-and-back"
    },
    "title": "Cape Smokey, Cape Breton",
    "trail_id": "1895"
}