{
    "description": "NTS Map: 092G01The Mission woodlot has been painstakingly created by a small group of riders who have built a mountain biker's paradise of twisting ramps, ladders, jumps, and steep descents.  The woodlot is on par with the North Shore, some say better.The trails shown here that are very popular include; Crazy CarpenterBlood DonorGiant KillerSnakes and Ladders.Other trails at the Mission Woodlot are:B-LineCabin Trail (Goldmine)Heckyl and JeckylHootsUpper and Lower ToadstoolMandatory Caution(Fluffy Kitten)PlatinumQuickhitShotgunThe GateTsugaRide out to where you started using one of the lower trails (our 3D map shows one lower option, the topo another).  Use the GPS way points to find each trail head - click on \"download GPS to see a preview map and distances\". A great out and bike day outing if you follow this route.You can't shuttle, so, the hike/bike up and ride down these trails will keep you busy for the day. The hike/ride up the skidder trail to Gold & Crazy Carpenter will take about an hour. But once you get up top, there are lots of sturdy ladders and you'll want to play over and over on the logs, ladders, and jumps.  Bring spares, first aid gear, friends, water, and, respect for the local trails.To get to the woodlot from Vancouver, take Hwy #1 from Vancouver to Port Coquitlam. Take the Lougheed Hwy heading into Port Coquitlam. Make sure you take exit '7' (not 7b United) just before the Port Mann bridge.  A favourite meeting place is the Starbucks at Pineview mall.  After that (or if you didn't stop) get on Lougheed Hwy heading East, and, after 10 minutes or so, when you get near the big Staples, turn left onto Dewdney Trunk Road, drive all the way through Maple Ridge, keep going on Dewdney Trunk Rd., then, left on 287th, and drive to the end of the road going straight (i.e. don't take the road going left at the end). You'll see the parking lot straight ahead -- there is usually always someone riding on weekends, so you'll see the parked cars and trucks.more mountain biking videos can be found here",
    "directions": "See description and / or GPS",
    "geohash": "c2bb",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/19/reg_3dfinal2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/19/topo_me2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/19/narrow_Img00001.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/19/narrow_Img00009_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/19/narrow_Img00020.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/woodlot-a-mission-woodlot-overview-near-maple-ridge-bc-19",
    "stats": {
        "Activities": "mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 5,
        "Time": "4 hrs",
        "Total Distance": "7 km",
        "Town": "Maple Ridge, BC",
        "Type": "out-and-back"
    },
    "title": "Woodlot - A Mission Woodlot Overview",
    "trail_id": "19"
}