{
    "description": "Skyline Trail (Tag, You're it!)\r\n\r\nHave you ever been on a trip to an area where you keep running into the same group of people at different venues? Once, back in Newfoundland, my wife and I kept running into the same family. We saw them on probably three different back country trails! Well, this was something similar. After meeting a couple during our North River Kayaking tour, we briefly met up again the next day when we were hiking Middle Head, near Ingonish. They left left us a note saying \"Hi\" after meeting us on the trail and recognizing the truck and the Seaward kayak at the trailhead. Well, we crossed paths again out there on the skyline. This time, they left a note saying... \"We meet yet again! Tag, You're it!\"\r\n\r\nSkyline trail can be found on the West side of the Cabot Trail, near Cheticamp. Due to rare plants and a break down of ground cover, the trail was rebuilt in 2001 to include board walk sections and interpretive stations. The 9 Km loop remains fairly flat, and runs through alpine tundra landscape. The shorter (left) section of the loop is cut fairly wide, and is gravel based for ease of travel. Wheel Chairs can even do this route. There are a few sections where it is boggy that use boardwalks. At a point along the route, the trail descends a part of French Mountain. to protect the thin ground cover, the trail is built above the surface, but uses a color of pressure treated wood so as to be nearly invisible from the road. \r\n\r\nA part from the views attained from the look offs, my favorite part of the trail is the longer back side of the return loop. There, a mixed forest shows a more dramatic feel, with areas that suffered from the forest fire in the 50's, and stunted growth forest. The trail here is a more rugged single track style, and the level of difficulty is a bit more challenging.\r\n\r\nWhen my co editor Dave and I did this trip, we were wraping up a rather rainly week. When it didn't rain, the fog was ever present. So, on our recent run of this trail, we didn't see much of the St. Laurence Strait, nor did we see much of the outcrops on French Mountain, with the Cabot Trail road meandering through. This hike was more to simply bag it with the GPS. What we did see however were moose prints along side the boardwalk sections, and a local parks warden / worker scouting the trail for hikers with any problems. She said she saw a moose. We weren't so lucky!\r\n\r",
    "directions": "From Cheticamp, enter the Highlands national park and climb French Mountain. Look for the road and trailhead on the left.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/1901/reg_sky1-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1901/reg_sky2-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1901/reg_sky3-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1901/reg_sky4-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1901/reg_sky5-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1901/reg_sky6-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1901/reg_sky7-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1901/reg_sky8-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1901/narrow_sky9-7064.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/skyline-trail-near-cheticamp-ns-1901",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "9 km",
        "Town": "Cheticamp, NS",
        "Type": "out-and-back"
    },
    "title": "Skyline Trail",
    "trail_id": "1901"
}