{
    "description": "Kayaking St Ann's Harbor with North River Kayak Tours. This is by far, the most fun kayak tour I have had in a long time. North River Kayak Tours is owned by Angelo Spinazzola, and is located near the beautiful hills around St. Ann's Bay, Cape Breton. \r\nOperating for ten years now, they offer half and full-day guided excursions out of their area, as well as multi-day trips around the north rim of Cape Breton. Our guides for the day were Matt and Claire. We were grouped with four other paddlers, and the group dynamic was incredible. \r\nThis day was the first sunny one of a spell of rain on our Cape Breton trip, and it was nice to see that for most of us, only our paddles got wet for a change. \r\nOur route emerged from The North River, and turns into St. Ann's Harbor and then St. Ann's Bay. The water way extends to Englishtown where there is a small ferry that runs the span. The guides have their route down pretty tight, and make the most of the natural surroundings. The location offers an eagle's nest, mill ruins, (home of King Louis Ha Ha!), a small cave, and beautiful forested hills. Matt and Claire certainly put us at ease with their comradery and approachability as they talked with everyone. \r\nWe broke for lunch along a cobble shore near a small forest waterfall, where the guides unpacked their stoves and kitchen tools to serve up a lunch of swank garden salad, fish cakes, cookies and tea. Nothing better could satisfy us hungry paddlers. \r\nAfter a short bit of exploring around the beach, we set off again heading back down the harbor toward another beaching spot. At this time the wind had picked up a bit, and to our good fortune was a tail wind, which made our go in the rougher chop much faster. We arrived early, which gave some an opportunity to rest their weary arms and explore, while giving others the chance to further test their newly developed kayaking skills. If you're lucky, you might ask one of the guides to show you a kayak roll, and have them offer a few pointers.\r\nThe rain held off, and even the sun came out to warm our sprayskirts on our short journey home. We all arrived safely back at the dock where they helped us exit our boats safely. All told, the guides have their day tour wired down. Rest stops at key places, and a sheltered body of water makes this location prime for beginner sea kayakers. Again, scenery does not always make a memorable experience. In this case, the guides added a rich sense of character to the memories. Later on, we met up with Claire and the other 4 paddlers of our group to see a local concert, and afterward, a night hike to King Louis Ha Ha and the phantom eagle! Thanks for the memories on that epic day.",
    "directions": "On the Cabot Trail, turn left at Englishtown following the 312, or turn off to St. Ann's along the Cabot trail.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/1902/long_clairandshannon.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1902/long_northriver.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1902/reg_cave.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1902/reg_guides.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1902/reg_matt.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1902/topo_clairsroll.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/st-anns-harbor-with-north-river-kayaking-near-baddeck-ns-1902",
    "stats": {
        "Activities": "river-canoe sea-kayak",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 4,
        "Time": "6 hrs",
        "Total Distance": "7 km",
        "Town": "Baddeck, NS",
        "Type": "out-and-back"
    },
    "title": "St Ann's Harbor with North River Kayaking",
    "trail_id": "1902"
}