{
    "description": "This was one of the top recommended hikes by ALL the locals we talked to around Ingonish. Luckily it was a sunny day when we hiked it. Having come from the Vancouver, BC area I had hiked both the Grouse Grind on the North Shore and The Stawamus Chief in Squamish. Franey, I found, incorporated elements of both these classic West Coast trails but did it with a pleasant Maritimes flavour and its own charm. The above distance is the loop return trip.\r\n\r\nThis hike sees you progressing up to the plateau level of Cape Breton and the change in the forest cover is dramatic. You start out in hardwood forests and fairly even, groomed trail conditions. As you progress up the trail however you begin to encounter stairs like the first part of the Chief and terraced steps like the Grouse Grind. After some steep single-track trail you top out in the boreal forest that Cape Breton's Plateau is famous for; stunted evergreens & bogs and rock. There is a great shot of Shannon our PEI editor, moving up through this transition zone showing dead tree trunks amongst the greenery. A short boardwalk gets you over the boggy stretch and after the climb you'll be glad to be moving on the relatively flat terrain up here. Going up there is a spur trail to your right off to a look off where you will get good views of a small lake off to the East. South Ingonish Harbour and Cape Smokey can be viewed to the south; Middle Head Peninsula to the East.\r\n\r\nOn the very top you have granite slabs and boulders much like the Chief and the back shoulders of Grouse. The view is stellar - dramatic panoramic vistas from all sides. Those that take the trail from the granite slabs out to the edges of the cliffs will be rewarded with even more spectacular views to the West where the Clyburn River winds through the valley below and the contrast between rock and forest is beautiful.\r\n\r\nMoose abound in the Cape Breton Highlands and Franey seemed to have its share if you go by the droppings. We did not see one this trip, but early risers may catch one up and moving around.\r\n\r\nFraney did not disappoint and while not as strenuous as the West Coast hikes I've mentioned above, it nearly broke this trailpeak editor - there's approximately a 1000 foot elevation gain over this 3.2 kms (one way) hike and I'm definitely a paddler rather that a hiker. AlthoÂ? put a canoe on my head and things might have seemed a little differentÂ? especially if I was only going the one wayÂ?\r\n\r\nOur hike that day took us 2 hours and a few minutes.  Note: This hike can be done as part of the Sept 25 2005 Hike the Highlands hiking festival, for more information, click the hiking news on trailpeak and you'll find links and more information about the festival.\r\n\r\nDave Falkins\r\nPaddling Editor, BC,\r\nwww.trailpeak.com\r\n\r",
    "directions": "Turn off the Cabot Trail Hwy just north of the Clyburn River (& trail). Follow the fire access road and turn right up the hill for about 1 km or so. There is a small parking lot at the trailhead. Note - we followed a large motor home up the hill and it could not clear the low hanging branches on the final few hundred yards. It had to turn back and park at the bottom of the hill.  It's in the national park and can be done as part of a guided hike during the \"Hike the Highlands\" festival in Sept.",
    "geohash": "f8m1",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/1903/reg_CapeBretonHighlandsTrailpeakvacation238.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1903/reg_CapeBretonHighlandsTrailpeakvacation246.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1903/reg_DSCF0167-26064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1903/reg_DSCF0171-26064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1903/reg_DSCF0176-26064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1903/reg_DSCF0180-26064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1903/reg_DSCF0184-26064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1903/topo_long-Franey.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1903/narrow_CapeBretonHighlandsTrailpeakvacation236.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1903/narrow_best1_CapeBretonHighlandsTrailpeakvacation254.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/franey-mountain-near-ingonish-ns-1903",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 5,
        "Time": "3 hrs",
        "Total Distance": "7 km",
        "Town": "Ingonish, NS",
        "Type": "out-and-back"
    },
    "title": "Franey Mountain",
    "trail_id": "1903"
}