{
    "description": "NTS Map: 083C02Great river trip for beginner-intermediate kayakers.  It was (mostly) completed by my wife on her first trip ever in a kayak. Granted she did dump about 2km from end, but it was an easy walk to the highway and the yak washed up 1km downstream.  Thanks to Outdoor Adventures Unlimited from Drayton Valey for running us up the river in his jet boat to pick it up *AND* for being so considerate in passing us when we saw them earlier.  They pulled right over and nearly stopped so as not to get us with their wake.No serious rapids or dangers.  There are many points you can put in and take out along the route, take your pick.  Taking out at Preachers Point gives a nice quiet channel to get out at and good access to drive right to the river. Trail Conditions",
    "directions": "Drive west of Rocky Mnt House 163km on hiway 11.  At the 146km mark you will see Preachers Point.  A few km past there is Siffleur Falls parking area and foot bridge across if needed.  15.9km past Preachers Point is where we put in, just pulling off to a small gravel path.Note there are many, many places to camp, both government sites and informal, pull off beside Abraham Lake and camp, sites.  Just take it ALL out with you and the rangers will be happy (hey!  FREE camping, it's a great deal & area)",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/1908/reg_ab2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1908/reg_best1_padlin.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1908/reg_mts.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1908/reg_siff.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1908/reg_start.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1908/reg_team1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1908/reg_wpp.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1908/topo_nsaskPPJPG.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/nsask-whirlpool-preachers-near-rocky-mt-house-ab-1908",
    "stats": {
        "Activities": "river-kayak river-canoe",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 4,
        "Time": "4 hrs",
        "Total Distance": "19 km",
        "Town": "Rocky Mt House, AB",
        "Type": "out-and-back"
    },
    "title": "N.Sask Whirlpool-Preachers",
    "trail_id": "1908"
}