{
    "description": "It's a wonderfull trail through the forest. It has some explicit 360 views of the area seeing Howe Sound and the Lions. It is a very challenging trail since the elevation gain is a whopping 1500m done in only 6km of trail, so it is really steep all the way, but it is definately worth it and a good work out.\r\n\r\nThe trail starts at the same old parking lot as for the Lions and Mt. Brunswick trail. The start is past that yellow gate, up the long gravel road. Just ignore the first intersection on the road and head right. The second intersection you will pass is the the turnoff for Mt. Brunswick to the left, so just keep right for now. On the third one, keep right again as the trail to the left leads to the other face of Mt. Harvey and is not the correct trail although it could be possible to climb it with lots of effort and precaution. Finally, on the fourth intersection, turn left as the right will take you to the Lions trail. If you are a bit weary of these intersections, don't worry, they are all properly marked and hard to miss. Now through the forest, up, up and up. There will be a waterfall where you could break and fill up on water, but this is about the only place where there is a water source along the trail. After a few hours of continuous uphill, you will come out to a ridge which will take you to the top of Mt. Harvey, but it is still at least an hour, so you may consider this place for a break. Make sure to bring your camera as the view from the top is extraordinary.",
    "directions": "Drive North for about 11km on Hwy 99 toward Lions Bay then take The Oceanview Road exit. Left on Cross Creek Road, turn right on Centre Road, left on Bayview Road, right on Mountain Drive, then left on Sunset Drive and park near the gate.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/1911/long_4-23966.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1911/reg_IMG-2076-18078.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1911/reg_IMG-2083-18078.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1911/reg_best1_IMG4190jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1911/reg_best2_IMG4177jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1911/topo_WestLion.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mount-harvey-near-vancouver-bc-1911",
    "stats": {
        "Activities": "climb hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 4,
        "Time": "7 hrs",
        "Total Distance": "13 km",
        "Town": "Vancouver, BC",
        "Type": "out-and-back"
    },
    "title": "Mount Harvey",
    "trail_id": "1911"
}