{
    "description": "NTS Map: 083C03Distance - 5 km return, Elevation Gain - 250m (820').Parker Ridge in northern Banff National Park is a must do for all hikers in the Columbia Icefield area. Then again the same can be said for all the trails around the Columbia Icefields, the whole area is just, well... somewhat beyond belief. Giant peaks (by Canadian Rockies standards), dominate the area and the glaciers that flow from them are plentiful. It's truly remarkable that you we can drive through such an area, let alone take such short yet rewarding hikes. This trail is very busy at the peak of summer, to avoid crowds it is best to hike early or late in the day. Hiking at these times will also provides the best light for photography and more comfortable summer hiking temperatures. The trail itself is very straightforward and needs little in the way of explanation. There is 250m of elevation so most people will be a huffin' and puffin' as they follow the broad super trail to the top of the ridge. Over the years Parks Canada has been battling erosion from hikers taking 'shortcuts', with the installation of rails and steps. They have also installed signs in the hopes of deterring the practice of shortcutting but it continues to this day. Due to this abuse and the alpine tundra's fragility, Parks Canada has been closing the trail from late spring to early summer, when the trail is dry and ready for hiking. Please respect this beautiful area and keep to the trail.Well graded switchbacks carry hikers above treeline in no time and fit hikers can be on top in thirty minutes, but to rush up such a trail would be a bit of a waste. Take your time, and enjoy the nature around you. The mixed forest of subalpine fir and engleman spruce can have an intoxicating fragrance, and the array of flowers that grow amongst them are beyond beautiful. Bird life includes the townsend solitaire, grey crowned rosy finch, pipits, horned larks and ptarmigan. Bighorn sheep and mountain goat are sometimes seen on the ridge and the occasional grizzly bear passes through. There are even fossils imbedded in the rocks along the trail. There is so much more than scenery to a place like Parker Ridge. But what a view it is.The trail crosses the crest of the ridge at 2km but it's another half kilometer before you have a good view of the Saskatchewan Glacier. Seen stretching up the valley it carved out over many thousands of years, it is the longest of the glaciers feeding off the Columbia Icefield. At 288 sq km the Columbia Icefield is the largest icefield south of the arctic circle. Combined with the Clemenceau and Chaba Icefields; a glaciologists dream spans nearly 40km to the west. This may seem like a lot of ice but consider this: in 1927 the Columbia Icefield was 365 sq km, that's a 20% loss. I'm not going to rant on, but I would encourage you to learn more about the issue and develop your own opinion. Here are a couple of links to start with. (http://www.globalwarming.org/) & (http://www.wonderofwater.ca/).\tBoth Jasper and Banff National Parks produce a free day hiking guide of this and many other trails in the parks, they are available from the Jasper, Banff, Lake Louise and Columbia Icefields Information Centres. For maps there are Gemtrek's 'Columbia Icefield' at 1:75,000 or the government topo 83 C/3 Columbia Icefield at 1:50,000, available from the The Friends of Jasper.In winter please check the local avalanche bulletins and conditions.Submitted by 'mtncat'.",
    "directions": "While Parker Ridge is located in northern Banff National Park, the closest town is actually Jasper. Drive south of Jasper on Hwy 93 for 114km to the parking lot on the right side of the road. There is a garbage can and panabode privy in the parking lot. Or, go north 180km from Banff, 120km from Lake Louise on Hwys #1 the Trans-Canada & 93 the Icefields Parkway. Coming from either direction the drive is one of the most scenic in the world and worth the trip all by itself.",
    "geohash": "c3k8",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/1918/long_pano-360-almost-19034.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1918/reg_-DSC1937-29667.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1918/reg_Andromeda-Athabasca-HildaPeak.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1918/reg_DSCN0928-38384.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1918/reg_Parker1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1918/reg_Parker2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1918/reg_STH73344-19034.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1918/reg_SaskatchewanGlacier-CastleguardMtn.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1918/reg_n625511728-1152542-5630-11997.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1918/reg_n625511728-1291221-8888-11997.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1918/reg_n625511728-1291228-5603-11997.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1918/reg_n625511728-1291229-5954-11997.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1918/reg_n625511728-1291230-6283-11997.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1918/reg_n625511728-1291232-7047-11997.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1918/reg_n625511728-533182-1481-11997.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1918/narrow_-DSC1913-29667.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1918/narrow_-DSC1940-29667.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1918/narrow_-DSC1942-29667.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1918/narrow_STH73297-19034.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/parker-ridge-near-jasper-ab-1918",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 5,
        "Time": "2 hrs",
        "Total Distance": "5 km",
        "Town": "Jasper, AB",
        "Type": "out-and-back"
    },
    "title": "Parker Ridge",
    "trail_id": "1918"
}