{
    "description": "Cape Chignecto 2005This trip was slated for back in May, but the rain made a mess of that long weekend, so it's the endof July, and we've returned to \"bag the cape.\"This is my third time around hiking the trail, and twice kayaking the region. Needless to say, it's abeautiful location with just the right mix of the Atlantic's land and sea to keep me coming back.For an overview, Cape Chignecto is the largest provincial park located in Nova Scotia. It exists in acorner notch in the Bay of Fundy just past Advocate Harbour. Their website explains much of thehistory of the area and the background to the park. At the time I wrote this, there were 8 trails intotal, but work is currently underway for a spur trail to the Three Sister sea stacks, and should beready for 2006. Hopefully trailpeak will have an invitation to profile the additions next year. Our excursion took on the park's major feature, a 50 (+/-) Km coastal and inland loop trail thatroutes along the park's perimeter. There are several back country or primitive camp sites along theway, giving the hiker choices of making the trek in three or four days depending on your style. Wetraditionally hike this trail in three days.Our plan was to hike from the trailhead at Red Rocks to Little Bald Rock Brook, and establish thatas our first night's camp site. That distance would total around 19Km. From there, day two wouldtake us to Eatonville for a day two's distance of around 17K. Eatonville back home to Red Rockswould be 14 K for day 3. Probably a bit shorter with the beach return section.With the amount of driving we seem to get ourselves into to get to these trails, we've devised a planto always spend a night on site so that we can be at the trailhead early. Such was the case this time,and we stayed in Christie Field within the park. (at least near enough to it. It was pretty dark whenwe arrived!)We set off by around 9:30 at Red Rocks with a destination of Little Bald Rock Brook. This sectionwould be our longest day, as well as the toughest section of the trail. Looking at a topo map, thereare several coves and gulches, and the trail winds around the former, and takes you down into andthen makes you climb up out of later. With pack weights of over 30 lbs, these sections make forquite a leg burning exercise. The views along the way offer vistas back on Advocate Harbour, CapeD'or and ahead to Isle Haute and the miles of rugged terrain that lies ahead of you. Take a bigbreath and move on! Thank god, the mornings are cool in this area.One really nice aspect of the trail is its tree cover. For pretty much the whole time, you shouldn'tneed much, if any sun screen. The tree cover keeps most of the sun off you, and light coastal breezeswick the sweat off your brow.There are three big descents and climbs along day one. McGahey Brook, Mill Brook and RefugeeCove. The last two areas offer camp sites. The climb shortly after Mill Brook was pretty rugged withrock outcropping along one side. We lunched and refilled our water at 1PM in Refugee Cove. Ahead of us would be the big viewfrom Cape Chignecto itself. Passing that, we over shot our Little Bald Rock destination, and due tosome confusion in signs, wound up in Big Bald Rock Brook, 2.2 K past our intended tent site. Therewas only one other couple there in the area, so we decided to stake our claim as far away from themas we could instead of hiking back to our registered spot. It was 5PM, and we didn't feel like hikingany further. Although we overshot our destination, I figured that it would make day two easier. Hey,we can now sleep in!The sites at Big Bald were very nice, though a bit close together. The beach there is really nice, andwe watched the sunset from above some rocks. Tide comes in quite a ways around here. It's cool inthe evenings, so I was thinking myself pretty clever to pack my Mont Bell down inner jacket. It wasjust the thing to take the edge off the chill in the evenings.Day 2With an extra 2K already banked from yesterday, sleeping in was no concern to us. It's about 16Kfrom Big Bald to Eatonville. After a nice breakfast and getting our packs dialed, we were on the trailby around 10. It was another really nice day. Cool temps in the mornings made for a great start. Noover heating on the trail. The highlights for day 2 would be the tundra section just ahead, Keyhole Brook, the boxed inbeaches, Carey Brook, Seal Cove, and the views of the Three Sisters before turning inland.Not more than an hour out of camp, comes a change of scenery. Out of the tree cover, we findourselves in what seems like alpine tundra. The trial goes through a more open area, with rocks andstunted forest growth. Things were more exposed to the cliffs and the rocks make this quite thephotogenic area. Make sure you stop to take some pictures as you explore the rock outcrops. Approaching Keyhole Brook, we heard seals. Soon enough, we saw them playing on the rocksbelow, and splashing in the water and swimming. It was a nice little break from the trail.The air was very clear, making distant features seem very close. Occasionally there would bedistinct views of NB across the bay. You can see the cliffs along both the Fundy Foot path as well asFundy National Park. Both areas share similar terrain.The second day along the coast offers views of boxed in beaches and several sea stacks. Though notas tough as day 1, this section still has its formidable ups and downs. At Carey Brook, we refilledour water, and by noon, lunched at Seal Cove. There, we took in the rocky cliffs with their basaltseams. There's even a basalt sea stack in the middle of the beach you can boulder at low tide.Seal Cove marks the next leg where views of the Three Sisters become apparent. The sea stackswere named from a native Mi'kmaq Glooscap legend where Glooscap, upon leaving the area, turnedhis sisters into stone so that they would be there on his return. This part of the trail also marks thefinal section of trail before it turns inland. The last views of the sea stacks ends near Green Point as the trail begins to head inland. From here,the trail takes on a richer more heavy growth forest. GPS reception was spotty at best it seemed. Dueto the rain lately, there were many boggy areas where even the raised gravel beds just weren'tenough. There were still several climbs and descents to undergo, but nothing like those of day one. After coming down one very steep switch backed section, we stumbled onto what seemed like apretty posh trail. I was thinking that we were on the \"yellow brick road\" to Eatonville, completewith a well built wooden bridge, but such was not to be for long. Just as soon as we were on thissection, we were off it again with a turn to the right and back onto single track, climbing back up ahill, and back into the wilderness. Eatonville was about a Km away when we finally settled to astraight section with Elliot Brook to our left. That's pretty much how it finished as we made our wayinto the tent site area by 2:45. We spent the rest of the afternoon dipping in Elliot Brook's coldwaters to soothe our aching feet and lounging in a field on our sleep mats under the afternoon sun. Itook some macro shots of butterflies in the clover. Finishing day two was sweet!Day 3With most of our food stuffs gone now, our packs were the lightest they were going to be. Ahead ofus lay 14Km of inland undulations through the forest. Shannon had noticed wispy clouds theevening before, saying they were indicative of rain. Sure enough, rain befell us that day. It startedwell after breaking camp, and didn't really bother us in the woods due to the tree cover. We left Eatonville around 9, and headed for home.No real highlights to suggest on the final leg. There is a crossing of Dry hollow Brook, but notvisually memorable. There were climbs and descents through the woods. Most of the trail followedbrooks and land contours. There is evidence of a wooden railway system which they used for theship building operations back in the early 1900's, but we thought they were just dams along thecreeks.The path isn't a cakewalk even compared to the previous two days, but it does make a rather goodB-line back to Red Rocks, and certainly is a change of scenery. We covered ground quickly. Whenwe got back to the junction, we decided to take the short cut and go down the stairs at McGahey'sBrook to take the beach back to Red Rocks. Now out in the open, did we feel we need rain coats.My Lowe Pro camera bag had a rain cover on it, and my SLR was kept bone dry, which left me veryhappy! Shannon's Mont Bell jacket kept her dry along the way as well, only needing her pack cover out in the open for a hood to finish the trip.We returned to our car by mid afternoon, to ditch our packs in the trunk and to visit the registrationoffice. We chatted up the desk and trail staff, inquiring about the nearly finished trail fromEatonville to the Three Sisters sea stacks. They hope to have it officially open by next year, alongwith a new access point and office for the park at that end as well. Hopefully they will inviteTrailpeak back in the Spring to profile the latest editions to this wonderful park.Looking back, one must give them credit for a well constructed trail system funded by littlegovernment money. They use a variety of surfacing methods given the ground problems facingthem. Bog sections use narrow boardwalk planking, or raised gravel beds. Other areas simply userocks to hop across while letting creeks maintain their natural routes. Signage is very well done inmost places, with distance posts provided when necessary. No regular mile tickers along the way.The scenery is really breathtaking, and worth the physical challenge.Cape Chignecto is a sample of Atlantic Canadian hiking at its best. I compare it in some ways tohiking the Long Range Traverse in Nfld, though not quite as hard on the brain or the body.",
    "directions": "From Parsboro, take Rotue 208 along the coast, and drive until you reach West Advocate. You'll see signage for Cape D'or along the way. It's a nice spur sight seeing trip.When you reach West Advocate, look for Cape Chignecto Provincial Park.",
    "geohash": "f81",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/1930/reg_boxedbeach.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1930/reg_butterfly.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1930/reg_refugee.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1930/reg_seastacks.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1930/reg_tundraregion.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1930/reg_wherewe_reheaded.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1930/topo_capechignecto.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1930/narrow_boardwalk.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/1930/narrow_inland.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/cape-chignecto-provincial-park-near-parrsboro-ns-1930",
    "stats": {
        "Activities": "snowshoe hike",
        "From": "",
        "Seasons": "winter fall summer",
        "Stars": 5,
        "Time": "21 hrs",
        "Total Distance": "50 km",
        "Town": "Parrsboro, NS",
        "Type": "out-and-back"
    },
    "title": "Cape Chignecto Provincial Park",
    "trail_id": "1930"
}