{
    "description": "NTS Map: 082E04Elevation gain: ~1,220 m (4,000 ft). Vimy Peak is that part of Sofa Mountain in  Waterton Lakes National Park that sits directly across the lake from the Waterton townsite. As such, everybody sees it, and the majority of our party this day had wanted to climb it for a long time. My wife came along to take pictures and to keep me out of trouble. More on that later.\r\nThis is a seldom used and poorly maintained trail. It is seldom used because it is on the other side of the lake from where most people tend to be. To get there you must walk or bike in on the Wishbone Trail or boat across either Waterton Lake or Middle Waterton Lake. A few hikers take this trail as well as horse trains (which make up the majority).\r\nWe decided to canoe across the middle lake (First photo with Vimy Peak behind). This half hour trip cuts off 6km of hiking each way. From the east shore it was a short 500m to the trailhead (see trailhead sign photo). \r\nThe first 2km of the trail is very uninspiring - through thick, unmaintained undergrowth (see photo). After you pass an obvious area where horses are tied (so riders can hike up to the 'Lion's Head), the trail improves dramatically. And that's when the wildflowers started to appear - I've never seen so many wildflowers - for the next 2km (see bottom right photo).\r\nAt 4km. the official park trail ends in a large alpine basin. The next 800m is on your own. There is a trail you can follow, or you can go straight up. On the way up to the peak, you get nice views into Crypt Lake. At the top the view is across the lake to the townsite and beyond. Return the way you came.\r\nSpecial note - this part of the park is prime grizzly country. Make lots of noise and let someone know where you are and when to expect you back.\r\nSpecial note 2 - although the Waterton Lakes can be very calm in the morning, they generally aren't in the afternoon. you could run into rough water, you could swamp your canoe, you could spend a half hour in the cold water and you could get the early stages of hypothermia. and we did. Please learn from our mistake. It could have been fatal. Now, about keeping me out of trouble...\r\nNote - the time and distance (return) are taken from the signed junction of the Vimy Peak trail and the Wishbone trail. Elevation gain is about 1,220m (4,000').Photos by Dan Watson, Trevor Helwig and Shelley CoffeyCurrent conditions:\r\n\r\nNote: This is a scramble. Be aware that scrambling can injure or kill you. Be prepared, know your limits and make sure somebody knows where you're going. \r",
    "directions": "There are several ways to approach this trail. First, you can bike in on the Wishbone Trail from the Chief Mountain highway. This is about 6 km (one way) of mostly flat biking with one stream crossing. Second, you can take the boat across the lake to Crypt Landing and take the trail eastward to the Vimy Peak junction. Or third, you can canoe or boat over where we did.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/1935/reg_Vimy-sign.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1935/reg_Vimy1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1935/reg_Vimy2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1935/reg_Vimy3.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1935/reg_Vimy5-MtCrandell.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1935/reg_Vimy6.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1935/reg_VimyPeakWildFlowers.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1935/reg_best1_Vimy4-CryptLake.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/vimy-peak-near-waterton-park-gate-ab-1935",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 3,
        "Time": "7 hrs",
        "Total Distance": "10 km",
        "Town": "Waterton Park Gate, AB",
        "Type": "out-and-back"
    },
    "title": "Vimy Peak",
    "trail_id": "1935"
}