{
    "description": "NTS Map: 082N09Distance is 6 km return, Elev gain is 230 m (750 ft). This trail would be an extension of the Bow Summit Trail in Banff National Park. Even though this stop on the Icefields Parkway can be an exaspirating experience (crowds), if you go a little further than the usual paved interpretive trail, you will be rewarded with exceptional views of the Bow Valley that most tourists could only dream about.From the parking lot, follow the hordes up to the Peyto Lake viewing area, take the obligatory photos, then turn left and head up the hill on the paved trail. At a 3 way junction, take the middle path. As the trail levels off you will pass a signpost (birds, I believe). Straight ahead a gravel road leads off the paved trail. This is your escape route.Follow this old fire lookout road as it switchbacks up the mountain with ever increasing panoramas of the valley below. There are several trails leading off the road to various impromptu viewpoints, but the best is saved for the old lookout spot, at which point your views are south to Bow Lake and beyond, and north past Peyto to the Waterfowl Lakes and beyond.Photos by Shelley CoffeyIn winter please check the local avalanche conditions and bulletins.",
    "directions": "41 km north of Lake Louise junction on Icefields Parkway at Bow Summit.  Parking area is on the west side of the highway, just 5 minutes north of  Num-Ti-Jah Lodge.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/1936/reg_20130707-Bow-Summit-Lookout-Trail-045-42584.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1936/reg_P7035852-Bow-Lake-and-Bow-Peak-from-Bow-Summit-10101.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1936/reg_PeytoLakeoverlook_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1936/narrow_PeytoLakeoverlook2.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/bow-summit-lookout-near-banff-ab-1936",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "6 km",
        "Town": "Banff, AB",
        "Type": "out-and-back"
    },
    "title": "Bow Summit Lookout",
    "trail_id": "1936"
}