{
    "description": "Time and distance are for return trip. Elevation gain is about 550m (1,800').\nThis is another one of Glacier National Park's spectacular hikes. This trail features a bit of everything - lakes, waterfalls, wild flowers (in season), a glacier (of, course) and even a mid-hike shower to cool you off.\nFrom the trail head, the trail follows first Swiftcurrent Lake then Lake Josephine  (common to many treails in the Grinnell Valley). Either part way along, or at the end of Lake Josephine (2 options), there is a signed junction for Grinnell Glacier. The trail to this point is flat. Now starts the long gradual climb to the glacier. Along the way you are rewarded with tremendous views of Grinnell Lake  and Peigan Pass.\nGrinnell Glacier is on the opposite side of the Garden Wall from the Highline Trail. An overlook can be ascended (steep) from that trail (not signed but clearly visible, past Haystack Butte). \nSpend a little time at the glacier, but stay off. Glacier travel is for experts only. \nReturn the way you came or take the cut-off trail (signed, near west end of Lake Josephine) to Grinell Lake.",
    "directions": "Trail head is at the parking area east of the Swiftcurrent Motor Inn (west of the Swiftcurrent Lodge) at the Many Glacier area of Glacier N.P.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/MT/1937/reg_GG1.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/1937/reg_GG2.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/1937/reg_GG3.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/1937/reg_GG4.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/1937/reg_GG5.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/1937/reg_July29040.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/1937/narrow_July29122.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/1937/narrow_July29140.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/1937/narrow_July29222.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/1937/narrow_July29229.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/grinnell-glacier-near-babb-mt-1937",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "6 hrs",
        "Total Distance": "18 km",
        "Town": "Babb, MT",
        "Type": "out-and-back"
    },
    "title": "Grinnell Glacier",
    "trail_id": "1937"
}