{
    "description": "NTS Map: 83D16Elevation Gain: Negligible.Lac Beauvert, when lit up by the sun, lives up well to its English name of 'beautiful green' but the lake is also a beautiful blue. Seen in the early morning calm, with Mount Edith Cavell reflected on the surface the lake becomes mystical, truly one of the gems of Jasper National Park.Trail #4a around Lac Beauvert is actually a combination of trails, sidewalks and paved roads. Much of the area it passes through has been developed by the Jasper Park Lodge with cabins, benches, viewing docks, boat docks (and rentals) and a golf course. Regardless, it is still a great walk. For those who can afford the luxury of Jasper Park Lodge, (http://www.fairmont.com/jasper/)this trail will be right outside your front door, so to speak. For the rest of us it is better to park on the far side of the lake.Leave the undeveloped section of trail for last and hike the lake in the counterclockwise direction. From the parking lot the trail runs between the gated road and the edge of the lake. Some people walk on the road but the trail is the way to go. Rounding the corner of the lake, the trail pops out the trees at a paved golf cart track and little gazebo. Turn right and follow the paved cart track for a short distance, turning left back onto the trail just before the paved road. Continuing along, a second  larger gazebo is soon reached amongst the fairways on the lakes southern peninsula. At this gazebo the trail takes a sharp right retreating from the peninsula. Branching left around a rough timber fence the trail then follows along the shore of the lake before emerging below the cabins and manicured lawns of Jasper Park Lodge. Approaching the main lodge, the trail converts to interlocking stone. Slipping between the boat rental shop and the boat docks the trail passes under the main lodge. The lower door to the Beauvert Promenade (mini shopping mall, restaurants and coffee shop) is just up the hill. Numerous viewing docks line this section of shore, giving unobstructed views across the lake.The sidewalk ends shortly past the main lodge and the dirt trail resumes. The last two 'large' cabins you pass before hiking out on the north peninsula are Point and Outlook Cabins, two of the fanciest at JPL. Point Cabin is supposedly haunted by the ghost of a chamber maid, who took a header down the stairs from the card room, but it'll run you $2000.00+/night for a chance to meet her. Outlook Cabin was host to kings and queens, or at least it used to be. The original Outlook cabin, built in the 1930's, burnt to the ground in Nov 2000. The current Outlook Cabin was reconstructed by Sept 2001 and costs a measly $3000.00+/night. Wrapping around another peninsula, the trail reemerges behind Outlook and Point Cabins, then drops to the shore of the lake. Just before the bridge over the lake's outlet, there is an unmarked trail on the right, it emerges behind cabin 374. The rock weir across the outlet stream was designed to keep the stocked 'sporting' fish in and the 'garbage' native fish out. The park mandate changed over the years and a section of the weir was dismantled to allow the natural flow of species between the river and the lake. Whitefish, which had been poisoned out of the lake, have also been reintroduced to help restore the balance. An interpretive sign displays some of the fish species present in the lake.There is an unnamed connector trail to Trail #7 shortly after the bridge, stay on Trail #4a. The last section of trail is still in its natural state and makes a very enjoyable ending to this beautiful and varied walk.Jasper National Park produces a free day hiking guide called 'Summer Trails' of this and many other trails in the park, it is available at the Jasper Information Centre. Gemtrek produces two maps of the area 'Jasper Up Close' at 1:35,000 and 'Jasper and Maligne Lake' at 1:100,000. The Government topo 83 D/16 Jasper at 1:50,000 shows the area as well but rare is the trail that is correctly plotted on this map.Submitted by 'mtncat'.",
    "directions": "The parking lot is 3km from the town of Jasper. Exit the town on Hazel Street and cross the railroad tracks, the only level crossing of the tracks in town. Go straight and cross Hwy 16, then turn left on the Old Fort Point Road. The Old Fort Point Road crosses the river, passes through the parking lot at Old Fort Point and continues to parking lot on the shores of Lac Beauvert. This is a seasonal road, open from May to Oct. For the rest of the year, drive east of Jasper on Hwy 16 for 2km and turn right on the Maligne Lake Road. Cross the bridge over the Athabasca River and turn right on the Lodge Road. Follow the Lodge Road to the grounds of JPL and park in the main visitor parking lot. Continue down the Lodge Road on foot and deke behind the main lodge to the shore of the lake near the boat docks.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/1941/reg_BeauvertandtheColinRange.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1941/reg_BeauvertandtheVictoriaCrossRange.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/lac-beauvert-near-jasper-ab-1941",
    "stats": {
        "Activities": "hike mtn-bike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "4 km",
        "Town": "Jasper, AB",
        "Type": "out-and-back"
    },
    "title": "Lac Beauvert",
    "trail_id": "1941"
}