{
    "description": "Le lac Kénogami borde la randonnée sur 45 km de long. Vous aurez l'occasion de vous y trempez les pieds à chaques camping. IL est possible de le faire en refuge, pour un très bon rapport qualité prix, ou en camping. Fait assez particulier il y a des lean-to à chaque site de camping, qui peuvent acceuillir 4 personnes comfortablement.\r\n\r\nLe terrain est très accidenté et les montées sont nombreuses et abruptes, ce qui rend ce site très intéressant pour un randonneur intermédiaire. Au km 18 on traverse la rivière Pikauba en nacèle auto-tractée sur une distance de 101m. Le sentier est bien ponctué de belvédère, et un entre autres, le cap à l'aigle, est très impressionant. La tour du mont Lac-Vert marque la fin ou le début du périple et nous laisse appercevoir le Lac St-Jean, l'accès se fait par les pistes facile. Tout près du sommet il y a des talles de bleuets et de framboises délicieuses. \r\n\r\nLes chiens sont permis sur les sites de camping.\r\n\r\nPour plus d'info\r\nKénogami\r\n\r\n\r\n\r",
    "directions": "De la 175 nord prendre la 169 vers hébertville. À la station d'essence en sortant du parc des Laurentides prendre à droite et continuer jusqu'au mont Lac Vert environs 5 km plus loin.",
    "geohash": null,
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/QC/1942/reg_best1_knogami019JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/1942/reg_keno02jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/1942/reg_kenogami04JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/1942/reg_knogami011JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/1942/reg_knogami012JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/1942/reg_knogami09JPG.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/lac-kenogami-near-chicoutimi-pq-1942",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 4,
        "Time": "21 hrs",
        "Total Distance": "45 km",
        "Town": "Chicoutimi, PQ",
        "Type": "out-and-back"
    },
    "title": "Lac Kénogami",
    "trail_id": "1942"
}