{
    "description": "One thing for a kayaker that makes for a huge attraction is having a destination; a place to go! With PEI's bays and sand spits, you'll find a few of interest, especially along the north shore. \nNew London Bay is a popular body of water shared by commercial fishers, jet and power boaters, wind surfers and even a parasail operation. Kayaks are rented in the area, and of course people like us, bring our own.\nAround 4K off the warf, is a sand spit. It's around 200 meters wide, and around 4.5 K long. Beyond that is open water to the North. The dunes there are accessible from Cavendish, so the area isn't all that isolated. We took a Friday afternoon to visit the area. My wife took the day off to get her weekend started early, and the weather was perfect for a combination of a summer beach outing and great sea kayaking.\nWe left the warf at Stanley Bridge, and headed out. The wind was moderate (20K) and the chop was  fun for a bow rinse. In the distance, a parasail outfit was cruising the bay. A powerboat essentially tows a parachute on a wench. Sixty five dollars gets you a ride with a view. High and dry!\nIn less than an hour, we were pulling our kayaks up past the high tide mark, and unpacking our things. This place offers the whole package. You could even camp there if you pitch high up enough from the high tide zone. I wanted to explore the dune hills and we both wanted to cool off with a swim. The water is cooler on the opposite side, but still not cold enough to resist diving right in.\nAfter a swim, we strolled the spit to explore the area. Returning, we rolled out the towels and soaked up the sun and ate a snack. Time was getting on, and the water was prime for practicing a roll.\nAfter drying off, it was time to head back. We packed everything up and drew our paddles. The water was calmer, and the return speedy.\nThis trip can be an afternoon run, or an all day plus affair. The highlight being the time spent on the beach because the paddling is fairly easy. Be mindful of the weather, because the winds can make headway nearly impossible. \nshannon Burt",
    "directions": "From Charlottetown, take Route 2 toward Hunter River. Take Route 6 at the intersection, and connect to Route 224 which takes you to Stanley Bridge. \nLook for the government warf to launch your kayak. Free parking is designated.",
    "geohash": "f86b",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/PE/1946/reg_crusingoutjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/1946/reg_moredunesjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/1946/reg_postsjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/1946/reg_sandnadgrassjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/1946/reg_todunesjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/1946/topo_newlondonjpg.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/new-london-bay-near--1946",
    "stats": {
        "Activities": "river-canoe sea-kayak",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 5,
        "Time": "3 hrs",
        "Total Distance": "9 km",
        "Town": "",
        "Type": "out-and-back"
    },
    "title": "New London Bay",
    "trail_id": "1946"
}