{
    "description": "In Wells Grey Provincial Park, Helmcken Falls Rim Trail takes the hiker along the eastside of the Helmcken Canyon and provides a spectacular view of the famous Helmcken Falls.  The trail is located on the side of the main road into Wells Grey Park, just east of the Pyramid Campground intersection.  This easy trail begins by closely following the Murtle River through the lush forest for 3.5km.  It is a good idea to carry plenty of insect repellent.  Climbing over fallen trees is required.  You will realize when the falls are near as the river begins to become more rapid and narrower.  As you begin to see and hear the falls, suddenly the canyon comes to sight with the falls at the start.  Use caution on the canyon portion of the trail because there are no barriers to keep hikers from falling.  Some parts of the trail are extremely close to the edge of the canyon.  However, the view is one of the most spectacular views in the park, with little traffic from tourists, unlike the vehicle access of the Westside viewpoint.  The trail ends halfway along the canyon's rim.  This trail is by far the best in Wells Grey Park and recommended for the novice to advanced hiker.  Be sure to review the rules with staying and hiking in the Park.",
    "directions": "At Clearwater BC, turn left/right off Hwy 5 (Yellow Head) on to Wells Grey Road located at the visitors' info centre.  Follow the main road into Wells Grey Provincial Park.  Watch the signs on the side of the road for trail access points off the main road.  The trailhead is located approximately 42km from Clearwater, off to the side of the main road just before the Pyramid Campground intersection.  Park your vehicle in the parking lot provided.  Follow the signs to the trailhead.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/1955/reg_west066jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1955/topo_helmckenstevejpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1955/narrow_Helmcken-Falls-Rim-Trail-2-KQ-19243.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1955/narrow_Helmcken-Falls-from-the-Rim-Trail-KQ-19243.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1955/narrow_Helmcken-Rim-Trail-KQ-19243.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1955/narrow_Helmckenfalls1jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1955/narrow_west060jpg.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/helmcken-falls-rim-near-clearwater-bc-1955",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "4 km",
        "Town": "Clearwater, BC",
        "Type": "out-and-back"
    },
    "title": "Helmcken Falls Rim",
    "trail_id": "1955"
}