{
    "description": "NTS Map: 083D09Elevation Gain: 370 m (1,200 ft). No Dogs: The Cavell Meadows has been identified as critical Woodland Caribou habitat, a threatened Species-at-Risk in Canada. In an attempt to reduce stressors on this disappearing icon of the Canadian wilderness, Parks Canada has banned dogs from all Caribou habitat in Jasper National Park. The Cavell Meadows trail in Jasper National Park saw many years of hiking pressure with little in the way of maintenance. The trail suffered from this neglect but fortunately it did not go unnoticed. The Friends of Jasper National Park spearheaded a three year trail restoration project. Now completed, the Cavell Meadows still need the help of  hikers like you to ensure that all that hard work is not undone, please tread lightly.The Cavell Meadows are a flower lovers dream come true. During the peak season, from mid-July to mid-August, the meadows are ablaze with a cornucopia of colour. Botanists say that certain communities of flowers can be found growing together nowhere else in the Canadian Rockies. Add stunning scenery and raw mountain power to the mix and the Cavell Meadows become a magnet to hikers from around the world, making this trail a very busy place.From its junction along the Path of the Glacier Loop (which has already been described and should definitely be added to this hike) the trail climbs over the lateral moraine of the ancient Cavell glacier with a few quick switchbacks. It then runs between the forest and the moraine giving hikers a chance to enjoy some flowers before entering the trees and climbing a series of switchbacks. At 2km the upper subalpine is reached and the trees begin to thin out. A short distance later the junction for the upper loop is reached. Turning left will get you up faster but if you're out of breath at this point, you'll probably want to continue straight ahead for easier grades and good viewpoints.  After gaining a total of 400m elevation, the trail turns downhill and closes the loop. Some of the best flower displays are along the steep section of the loop and it is easy to spend hours studying the flowers with the help of a good guide book. With the restoration project came a new extension to the official trail. From the top of the upper loop, a spur trail now pushes up a ridge above the meadows, another 500m distance and 100m of elevation. The high rocky ridge overlooking the meadows is a superb viewpoint but intrepid souls with no fear of steep terrain can gain the minor summit beyond trails end.Parks Canada produces a day hiking guide of this and many other trails in the park called \"Summer Trails\" which is available for free from the Jasper Information Centre. For map lovers there is the government topo 83 D/9 Amethyst Lakes (trail incorrectly plotted) and the Gemtrek 'Jasper and Maligne Lake'. These maps are available from The Friends of Jasper.  Please Note: In order to protect this fragile environment and all the hard work that went into the restoration project, Parks Canada has been closing this trail till early summer when it is dry and ready for hiking.Submitted by 'mtncat'.In winter please check the local avalanche conditions.",
    "directions": "Drive south of Jasper on the Icefields Parkway (Hwy 93), past the park gate at 7km turn right on 93a. Follow 93a for 5.5km and turn right on the Edith Cavell Road. Drive 15km to the parking lot at the end of the road. The Edith Cavell Hostel (www.hihostels.ca) near road's end is the only overnight accommodation near the mountain. Please Note: The Edith Cavell Road is a seasonal road and does not open till late June, then closes in late-September or early-October when the snow flies. The road is narrow, has a number of switchbacks and is 'full of potholes'. Drive defensively.",
    "geohash": "c3k5",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/1961/reg_AngelandCavellGlaciers.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1961/reg_DSC01487-11997.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1961/reg_DSC01492-11997.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1961/reg_DSC01501-11997.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1961/reg_Edith-Cavell-2008-006-15110.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1961/reg_Edith-Cavell-2008-012-15110.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1961/reg_Edith-Cavell-2008-016-15110.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1961/reg_Edith-Cavell-2008-030-15110.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1961/reg_Edith-Cavell-2008-039-15110.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1961/reg_IMG-0126-12322.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1961/reg_IMG-1381-11997.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1961/reg_IMG-1382-11997_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1961/reg_IMG-1383-11997_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1961/reg_MossCampion.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1961/reg_MountainMeadowCinqfoil.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1961/reg_map.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1961/reg_n517557190-1506055-9932-19858.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1961/narrow_Head-shapedLousewort.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1961/narrow_n510104249-981847-1086-19858.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/cavell-meadows-near-jasper-ab-1961",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 5,
        "Time": "3 hrs",
        "Total Distance": "8 km",
        "Town": "Jasper, AB",
        "Type": "out-and-back"
    },
    "title": "Cavell Meadows",
    "trail_id": "1961"
}