{
    "description": "NTS Map: 083E01Celestine Lake in Jasper National Park used to be the shortest trail to a backcountry campground in the park. Due to structural deficiencies of the Snake Indian River bridge, this is no longer the case. Other changes include the removal of the kitchen shelter and the boat dock from the campground.From the parking lot go past the locked gate and down the old road to the Snake Indian River bridge at 500m. After the bridge the old road begins a long climb, passes the Moosehorn Trail at 2km and reaches the old parking lot for Celestine Lake and the North Boundary Trail at 5km. Turn right at the old parking lot and pass Princess Lake at 6.5km. The beavers at Princess Lake are very industrious and the last time I visited the old road was under 10cm of water. At 7km turn left off the old road (that continues to  Devona Lookout) and enter the campground. The Celestine Lake c/g has 8 tent pads, food lockers, fire pits and a privy. Registration required for overnight trips, fees apply, call the Jasper Trail Office at 1-780-852-6177. While the lake was once home to rainbow trout they must have died out. The only fish I caught in the lake was some kind of perch hybrid, a National Park fishing permit is required. Map choices include the Government topo 83 E/1 Snaring River @ 1:50,000 or Gemtrek's 'Jasper and Maligne Lake' @ 1:100,000, both are available from the The Friends of Jasper.Submitted by 'mtncat'.",
    "directions": "Drive east of Jasper on Hwy16 for 8km and turn left on the Snaring Road. Follow the Snaring Road for 6km to the end of pavement. Follow the non-gated fire road called the Celestine Lake Road another 8km to the stop sign where the it turns into an alternating one way road. When the time is right follow the road another 14km to the parking lot at roads end.Celestine Lake RoadOpen May through SeptemberHours in: 8-9, 11-12, 14-15 & 17-18hrsHours out: 9:30-10:30, 12:30-13:30, 15:30-16:30 & 19:30-20:30hrsPlease Note: The Celestine lake road is a narrow, winding and very rough track. Leave the sports car at home. At one point, as the road wraps around the base of Mt Greenock, you are driving along the edge of a cliff with no guard rail. The person in the passenger seat will no doubt be very nervous, use caution.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/1962/reg_map.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/celestine-lake-near-jasper-ab-1962",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 2,
        "Time": "16 hrs",
        "Total Distance": "14 km",
        "Town": "Jasper, AB",
        "Type": "out-and-back"
    },
    "title": "Celestine Lake",
    "trail_id": "1962"
}