{
    "description": "In Jasper National Park visitors have the rare opportunity to hike on the surface of a glacier, the Athabasca Glacier. The Athabasca is just one of the glaciers pouring off the Columbia Icefield, the largest icefield south of the 60th parallel. Buried under the Columbia Icefield is a mountain called The Snowdome which is the hyrographic apex of North America, meaning that water from its summit can flow to three different directions to three different oceans.For all intense and purposes hiking on a glacier is very dangerous and should only be undertaken by experience mountaineers with the proper training and equipment. Anyone planning to walk on this glacier is well advised to join an experienced guide and do it safely http://www.icewalks.com/. Or ride the buses that cruise on the surface of the glacier. http://www.brewster.ca/Columbia_Icefield/facts_snocoachpricing.aspWhile the trail to the toe of the Athabasca Glacier is a short 600m, it is steep and not for everyone. Otherwise this trail is very straight forward, simply follow the hoards of humanity streaming up the 3m wide super trail. After climbing over the rocky ridge, ropes line the trail and signs warn you of the dangers of walking on the glacier. The trail runs along the edge of the glacier before looping back to the to the rocky ridge.In the past it was possible to walk on the ice, but like all glaciers in the Canadian Rockies global warming is causing rapid melt and constant change. In the summer of 2007 the creek that drains the glacier changed direction and formed a lake under the toe of the glacier. By late summer crevasses began to open and the glacier began collapsing into the lake. For this reason it is now incredibly dangerous to access the ice from this trail. Walk on the glacier and you?re on your own, and a step closer to joining the list of tourists who have perished in the Athabasca Glacier?s icy death grip. KEEP YOUR CHILDREN CLOSE.Submitted by 'mtncat'.(Editor's note - to the best of my knowledge, there has never been a successful crevasse rescue at the Athabasca Glacier. Obey the signs.)In winter please check the local avalanche conditions and bulletins.",
    "directions": "Drive south from the town of Jasper on the Icefields Parkway (Hwy 93) for 103km, turn right in front of the Columbia Icefield Chalet then right again on the road to the glacier. The parking lot is 500m down the road to the glacier. If the gate on the road to the glacier is closed then it is not safe to visit the glacier. At these times the glacier is snow covered and the crevasses and millwells lie hidden beneath the snow.",
    "geohash": "c3k9h2",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/1964/reg_AthabascaGlacierToe.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1964/reg_AthabascaGlacierfromparkinglotatIcefieldCentre.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1964/narrow_AthabascaGlacier1994.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1964/narrow_AthabascaGlaciermeltwaterchannel.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1964/narrow_AthabascaGlacierwarningsigns.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/athabasca-glacier-near-jasper-ab-1964",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 5,
        "Time": "1 hrs",
        "Total Distance": "1 km",
        "Town": "Jasper, AB",
        "Type": "out-and-back"
    },
    "title": "Athabasca Glacier",
    "trail_id": "1964"
}