{
    "description": "NTS Map:92B5.  This is a 4.3km(ONE WAY)trail that follows old logging trails for the most part to one of the last fire towers of its kind (built in 1951) on Vancouver Island.  Being a fire tower, one can expect to see great distances on a clear day.  The fire tower is accessible to the public; however, people are requested to pack out their garbage.\r\n\r\nThe parking lot is open from 8 am to 6 pm and the Sea to Sea Green Blue Belt Regional Park Reserve is open Sunrise to Sunset. \r\n\r\nThe trail is all uphill (4.3 km) and most of it is not shown on the current issues of 1:50 000 92B/5 Sooke Topographic Map.  The GPS trail included with this Trail has been tested and is accurate.\r\n\r\nFrom the parking lot, Follow the Sooke Mountain Park Road Northerly to 10 U 450313 5361887 where you bear to the right and continue following the main trail.  During this leg, the trail has a moderate incline and is a wide gravel road.\r\n\r\nProceed to 10 U 450112 5362264 where you bear NE.  The trail will start to narrow and become rough with washouts and loose stones.\r\n\r\nAt 10 U 450262 5362514 the bridge is washed out but there are a couple of sturdy logs to cross the small ravine.  This part of the trail is in the trees and shaded. From this point the direction is Easterly. Until you reach a second wash at 10 U 450633 5362535 with a short bay pass to the right side of the trail.  The trail begins to get quite steep and narrows at this point.  It is still heavily treed.  Continue on this trail to an intersection at 10 U 451223 5362653.\r\n\r\nAt this point you will see the beginning of a foot path on your left.  Leave the main trail and follow the foot path northerly to the Fire Tower.  This trail is very steep but no climbing tools are needed other than a good walking stick.  Through the final 700 m to the summit there are small clearings from time to time but approximately each 100 m you will re-enter a treed area which will provide well deserved shady rest areas.  The path is easily followed.  Ribbons and stacked stones help guide the way..\r\n\r\nI should note that there is little water in the summer months and is very dry but in the rainy season or after a heavy rain, the trail will carry running water and be quite slippery with several boggy areas.\r",
    "directions": "Hwy 14 towards Sooke.  In Saseenos turn North on Harbour View and follow to end.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/1970/image-50122.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1970/reg_IMG-1682-7279.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1970/reg_IMG-1684-7279.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1970/reg_quimper-18988.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mount-manuel-quimper-near-victoria-bc-1970",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "4 hrs",
        "Total Distance": "8 km",
        "Town": "Victoria, BC",
        "Type": "out-and-back"
    },
    "title": "Mount Manuel Quimper",
    "trail_id": "1970"
}