{
    "description": "NTS Map:92F13.  If you enjoy fantastic mountain views and don't mind a steep trail then this is for you.  The trail is steep but the views of Kings Peak, Elkhorn Mountain and others make up for it.  From bottom to top it will take about 3 hours, 2.5 hours of that is steep grunt through old growth forest and the last half hour is on flatter ground to the peak.  The trail is easy to follow since it is worn in.  The trail is physically demanding due to the steepness but is non-technical and no scrambling is required.  The trail length is about 5 km one way with an elevation change of 1300 meters.\r\n\r\nThe trail starts at the end of the parking lot.  In a few minutes you go over a wooden bridge.  In about 30 minutes you will reach a nice log crossing over a flowing creek.  Fill up with water here because this will be your last chance until you get up to the top.  In about 1.5 hours you will begin to catch glimpses of the mighty peaks behind with the thinning of the trees.  Don't bother taking any pictures here because the views are even better at the top.  In about 30 minutes you will reach the end of the steepness with great views of the peaks.  To your right is a nice rock bluff.  If you don't feel like going any further this is a great place to enjoy the views and in fact the views are a tad better here on the bluffs then on the peak itself.  If you must set your hiking boot on the peak then follow the trail to the pond and head to the left around the pond keeping to the trail right beside the water.  About half way down the length of the pond look for flagging and cairns to your left.  This trail will take you to the peak.  From here on follow the flagging and cairns and you will be on top in about 15 minutes.  Look for the repeater tower that is on top.  If you have no fear, coming down the trail can be done in about 2 hours, or in the same time as going up if you are not so sure footed.  Hiking poles are great for both going up and down.  Enjoy.\r",
    "directions": "To get to the trail head follow highway 28 to Gold River, about 20 minutes past Buttle Lake campground on the right you will see the well marked trail head for Crest Mountain.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/1975/long_DSC07612-62946.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1975/reg_CreamLakeAug1718001jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1975/reg_Crest3.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1975/reg_CrestMountainSept2405001jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1975/reg_IMG-4549-33605.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1975/reg_IMG-4567-33605.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1975/reg_crest1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1975/topo_crest6.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1975/narrow_Crest2.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/crest-mountain-trail-near-campbell-river-bc-1975",
    "stats": {
        "Activities": "snowshoe hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "5 hrs",
        "Total Distance": "10 km",
        "Town": "Campbell River, BC",
        "Type": "out-and-back"
    },
    "title": "Crest Mountain Trail",
    "trail_id": "1975"
}