{
    "description": "NTS Map:92F2.  This is an awesome 6 km loop route to Mt. Cokely (1631 meters) following the saddle route up and the Rousseau trail back.  After 30 minutes in the trees you will be presented with great views of the Port Alberni Valley behind you with beautiful peaks in the background.  From Mt. Cokely you will get 360 views of the Coast Mountains, Straight of Georgia and Mt. Arrowsmith (1819 meters).  On the way back you will follow a ridge with more beautiful views.  The entire hike can take 4 hours or longer if you decide to enjoy yourself.  The first 30 minutes and last 30 minutes are in the trees.  This is a fantastic hike and well worth the effort.\r\n\r\nFrom the parking area the trail begins just in front of the concrete blocks.  Follow this trail and in a little while you will cross a creek bed, you will make a quick right.  Follow this trail all the way until you reach the forest and look for flagging on your right.  Once you are you here you will begin the climb up to the saddle.  Some parts may be steep but just keep heading up to the saddle.  Once you clear the forest, look back and enjoy the views.  In about an hour you will be at the saddle, to your left you will see a radio tower on top of a mountain, this Mt Cokely.  The steep rock section to your left is your way up.  This will require all fours at this point, just pick your route carefully and you will be fine.  Remember you will not be coming down this way.  Once at the top of the rock scramble, enjoy the views of Mt Arrowsmith and the surrounding areas.  In roughly 30 minutes you will be on the top of Mt Cokely.  Follow the well marked path to Mt Cokely.  Once there, sit back and relax.  Now on the return retrace your steps all the way to the rock scramble up from the saddle and head along the ridge towards Port Alberni.  Follow the rock cairns and flagging.  In about 30 minutes you will be forced to go down the ridge and back up, when you are heading back up head towards the right and you will see that path, a bit of rock scrambling is needed here.  In about 10 minutes from this point the trail heads steeply downwards, follow it and stay near the base of the cliff at all times, avoid any trails that head downwards.  In about 30 minutes the trail will head downwards, follow this trail all the way out to old logging road, you will some garbage here, make a right here.  Follow this to the main logging road and make a left.  In 5 minutes you will be at your car.  Hope you have fun!\r",
    "directions": "Follow highway 4 out to Port Alberni, at the top of the bump before Port Alberni you will see a sign for Arrowsmith Ski Hill sign, make a left here.  In about 30 minutes you will be at the trail head, watch for logging trucks.  Drive about 3 km and then turn left on Cameron River Main. Drive about 8 km to the Pass Main turn left. You will drive about 7km up the mountain and then park on the side of the road on a large bend with large concrete blocks, the first concrete block has a toilet paper dispenser!  Remember on the way back, you will come to a fork in the road, you want to make a right here.  The road condition at the time was a bit rough but nothing most cars couldn't  handle (assuming you don't mind roughing your car a bit) and all car based SUVs.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/1976/long_Coke1a.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1976/long_Coke2a.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1976/long_coke5a.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/1976/topo_coke4a.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mt-cokely-near-port-alberni-bc-1976",
    "stats": {
        "Activities": "snowshoe hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "4 hrs",
        "Total Distance": "6 km",
        "Town": "Port Alberni, BC",
        "Type": "out-and-back"
    },
    "title": "Mt. Cokely",
    "trail_id": "1976"
}