{
    "description": "Cap Alright Trail (7 K return)\r\n\r\nAfter two days of kayaking, we decided to take a break from the paddle, and don our boots to see the things from higher ground. The region of Cape Alright is on the South coast, and offers a mix of coastal beach walk, some climbing, and meadow traversing. This excursion gives one a definite feel for what the archipelago is uniquely about.\r\n\r\nUpon reaching the automated lighthouse at Cap Alright, we found a roped path that took us down to the beach. On our left were jagged red cliffs, and to our right, waves rolling onto a sandy shore.\r\n\r\nWe headed to a spot where outcropped salt crystals formed a partial barrier on the beach. Beyond that was the \"Green Plate\" locally named for the turf-topped bit of rock which had sunken down from the hill tops, probably by erosion. That was our destination for departing from the beach. Thirty feet or so before ascending to the grass would be loose scree climbing. It was somewhat dangerous but not utterly detrimental if one slipped. Off in the distance, we noticed a coast guard ship seemingly watching our climb. I suppose if he was noting our route, he would be the first to respond to a potential state of distress. I was thinking it was either that, or he was proceeding to write up a fine for climbing the cliff!\r\n\r\nReaching the top, we were struck with the meandering hills upon hills and the bird's eye views of Anse a Firmin, Cap Alright, and Cap Adele. Beyond these, the lagoon and the South Dune stretching out toward Grand Entree Island. What a vista.\r\n\r\nThere really isn't much of a trail. Occasionally there would be trampled grass indicating several others had walked the same route, or cow paths. Some of the land is privately owned, and is also farm land. Low strung electrical fences divide the territory, but crossing them was easy. Watch for sunken pits, where I'm guessing the ground has given away like sink holes from sub-terrainian erosion. Also, do not venture too close to the cliff edges due to their unstable ground.\r\n\r\nWe made it to the peak of a hill that marked Butte Pelees and Cap Adele. By the time we veered away from the cliff edges, I swear the coast guard ship lost interest and had moved on.\r\n\r\nOur return was a bit shorter in that we didn't return by the beach. We opted for a road to avoid private homes near the end. I don't know how much of the trek was on private land, but seeing that this route was both recommended by a local, as well as written up in a travel guide, I'll consider it safe to walk and share with others. Maybe look out for cows, and avoid going right up to people's homes!\r\n\r\nSome attractions while on your way to, as well as on the trail include a keyhole rock formation at Cap Alright, the beach itself, the big hill at Cap Alright park, and the raw milk cheese factory near by.",
    "directions": "Going from Cap aux Meules, take route 199 and head toward Ile du Havre-aux-Maisons. Reaching the island, take Ch. de la Pointe Basse, which turns into Ch. des Echoueries which is where Cap Alright is situated.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/QC/1981/long_cap_alright.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/1981/reg_beachwalk.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/1981/reg_climbing.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/1981/reg_meadows.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/1981/topo_capalright.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/cap-alright-near-iles-de-la-madeleine-pq-1981",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "7 km",
        "Town": "Iles-de-la-Madeleine, PQ",
        "Type": "out-and-back"
    },
    "title": "Cap Alright",
    "trail_id": "1981"
}