{
    "description": "NTS Map: 082J10Elevation Gain: 240 m (787 ft). This was a great ride, it had everything, great scenery, riding along under imposing face of Gibraltar Mountain, passing an outfitters covered wagon on an outing, finding an old range riders cabin back in the trees and unrelated to the trail, great 25C weather.  You'll also find a description of it in Eastcott's book \"Backcountry Biking in the Canadian Rockies\".The trail is in & out on the same trail, although it can be combined with one of many other trails in the area for an ironman loop.  About 12km in there is a T that connects to the Mist Creek trail and has a map of the area.  It is an old forestry road so is generally doubletrack with reasonable drainage, but you will find some mud puddles.  Generally uphill going in as you can see, but rideable all the way by just about everyone.  The starting grade of about 11% in the first 50m is some of the toughest.  Many of the creeks are rideable except the first ford of the sheep about 6km in is to your knees even in late August.  A further ford is beside a series of small waterfalls with deep pools you can clean the mud off on your way back.If I had to say something negative about this trail, I could have done with a few less creek crossings; you'll find about 8-10 each way.  There is also a fair amount of cobble in sections of the trail and my shoulders feel it today.We rode as far as the cabin, about 13km in and that gave us about 240m of net elevation gain, although you could easily go further in a day.  It is a 80/20 ride for most of us (80+% of the time is spent going up, 20% down) so you can go up till you're dead and still make it back comfortably.  Alternately, it looks like you could ride in with a sleeping bag and some food and stay at the cabin.  Not the Ritz, but how often do you get to stay in an authentic cowboy cabin?We passed a small herd of 6 bighorn sheep crossing the highway as we approached the Junction Creek parking area.  They were taking their time crossing the road and didn't care we were within 10' of them (fortunately in a truck).  Closer to Turner Valley we also had an interesting view of a coyote nearly bringing down a young deer/fawn.  I saw some flash of brown & white going down in a tangle at the fence line so I slowed down to see what it was.  As I got a little closer, a young deer, still with some spots gets up out of the underbrush and tears across the road with a pretty good limp.  I had to brake very hard to a stop and the deer was within 2-3' of the front of my truck.  As we stood staring dumbly at what we just saw, I looked back to the left and saw a very big, healthy coyote looking longingly after the fawn.  I think he could literally taste her, probably having bit the deer's leg before being scared off by my truck.",
    "directions": "To get there, drive 38.5 km West of the 4 way stop in Turner Valley to the Junction Creek parking lot (past Blue Rock / Indian Oils areas).  The trail starts at a gated road in the NW corner of the lot and is easy to find.Thanks to trailpeak user sdecaire for the great pix!!",
    "geohash": "c2yr",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/1983/long_profilejpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1983/reg_DSC01867-27394.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1983/reg_DSC01873-27394.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1983/reg_cabin1jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1983/reg_cabin2jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1983/reg_trail1jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1983/reg_wagonjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1983/topo_planJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1983/narrow_DSC01862-27394_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1983/narrow_DSC01880-27394.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/1983/narrow_DSCF1666-11674.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/sheep-trail-near-kananaskis-ab-1983",
    "stats": {
        "Activities": "snowshoe hike mtn-bike",
        "From": "",
        "Seasons": "winter fall summer",
        "Stars": 4,
        "Time": "5 hrs",
        "Total Distance": "26 km",
        "Town": "Kananaskis, AB",
        "Type": "out-and-back"
    },
    "title": "Sheep Trail",
    "trail_id": "1983"
}