{
    "description": "The Belle Anse stretch of coast line is one of \r\nthe most popular and beautiful areas for  sea \r\nkayaking. No wonder many commercial tours \r\ncenter around its waters. Attracted to the sea \r\ncaves and several beach launch sites, this is a \r\nfairly safe region to paddle, given calm wind \r\nand wave conditions. Other big attractions \r\ninclude an old barge, as well as an Island in \r\nthe same area. Our lunch stop and wrap up \r\nfinished at white sandy beaches.\r\n\r\nWe had a great place to park our car and \r\nlaunch behind a set of break waters around \r\nAnse de l'Etang du Nord. Fanny, from \r\n Vert et \r\nMer, (the people who route \r\nplanned for us) would shuttle our car to \r\nFatima, \r\nnear \r\nCap L'Hopital. \r\n\r\nOur first attraction could be right around \r\nthe \r\ncorner from the break water. Ten years ago, \r\na two barges were being towed by a tug \r\nduring a storm. One was taking on water, \r\nand being too close to shore, and too heavy \r\nto drag, had to be cut loose. It grounded \r\nnear the shore on private land. The other, \r\nlanded further North on crown land. \r\nConsequently, the Government paid for the \r\nremoval of the later, leaving the former; the \r\nbarge grounded here at cap Brillant, to be \r\ndealt with at the expense of the land owner. \r\nNeedless to say, the barge still stands.\r\n\r\nAlthough this sounds like a tragic story, \r\nthe \r\nbarge has since turned red, no doubt with \r\nrust, and now lends itself to the surrounding \r\nalthough contrasting organic landscape. It \r\nserves as a huge attraction for kayakers and \r\nland-lovers alike to come visit the area.\r\nWe were told not to paddle too close, as the \r\nvessel can potentially shift. In its front, you \r\ncan see gaps in the hull, probably large \r\nenough to paddle in through.\r\nAfter exploring the barge, we were drawn to \r\na small island called Ile aux Goelands. \r\nBecause there were no winds at the time, we \r\ncould paddle around it, \"sans aroma\" from \r\nbird scat. These little islands lend themselves \r\nto cormorant and other winged habitation.\r\n\r\nAs we headed North, we began to see \r\nthe red \r\ncliffs emerge, with ever bigger holes being \r\nrevealed.  by the time re rounded Pointe \r\nHerrissee, the caves were large enough to \r\nexplore. We donned our headset lamps with \r\nhopes of seeing what lay inside. No doubt \r\ndue to mid day sun, our eyes simply couldn't \r\nadjust to what our lamps revealed. It was a \r\ngood idea, in theory anyway.\r\n\r\nBy the time we finished a beach snack, \r\n(what \r\nan undignified landing that was!) and passed \r\nCap au Trou, the water turned rougher, \r\nallowing us only to spot caves, but we dare \r\nnot venture in. Swells would potentially \r\nsweep us against the rocks with out let up. \r\nWe saw waves crashing against the rocks \r\nwhich gave us ample warning.\r\n\r\nWe finally rounded Cap l'Hopital to find \r\ncalmer waters, and with the swells now at \r\nour backs, had a mild but fun surf ride into \r\nthe beach. The water was crystal clear and \r\nwarm! It was so cool to watch shannon \r\nsurfing a wave by carving a rudder turn with \r\nher paddle. Mucho style points for her!\r\n\r\nThis is a really nice route to paddle in \r\nthe \r\nvariety is has to offer. Caves, sea stacks, a \r\nsmall island, grounded barge wreck, \r\nbeaches, rich green turf topping a \r\ncontrasting red rock cliffs. All in around 3-4 \r\nhours of paddling at an explorer's pace.\r\n\r\nShannon Burt\r\neast coast editor for \r\nTrailpeak.com",
    "directions": "Leaving Cap aux Meules, take the 199 \r\nSouth, \r\nand turn onto Chemin de L'Etang du \r\nNord. \r\nLook for Ch. Delaney and launch frm \r\nthere.",
    "geohash": "f87v",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/QC/1986/long_wideexpansesmallJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/1986/reg_barge2smallJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/1986/reg_belleansemap.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/1986/reg_crashsmallJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/1986/reg_incave3smallJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/1986/reg_majorcolorsmallJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/1986/topo_perspectivesmallJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/1986/narrow_keyholesmallJPG.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/belle-anse-madeleine-islands-near-iles-de-la-madeleine-pq-1986",
    "stats": {
        "Activities": "sea-kayak",
        "From": "",
        "Seasons": "summer",
        "Stars": 5,
        "Time": "4 hrs",
        "Total Distance": "13 km",
        "Town": "Iles-de-la-Madeleine, PQ",
        "Type": "out-and-back"
    },
    "title": "Belle Anse, Madeleine Islands",
    "trail_id": "1986"
}