{
    "description": "We planned this, our first kayaking trip \r\nin the Madeleine Islands, through \r\n\r\nVert et \r\nMer\r\nthe very same morning.  \r\nDue to changing weather conditions, one \r\nmust always be flexible. The great thing \r\nabout paddling here is that in most cases, \r\nthere is always a location suitable for \r\npaddling of one kind or another.\r\n\r\nWe parked near the campground, and \r\nunloaded our gear. One of the staff from Vert \r\net Mer would shuttle our car to the take out \r\nnear fatima. What a great convenience that \r\nwas, saving us from having to paddle loop \r\ntrips. \r\n\r\nWith our plan in place, we set out on the \r\nwater. Just around the first corner at Cap \r\nRouge, we hit beautiful sea caves, carved out \r\nof the red sand stone. Some were simply \r\nhollowed out caves, while others you could \r\npaddle around and come out somewhere \r\nelse. So right off the bat, this route gave \r\ninstant gratification!\r\n\r\nThe sounds of the waves inside the caves is \r\nremarkable. The crashes seem to be \r\namplified by the walls and curved hollowed \r\nsections. They also call these caves \r\namphitheaters, and judging by the sounds, I \r\nunderstand why. \r\n\r\nSea stacks are also prevalent on this side, \r\nand was also the site of a photogenic keyhole \r\nlocally named Elephant rock. The rock \r\nformation has long since collapsed, but the \r\nmarketing pictures you see make it live \r\non.\r\n\r\nthis section of coast is very popular to \r\ntouring operators. We saw several zodiac s, \r\ntouring cruisers and kayak tours headed our \r\nway after we explored the caves. We timed it \r\nwell and then moved on before things got a \r\nlittle too crowded.\r\n\r\nAll along the coast, you see evidence of land \r\nloss. Fences set back safe areas, and from \r\nthe water's vantage point, one can see \r\nwhere land use to be, now crumbled rock \r\nand the occasional bit of turf. I'm not \r\nsure what the rate of land loss is, but if they \r\nget the same weather patterns as we do on \r\nPEI, it's several feet per year.\r\n\r\nAs we left Gros Cap, the hills lessened in \r\nseverity. Approaching Cap aux Meules, \r\nthings became more like an urban paddle. \r\nWe could see the town scape above the hills, \r\nand see the break water of the large \r\ncommercial warf where the big ferries dock. \r\nWe re routed further away from shore so as \r\nto avoid crossing any suprise boat traffic.  \r\nJust past the government warf, we could see \r\ngrey colored hills that were around 15 \r\nmeters high. they seemed to be made of \r\nsomething different than the rest of the \r\nlandscape. Perhaps that is where the \"\r\ngrindstone\" name originates for the \r\ncentral island.\r\n\r\nAbout 3.5 K beyond the water front takes us \r\nto Havre aux Maisons bridge where we would \r\nenter one of the Islands' lagoons \r\n(Lagoon du Havre aux Maisons). To be sure \r\nwe didn't over paddle, I had to check \r\nmy map and refer to my GPS's \r\nnavigational waypoints. Otherwise, we were \r\nabout to set a course toward Cap Alright. \r\nSomething to be aware of when you paddle \r\nthe region is that you can cover ground quite \r\nquickly, even when you dawdle in the caves \r\nand coastal features.\r\n\r\nAfter entering the Lagoon, to our left lies Ile \r\nRouge, a small bump of an island home to \r\nmainly cororants and other birds. Totally scat \r\ncovered, you may want to hold your nose as \r\nyou pass by, or pick a course up wind of the \r\nlandmark. Be weary of fishing boat traffic, as \r\nthe passage is fairly narrow.\r\n\r\nUpon finding our car (a thankfully easy task) \r\nwe loaded up and headed back to Cap Aux \r\nMeules to try the shark burger sat Pas \r\nPerdus, a popular bistro in town. I second the \r\nrecommendation! tonight we were off to stay \r\nin a \r\n\r\nYurt\r\n. Fancy that!\r\n\r",
    "directions": "Take Route \r\n199 from Cap aux Meules, and \r\nturn left toward Gros Cap.",
    "geohash": "f8",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/QC/1987/reg_caprougejpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/1987/reg_groscapmap.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/1987/reg_pigisland.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/1987/reg_urbanpaddlejpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/1987/topo_kokatatjacketjpg.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/gros-cap-madeleine-islands-near-iles-de-la-madeleine-pq-1987",
    "stats": {
        "Activities": "sea-kayak",
        "From": "",
        "Seasons": "summer",
        "Stars": 4,
        "Time": "4 hrs",
        "Total Distance": "13 km",
        "Town": "Iles-de-la-Madeleine, PQ",
        "Type": "out-and-back"
    },
    "title": "Gros Cap, Madeleine islands",
    "trail_id": "1987"
}