{
    "description": "NTS Map: 011N11\r\nOne of the highest frequencies of sea caves \r\nper area can be found along this coast line. \r\nSo said one adventure-guide who takes \r\ngroups in to the sea caves in sit-on-top \r\nkayaks and wet suits to swim in and explore \r\ntheir sub terrainain world.\r\n\r\nWe launched from an area called Old \r\nHarry, \r\nformerly known for its harvesting of native \r\nwalrus. The herds have long gone, but a \r\nsmall fishing wharf and boat skid remain, \r\nalong with similarly labeled place names like \r\nSeacow Bay. This is at the upper tip of the \r\narchipelago, and is about 50K from Cap aux \r\nMeules.\r\n\r\nThe sea-worn sandstone in the area gives \r\none a glimpse at what to encounter along \r\nthis paddling route. The rock is soft, even \r\neasily etched or drawn on with a stick. I even \r\nnoted someone's artful rendering of a well \r\nendowed mermaid!\r\n\r\nAs we poked in and around the various caves \r\nand formations, we tag-teamed a couple who \r\nwere hiking the coastline's cliffs and \r\nbeaches. so we each got a unique \r\nperspective of the land features, with their \r\nadded bonus of seeing beautiful kayaks in \r\nthe water. With the sea conditions not \r\nwithstanding, I think we got the better point \r\nof view.\r\n\r\nThis afternoon was touch and go from the \r\nstart. First, we were late heading out. \r\nSecond, I forgot to pack shannon's paddle, \r\nand the spare, meaning I had to either go \r\nback to Cap Aux Meules to get them (an \r\nextra hour at least) or try to find an outfitter \r\nwho would rent one. Luckily, with  one near \r\nby, I opted for the later option, and less than \r\n3 K up the road, was able to find her a \r\npaddle! Finally the last thing in our derision \r\nwas the fact that the winds were blowing \r\nfairly hard against us with swells to match. \r\nWe discovered this as we rounded the point \r\nat Old Harry. With no white caps, we decided \r\nto press on.\r\n\r\nThe original plan was to paddle the coast, \r\nand then at Grand Entree point, turn in land, \r\ninto Havre de la Grand Entree. We would \r\npaddle all the way back up that body of \r\nwater, and into Old Harry Bay, with only a bit \r\nmore than a 1 Km walk to return to the car. \r\nCombining the difficulty of paddling into the \r\nwind and waves, with our delayed start, we \r\nended up cutting that plan in half. \r\n\r\nAll along the coast, there were few places to \r\nland a kayak, but on the other hand, there \r\nwere small alcoves where one could enter \r\nand be sheltered. With high cliff walls all \r\naround you, the visual experience was \r\nunique. Depending on the time of day, \r\npicture taking can be difficult due to the sun \r\nand shadow contrasting on the cliff walls. \r\nSome of the smaller keyholes you could \r\npaddle through if you timed the swells \r\ncorrectly. Most of the sea caves were just too \r\ndangerous to enter due to the wave swells. \r\nOne spot in particular was a huge rock arch \r\nformation. that was the money shot of the \r\nday. \r\n\r\nWe continued down the coast, and visibility \r\nadded to the difficult paddling conditions in \r\nterms of finding our point to turn inland. the \r\ncoast follows a southwest curve, and the land \r\nturns to a more flat featureless dune. We \r\nended up pulling in on a beach along Ile \r\nBoudreau, which was a section of sand \r\nseparating Bassin aux huitres. There, we \r\nfound our map position, and plotted the final \r\ndetails to get around Grande Entree Pointe \r\nvia GPS.\r\n\r\nBy the time we made it to the large \r\nGovernment wharf at Grande Entree Pointe, it \r\nwas nearing 7 PM. We decided to cut our trip \r\nshort, even though the return would be in \r\nmore sheltered waters. We bumed a ride \r\nback to our car back at Old Harry. The first \r\ngroup we asked at the wharf were more than \r\nhappy to give us a lift. By car it was only 5K, \r\nbut we paddled 14 to get here! If we had left \r\nearlier in the day, and if the conditions had \r\nbetter suited us, we would have been able to \r\npaddle the entire loop. Never the less, I think \r\nwhat we covered was by far, the more \r\npicturesque.\r\n\r\nShannon Burt\r\neast Coast editor for \r\nTrailpeak.com",
    "directions": "\r\nFollow Route 199 to it's North \r\neastern \r\ntip, \r\nand turn off toward Old Harry wharf. You \r\ncan \r\nlaunch from the boat skid.",
    "geohash": "f8k",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/QC/1989/long_oldharrymap.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/1989/reg_oldharrysmall.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/1989/reg_shelteredalcovessmall.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/1989/topo_archagainsmall.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/old-harry-to-grande-entree-madeleine-islands-near-iles-de-la-madeleine-pq-1989",
    "stats": {
        "Activities": "sea-kayak",
        "From": "",
        "Seasons": "summer",
        "Stars": 5,
        "Time": "4 hrs",
        "Total Distance": "14 km",
        "Town": "Iles-de-la-Madeleine, PQ",
        "Type": "out-and-back"
    },
    "title": "Old Harry to Grande Entree, Madeleine Islands",
    "trail_id": "1989"
}