{
    "description": "NTS Map:92B14.  The Mount Norman hike leads to spectacular views of the SouthWest side of Pender Island, Vancouver Island, and the farther off Olympic Mountains.  The hike itself is rather short, although steep in parts.  Once up top, return to the Parking area (as marked on our map), or, continue on the gradual descent down the road where North and South Pender Islands meet.  At this juncture, stay right on Canal road to get back to the parking area at the trailhead, or, just return the way you came.  There is a marine park in the area that also makes for a great no-impact camp site for those who wish to hike in with all their gear.Pender Island has lots of fun activities to partake in from kayaking, lake swimming, whale watching, hiking, frisbee golf, and some great camping at Prior Provincial Park. A great weekend getaway, the farms and rolling fields you pass by on quiet roads (South Pender at least) are reminiscent almost of grasslands and hot lazy farm country further East, only that there is far more interesting vegetation, wildflowers, and, there are mountain views from the Penders.  The Islands can may seem quite dry in the summer, but the Rainforest is never far away.  If you prefer, there are a number of B&B's on the Island - which you will be very greatful for if it does happen to rain - Oh ya, this is still the NorthWest!",
    "directions": "See description and / or GPS",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/20/long_PIC1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/20/reg_PIC2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/20/reg_PIC3.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/20/reg_PIC4.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/20/topo_Pender.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/20/topo_PenderMap.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/pender-island-mount-norman-near-victoria-bc-20",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "5 km",
        "Town": "Victoria, BC",
        "Type": "out-and-back"
    },
    "title": "Pender Island Mount Norman",
    "trail_id": "20"
}