{
    "description": "NTS Map: 083C13Elevation Gain: 130 m (427').The 20min loop around the top of Maligne Canyon in Jasper National Park is the fastest way to see the best, of the deepest canyon in the Canadian Rockies. Please Note: The Park does not clear trails in winter and while they are always open, they can be very slippery.The trail starts at the front door of the Maligne Canyon Teahouse http://www.malignecanyon.com/ (Closed in winter) and follows the rim of the canyon downstream. Laced with acid and abrasive sediments the swirling water has been cutting through the limestone for thousands upon thousands of years. (Yes, acid: carbonic and sulphuric) Digging down through rock the water sculpts a web of channels, potholes, plunge pools and at one point a vertical shaft straight down through the rock. Along the trail to the first bridge there are a half dozen fossils of cephalopods, brachiopods and crinoid fragments preserved in the rock under your feet. How many can you find? Approaching the 1st Bridge, the roar of a waterfall is heard and sometimes felt as the full volume of the canyon is forced through a narrow gap and over the brink. Plunging 23m to the canyon floor, 38m under the viewing bridge, it is the highest waterfall in the canyon. In winter the canyon has an eerie silence and the waterfall is a giant frozen icicle. But if you listen closely, water can be heard running behind the ice. Hikers easily susceptible to vertigo should prepare themselves before having a look from the bridge and realize that deeper sections are yet to come. An interesting thing to note while looking into the canyon from the 1st Bridge is that the bottom of the canyon is much wider than the top. This is especially noticeable when looking downstream, where boulders, that tumbled into the canyon long ago have become wedged near the top. While the shape of Maligne Canyon is very typical, it is rarely seen on the surface of the earth. Maligne Canyon shares more similarities with caves than it does other canyons. Perhaps the canyon isn't a canyon at all!Many visitors to the Maligne valley are unaware that most of the water in the valley runs underground through a cave system, and what we see on the surface is just a fraction of the rivers total volume. The cave system, about 30km long, runs from the floor of Medicine Lake all  the way to the Athabasca River. It is the source for such beautiful lakes as Lake Annette and Lac Beauvert and many springs in and below the canyon. So if the canyon looks like a cave and its associated with an existing cave then it makes sense to assume that the canyon used to be a cave. A cave that had its top shaved off by the glaciers of the last ice age. Not convinced? Well... it sure doesn't hurt the theory that there are speleothems in the canyon. What are speleothems you ask? Speleothems are cave formations like stalactites and flowstone, and 'cave' formations can only grow in... you guessed it, caves.Anyway, back to the trail. Crossing the first bridge the trail resumes it=s course downstream. The canyon is so narrow and the edge so rounded that you can not see in till the next viewpoint, where the canyon makes a jag to the right, allowing views into its depths and back toward 1st Bridge The canyon here is deeper but the deepest section is just a little bit farther downstream. A safe distance back from the rim, the trail continues to the bottom of the loop at the second bridge over the canyon. It's dizzying looking into the depths of the canyon from 2nd Bridge, it's 51m straight down, making it the deepest canyon in the Canadian Rockies. To finish the loop, cross 2nd Bridge and follow the trail along the fence back to the parking lot. A marvelous diorama of the Maligne Valley in the parking lot should not be passed by. It is a great opportunity to see the whole valley at once, from the Brazeau Icefield at its head to Maligne Canayon at the bottom.Please Note: The current in the canyon is incredibly powerful and a fall from the brink is deadly. Despite the presence of the fenced guard rails it is very important to keep an eye on your children. For your own safety, do not cross the guard rail for a closer look, unless you wish to join the long list of people who have perished at Jasper's wild attractions.Submitted by 'mtncat'.",
    "directions": "Drive east of Jasper on Hwy 16 for 2km and turn right on the Maligne Lake Road. Cross the bridge and follow the Maligne Lake Road for 9.5km then turn left into the Maligne Canyon parking lot.",
    "geohash": "c3kj4",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/2002/reg_map.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2002/narrow_1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2002/narrow_FirstwaterfallinMaligneCanyon.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2002/narrow_Lookingdownfromthesecondbridge.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2002/narrow_UpperstretchofMaligneCanyon.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/maligne-canyon-20-min-loop-near-jasper-ab-2002",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 5,
        "Time": "1 hrs",
        "Total Distance": "1 km",
        "Town": "Jasper, AB",
        "Type": "out-and-back"
    },
    "title": "Maligne Canyon 20 min. Loop",
    "trail_id": "2002"
}