{
    "description": "NTS Map: 082G15.Time and distance are return. elevation gain is about 762 m (2,500 ft).Mount Ward is a relatively easy scramble in the Crowsnest Pass region of southwestern Alberta. This trip was undertaken as part of the Alberta Centennial Mountain Expedition (\"100 summits for 100 years\"). The day started off cloudy and the forecast was for a 20-30-40 day (20C, 30km winds, 40% chance of rain). This year 30% almost guarantees rain, but we headed out anyway. The goal was to complete all 100 mountains by Sept. 1, the official centennial date, and this was Aug. 29. We even 'sacrificed' a day of work to do this.Mount Ward sits as a backdrop to  Window Mountain Lake (Window Mountain is on the other side of Mount Ward). We arrived around 10:00 at the end of 3km of very rough access road. From there it's only 1km to the lake and another 1km to the far end where the climbing begins. At the end of the lake, you simply follow the obvious gully upwards and to the left. There are some trails made by others which make the climb a bit easier but these aren't necessary. Once you reach the first plateau, head upwards on vegetation towards the boulder field.Then simply plod your way upwards through the boulders. The boulders aren't so big as to be cumbersome, but you could turn an ankle quite easily. You will soon reach a saddle where you can see straight through the large 'window' in Window Mountain, as well as Crowsnest Mountain and the Seven Sisters. Turn left and head up to the summit.This was the smallest summit I've ever seen. The top is about 6' x 6', straight down on the south side. The true summit (we think it was maybe 5-10' higher) is a bit farther along the ridge to the southwest. Since we figured a lot of novice scramblers wouldn't venture out along the ridge, we built a new cairn and placed the Centennial summit register in the near summit.",
    "directions": "Mount Ward sits at the back of window Mountain Lake To get there take Hwy 3 west from Blairmore to the Alison Lake road. Turn right and go 16.8km, keeping right at the junction just over the cattle guard. The access road is not marked, so watch your odometer. Turn left onto the access road and drive as far as your vehicle and nerve will allow. The farther you drive...",
    "geohash": "c2y",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/2003/reg_10.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2003/reg_11.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2003/reg_13.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2003/reg_14.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2003/reg_17.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2003/reg_3.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2003/reg_map.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2003/narrow_1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2003/narrow_12.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mount-ward-near-blairmore-ab-2003",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 5,
        "Time": "6 hrs",
        "Total Distance": "10 km",
        "Town": "Blairmore, AB",
        "Type": "out-and-back"
    },
    "title": "Mount Ward",
    "trail_id": "2003"
}