{
    "description": "NTS Map: 083C13Visit Maligne Canyon in Jasper National Park in the summer and you'll see a raging torrent of a river thrashing its way down the deepest canyon in the Canadian Rockies. A must do for any hiker visiting Jasper for the first time. But as thrilling as it is in summer, the canyon should also be visited in the off-season and not just to avoid hoards of tourists.The canyon, which is pronounced 'Mal-een', is also the most peculiar canyon I've seen anywhere, well deserving of the name 'Maligne'(French for evil or wicked). During the off-season (mid-fall through late-spring) you'll see all sorts of weird and wonderful things. Like alternating sections of running water and dry river bed, water flowing upstream and waterfalls that are swallowed by the earth. You'll also see the whole canyon from bottom to top or put another way, from better to best. This description takes you through the canyon in the off season.Cross the suspension bridge (5th Bridge) next to the parking lot and follow Trail#7g a short distance to the junction with Trail#7. Turn right on Trail#7 and follow the hand rail up the hill to the junction with Trail#7f, keep right and continue on Trail#7. While it doesn't look like much at this point the trail is now above the canyon and things are about to improve. Trail#7 from this point to the top of the canyon is a hikers only trail.After dropping close to the shore of the river the trail passes above some beautiful pools of water, these pools are crystal clear and worth a closer look (be careful). Before the first kilometre is up, the river that flowed past the parking lot will have disappeared, the water having risen from a mysterious source. Most of the water in the canyon area runs underground through an unexplorable cave system. The cave is about 30km long and runs from the floor of Medicine Lake all  the way to the Athabasca River. It is the source for such beautiful lakes as Lake Annette and Lac Beauvert and many a spring down valley. For those with more energy it is worth while to add some of those springs to the journey by starting the hike another 1.5 kilometres down Trail#7 at 6th Bridge.By the time a handrail reappears you are hiking next to a dry riverbed, but the sound of waterfall adds mystery to the scene. Up and over a hill the waterfall comes into view. A small trickle compared to the river downstream but very picturesque. After several weeks of deep winter cold, this waterfall forms a cone-like shell of ice around itself. Take note of the rocks around the base of the waterfall, they=re dry. The earth has swallowed the falling water.Less than a hundred metres past the disappearing waterfall a second waterfall cascades down the canyon wall. Its flow splits in two at the base, most of it flowing downstream to the disappearing waterfall, while the rest of the water goes the wrong way. Flowing upstream, the water percolates through the river rock and down in to the cave system. Beyond the waterfalls the riverbed drys out again as the trail climbs up and down past a narrow section of the gorge. With the help of an interpretive sign locate the mouth of a cave on the opposite side of the canyon. In summer water rushes from the cave mouth but in winter the cave breaths out warm air from the bowls of the earth. The warm air condenses into frost during long spells of cold weather, creating beautiful feathers of frost dangling from the roof of the cave.Pushing upstream the trail passes a shallow section of canyon before climbing towards the spur trail to 4th Bridge. Suspended at the base of a long narrow stretch of canyon, 4th Bridge gives you the chance to see the canyon as a bird flying through it might. Birds like the Black Swift, Common Raven, and American Dipper call the canyon home. Black Swifts are only present in the summer when they nest in the canyon, the other two birds are year round residents. The Common Raven, largest perching bird in the world, croaks happily as it glides through the canyons depths. While the American Dipper can be seen bobbing up and down by the waters edge, singing a melodious and varied tune between trips to the river's bottom in search of its subaquatic dinner.Between 4th and 3rd Bridges you'll pass two more junctions with trail#7f, the horse trail next to Maligne Canyon. It is hard to get a good look into the canyon through this section but in middle of winter two beautiful frozen waterfalls drape down the opposite side of the canyon in full view. If the conditions are right ice climbers flock to these frozen waterfalls to test their skill. Please Note: Frozen cascades fill the forest around the canyon creating 'ice slides of doom' into the canyon below, for your own safety stay on trail. Mind you, in winter, the snow packed/icy trails of Jasper can be very slippery in their own right. If you have a pair of strap on cleats, by all means bring them along for winter hikes.Take in more waterfalls as you cross the 3rd Bridge then prepare yourself for a moderate climb along the canyon's rim to the 2nd Bridge. Along the way you'll pass a year round seep of ground water, one of many such seeps that create those deadly ice slides and which accounts for most of the surface water seen in the canyon in winter.The deepest section of the canyon, at 51m, is just upstream of 2nd Bridge. People who are afraid of heights should prepare themselves before looking down from this bridge. The monstrous pothole below 2nd Bridge was left high and dry thousands of years ago. Having filled with enough soil, it is now called the hanging garden and is filled with moisture loving plants. Do not cross 2nd Bridge, continue hiking up the same side of the canyon. In this upper section it is interesting to note that the bottom of the canyon is much wider than the top. This is especially noticeable when looking up stream from the viewpoint between 1st and 2nd Bridges, where boulders, that tumbled into the canyon long ago have become wedged near the top. While the shape of Maligne Canyon is very typical, it is rarely seen on the surface of the earth. Maligne Canyon shares more similarities with caves than it does other canyons. Perhaps the canyon isn't a canyon at all!If the canyon looks like a cave and its associated with an existing cave then it makes sense to assume that the canyon used to be a cave. A cave that had its top shaved off by the glaciers of the last ice age. Not convinced? Well... it sure doesn't hurt the theory that there are speleothems in the canyon. What are speleothems you ask? Speleothems are cave formations like stalactites and flowstone, and 'cave' formations can only grow in... you guessed it, caves. Approaching the first bridge, the roar of a waterfall is heard and sometimes felt as the full volume of the canyon is forced through a narrow gap and over the brink. Plunging 23m to the canyon floor, 38m under the viewing bridge, it is the biggest waterfall in the canyon. In winter the canyon has an eerie silence and this waterfall is a giant frozen icicle. But if you listen closely, water can be heard running behind the ice. Above 1st Bridge the canyon decreases in depth, narrows then becomes a sculpted web of channels, potholes, plunge pools and at one point a vertical shaft straight down through the rock. Between the 1st Bridge and the teahouse (http://www.malignecanyon.com/) at the top of the canyon are a half dozen fossils of cephalopods, brachiopods and crinoid fragments preserved in the rock under your feet. How many can you find? The return journey can be made in one of three ways; canyon side (Trail#7) to see all that splendor again, on the horse trail (Trail#7f) for a speedy descent, or Trail#7h for a stroll through an old growth Douglas Fir forest followed by a steep descent. The interpretive display on the far side of the parking lot from the teahouse should not be missed, besides, Trail 7f begins right behind it. This trail will funnel you down to 2nd Bridge while two trail junctions on the right often go unnoticed. But stacked one on top of the other on the open slope above 2nd Bridge is the continuation of Trail #7f and the start Trail#7h. Trail#7h makes and for a pleasant loop and is the way this description will lead you. After a short 100m on 7h a beautiful viewpoint is reached before plunging into a grove of Douglas Fir. Up and down through and series of gullies then it=s down, down, down the trail to the junction with Trail#7. Turn left on 7, go 100 metres then turn right at the metal handrail onto Trail#7g and cross 5th Bridge back to the parking lot.Gee, for such a short trail that was a real long description, I hope it opens your eyes and gives you a better understanding of this special corner of the Canadian Rockies. By the way, the canyon is a great place to see Rocky Mountain Bighorn Sheep, Whitetail and Mule Deer.Please Note: Though it shouldn't have to be said, handrails and fences along Maligne Canyon are there for your own safety. Do not cross these unless you wish to join the long list of people who have perished at Jasper's wild attractions. Nor is it safe to explore the canyon floor without an experienced guide. Collapsing ice shelves falling ice and running water under thin ice are just some of the hazards faced in the canyon. To explore safely sign on with a licensed guide at: The Jasper Adventure Centre (http://www.jasperadventurecentre.com/), Overlander Trekking and Tours (http://www.overlandertrekking.com/) or Beyond the Beaten Path (http://www.jasperbeyondthebeatenpath.com/).Submitted by 'mtncat'.",
    "directions": "Drive east of Jasper on Hwy 16 for 2km and turn right on the Maligne Lake Road. Cross the bridge and follow the Maligne Lake Road. Turn left at 5.5km for 6th Bridge or 6.5km for 5th Bridge access road. The parking lots also have nice little picnic areas with tables, privys, and a garbage can. Both are alongside the Maligne River, 6th Bridge has fire pits to boot.",
    "geohash": "c3kj4",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/2005/reg_Jasper037jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2005/reg_Jasper060jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2005/reg_MaligneCanyonCaveJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2005/reg_MaligneCanyontheShowerStallFallJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2005/reg_image-53856.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2005/narrow_IMG-5893-44639_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2005/narrow_IMG-5905-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2005/narrow_IMG-9527-25122.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2005/narrow_IMG-9562-25122.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2005/narrow_IMG-9570-25122.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2005/narrow_IMG-9571-25122.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2005/narrow_Jasper-003-21851.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2005/narrow_Jasper032jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2005/narrow_Jasper033jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2005/narrow_Lookingdownfromthesecondbridge.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2005/narrow_MaligneCanyonVertJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2005/narrow_MaligneCanyontheCorckscrewfromaboveJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2005/narrow_UpperstretchofMaligneCanyon.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/maligne-canyon-full-loop-near-jasper-ab-2005",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 5,
        "Time": "2 hrs",
        "Total Distance": "4 km",
        "Town": "Jasper, AB",
        "Type": "out-and-back"
    },
    "title": "Maligne Canyon Full Loop",
    "trail_id": "2005"
}