{
    "description": "Above distance and time is one way to Berg Lake. The Berg Lake Trail toward (Emperor Falls) and beyond is  one of the most popular hiking trails in the Rockies. You would be hard pressed to find a more picturesque hike with scenery on a such a grand scale; big trees, waterfalls, canyons, glaciers, and snow-capped mountains are around every turn.  The first 6-7km to Kinney Lake can  be mountain biked and would be rated as being easy to moderate. The trail gets a bit more difficult as it progresses beyond Kinney LakeThe hike is in the shadow of Mt. Robson, the highest peak in the Canadian Rockies at 3954m. The trail starts off at the parking area 2km behind the visitor center (and cafe) at the top of Mt. Robson pass off the Yellowhead highway.  Gas, camping, and a cafe convenience store are located nearby.The trail is well marked (although you can download our GPS track to the Ranger station), and the hike progresses in several stages, appropriate for various abilities. The first stage of the hike takes you on a very wide and well marked trail to Kinney lake.  Big trees, some interpretive signs, and rushing water characterize the first 5km.  At Kinney Lake, some 6km into the trail, there is a primitive campground, and a rest area.  This is a nice destination for those out for a day hike.Mountain bikers can carry on a little further around the lake until they see a bike lock-up.  You must continue on from there by foot, and you'll see a sign for two options at the metal bike rack. You can take the rocky boulder-strewn flood plain in the lowlands (not always passable, but shorter and easier), or, take the longer trail on the higher ground. Both reconnect with the main trail at the end of the lake (and a larger bridge).  Shortly afterward you'll face an uphill section, with switchbacks, which flattens out and carries on for a few more kilometers to the Ranger station and Whitehorn Campground -- near the suspension bridge. This is a great day one stop.  You must reserve your campsite with BC parks.  The next stage continues on 1 km beyond the campground and then 4km of daunting steep uphill towards Berg Lake via Emperor Falls. Lots of lookouts.  You are in the valley of 1000 Falls. When you reach Berg lake you are treated to views of Mt. Robson and the Emperor Face. You can also watch the Glacier calf into the water. There is primitive camping and a BC Parks  hut at Berg Lake. Many smaller day hikes are available from here; to the toe of the Robson Glacier for one.Although some people go to Berg Lake on day one, consider making it a two-day hike (biking to the 7km point helps a bit) and, you'll want a full day or two at Berg Lake, minimum. Although the trail is easy to follow, this is wilderness, and be prepared for weather changes, bugs, and wildlife (i.e. bears). Bring your first aid gear, sunscreen, good boots, food, and lots of water even if you are not spending the night.The attached GPS points can be viewed as a mini-map (click download GPS) and then download for entry into your own GPS if desired. Waypoint 5 is part way up the 4km climb to Emperor falls -- no further points were collected.  Pics courtesy of Robert Boyko and Kurt Turchan and others.",
    "directions": "See description and / or GPS",
    "geohash": "c37",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/201/Robson2_resise_2x3.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/201/long_profile.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/201/reg_00034-19975.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/201/reg_00043-19975.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/201/reg_048-11997.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/201/reg_056-11639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/201/reg_094-11997.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/201/reg_098-11997.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/201/reg_205-11639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/201/reg_403-11639_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/201/reg_IMG00240-20090910-0817-11997.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/201/reg_bridge.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/201/reg_drinkingfromstream.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/201/reg_wildflower.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/201/topo_robson.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/201/narrow_00055-19975.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/201/narrow_091-11997.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/201/narrow_099-11997.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/201/narrow_emperor.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/201/narrow_ice.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/201/narrow_map.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mt-robson-prov-park-berg-lake-near-valemount-bc-201",
    "stats": {
        "Activities": "hike mtn-bike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 5,
        "Time": "7 hrs",
        "Total Distance": "22 km",
        "Town": "Valemount, BC",
        "Type": "out-and-back"
    },
    "title": "Mt. Robson Prov Park -  Berg Lake",
    "trail_id": "201"
}