{
    "description": "There is no obvious trail to Cypress Peak but anyone with reasonable route finding skills will be able to get there. Drive as far as you can up the logging road, then hike the rest of the way in. The road eventually ends in a clearcut, about 2km from where you'll be able to drive most 4x4s. Cross the clearcut, veering left to cross Roe Creek. After a short traverse through some yucky thornbushes, you will break out at the base of a very long talus slope.From here it's pretty simple. Go up. Cross the river (this may be tricky early in the season) then work your way up heather & wildflower covered talus. When you get to the glacier, keep right, staying up on the rocks and out of harm's way. Continue to ascend, crossing snowfields to the ridge.The summit is clearly visible. Just follow the ridge, keeping right for the easiest route. This last section is definitely a scramble so if you're not comfortable with a bit of exposure and climbing, just enjoy the views from the ridge. This is a fun, enjoyable day out with fantastic views. There are hazards on this route so be smart. Stay off the glaciers & wear a helmet.",
    "directions": "Take Hwy 99 to the Chance Creek FSR. Turn here and reset your odometer. Keep left until the junction at 3km. At 3.4km keep left. At 4.4, stay right. Stay left at 5.1km. After crossing a bridge at 5.9km, go left. The waterbars start at 6.8km and you will need a 4x4 to go any further. Keep left at 8.3km and continue as far as you can (to about 9km).",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/2021/reg_cypresspeak-10282.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2021/reg_p-CYpress-access2-11896.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2021/topo_cypress_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2021/narrow_scramble.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/cypress-peak-near-squamish-bc-2021",
    "stats": {
        "Activities": "climb hike ski-bc",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "7 hrs",
        "Total Distance": "0 km",
        "Town": "Squamish, BC",
        "Type": "out-and-back"
    },
    "title": "Cypress Peak",
    "trail_id": "2021"
}