{
    "description": "Seventh Secret is one of the north shore classic mountain bike trails.  It's an all weather, heavily armoured bike trail flowing from just before the seventh switch-back on mountain hwy back to the sixth switch back between Pipeline and Expresso. The few ladders, bridges, jumps and log rides are easier than you might at first expect, but sometimes come at you by surprise, so you may want to go easy on your first descent.  The more difficult stuff mostly has easier work arounds.\nThis trail is probably one of the most enjoyable mixed rides on the north shore, and a must do for intermediate riders. It connects up with Crinkum Crankum (via Leopord/Kirford) by heading left at the boardwalk T-intersection, or can be followed on with Pipeline or Expresso by heading right to the road.  If heading towards Crinkum, you will probably not want to ride the optional long log ride at the bottom, but continue down the trail instead to the boardwalk.\nMore Mt Fromme mountain biking trails can be found here.",
    "directions": "Park at the top of Mountain Hwy in North Vancouver, below the big orange parking signs (telling you not to park above the big orange signs).  Ride to the top of Mountain Hwy and you'll see a gravel road with a gate entering the forest. Continue up the gravel road, past some water towers, an outhouse, and another gate. Count the switch-backs (corners) in the road as you go up.  When you're nearly at the 7th corner, you will see a sign on your right that says 7th Secret.  This will take you somewhere between 45 minutes to an hour and a half, depending on the size of your legs, the volume of your lungs, and the weight of your bike.  Enjoy.\nLocal Conditions:\n                  \t\nfootage of 7th secret into Ladies Only\n \nyou really have to see this one to believe it ...",
    "geohash": "c2b",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/2022/reg_fromme-seventh2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2022/narrow_fromme-seventh1.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mt-fromme-seventh-secret-near-north-vancouver-bc-2022",
    "stats": {
        "Activities": "mtn-bike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 5,
        "Time": "1 hrs",
        "Total Distance": "5 km",
        "Town": "North Vancouver, BC",
        "Type": "out-and-back"
    },
    "title": "Mt. Fromme - Seventh Secret",
    "trail_id": "2022"
}