{
    "description": "NTS Map: 082A13Elevation gain: 700 m (2,300 ft). Shortly after I arrived in Alberta, in 1978, I read an article in Maclean's magazine which stated that the Crypt Lake trail in  Waterton Lakes National Park\r\n had been voted among the top 10 hiking trails in Canada. It only took me 27 years to finally get there.\r\nThis trail has been posted on Trailpeak  previously, but I thought I would add my impressions (and some more photos) as well. The time and distance are return, for an average hiker. Elevation gain is 700m (2,300'), most of it in the second half. We took 7 hours, which included 1/2 hour at the lake. You can't leave till the boat picks you up, so you may as well take your time and enjoy the day.\r\nThis trail has a little bit of everything - several major waterfalls, a beautiful cirque lake backed by a massive headwall, excellent cutthroat fishing (though apparently quite elusive), a 25m cave to waddle through, a near vertical cliff face to navigate after the tunnel (about 25m - steel cable assisted) and enough beautiful scenery for 3 day hikes. And if that's not enough, stroll around the end of the lake and visit the U.S.A. The international boundary just cuts across the south end of the lake.\r\nTo access the Crypt Lake trail you must first cross Waterton Lake, either on your own, or by taking the commercial ferry ride ($14 round trip in 2005 (adult)). It's an enjoyable 20 minute trip. You could save the $14 and walk or bike in from the Chief Mountain Hwy, but that would add about 15km to your day. At Crypt Landing just follow the crowd, or be the first and follow the trail to your right, past the sign.\r\nA major feature of this trail is Hell Roaring Falls, a 1km side trip. Since the main trail is a pretty full day, it's advisable to leave this side trip until the way back, making sure you have a good hour to allow for it. The trip to Hell Roaring Falls is actually a 2km loop (1km from each end). You'll see the trail markers. Just make sure you give yourself time to catch the boat. I don't know if they'll wait, if they even know you're still out there, but I wouldn't want to take that chance, either.\r\nThe trail to Hell Roaring Falls is about 15 minutes up the main trail. Like the previous auther, we didn't have time for it, so will have to return, not a bad thing. At 3km, you will meet the upper end of the Hell Roaring Falls loop. At about 5.5km you will see Burnt Rock Falls, so called because of the color of the rock across the valley. The steeper climbs begins about here. Follow the the switchbacks upwards with ever improving views in both directions. Crypt Falls is actually visible from an open area just before you make the turn to the south.\r\nAs you make your way up the switchbacks, getting closer to the headwall, you may start to wonder how you're going to get up there. If you watch closely you'll be able to see those ahead of you make their way across the slope towards Crypt Falls and disappear. That's the tunnel - about 25m of natural tunnel, slightly enlarged by human hands. Fortunately, you can see one end from the other, otherwise this tunnel could be a little intimidating. It's only about 1.4m (4.5') high and not very wide on the floor,so it will fit just about anybody. Some will prefer to carry their packs or strap them on their chests.There is, at each end of the tunnel, enough room to be considered a 'landing area'.\r\nAs you exit the tunnel you are confronted with a slightly airy, exposed 'cliff' face. Almost all of our party of 15 had no trouble on this portion, 3 were a little timid, but made it with a little assistance. (I stood on the ledge to guide them past me, so it can't be that bad). You must negotiate about 12m (40') of this face which has a steel cable installed for support. The ledge is from 1-3' wide and it's not a sheer cliff (see photos).\r\nFrom here it's a five minute walk to the lake. Relax, enjoy the view, fish a while, but don't forget you pick-up time. Allow about 1/2 hour less than your time in, to return. Current conditions:\r\n\r",
    "directions": "Take the cruise boat across Waterton Lake (special rate for Crypt Lake passengers). When you get off the boat, you're there.",
    "geohash": "c2xn",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/2026/long_crypt-47868.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2026/reg_Crypt2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2026/reg_Crypt7.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2026/reg_Crypt8.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2026/reg_Crytp.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2026/reg_DSC-5665-29667.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2026/reg_DSC-5697-29667.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2026/reg_Picture-104-23325.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2026/reg_map.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2026/narrow_Crypt1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2026/narrow_Crypt3.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2026/narrow_Crypt4.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2026/narrow_Crypt5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2026/narrow_DSC-5632-29667.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2026/narrow_DSC-5676-29667.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2026/narrow_DSC-5736-29667.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2026/narrow_DSC-5757-29667.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2026/narrow_DSC-5766-29667.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2026/narrow_Picture-130-23325.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/crypt-lake-2-near-waterton-park-gate-ab-2026",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 5,
        "Time": "6 hrs",
        "Total Distance": "18 km",
        "Town": "Waterton Park Gate, AB",
        "Type": "out-and-back"
    },
    "title": "Crypt Lake - 2",
    "trail_id": "2026"
}