{
    "description": "The Golden area is an outdoor advenurer's paradise.  While getting ready to ride, four para-gliders landed in a nearby field (launching from same summit you will ride from), and, in town, you cannot help but notice the kayaks and canoes on everyone's vehicles.  This town has the same feeling as say, a MOAB would have, some funky cafes, a happening outdoor scene, and, otherwise just a friendly and really clean small town.  Sure it also has a truck stop image, but you just have to overlook that and remember that you are at the confluence of the Columbia and the Kicking Horse River. Within easy striking distance of Revelstoke, the Bugaboos, Banff, and Radium Hot Springs, this is a mountain paradise.  A bunch of Swiss climbing guides moved to Golden in the 1900's, and the Swiss know a good mountain area when they see one ... so that's worth a few points. The trail mapped here was at the 5km mark trail on the Mount Seven Forestry Service Road. You can ride past this trail-head to various other trails -- see the list below. You can click the link to Google Earth above and if you have the client installed, it will show you the trail and the mountain in 3D zoom.  Or download the waypoints.Start at the Reflection Lake Parking Lot (just South of town), ride or shuttle up the FSR (marked in red), and, keep an eye out for the 5 km mark.  The 5km trail entrance is just a few metres past that.  It is marked on the attached map in Green (down) and Red (up the FSR), although you can continue further up to the 10km for a steeper DH ride.  There are a few stunts areas along the way, and some great views of the valley below. The luge section at the bottom is really fun.We've attached the GPS track the 5km trail, it just takes the guess work out of finding the logging road and finding the trail.  If you click on \"view/download GPS\" you'll see a preview of the GPS data that you can download into your unit! The parking area is just South of town on Hwy 95, look for Reflection Lake parking (a bird viewing area as well -- but we only saw hang-gliders).",
    "directions": "See description and / or GPS",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/203/reg_CIMG2413-14296.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/203/reg_goldmap.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/203/reg_view2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/203/narrow_5km.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/203/narrow_CIMG1799-14296_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/203/narrow_GoldenDesc.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/203/narrow_view1.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mount-7-dh-near-golden-bc-203",
    "stats": {
        "Activities": "mtn-bike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "0 km",
        "Town": "Golden, BC",
        "Type": "out-and-back"
    },
    "title": "Mount 7 DH",
    "trail_id": "203"
}