{
    "description": "NTS Map:083d15This trail is actually in B.C., however, nearest town is Jasper, AB. Distance to Yellowhead Mt. viewpoint is 1.5km.The Yellowhead Mountain Trail in Mount Robson Provincial Park is a quiet trail above the tiny cottage community of Lucerne, British Columbia. Once a thriving railway town, Lucerne disbanded in 1924 after the Grand Trunk Pacific Railway http://collections.ic.gc.ca/cnphoto/english/gtp3_ang.html went bankrupt and amalgamated with the similarly fated Canadian Northern Railway (http://collections.ic.gc.ca/cnphoto/english/cnor3_ang.html) to form the Canadian National Railway (http://collections.ic.gc.ca/cnphoto/english/cnr3_ang.html). Most of the town was located next to the modern highway, including the graveyard, which is filled with victims of the 1918 Spanish Flu epidemic.From the parking lot cross the tracks and turn left, look for the large sign marking the trailhead. After 150 metres turn right at what appears to be a four-way intersection and begin a moderate climb. The grade soon steepens and doesn't let up until shortly before the lookout, at 1.5km. This superb lookout over Yellowhead Lake provides views of Mount Fitzwilliam, Glacis Ridge, Weddington Peak and Ghita Mountain. This lookout is the destination for most hikers venturing out on this trail.The rest of the trail is mostly forested, seldom used, and prime grizzly bear habitat. Don't walk in silence! The trail fizzles out in an avalanche slope at the base Tete Roche, the eastern most peak of this seven peaked mountain, after climbing 700m in 6km. While there is little in the way of scenery from trails end, views improve considerably if you're willing to scramble up through thick vegetation in the avalanche slope. Through the obvious gully on the east side of the mountain it is possible to scramble up to the top of Tete Roche, or so I've been told. It is also possible to wrap around the north side of Tete Roche on a broad ledge above the talus, for views into the Rink Valley, this I know. Neither option has a trail and both require good route finding skills. Adventure awaits. Submitted by 'mtncat'.",
    "directions": "Drive west of Jasper on Hwy 16 for 30km and turn right on the Lucerne Station Road (far from obvious). Follow the Lucerne Station Road for 1km to the parking lot next to the railway tracks.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/2030/reg_Fitzwilliam_Mount_andYellowheadLake_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2030/reg_P1010066.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2030/reg_P1010068.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2030/reg_P1010070.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2030/reg_YellowheadMountain.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2030/reg_yhead.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/yellowhead-mountain-trail-near-jasper-ab-2030",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "0 km",
        "Town": "Jasper, AB",
        "Type": "out-and-back"
    },
    "title": "Yellowhead Mountain Trail",
    "trail_id": "2030"
}