{
    "description": "NTS Map: 083d16The trail up The Whistlers in Jasper National Park gains 1200 metres of elevation and passes through all three of the park's life zones The distance given in the intro is 8km to the summit plus two extra klicks, one back down to the top of the Jasper Tramway (http://www.jaspertramway.com/) and the other from the bottom of the tramway to the trailhead parking lot. The Tramway charges about half price to hikers who purchase a one-way ticket at the top terminal. If you wish to ride up and hike down, you'll pay full price in dollars and pain. Be warned, this is not a spring hike, the upper sections of this trail are prone to avalanche till late June.Starting in the montane life zone, the trail rises through beautiful lush mixed forest, a virtual hotbed of ecological diversity. So important and rare is this type of forest in Jasper that Parks Canada has labelled it critical wildlife habitat and asks visitors not to venture off trail. With so much elevation to gain the trail pushes up the mountain at a heart pounding rate. At 2.5km a rockslide provides nice views and a place to rest. After the slide the trail resumes its climb, entering a dark subalpine forest of spruce, pine and fir, the second life zone of the day. Levelling out after 3km the trail makes its way under the tramline (smile and wave) and traverses towards the creek draining The Whistlers cirque, before resuming its steady grind up the mountain at 4km. The next two klicks, despite the stiff grade is enjoyable as the trail passes through a delightful flower filled subalpine forest. On the last klick to the summit ridge the trail breaks out of the trees and into the alpine, the third and final life zone on the day. This is a great place to take a nice long break, for when you hit the summit ridge the flowers are all but left behind and you'll join the throng of tourists who rode the tramway up the mountain.The final kilometre to the summit is a cake-walk compared to the rest of the trail. Weaving in and out of hyperventilating and often ill dressed tramway riders will give you an ego boost that'll put a spring in your step. The trail braids out giving you the choice of steep or not-so-steep trails. There used to be little brass trail markers on the ground, but many have gone missing. The trails to the left have the easier grade. From the summit at 2470m a sea of peaks fills the eye and inspires the soul. A rotatable peak-finder helps point out the prominent peaks in the surrounding valleys, including Mount Robson, tallest mountain in the Canadian Rockies at 3954m.If you plan to ride the tramway back down, be sure to arrive at the terminal before the last tram of the day, or you might have a long dark walk back down the mountain. From the bottom terminal of the Jasper Tramway it is 1km down the Whistler Road and up to the parking lot. Submitted by 'mtncat'.",
    "directions": "Drive south of Jasper on Hwy 93 (The Icefields Parkway) for 2km. Turn right on the Whistler=s Road and go 3km, then turn left on a gravel road and go 250m to the parking lot.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/2031/reg_IMG-0779-21068.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2031/reg_JasperfromTramway.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2031/reg_The-Whistlers-Jasper-Summit-Aug-13-6--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2031/reg_The-Whistlers-Jasper-view-Summit-Aug-13-1--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2031/reg_Topofthetram_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2031/reg_image-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2031/reg_n625511728-533099-2928-11997.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2031/reg_n625511728-533101-3497-11997.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2031/narrow_IMG-0773-21068.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2031/narrow_Whistlersinfallcolour.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/the-whistlers-near-jasper-ab-2031",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 4,
        "Time": "4 hrs",
        "Total Distance": "10 km",
        "Town": "Jasper, AB",
        "Type": "out-and-back"
    },
    "title": "The Whistlers",
    "trail_id": "2031"
}