{
    "description": "I discovered this area by reading the free rag in town called \"The Coast\", and read a feature on a mountain bike area called the 'Whopper Drop' or Bayer's Lake area, this was a huge find for a visiting mountain biker.\r\n\r\nFirst off, there's tons of granite, the whole area has a MOAB feel, with trails that twist up the hilly forested area, you'll likely be riding on granite, with a few mini-ladders and opportunities for little drops off rock ledges. Then, you descend through a heavily treed area and get into some very technical riding.  Here you find some rock drops and steep rock faces.  It's fun, with no map, we generally found the line or circuit that takes you out to the power line area, there is a flow to this circuit.  Smooth rock, faster lines, open to the sky. It's fun out under the power line.\r\n\r\nAs you climb, you will eventually reach the top of the powerline cut, and, if you keep looking to the right, you'll see traces of a trail that takes you into a North Shore area with BIG drops.  We didn't take this route back, but we were told you can take this line back as an alternate return.\r\n\r\nWe retraced our route, and made our way back to the parking lot in behind the Burger King, which is in the Bayer's Lake (between Chain Lake and Lakeside) area.\r\n\r\nIf you have a 1/2 day or ideally a day to explore riding in the Halifax area, this is a must stop.  Other than Kanata Lakes area (South March Highlands, Ottawa area) where trails like 'Outback' give you a similar granite circuit, this would be one of the areas in Canada that most resembles Moab, at least in terms of giving you lots of rock to ride on.  It's quite continuous really, if you stop and think about it, Canada has a lot of granite, i think it's called the Canadian Shield, so, every major city in Canada should support a slick-rock area.  Better yet, whole granite slabs 100k or more are just waiting to be discovered and turned into riding meccas.\r\n\r\nA petition was posted at the start of the Whopper Dropper area, in an attempt to collect names and save it from the developer's bulldozer!  It would be a shame to lose an area so close to Halifax, and apparently, so very well used by local mountain bikers.  There is a North Shore circuit very close to the Burger King lot, just explore the slope facing Burger King, some nice ladders, rock bridges, and, it's enough to get good on before your visit to B.C.  The local trail group is called ECMTBA, and they are working with the city to preserve some or most of the area for mountain bikers.  If so, well done, and together with recent victories on the North Shore in Vancouver, and, OMBA (Kanata Lakes) in Ottawa, it seems that mountain biking is coming into it's own across Canada as riders band together to support riding in their municipality.  Whoo hoo!\r",
    "directions": "We rented bikes from \"Bike & Sea Rentals\" at Halifax Waterfront, near the old part of town. (902) 423-1185, www.harbourbikeandsea.com.  They provided an excellent map, and the peppy sales clerk was definately a rider herself so a map was quickly drawn for us, and off we went.  Maybe a 35 minute drive?  Locals will know it as Bayer's Lake area. Most bike shops will get you there, or call Harbour Rentals above.",
    "geohash": "dxf",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/2038/reg_IMG00037-20100626-1129-30507.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/2038/reg_Kurt2jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/2038/reg_kurtjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/2038/reg_powerlinejpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/2038/topo_clairerockjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/2038/narrow_kurt3jpg.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/whopper-dropper-near-halifax-ns-2038",
    "stats": {
        "Activities": "mtn-bike",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 5,
        "Time": "6 hrs",
        "Total Distance": "20 km",
        "Town": "Halifax, NS",
        "Type": "out-and-back"
    },
    "title": "Whopper Dropper",
    "trail_id": "2038"
}