{
    "description": "The larch meadows are on the way up to Frosty Mountain, in Manning Provincial Park, BC, 2.5 hr drive east of Vancouver. Return hike to the larches meadows is approx 5 hours (800 m up, 16 kms return), to Frosty Mtn peak is 7 hrs (1150 m up, 20 kms return) \r\n\r\nLarches are deciduous conifers. As their needles are not waxed, they turn gold in the fall, just like leafy trees. They grow only at approx 2000 m elevation, and are very old (see sign photo with info). They are generally found in the Rocky Mountains and Manning PP in south western BC is their farthest point west. Some are estimated to be 2000 years old.\r\n\r\nEarly fall is the best time to see them. At this time, they look glorious, with their black trunks and gold colour. On a clear day with blue skies, they look even better (see photo).\r",
    "directions": "Start at the Lightning Lakes parking lot, N49* 03.774 W120* 49.562, 1250 m elevation ($3 parking fee). The trail heads out at the east end of the lake. It's well marked and well groomed. It's 8 kms and 800 m up to the larches meadow, but only of moderate difficulty because of the good condition of the trail. At approx 6.5 kms, you'll come to the Frosty Creek Wilderness camp site, 1900 m elev, N49* 01.865 W120* 49.806, complete with camping sites, an outhouse and a cabin (you probably want to avoid going into the cabin. I would fear deer mites). \r\n\r\nAt this time of year, the snow starts just beyond the camp site. However, on Oct 8, 2005, the snow was just a sprinkling on the surface (see photos) and there was no problem walking in hiking boots. The larch meadow is at approx 2050 m elevation.\r\n\r\nThe summit of Frosty Mtn is at 2410 m, and on a clear dry day, can be reached approx 1 hr after the larch meadows. It is a treacherous hike up, so unless properly equipped and experienced, don't attempt this if there is snow on the ground. Also, on the way up to the summit, you can meet the trail up from Windy Joe. If you have 2 cars available, you can do a circuit hike \r\n\r\nNote: Please also see the other posting in called \" Mount Frosty\r\n\" on trailpeak, with pictures, comments, and, an alternate description.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/2041/reg_DSCF0490-24605.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2041/reg_DSCF0756-24605.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2041/reg_DSCF0769-24605.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2041/reg_DSCF2752-11335.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2041/reg_DSCF2767-11335.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2041/reg_FMFrostyCreekCamp0284.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2041/reg_FMLarches0278.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2041/reg_FMLarchessign0282.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2041/reg_FMPeak2346.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2041/reg_Frosty-Mountain-059-17659.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2041/reg_Frosty-Mountain-061-17659.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2041/reg_Frosty-Mountain-067-17659.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2041/reg_Frosty-Mountain-073-17659.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2041/reg_best1_FMFrosty0275.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2041/reg_larches.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/frosty-mountain-larch-meadows-near-hope-bc-2041",
    "stats": {
        "Activities": "snowshoe hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 4,
        "Time": "5 hrs",
        "Total Distance": "16 km",
        "Town": "Hope, BC",
        "Type": "out-and-back"
    },
    "title": "Frosty Mountain Larch Meadows",
    "trail_id": "2041"
}