{
    "description": "Just to the east of Jasper National Park and south of Hwy 16 is an unassuming mountain that often gets overlooked, dwarfed as it is by Roche a Perdrix and the Fiddle Range. But tucked in behind the summit of Folding Mountain is a heavenly pocket of Rocky Mountain wilderness that many environmentalists wish to see blessed with provincial or national park status. The hike is a bit of a grunt and there is no reliable water source. I polished off a 4 litre water bladder on my last trip and still felt dehydrated.From the pull-off, hike west along the south side of the highway for 300m, the trailhead is marked with a large yellow hiker sign. The trail starts innocently enough in a nice mixed forest, but soon begins the first of two big climbs on its way to the summit. Gaining over 400m in the first 2 kilometres the trail breaks out of the trees into subalpine meadows. Back over your shoulder are incredible views over the Athabasca River flowing out of range after range of mountains. These meadows are a fitting destination in themselves, especially in late September when the leaves in the valley below are changing colour. Gaining elevation at a more enjoyable pace the trail passes through a good kilometre of meadow before plunging back into the forest. There is an old campsite at 5 km, it is forest enclosed and has no reliable water source. Soon after the camp the second big grunt begins, but with open views over the foothills there is little to complain about. Gaining a saddle, the trail the trail switches to the other side of the ridge and views of the Rockies resume. The last push to the peak, on scree and rock, is not for the squeamish. I find it hard to believe that horses can make it up this section of the trail but I have met numerous cowboys who say it can be done. Having gained almost a kilometre of vertical, the views from the summit, like any other in the Canadian Rockies are spectacular. Sit, enjoy then return the way you came, or...This is just one of many trails carved out of the wilderness by local coal miners back in the early 1900's. It leads to the Miette Hot Springs, where the miners would go to convalesce after an accident in the mines. Stretching off to the southeast of the summit is an open ridge and the continuation of the trail. After a glorious five kilometres on the ridge the trail dips down in to the forest and connects with the Drinnan Creek Trail downstream of  Mystery Lake. It is 16 km one way from Hwy 16 to Mystery Lake.Another option is the ridge to the southwest which connects with the Fiddle Range, and leads straight to Fiddle Peak. It is an additional 5km one way and another 250 metres of vert to the summit of Fiddle Peak. It's reasons like this that you'll want to bring plenty of water on your hike to Folding Mountain. You'll also want to bring along the government topo 'Miette 83F4 NAD83' too.Submitted by 'mtncat'.  NTS Map 083F04",
    "directions": "Drive west of Hinton on Hwy 16 for about 15 minutes, 300 metres after the Folding Mountain Resort and Campground  (http://www.albertadirectory.net/foldingmtn/), park in the large pull-off on the south or left side of the highway.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/2046/reg_020-45904.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2046/reg_023-45904.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2046/reg_632-45904.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2046/reg_FoldingMtn.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2046/reg_MountainFrontPanoramafromFoldingMtn2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2046/reg_MountainFrontPanoramafromFoldingMtn3.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2046/reg_MountainFrontPanoramafromFoldingMtn_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2046/reg_map.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/folding-mountain-near-hinton-ab-2046",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 4,
        "Time": "7 hrs",
        "Total Distance": "14 km",
        "Town": "Hinton, AB",
        "Type": "out-and-back"
    },
    "title": "Folding Mountain",
    "trail_id": "2046"
}