{
    "description": "This is a nice family hike. Mind you there is a good climb over the Island to a lookout. \nThere are stairs and the trail is well maintained including many benches for little ones to rest. The climbs all have stairs dug into the trail. \nAfter getting to the end of the trail there is a wonderful lookout built like a light house. \nI was standing with my daughter on the lookout and heard a horrid screach Then suddenly two bald eagles appeared flying up from the cliffs, playing with each other in a gentle game of tag. They landed in cliffs nearby and we saw them a few minutes later fly away.  A highlight to share that experience with my daughter! \nI forgot the camera in the truck!",
    "directions": "In the town of Parrsboros drive past the ships company diner theatre and get up to the Ottawa House. Just before the road turns to gravel there is an entrance to a peninsula.  (The parking lot in Ottawa House does hook up with the road you want to get on). If you see signs indicating no exit or a turn around, don't fret your on your way! You should be on  Whitehaven Road. \nStop in the coolest little shop in Parrsboro. The Parrsboro Rock & Mineral Shop! Great fossils and rocks, I bought a cool arrowhead for 5 bucks!   There are fossils and even a back room museam. I'll go back and get something else just to support the shop!  they will also show you were you can legally hunt for fossils!",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/2049/reg_Partridge1-22378.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/2049/reg_Partridge2-22378.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/2049/reg_Partridge3-22378.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/2049/reg_Partridge5-22378.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/2049/reg_Partridge6-22378.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/2049/narrow_Partridge4-22378.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/2049/narrow_Partridge7-22378.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/partridge-island-near-parrsboro-ns-2049",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "2 km",
        "Town": "Parrsboro, NS",
        "Type": "out-and-back"
    },
    "title": "Partridge Island",
    "trail_id": "2049"
}