{
    "description": "NTS Map: 082G01\nElevation Gain: 1,100 m (3,609 ft).\n10/15/05. October is proving to be an interesting month weatherwise in the Southern Rockies. A couple of weeks ago, hiking was starting to look pretty dicy in most areas due to snowfall and associated dangers (avalanche, glissades, etc.)  However, what a difference a week makes! One more dump of snowfall and we probably would have bailed on Mt. Alderson, but after a week of warm, windy chinooks, most of the snow on the Alderson-Carthew trail miraculously disappeared. \nAccompanied by Trailpeak hiking editor, Brian Coffey, we departed Cameron Lake at 10:00 AM. After stopping briefly at Summit Lake, we arrived at the highpoint of the Alderson-Carthew trail at around 12:30, atop the ridge that overlooks Carthew lakes. We tried to eat our lunch here, but the location proved to be a veritable wind tunnel that concentrated many terrible gusts our way. We dropped down lower, towards the base of Mt. Alderson's long ridge, and felt some relief from the gales. From the ridge above Carthew Lakes, Mt. Carthew is the high peak to the left, while Mount Alderson can be attained by the ridge to the right of the lakes. We considered turning back at this point due to the wind, however we decided to make an attempt up the West (left) side of the ridge which was 'theoretically' more sheltered. \nThere are a couple of faint trails that can be discerned from the bottom of the ridge that go up either side. We were able to follow one most of the way up on the northwest side... Mind you, near the summit, the northwest side becomes a steep cliff! So we stayed on the southeast facing side of the last 'bump.' \nThe route up the ridge to the summit is pretty straightforward, although at times we had to deviate from the ridgetop to traverse around a couple of steep drops. At the summit, there are a couple of large rock cairns that resemble people from far away. On the return trip, we mistakenly followed a trail that dropped down directly to the Carthew Lakes, and we were forced to traverse along the steep slopes above the lakes for about 200 metres or so, as well gain a bit of extra elevation to re-attain the ridge. From this point we retraced our steps to Cameron Lake, although if you wanted you could walk out to Waterton townsite (to do this, you would need to park another car at the townsite, or arrange to ride the shuttle service).\nIn terms of difficulty, I gave this route a 'difficult' rating due to the elevation gain and distance (a tad strenuous, it took us about 8.5 hours with only brief stops along the way for lunch and pictures at the summit). Technically, it is mostly a walk-up with the elevation gain generally spread-out quite nicely with only a few steep sections... although that said,  we might've had to use our hands at a couple of spots.\nViews at the top did not disappoint! There were the lakes - Carthew and Alderson Lakes directly below to the West; Bertha and Waterton Lakes to the east; Nooney, Wurdemann and Carcajou Lakes to the south in Montana... Plus nice views of the peaks in all directions - notably Mt. Cleveland to the south and Vimy Peak and Chief Mountain to the east.\nDistance: 20+ kms\nClimb Rating: II (III) LM\nCurrent conditions:\n\nNote: This is a scramble. Be aware that scrambling can injure or kill you. Be prepared, know your limits and make sure somebody knows where you're going.",
    "directions": "For directions to the trailhead for Mt. Alderson, see the Summit Lake and Alderson-Carthew postings. Alan Kane's 'Scrambles' book also describes the route we took up in some detail.",
    "geohash": "c2wy",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/2050/reg_AldersonSummit2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2050/reg_DSC02687smljpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2050/reg_DSC02701smljpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2050/reg_DSC02710smljpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2050/reg_aldersonfromcarthewsmljpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2050/topo_mapcopyjpg.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mount-alderson-near-waterton-park-gate-ab-2050",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 5,
        "Time": "8 hrs",
        "Total Distance": "20 km",
        "Town": "Waterton Park Gate, AB",
        "Type": "out-and-back"
    },
    "title": "Mount Alderson",
    "trail_id": "2050"
}