{
    "description": "About a 40 minute bike climb to the Nkwala Saddle overlooking trout creek and Penticton.  From there you can either keep climbing to the tower or enjoy the nice bomb down to the west bench.  One of my fav singletrack downhills.  Lots of fun turns and a couple jumps.  Bike shop / rentals: Freedom Bike Shop Accomodations: Summerland Resort",
    "directions": "One of my favorite trails in the Penticton area.  Start at the Summerland KVR Trestle just past summerland sweets.  Go over the trestle and after about 2km there is a trail exiting to the right (see pics and gps data).You'll have to use the pics or data to figure out the rest, though there aren't many turns.  When you reach the saddle you can either continue up the road to the Radio Tower or cut off the trail to the left.The trail to the left is the start of a really fun downhill bomb that ends up in the west bench near the sage mesa golf course.  I generally ride back to Summerland on the KVR because I'm from there but you could start the loop in Penticton just as easily.  See you there.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/2051/reg_h1SmallJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2051/reg_h2MediumJPG_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2051/reg_h80MediumJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2051/topo_h38MediumJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2051/narrow_nkwala-topview_Large_.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/nkwala-mtn-jerry-mtn-dh-near-penticton-bc-2051",
    "stats": {
        "Activities": "hike mtn-bike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "5 km",
        "Town": "Penticton, BC",
        "Type": "out-and-back"
    },
    "title": "Nkwala Mtn / Jerry Mtn - DH",
    "trail_id": "2051"
}