{
    "description": "Great trail combo.  \r\n\r\nStart Moose horn, the first 1.5 km are a nice easy start through a forest with a mild descent. The next .5 is more cut backs and down hills and a little rougher but still a great trail. Then you make it to the river and the trail gets cool! It follows the river but please explore the \"river of rocks\" - wonderful cold pools and hundreds of nooks to explore and climb and even swim.  \r\n\r\nThe trail is hard to stay on and find at a few points but it follows the river, lots of berries and a little bear poop.  Anyway you'll walk along the river for 1.5 km and turn back towards the trail head for another 1 km then you're there. \r\n\r\nBefore you get to the waterfall you can join the Dobson Trail 50k or so that will let you walk straight to Moncton so you can ride the indoor roller coaster at Crystal Palace...\r\n\r\n\r\nAt the falls..\r\n\r\nBrings sandles, towel, a picnic and get wet! \r\n\r\nThe top of the falls are accessable and the bottom \r\n\r\nThen walk back to your car the walk back is pretty good only a little section that is tough.  \r\n\r\nMy 6 year old could handle it....\r\n\r\n\r",
    "directions": "Take 114 and turn up the Laverty waterfall. Its up near the end. \r\n\r\n\r\n\r",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NB/2053/reg_IM001446JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/2053/reg_lavertyfalls.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/2053/narrow_LavertyFalls400jpg.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/laverty-falls-and-moose-horn-trail-fundy-np-near-sussex-nb-2053",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 3,
        "Time": "4 hrs",
        "Total Distance": "7 km",
        "Town": "Sussex, NB",
        "Type": "out-and-back"
    },
    "title": "Laverty Falls and Moose Horn Trail Fundy NP",
    "trail_id": "2053"
}