{
    "description": "NTS Map: 082H04Elevation Gain: 1000 m (3,281 ft).The view at the summit of Mount Crandell is quite intriguing. One can see many interesting features of Waterton: the two main valley parkways (Cameron Lake highway and Redrock Canyon roads); the Waterton Lakes to the south; and vast open prairie to the east. To get to the top of Mount Crandell there are a number of different routes that can be undertaken. For the classic scrambling route up the Bear's Hump, see  Alan Kane's 'Scrambles in the Canadian Rockies'  We chose to go up the back route from Crandell Lake, which is a much gentler approach.  However, a warning! The route from the lake was described to us as 'obvious' by a couple of sources, but we found that it was not that obvious at all. Some route finding is required to ascend from the back... There are game trails all over the place and there seem to be multiple trails that people have taken on the way down. Indeed, we lost the trail at several points during the day and had to take it on faith on a couple of occasions that if we bushwhacked in a certain direction we would be able to intersect the true trail. And we always did.  It's pretty hard to get totally lost as you can see your destination off in the distance and the forest was comparatively easy for bushwhacking, if such a condition can be said to exist!Parking off the Cameron Lake road at the parking area for Crandell lake campground, we proceeded up the trail towards the lake. After about 20 minutes or so we hit an intersection where there was a signpost that indicated the lake was .4 kms further down and that Waterton town site was off to the right. To find the path to Mount Crandell, we were told by a reliable source to look for a trail that cut through the trees about 100 yards down the trail towards the town site. Well, we walked way further than 100 yards and never succeeded in finding the turnoff, so we walked back to the intersection and discovered a very faint trail nearby that made its way through the trees. It was heading in the right direction, so we decided to give it  a go.  After a few minutes up this trail we found a more definitive path that lead us up towards the first cliffband. We followed the path, skirting around the bottom of this first wall until we found an easy route to ascend the cliff. From this point, we followed the path up and found ourselves above a second set of cliffs, which we followed south with views of the highway below and snowy Akamina Ridge as a constant companion to the North. Continuing upwards and south, we made it on top of the first ridge directly below Mt. Crandell by about 12:15. Stopping for a quick bite on the ridge, we completed the last ridgewalk to the peak and were at the top of Mount Crandell by about 1:30.  We took another break at the summit, taking the time to examine the most alien looking weather station that has been constructed there, as well as a wood deck which is said to be a landing pad for a helicopter. Continuing past the summit to the ridges towards the south, there are really cool views of the lakes as well as some of the high peaks in Glacier National Park, Montana.Making our way back down the trail at approximately 2:00 PM, we were almost able to retrace our steps. With a bit more bushwhacking we were back at our vehicle by about 5:20 PM.Distance: 12kms returnClimb Rating: II (III) LM",
    "directions": "Once in Waterton, drive up the Cameron Lake Highway to the Crandell Lake parking area. There is a sign denoting the trailhead.",
    "geohash": "c2wz",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/2056/long_panoramasmlcopyjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2056/reg_0809082012-00-17314_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2056/reg_P8090703-17314.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2056/reg_P8090721-17314.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2056/reg_P8090723-17314.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2056/reg_P8090730-17314.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2056/reg_carsJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2056/reg_groupshotsmlJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2056/reg_map.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2056/reg_weatherstationJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2056/narrow_crandelllakesmlJPG.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mount-crandell-near-waterton-park-gate-ab-2056",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 5,
        "Time": "8 hrs",
        "Total Distance": "12 km",
        "Town": "Waterton Park Gate, AB",
        "Type": "out-and-back"
    },
    "title": "Mount Crandell",
    "trail_id": "2056"
}