{
    "description": "NTS Map: 083C03Elevation Gain: 365 m (1,197 ft).A trip to Nigel Pass, gateway to extended trips on the Brazeau Loop or South Boundary Trail of Jasper National Park, makes for a rewarding day hike in the Columbia Icefields area. The trail is actually in Banff National Park and passes through a pleasant combination of forest, avalanche slopes and flower filled meadows, as it makes a gentle approach to the pass. Only the last few kilometres to the pass pose any challenge to the healthy hiker. From the parking lot the trail crosses Nigel Creek and turns up stream. Alternately passing through forest and avalanche slopes as it makes its way to Old Camp Parker, a historic and prehistoric camp that is no longer in use. Just past the old camp a horse trail joins from left, after crossing two branches of Nigel Creek it leads to the Camp Parker Warden Cabin. The Warden Service still runs patrol on horseback in the Mountain Parks, from this cabin they can access over 500km of trail, in and out of the park. This trail, combined with a fire road to the trailhead can be used as an alternative route back to the parking lot.At 5km most of the forest is left behind and the climb to the crest of the pass begins. Gaining elevation at a good pace the terrain turns rocky and exposed and there is normally a good wind blowing over the pass. Take a jacket on this hike, its proximity to the Columbia Icefields makes the weather unpredictable.Strong hikers can extend a day trip in the area by messing around on the ridge, or descending to the floor of the Brazeau Valley, or as the local cowboys humorously call it, 'the Brazew' (Joseph would be rolling in his grave). It is also possible to push on, up to Cataract Pass and the boundary of the White Goat Wilderness. (http://www.cd.gov.ab.ca/enjoying_alberta/parks/planning/gateway/siteinformation.asp?id=397). This wilderness route has only a faint trail but extends down Cataract Creek to the Cline River, Pinto Lake and Sunset Pass. Be sure to pick up a good map if this is the plan.Both Jasper and Banff National Parks produce a free day hiking guide of this and many other trails in the parks, they are available from the Jasper, Banff, Lake Louise and Columbia Icefields Information Centres. For maps there are Gemtrek's 'Columbia Icefield' at 1:75,000 or the government topo 83 C/3 Columbia Icefield at 1:50000, available from the The Friends of Jasper.Submitted by 'mtncat'.",
    "directions": "While Nigel Pass is located in northern Banff National Park, it is most often hiked by visitors to Jasper National Park. Drive south of Jasper on Hwy 93 for 118km to the parking lot on the left side of the road, or north of Lake Louise for 116km.",
    "geohash": "c3k",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/2059/reg_BeyondNigelPass.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2059/reg_NigelPassfromParkerRidgeJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2059/reg_ParkerRidgefromNigelPass.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2059/reg_map.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2059/narrow_DSC-2840-29667.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2059/narrow_DSC-2853-29667.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2059/narrow_DSC-2877-29667.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/nigel-pass-near-jasper-ab-2059",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 5,
        "Time": "6 hrs",
        "Total Distance": "14 km",
        "Town": "Jasper, AB",
        "Type": "out-and-back"
    },
    "title": "Nigel Pass",
    "trail_id": "2059"
}