{
    "description": "A 60 km network of beautifully scenic paths for non-motorized use only meandering through a wide variety of habitats in the forest heartland surrounding Shabomeka Lake in the Madawaska Highlands of the Land O' Lakes region of Eastern Ontario.  Ski touring in the winter.\r\n\r\n Under the Occupiers' Liability Act, path users are deemed to willingly assume the risks of injury.  Exemplary consideration for the paths and for others is expected of all users.  Those with motorized vehicles are of course asked to refrain from using or altering the paths.\r\n\r\nUse of the Shabomeka LEGPOWER Pathfinders paths implies a responsibility on the part of the user to regard their use, whether on private property or Crown Land, to be a privilege, not a right.  You are expected to conduct yourself as a guest, not an intruder.\r\n\r\nPath Access Fee:  None\r\n\r\nPath Network Map:  Free at the pathhead, or send a self-addressed stamped envelope to; Shabomeka LEGPOWER Pathfinders, P.O. Box 217, Cloyne, ON  K0H 1K0.",
    "directions": "The sLp path network is just southeast of Bon Echo Provincial Park.  3.7 km north of Cloyne turn east off Hwy 41 onto Head Rd. at the south end of Mazinaw Lake. Pass Cedar Lodge, cross the bridge.  Just past LenCliff Campsites (1.0 km from Hwy 41) turn left onto Shabomeka Lake Road for 5.7 km to a short causeway, where Shawenegog Lake Lane begins.  After 0.4 km turn left into driveway 1067 marked PEARCE 22/23/EKELI (Norwegian for 'Sheltering Oaks').  The pathhead is 1067B.  Parking areas are shown on the map.\r",
    "geohash": "drcpk",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/ON/2083/reg_IMG-0337-53021.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/2083/reg_shab2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/2083/reg_shab3.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/2083/reg_shab6.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/2083/reg_shab7.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/2083/topo_shab1.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/shabomeka-trail-network-near-actinolite-on-2083",
    "stats": {
        "Activities": "snowshoe hike ski-bc mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 5,
        "Time": "3 hrs",
        "Total Distance": "60 km",
        "Town": "Actinolite, ON",
        "Type": "out-and-back"
    },
    "title": "Shabomeka Trail Network",
    "trail_id": "2083"
}