{
    "description": "A little-known summit, with views to rival the other more \"popular\" destinations.\rFrom the clearing/parking area the trail takes off at a fairly steep incline. However, since this entire \"hike\" is less than a 200m gain, the steep part is brief! After a few minutes in the trees, the trail breaks out onto the ridge and into the sprawling meadows. \rThe trail basically follows the ridge to the summit, first on the North side, then to the South as if to give the user the best views of both!\rOnce at the first \"false\" summit, the trail levels and passes through an area that seems to be made for pitching a tent! Another quick rise brings you to the true summit.\rFrom the summit, the trail continues down to some lower viewpoints.",
    "directions": "Drive East on Chilliwack Lake Road for about 30kms until you reach the Foley Lake turnoff, then turn LEFT. Set your odometer to ZERO.\rAt 2km, you will cross a bridge. Veer LEFT again and continue.\rAt about 3.5km, you will cross another bridge over Chipmunk creek.\rNear the 6.5km mark you will see the turnoff to Mt. Mercer on your right.\rReset your odometer. The first 2.5km of this logging road is flat, smooth and wide...but don't be fooled; the remaining 5.5km are rough, rutted and narrow.\rNear the 6 km mark, you will encounter the first of five water crossings. Between the third and fourth is a nasty washout where the road has collapsed upon itself. Only skilled drivers should attempt going any further. The road leaves the forest soon afterward and climbs steeply past open meadows along the hillside.\rAt the 1520m level (near the 8km mark) you will encounter a bit of a clearing; the trailhead. Although the trail appears to be a driveable road, it quickly deteriorates into a steep, one-track footpath.\rFrom the Chipmunk Bench FSR. allow 1 hr of driving to reach the parking lot/trailhead. From the trailhead to the summit is about 1/2 hour.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/2098/reg_mercerjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2098/topo_mercermapjpg.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mt-mercer-trail-near-chilliwack-bc-2098",
    "stats": {
        "Activities": "mtn-bike ski-xc ski-bc hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "0 km",
        "Town": "Chilliwack, BC",
        "Type": "out-and-back"
    },
    "title": "Mt. Mercer trail",
    "trail_id": "2098"
}