{
    "description": "NTS Map: 083C06Elevation Gain: 40 m (130 ft) to Beauty Creek, then 110 m (361 ft) to Stanley Falls.The short walk up Beauty Creek to Stanley Falls is a pleasant outing along a waterfall studded canyon. Hidden just to the north of the overwhelming Columbia Icefields area of Jasper National Park, this trail is a perfect cloudy day option. Until the relocation of the Icefields Parkway in the 1960's this canyon used to be a road side attraction, as indicated by the heavily impacted and braided trail system along the canyon. Please Note: There are no guard rails along this canyon and views into its depths are not easy to come by. Enjoy the waterfalls from a safe distance and pay close attention to your children.This trail starts on picturesque Beauty Flats, an important wintering area for woodland caribou, a species at risk ( Species At Risk) in Canada ( Caribou in Jasper). In hopes of reducing caribou road kill along this stretch of the Icefields Parkway, Parks Canada has installed a seasonal twenty kilometre long 70km/hr wildlife zone. Please do your part in ensuring the future of this beautiful animal in our National Parks.The trail runs across the top of a berm from the parking lot then dips through the trees before connecting with the old highway. Turn right and follow this road to the old bridge site over Beauty Creek at 800 metres. Turn left and follow the curving canyon for another 800 metres, taking in the waterfalls as you go.The end of the official trail is Stanley Falls, a picturesque waterfall plunging into a round pool, though there is no signage to indicate this. A better way to define the end of the trail is by associating it with the end of the canyon. When the trail spits you out on the creek bed, it's time to turn back.Unless of course you're a waterfall addict, then you might be persuaded to push on another 2km using snippets of trail and the creek bed itself. The goal of this slippery and ankle twisting journey? A trio of waterfalls, each a glory in itself, cascading down a head wall. Beautiful to see but virtually impossible to get a picture of, take them in before turning back.Submitted by 'mtncat'.",
    "directions": "Drive south from Jasper on the Icefields Parkway (Hwy 93) for 86km to an unmarked parking lot on the east (left) side of the road, one kilometre south of the Beauty Creek Hostel. (http://www.hihostels.ca/hostels/Alberta/NorthernAlbertaRegion/BeautyCreekHostel/Hostels/)",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/2099/reg_BeautyFlatshorizontalJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2099/reg_CaribouonBeautyFlatsMay99JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2099/reg_DSC01378-11997.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2099/reg_IMG-2632-50761.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2099/reg_IMG-2993-23863.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2099/reg_IMG-3002-23863_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2099/reg_IMG-4622-50761.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2099/reg_IMG-4626-50761.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2099/reg_IMG-4645-50761.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2099/reg_IMG-4647-50761.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2099/reg_map.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2099/narrow_DSC01382-11997.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2099/narrow_DSC01383-11997.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2099/narrow_DSC01387-11997.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2099/narrow_DSC01389-11997.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/beauty-creek-and-stanley-falls-near-jasper-ab-2099",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "6 km",
        "Town": "Jasper, AB",
        "Type": "out-and-back"
    },
    "title": "Beauty Creek and Stanley Falls",
    "trail_id": "2099"
}