{
    "description": "NTS Map: 092J02 \nRiver runs through it is still one of the most popular trails in the Whistler area.  What's nice about \"river\" is that the elevation gain is relatively small, the trail is mostly flat, but there are lots of obstacles, log rides, with easy out options for friends who aren't up to it (or those who do not fall victim to peer pressure).  And many of the logs that are there have a small \"penalty box\".  Mind you, if you attempt to ride the 30 foot long log over the namesake river, the penalty box is a wet and cold one.  The log is wide enough though, most intermediate riders can get over it.  This ride is still a lot of fun. The way we access the trail, we park at Alta lake at as marked on the map (10U 501223E, 5551800N).  There is a nice beach and picnic area there, and we sometimes get in a quick game of beach volleyball while there.  To get there from Whistler, carry on past Nesters on highway 99, and turn onto Alta Lake Road at Alpine Meadows. Follow Alta lake road (past the trailhead) to the Parking lot at the picnic area on Alta Lake. You will also see signs for Rainbow Park once you turn off Hwy 99, keep an eye out for those. Once ready to ride, exit the parking lot and follow Alta Lake road the way you came in, not far, until you reach the trailhead as marked. The trail entrance is simply a clearing in the bushes, the first 'largess' clearing that you descend into.If it's mid-summer, cool off after your ride in Alta lake which isn't too warm, but sweet just the same.  A great trail to practice technique and have some fun.\nYou will notice, from the attached GPS track, that coverage was fairly poor once on the trail, however the track could be very useful to locate the trail entrance, which you otherwise have to look for. You won't get to the sign posted by the Whistler Offroad Trails Association until you ride in a bit).  Waypoint #2 attached is off the road at the Northern Entrance from the Trail as coming from Alpine Estates, there is a small parking area there as well, which is also close to the Rainbow Falls Parking area (hiking trail) on the opposite side of the road. Disregard the rather large blue section of the GPS track attached (looks like it could be the road, it is not).  I took a detour up a powerline hiking trail (with bike) for a nice view back on Alta Lake and Whistler, an option if you did not burn enough energy on \"River\".",
    "directions": "See description and / or GPS",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/21/reg_DSC01118.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/21/reg_DSC01121.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/21/reg_Mountain-Bike-223-15290.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/21/reg_RiverRTI-01-30144.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/21/reg_RiverRTI-04-30144.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/21/reg_RiverRTI-06-30144.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/21/reg_RiverRTI-07-30144.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/21/reg_topo_riverII.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/21/topo_alex1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/21/narrow_RiverRTI-09-30144.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/21/narrow_mb2-15290.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/a-river-runs-through-it-near-whistler-bc-21",
    "stats": {
        "Activities": "mtn-bike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "3 km",
        "Town": "Whistler, BC",
        "Type": "out-and-back"
    },
    "title": "A River Runs Through It",
    "trail_id": "21"
}