{
    "description": "NTS Map: 082G16Elevation Gain: 492 m (1,614 ft).Editor's note: Trip took 18 hours of activity over 3 days\r\n\r\nI am a hiker with a passion for exploratory, off-trail trips and I am an outdoor gear sales rep with a need to field test the gear that I sell. Therefore the idea of an exploratory backpack through the southwestern part of Bob Creek Wildland Provincial Park with the Livingstone Fire Lookout as the destination was particularly appealing. On the two occasions that I had hiked Little Whaleback Ridge I had gazed across the intervening ridges and valleys towards the Livingstone Ridge and wondered whether a route could be navigated from Bob Creek Trailhead, cross country to the fire lookout. On the Remembrance Day weekend of 2005, I had gear to test and a backpacking companion willing to explore untracked off-trail territory, Livingstone Fire Lookout and the ridges of Bob Creek Wildland Provincial Park beckoned.\r\n\r\nDay 1 - Jerome and I left the Bob Creek trailhead at 9:15 am on November 11 after a three hour drive from Calgary. We started off hiking along the Designated OHV Trail that passes through the Black Creek Heritage Rangeland and leads into the Camp Creek Valley. At 'WP03-OHV Intersection #2', we took the left fork and continued for a short distance along the road heading to the south-west. At 'WP04-Start Off-trail', we left the road and headed cross country looking for a safe place to ford Camp Creek. We forded the creek at 'WP05-Camp Creek Xing' and began a steep ascent to the un-named ridge between Camp Creek and Miles Coulee. We traversed this scenic, undulating ridge between 'WP06-Start Ridge Traverse' and 'WP07-End Ridge Traverse' before descending to a small col where we crossed an OHV trail at 'WP 08-OHV Road Xing'. From this point we followed game trails to contour around an un-named high point before descending into a small tributary of Miles Coulee Creek in search of a suitable campsite. A water source and a supply of firewood was found at 'WP09-Campsite 1' and we set up our shelters and settled in for the night. \r\n\r\nThe gear that I was testing on this trip consisted of an Integral Designs Sil Shelter, an Integral Designs eVent Micro Bivy and a Big Agnes 60 inch Insulated Aircore Mummy sleeping pad. I was looking for lightweight and with the Sil Shelter tarp weighing in at 16.5 oz (470 g); the Micro Bivy weighing in 18.5 oz (685 g) and the Insulated AirCore weighing in at 17 oz (482 g) a lightweight sleeping system was what I got. Because I was depending on a sleeping bag rated at 35F (2C) I needed my shelter to be capable of protecting me from whatever the late fall weather gods could throw at me. I needed protection from high winds, below freezing temperatures and the possibility of snow. Everything worked as well or better than I had hoped. While I did augment my lightweight sleeping bag by sleeping fully clothed the Big Agnes Insulated Air Core provided me with an exceedingly comfortable night's sleep. The short 60 inch length (I'm almost 5' 11\" tall) required me to put my pack under my feet but this didn't present any hardships. The Integral Designs Sil Shelter was easy to stake down and pitch, using my hiking poles in place of a tent pole set. It pitched tight as a drum and was not affected by the gale force winds that blew for most of the second night. The Integral Designs eVent Micro Bivy proved to be exceptionally breathable and allowed for no condensation to soak my down sleeping bag. Everything worked well and I slept warm and comfortable, protected from the elements by my lightweight sleep system.\r\n\r\nDay 2 - It was cold during the night and though I slept well in my lightweight shelter system, it wasn't much fun packing up and trying to cook breakfast in below 0C temperatures. My Butane stove didn't perform all that well in the cold and it took longer that usual to bring water to a boil for a hot cereal and hot chocolate breakfast. At 10:00 am we left the campsite and began our ascent to the fire lookout. Our idea was to take a fairly direct route out of the small valley that we had camped in and to climb to the ridge to the south west of the campsite and then to find the old access road to the lookout. The going was tough in places as we were definitely establishing our own route as there were no established trails to follow. The terrain got steeper and the snow cover deeper as we ascended. When we finally made the crest of the ridge, I made a critical error by assuming that the access road was on the east side of  Livingstone Ridge instead of  on the west side of the ridge we were standing on. Instead of checking my map and verifying our location with my GPS, we blundered on in search of a road that was literally a stone's throw away. A look at the track overlay show that at one point we were only about 50 metres away from the road. Instead, we ended up with a brutal ascent up steep, snow covered rock and grass to viewpoint that revealed the road to be just below us. A quick descent and we were on the access road where we stopped for a break and a snack at 'WP10-Fire Lookout Access Road'. After our break, we started the long hike up the access road to the fire lookout, arriving at the wind swept but sun bathed summit at 2:30 pm, 4.5 hours after we had left camp. The GPS track of the present road does not follow the road on the map and the access road appears to have been re-routed at some time. The new road appears to be slightly longer and maybe a little steeper. Another break, another snack and we were soon on our descent from the lookout to the valley below, to the south-east. We took a direct route down a drainage gulley that was quite steep and the snow covering made the descent quite tricky and the footing was often treacherous. Later in the winter with more snow cover, the potential avalanche hazard would make this descent route too risky. At 4:10 pm we were safely in the valley and had found a suitable campsite at 'WP12-Campsite 2. Shelters were pitched, water was drawn, firewood was gathered and again we settled in for the night. A hot dinner, a blazing campfire and the aches and stiffness of a hard day's travel began to ease up. \r\n\r\nDay 3 - Last night, though the temperature was -5.6C in my shelter and the wind howled for most of the night, I slept well. In the morning though, the last thing I wanted to do was mess around with a balky canister stove to make hot cereal and hot chocolate. I had stoked up with excess calories the previous evening while sitting around the campfire so I was good to go without an early breakfast, I would snack while hiking throughout the day. By shortly after 9:00 am we were on the trail and faced with a steep ascent to the crest of the ridge to the east of our campsite. From the ridge crest we dropped down into a drainage that ran to the southeast, eventually running into Camp Creek. At 'WP13-Start trail' we came upon a double track trail that we followed until we intersected the designated OHV trail at 'WP14-Intersection with OHV Trail'. We followed the OHV trail to the next intersection 'WP15-OHV Intersection #1' where we took the left hand fork and hiked east along the OHV trail until we got close to the OHV ford of Camp Creek. At this point, 'WP16-Start Off-trail' we decided that the OHV ford would provide for a cold, wet crossing and we went off-trail in search for a suitable 'hiker's ford'. The problem was that Camp Creek was running deep, wide and fast and we didn't have much luck finding a dry ford. We hiked upstream all the way to our Day 1 ford at 'WP05-Camp Creek Xing', only to find that conditions had changed during the intervening two days and this ford was no longer safe or dry. The water was running higher and new ice made the ford impossible to use. Approximately 1 km farther upstream we eventually found a shallow place in the creek that could be spanned by a dead tree that we found nearby. We forded Camp Creek at this point, '17-Camp Creek Xing', worked our way around a sidehill and through a bog to find a trail running east along the north side of a fence line. At 'WP18-Gate/OHV Trail', we rejoined the OHV trail and passed through the open gate. Hiking south along the OHV trail brought us back to 'WP03-OHV Intersection #2', where we took the trail that continued south, heading back to Bob Creek Trailhead. Shortly after passing through the gate at 'WP02-Forest Reserve Boundary', we came to an alternate trail at 'WP19-Start Alternate Trail'. The OHV trail to the left would take us up a short but very steep hill, while the hiking/biking/horse trail to the right avoided the steep climb and allowed for a much easier route. We were tired after three days of off-trail backpacking so we opted for the easier way and followed the right fork as it meandered downhill through open pastureland before rejoining the OHV road at 'WP20-End Alternate trail..\r\n\r\nWe were back at the trailhead, in our vehicle and on the road back to Calgary by 3:00 pm. By 6:00 pm my co-adventurer, Jerome, and I were back in Calgary where we rewarded ourselves with well-earned pizza and beer. The trip was a success, we were able to find a viable cross country backpacking route from Bob Creek Trailhead, through Bob Creek Wildland Provincial Park to Livingstone Fire lookout and back. It was three days of good backpacking, good weather, good route finding and good company.",
    "directions": "Turn west off Hwy 22, just north of the Oldman River bridge, and keep right at the junction just beyond. Travel on the main road for 13.5 km and park at the Bob Creek Trailhead at the end of the gravel road past Bobs Creek/A7 Ranch buildings.",
    "geohash": "c2y",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/2118/reg_CIMG0021.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2118/reg_CIMG0035.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2118/reg_CIMG0036.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2118/reg_LivingstoneFireLookoutBackpack_2005-11-11to13013.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2118/reg_LivingstoneFireLookoutBackpack_2005-11-11to13016.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2118/reg_topo_Copyofmap.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2118/topo_LivingstoneFireLookoutBackpack.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/livingstone-fire-lookout-backpack-from-bob-creek-trailhead-near-blairmore-ab-2118",
    "stats": {
        "Activities": "snowshoe hike",
        "From": "",
        "Seasons": "spring fall",
        "Stars": 4,
        "Time": "24 hrs",
        "Total Distance": "30 km",
        "Town": "Blairmore, AB",
        "Type": "out-and-back"
    },
    "title": "Livingstone Fire Lookout Backpack from Bob Creek Trailhead",
    "trail_id": "2118"
}