{
    "description": "NTS Map: 083C04\nElevation Gain: 30 m (98 ft).\nValley of 5 Lakes Trail is one of the most popular bike (and hike) circuits in the Jasper area.   Complete time above is for biking. There are lots of ups and downs, a few steep technical descents, but overall, a very scenic cross-country mountain bike with natural obstacles (you won't find ramps and ladders in any National Parks).  The trail gives you some great views and takes you past some scenic green lakes, and some trickling streams. \nApproach in either direction, start at Old Fort Point if you want an uphill ride, begin at the intersection of HWY 93 if you want a mostly downhill ride.  Most people ride the trail down. The complete loop can be done in under two hours - if you are really moving.  Camping at Whistlers nearby makes this an ideal choice.\nAlthough there are a few options along this trail (i.e. trails 9, 91, 9b, 9c), the GPS track here follows trail 1 from the parking in Old Fort Point, continues on 9, then 9a (above the first lake), then cutting down on 9b instead of continuing around all the lakes.  \nThen the final 1k on trail 9a to HWY 93.  Again you can approach in either direction. The topo map actually shows some of  the other trail branches.",
    "directions": "See description and / or GPS",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/212/reg_hwy.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/212/reg_interlake1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/212/reg_lake1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/212/reg_stream.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/212/topo_5laketopo.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/212/narrow_IMG-0272-39275.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/212/narrow_trail.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/valley-of-5-lakes-near-jasper-ab-212",
    "stats": {
        "Activities": "hike mtn-bike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "6 km",
        "Town": "Jasper, AB",
        "Type": "out-and-back"
    },
    "title": "Valley of 5 Lakes",
    "trail_id": "212"
}