{
    "description": "The Saint Croix River is an historic water way used for logging more than a century ago. Now, this flow of water is a first class canoeing and back country camping destination that runs the border of USA and Canada. It's a great learning river for canoe trippers who want to get a taste of white water, with its mostly class I and II sections.I am one of a group of teachers who take high school students on an annual Autumn canoe trip. This is the second time I have visited this area, and by now, we have our route dialed, in terms of what distances novice high school students can accomplish.Our let in location takes us across the border in St. Croix  / Vanceboro, and right across the road from C&C Canoe outfitter. Instead of taking our own boats, we simply rented from him, and he arranged the drop off and pick up plan. You can also make arrangements with him to deliver your car to a take out spot, and use your own canoe.The River is Dam controlled, and you can look at flow rates using this link. Dam control means that the river can be run through the summer into mid October before levels drop. Our plan is to put in at Vanceboro, and paddle to Little Falls for our over night stay, and a chance to play in the small and only section of class III white water. I have waypoints marked in my data for camp sites and lunch spots. More aggressive paddlers will cover greater distances than we did. Riverside signs indicate camp sites. Treat your water accordingly.Our first night was essentially car camping in the Spednic Lake district, where there are primitive sites. At the right time of day, you'll probably see a moose. We did on one occasion. Camping is free and there are fire rings and pit privies. The view of the lake in the morning is amazing with the mist on the water. The lake is just begging to be paddled, and could serve as your starting point if you wanted. The only barrier is the dam near Vanceboro necessitating a short portage.Within a half hour from leaving, we were into our first set of rapids at Windam and Elbow Rips. The water was lively, and we practiced eddy turns after each set, rafting up before and after section. Everyone was ecstatic with their paddle skills.We landed and ate a late lunch near Joe Georges Rips, and headed out to our night's stay at Little Falls. This area consists of two bluffs, and the rocky section narrows to increase the flow of water. There are ledges, huge rocks and fallen trees to navigate over, and around. On either side of the section are portage paths and camp sites. There are a few great vantage points for river scouting. Dirt road access is available here as well.Our final day brings us more class II sections, but with the skills learned from the previous day, we thread through most of these with ease. We arranged to take out at Scott's Brook. There is a dirt road that takes you back on the US side to route 6 and back to Vanceboro. My personal preference would be to continue down the river past Scott's Brook towards Loon Bay. There is a dirt road on the CAN side to take you back to highway 745 in New Brunswick. I am not sure of the condition of the dirt road, but it's a 5-6 KM road to the highway. I have plotted the waypoints and river route for the trip. You can purchase river maps at a scale of 1:30,000, or print off digital topos at a higher scale than 1:50,000. The topo map numbers 21G11 and 21G06. This is zone 19T on the GPS's UTM system.Some useful websites:Outfitter:http://www.cccanoe.com/water flow levelshttp://waterdata.usgs.gov/me/nwis/uv/?site_no=01018500&agency_cd=USGSFurther informationhttp://gorp.away.com/gorp/location/me/pad_stc2.htmhttp://www.sunrisecanoeandkayak.com/dir/saintcroix.htmShannon BurtEast coast editor",
    "directions": "Passing Oromocto, take route 3 at Longs Creek, and head to Thomaston Siding. Change to Route 4, and pass through McAdam into St. Croix. Spednic lake has park areas for camping your first night. Cross the border the following morning, and head to C & C canoe to your let in location.",
    "geohash": "f",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NB/2122/reg_LITTLEFALLSMIST.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/2122/reg_ONOURWAY.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/2122/reg_SCOUTING.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/2122/reg_SPEDNICLAKE.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/2122/reg_SPEDNICLAKEAM.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/2122/topo_RAPIDSIII.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/st-croix-river-near-mcadam-nb-2122",
    "stats": {
        "Activities": "river-kayak river-canoe",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 5,
        "Time": "16 hrs",
        "Total Distance": "33 km",
        "Town": "McAdam, NB",
        "Type": "out-and-back"
    },
    "title": "St Croix River",
    "trail_id": "2122"
}