{
    "description": "NTS Map: 082J14The French Creek area is a great early season snowshoe area. Being that the area is relatively high and close to the Continental Divide it usually gets plenty of early season snow. Also, though the area is close to the Chester Lake/Sawmill Trails and shares a trailhead with the Burstall Pass trails it is a less popular area. However the area is a great place to snowshoe and it offers a variety of snowshoe terrain. A warning though, a certain level of backcountry expertise is required in the early season as even the easy trails can often present a creek crossing or two over open water. The easiest route of course, is to follow the directions n Gillean Dafferne's 'Kananaskis Country Trail Guide, Vol. 1'. We chose to do something a little different, we chose to hone our skills in off-trail bushwhack snowshoeing.\r\n\r\nLeaving WP01, the Burstall Pass/Mud Lake trailhead, we followed the main trail until we came to the first intersection at WP02 where we took the trail to the left. Following this old logging road we soon crossed a wooden bridge/dam at WP03. The logging road began to be more overgrown but was still easy to follow. At WP04 we came to an intersection and took the trail to the right. We soon lost the trail and had to decide whether to descend to the creek and cross or to stay high and try to find the trail again. We decided to descend to the creek and cross to the other side at WP05. This decision introduced us to extreme backcountry snowshoe bushwhacking and in retrospect might not have been the best decision. We bushwhacked up a slope, down a slope, recrossed the creek at WP06 regained the old logging road and recrossed the creek at WP07. We then climbed up an incredibly steep, treacherous slope with lots of deadfall obstruction until we came upon a trail of sorts at WP08. We soon lost that trail and began to descend down to the creek flats where we came upon another trail and skier's tracks at WP09. We followed the skier's tracks across the flats towards the French Creek falls until we decided to turn around at WP10 and head back to the trailhead.\r\n\r\nWe followed the skier's backtrail to WP11 where we came to another creek crossing. After finding a logjam to cross on, we regained the trail and followed it until we were back to our WP07. We lost GPS satellite coverage for a while here so the track shows a straight line instead of following the old trail. It's not a short cut, stay on the trail until you get back to WP07. At this point we decided not to cross the creek and continue to follow the skier's backtrack. Instead we chose to stay on the east side of the creek and continue to follow our snowshoe backtrail. We then lost that trail, found another trail, lost it again, found it at or around WP12, bushwhacked a sidehill or two, followed an overgrown creek, descended an overgrown slope, stumbled out onto an old trail and found ourselves at our old WP04. This is when you really appreciate a good GPS and the learned skills to use it effectively. Maybe we should have crossed the creek at WP07 and followed the skier's backtrack along Dafferne's trail back to the trailhead. Oh well, if we wanted to do things the easy way we would have brought skies.\r\n\r\nFrom the intersection at WP04 it was easy snowshoe along our backtrack back to the trailhead. At some point along here my GPS batteries ran out and I didn't notice it until I got back to the trailhead and had to turn it back on to get my trip stats. That's why the GPS track shows a shortcut from the trail to the trailhead. Again, don't be fooled, stay on the trail.\r\n\r\nThis was an excellent backcountry exploratory snowshoe trip. The early season conditions were very good, with crusty snow in the morning and late afternoon and softer snow mid-day. The terrain was challenging but nothing that experienced snowshoers with backcountry experience, a good GPS and mountaineering snowshoes can't handle. This was my first trip on a pair of 25\" MSR Lightening Ascents. These shoes are MSR's latest model and handled everything I threw at them. They offered excellent flotation for my combined body/pack weight of 240 lbs in the snow conditions we encountered. The traction offered by their unique 360' traction system and their heel lifts allowed me to power up steep slippery slopes without any backsliding. As well at just over 3.5 lbs/pair, they are light on the feet. I'll have to see how they perform in deep powder but for now I am impressed.\r\n\r\nTrip Distance: 5.62 km; Total time: 5h, 18m; Elevation gain: 166 m; Maximum elevation: 2018 m.\r",
    "directions": "Take Smith-Dorrien/Spray Trail (Hwy 742) to Burstall Pass/Mud Lake Trailhead/Parking Lot.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/2124/reg_FrenchCreekLoggingRoads-Snowshoe_2005-11-20013x.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2124/topo_mapFrenchCreekLoggingRoads-Snowshoe_2005-11-20x.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2124/narrow_FrenchCreekLoggingRoads-Snowshoe_2005-11-20002sml.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2124/narrow_FrenchCreekLoggingRoads-Snowshoe_2005-11-20006sml.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2124/narrow_FrenchCreekLoggingRoads-Snowshoe_2005-11-20010sml.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/french-creek-logging-roads-snowshoe-near-kananaskis-ab-2124",
    "stats": {
        "Activities": "snowshoe",
        "From": "",
        "Seasons": "spring winter fall",
        "Stars": 3,
        "Time": "5 hrs",
        "Total Distance": "6 km",
        "Town": "Kananaskis, AB",
        "Type": "out-and-back"
    },
    "title": "French Creek Logging Roads - Snowshoe",
    "trail_id": "2124"
}