{
    "description": "NTS Map:92F2.  Mt Arrowsmith at 1819 meters is the highest mountain in southern Vancouver Island.  This hike will take you up Mt. Arrowsmith along the Judges route, the easiest and quickest way up.  The route is about 6 kilometers round trip, should take about 5 hours round trip and has an elevation gain of about 1000 meters.  This route is non-technical, but steep and some scrambling is required in the last third to reach the summit. Any fit person - with solid experience on steep ascents/descents, and comfortable with loose dirt and shale for much of the trail - should be able to do this route.  The 360 views from the top are fantastic.  On clear days you will be able to see the Coast Mountains, the mountains in Strathcona Park, the sea on the west coast and you even get to sign your name in the summit registry to prove that you made it.  In winter, bring an ice axe and crampons, snowshoes can also be useful.The trail begins from the parking lot by heading down the road the way you came up and making a left up the road. Keep going on this road until the very end (25 minutes) and you will see the trail start on your left.  For the next length of time keep following the well worn path and look for flagging.  You will also get chances to enjoy the views of the Port Alberni Valley and the mountains in Strathcona Provincial Park.  After about 2 hours you will come to a view point and if you look at Arrowsmith you will be able to see a radio tower.  Here you will want to make a right and head upwards.  Once at the top enjoy the views and sign the summit registry.  In summer prepare to share the summit with other hikers as this is a very popular hike.Caution: WINTER ASCENTS COULD INVOLVE AVALANCHE HAZARD, CHECK ONLINE REPORTS AT CAA, BE AVALANCHE AWARENESS TRAINED (CAA), CARRY WINTER GEAR INCLUDING TRANSCEIVERS.",
    "directions": "Follow highway 4 out to Port Alberni, at the top of the bump before Port Alberni you will see a sign for Arrowsmith Ski Hill sign, make a left here. In about 20 minutes you will be at the trail head, watch for logging trucks. Drive about 3 km and then turn left on Cameron River Main.  You will now start heading up a bit of grade.  The road itself is in good condition in this area.  Go for about 3 kms, look on your right for a road heading up (about the 4th road) with flagging.  You can drive your vehicle up here (very rough for cars), park near the boulders or go about 100 meters further and park on the left in a parking area.  Remember on the way back, you will come to a fork in the road, you want to make a right here. The road condition at the time was a bit rough but nothing most cars couldn't handle (assuming you don't mind roughing your car a bit) and all car based SUVs.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/2141/long_Arrow4.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2141/reg_2011-08-04-1333s-16063.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2141/reg_2011-08-04-1339s-16063.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2141/reg_Arrow1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2141/reg_Arrow2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2141/reg_Arrow3.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2141/reg_Arrowsmith1-10038.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2141/reg_Arrowsmith2-10038.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2141/reg_Arrowsmith4-10038_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2141/reg_DSC03182-37942.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2141/narrow_2011-08-04-1323s-16063.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2141/narrow_Arrowsmith3-10038.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mt-arrowsmith-judges-route-near-port-alberni-bc-2141",
    "stats": {
        "Activities": "climb snowshoe hike ski-bc",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "6 hrs",
        "Total Distance": "6 km",
        "Town": "Port Alberni, BC",
        "Type": "out-and-back"
    },
    "title": "Mt. Arrowsmith (Judges Route)",
    "trail_id": "2141"
}