{
    "description": "From the Takakkaw Falls parking lot. Follow the signed Yoho Valley Trail (north) pass Laughing Falls and on to the Little Yoho Valley Trail (west). This trail leads to the Stanley Mitchell Hut and .3 km more to campground #6. We camped two nights at this campground and used it as our base for this alpine climb and another scramble (Mt. Kerr).     \r\n \r\nThe accurate name of the routes is President/V.President(considered separately) as boring as it might seem. From the campground, head back to the hut and catch a trail heading right at the hut and past the wardens cabin. This trail immediately intersects the Little Yoho River. After crossing the river, follow it to the right for either of two approaches. Either continue on the trail as it follows the drainage and proceed up to the left hand moraine's edge dumping you on the glacier lower left, or gain the left hand moraine earlier by veering left off the trail as soon as you pass the sign marking the Kiwetinok Pass at 4k. Start glacier left, ascend and then traverse glacier right as you aim for the 'schrund towards the col. Once at the col, you can unrope and enjoy lower 5th class scrambling up either or both peaks. They both have summit registers. The crux is crossing the bergschrund, depending on conditions.\r\n \r\n In winter please check the \r\n Avaluator \r\n (Online Trip Planner) rating is:\r\n \r\n   Complex.  \r\n\r\n \r\n\r",
    "directions": "Yoho National Park is one of four Canadian National Parks adjoined in the heart of the Canadian Rockies (Banff, Kootenay and Jasper). The Trans-Canada Highway spits the park in half. Heading west on the Trans-Canada, as you approach the only town in the park, Field, BC, you will see a sign for the Yoho Valley Road on your right. Follow this road for 13 km to the Takakkaw Falls parking lot.",
    "geohash": null,
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/2143/reg_PikaYoho5jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2143/reg_President2jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2143/reg_President3jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2143/reg_PresidentBurgess1jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2143/reg_Presidentjpg.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/presidentvice-president-near-field-bc-2143",
    "stats": {
        "Activities": "climb",
        "From": "",
        "Seasons": "summer",
        "Stars": 5,
        "Time": "7 hrs",
        "Total Distance": "0 km",
        "Town": "Field, BC",
        "Type": "out-and-back"
    },
    "title": "President/Vice President",
    "trail_id": "2143"
}