{
    "description": "NTS Map: 082J11Elevation gain: 704 m (2,310 ft).The forested southern slopes of Kent Ridge offers a challenging and scenic early season snowshoe route for those who are willing to bushwhack their way through some lower elevation blowdowns. However the determined snowshoe adventurer will be rewarded with a fine viewpoint and a very enjoyable descent.Park on the north side of Hwy 742, just past an unnamed creek approximately 1 km west of the entrance to the Peninsula Day Use Area at GR302173(NAD83). We stuck to the ridge for our ascent and came down via the unnamed creek but you could reverse our route. Either way the first kilometre or so requires navigation through a maze of blown down trees. The creek route might have fewer blowdowns but the footing is more treacherous as you criss-cross the creek. Once you clear the blowdowns the forest begins to open up and the ascent gradually steepens. Eventually you come to open areas offering fantastic views of the Smith-Dorrien and Kananaskis valleys, as well as the Spray Mountains. Continue following the ridge to the north-west until finally a prominent knoll at GR288192(NAD83) comes into view. A final slog up through wind packed snow takes you to this prominent viewpoint that offers a panorama of fantastic views. On this day, the continuation of the Kent Ridge route to the north towards Mount Kent offered only windswept bare rock, inhospitable terrain for snowshoes. After taking a few pictures, we explored the area immediately adjacent to the viewpoint before beginning our descent. On this day there was not a lot of snow surrounding the viewpoint but there does appear to be a potential for cornices to form. Later in the season, with more snow on the ground, one would have to pick their routes with more care.The descent route was pure snowshoeing joy. We picked our way through the trees, plunge stepped and glissaded through the clearings. At times we followed fresh moose tracks and at times we laid down our own fresh tracks. This was what we made the ascent for! Off-trail snowshoe heaven! All too soon, the open forest was behind us and we had to forge our way through the final kilometre of dead fall and underbrush. Even this was not too bad and soon we were back on the highway and at the trailhead. The lower elevation deadfall will deter a lot of less determined snowshoers. But, believe me, your labour will be more than rewarded once you attain the upper slopes and the terrain that awaits you.Trip Statistics: Distance: 6.14 km; Total Time: 5 h, 46 m; Elevation gain: 704 metres; Maximum elevation: 2360 metresEquipment Review: You know how most hard shell waterproof/breathable garments are not really all that breathable for high aerobic winter activities. And how most soft shell garments are not all that waterproof when you spent most of your time offtrail beating through snow laden underbrush. And this of course leads to the old and tiresome winter ritual of add a layer, sweat, remove a layer, chill, add a layer etc. etc. Well Integral Designs feels your pain and your frustration and have been working with a new fabric eVENT for the past few years. This stuff is amazing, it is easily the most breathable waterproof fabric that I have ever used. It is almost as breathable as cotton but is easily as waterproof as any other hard shell fabric. Integral Design uses this fabric for some bivy bags and for a couple of outerwear garments. The Integral Designs eVENT Rain Jacket was primarily designed for summer use but I find that it is all I need for snowshoeing. It is a very lightweight, 270 gms (9.5 oz), waist length, hooded jacket. The hood is large enough to fit over a helmet and is very effective at keeping wind off the back of your head and snow from falling down the back of your neck. This jacket works, lightweight; waterproof; windproof; exceptionally breathable, and made by a company that understands Canadian backcountry conditions. And a an added bonus, you can use it a rain jacket in the summer. I am a sales rep for Integral Designs but I use the equipment that I sell and I wear the eVENT Rain Jacket for all my snowshoeing trips.",
    "directions": "Take Smith-Dorrien/Spray Trail (Hwy 742) to GR302173(NAD83). Park on the north side of the highway, near an unnamed creek approximately 1 km west of the entrance to the Peninsula Day Use Area.",
    "geohash": "c3n07",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/2149/long_Kent-Ridge-South-Summit-Kananaskis-Fun-descent-Jan-24-2016-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2149/long_Kent-Ridge-South-Summit-Kananaskis-Ridge-Jan-24-2016-2--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2149/reg_Kent-Ridge-South-Summit-Kananaskis-Jan-24-2016-17--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2149/reg_Kent-Ridge-South-Summit-Kananaskis-Summit-Jan-24-2016-7--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2149/reg_Kent-Ridge-South-Summit-Kananaskis-Summit-Jan-24-2016-8--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2149/reg_KentRidgeSnowshoe-023-0.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2149/reg_KentRidgeSnowshoe-026-0_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2149/reg_KentRidgeSnowshoe-027-0.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2149/reg_map.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2149/topo_KentRidgeSnowshoe-028-0.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2149/narrow_Kent-Ridge-South-Summit-Kananaskis-Lots-of-surprises-Jan-24-2016-44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/kent-ridge-near-kananaskis-ab-2149",
    "stats": {
        "Activities": "snowshoe hike",
        "From": "",
        "Seasons": "winter",
        "Stars": 5,
        "Time": "6 hrs",
        "Total Distance": "6 km",
        "Town": "Kananaskis, AB",
        "Type": "out-and-back"
    },
    "title": "Kent  Ridge",
    "trail_id": "2149"
}