{
    "description": "NTS Map: 082J11Elevation Gain: 501 m (1,643 ft).Gypsum Ridge is an unofficial name for this interesting ridge viewpoint offering excellent views of the Kananaskis Lakes valley and the surrounding peaks. You won't find this name on any map that I know of, the name is from my own fertile imagination. However it is a ridge and it adjacent to the Gypsum Mines road/trail so Gypsum Ridge it is. It would be a brutal bushwhack through dense willow thickets in the summer but as a winter snowshoe trip with enough snow to cover the willows it is an excellent route. It is however a route through steep terrain with avalanche potential under the right conditions, so I don't recommend you try this route without avalanche awareness/experience/training and the proper avalanche safety/self-rescue gear.Park on the side of Hwy 742 at GR290177(NAD83), maybe a 100 metres south-east of Blackshale Creek and look for an obvious clearing on the west side of the road. Work your way down the forested slope to Smith-Dorrien Creek and look for a safe crossing. We were able to safely cross on ice at GR288173(NAD83). Continue bushwhacking up through relatively dense forest on moderately steep terrain. With the snow covering the willow underbrush, the bushwhacking ascent is not too difficult. At GR290166(NAD83), you will come onto and cross the Gypsum Mines road/trail. It is critical that you do not come onto the road any further east along the road than this point as there are serious avalanche runouts crossing the road to the east. It is these runouts that make the traditional winter route to Gypsum Mines a riskier route.Cross the road and bushwhack uphill to the next road crossing at GR290165(NAD83) where you go to the left to start to follow the road for a short distance. At GR293165(NAD83) you leave the road and resume bushwhacking in a south-easterly direction towards the viewpoint at GR302161(NAD83). Shortly before you reach the east end of the ridge, the dense forest on the south side of the ridge ends, the views open up and the going becomes much easier. The views are exceptional, especially in winter and more than warrant the effort expended to get there. Return the way you came or, if snow conditions warrant it, explore alternate routes through un-tracked snow.Trip Statistics - Trip Distance: 6.24 km; Time: 5h, 16m (snowshoeing); Elevation gain:501 m; Maximum elevation: 2137 metresEquipment Review: Last year I took the opportunity to take a couple of outdoor training courses and a backcountry ski lesson. On a couple of the occasions the instructors noted how busy my pack was with all sorts of equipment attached to the outside. I had an avalanche probe, shovel, 'biners etc. attached to or dangling from my pack. They made the point that this equipment could catch on trees and bushes etc. and present a hazard in off trail situations. They showed me their packs where everything was packed inside but still easily accessible. That got me to thinking that Granite Gear's Latitude Vapor might be an ideal winter backcountry snowshoeing and skiing pack. At 60 litres, capacity it holds everything I need for a winter day trip (even my avi shovel and probe fit inside). It features two full length front zippers that provide quick and easy access to all my gear. At 1.2 kg (2 lbs, 10 oz) it is exceptionally light. It is also a very clean, narrow profile pack that doesn't catch on underbrush while bushwhacking. It has a very comfortable suspension system and rides very close and very tight to my back. I am a sales rep for Granite Gear but I use the equipment that I sell and the Latitude Vapor is the pack that I use on all my snowshoeing trips.",
    "directions": "Take Smith-Dorrien/Spray Trail (Hwy 742) to GR290177(NAD83). Park on the side of Hwy 742 approximately 100 metres south-east of Blackshale Creek",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/2150/long_Gypsum-Ridge-Kananaskis-Welcome-From-Rd-Mar-5-2016-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2150/reg_CIMG0045.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2150/reg_Gypsum-Ridge-Kananaskis-Summit-Mar-5-2016-3--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2150/reg_Gypsum-Ridge-Kananaskis-Summit-Mar-5-2016-7--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2150/reg_GypsumRidge_GR303161-Snowshoe_2005-12-03012.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2150/reg_map.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2150/topo_CIMG0030_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2150/narrow_CIMG0024.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/gypsum-ridge-gr302161-near-kananaskis-ab-2150",
    "stats": {
        "Activities": "snowshoe hike",
        "From": "",
        "Seasons": "winter",
        "Stars": 4,
        "Time": "5 hrs",
        "Total Distance": "6 km",
        "Town": "Kananaskis, AB",
        "Type": "out-and-back"
    },
    "title": "Gypsum Ridge, GR302161",
    "trail_id": "2150"
}