{
    "description": "Elevation Gain: 308 m\nDavis Lake Is a small lake located just outside of Mission with so many trails to explore that you \ncould spend several days there and never go on the same trail twice. Views of Stave lake, and 1 trail \nfrom Davis lake goes to Stave. \nI did this trail on my dirt bike but I thought it should be shared with everyone since its such a huge \nhidden network of trails. Watch for 4x4's, atv's, dirtbikes, mountain bikes.",
    "directions": "Take Hwy 7 east from Mission for about 10 kms. Turn left (north) onto Sylvester Road at the Husky \nStation. Follow Sylvester Road and keep right; after 15 kms it turns to gravel and begins to climb. \nFollow the gravel until you cross a bridge. Look to your left and you'll catch glimpses of Davis Lake. \nAt 3.7 kms you will see a road heading down on your left at an acute angle. Take the down road, \nand you'll see a couple of deep trenches. There are 2 or 3 trails on your right leading through trees; \nthey wind through forest over roots and stumps, with a little off-camber stuff thrown in. Rating is 2-\n3. \nYou will then find yourself on the other side of the trenches. For the more adventerous, you can \ncarry on to a spot in-line with the down road, where the road has been excavated and there's no \npath around. Follow trails through trees to a creek bed which eventually takes you to Stave Lake. \nYou'll find some mud holes along the journey. One area where the trail has washed away consists of \nabout a 20-foot section of difficult, off-camber terrain. This spot is a short 4 or 5-rated section. \nAfter that, it's rated 1-3, with a long, rock creek bed to go through, that usually has lots of water \nrunning through it, depending on the time of year. You'll come out at Stave Lake. You can go back \nto the main logging road, and there are numerous off-shoot trails, some of which go for a long ways, \nand others which are quite short. At km 6, you can ignore the road on the left; it leads to a locked \ngate and private cabins. At 7.1 kms (3.4 kms past the Davis Lake turnoff) you will come to a fork; \nstay right. Another fork .7 km later; stay left. You will soon find a wide-open area where people \ntarget-practice. \nBack to the main junction where you went left. Travel another .7 kms and you will find the 9 km \nmarker (just past the first corner after the shooting area). Turn left onto the trail here; watch for a \nbig stick with pink flagging tape marking a large sink-hole. The trail forks a short distance later; both \nare worth exploring as they are long trails leading to spectacular views and ridges, rating 1-2. Lots of \nrock, and the right fork is mildly steep. The left fork is pretty much one trail, with some steep drops \non the left. I seem to recall crossing a rock step/creek/waterfall, rating 3-4. I think it was more \nintimidating than tough. The trail doesn't go much further past that point, so if you're not \nadventurous then turn around at the rock step/waterfall/creek. Back to the beginning of the 9 km \ntrail. If you take the right fork at the first fork on this trail, there are numerous off-shoots. There's \nanother main fork shortly after that. If you head right, you'll find a lake with a little dock just to \nyour left. The trail has a lot of smally, whippy bushes, but keep going because you'll end up at a \ngreat view atop a cliff ledge where you will see two lakes, and a snow-covered mountain. If you look \nup the lake, you'll see an old BC Hydro power station. Back to the first fork at the beginning of the 9 \nkm trail. Again, go right. When the next main fork comes up, go left. I think this one takes you to a \nspectacular cliff area with a better view than the other fork described above. There's one spot that's \nnarrow, with long drops on either side. \nWould a GPS and topo map be worthwhile here, you bet. You can visually see where you are \ncompared to your parking spot, or other trails you've just been on.  Additionally, if you download the \nattached GPS data above (click download GPS), you'll have the GPS data in your GPS and can set \ngoto waypoints.",
    "geohash": "c2c0",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/2152/reg_davis.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2152/reg_davislake1.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/davis-lake-near-mission-bc-2152",
    "stats": {
        "Activities": "snowshoe hike mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 5,
        "Time": "21 hrs",
        "Total Distance": "35 km",
        "Town": "Mission, BC",
        "Type": "out-and-back"
    },
    "title": "Davis Lake",
    "trail_id": "2152"
}