{
    "description": "NTS Map: 082J14This is the first day of a 10 day backpacking trip from Kananaskis, along the Continental Divide, to Yoho National Park.Elevation gain - 75m (250') from Mt Shark parking area to Bryant Creek.Our \"V.I.P.\" taxi driver Terry picked us up in Canmore at 10.00 a.m. in pouring rain for our C$75.00 trip up to Spray Lake, dropping us off at the locked gate on the west side at 11.00 a.m. Internet directions indicated that this was only 1km longer than the normal starting point at Mt. Shark. I had however misread the info, which actually said the start was a further 10k along a 4x4 road at Cataract Dam. So a long 1st day of 25k carrying 11 days' food! We set off along the road skirting the lake, with me telling Anne (who was feeling a bit nervous about the bears) \"You'll be lucky to even see a grizzly for the whole trip\". We saw our first grizzly an hour down the track!!! Luckily he saw or heard us first and took off into the forest. This set the scene for the rest of the trip; with calls of \"Aay-Oh\" (which we were told is the sound that carries best) and \"Coo-ee\" which we soon found was more penetrating, every 3 or 4 minutes. We felt fortunate to also see a coyote, bald eagle and various ground squirrels that first day.Even though it was a longer way, the views over the lake, Cataract Dam and Turbulent Gorge made it more interesting than the Mt. Shark route. When Bryant Creek shelter finally appeared at 8.15 p.m. it was greatly appreciated - we had it to ourselves and surprisingly had not seen another human all day. After showers of rain all day the woodstove and dry bunks were fantastic. Our main conversation over the evening meal of pasta involved bears and how free of rubbish the tracks were. The shelter would sleep 20 hikers and was spotless with absolutely no graffiti. A sign on the toilet door and a gnawed toilet seat reminded us again to be ??bear aware'.Next trail segment is Lake Magog Trail",
    "directions": "See description and / or GPS",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/2154/reg_240820051129AM0001jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2154/reg_24082005309PM0001jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2154/reg_24082005310PM0001jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2154/reg_map.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/spray-lake-road-to-bryant-creek-near-kananaskis-ab-2154",
    "stats": {
        "Activities": "snowshoe hike ski-bc ski-xc mtn-bike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "7 hrs",
        "Total Distance": "25 km",
        "Town": "Kananaskis, AB",
        "Type": "out-and-back"
    },
    "title": "Spray Lake Road to Bryant Creek",
    "trail_id": "2154"
}