{
    "description": "NTS Map: 082J14This trail is an extension of the Bryant Creek Trail .Note: Attached GPS data goes from Bryant to Assiniboine Pass only, Lake Magog is 3km further, but this gives you most of it and the elevation profile of the pass.Elevation gain - 320m (1,050').A late start at 11.45 a.m. after a much needed good nights sleep. A perfect day with blue skies and our first really good look at The Rockies - amazing! So different to Australia, at first they all appear grey but we are constantly intrigued by the diversity of rock types, conglomerates, grey slate, sandstone, limestone and the variety of colours including green, purple and pink. Before leaving Canmore we bought five 1:50,000 topo maps - Spray Lake, Assiniboine, Banff, Lake Louise and Goodsir. These were invaluable; even though every track junction is well signed, you need to know the passes along your route, not just your final camping destination. They were also handy to identify surrounding peaks and there were plenty of them! The route turned left at Bryant's Warden Lodge with its corral and additional shower/sauna shack to contour up past Marvel Lake - a long turquoise glacial lake set in a lodge pole pine forest valley. Lunch was at the track junction before our first real climb over Wonder Pass which was made easier by expectations of views of Mt. Assiniboine (Canada's Matterhorn). We met our first hikers heading in the other direction - they all said we were going the hard way, as they started from Sunshine Meadows. As we approached Assiniboine Lodge we met more day hikers who had helicoptered in and would later helicopter out. The cabins situated not far from the lodge were very tempting at C$15.00 a head, but as the weather was fine and the campsite on Lake Magog was right below Mt. Assiniboine's peak, how could we not camp! Arriving at the campsite at 5.15 p.m we found our first anomaly in Canada's Parks booking system. We had booked and paid for our annual wilderness passes and 10 campsites (including this one) over the internet, only to be told by a friendly ranger (after we had shown him our receipt) that as this was a Provincial Park (Mount Assiniboine) not a National Park we needed to pay a $5.00 per person camping fee - confusing, but it was still worth it with toilets and drinking water laid on and that magnificent scenery - still a bargain we thought and we got our $10.00's worth of his local knowledge and good humour. Later that evening we couldn't believe our eyes, another hiker walked into camp with a full sized axe strapped to the bottom of his pack - wonder what other goodies he was carrying inside the pack - we think he came from somewhere south.",
    "directions": "Bryant Creek (see Bryant Creek Trail )",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/2155/reg_250820051213PM0001jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2155/reg_25082005346PM0001jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2155/reg_25082005346PM0002jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2155/reg_25082005455PM0001jpg_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2155/reg_25082005517PM0001jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2155/reg_map.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/bryant-creek-to-lake-magog-assiniboine-wonder-near-kananaskis-ab-2155",
    "stats": {
        "Activities": "snowshoe hike ski-bc ski-xc",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "7 hrs",
        "Total Distance": "15 km",
        "Town": "Kananaskis, AB",
        "Type": "out-and-back"
    },
    "title": "Bryant Creek to Lake Magog (Assiniboine Wonder)",
    "trail_id": "2155"
}