{
    "description": "An Epic Trip\nParlee Brook is one of the ice climbing meccas in New Brunswick. Nestled in a hidden canyon, lies several (12) ice lines ranging from WI 2 to 4+. The ice begins to form around mid December, and with the onset of Christmas break, my friend and I road tripped over from PEI to give it a go. Reaching thesite requires a near 60m rappel in.\nThe sun was out, and ice and snow coated everything. To access the area, we back country skied 4.5K along logging roads using some rough GPS data I gathered from topo maps. After that, and missing the poorly marked trail, we ditched our skis and bush-whacked .3 K through scrub. Luckily, thesound of voices told us we found what we were looking for. A pair from Fredericton were justleading their way up the end of the Back Wall, and gave us some instruction on what ice was \"in\".\nWe rap'd down on their anchored set of double lines, and headed for The 3 Amigos, a grade 3 100mroute back into the trees. Two thirds of it had not yet touched down, so it was a single pitch go.\nWe were experiencing a warm spell a few days prior to our visit, and the conditions were a mixed bag. The ice was wet and slushy in some places, while clear, solid and ready for screws in others.\nWe were running against time. The climb went well with the exception of a popped off cramponthree quarters the way up on lead. There were plenty of rest stops.\nWe were back to our skis just as darkness was settling in, and with only one headset lamp betweenus, our way back made for an epic trip. I will never forget my headset lamp ever again!\nPhase II\nAfter two years, I've returned to Parlee Brook. Joined up with Darrell Steel and my buddy Scott for another go at Parlee's ice. The season started early, and we entered the hidden valley from the lower end on Dec. 16th after hearing reports of climbable ice over a week ago.\nThe lower approach is simple, and made fairly straight foreward using backcocuntry skis and skins along a logging road for the most part. 3 K, according to the GPS gets us in to views of the ice.\nDarrell uses double ropes, and after a brief lesson on belaying with a slightly different system, on he led on the 3 Amigos (WI3). Coincidentally it was the same ice run as we did last visit.\nSix ice screws later, Darrell topped out and then it was my turn. Scott took pix to pass the time. I cleaned the route, and followed the line up with no misses. I was pretty happy to be back at climbing after a rather dissappointing last season. \nNext up was Scott, who was climbing with some straight shafted axes on loan. Not the ideal setup for the first season's attempt, but Scott never the less went for it.\nOur original plan was to be leaving the area by 1PM, as a big storm was approaching, and it was suppose to chase us back home to PEI. Climbing always takes longer than you think, and we ended up leaving around 3PM with small flakes of snow steadily falling. The storm had arrived!\nWith an hour's slog back to the car on skis, we made it out and drove back in the storm, arriving home safely, though later than planned. I asked Scott, who is new to ice climbing, if he was at all interested in returning to go at it again, and as I thought, he said yes!\n-Shannon Burt\nEast Coast editor\nHere's a list of routes and grades in the area:\n-Hullholmes Falls Grade 5- 45m\nBreathless Grade 5- 65m\n-Trampless Grade 4+ 35m\n-Patrick's choice Grade 3+ 70m\n-Three Amigos Grade 3 100 M \n-ECA Grade 3 100m\n-KF Gully Grade 3 80m\n-Yellow Pillar Grade 4+ 50m\n-Blue Pillar Grade 4+ 50m\n-All the King's horses Grade 2+ 40m\n-Back Wall Grade 3+ 15-20m.\nFor more specific route descriptions and comments see this link.",
    "directions": "From TCH 2, take the exit toward Sussex. (route 1) From there, take the exit for Route 111 heading toSussex Corner. Take the #111 south of Sussex for ~10km, and turn left onto Lisson SettlementRoad.  This isn't usually plowed, so ski in from here. Go straight up the hill; the main road eventually turns right, but ignore that and continue straight onto a logging road for 3 km, past blueberry fields and into a clearcut. At this point, look for another logging road on the left, through the recent clearcut. Go .5 km, take the right-hand turn, another .5km to a left turn (this is the main traffic flow route) and then another 1 km or so to a dip in the road. There's flagging tape and a .2K trail that goes right to the back wall of the gorge. (Thanks Joe Kennidy!) See GPS data.\nSimpler route:\nOff route 111, follow the signs to Poley mountain ski hill, and look for Parlee Brook Road on your right. Take this and drive until you see a stone abby on your right and cross a bridge. Park yourt car so as not to block the unplowed road, and gear up to skin in. Just before the bridge, there's a logging road headed up hill on the right. Take it and follow the GPS track or the trail on the map. 3K in.",
    "geohash": "f817",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NB/2166/reg_IMG_0703.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/2166/reg_best1_IMG_0710.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/2166/reg_parleetopo.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/2166/topo_parleebrooktopo.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/2166/narrow_IMG_0705.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/parlee-brook-ice-near-sussex-nb-2166",
    "stats": {
        "Activities": "climb snowshoe ski-bc ski-xc",
        "From": "",
        "Seasons": "winter",
        "Stars": 5,
        "Time": "4 hrs",
        "Total Distance": "3 km",
        "Town": "Sussex, NB",
        "Type": "out-and-back"
    },
    "title": "Parlee Brook Ice",
    "trail_id": "2166"
}