{
    "description": "Grand Falls is located in Northern New Brunswick, and as indicated by its name, it is the site of a large natural waterfall. Located there to wreck the view, is a hydroelectric dam, though it doesn't impede the area where ice routes have been forged.\r\n\r\nQuite often, great ice climbing involves reaching an isolated area, but Grand Falls ice counters that description. Accessing the routes is as simple as parking in the Needs convenience store's back lot, and heading down the hill over the railing.\r\n\r\nThere are nine routes to date, with plenty more lines to lead and label. The routes range from WI 2 to WI 5 with the maximum lengths being 40 meters.\r\n\r\nHere's a link to the route map and descriptions done by Fred Berube, a well known area climber.\r\n\r\nI made arrangments to climb the area on new year's eve through the www.climbeasterncanada.com forum. I arranged to meet up with Justin and Paul from Carabou, Maine. These guys frequent the area regularly when ice season starts. When we got to the parking lot, we realised that we had a mini ice fest in the making. A few people were from NB, myself from PEI, a guy from Newfoundland, and two from Maine made up the group. The climbing offered plenty for the eight or nine of us to stay busy.\r\n\r\nWe rapelled down Sidewalk cafe, and during the day, I climbed seven times, keeping to that route and \"Into the Woods\" Both WI3+'s.\r\n\r\nThere is a ton of potential anchors with trees along the top, and the ice starts to form around  mid to late December. \r\n\r\n\r",
    "directions": "\r\n\r\nOff the TCH Number 2, take Exit 81. Drive along Portage Rd until you enter town. Turn right at Broadway (double lane divided street) and cross a bridge. Immediately at the lights, turn right again on Ch. tobique. Look for the NEEDS store on your right.",
    "geohash": "f2rg",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NB/2168/long_grandfallstopo.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/2168/reg_IMG0747JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/2168/topo_arenaJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/2168/narrow_IMG_0717.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/2168/narrow_coolline727.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/2168/narrow_intowoodsJPG.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/grand-falls-ice-near-grand-falls-nb-2168",
    "stats": {
        "Activities": "climb",
        "From": "",
        "Seasons": "winter",
        "Stars": 5,
        "Time": "1 hrs",
        "Total Distance": "0 km",
        "Town": "Grand Falls, NB",
        "Type": "out-and-back"
    },
    "title": "Grand falls Ice",
    "trail_id": "2168"
}