{
    "description": "This is a community built trail that runs along the Shiktehawk River. just off the main road between the communities of Bristol and Bath in New Brunswick.\r\n\r\nLocated near a girl Guides camp, the trail consists of look offs, and small bridges. \r\n\r\nI hiked this trail a few times in the spring, and was more than pleasantly suprised on two accounts. First, the trail is a first class piece of work, found in a \"who'd-a-thought?\" place. Secondly, I was constantly torn between looking at the trail, and evying the fast flowing water of the Shiktehawk streem under Spring run off. If I had the canoe, I would have been on the water for sure. I was told that the water is COLD, even through the middle of Summer, so take warning.\r\n Flexable to the seasons, this  is a great spot for an afternoon outting on snow shoes,  or a quick jont on the mountainbike. Enjoy!\r\n\r\nShannon Burt\r\nEast Coast Editor",
    "directions": "Just off the TransCanada Highway turn off to Florenceville, NB, take the road that runs along the St. John River toward Bath, and look for the trailhead sign. You can't miss it.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NB/2179/reg_IMG0754JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/2179/reg_whitewater.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/2179/narrow_IMG0755JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/2179/narrow_hillsmall.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/2179/narrow_riversidesml.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/shiktehawk-trail-near-glassville-nb-2179",
    "stats": {
        "Activities": "snowshoe river-canoe hike mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "4 km",
        "Town": "Glassville, NB",
        "Type": "out-and-back"
    },
    "title": "Shiktehawk Trail",
    "trail_id": "2179"
}