{
    "description": "There are three different ways into the new Brew Hut.  The recommended winter route, described here, is via the Chance Creek and Roe Creek forest services roads.\r\n\r\nNorth of Squamish, on hwy 99, turn left on to the Chance Creek logging road. This can be found just south of the road accessing the Garibaldi Lake trail head.\r\n\r\nCross the river and the rail line, and stay left at the next two intersections.  Continue climbing past Lake Lucille and Freeman Lake, then turn right up the Roe Creek FSR.  From here there are a number of smaller roads left and right.  Continue for nearly 3km on the main route to a junction.  Take the right road to bridge Roe Creek.  Follow the road along the east bank of the creek, staying left, for a further 3km, past a large water bar.  The road switches back on the right up steeper terrain for about a kilometre to the trailhead.\r\n\r\nThe trailhead is marked with orange painted trail marker and the trail is marked with flagging.  Head east through a clear cut, through trees on the other side.  Climb through a small bowl, keeping left, heading north below three rock bands, past a scree slope and then up steeply through trees to an open meadow.  Continue north to Brew Lake, then head up NW,  skirting around the trees and a small lake before heading north again for six or seven hundred meters to a saddle just south of the main peak of  Mount Brew.\r\n\r\nAdditional information can be found  [here] on the VOC website.\r",
    "directions": "See description and / or GPS",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/2236/reg_best1_brew_ge.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2236/topo_brewhut-wintermap.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/brew-hut-winter-trail-near-whistler-bc-2236",
    "stats": {
        "Activities": "snowshoe ski-bc",
        "From": "",
        "Seasons": "spring winter",
        "Stars": 3,
        "Time": "5 hrs",
        "Total Distance": "26 km",
        "Town": "Whistler, BC",
        "Type": "out-and-back"
    },
    "title": "Brew Hut winter trail",
    "trail_id": "2236"
}