{
    "description": "One of the most spectacular features of the British Columbia coast occurs at Skookumchuck Provincial Marine Park. ?Skookumchuck? is an old Native name meaning ?strong waters.?\r\n\r\nLENGTH/TIME: 4km/1 hour (each way)\r\n\r\nHIGHLIGHTs:  Tide water is forced through the narrows and forms the Sechelt Rapids.  The difference in water levels between one side of the rapids and the other sometimes exceeds 2 meters in height.  Current speeds can exceed 30 km/hr.  The rapids are famous for their spectacular whirlpools and whitewater.\r\n\r\nACCESS: To reach the park, drive northwest on Highway 101 past Sechelt and Madeira Park until you reach the Egmont turn-off.  This turn-off is one kilometer before Earl?s Cove Ferry Terminal.  Drive along the Egmont Road until you reach a roadside parking lot sign marked ?Skookumchuck Narrows Provincial Park? (approximately one hour of easy driving from Sechelt).\r\n\r\nTo reach the rapids, you walk on a 4km trail past Brown Lake and through a lush coastal forest.  The trail is a well-developed bark mulch trail.  There is a minimal elevation change and hiking time will be about one hour for most groups (easy walking).\r\n\r\nThere are directional signs and public bathrooms (dry toilets).  There are three viewing points to enjoy the rapids ? perfect spots for picnics.\r\n\r\nTo view an ebb tide proceed to the North Point viewing area; to view a flood tide proceed to the Roland point viewing area. \r\n\r\nFor those who have agility or mobility difficulties, please be aware that the Roland Point route has many exposed roots and portions of the trail may pose a challenge.  Roland Point also has views of sea life such as starfish, sea anemone etc.  The North Point route is a direct route and is shorter than the Roland Point route.\r\n\r\nOpen fires are prohibited. Overnight camping is prohibited. When using these waters, know the tides and cross the narrows at high or low slack tide. \r\n\r\nPlease come to the Sechelt Chamber of Commerce and Visitor?s Information Centre for additional information, maps, and best viewing times.  \r\n\r\nWe are located in Trail Bay Centre in Sechelt.  Our telephone numbers are (604) 885-0662,\r\n1-877-663-2963. Our email address is visitorinfo@dccnet.com, our website is www.secheltchamber.bc.ca\r\n\r",
    "directions": "See description and / or GPS",
    "geohash": "c0z",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/224/reg_P1010013-11674.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/224/reg_P1010017-11674.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/224/reg_P1010021-11674.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/224/topo_skookum.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/skookumchuck-narrows-provincial-park-near-sechelt-bc-224",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 5,
        "Time": "2 hrs",
        "Total Distance": "4 km",
        "Town": "Sechelt, BC",
        "Type": "out-and-back"
    },
    "title": "Skookumchuck Narrows Provincial Park",
    "trail_id": "224"
}