{
    "description": "Snowshoeing the Cayoosh is possibly the most interesting and picturesque snowshoe experience you might ever have.  It was mine. Separate entries exist on trailpeak for experienced back-country skiers, however this description is for snowshoers with sufficient back-country skills.Stunning views of opposite peeks, the Matier glacier, old growth forest, and, the moraines high above you give you a never ending visual feast.  The Cayoosh range is home of the \"spirit Bear\". First nations have been successful in halting logging north of the Duffy Lake road, opposite Garibaldi park.  Along Duffy Lake Road, you find several valleys draining off local high peaks. Cerise, Van Horlick, Casper, and the Cayoosh Creek itself.Most of these valleys are coveted by back-country skiiers for the powder which is generally drier than Whistler snow oweing to a partial rain-shadow. You  also start at higher elevation off the Duffy. The Cayoosh pass is one of the highest paved passes in B.C. The snow on this trip was unbelievable, and, Whistler's Pique magazine later reported that this January was the snowiest on record.On this trip, we parked in a plowed parking area, a place that is otherwise not marked, and, hard to identify so I would advise on going with friends who've been or hiring a guide your first time out, or downloading the attached GPS data.  You simply wouldn't know it's there except for the like-li-hood of some cars on a great ski day.  It's a short distance past the Joffre parking lot (from Pemberton) which is plowed as well. Our route is the same route skiers take up to the cabin, although we proceeded only so far, stopping short of a high ascent and opting for a warm cabin lunch instead.We climbed steadily but on an otherwise gentle grade with no avalanche risk, with amazing views down the valley to Cerise, Van Horlick, etc.   First nations  have called this range the home of the \"spirit bear\" for close to 10,000 years.  You feel like you are in a special place.In wintertime, ugly clearcuts with some regrowth turn into ideal snowshoe rambling terrain as stumps become soft pillows of snow.  We followed some well marked trail and ski tracks, but then 30 minutes into our climb veered off trail to the right, and, moved up and generally parallel to the old logging road (which skiers use as their access route to the glacier. Keeping between that road and the creek, we were in the clear, and we saw various animal tracks, in particular the snowshoe hare, who travels on it's own built in set of rear snowshoes.  It has to move fast or it may be a snack for cougar, lynx, or coyote which prowl by night.Then we stopped for something remarkable.  Winter Cherries, popping out of the snow.  A lonely small patch, the rest of which was under snow cover, had allowed just a dozen or so red berries sitting there for us to munch on.  In olden times, this would have been a sign to dig  and fill a few buckets.  First nations people did not know scurvy, thanks to vitamin rich sources such as the winter cherry! Continuing on, we climbed again, zig-zagging where mounds appeared before us, and generally made our way back to the road, which forms the ski trail that skiers use. Once on the trail, the sun appeared, and, I was down to my wool top as I snowshoed happily along, thanking the spirit bear for not clouding us in today.High up on the ridge, as we turned the corner to face Mount Cayoosh, I spotted two skiers making fast progress up the mountain, on a moraine just under the glaciers which we could not see (see attached pic). Today would be an ideal day to be skiing.  Looking at the wall of mountain in front of us, we had an overview of the back-country ski terrain, noting the best of three possible routes down the mountain.  It looked intoxicating, but I am not a back-country skier (as yet), I am simply out for a great day of snowshoeing.Our goal, showshoe for a few hours, then make our way into a small back-country hut for lunch, and return. We left Whistler at 9:30 a.m., we were back by 3:30 p.m.  Then it was out of the cabin, but instead of returning on our path, we descended to the creek 5 minutes, and followed it down and out of the valley, crossing the stream several times, and, stopping to admire some exceptional old growth.  The way back was mostly under forest cover. If there is an enchanted forest, this could be it.  I particularly enjoyed crossing the rushing creek over natural snow bridges. Descending on snowshoes allows you to take big leaps and land in pillow soft snow. It must be close to what the lunar walkers experienced.  We wandered and lost track of time, generally following the creek, staring down tree wells - which are dangerous traps for skiers. An hour or so later we emerged from this forest into the cut-block and it was back to picking lines through this undulating terrain.Finally rejoining the trail, we made our way just 30 minutes to the parking area, on the opposite side of the Duffy Lake Road.",
    "directions": "The attached GPS data/map will help, and, can also be downloaded to your GPS.   If you are not experienced at back-country travel, do not attempt this trip on your own.  Coast Mountain Guides takes you up from Whistler, supplies snowshoes, lunch, and, you get a trouble free trip.  You'll get a taste for the back-country, which may then lead you to take avalanche awareness training, back-country ski lessons, and, route finding.  One day, you may return to ski the glacier high above you.For those who are confident in their back-country skills and have studied the area including the topo map in the images showing the route on the West side of the creek near the parking area, you drive north from Whistler to Pemberton, taking the Duffy Lake Rd. up Cayoosh pass.  As you ascend, and almost an hour north of Whistler, you will pass the turn-off to the Joffre Peaks hike.Continuing past Joffre parking, about 5  minutes further (vague I know) you will reach a parking spot on the right, it is unmarked.  Park, and begin your adventure opposite the side of the road but on the WEST side of the creek -- i.e. try to follow other skier tracks to join the logging road (covered in snow) to the hut.  This area is back-country, with avalanche danger being a risk.  Hire a guide, or, ensure you are back-country trained and have a group leader who knows the area.",
    "geohash": "c2by",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/2265/reg_backtoJoffre.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2265/reg_gemap.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2265/reg_morraine_above.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2265/reg_movingupvalley.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2265/reg_topo.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2265/reg_tracks.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2265/reg_wintercherries.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2265/topo_cayooshrange_best1_.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/cayoosh-snowshoeing-near-pemberton-bc-2265",
    "stats": {
        "Activities": "snowshoe ski-bc",
        "From": "",
        "Seasons": "winter",
        "Stars": 5,
        "Time": "4 hrs",
        "Total Distance": "6 km",
        "Town": "Pemberton, BC",
        "Type": "out-and-back"
    },
    "title": "Cayoosh Snowshoeing",
    "trail_id": "2265"
}