{
    "description": "The Bruce trail moves from Hamilton (OK not the best part) all the way to Tobermory and the most exciting parts, along lake Huron and the Bruce Peninsula. The original entry for this trail was a section close to Niagara falls -- as the Bruce can be joined at many places -- and since then, another user has added the GPS waypoints for the entire trail.  As a result, this trail entry is becoming the main entry for the Bruce trail.A few sections already on trailpeak;Nice Section near Owen Sound with detailed start directions.  Use the trailpeak search engine with \"Bruce\" in trail title to find other trail entries.  The area along the Bruce Peninsula trekking along the cliffs and lake front are the most scenic.Kayaking Fathom 5 - along the Bruce parallels a considerable amount of the hiking trail and is a great way to experience one of the best parts of the Bruce.  Editor's note: This was a great trip!Niagara Falls Section (original entry);A nice trail for biking and some DH with a lot of jumps. It is a  nice brisk trail to ride on. Some parts have sum nice DH!!!. It is good for new comers and a lot of Cross Country as well.Note the Bruce trail is over 725 km and is one of Canada's longest trails. This particular area is at the terminus (the end - or beginning) of the Bruce trail in Naigara Falls Ontario.",
    "directions": "Most scenic section: Bruce Peninsula (see GPS map).  NOTE: One can also kayak (and camp) along the Bruce from Tobermory (see various outdoor outfitters there).Original trail entry directions follow; At the end of Queenston park off the highway.             From QEW take the cut off to Queenston just before the border, take the west off ramp and keep on going west and you will see the signs.A stone cairn at the eastern end of Queenston Heights Park marks the beginning of the trail.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/ON/2270/reg_Ryan20loghoppingjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/2270/reg_falls.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/entire-bruce-trail-near-niagara-falls-on-2270",
    "stats": {
        "Activities": "hike mtn-bike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "27 km",
        "Town": "Niagara Falls, ON",
        "Type": "out-and-back"
    },
    "title": "Entire Bruce trail",
    "trail_id": "2270"
}