{
    "description": "On one beautiful winter afternoon, we did all the snowshoe trails on Grouse Mountain.Starting at the top of the Gondola, we headed up to the summit of Dam Mtn (see photo) from where we could see Crown Mtn (photo). We then headed over the other side along what is called Discovery Loop. On the way back, we circled around the north side of Dam Mtn (photo), but then took the Pacific View Loop, on the south side of the main trail, with steep and dramatic cliffs and canyons (photo), and a spectacular view of the city (photo).A little further down, we enjoyed sliding (on garbage bags) on the backside of the Peak hill, just across from the directions board. Near the bottom, we kept to the right and then did the final trail, the Blue Grouse Loop.Trailpeak editor's note:  We accepted this posting although there is a very similar posting and GPS track here. We note in viewing this trail using google earth (click download GPS) that some questionable approaches to steep gulleys are in the GPS track.  A shorter less varying route is the one linked just above and may be preferable.",
    "directions": "Up Capilano Road in North Vancouver right to the Grouse Mountain Skyride. Single day return cost for the Skyride is $30, but if you go with somebody who has an annual pass, the cost is $15 (up to 4 guests allowed per pass). From the top of the Skyride, head northwest.",
    "geohash": "c2b",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/2278/long_Dam-Mtn-copy-13724.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2278/reg_DMW0616.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2278/reg_DMW0623.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2278/topo_DMW0607.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2278/narrow_DMW0593_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2278/narrow_DMW0622.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/grouse-dam-mountain-near-vancouver-bc-2278",
    "stats": {
        "Activities": "snowshoe hike",
        "From": "",
        "Seasons": "winter",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "8 km",
        "Town": "Vancouver, BC",
        "Type": "out-and-back"
    },
    "title": "Grouse - Dam Mountain ++",
    "trail_id": "2278"
}