{
    "description": "About 5 km to the end of the trail at the second \"blue\" lake. The first 3 km or so are through a beautiful but dense forest. The trail is moderately steep, and climbs consistently. This hike offers some great views on sunny days, but is still worthwhile when overcast. Be prepared to get wet though.\r\n\r\nYou can not actually get down to the first Blue lake, due to the dense and steep bush.\r\n\r\nThere are two steep creeks that run into the first lake, which can be dangerous to negotiate in late spring from all the run off, so be careful!\r\n\r\nOff to the left of the trail is a picnic area with an off shoot to the top of the large waterfall (nice view - see photo). If you explore closer to the second lake, you will find another picnic site here and be able to get around to the back of the lake.\r\n\r\nThere is no \"third blue lake\" but feel free to scout out further up if you don't believe me! You must add a couple more hours if you are doing any exploring up here or lunch.\r\n\r\nThis is a must do trail for Hazelton/Smithers/Terrace locals.\r\n\r\n Skiing the ridges in winter, but please check the Avaluator \r\n (Online Trip Planner) rating is: \r\n   Challenging.  \r\n\r\nSee more trip planner route details \r\nhere.\r\n   \r\n  \r\nAlso see the guide book by Einar Blix: Trails to Timberline. Smithers:1989.\r\n\r\n\r\n\r",
    "directions": "Mudflat creek is located about 12 k east of New Hazelton on a cautionary 80kph 90 degree corner. Just west of this there is a road on the west side of Hwy 16 (right side when coming from New Hazelton).\r\n\r\nEnter here and there will be a BC Forest Service Sign marking the trail head just past a small gravel pit.\r\n\r\nFollow the well travelled road all the way to the parking area at the top. (If you have 2WD or no clearance, you will have to hike half of the road to get to the trail head). Forestry cleared out the road in '05, so it is a bit easier to negotiate.\r\n\r\nThe trail is well marked and you won't get lost.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/2290/reg_BlueLake1Falldown2JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2290/reg_P1010267copyjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2290/narrow_Picture038jpg.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/blue-lakes-near-smithers-bc-2290",
    "stats": {
        "Activities": "ski-bc hike",
        "From": "",
        "Seasons": "summer winter",
        "Stars": 4,
        "Time": "4 hrs",
        "Total Distance": "8 km",
        "Town": "Smithers, BC",
        "Type": "out-and-back"
    },
    "title": "Blue Lakes",
    "trail_id": "2290"
}