{
    "description": "Mt. Hood - 11 237 ft\r\nLocated twenty miles east of the city of Portland, Oregon, and the northern Willamette River valley, the Mt. Hood National Forest extends south from the strikingly beautiful Columbia River Gorge across more than sixty miles of forested mountains, lakes and streams to Olallie Scenic Area, a high lake basin under the slopes of Mt. Jefferson. The Forest encompasses some 1,067,043 acres. \r\nThe Cascade Range Forest Reserve was established in 1893, and divided into several National Forests in 1908, when the northern portion was merged with the Bull Run Reserve (city watershed) and named Oregon National Forest. The name was changed again to Mt. Hood National Forest in 1924.\r\nSome popular destinations in addition to the obvious summit at 11 237 ft are the Timberline Lodge, built in 1937 high on Mt. Hood, Lost Lake, Trillium Lake, Timothy Lake, Rock Creek Reservoir and portions of the Old Oregon Trail, including Barlow Road.\r\nThere are 189,200 acres of designated wilderness on the Forest. The largest is the Mt. Hood Wilderness, which includes the mountain's peak and upper slopes. Others are Badger Creek, Salmon-Huckleberry, Hatfield, and Bull-of-the-Woods. Olallie Scenic Area is a lightly-roaded lake basin that provides a primitive recreational experience.\r\nGPS tracks includes perimeter trails as well as summit traverse loop via Hogsback/Pearly Gates and Leuthold Couloir\"\r\n\r\nGPS routes of all the trails surrounding Mt. Hood",
    "directions": "See description and / or GPS",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/OR/2298/long_Hood1.jpg",
        "https://trailpeak.com/storage//content/trails/US/OR/2298/reg_Hood2.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mount-hood-near-us-city-2298",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 3,
        "Time": "0 hrs",
        "Total Distance": "0 km",
        "Town": "US City",
        "Type": "out-and-back"
    },
    "title": "Mount Hood",
    "trail_id": "2298"
}