{
    "description": "A beautiful walk/snowshoe among birch and poplar trees (see photo) and along lakes to an abandoned homestead, the Potts Farm, on the shore of Grizzly Lake (photo).Total elevation gain is not more than 75 m.We started at the Lakeside B&B on Gerald Crescent near the west end of Lac Des Roches, on Hway 24, between Little Fort and 93 Mile House in the Cariboo (www.lakesidebedandbreakfast.ca , hosts are Jacquie and Jamie).We walked up to Hwy 24, crossed it, went east approx 100 m, where we put on our snowshoes. We followed the trail north approx 1500 m to the big fir (photo), then went west to what we called the Potts Gate, went north and north west to Potts Farm. Saw lots of deer and moose tracks (photo) and visited the abandoned farm. The roofs of the buildings collapsed under the weight of rain-laden snow in 2005.As the lake was frozen solid, we crossed it heading south and made our way back to Potts Gate and eventually to the big fir. DO NOT VENTURE OUT ON LAKES UNLESS THE LOCAL AUTHORITIES OR RESIDENTS CAN CONFIRM THE ICE IS SOLID AND THICK ENOUGH TO SAFELY WALK ON IT.At the big fir, we continued east and did the east loop. At the horse corral, by Hwy 24, we walked west along the side of the hwy for approx 100 m to McCarthy Road and went down (south) McCarthy to Lac Des Roches. Our plan was to take the channel back to the B&B, but missed it, so walked along a street back to Lakeside B&B.See map or download GPS data.Total time: nearly 5 hours, for 13.5 kms. A great day in fresh air, nice snow and under a blue sky and radiant sun. Don't forget yourlunch, hot drink if possible and sun screen.",
    "directions": "The trailhead is on the north side of Hwy 24, just east of Gerald Crescent, approx 45 kms west of Little Fort, or 55 east of 93 Mile House. Park on Gerald Crescent.",
    "geohash": "c34",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/2301/reg_PottsFT0672.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2301/reg_PottsFT0681.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2301/topo_PottsFarmTrailMap.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2301/narrow_PottsFT0665.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2301/narrow_PottsFT0699_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2301/narrow_PottsFT0709.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/lake-des-roches-potts-farm-near-clinton-bc-2301",
    "stats": {
        "Activities": "snowshoe hike ski-bc",
        "From": "",
        "Seasons": "winter fall summer",
        "Stars": 4,
        "Time": "5 hrs",
        "Total Distance": "14 km",
        "Town": "Clinton, BC",
        "Type": "out-and-back"
    },
    "title": "Lake Des Roches - Potts Farm",
    "trail_id": "2301"
}