{
    "description": "This is a lovely walk/snowshoe through birch/aspen forest, with most of the 90m climb within the first 500 m.The trail didn't have a name, so we called it \"Luca's Plateau\" after the owner of Lac Des Roches Resort, (www.lacdesroches.com) where the trailhead is.  Hosts are Luca and Laura Lanzoni). I'm told Luca's Italian cooking is great.AS THE TRAILHEAD IS ON PRIVATE PROPERTY, CALL 250-593-4141 FOR ACCESS PERMISSION. USE THE TRAIL AT YOUR OWN RISK. NEITHER THE OWNER OF THE PROPERTY, THE OWNERS AND OPERATORS OF THIS WEBSITE OR THE WRITER OF THIS POSTING WILL BE LIABLE FOR INJURIES, DAMAGES, LOSSES OR OTHERWISE FROM USE OF THIS TRAIL.Start to the right of cabin # 7 (see photo). The trail rises approx 90 m. to Moose Hollow (see map) and is then basically flat to the end. You will walk through sparsely laden birch and aspen forest where you will enjoy plants poking through the snow (photo), interesting snow formations (photo) and just a very enjoyable walk/snowshoe for 1/5 to 2 hours (photo).There are a few additional loops that branch off and return to the main trail and can be walked along to add to the trek.",
    "directions": "Lac Des Roches Resort is at the extreme west end of Lac Des Roches, on Hwy 24, approx 45 kms west from Little Fort or 55 kms east from 93 Mile House.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/2307/reg_Lucas0646.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2307/reg_Lucas0715.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2307/reg_Lucas0722.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2307/reg_Lucas0726.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2307/topo_LucasPlateauTrailMap.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/lake-des-roches-lucas-plateau-near-clinton-bc-2307",
    "stats": {
        "Activities": "snowshoe hike ski-xc",
        "From": "",
        "Seasons": "winter fall summer",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "5 km",
        "Town": "Clinton, BC",
        "Type": "out-and-back"
    },
    "title": "Lake Des Roches - Luca's Plateau",
    "trail_id": "2307"
}