{
    "description": "Outback/PWT is a winding circular trail on the far reaches of the South March Highlands.  Despite the fact that South March Highlands is closed in by roads, don't let that fool you - it feels remote, and it is remote!  The SMH trail system has a solid sign system so download a trail map (see link below). Don't get caught in there as light fades though, unless you know where you are going, and have lights.It's rugged technical mountain biking to rival any great trail in Canada.  There aren't a lot of ladders (there are some), but the rocky terrain and portions of slick-rock are the primordial remains of the Canadian shield and give you all the challenge you'll need. Some wetter  trail sections are \"rock armoured\" as OMBA group works very hard on this trail.  This place feels wild and you'll have to work it to keep your flow. It'll buck you off your bike if you can't ride the rock outcrops or turns. Outback/PWT trail winds through a series of small lakes, you'll see beaver dams, old growth forest, lots of exposed rock surfaces and some tight ups and downs that will be frustrating for a beginner, but pure joy for the intermediate to advanced rider.Although GPS data is available, the best way to do this trail is by riding with OMBA (Ottawa Mountain Bike Association), one of many strong advocacy groups for the area & local stewards of the SMH trails.Note: All technical challenge points or obstacles or fun parts were GPS'd with a waypoint.  Access to this trail is now slightly more difficult now that the Huntmar trail access point has been closed. Instead, use the KL trail head at the roads of Klondike and 2nd Line. This is where OMBA meets to ride on summer evenings.You can find out more about OMBA and reference their own map here at ottawamba.org",
    "directions": "Hwy 417 west from Ottawa, exit Eagleson rd, North. Left at Klondike Rd. West to 2nd Line, park along the road. Trail Head is at the metal gate. Park at KL (see above), then you've got some options to get to the trailhead marked by an Inuksuk which can be your start or finish to Outback/PWT.  If the Inukshuk (see annotated map in the pics) is your finish point, you need to ride Ridgetop first.  If you want the Inukshuk to be your start, a good option is to take Pete's Wicked Trail (P.W.T. in pic) to that point.  Either way, a good reference is Tony's Table, also in the pic.  Ride Tony's Table for either option,  but shortly after you see a branch to 3 trails (far right is continuation of Inner-Outer and to PWT), left is to ridge top and you'll see some rock to climb right away. There is also a route to Outback/PWT from KL the double path straight, across a beaver dam, follow the trail along some exposed flat rock (barren), then, across another beaver dam (very muddy), then you connect with PWT/Outback.  You can basically see the just of it from the arrow in the pic at K2.  It's the most direct, and not to hard to follow except for the mucky beaver dam crossing. Or, um, take the GPS, or, call me ... seriously, click email member, I'll guide you!",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/ON/2325/reg_-DSC0990-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/2325/reg_-DSC0993-5_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/2325/reg_Ottawa-20120516-00085-40890.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/2325/reg_South-March-2Post-Wide-final-Page-2-40890.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/2325/reg_dcp0867jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/2325/reg_dcp0872jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/2325/reg_dcp0880jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/2325/reg_dcp0881jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/2325/reg_dcp0897jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/2325/reg_dcp0898jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/2325/reg_outback.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/2325/topo_dcp0861jpg.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/outback-south-march-highlands-near-ottawa-on-2325",
    "stats": {
        "Activities": "mtn-bike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "18 km",
        "Town": "Ottawa, ON",
        "Type": "out-and-back"
    },
    "title": "Outback, South March Highlands",
    "trail_id": "2325"
}