{
    "description": "NTS Map: 082N09\nElevation Gain: 650 m (2130 ft)\nThe Katherine Lake/Helen Lake loop is a classic alpine ski tour in Banff National Park. The route is the first segment of the Dolomite Circuit, which ends further up the highway and requires a car shuttle at the Mosquito Creek parking area.\n We did this route on skis on February 19th, 2006 and there were a couple of other groups on the trail. It was easy to follow the trail and the tracks from the other skiers on the way up. From the highway there is a bit of a grunt for the first 15 minutes but then the trail flattens out and is pretty easy going for the first 2-3 kms. After crossing the base of a dangerous looking avalanche chute the route starts to gain elevation quite rapidly, and it's at this point that the climbing skins come out if you have them. \n When you reach the clearing above the first ridge you can either continue switchbacking up to gain the ridge and descend to Katharine Lake or you can cross the open snowfield beneath the ridge to Helen Lake. \n It is possible to do a loop from Katharine Lake to Helen Lake and return by the route you took up, as described in Chic Scott's 'Ski Trails in the Canadian Rockies', an excellent reference for this route or for the Dolomite circuit.\n We chose to tour up to the ridge above Katharine Lake, at which point I took off my skis and hiked to the top of the ridge for a better viewpoint (watch your footing and be aware of snowy cornices at the edge of the ridge if you do so).\nOn the way down we endeavored to do some telemark turns in the trees but somehow we went too far North on the way back from Helen lake and ended up skiing in a very tight and difficult gully. There should be some good powder to be had if you ski just off the trail in the trees just a bit to the North, but eventually you will likely end up in the same gully as we did, and eventually when the route flattens out you will end up skiing in your 'up' tracks. \n Note: Some in our group were on cross country skis while the rest had telemark or back country skis. We all had climbing skins.\nIn winter please check the Avaluator(Online Trip Planner) rating is:  Challenging.  See more trip planner route details here.\nThis is avalanche country and there are potential hazards on the route, so take necessary precautions and check the weekly Avalanche bulletin for Banff, posted every Friday by Parks Canada.\nThe trail is about half hour's drive from Lake Louise up the Icefield's Parkway",
    "directions": "29 km north of Lake Louise junction on Icefields Parkway, just accross the bridge over Helen Creek. Parking area is on east side of the highway.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/2330/reg_dolomitesa.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2330/reg_goingup2sml.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2330/reg_goingupsml.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2330/reg_lookingfromridgetowardshelenlake2JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2330/reg_lunchgroupJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2330/reg_map.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2330/reg_towardshelenlakeJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2330/topo_CopyofDSC03025.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/helen-lake-katharine-lake-near-banff-ab-2330",
    "stats": {
        "Activities": "ski-xc ski-bc snowshoe",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 4,
        "Time": "8 hrs",
        "Total Distance": "8 km",
        "Town": "Banff, AB",
        "Type": "out-and-back"
    },
    "title": "Helen Lake / Katharine Lake",
    "trail_id": "2330"
}