{
    "description": "NTS Map: 082G01\nElevation Gain: ~400 m  (1,300 ft). \nThis is an great Waterton winter destination for ski touring and for getting a few telemark turns in deep powder. \n The ridge is frequently a windy, stormy spot though the views are quite impressive on a clear day. \n It takes about 2 hours at a moderate pace to get on top of the ridge. Climbing skins  are highly reccommended. We usually make a full day of it by touring around to the top of the ridge or down to Forum Lake and by going up and down to do some tele turns in the powder snow on the slopes beneath the ridge. \n Some people ski the avalanche chute at the end of the ridge down to Cameron Lake. Do so at your own risk! Reccommended only during very stable conditions. This is avalanche country, so be avalanche aware and take necessary precautions. Click here to see the avalanche bulletin for Waterton National Park published by Parks Canada.  \n There are excellent powder turns to be had in the burn-zone or in the trees to the south of the burn zone  above Forum Lake, a safer alternative that is not psycho steep and great for those who are learning to ski in powder.\nIn winter please check the Avaluator(Online Trip Planner) rating is:  Challenging.  See more trip planner route details here.",
    "directions": "Drive up the Cameron Lake road to the winter blockade. Ski down the road to the Akamina pass and follow the pass up until the cutline denoting the park boundary. Follow the cutline until it starts it to climb sharply. Cut to the right, dropping soon after into a gully. Switchback your way up through the tress or through the burnzone until you reach the open slopes of the ridge.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/2335/reg_DSC03111aJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2335/reg_DSC03116.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2335/reg_DSC03124.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2335/reg_DSC03142JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2335/reg_DSC03145JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2335/reg_forum-ridge-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2335/reg_forum-ridge-map-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2335/topo_DSC03121JPG.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/forum-ridge-near-waterton-park-gate-ab-2335",
    "stats": {
        "Activities": "snowshoe ski-bc ski-xc",
        "From": "",
        "Seasons": "winter",
        "Stars": 4,
        "Time": "6 hrs",
        "Total Distance": "10 km",
        "Town": "Waterton Park Gate, AB",
        "Type": "out-and-back"
    },
    "title": "Forum Ridge",
    "trail_id": "2335"
}