{
    "description": "This trip was done as a back country ski trip from Chance Creek. We were able to drive 2km up the road.\r\n\r\nPeople have employed many route to get up Cloudburst on skis over the years; either via Chance Creek or via High Falls Creek. Most accounts recall bush or/and bluffs and a degree of steepness at some point requiring serious avalanche awareness. The most traveled ski route via Chance Creek enters the steep bowl behind a small lake on the north side. The route described here was used by a large BCMC party in early March, 2006, after a good dump of new snow. It is not without avalanche danger but to a much lesser degree so than any of the other winter routes on the mountain. The route miraculously avoids steep bowls and exposed slopes and it can be approached from both Chance Creek via the Squamish-Whistler Hwy. or from High Falls Creek via the Squamish River FSR. It contours well past and west of the low divide between the two drainages.\r\n\r\nThe route leaves the snow cat track up Chance Creek at N49d 57.99'/W123d 13.40' (all GPS data are in NAD27 as is the 1980 topographic-map) {EDITOR'S NOTE: Attached GPS file is in NAD83}. A gentle dip leads to a landing at 57.97'/13.67' and a good place to regroup and stop for a bite. From here, the road narrows as it climbs and continues west. Shortly after turning a wide switch back, the route now leaves the road and aims west again toward the edge of the cut where  a small  stream enters; about halfway up the clear cut at 57.79/13.96.  Follow this creek through a short section of old growth to another clear-cut further west. It is best to cross uphill near the edge of the forest and then gain the end of another logging road above at 57.64/14.17. Follow this road as it turns a corner and descends before you can strike up diagonally to almost the top far west corner of the cut-block. A short downhill through some trees will get you to a ravine beyond at 57.41/14.39. This is where the contouring around Cloudburst finally ends and where it becomes necessary to put in several steep switchbacks to gain the top of the ravine. This short section is the one somewhat unpleasant part of this route and you need to watch out for snow instability here. The route continues in the forest until you break out on to recent logging at 57.31/14.20. Climb in the open for some distance before you reenter the trees and ascend to a flat area almost at the edge of tree-line at 57.07/14.04. This is a good lunch spot. From here the recommended route hugs the edge of an avalanche slope between scattered small trees to 56.95/14.01. With care switch back up to your right, look for an obvious exit, and discover a hidden bench beyond at 56.88/14.11. The existence of this bench is the \"secret\" of this route.  You can hardly make it out from the lunch spot. It provides easy and relatively safe access to the upper and more gentler slopes of Cloudburst. As you continue along the bench and then the slopes above, you pass the points: 56.72/14.21, 56.56/14.19 and 56.46/14.16. The route eventually joins the  upper NNW ridge; staying well to the left of the cornice above. The summit plateau is turned at 56.232/13.945 from where it is an almost flat ski to the summit with its unsightly microwave tower at 56.014/14.088. Be careful after you have turned the corner and stay clear of the cornice to your right as you begin traversing. Our party almost turned around here in a dizzying white-out.\r\n\r",
    "directions": "\r\n\r\nSea to Sky Hwy 99 north to Chance Creek Road. Cross bridge over Cheakamus River and then drive up road past snowcat operation as far as possible.\r",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/2341/long_CloudburstAscent.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2341/reg_best1_Cloudburst-from-the-NW-6103.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2341/reg_cloud2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2341/topo_chance.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/cloudburst-via-chance-creek-near-squamish-bc-2341",
    "stats": {
        "Activities": "hike ski-bc",
        "From": "",
        "Seasons": "spring winter",
        "Stars": 3,
        "Time": "8 hrs",
        "Total Distance": "12 km",
        "Town": "Squamish, BC",
        "Type": "out-and-back"
    },
    "title": "Cloudburst via Chance Creek",
    "trail_id": "2341"
}