{
    "description": "In the summer, this is a paved, yet winding, road up to Cascade Lookout, opposite Manning Park Resort, in Manning Park. In the winter, as the road is not cleared beyong where the hill starts, it's a great snowshoeing / back country skiing trail.\r\n\r\nIt's 7.5 kms and 500 m up to the Cascade Lookout, with great views nearly 360 degrees around at the lookout. There's a geocache at the lookout, but only accessible in the summer and fall (see www.geocahing.com). The road continues, unpaved, another 7-8 kms to a microwave tower and the Three Brothers hiking trail.\r\n\r\nI've rated it as difficult because of the length (15 kms return). It's a long but gentle slope up. We had sunny and very warm periods, followed by near blizzard conditions, so dress appropriately. Cell phone doesn't work up there, so make sure somebody knows where you are.",
    "directions": "Opposite Manning Park Resort, turn north off Hwy 3 and immediately left (west) down the road that parallels the hwy. Drive as far as the road is cleared of snow. Park there and head up the road. \r\n\r\nSee GPS data. You don't need it to follow the road, but it'll be great to know you're finally arriving at the lookout. At some of the switchbacks, we took a few shortcuts here and there, so don't be too confused if the track goes off the road here and there.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/2371/reg_view.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2371/topo_top_cascade.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2371/narrow_wayupcascade.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/manning-park-cascade-lookout-near-princeton-bc-2371",
    "stats": {
        "Activities": "hike ski-bc",
        "From": "",
        "Seasons": "spring winter",
        "Stars": 4,
        "Time": "5 hrs",
        "Total Distance": "15 km",
        "Town": "Princeton, BC",
        "Type": "out-and-back"
    },
    "title": "Manning Park - Cascade Lookout",
    "trail_id": "2371"
}