{
    "description": "NTS Map:92F1.  This is a great short hike that has nice views over looking Westwood lake, Nanaimo and the Coast Mountains.  This loop hike will take about 3 hours and has a top elevation gain of about 350 meters.  Mt. Benson is to your right on this hike and provides a nice back drop assuming you do this before too much logging has taken place.  You start the hike along Westwood Lake.  After leaving Westwood Lake, you will head up to the viewpoint.  Then you will hike along Westwood Ridge, then down to the power line service road and back onto the Westwood Lake trail to finish at the parking lot.  This hike can be done by anyone in good shape.\r\n\r\nFrom the parking lot, head counter clockwise around Westwood Lake.  In about 15 minutes you will want to make a right here at the trail junction and 5 minutes later make a right at the T junction.  Just past the bridge make a right at the dog off leash area.  Head under the power lines and make a left and then a right into the woods.  In the woods follow the well worn trail and also look for the blue spray paint on the trees.  In about 10 minutes you will see on your left a sign post, ignore this and head straight.  You will now be walking beside a stream on your right hand side.  Stay to the right of the stream.  In about 5 minutes you pass some blue flagging and will want to make a left at a tree with a particle wood boards nailed to it.  The trail gets steep here, in about 5 minutes you will make a right Taint sign.  In another 5 minutes you will come to a bit of a clearing, head left at this moment.  In about 10 minutes you will want to make a left and come to a nice view point of Nainamo.  Have your lunch here and enjoy.  You can now either head back down the same way you came up or for the loop get back on the trail head south.  This part of the trail can be a bit trickier, look for the trail and the blue spray paint and flagging.  After about 5 minutes after leaving the view point, make a right to down.  In another 5 minutes make at right at the blue blazes and then you will go up a little bluff and make a quick left.  In 5 minutes you will come to a steep section, at the top make a left. In about 10 minutes, head down a steep path and make a right at the bottom T junction.  After 5 minutes head straight and avoid the right turn.  In this area just look for flagging and the well worn path.  At times it will seem the path is a dried up stream bed.  After about 20 minutes you will be on the hydro service road, make a left here and head back towards Westwood Lake.  In 20 minutes you will see the Westwood Lake trail, get on to the trail and head counter clockwise.  In 20 minutes you will be back at your car.  Hope you enjoyed it.\r",
    "directions": "Take the Island Parkway to Nanaimo and get off at Jinglepot road. Then take Westwood Lake Road until you get to Westwood Lake.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/2374/reg_westwood1jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2374/reg_westwood2jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2374/reg_westwood3jpg.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/westwood-ridge-near-nanaimo-bc-2374",
    "stats": {
        "Activities": "hike mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "3 hrs",
        "Total Distance": "0 km",
        "Town": "Nanaimo, BC",
        "Type": "out-and-back"
    },
    "title": "Westwood Ridge",
    "trail_id": "2374"
}