{
    "description": "This is in fact the combination of at least 2 trails mostly on the south side of the Similkameen River in Manning Provincial Park, in southern BC.\r\n\r\nWe found that the trail \"disappeared\" from time to time, so use of the GPS data will be very helpful.\r\n\r\nStart at the Lightning Lake parking lot and head to the east end of the lake. You'll head through the bush and soon come to the south side of Twenty Minute Lake. As you come to the east end, you'll in fact be on the Dam Trail. Head east through the forest. 2-3 kms down the trail you'll come to the Similkameen West trail. Keep heading east, along the south shore of the Similkameen River.\r\n\r\nYou will eventually come to the sign for the Pacific Crest trail, which also leads to the Windy Joe trail. At this point, we turned left, crossed over the river on a bridge, and headed back west eventually to the Manning Park Lodge (follow the GPS track). \r\n\r\nWe crossed back over the road to Lightning Lake and got back on the Dam trail back to Lightning Lake.\r\n\r\nA very pleasant day snowshoeing through pine forest.\r\n\r\nBEWARE OF WALKING ON \"FROZEN\" LAKES, CREEKS AND RIVERS. THEY MIGHT NOT BE FROZEN AS HARD AS THEY LOOK AND THERE COULD BE NOBODY AROUND TO HELP YOU OUT SHOULD YOU BREAK THROUGH THE ICE.",
    "directions": "Manning Park is in southern BC, between Hope and Princeton on Hway 3 (beware, there is no gas for 60 kms in either direction). At the lodge, drive the 4 kms to Lightning Lake.",
    "geohash": "c2dp",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/2380/reg_MPSW0776.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2380/reg_best1_MPSW0792.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2380/topo_MPSW0789.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2380/narrow_MPSW0787.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2380/narrow_MPSW0788.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/manning-park-similkameen-west-trail-near-princeton-bc-2380",
    "stats": {
        "Activities": "snowshoe",
        "From": "",
        "Seasons": "winter",
        "Stars": 4,
        "Time": "4 hrs",
        "Total Distance": "12 km",
        "Town": "Princeton, BC",
        "Type": "out-and-back"
    },
    "title": "Manning Park - Similkameen West trail",
    "trail_id": "2380"
}