{
    "description": "The Mantario Trail winds through Manitoba's Whiteshell Provincial Park for 63 challenging kilometers.  We have taken groups through there in the heat of summer and the chill of winter.  Although it is hiked by many people throughout the year, you can sometimes walk for a couple of days without seeing anothe soul.  This trail takes you through some of the best that Manitoba has to offer:  High up Shield rock, river crossings on logs or beaver dams, numerous lakes, difficult marsh crossings, beautiful green forests, knee-straining ups and downs, High vistas overlooking miles of forests and lakes.  All this coupled with picturesque camp sites and even some very welcome composting toilets.  We have seen this trail when most of it was under water, when all of it was under 3 feet of snow and everywhere in between.  If you want to challenge yourself without driving many miles from civilization this is it ... IT.Some logistics are required to make the thru-hike of this trail.  I have given directions below to the south trail head.  You can attack this trail a few ways.  You can do an in-and-out hike from either the south or the north trail heads for a short trip or you can hike the trail end to end.  This will require eithe arranging transport to meet you at the destination trailhead or your group can drop a car at one end and shuttle together to the other trailhead to begin your walk.Either way you are going to see some of the nicest country in central Canada.  No Kidding.",
    "directions": "Access is easy from the trans Canada highway #1 either traveling east from Winnipeg (about 150 km) or west from Ontario into Manitoba.  Take the well marked West Hawk Lake exit and then turn left on highway #44.  Travel northwest on highway #44 until the highway #312 turnoff to the east.  Travel east on highway #312 for just a few kilometers until you see the sign for Mantario Hiking Trail Parking Lot.  Unload, stretch, pack, walk and enjoy.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/MB/2383/reg_MantarioCrossingjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/MB/2383/reg_MantarioSunsetjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/MB/2383/reg_MantarioVistajpg_best1_.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mantario-hiking-trail-near-winnipeg-mb-2383",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "28 hrs",
        "Total Distance": "63 km",
        "Town": "Winnipeg, MB",
        "Type": "out-and-back"
    },
    "title": "Mantario Hiking Trail",
    "trail_id": "2383"
}