{
    "description": "BIG SUMAS TO BARROWTOWN\n3/18/06\t08:30 AM\tCLOUDY WITH SUNNY BREAKS WIND S.W.   3º C\n\tThe day is overcast with the sun attempting to show its face. As we entered the trailhead the sweet song of a chickadee invited us to enter her home and enjoy our stay. We expected to run into snow at the 600 meter elevation.\n\tOur intention is to traverse Sumas Mountain from West to East. The trailhead is on Sumas Mountain. Rd. at what is known as Big Rock, a huge boulder deposited by the last ice age and to exit at the South East end trailhead in Barrowtown. A distance of aproximatly 14 kilometers. The trail begins as an easy ascent and gradually becomes steeper. It continues in this vain till we reach Chadsey Lake at 656 meters. Named after four pioneer brothers who farmed in the Sumas Prairie district in the latter part of the last century\n\tThe forest has a thick cover of ferns blanketing the ground, 15 species of ferns are found here such as bracken and licorice. Deciduousand coniferous trees are mixed together, balsam, spruce, and cedar along with cottonwood, vine maple, birch, wild cherry and birch. \nHuckleberry are just beginning to bud along with Nootka rose, red osier dogwood and Oregon grape.\n\tThere are a few forks but the trail is well marked and creeks abound. Unfortunately there is (was) active logging in this area and we cross over a logging road and logged off area to reconnect to the trail and leave the logging behind us. The canopy is thick but the trees are much spread out, it is dark but not gloomy, many mosses and liverworts add to the beautiful shades of green which predominate. There are 88 species of moss and liverwort found here.\n\tWe hear an eagle and raven; it is unusually quiet compared to summer. This will be the last bit of uphill and when we reach the lake it will be downhill from here to Barrowtown. There is a bit more snow here and after crossing Chadsey creek the snow is about 6 centimeters. When we reach the lake we find it iced over with aproximatly 12 centimeters of snow.\n\tOur hike has been done at a leisurely pace as we have been logging GPS points, compass headings and photos. It took us four hours to reach the lake and we sit down for lunch and brew up a cup of tea to enjoy with our lunch. As we sit to enjoy the winter scene and eagle glides silently high above the lake. The sun comes out in full force and it is quite warm and pleasant.\n\tAfter lunch we head out in a North Easterly direction, we pass through more forest and start to drop elevation from the West side of the mountain which starts to curve to the East. This is overgrown with scrub alder and maple. An assortment of shrubs and wildflowers are found here in the summer. Eventually it turns into an old logging road which is left over from logging many years ago. The view here is of the Fraser River and Strawberry Island to the North with Nicomen Island in the background. Six centimeters of snow lies on the road and a wildlife story is written here. Coyote tracks are predominant with some snowshoe hare sign. We see the splayed out footprints of raccoon and the occasional deer track. The road descends North Easterly at an easy gradient for about two kilometers before heading South another kilometer and then back into some old growth. \n\tMassive Douglas fir trees can be found along the trail here and a pair of them has blackened bark from an old fire. Occasional views of Vedder Canal, Sumas River, the farmed flats of Sumas prairie and\nChilliwack to the East are glimpsed through the trees. At One Time Sumas Lake once filled the Sumas prairie.\n\tThis is easy hiking that meanders Southerly for aproximatly three kilometers along the shoulder of the mountain crossing little creeks. The trail dips up and down and in and out in this portion. Winter wrens sing their lovely melody, but the steady hum of the freeway takes away from this idyllic setting. Let us not forget that access too many of these trails was made possible by industries such as logging and it is sometimes the price we must pay to enjoy the wilderness. Eventually you begin a switchback descent which returns you to the trailhead parking lot at Barrowtown.",
    "directions": "From the West\nTake Exit 95 (Whatcom Rd.) North and follow North Parallel Rd. East to Sumas Mnt. Rd. and then go North for 9.6 kilometers.Just pass the Big Rock look for the trailhead on the right.\nFrom the East\nTake Exit 104 North (No. 3 Rd.)Then go right on North Parallel Rd. Take a left on Quadling Rd. and cross over Sumas River Canal and park to your right. The trailhead is at the foot of the cliff.\nOR: load the GPS data of this trail into your GPS and navigate to the first waypoint, and, use the \"get directions tab\" of this entry to enter your address and get turn by turn directions.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/2386/reg_DSCF1928-31731.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2386/reg_DSCF1930-31731.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2386/reg_DSCF1932-31731.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2386/reg_IMG-7581-35773.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2386/reg_bigsumas1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2386/topo_sumas.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2386/narrow_IMG-7570-35773.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2386/narrow_IMG-7590-35773.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2386/narrow_bigsumas2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2386/narrow_bigsumas3.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2386/narrow_sumas-11395.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2386/narrow_sumas2-11395.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2386/narrow_sumas3-11395.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/sumas-mountain-near-abbotsford-bc-2386",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "7 hrs",
        "Total Distance": "15 km",
        "Town": "Abbotsford, BC",
        "Type": "out-and-back"
    },
    "title": "Sumas Mountain",
    "trail_id": "2386"
}