{
    "description": "King Mtn the way we did it is a hidden gem in the Gatineaus, following a series of steeps to flat areas, that culminate in an awesome scramble to the Ottawa Regions best unobstructed view.\nDistance is 4 to 5km if you also include the loop hike at the top of the escarpment.\nUnknowingly, as we searched for a our final ascent up steep terrain past the sheer cliffs where Turkey Vultures soar, we surfaced at the top of King Mtn exactly at a 1930's shrine to Surveyors!  How exciting, it marks the best view of the whole region and one of the first geodetic survey points in Canada.\nThe trail from the lower (unofficial) parking area at first takes you up a disintegrated settlers laneway then up a steady climb along a stream which at the time, was gushing. However, as the trail levelled off, we veered right as the google earth view shows (and away from the main trail that goes up the other side of King Mountain), staying under but away from the cliffs heading Southeast again, moving parallel to the road below us. Now following what looks to be an old hiker's trail, moving up the slope, you follow the cliff line, but at a distance. You haven't reached the steep part yet.\nYou end up at waypoint \"Cliffs\" (attached GPS) directly under the cliffs.  Looking up, you will see Turkey Vultures and hawks catching updrafts, possibly dozens of them. Not a good place to take a nap they may think you are roadkill :). As you continue, look for rock cairns that mark the way, and, an old hiking trail which we could still distinguish but was hard to follow (unless you intuitively follow the terrain).  If you switchback the steep slope as it ascends, under the cliffs, you'll likely be on the trail. As the area is ecologically sensitive, you should stay on the trail, as best as possible.\nIf you set your eventual goal to be atop the cliffs, the terrain will naturally guide you.  The trail peters out, so, at a certain point marked \"ROAM\" in the waypoint list, we started to make our own way by scrambling up steep terrain marked by large boulders cut from the cliffs above.  On a recent trip I found this area to be further overgrown, which could make the final ascent tough to do, and so after many trips, my favourite time to do this trail is in Spring with snow still underfoot. \nAs we ascended a couple of hundred feet more, we magically gained the top and the incredible view, this is possibly one of the highest points in the Gatineaus, but certainly the best view back to Ottawa -- even better than Champlain lookout.  You'll see a 12 foot high cairn, and some plaques. It turns out you have now joined a hiker's loop ( see Black Mountain / King Mountain post on Trailpeak) that circles the top of King Mountain. The less adventurous get to do this hike by driving up to the parking lot at Black Lake then following the trail up 10-15 minutes to the loop where you are.  There are a few benches to take a load off.\nFor cyclists who know the famous Black lake climb on the parkway, this is about where you are.  It's a marvelous hike.  The garbage under the Surveyor's Cairn that people have hurled off the lookout area is not so wonderful -- so pick up just one container, and, if many scramblers do it, the area will be clean again.\nNote: There are a number of great hikes along the escarpment, if you follow along Chemin de la Montagne, you will eventually also get to another hike right at the elbow where the road departs from hugging the mountain bottom, and, heads right angle(left)  towards the Ottawa river and hiway 148.  There is (was) an official parking area, unlike this hike.  Of course, if you follow hiway 148, for a good 20 minutes further NorthWest, you will get to another great escarpment hike, Lusk Falls, also written up on trailpeak.  This is Ottawa-Hulls \"Grouse Grind\" area.  The escarpment is steep, reaching elevations of almost 1,100 feet from a starting elevation of 400 feet, in a very short distance.  No, it's not a 4,000 foot mountain hike, but your heart will pound just the same, and, the views are fantastic.\nWe did this hike pre-bug and pre-vegetation season.  Wonderful.  This hike would be questionable in full bloom / summer / bug season.  In summer, take the main trail up King (left side of mountain facing it), it's an easy trail to follow, well trodden but still off the official maps.",
    "directions": "Drive along Chemin de la Montagne (North-West) heading away from Hull or Boul St. Raymond which you can easily get to from Pont Champlain if crossing from Ottawa. As you cross Champlain bridge, follow to the T intersection where you turn right and follow 1 km or so until you turn left on St. Raymond, follow to the end, and, zig-zag onto Chemin de la Montagne after briefly following Chemin Pink. Turn right onto Chemin de la Montagne, following the bottom of the Eardley escarpment.  The Google Earth map makes it fairly clear. Heading West, you will get to the parking area designated by the Park waypoint in the attached GPS data. There is room for a few cars as you park oppsoite Chemin Kelly (yes, many Irish settled in the area). You know you are getting close to Kelly after you pass the golf course on the left, with the mountains to your right.  You will see the golf course past Chemin Baillie.\nIn this case, you park on the side of the road or opposite a small road that heads down into a small neighbourhood.  I'll write back in with a better crossroad, but a sure bet is to grab the waypoints here.",
    "geohash": "f244c",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/QC/2390/reg_DSC-1134-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/2390/reg_DSC-1112-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/2390/reg_DSC-1113-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/2390/reg_DSC-1114-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/2390/reg_DSC-1116-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/2390/reg_DSC-1120-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/2390/reg_DSC-1123-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/2390/reg_DSC-1126-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/2390/reg_cliffsjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/2390/topo_valeriet.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/2390/narrow_shrinejpg.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/king-mtn-scramble-alternate-gatineau-park-near-gatineau-pq-2390",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "5 km",
        "Town": "Gatineau, PQ",
        "Type": "out-and-back"
    },
    "title": "King Mtn Scramble - alternate - Gatineau Park",
    "trail_id": "2390"
}