{
    "description": "Les Montagnes Chic-Chocs\r\n\nWe headed out from Moncton New Brunswick on the last week of March for Gaspe, Quebec. Our plans were to spend a week exploring the back country of \"Montagnes Chic-Chocs\". It's about a five hour drive from Moncton. You might need more time if you hit bad weather, especially in the Gaspe area. We booked shared accommodations, the park's staff calls them \"Huts\". Don't count on being alone in the hut, they are in usually booked months in advanced and are always full. It's about 25 bucks a night each body. Ours was an eight person hut named \"Arlequin\". We had electricity for lighting and a couple of outlets. The wood stove is great to heat the hut, but if it's going to be your only means of cooking, bring your swimsuit as it's going to be hot in there. I suggest you bring a propane burner. Oh and the firewood is provided. Anything else, you need to bring. They've got a heated public washroom with hot water and coin operated showers. (0.50$). It's located a couple of feet away from the huts. They suggest you boil the water if you're going to use it for drinking.\r\n\nThe first night out we went on a hike to test our avalanche gear that we rented from administration for 19$ a day. We saw lots of deer tracks but no deer. We didn't find any hiking trails near the huts but you only need to drive a couple of miles to find one.\r\n\nIn the morning we got ready for our first excursion. Mont Hog's back. It's about a 2 km hike up to the south summit on the marked trail. We took the shortcut which has a bigger accent but is only 1.6 km. If you're walking in the main trail, you will cross the power line. Turn right on the power line and walk about 10 minutes. On you left, you should see a single trail heading up in the woods. It's not well marked but you should be able to follow someone's tracks. It's a very well known shortcut. The power line is a good meeting point if a member of your group gets lost. During the climb, you'll find a couple of lookout points, but don't worry if you miss it, once you're on top the view is out of this world. Once you're over the tree line, make a sharp left and keep climbing until you hit the top. Once you're on the most southern top, you still have a 15 minute climb to the summit. The total hike up took about 1 hour & 45 minutes.\r\n\nYou'll see a sign leading to the north summit of Hog's Back. We stayed on the southern face. From this point, you can pick you descent line. We did two runs. The first run, we tried to stay in the untouched areas. The top section was great, good snow and lots of open areas. The bottom is tighter with lot's of tree. I suggest that once you hit the tree line, you hike up to meet the original trail. We ran down to the power line both times. On the last run, we went down to the river near the road. Bad idea, I wouldn't recommend it.\r\n\nThe next day we went to \"Les champs de Mars\". The total hike is 2.5 km. The accent is moderate. A lot easier than Hog's back. Climbing up, you'll cross the descent line twice. It's a nice climb with not a lot of lookout points, but very beautiful none the less. The hike will take about 1 hour & 20 minutes.\r\n\nOn top, you will see a first aid station on the trail (big blue barrel). This will be your first descent. On the South face, you will find a short glades line that will lead you down to a plateau about 500 feet below. Stay on the right side. DO NOT pass the plateau. (small hill) If you do, you'll be hiking you way out from a river down in the valley. From the plateau, you can hike up to the main trail on our right hand side if you're looking up the mountain. I suggest that you climb up to the first aid station again. On the south-west slope, you can climb up a bit more. You'll find a nice glades line all the way down to the main parking lot. This line is a nice safe run. Just watch out for the trees. \r\n\nThe next couple of days, we went hiking and some of us ran \"Les Champs Des Mars\" again. We all enjoined our days on \"Les Montagnes Chic-Chocs\" and will be going again & again & again. We might see you there.\r",
    "directions": "See description and / or GPS",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/QC/2391/reg_IMG3440JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/2391/reg_IMG3467JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/2391/reg_IMG3485JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/2391/reg_IMG3500JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/2391/narrow_IMG3430JPG.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/les-montagnes-chic-chocs-near-matane-pq-2391",
    "stats": {
        "Activities": "ski-bc",
        "From": "",
        "Seasons": "spring winter",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "0 km",
        "Town": "Matane, PQ",
        "Type": "out-and-back"
    },
    "title": "Les Montagnes Chic-Chocs",
    "trail_id": "2391"
}