{
    "description": "NTS Map: 082N08Elevation gain: 600m (2000ft). Distance is for return trip. The trail starts with a moderate uphill grade to a bridge 1km up. There is steady uphill with switchbacks for the next 5 kms. After crossing another bridge the trail emerges to open meadows near the lake's outlet. An excellent campground is located here with great views of the surrounding peaks.  The Panorama ridge trail starts north of the camping and a 0.5 km hike uphill brings you to extensive wildflower meadows. One can explore these meadows leading into a forest of alpine larch over the next kilometer. The views and colors are great especially in September. This area is also a great destination for skiing. The Taylor lake trail is a popular ski or snowshoe trip in winter, here is the Avaluator (Online Trip Planner) rating: Simple.",
    "directions": "Drive the TransCanada highway west to Castle junction 150km from Calgary. The trailhead parking is 8km west of this junction on the left side of the road. Trailhead info and map is found at the back of the parking lot. Walk across the bridge to start the trail, turning right.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/2395/long_DSC-0004[1].jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2395/reg_map.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2395/reg_taylor-lake-2-37916_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2395/reg_taylor-lake-37916.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2395/reg_taylorjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2395/reg_taylorlakejpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2395/narrow_alpinemeadowjpg.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/taylor-lake-near-banff-ab-2395",
    "stats": {
        "Activities": "hike ski-xc",
        "From": "",
        "Seasons": "winter fall summer",
        "Stars": 4,
        "Time": "6 hrs",
        "Total Distance": "15 km",
        "Town": "Banff, AB",
        "Type": "out-and-back"
    },
    "title": "Taylor Lake",
    "trail_id": "2395"
}