{
    "description": "The Broken Group in Barkley Sound is a wonderful place to paddle, with over 150 small islands and paddling experiences ranging from sheltered lagoons to rough west facing surf beaches and open ocean swell.  Because it is within the Pacific Rim National Park, camping is restricted to 8 specified camp sites.  These range from wooded sites to white sand beaches.The Broken Group can become very crowded in the summer months, and paddling is recommended then only if you are sociable!  Before June and after mid-September however, it is very uncrowded and spectacular.Some great memories include the amazing beaches, (and composting double-decker \"Gilligan's Island\" style toilets put up by parks, yes, the women liked them), lazing in the sun on tiny and shell Island groups, the swells towards the outer islands (nothing between you and Japan but open water, ok, maybe Hawaii if you lucked out) ... many more, not the least of which was a game of ultimate with our group on \"Deer Island\" which had a reasonable sized beach for us to play on.  Bring a guide or someone who knows the marine navigation, weather, etc.  Ours, one Margaret Wilson, was awesome!Map: NTS Map 092C14",
    "directions": "Launch from the Toquart Bay Forestry Service campsite, reached by driving a gravel road about 45 minutes.  Take Highway 4 from Port Alberni,and turn-off left at the sign opposite Kennedy Lake.  A great alternate way to access the area is via the M.V.Lady Rose.  Contact Port Alberni Marine Transport for rates and schedules.  The Lady Rose will take you, your boat and gear and drop you off at Sechart, an old whaling station located just outside the Group, where you can stay at the attractive new hostel, or launch for your first campsite.Note:  it is also possible to kayak the Broken Islands Group starting from Bamfield.  This beautiful little coastal resource town can be reached by driving 100km of dirt roads from Port Alberni, and has a number of water taxi services and kayak outfitters who will set you up with everything you need, and drop you off and pick you up again at the end of your trip.Attractions:  tiny shell beaches, white sand, small herds of deer, whales and dolphins, caves and blow-holes.  Short crossings.Hazards:  lots of boat traffic, dense fog which can persist for days in the summer, (have a compass and know how to use it!), swell and rough waters in the outer islands, and the crows are truly a menace!",
    "geohash": null,
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/24/reg_KT-Slides-B03.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/24/reg_KT-Slides-B05.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/24/reg_KT-Slides-B07.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/24/reg_KT-Slides-B09.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/24/reg_KT-Slides-B10.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/24/reg_KT-Slides-B13.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/24/reg_KT-Slides-B21.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/24/reg_MargPIC3.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/24/reg_reg_BrokenMap.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/24/topo_BrokenPIC1_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/24/EL 1.gif"
    ],
    "source_url": "https://trailpeak.com/trails/broken-group-near-port-alberni-bc-24",
    "stats": {
        "Activities": "sea-kayak",
        "From": "",
        "Seasons": "summer",
        "Stars": 4,
        "Time": "35 hrs",
        "Total Distance": "56 km",
        "Town": "Port Alberni, BC",
        "Type": "out-and-back"
    },
    "title": "Broken Group",
    "trail_id": "24"
}