{
    "description": "UNBC to Otway Ski Centre.\r\n Provides an easy stroll, or a brisk workout. Travel Northwest from UNBC to Otway Ski Centre. After a mild ascent,the trail reaches a high point with panoramic views of local mountains, such as Tabor. The trail then descends to a beaver pond and a small lake, and eventually passes an old Mine site. The Headwaters of the major drainage in the Greenway are reached next, at which point the trail follows the drainage. This section is one of the most scenic parts of the Greenway. The trail alternates between Open south-facing slopes with colorful meadows, and forested North-facing slopes. As one leaves the drainage, a private Wood Lot, with a dense mixed forest is encountered. One eventually emerges from the trees and parallels a regenerating forest which has an open sunny aspect. Next, the Greenway enters a denser forested area with a fairly consistent canopy of Interior Douglas Fir, Spruce, and Birch groves. With a slight fall in altitude the greenway enters the Otway Ski Trail at which point it descends beside a small creek until reaching the Biathlon area. The final section of the trail meanders through lodgepole pine forest following the ski trails until it reaches the parking area of the Otway Ski Centre.",
    "directions": "See description and / or GPS",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/240/reg_P8010789.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/240/reg_P8010790.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/240/reg_P8010792.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/240/reg_P8010793.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/240/reg_P8010796.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/240/reg_P8020799.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/240/reg_P8020800.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/240/reg_p8010794.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/240/reg_p8020798.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/cranbrook-hill-greenway-trail-near-prince-george-bc-240",
    "stats": {
        "Activities": "snowshoe hike ski-bc mtn-bike",
        "From": "",
        "Seasons": "winter summer",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "18 km",
        "Town": "Prince George, BC",
        "Type": "out-and-back"
    },
    "title": "Cranbrook Hill Greenway Trail",
    "trail_id": "240"
}