{
    "description": "This is a nice winter trail through open forest to Brew Lake.  There are many good views of Tricouni, Black Tusk and Mount Garibaldi along the route.  This is the main winter access route to reach the Brew Hut.  Most people use the trail to head to the hut for an overnight stay.  The trail climbs at a steady grade making for a quick easy ski going downhill.Note that this trail is not for hiking in the summer, as there is no in ground trail. If you attempt this route in the summer, expect to be wading through shoulder high blueberry bushes and bushwhacking around several bogs and small lakes.  The trail is in shape for skiing and snowshoeing once there are a couple feet of snow on the ground at the 1000m level (typically mid November).  This is enough snow to cover all the bushes and freeze the lakes, but there may still be some rough spots in the early season.The trailhead is just above the first switchback on Roe Creek branch R200.   Depending on the snow line, it can be up to 7.5km of skiing along the logging road to reach the trailhead.  The trail is marked with bright orange diamonds from the trailhead to Brew Lake, 3.5km away.  The trail start off going SE through the clearcut, and soon enters old growth forest.  Then, the trail climbs onto a bench and heads NE to join with meadows the lead N to Brew Lake.  It is another 2km from Brew Lake to the Brew Hut through the alpine, and there are no markers.Total distance from the plowed parking area is 11km to Brew Lake and 13km to the Brew Hut each way.",
    "directions": "Chance Creek FSR is just north of the Cheakamus Canyon and 1km south of the Garibaldi Lake road and the Daisy Lake Dam on highway 99.  The road is ploughed to 1.7km, but may be driveable beyond that depending on snow conditions.  At 3km, go right to stay on roe creek FSR, and follow it to a bridge over Roe Creek.  Pat the bridge, go left (upstream) for a few km to a spur road on the righ (branch R200).  The trailhead is about 1km up R200 just beyond the first switchback.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/2404/reg_DSC01516-40124.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2404/reg_DSC01538-40124.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2404/reg_DSC01539-40124.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2404/reg_DSC01544-40124.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2404/reg_DSC01619-40124.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2404/reg_RCWest0821.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2404/topo_RCMtGaribaldi0826.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/roe-creek-to-brew-lake-near-whistler-bc-2404",
    "stats": {
        "Activities": "snowshoe ski-bc",
        "From": "",
        "Seasons": "spring winter",
        "Stars": 3,
        "Time": "7 hrs",
        "Total Distance": "13 km",
        "Town": "Whistler, BC",
        "Type": "out-and-back"
    },
    "title": "Roe Creek to Brew Lake",
    "trail_id": "2404"
}