{
    "description": "The Powell Forest Canoe Route is located near the town of Powell River on the Sunshine Coast of B.C. and is a relatively unknown gem for canoeing.  To get there, catch a ferry at Horseshoe Bay to Langdale, Drive up the Peninsula to Earls Cove and catch the next ferry to Saltery Bay.  The whole drive takes about 4.5 Hours including ferries. You can also fly up using Pacific Coastal Airlines in less than 30 minutes and rent equipment from one of the local outfitters. These folks can also help with vehicle parking and pickup at the end of the route so it's a good idea to talk to them before setting out. Once you're off the ferry at Saltery Bay, drive approximately 10 km; you'll see the entrance sign on the right side of the road across the highway from Loubert Road (entrance to the community of Stillwater). Drive up the hill and approximately 5 km in you'll be at the start of the Route, Lois Lake Campsite. From Lois Lake you'll access the first leg of the trip up Lois Lake to Horseshoe Lake. The distance is approximately 8.5 km with a portage of 1.7 km between the first two lakes. Campsites are located along Horseshoe River and Horseshoe Lake and on Nanton Lake (25 campsites), this area is frequented by locals, so campsites are at a premium here. Total distance along Horseshoe and Nanton Lakes is approximately 6.5 km with a portage to the next lake, Ireland Lake; of approximately 2.4 km. Ireland Lake is a short 1 km paddle to the next portage at Dodd Lake (.8 km). Dodd Lake has a campsite (12 sites) and is another location well used by the locals. Length of lake is approximately 7 km. From Dodd Lake you portage (.7 km) to Windsor Lake and paddle for about 2.5 km. There is a small campsite (3 Sites) on Windsor Lake and then portage another 2.5 km to Goat Lake, where you'll also find camping (5 sites). Goat Lake is the last lake before you reach the final and largest lake, Powell Lake. Powell Lake is the last leg of the journey and ends at the world's second smallest river the Powell River.  Distance to the end of the canoe route is approximately 29 km, on the left side of the lake you can access Haywire Bay Regional Campsite which is a great overnight stop before you paddle down to the Shinglemill Marina and the end of the journey.  The Powell Forest Canoe Route encompasses some of the best wilderness areas you'll find on the BC Coast and is easily accessible from various entry points along the way for weekend warriors who don't have time to do the whole route. Kayakers and Canoeists will get a good workout on this trip and the bonus is, you can do it easily 3 seasons a year and even the 4th if your not afraid of a little cold weather (Some lakes may be frozen, check with the locals to make sure).Some things to know when you travel the route:Travel the route counter clockwise since portages are downhill this way.Powell Lake can get very rough in the afternoon with up to 3-foot swells.Purify your water, supplies should be safe but don't take the chance. Pack out what you pack in, there's no one out there to clean up after you.Take a cell phone - they work along most of the route.Canoe carts are not recommended unless under 24\" on a single wheel.Watch for wild animals and follow back country camping rules.  Keep food out of tents and in caches away from sleeping areas. Carry Bear Spray and wear bells.This is one of the best trips you'll have and well worth the short trip up the Sunshine Coast. Take a ferry from Horseshoe Bay to Langdale, and, then again at Earl's Cove to Saltery Bay, drive to Powell River, enquire at visitor center, or, follow road sign along hiway pointing to \"Powell River Canoe Route\", which has a put in at Lois Lake (you can camp there as well and arrange for a shuttle return to your vehicle), or, start at Mowatt bay in Powell River and do same.  There is however a very steep portage (and long, 2.5 km) to deal with at Goat Lake. Your choice on direction.  For the race (route in 2 days that normally takes 3-5 days), we started Lois lake.  Note, if you approach a rather large cement bridge (just past the canoe route green sign off the hiway several km before the town of Powell River), you will see an alternate route along Lois Main (an active logging road that is available after 5 p.m. and weekends for use to get to Lois Lake, it's a better road). There is also GPS data attached which marks the start (waypoint 004) at Lois lake, and, has marked all or most portage take-outs and subsequent put-ins, track is provided and waypoints.  The portages are along beautiful trail, gorgeous streams, and rainforest, big trees, although with canoes on our heads and in the 2-day race, I missed a lot of it.  Take your time and explore, some great camp-sites along the way which are free!!!The portage exits (take outs) are marked with \"trail markers\" keep an eye out for them, or better yet, use the GPS tracks and waypoints to double-check.  There is some wicked scenery, particularly along the water line where a rather \"Lord of the Rings\" paddling experience can be had amoungst ancient trees since flooded (there is some damming along the canoe route which changed older water levels).  Watch out for deadheads and snags! Lois lake for example, has controlled water levels by Hydro.  Nevertheless, it is a stunning route, and apart from the 5 portages on our day one (mind you we were racing), you get lots of paddling in and exceptionally warm and clear water to swim in!For more information and detailed maps contact the Powell River Visitor Infocentre toll free at 1-877-817-8669 or locally at 604-485-4701. Email prvb@prcn.org. Website: www.discoverpowellriver.com.For more information on \"The Great Canadian Canoe Race\" held along this route, visit: For more information, visit the web-site: www.greatcanadiancanoe.ca",
    "directions": "See description and / or GPS",
    "geohash": "c0z",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/241/long_Powell-096-34054.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/241/reg_bigmap.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/241/reg_race.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/241/reg_us.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/241/topo_title3_best1_.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/powell-forest-canoe-route-near-powell-river-bc-241",
    "stats": {
        "Activities": "river-canoe sea-kayak hike",
        "From": "",
        "Seasons": "spring fall",
        "Stars": 5,
        "Time": "35 hrs",
        "Total Distance": "80 km",
        "Town": "Powell River, BC",
        "Type": "out-and-back"
    },
    "title": "Powell Forest Canoe Route",
    "trail_id": "241"
}