{
    "description": "NTS Map: 082G08Elevation Gain: 675 m (2,200 ft). Distance: 10kms Prairie Bluff is a great early season scramble on the edge of the Southern Canadian Rockies.   We drove to Waterton National Park initially but decided there was too much snow to tackle our original destination (Ruby Ridge) so we settled on hiking in the Castle, since there looked to be much less snow in the area during our drive down from Lethbridge. The route starts near the Shell gas plant. Near the plant there is a gate that was locked, which prevented us from driving any further west. We parked ~100 m north of the gate and started our hike from there. We basically just walked straight up. It is mostly a hike up but we did decide to do a loop and found a more interesting route down which provided us a bit of scrambling opportunities.",
    "directions": "Take route 6 south from Pincher creek towards Waterton National Park and take the first right after the CPR train bridge. This road leads west towards the Shell plant. Continue past the Shell plant where there are huge blocks of yellow sulfur and enter the forestry reserve. Stay right at the first vee and continue until the storage complex where the West road is gated. You will see a sign here describing the Castle special management area and hiking for Victoria ridge. Find a place to park your car for the day near here (we turned right northwards and found a good parking spot maybe 50 metres from here).",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/2416/reg_DSC03252JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2416/reg_DSC03257JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2416/reg_DSC03264JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2416/reg_groupontopJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2416/reg_mitchonridge.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2416/topo_prairiebluffjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2416/narrow_jollinpointintoutcarsJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2416/narrow_mitchandicefalls.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/prairie-bluff-centre-outlier-to-south-ridge-near-pincher-creek-ab-2416",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 4,
        "Time": "6 hrs",
        "Total Distance": "10 km",
        "Town": "Pincher Creek, AB",
        "Type": "out-and-back"
    },
    "title": "Prairie Bluff (Centre Outlier to South Ridge)",
    "trail_id": "2416"
}