{
    "description": "Trail network is actually in Cumberland, only 7km away from Courtenay/Comox.\r\n\r\nCumberland is an historic coal mining town from the turn of the century when Coal Baron Dunsmuir operated a hard living coal-city complete with a China town (that is no more).\r\n\r\nHowever, some new digs have moved into town, including a very unique mountain biking hostel called the Riding Fool (see pic attached).\r\n\r\nIt is from this location, complete with Bike wash and $20 a nite (very nice) digs that you will ride.  For all the trails, purchase a map from the bike store just below the hostel, or, follow the attached GPS data with Google Earth views including street level detail for a claasic loop - as guided by Jeremy of Riding Fool. \r\nGenerally though you head out of town riding away from main street, on the same side road that the Riding Fool Hostel front door spits you out on, just ride away from town, veering left at the first street option, then right again and riding by the town park with a memorial at an actual old coal mine shaft (in the park on the right).  Riding just a bit further, for a total of just a few blocks, you'll see your trail entrace (logging road) on the left.\r\n\r\nAt that point you can choose to grind up the logging road, all the way to the top in fact (Bucket of Blood), or, take a trail to the right that is generally more interesting.  We did just that.\r\n\r\nFirst riding uphill on a trail called \"two and a juice\".  It's pleasant. \r\nAs the trail climbs, you cross a patch of dirt road and hop to the other side to access \"Buggered Pig\".  If you keep your eyes open (you should), you may notice the trail signs.\r\n\r\nGet on Buggered Pig for an amazing signature trail with all the elements of B.C. riding from long log rides with low risk exposure, to single track, some dips, and climbs.  A great trail that winds you deeper across the mountainous foothills. It's mostly level, and as the map shows, you are actually winding your way back to the main logging road, which you will reach.\r\n\r\nIn this overall area are several trails with more coming.  A local Downhill race circuit, and, quite a bit more.  Cumberland is busy making trails not coal mines now. Sitting on the wall at the Riding Fool is a very large map for you to study.\r\n\r\nAs we crossed a large Creek on the main logging road (marked with waypoint CRk for Creek in our Google Earth view) for a \"safety stop\" we began our climb up the logging road to our final trail, Bucket of Blood. Bucket is a freeride trail, all down.  Many may also be interested in another nearby trail gaining notoriety, Grub, Stub, and Pity the Foolwhich also shows incredibly well in Google Earth.\r\n\r\nWe rode up and up on the logging road, a few kilometers, with some hike a bike, then eventually reaching an access trail (signed on the trail - and marked in the GPS file as BUKT) off the road, and you follow this to a dammed lake providing local water supply.  You'll see some old car seats to mark the area, and that is marked with waypoint LAKE.  Continue along the left side of the lake, almost circling it, until you reach the official entrance to Bucket of Blood.\r\n\r\nOn this day, it was wet (missed what are supposed to be great views), and we found some snow at the top lingering on April 20.  Just the same, we road in the wet, and the first part of the trail is exposed rock, very slippery in the wet.  I was careful, being my third ride of the year. As we descended this trail that would rate as difficult, we came across various hits and jumps.  There are simple bypasses, and, I took these.  Although it didn't help, with a slip on a downslope, broke my collarbone as the shoulder caught a tree!!! No blood, but plenty of pain next day to warrant a trail name switch. We were almost down Bucket, so I walked just down to the logging road which takes us right into town.  I rode it, thinking I had simply roughed up a few tendons. A few ouchies on the way down.  Damn.\r\n\r\nBut no, X-rays don't lie.  I hope to return to Cumberland one day and ride in the sun, and do that last trail I didn't get a chance to do.  The day after there were 3 sunny days making me wonder why I didn't just put the feet up and read BIKE magazine at the hostel the day before.  The commons area at the hostel is huge, lots of couches, a woodstove, a pool table, what more do you want.  If you bike, make pilgrimmage to the Riding Fool.\r\n\r\nThe attached map and GPS data show a very nice 1/2 day tour of the local trail network.  If you ride with Jeremy or the riders who may be staying at the Riding Fool, you will likely get a first-hand tour.  You can ride here all week from the looks of it, and, the whole riding experience in this area combined with cafe, hostel and bike shop (and quirky used/antique store across the street) to keep you busy.  We missed the $3 burger nite at the local pub, which also has $7 steak Thursdays.",
    "directions": "Cumberland B.C. See the Riding Fool Hostel.  Vancouver Island about 2 hours north of the Nanaimo ferry.  Can't miss the Riding Fool, it's the large historic building on main street Cumberland.\r\nAlso worth a visit is the old Japanese / Chinese cemetary, some cool history here and some funky old homes and town centre that will catch on. Keep an eye on Cumberland.",
    "geohash": "c0z4",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/2428/reg_buckettopjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2428/reg_buggered2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2428/reg_fool.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2428/topo_buggered3jpg.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/buggered-pig-w-bucket-of-blood-near-courtenay-bc-2428",
    "stats": {
        "Activities": "mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "6 hrs",
        "Total Distance": "6 km",
        "Town": "Courtenay, BC",
        "Type": "out-and-back"
    },
    "title": "Buggered Pig w Bucket of Blood",
    "trail_id": "2428"
}