{
    "description": "We set out at 6:30am in hopes of summiting Mount Sproatt near Whistler. The weather was perfect so the only thing standing between us and the summit was the fact that I've been sitting on my ass for 2 months doing nothing and the fact that I had 2.5 hours sleep the night before. Just loading all my gear into the car was more exercise than I'd had in ages. After stopping in Squamish for a double espresso, I was feeling a little more optimistic. We arrived at the Rainbow trailhead off Alta Road at 9am and were on the move by 9:30. I hate the Rainbow Lake trail but it was slightly less hateful in winter. A blanket of crisp, white sparkling snow does wonders for a crappy logging road and the views of the Whistler mountains was spectacular. We left the trail at the point where we thought we'd be able to gain the ridge from and started climbing. Before long, we met up with a trail marker. Odd. So we hung a left, away from the marked trail and started climbing up even steeper stuff. The trail found us again. This happened a couple more times before we were finally able to rid ourselves of the psycho stalking trail. Vlad did a fantastic job of route finding and trail breaking. We stopped for lunch in a sunny patch but it was too cold to hang around long. Eva took a shift trail breaking and before long we found ourselves on a gently rolling plateu with more beautiful views. We traversed below the ridge for a while then headed up the steep (and I mean steep!) slopes. I took a few token turns at trail breaking but I was so tired that I didn't come close to pulling my weight. Once up on the ridge the views just got better and better. We had a blast taking pictures in a stand of really cool trees. Check out the pics. They looked like they had been sprayed with styrofoam. It was a nice break so we had a little more energy as we began the final ascent to the summit. The summit of Sproatt is a big, flatish area with lots of little bumps so it took us a few tries before we found the true summit. There were beautiful snow formations and a 360 degree view so we had fun snapping pics & exploring. We were hoping to get back to the car before dark so by 3:30 it was time to leave. What had taken us 5.5 hours to climb up took us 1 hour and 20 min to get down. We then had the long logging road descent but the views were even better than on the way up so it was bearable. 8 hours round trip. Great winter trip. Check it out!",
    "directions": "Drive north on hwy 99 & go left on Alta Lake Road. Cross the tracks and go 7km to the Whistler Cemetary.   Park at the cemetary and head up the obvious road.   Alternatively, continue 200m up the road and park at the Rainbow Trail.   The Rainbow Trail quickly meets the cemetary road and is fine to skin up but is dodgy to ski down.  GPS track goes up the Rainbow Trail and turns west at the second outhouse.  A short, steep climb soon turns into a beautiful, wide, mellow valley with many ski possibilities and easy access to the saddle NW of the summit.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/2443/reg_sproatt013jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2443/reg_sproatt019jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2443/reg_sproatt039jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2443/reg_sproatt046jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2443/reg_sproatt053jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2443/narrow_DSC-4237-12993.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2443/narrow_DSC-4239-12993_best1_.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mount-sproatt-near-whistler-bc-2443",
    "stats": {
        "Activities": "snowshoe ski-bc",
        "From": "",
        "Seasons": "winter",
        "Stars": 3,
        "Time": "7 hrs",
        "Total Distance": "16 km",
        "Town": "Whistler, BC",
        "Type": "out-and-back"
    },
    "title": "Mount Sproatt",
    "trail_id": "2443"
}