{
    "description": "NTS Map:92F10.  This hike is a nice short hike 3 hours return to Sandy Island (Tree Island as it is known locally) at the tip of Denman Island.  The entire hike is done at low tide so you are walking on the ocean floor.  Great care must be taken on this hike due to the tides so that you don't get cut off and have to swim back.  On the walk to the island you will pass interesting sea shore scenery and you will be able to see the beautiful Beaufort mountains. Camping is possible on the island and two pit toilets are provided.\r\n\r\nFrom where you park your car, you will notice a trail sign and a path to the left of a house.  Walk along the path to the beach and make a right here, make sure to mark this path because finding it on the way back might not be so easy.  Head along the beach for the next hour or so enjoying the scenery and ocean floor.  Once you get to a tree with a tire swing hanging from it make right and go over the bump.  You will now see tree island in the distance.  Make your way over to the island.\r",
    "directions": "Make your way over on the ferry to Denman Island.  Take the road up (it's the only road) and make a left at N.W. road, this should be the first left (you will see a couple of stores).  Keep going for quite a while, keep left when the road veers to the right.  At a no thru road sign head right (avoid the gravel road), you will now come to a fork in the road, head left.  You will now be on a gravel road, head left at the no thru road sign and park at the end of the road (it's a dead end).  You should see the trail to the left of the house.  Most of the road is paved and the small portion that is gravel is in excellent shape.  Any vehicle can get you here.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/2448/reg_IMG_1917_Large_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2448/reg_IMG_1924_Large_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2448/reg_IMG_1925_Large_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2448/reg_IMG_1926_Large_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2448/reg_IMG_1927_Large_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2448/reg_IMG_1930_Large_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2448/reg_IMG_1938_Large_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2448/reg_IMG_1945_Large_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2448/reg_IMG_1953_Large_.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/sandy-island-tree-island-near-courtenay-bc-2448",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring summer",
        "Stars": 3,
        "Time": "3 hrs",
        "Total Distance": "5 km",
        "Town": "Courtenay, BC",
        "Type": "out-and-back"
    },
    "title": "Sandy Island (Tree Island)",
    "trail_id": "2448"
}