{
    "description": "Sechelt, on the Sunshine coast, is blessed with kayaking, mountain biking, and nearby hiking. The ocean kayaking in particular is ideal for three reasons (besides the fact that it is a fairly well kept secret).  Firstly, Sechelt is very close to Vancouver, and only a short ferry ride from Horsehoe bay, and then a small drive from Langdale to Sechelt.  Secondly, the Sechelt Inlet is a long stretch of ocean, however, being an inlet it is somewhat more protected than the open ocean waters.  Thirdly, some of Canada's oldest trees are available for small hikes if one uses a kayak along the inlet to reach these forests, some trees 1700 years old.  Once you depart from the inlet (a great place to depart is the Pedals and Paddles rental shop just 5km past Porpoise Bay Prov park), you can find a nice beach (rocky but nice) every 3 or 4km along the inlet, which is otherwise undeveloped.  The road stops just past where you kayak from, so this is still pristine territory.  The inlet is the traditional territory of the Sechelt First Nations band, and you will pass former village sites that have been reclaimed by nature, the wind, and the waves.  The friendly folks at Pedals and Paddles are available to give a more interpretive tour, and they have lots of information and mini-destinations to suggest for you. ACCESS: At the main traffic light in Sechelt intersecting Wharf Road and Hwy 101, turn north on Wharf Road. After 600m, turn right onto Sechelt Inlet Road and proceed for another 4km to the Porpoise Bay Prov Park, and keep going past that anoyther 5km or so and look for the sign for Pedals and Paddles.",
    "directions": "See description and / or GPS",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/245/reg_best1_k1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/245/reg_p1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/245/reg_vic1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/245/topo_Sechelttopo.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/sechelt-inlet-near-sechelt-bc-245",
    "stats": {
        "Activities": "sea-kayak",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "10 km",
        "Town": "Sechelt, BC",
        "Type": "out-and-back"
    },
    "title": "Sechelt Inlet",
    "trail_id": "245"
}