{
    "description": "This is one of the more moderate trails on Mount Fromme, described by NSMBA as a cross country trail, and follows an old logging skid road built by Julius Fromme's logging company in the 1920's.  \nWhile a short section of the trail is used frequently by mountain bikers, most of the northern section of the trail is really only suitable for hiking.  Bikers should take care further into the trail as the soft ground is very prone to erosion when wet.\nFrom the top of Road Side Attraction heading north, the Cedar Trail crosses a washed out rocky creek bed onto double track.  Stay right at the bottom of the Crinkum Crankum trail.  The trail continues down to a washed out bridge across an un-named creek, then follows a skidder trail across to Kennedy (Creek) Falls, though it soon becomes un-rideable.  The trail can be a bit tricky to follow as there are numerous small trails heading up and down the hill off the main trail, with many different colours of flagging and trail markers.\nThe old trail leading up along the creek through tricky terrain leads to the upper falls.\nA more clearly marked hiking trail leads down Kennedy Creek to Lynn Creek.  \nLater in the summer, when the Lynn Creek waters are low, you can cross the creek, and a short uphill slog through untracked scrub will gain the Lynn Headwaters Connector trail.  From here you can follow Lynn Creek  downstream to Lynn Canyon Park, cross back over on the Baden Powell trail and close the loop back at Mountain Hwy just inside the first gate of Fromme.\nAlternatively, you can hike upstream to hook up with the Hanes Valley trail, which will eventually put you back the Mountain Hwy, not far from the Grouse Mountain ski resort.",
    "directions": "Park at the top of Mountain Hwy, south of the orange (locals only) parking sign.  \nHead up past the park entrance gate and the turn around gate.  The trail entrance to both Cedar trail (north) and Road Side Attraction (south) can be found on the right just prior to the corner of the first switch back.  It can be also accessed  from the bottom of Crinkum Crankum.\nCurrent Conditions:\n                  \t",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/2473/reg_Cedar_Trail_hike_cedar_plank_corduroy_road.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2473/reg_Cedar_Trail_hike_mossy_rock.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2473/reg_Cedar_Trail_hike_remnants_of_logging_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2473/reg_Cedar_Trail_hike_steep_river_banks.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2473/reg_Cedar_trail_hike_Dec2006_washout.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2473/reg_cedar1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2473/narrow_Cedar_Trail_hike_debris_strewn_creek.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mt-fromme-cedar-trail-near-vancouver-bc-2473",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "4 hrs",
        "Total Distance": "10 km",
        "Town": "Vancouver, BC",
        "Type": "out-and-back"
    },
    "title": "Mt. Fromme - Cedar Trail",
    "trail_id": "2473"
}