{
    "description": "NTS Map: 073L03A reclaimed Rail Trail and 'Linear Park' administered by a consortium of area municipalities and veteran trail builders.  Interesting path takes you through a number of towns so you don't even have to pack a tent if you don't want to.Nor do you have to do it all.  The handy proximity to towns means you can do whatever section(s) you want.The entire trail is described in more detail in 5 other trailpeak entries, \"Search Trails\" and type in Iron Horse to find the 5 listings. Personally after doing the whole thing this summer, I found the section from St. Paul to Heinsburg to be the most scenic. If you want a little more distance, I'd start in Ashmont and go through to Heinsburg. (Will have to hotel/camp somewhere unless you're Lance.) Riders of intermediate level should be able to average 60km a day if you want a workout, 30km would let you relax & take pictures, naps etc. Staying in St. Paul and/or Elk Point would work out well. GPS log only has one point, the WYE just East of Ashmont just to center the Google Map.  Refer to the individual sections for more detailed logs.Nice looking trail in surprisingly scenic countryside.  Sure it's flat(ish) but really, really pretty countryside.  You will be pleasantly surprised if you don't just HAVE to have singletrack and steep grinds to ride up & down.Getting good at riding over humped texas gates like the one shown will add a bit of technicality to the ride and insure you don't have to get off your bike ~53 times along the trail (like someone who shall remain nameless did).An in-depth website covers most aspects of the trail, please see  http://ironhorsetrail.ca/ for more info.  The website doesn't do a good job (as of last time I checked) on telling you where to stay.  Basic accomodations (hey, you're on an adventure trip, these motels add to the adventure) can be found in Smokey Lake, and at the Garner Lake Corner: The Spedden Inn.  Nicer motels & hotels are available in Cold Lake, Bonnyville, St. Paul, Elk Point.  NO hotels are available in Ashmont, Fort Kent.  You'll have to set your days' destinations to fit these.  Alternately, you may be able to tent at many of the staging areas and towns and possibly just in the middle of nowhere along the right-of-way (not sure what the local night life & wild life are like, use your own best judement on this).",
    "directions": "You can pick it up just about anywhere along it's length, Waskatenau in the West, Cold Lake in the NE, Heinsburg/Elk Point in the SE, St.Paul, Vilna, etc.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/2474/long_ihtJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2474/reg_DSC05701_Medium_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2474/reg_eastorwestjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2474/reg_stpaulstagejpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2474/topo_ihtrailmapjpg.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/iron-horse-trail-overview-near-st-paul-ab-2474",
    "stats": {
        "Activities": "snowshoe hike ski-xc mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "28 hrs",
        "Total Distance": "250 km",
        "Town": "St. Paul, AB",
        "Type": "out-and-back"
    },
    "title": "Iron Horse Trail - OVERVIEW",
    "trail_id": "2474"
}