{
    "description": "This is one of the more moderate trails on Burnaby Mountain.  It has a  few steeper sections, and a very few low built erosion control features, but it is generally a smooth flowing dirt trail.  At only 600m long it's all over pretty quickly, but this trail is a good little extra to be tacked on to another trail when you've still a little power left in your legs.See Nicoles/Mels for a top to bottom flow trail (although heavily eroded).\nAccess is via the Function Junction Trail, which leave the gravel Power Line trail about two hundred metres up from Pipeline Trail, heading left (west) at power pole number 128.  Ride right to the end of Function Junction, past the exits to Gear Jammer and Upper Cut, to the Lower Snake Entrance at the end.  Upper Snake is temporarily closed until erosion control planning and maintenance is completed.  Please respect all closure signs.\nParking can be found at the North Road gated end of the Pipeline Trail, or just past the west end of the Pipeline trail, on the north side of Gaglardi Way where the bike lane widens enough to park a number of cars.\nCurrent Conditions:",
    "directions": "See description and / or GPS",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/2476/reg_best1_burnaby_snake_2280.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2476/reg_burnaby_snake_2212.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2476/reg_burnaby_snake_2214.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2476/reg_burnaby_snake_2247.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2476/reg_burnaby_snake_2277.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2476/topo_burnaby_map-snake.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/burnaby-mtn-lower-snake-near-burnaby-bc-2476",
    "stats": {
        "Activities": "hike mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "3 km",
        "Town": "Burnaby, BC",
        "Type": "out-and-back"
    },
    "title": "Burnaby Mtn - Lower Snake",
    "trail_id": "2476"
}