{
    "description": "Well, this is it, one of Canada's best kept secrets - to Canadians that is.  Signs on the canoe route are in English and German if that tells you anything about overseas popularity.This route might be Canada's MOAB, Canada's Grand Canyon, take your pick.  Another way to describe it as the scenery you get driving from Banff to Jasper, except you're in a canoe, everything is pristine, from crystal clear waters to majestic mountain slopes all in their original state.  You can stop off at waterfalls, mini-hikes, visit old trapper's cabins, and witness nature as it has been for millenia.  You'll find a bit of other canoe traffic on the circuit (which can be a good thing), but since this park is managed by B.C. Parks, you'll find that you only encounter congestion at pinch points, of which there are few.  Instead you will mostly find beautiful pre-set up campsots (with bear caches), sandy beaches, rocky beaches, and lots of water-front camping and spectacular views.  The canoe circuit takes roughly 5-7 days and you travel a chain of lakes that takes you around an almost 'square' perimeter which encloses several mountain ranges. Click on \"view/download GPS\" to get an overview\". Tall Peaks, rugged mountains, a few glaciers, very steep mountain sides heading right into the lake. You have several portages to make, however, B.C. Parks has been nice enough to maintain a proper set of trails between lakes. Portages aren't so bad because these days, canoers take a small set of wheels with them upon which you roll your canoe along with some of your gear. The longest portages are 2.5km roughly. A few sections of fast water on the circuit, but nothing that the average canoeist can't handle.Basic directions are to get to Quesnel, in NorthEastern B.C. (a good 9 hour drive from Vancouver), and then continue on to do the Bowron Lakes, after which you can visit Barkerville. It is a 'living' museum, faithfully restored to it's wild west days when it was the largest city North of San Fran and West of Chicago.  Very cool, not hokey! The lengths people will go to for Gold, which is still mined in the area. The rather large China town and the history of Chinese immigration presented in one of the houses is fascinating. The whole town is first class, with most town shops faithfully restored (Barber, surveyor's office, Gen's stores, Doctor, 2 real ghosts, etc.). Here are a few things to look forward to;The mountain scenery and clear waterTwo or three large waterfalls to take side-trips toCamping right on Sandy Lake was a hi-lite, full moon, big mountain scenery, big sandy beach, and swimmable warm water (otherwise too cold on the circuit)Navigating through wetlands waterways in between LakesThe chance to stay in authentic settlers cabins - in bunksConnecting with nature, really connecting - bear and moose are common, as are mosquitoes, but you have to be up early to see a moose.  The mosquitoes will find you.Great exercise every dayThe quiet after dinner, after a day of paddling - great evenings and nights by the fireIn short though, \"Sandy Lake\" had our favourite campspot. There are some cabins on the circuit that sleep 8 to 10. If it's raining, make an early start for one of those.As far as directions go while on the route, you can do just fine with the parks map that is provided, and the route almost guides itself as the Lakes are mostly long and narrow.  In marshy areas between lakes, where meandering 'rivulets' divide the tall grasslands, B.C. Parks has placed directional signs to keep you on track as you paddle to start of the the next Lake.  No need for GPS here, you start where everyone starts at the Parks Canada office on Bowron Lake, and you go from there after watching their video on safety and etiquette. You pack it in, you pack it out.  And be mindful not to leave any food lying around.The seven day journey goes clockwise in the direction of Kibbee Lake, the shorter 3-day version heads down Bowron Lake in the opposite direction.All of the lakes and streams are named after historical figures, quite fascinating if you pick up the local guide-book in Barkerville. If you'd like to share your Bowron Lakes experiences, feel free to post a review in the discussion forum attached to this trail.",
    "directions": "See description and / or GPS",
    "geohash": null,
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/248/long_[Group-1]-P1030507-P1030518-12-images-24018.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/248/long_pango2-24018.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/248/long_pano4-24018.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/248/reg_081015141701-12619.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/248/reg_081015141753-12619.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/248/reg_081015142313-12619.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/248/reg_081015142605-12619.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/248/reg_081015142948-12619.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/248/reg_AnitaAward.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/248/reg_Group_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/248/reg_MeSusan.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/248/reg_bowron.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/248/reg_james.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/248/reg_mtn1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/248/reg_mtn2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/248/reg_new1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/248/reg_nice.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/248/reg_pano7-24018.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/248/reg_pano8-24018.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/bowron-lakes-near-quesnel-airport-bc-248",
    "stats": {
        "Activities": "river-canoe",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 5,
        "Time": "50 hrs",
        "Total Distance": "133 km",
        "Town": "Quesnel Airport, BC",
        "Type": "out-and-back"
    },
    "title": "Bowron Lakes",
    "trail_id": "248"
}