{
    "description": "NTS Map: 082O04After hiking up to the Ink Pots from Johnson Canyon, we continued on the Junction. Just past the Ink Pots is a wide open area surrounded by mountains. We crossed a pedestrian bridge over Johnson Creek. This part of the trail had a small stream running partially through it due to spring run off. We also had to traverse across a few tricky streams. The area was full of berry bushes so I would be carefull when the berries are ripe as it's prime bear country. Once past this area, you enter a forested area after a bit of elevation gain. We passed a wilderness campground and met a woman camping with her dog. The campsite is 0.1 km before the junction. We crossed another bridge, and got to the junction. In winter please check the local avalanche conditions and bulletins.",
    "directions": "East side of the Bow Valley Parkway(Highway 1A), 24km east of Banff; 6.5km east of Castle Junction. Trail is at the northest of the parking lot.There is another listing for Inkpots already on Trailpeak  here, which has GPS data for viewing in Google Earth.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/2492/reg_1_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2492/reg_2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2492/reg_3.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2492/reg_4.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2492/reg_map.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2492/narrow_mapjpg.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/inkpots-to-mystic-pass-luellen-lake-and-badger-pass-near-banff-ab-2492",
    "stats": {
        "Activities": "hike ski-xc",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "2 km",
        "Town": "Banff, AB",
        "Type": "out-and-back"
    },
    "title": "Inkpots to Mystic Pass, Luellen Lake and Badger Pass",
    "trail_id": "2492"
}