{
    "description": "NTS Map: 082h04\r\n14km return, elevation gain 250m (800').The trail from the townsite in Wateron Lakes National Park to Crandell Lake is one of the least travelled in the park. This could be because the trail parallels to Cameron Lake road for about 4km and at some points comes right down to the road. But for most of it's length, this trail stays a good distance from the road and you could forget how close it really is. It's not a real wilderness experience, but some folks just don't want that anyway. This trail is for them.This trail is one of only three trails in Waterton where mountain biking is allowed.\r\nThe trail starts right at the junction of the main road into town and the Cameron Lake road (Akamina Parkway). It wanders behind the houses for about 200m then crosses the road and continues through the forest.\r\nAfter about 4km, the trail veers further away from the road and then picks up the Crandell Lake Trail \r\n for the remainder of the hike to the lake.\r\nIf you're feeling ambitious, the trail continues past the lake, around the base of Mount Crandell, all the way back into town, total length of 20km all the remainder being nearly flat.\r\n\r\nIn winter please check the Avaluator\r\n(Online Trip Planner) rating is: \r\n Simple.  \r\nSee more trip planner route details here.\r\n\r\nCurrent conditions:\r",
    "directions": "The trail starts right at the junction of the main road into town and the Cameron Lake road (Akamina Parkway).",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/2498/long_elevation-profil-16529.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2498/reg_foto1-16529.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2498/reg_trail-16529.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/waterton-to-crandell-lake-near-waterton-park-gate-ab-2498",
    "stats": {
        "Activities": "hike mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "4 hrs",
        "Total Distance": "14 km",
        "Town": "Waterton Park Gate, AB",
        "Type": "out-and-back"
    },
    "title": "Waterton to Crandell Lake",
    "trail_id": "2498"
}