{
    "description": "NTS Map: 92G11The Chief as it is known is one of the better-known hikes primarily because it takes you up a humongous mountain-sized rock that most people see when driving highway (99) on their way to Whistler.  A favourite pastime (for passengers only) while driving by the chief is to spot the little specks of colour on the rock-face. These are climbers taking the hard way up almost 2000 feet of vertical rock to the summit, where they can join the hiking crowd that has taken the trail up.  Hikers and climbers who have reached the round rock summit have a spectacular view of the Squamish Valley, Howe Sound, the town of Squamish, and nearby peaks such as Garibaldi and Sky Pilot.  Hiking the Chief is very popular, as it is an easy choice for visitors or new hikers looking for an easy to find, hard to get lost on trail.  The route is well marked by aluminum signs on trees, and red paint on rocks. It does have a few tricky \"rope assist\" sections towards the top.  It is similar to the Grouse Grind in that log steps and guardrails have been constructed in places, so if you are an occasional hiker looking for that ?next step?, do the chief. Average hike times might be 2-3 hours to the top, but families (yes families do this) might take longer.  Allow a full day for the hike, particularly if you are driving up for the day from Vancouver.  Lunch up top on the rocks is awesome on a sunny day, but remember to pack everything away with you.  A sunny day is also advised because it makes wandering up top a little less stressful, you wouldn't want to walk off a cliff.Access to the trailhead is via either the Shannon Falls Parking lot, or the Stawamus Chief Provincial Park.  If using the latter, hikers should park just off Hwy 99 at the day-use area - where many of the climbers park - just South of Squamish.  Keep an eye out for signs to the park and a narrow parking lot just off the highway on the right as you approach Squamish.  This parking area is past the Shannon Falls parking. If you reach town, you've gone too far. The rock face of the Chief itself should also be a clue. After parking, walk up the access road, and into the Provincial Park, in fact, walking through the campsite area (hike-in camping) to the trailhead.  The trailhead is marked with appropriate disclaimers and warnings about the severity of the trail - which also gives you an indication of how popular it is.  It is definitely not a walk in the park, however, compared to other less visited and more remote trails, this is a nice day hike that can be found with relative ease.  That doesn't mean one shouldn't be fully prepared for the backcountry.  It might be tempting to just grab the sneakers and go ? don't do it, be prepared.  Bring water, first aid, appropriate footwear, and friends, to name a few essentials.Another access to the trail is via the Shannon Fall's parking area, whose access trail on the left cuts out some of the access road and initial steep section of the Chief.  To use this approach, walk along the main path from the parking lot and turn left past an open grassy space.  You will pass the site of the loggers? competitions, and see a metal marker reading Oleson Creek 15 minutes?.  Wind your way to the Creek, after which you will be ready to start the ?Chief? on the right. 800m or so farther up the main trail; the trail departs the creek on the left, and so begins your ascent of the Chief.As you climb the Chief, you will have to decide if you want to go to the first peak or second peak (or third).  The first peak trail branches left a short distance past a large boulder and bluff (where you might have stopped for a breather).  Just follow the red-markers, and if it's a sunny summer day, talk to the other hikers.",
    "directions": "See description and / or GPS",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/25/long_2012-09-13-Stawamus-Chief-1817-MKH-42086.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/25/reg_Chief1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/25/reg_Chief2-12324.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/25/reg_Chief3-12324.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/25/reg_Chief5-12324.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/25/reg_Chief5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/25/reg_Chief6.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/25/reg_Chief7-12324.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/25/reg_DSCN1845-3127.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/25/reg_IMG-2748-21991.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/25/reg_cheif-45374.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/25/reg_chief041-11387.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/25/reg_july07063JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/25/reg_july07067JPG_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/25/narrow_Chief1-12324.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/25/narrow_Chief4-12324.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/25/narrow_chief009-11387.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/25/narrow_chief017-11387.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/stawamus-chief-near-squamish-bc-25",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "7 km",
        "Town": "Squamish, BC",
        "Type": "out-and-back"
    },
    "title": "Stawamus Chief",
    "trail_id": "25"
}