{
    "description": "Gatineau Park's Skyline trail is a short loop that runs along the south and eastern edges of the Gatineau hills.  The trail was the first one created after the creation of Gatineau Park in 1938.  Take about an hour, the first section runs out of P7 (Kingsmere) parking lot along well groomed wide trail, then, the trail naturally takes a hair pin and ascends more steeply.\nAs you reach a lookout (there is a bench to the lookout) you have signs, you are at a main intersection that forms a T - with lookout.  Ascend, do not descend on the trail you've just come up on.  As you take this short climb (again very wide) you will see Skyline loop at your right as you level off, it's a loop with some great viewpoints, some ups and downs, there is a lot of history to this trail, and it's still a favourite for those looking for a quick fix hike after work, with views. Keep an eye out for the trail signs, it's well marked around here.",
    "directions": "From Old Chelsea, take the road to Kingsmere (at the main intersection past the pub - turn left onto Kingsmere Rd - CH Kingsmere).  Go through your next intersection (Notch Rd) a short few hundred meters away, and continue on Kingsmere as it winds along the bottom of the escarpment, keep going past the overpass of the Gatineau parkway (which is another parking area).  Follow until you see the P7 parking lot called Kingsmere.  Note you are not going to the Kingsmere historical grounds, you are going to Gatineau NCC parking lot P7.  See the GPS map to the right, click Expand + and zoom in to see the road network.  Stop by at the Chelsea Pub afterwards, a favourite of hikers, bikers, skiers and locals.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/QC/2510/reg_firstview1-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/2510/narrow_earlyon-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/2510/narrow_skyline-5.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/skyline-trail-gatineau-park-near-gatineau-pq-2510",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "6 km",
        "Town": "Gatineau, PQ",
        "Type": "out-and-back"
    },
    "title": "Skyline Trail - Gatineau Park",
    "trail_id": "2510"
}