{
    "description": "NTS Map:92F11  From Circlet Lk. campsite, go back to the last junction and turn right up the Albert Edward trail. Less than 1/2 km up turn left on the trail marked to Moat Lake. The trail goes past Moat Lk. to the S.E. corner, then climbs to a small plateau with some spectacular views of the Cruikshank Canyon and back towards Mt. Washington. After crossing the plateau the trail climbs again in an alpine area to a ridge and then goes along below the east side of Castlecrag where it crosses a large boulder slide.  The trail then turns west and climbs more steeply across the south slope of Castlecrag, finally dropping a little to the saddle between Castlecrag and Mt. Frink. (At this point a short side trail is marked that leads to the top of Castlecrag.)  After dropping down the south side of the saddle the trail climbs up the east ridge to the top of Mount Frink - some fairly steep sections up boulder areas here. Continue along the top of Mt. Frink and you will find a cairn marking the summit (this had a broken fishing pole stuck in it  in 2005 !!). Then turn north and go down to the saddle between Mt. Frink and the Ridge to Mt. Albert Edward. Cross this saddle by going around the hump in the bottom and climb up the ridge to join the trail to Mt. Albert Edward.  At this point you can decide whether to go left and climb to the summit of Albert Edward and back (aprox 3.5 km aditional) or just turn right and follow the Albert Edward trail back to Circlet Lake.\r\n   For a detailed description of the Albert Edward trail, see the Mt Albert Edward Trail review.\r\n   In the late summer and fall (depending on the previous snowpack and weather) there may not be any water available after you pass Moat Lake.\r",
    "directions": "From the Trailhead by Raven Lodge at Mount Washington Ski Resort, take the trail to Circlet Lake campsite. (average trail-aprox 11 km)   See the Mt Albert Edward Trail review.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/2514/long_2CircletLk.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2514/reg_1CircletLkJunc.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2514/reg_5Frink-Nslope.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2514/reg_6MoatLk.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2514/reg_IMG_2609_Large_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2514/reg_IMG_2614_Large_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2514/reg_IMG_2623_Large_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2514/reg_IMG_2687_Large_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2514/reg_IMG_2695_Large_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2514/reg_IMG_2699_Large_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2514/reg_IMG_2716_Large_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2514/topo_3Castlecrag_Frink.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2514/IMG-3364-17920.JPG"
    ],
    "source_url": "https://trailpeak.com/trails/castlecrag-mt-frink-loop-near-courtenay-bc-2514",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 3,
        "Time": "7 hrs",
        "Total Distance": "14 km",
        "Town": "Courtenay, BC",
        "Type": "out-and-back"
    },
    "title": "Castlecrag-Mt Frink Loop",
    "trail_id": "2514"
}