{
    "description": "June 24th, 2006.\r\nElevation gain: ~1,200 m (4,000 ft) Distance: ~5 kmsMax. elevation: 2,675 m (8,777 ft)  Mitch B. and Andrea K. joined me for a beautiful day of scrambling up Mount Henkel (June 24th, St. Jean de Baptiste day!) Last year on a very foggy outing in June, I hiked with the Chinook club to Apikuni Ridge. Views were quite mysterious last year due to the fog and I vowed to return on a clear day!\r\n\r\nReading through the climber's guide by J. Gordon Edwards, I was sold on the ascent via Mount Henkel to get to Mt. Apikuni (Appekunny). Ultimately, we decided to save Apikuni for another trip. It was quite a fun day so no regrets about leaving Apikuni for another time. Views from Henkel were awesome and there was a very cooling breeze blowing off the snow from distant peaks.\r\n\r\nThe ascent was pretty interesting. We tried to follow the Edward's route via the stream crossing that intersects the Iceberg Lake trail. We never could find his route once we neared the cliffs. (After a closer reading of his route description, I suspect we should have stayed in the drainage and followed that up to the ridge). We started following some goat trails to the West of the drainage, ascending up some rather sketchy ledges and our progress was quite slow. There was a lot of loose stuff on the ledges combined with a bit of exposure, so we finally traversed to the west for a couple of kilometers and were able to find a gully with a mix of class II and III terrain to gain the ridge. \r\n\r\nFrom the summit, there is a cool view of Kennedy lake below - (a somewhat dizzying drop-off the cliff of about 2,000 ft).  The route to Apikuni involves a little bit of class IV somewhere, I suspect just as you drop off Henkel.\r\n\r\nWe went up and down from the Iceberg Lake trail but others have done this hike from the Ptarmigan Tunnel (still closed due to snow), traversing the ridge to Henkel from Crowfeet Mountain. Another option is to continue along to Apikuni Peak and drop back down to the highway from there.\r\nWe did not see much wildlife other than a garter snake and a steady stream of hikers heading to Iceberg Lake. Speaking to hikers on the trail, we apparently just missed a young grizzly bear and a moose by 10 minutes, both just minutes from the car! Go figure.\r\n\r\nA good reference for this hike is 'A climber's guide to Glacier National Park' by J. Gordon Edwards.\r\n\r",
    "directions": "Follow the Iceberg Lake trail from the Many Glacier Trailhead and head up the stream crossing along the 'obvious' trail to the cliffs(Park at the Swiftcurrent motor inn). \r\n\r\nNote: driving from Alberta, head south from Cardston and turn west at Babb to the Many Glacier entrance.",
    "geohash": null,
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/MT/2527/long_swiftcurrentvalley.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/2527/reg_6mitchatsummit.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/2527/reg_MtApikuni.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/2527/reg_iceberglake.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/2527/reg_lookingdownatManyGlacierHotel.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/2527/reg_mtwilber.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/2527/topo_mt.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/2527/narrow_2lookingnorthfromsummitatcrowfeet.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/2527/narrow_5thesecretstaircaseJPG.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mount-henkel-gnp-montana-near-us-city-2527",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 4,
        "Time": "8 hrs",
        "Total Distance": "0 km",
        "Town": "US City",
        "Type": "out-and-back"
    },
    "title": "Mount Henkel (GNP, Montana)",
    "trail_id": "2527"
}