{
    "description": "Unique archipelago of islands choking the St. Lawrence seaway between Kingston and Brockville.Literally, a playground for sea kayakers of all skill levels!The St. Lawrence 1000 Islands are reminiscent of BC's Gulf Islands, with a similar rocky shoreline, ocean kayaking conditions, channels to cross, and wildlife  including Osprey and Bald Eagle.  The 1000 islands have considerable power boat traffic in certain areas, so plan your route accordingly. If you go with 1000 IKC (1000 Island kayak Company), they plan out a route where you don't have to contend with power boats. They know the area very well and give a great tour. If you want to roam amoungst ecologically unique Islands, some sand beaches, and, \"Roosevelt\" era cottage country reminiscent of the 30's and 40's, do the 1000 Islands by kayak. It's suitable for all levels, unless the winds are up.With the 1000 Islands having been a playground for the rich and famous in the late 1800's and early 20th Century, you've got some gorgeous cottages on the US and Canadian side that are interesting to paddle past. I imagined myself lounging for a weekend at some of the more breezy slumber-inducing ones, a relaxing mental exercise in itself.And there's an upside to some of the larger channels that we crossed, as we rode some of the wake the boats created. I quite liked that actually.  That being said, you have to be careful crossing the larger channels and your guides will show your group how to do that safely.  80% of your experience is quietly meandering amoungst small Islands, but you do have some crossings that make it exciting to say the least. We went with 1000 Islands Kayaking Company, who gave us an excellent tour that mostly weaved in and out of the small islands without much boat traffic.  I highly recommend this as a first paddle through this area, and you can't beat their gourmet (organic) lunch or the fact that they completely outfit you. The waters are crystal clear in part due to the zebra mussels filtering the waters of the great lakes and St. Lawrence.  In many ways, it had a Carribean sea feeling. On a hot sunny day, it was great to haul up on a beach then swim (with sandals on of course).Here's how our day one went.  First, we had an intro to kayaking for our large group of 9.  Scott, our guide, ensured  that everyone in our group mastered the basic paddle strokes and boat control.  We had 3 beginners with us. Then we ventured out on a route past several Islands to what I'd best describe as an open grotto, a sacred place to first nations for thousands of years.  Some Osprey viewing along the way, you can't miss their large nests. The vegetation of the Islands feels Carolinian, very different than Ottawa just an hour and a half north.  Here Chestnut trees grow abundantly on the Islands along with a variety of other tall tree species, ferns, and grasses (warning: there are ticks on some of the Islands, stick to the trails and you are fine, none of our group found any so don't fret too much about that). We stopped by an old schooner shipwreck where one of the guides gave us the full history, it was quite interesting to kayak over it and think back to the tall ship days.  Barry, our 2nd guide then hauled out a picture of the schooner, complete with a verbal recounting of the family that owned it and the party they had to sink it some time after the coal shipping days ended. Then it was lunch, and what a lunch.  Quite possibly the highlight of the day, presented with menonite salami, organic fruits of all kinds, speciality cheeses (all explained), and, fresh bread. We feasted but had no time to nap after lunch. We were a group of 9, but apparently this route is very popular with couples, and on such a tour it would be a romantic lunch indeed. We pressed on from Thartaway Island (our lunch stop and part of the National Park) and made our way to another National Park Island for a break and swim. We then parted ways with our guides as we made our own way to Camelot Island for our one night of camping. Camelot has 6 camp sites on it, each able to hold 2 tents. National park staff will visit 2 to 3 times per day to ensure tent site permits are paid.  There are no reservations, it's first come first served.Normally, Camelot is not full at all, but on this evening, we ran into a large group of kayakers from the US -- who kindly shared a few tent areas so we could all fit on the Island.  No sandy beach here, but some interesting trails and outcrops.  We had a great evening, and it all felt so international as we traded stories and compared notes -- we Canadians and Americans. The mixing of Canadian and American wines however, produced an interesting effect on some of our paddlers.The next day, we made our way along the US / Canada border darting into US waters fully expecting the US coast guard to bare down on us (they didn't) and then back to Canadian waters as we made our way to a point allowing us the easiest crossing to Gordon Island.  On that crossing, the largest of the recreational boats (we were never in the shipping lanes of the freighters at all) could cross our path. A few paddle wheelers and tour boats ply these waters taking tourists around the Isles.  Just at Gordon Island, I turned back into the channel to get the full effect from the wake of a large double decker tourist boat going by.  It allowed me to ride the wave for a good while.  Great fun.At the back side of Gordon Island, a small beach -- a spot for lunch and a swim for our group. From there, we pressed on across to the Canadian mainland, and, our kayak drop as directed by 1000ikc.com.All in all I'd describe the kayaking here as spectacular owing to the unique ecology and geography of the 1000 Islands, situated in a large mass of water that allows you to paddle for days -- giving you the Ocean kayak feeling. If you want to get into a mindless peaceful paddling experience which slips over you as you paddle to the sound of waves and paddle dipping, this is it!Our group thoroughly enjoyed it.  We thought there should be at least a few Islands in the national park reserved for kayakers alone, no power boats -- perhaps the one downside but as long as you understand you'll have company at most Islands, it's cool.  Apparently there is one such Island, but it's owned by the ACA (American Canoe Association).  It's in Canadian waters, and it's called Sugar Island.  It's fairly large, and uninhabited, allowing for what looks like stellar camping without power boats nearby. One must be a member of the ACA to camp here.  Sugar is not far from Gordon Island.Given the fact that there are still a dozen or so National Park Islands in all -- we were grateful we could experience it.  I'd recommend taking the tour guide option -- at least on day one -- so that you are given the best routes possible, away from the shipping and boating lanes.  With our guides, we also had some great local stories, and a lunch  to write home about.  We also had good fiberglass sea kayaks, it wouldn't be wise to take the smaller recreational sit-on-tops into these waters. Treat these waters with respect.",
    "directions": "Hwy#401 between Kingston and Brockville.Many launch sites, we launched from the Gananoque docks as arranged by 1000 Islands Kayaking Company. We were guided day one, camped on Camelot Island ourselves, then made our way to our take out location as 1000 IKC requested of us -- and they picked up the boats for us allowing us to do a point to point route that gave us an extended route with lots to see.contact:  1000 Island kayak Company",
    "geohash": "drc",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/ON/2528/reg_IMG-0136-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/2528/reg_IMG-0137-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/2528/reg_IMG-0138-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/2528/reg_IMG-0139-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/2528/reg_IMG-0140-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/2528/reg_IMG-0141-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/2528/reg_IMG-0143-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/2528/reg_IMG-0148-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/2528/reg_IMG-0149-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/2528/reg_IMG-0150-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/2528/reg_IMG-0154-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/2528/reg_IMG-0156-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/2528/reg_IMG-0158-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/2528/reg_IMG-0159-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/2528/reg_lunch-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/2528/reg_osprey-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/2528/reg_start-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/2528/reg_starting-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/2528/narrow_20040911Image0083JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/2528/narrow_20040911Image0083JPG_best1_.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/1000-islands-near-brockville-on-2528",
    "stats": {
        "Activities": "sea-kayak",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 4,
        "Time": "21 hrs",
        "Total Distance": "20 km",
        "Town": "Brockville, ON",
        "Type": "out-and-back"
    },
    "title": "1000 Islands",
    "trail_id": "2528"
}