{
    "description": "Canoeing the Pelly River between Ross River and Faro is very enjoyable. It is a great reward for the people who hiked the Dena Cho Trail  from Faro to Ross River. Two days are perfect for the trip. The Pelly River is located in the broad Tintina fault, which displays an exceptionallly great diversity of  wildlife, plant species, and landscapes. Chances to watch wildlife, mostly moose, eagles, beavers, but also wolves, bears and lynxes are excellent. Hoodoos are impressive, especially before Orchay creek. The diversity of sceneries for such a short trip is impressive.\r\nIn the summer evening, the abundant sage on the dry steep banks perfums the air on the river. Climate is continental and rather dry, summer is usually warm.\r\nThere are sand beaches, islands and many pleasant spots to set up the camp; some of the nicest are located near Orchay Creek, which is half way. Canoes can be delivered at Ross River and picked up in Faro by Blue House B&B (  Nature Friends Outdoor Adventures) located in Faro).\r\n\r\n\r\nThis river stretch is easy and rated class I. \r\n[advertisement]\r\n For a great adventure, you can hike the Dena Cho trail, carrying a light packraft from Alpacka Raft and then use it to paddle back to Faro, camping at the cabin along the way. Packrafts get you to some wild places, where lakes and rivers are no longer an obstacle to the backpacker!\r\n\r",
    "directions": "Start at the community of Ross River beside the ferry, 75km southeast of Faro. The takeout point is about 150m before the bridge at Faro on the right(safer) or after the bridge on the left when the water level is not high.\r\n[advertisement]\r\nGuided  tours, canoe rentals and can be arranged with \r\n Nature Friends Outdoor Adventures .\r\n\r\nWhile accommodation is available at \r\nthe  \r\n Blue House B&B .\r\n\r\nContact info - Phone & Fax: (867)994-2106 and  email:    BlueHouseBandB@yknet.ca\r\n\r\nSee their website also at  Nature Friends Outdoor Adventures.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/YT/2530/reg_P1010830-8779.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/YT/2530/reg_Pelly2-8779.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/YT/2530/reg_Pelly3-8779.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/YT/2530/reg_hoodoosjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/YT/2530/reg_pelly1-8779.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/YT/2530/reg_pellyhoodoosjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/YT/2530/reg_pellyorchayjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/YT/2530/reg_view2.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/pelly-river-near-faro-yt-2530",
    "stats": {
        "Activities": "river-kayak river-canoe",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 4,
        "Time": "16 hrs",
        "Total Distance": "75 km",
        "Town": "Faro, YT",
        "Type": "out-and-back"
    },
    "title": "Pelly River",
    "trail_id": "2530"
}