{
    "description": "The Cole Harbour River is a series of lakes and stillwaters with minimal stretches of moving water.  The total length of the trip was just over 12 km with three short and well traveled.  From the parking spot near Upper Whitehead a 150 m carry over a well-worn trail lands you at the put-in.  You will paddle about 1.4 km through protected stillwaters and a small lake before crossing Panhandle Lake.  At the south end of Panhandle Lake there is a shallow and rocky section of rapids so the canoe must be carried 130 m down another well-marked but very rocky trail.  Continuing on through Halfway Run Lakes and Allen's Lake (or Mayflower Lake, depending on whom you ask) you arrive at the sandbar across the mouth of Cooeycoff Lake and may have to drag over depending on the water levels.  Cooeycoff Lake is a large lake that can be a challenge to paddle if the wind is strong especially from the southwest.  There are about 10 camps on Cooeycoff including one profiled in Bud Inglis' book \"Backwoods Cabins of Nova Scotia\" that is reportedly over 100 years old.  The route continues to the south where an old take-out and portage trail can be found to bypass a large waterfall.  The 25 foot drop is not navigable in any water.  The short carry leads you to the upper reaches of Sand Lake and is the last time you will have to get out of the boat before the final takeout.  The route continues through a mixture of small lakes and stillwaters and never really gets into much flowing water.  After the falls below Cooeycoff there is 6 km of paddling remaining to get to the takeout.  Another option is to paddle right to the bridge crossing Rt. 316 where the river empties into the Atlantic (approx. N45 15.943 W61 15.670).  The stretch of river from the takeout to here however is rocky and shallow and reportedly requires a lot  of portaging with no known trails.  See the route map for more info or go to    http://www.flickr.com/photo_zoom.gne?id=171473803&size=l      for a higher resolution version.  The best part of the trip is the upper sections from the put-in down to the end of Allen's or Mayflower Lake.  This stretch is more protected from the wind and has no cottages so it is more like real wilderness canoeing.  One could paddle just the upper section and return to their vehicle instead of making the trip down to Cole Harbour.  In Cooeycoff and the lakes below there are several camps and lots of old wooden boats that the locals use for fishing.  The land surrounding the water is for the most part very thick with vegetation and/or bog making travel by boat the only real alternative.  The air temperature in this area is generally ten degrees cooler than the average inland temperature and a breeze or wind off of the water is almost guaranteed in the afternoon.  The route is through wilderness but because of the ruggedness of the country there is not a lot of animal sightings.  The only large inhabitant of the region is the remnants of the mainland moose population, but they are few and far between and are not often seen.",
    "directions": "First you must decide if you will paddle down from the put-in and return or go straight through to Cole Harbour.  If you decide to paddle one way you must leave a shuttle vehicle in Cole Harbour, Guysborough County.  Take Rt. 316 through the small village and turn inland on an old road through a sand pit at N45 15.587 W61.14.541.  Go right at both forks to get back to the river where you can park at approx. N45 15.971 W61 14.512.  This road probably requires SUV or truck but it is short so you can walk it instead and leave your car near the road.  Alternatively, you may choose to paddle the last 2 km and finish where the river passes under the road and enters the harbour.  As mentioned, this section has been described as rocky but may be mostly passable with high water.  After dropping the shuttle vehicle continue along Route 316 to a small clearing off of the road past Upper Whitehead (at approx. N45 19.586 W61 10.883).  The clearing is big enough for two or three vehicles and is only about 150 meters from the put-in.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/2542/reg_CHRiver01LookingbackatPanhandleLakefromtakeoutjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/2542/reg_CHRiver02ViewacrossCooeycoffLakefromtakeoutjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/2542/reg_CHRiver03FallsbelowCooeycoffLakejpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/2542/reg_CHRiver04ViewofbarrensfromSandLakejpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/2542/reg_CHRiver05StillwaterandsurroundinglandbelowGooseneckLakejpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/2542/topo_CanoeRouteMapColeHarbourRiverjpg.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/cole-harbour-river-near-port-hawksbury-ns-2542",
    "stats": {
        "Activities": "river-canoe",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 3,
        "Time": "4 hrs",
        "Total Distance": "12 km",
        "Town": "Port Hawksbury, NS",
        "Type": "out-and-back"
    },
    "title": "Cole Harbour River",
    "trail_id": "2542"
}