{
    "description": "El. Gain: ~1280 m (4200');  Dist.: ~16 kms (10 mi); Max. El.: 3058 m (10034')\n -July 4, 2006. \nAlthough not technically difficult, Mount Siyeh is an invigorating scramble and takes a full day. \n The standard route up Mount Siyeh follows a drainage gully up through the cliff bands towards the loose rubble that covers the broad ridge leading to the summit (see GPS waypoints). The route is described in some detail in the Climber's Guide to GNP *1* by J. Gordon Edwards and also in the Peaks and Trail routes *2* visual guide by Kathy Ocker and Marcus Wilsey. I am not sure if the gully we took is the standard route - another gully over to the northeast seems to more closely match the route descriptions by others but was still filled with snow. *See notes 1-2 at the end of text.*\nFrom afar the route looks insane. A gully to the NE looks more do-able but was still full of snow. Upon closer examination, we noticed a teeny red dot and a tiny blue dot in the gully that we chose for our ascent. Hark! Other scramblers! The couple we spotted were ascending what looked to be the best remaining route possibility, which provided us with some consolation - as well as incentive to don our climbing helmets (a few years ago there was a casualty on Siyeh when a man received serious trauma from rock-fall). We later met the other scramblers at the summit- both summer students who were doing amphibian surveys in GNP. It was somewhat surprising that there were no other climbers up this peak this day, since it was the July 4th long weekend, not to mention that Mt. Siyeh  was featured in 2006 in an issue of ever popular 'Backpacker' magazine. \nGaining the base of the gully, the route no longer seems quite so insanely steep. There are a number of class III scrambly bits on the ascent up the gully, but generally there are many little ledges along the way that are quite easily ascended. At the top of the gully there was a patch of snow just below the cliffs. Ascending this last cliff band forms the crux of the ascent. We found a weakness in the cliff above the snow patch and climbed up and found ourselves looking at a rock cairn that proved other climbers had been up Â?our' route. From this point the rest of the route is quite honestly a boring slog - but once the ridge is gained, the views to the North are simply awesome! \n To the west, Mt. Piegan and Mt. Gould figure prominently. Across the valley to the south, Jackson and Blackfoot Glacier look like a mirage of snow and ice, especially on a very hot July day. The summit also has a breath-taking 4,200 ft cliff that drops off the north face to Cracker Lake below. \n[Note 1: I find Edward's descriptions are sometimes like trailers for movies - they tell a lot about the story and the plot, but don't give away the best and worst parts - meaning you usually can find the trailhead but you still have to do a lot of route findingÂ?  plus Edwards may have glossed over the bits about exposure, slogging up loose rubble/scree, difficult scrambling etc.! \nNote 2: I only watched the 'Peaks and Trail routes' video briefly a couple of weeks ago at the library because I do not actually own a VHS, but the video is quite detailed and frankly takes away the suspense of your own route finding - since the video is so detailed!  The video was simply too cheap to resist ($10 on sale one day at the visitor centre at Logan's Pass.)] \nScramble rating: III (III) ML",
    "directions": "Park at Siyeh Bend and follow the Piegan Pass Trail l to the Siyeh Pass  (see trail description on TP for Siyeh pass)junction at the 2.7 mile marker. At this point head through 'Preston Park' - a sparsely forested meadowy area that leads to the base of the mountain. NOTE: THIS WEB-LOG MIGHT STILL GET YOU LOST!!! I STRONGLY SUGGEST THAT YOU DO YOUR HOMEWORK AND CHECK OUT A MAP AS WELL AS EDWARD'S CLIMBING GUIDE.",
    "geohash": null,
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/MT/2548/reg_DSC04034.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/2548/reg_DSC04042.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/2548/reg_DSC04052.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/2548/reg_DSC04056.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/2548/reg_DSC04071.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/2548/reg_DSC04075.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/2548/reg_DSC04103.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/2548/reg_DSC04115.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/2548/reg_DSC04121.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/2548/reg_DSC04125.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/2548/reg_lookatmitchnow.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/2548/reg_routeupanddown.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/2548/reg_thecruxgoingupanddowncopy.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/2548/reg_topo_mtsiyehsmla.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/2548/narrow_DSC04102.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/2548/narrow_humptydumpty.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mount-siyeh-glacier-national-park-montana-near-babb-mt-2548",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 4,
        "Time": "8 hrs",
        "Total Distance": "16 km",
        "Town": "Babb, MT",
        "Type": "out-and-back"
    },
    "title": "Mount Siyeh, Glacier National Park (Montana)",
    "trail_id": "2548"
}