{
    "description": "NTS Map: 082O01If you want a fun, easy float, in an urban area, this is it.  Great access, regular patrols to keep things safe for families and beginners and you get to see all the runners & bikers sweating it out along th trails beside the river.\r\n\r\nAdded bonus:  No powered craft (except patrol craft) within Calgary city limits so it's nice, quiet & safe.\r\n\r\nA easy float down through the middle of town.  There are numerous places to put in, take out, parking is free for the most part, you can easily tailor this trip to meet your needs.\r\n\r\nWARNING !!  The biggest thing to watch out for is the WEIR (also known as \"The Drowning Machine\") just downstream from the zoo.  There is an easy exit & portage there and ample warning signs, but be on the far South side of the river.  The enclosed GPS log shows us getting out about 300m upstream from there (only because that's where we live).\r\n\r\nThere is also a few shallow areas, the odd snag (branch overhanging the river) and a couple shallow rocks.\r\n\r\nThere is plans to develop the weir into a navagatable area with kayaking features in the next couple years (2007-8) so watch for that.",
    "directions": "Start in any riverside park in Calgary, we started in Bowness Park.  Drive west on 16th Ave. NW  (a.k.a. Hiway 1) and follow the signs across the street from Calgary Olympic Park.\r\n\r\nPark a shuttle vehicle in the area of Pierce Estate Park (Fish Hatchery) or Eau Claire downtown.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/2560/reg_best1_bteamjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2560/reg_cloud1jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2560/reg_clouds2jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2560/reg_downtown.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2560/reg_map.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2560/reg_rapidsjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2560/reg_seetheduckjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2560/topo_floatmapJPG.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/bow-river-calgary-float-near-calgary-ab-2560",
    "stats": {
        "Activities": "sea-kayak river-canoe river-kayak",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 4,
        "Time": "4 hrs",
        "Total Distance": "20 km",
        "Town": "Calgary, AB",
        "Type": "out-and-back"
    },
    "title": "Bow River - Calgary Float",
    "trail_id": "2560"
}