{
    "description": "Ballantyne Cove to Cribbons Cove Warf, Cape George.The Cape George region is a relatively small (around 100 square kilometers) but distinctive tooth of land on the doorstep of Cape Breton, jutting out of North Eastern Nova Scotia. Its summer-warmed waters share coastline with the Northumberland Strait and Gulf of Saint Lawrence. The landscape is undulating, giving the land a lively character of forests, basalt, choss and beaches.This trip is perfect for those longing to paddle open waters, offering a better perspective of the landscape than from more sheltered environs.I planned this trip as a Gov. wharf to wharf, paddle, in classic book-end style. What's neat about the locations is that just prior to leaving Ballantyne cove, you can veg out at a quaint little canteen, dock side. Leaving from either the beach or the wharf, (watch out for boat traffic) you head south, skirting long beaches and estuaries, all the while, admiring the landscape from as far out as you would like.While on route, expect to see many different species of shore birds. Notible are the abundant herons, the kingfisher and eagles hunting for food.Rounding off this less than three hour trip (13 K) lands you at Cribbons wharf where once you secure away your kayaks, you can satisfy your Odyssian cravings at the seafood restaurant adjacent to the wharf. While there, ask the locals about \"The Rock.\" It's within walking distance, and offers you a place to lie out, explore, or swim in cool ocean waters. You would have passed it en-route to your landing earlier.If you are interested in making this trip a day or two in length, start further back at either Malignant Cove Pond, or Livingstone Cove, and paddle along the coast, to round Cape George proper. The tooth shape of land just begs to be skirted, but be wary of changing winds and currents due to the geography. Prevailing winds are from the South-West, and grow stronger by the afternoon.To wrap up a day's paddle, you could make your night's stay in style, by turning inland and portaging a small estuary gravel bar at South Lake or Cribbons Beach. Paddling a short distance up the lake brings you to the Fisherman's Crossing B&B in Lakevale. There you can rest your weary sole in their outdoor pool. Life is sweet!Your second day would have you leaving from the same estuary. Continue south past Cribbons Point toward beautiful Mahoneys Beach, where a narrow inlet provides a gateway to sheltered waters. You would meander your way past a few islands, into Antigonish Harbour. An old shipping canal along the South-West will bring you to the heart of Antigonish to conclude your day. Take out there, and head for the pub. You earned it!",
    "directions": "Both wharfs can be accessed directly from the sunrise trail, route 337. These are busy active fishing regions, so wharf traffic is steady during in-season fishing.",
    "geohash": "f85u",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/2567/reg_ballantynejpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/2567/reg_estuaryjpg_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/2567/reg_rocksjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/2567/reg_southlakejpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/2567/narrow_ballantynetrapsjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/2567/narrow_warftowarfjpgjpg.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/ballantyne-to-cribbons-wharf-cape-george-ns-near-antigonish-ns-2567",
    "stats": {
        "Activities": "sea-kayak",
        "From": "",
        "Seasons": "summer",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "13 km",
        "Town": "Antigonish, NS",
        "Type": "out-and-back"
    },
    "title": "Ballantyne to Cribbons Wharf, Cape George, NS",
    "trail_id": "2567"
}