{
    "description": "The first 1.5kms of switchbacks are a pretty steady climb under the cover of fir and hemlock.  The next 1.5km is interspersed with steep meadows and alpine forest.  Late July and August bring out an array of alpine flowers.  After about 3.5km of trekking, you reach the Skyline Divide crest (5800 feet), which is mostly above the tree line.  Walking about 1km along the ridge, a knoll to the left of the main trail rises to about 6200 feet.  From the knoll, you will experience a great view of Mt. Baker.  From this vantage point, you can survey the trail you may wish to wander to bring you closer to the main peak.\nCaution:  Bring plenty of water for there is not much on the trail.  We did the hike in mid August when the bugs, mainly flies, were attacking in swarms.\nDirections\nFrom the Glacier Public Service Center on Hwy 542, drive 1.6km east, then turn south onto Glacier Creek Road 39.  Immediately take the left fork, Dead Horse Road 37, and drive along the south side of the North Fork Nooksack River.  After about 6.5km, the road gets steep and rough with many switchbacks.  After driving another approximately 14km, you will have achieved 2900 feet in elevation.  The parking lot and trail head is at about 4400 feet.\nNote: the road is easily passable using a low clearance vehicle - just be aware of the many potholes and dusty conditions.",
    "directions": "See description and / or GPS",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/WA/257/long_009.jpg",
        "https://trailpeak.com/storage//content/trails/US/WA/257/reg_006.jpg",
        "https://trailpeak.com/storage//content/trails/US/WA/257/reg_008.jpg",
        "https://trailpeak.com/storage//content/trails/US/WA/257/reg_011.jpg",
        "https://trailpeak.com/storage//content/trails/US/WA/257/reg_019.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mt-baker-skyline-divide-near-maple-falls-wa-257",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 4,
        "Time": "4 hrs",
        "Total Distance": "0 km",
        "Town": "Maple Falls, WA",
        "Type": "out-and-back"
    },
    "title": "Mt Baker - Skyline Divide",
    "trail_id": "257"
}