{
    "description": "The Spider Lake trail system is a series of interconnected mountain bike and ATV trails.  The GPS data provided includes tracks on three sides of Spider Lake.  The best route is to park at the given trailhead and take the Spider Lake Trail northwards.  This trail is wide and can be muddy depending on weather conditions.  Take a right onto the Skull Trail and follow that track to the northeast.  The Skull trail is a narrow, singletrack that weaves through open hardwood forests and goes up and down with the terrain.  This trail is 99% dry nearly year round and continues on past the given track as far as the Boggy Hole (see NS topo sheet 11 D/13) where the trail is hard to follow.  There was a trail continuing on to Lake Major and forming a large loop but it seems to be overgrown and not currently in use.  There are other ATV and bike trails in the area, some of which are given in the GPS tracks.  For a more detailed trail map see the following URL:  http://www.flickr.com/photo_zoom.gne?id=187286277&size=o",
    "directions": "Near Dartmouth take the Waverly Road (Route 318) and turn onto Spider Lake Road at the north end of Lake Charles.  Follow Spider Lake Road to its end (at N44 44.557 W63 32.781) where you will find parking for as many as five cars.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/2572/reg_DSC00152-30507.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/2572/reg_DSC00284-30507.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/2572/reg_DSC00293-30507.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/2572/topo_topo_SpiderLakeTrailMapjpg.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/spider-lake-trail-near-halifax-ns-2572",
    "stats": {
        "Activities": "mtn-bike ski-xc hike snowshoe",
        "From": "",
        "Seasons": "summer fall winter",
        "Stars": 3,
        "Time": "3 hrs",
        "Total Distance": "10 km",
        "Town": "Halifax, NS",
        "Type": "out-and-back"
    },
    "title": "Spider Lake Trail",
    "trail_id": "2572"
}