{
    "description": "Suggested time is 8-10 hours; elev. gain 1150m. Trail begins past dam on eastern end of Lightning Lakes. Make your way up the zigs zags to Frosty Creek at 7kms, great place for overnight camp. 2kms later the trail passes through some of the oldest larch forest in Canada, dated back to when Napolean was in great power; (awesome yellow colour in the fall). Through this sub alpine area you will walk through meadows of Lupin, Heather, Indian Paintbrush,Tiger Lillies and many more alpine flowers.\nApprox 11 kms you will reach the base of the mountain. Follow the trail up the east side of the bowl, an easy scramble will bring you to the ridge. Follow the ridge west towards the summit. Enjoy the view at 2408M and your lunch! From the highest peak in the park you will have a fabulous view of the North Cascades. ***BEWARE*** If this is going to be one of your first long day hikes, you may get caught up in the magical experience of what BC's alpine has to offer. You may become addicted to experiences such as this through repeated exposure of BC's alpine. Happy Trails!",
    "directions": "Travel to Manning Park Resort, follow signs to Lightning Lakes Day use area. Park vehicle in lot ($3 fee all day), trailhead is on east side of lake near small damn. There is a sign that marks the trailhead. Enjoy!",
    "geohash": "c2d",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/2576/reg_dannyfrosty2jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2576/long_frosty9jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2576/reg_Frosty2jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2576/reg_IMG-1978-53706.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mount-frosty-near-princeton-bc-2576",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 5,
        "Time": "8 hrs",
        "Total Distance": "27 km",
        "Town": "Princeton, BC",
        "Type": "out-and-back"
    },
    "title": "Mount Frosty",
    "trail_id": "2576"
}