{
    "description": "My Stay in Cape George, Nova Scotia was initially planned around a trail system built back in 2000. I past through this area a couple of years back while on a hikers' \"road trip.\" We stumbled upon the trails, and were able to grab a trail map, but didn't have time to set foot on them. I had been coveting the map for two summers now, and finally made my return on the Summer of 2006 with my mind set on ticking these off my to-do list.\nSometimes known as the \"Mini Cabot Trail\", the Cape George region is a tooth shaped landmass, jutting out on the North Western coast. On a clear day, at the top (600 Feet elevation), you can see Cape Breton to the North-East, and Prince Edward Island, 50K to the West. The rugged landscape is made more so by its isolation.\nThe trail system is an ambitious project spanning three sections, and networking 33Kms of mainly backcountry style footpaths. Another one of Peter Jackson's signature pieces, a look at the trailmap's topo lines tells you at least two things: First, what a great location for trails. Second, on the whole, this may not be easy, depending on how far you walk in one go. Underline ambitious!\nThere are three trailheads to enter from. All trail junctions are lettered both on the map as well as with trail signage. There is a bit of a local challenge to get all 14 letters scribbled onto a sheet of paper. Letters are etched on the signage. Accomplishing this feat gets your name in a logbook as hiking the entire system; incentive enough to motivate fitness for both the locals and come-from-away's. \nI planned to enter the trail system at the first point along the road. This would have been point G. Some how, we missed it, and found the first official trailhead at a historical school house property. Junction A, Trailhead 1. My plan was to hike back to point G, and go from there, end to end. To rouse my curiosity, there was an attraction in the direction I was going. The Bubbling Springs. \nI was very impressed with the trail from the get go. I wasn't sure what to expect, hearing that it was a community trail. The footpath had a back country feel right from the start. The routes were narrow with orange paint blazes on the trees to mark the way. Lots of tree cover nixed the need for sunscreen, and ocean breezes came through occasionally to cool you off.\nIt was early in the Summer, and some areas suffered from downed trees and dense Spring growth in the ground cover. The section F to G, after the Bubbling Springs, had at one point, suffered severely from blow-down. I got about a third of the way through the segment, but never got closure. I lost all signs of trail blazes, and I walked in a circle around the miss-connection, using my GPS for insurance. \"G\" remained elusive. How funny is that? I had no choice but to back track and make up for lost time.\nThe forest must have been growing ever since the trail's inception back in 2000. There weren't many opportunities for open vistas over the wide expanse, as indicated on the trailmap. No great matter, the views within the forest were pleasant enough with tree stands, gorges, several creeks, switchbacks and bridges.\nI had no problems finding the other junctions on my way. My plan was to traverse end to end while hitting the three trailheads along the way. I figure that given my rate of travel, I would finish the entire traverse by late afternoon. I was anticipating lunch at Ballantyne Cove wharf, an active fishing locale. It's a great spot for a bite and heat-quenching ice cream.\nI paused to rest in some shade and chow down on some food I packed. The heat was pretty intense, and bugs just buzzing. My feet were beginning to ache, so I decided to pause at the wharf, where the second trailhead is situated. There's a great little beach there too. Go soak your feet!\nHaving hiked around 2/3rds of the landmass of the trail, and looking at the growing blister on my heel, I figure it was time to take in that beach, and call it a day. 14K thus far. Energy left to finish, but not with a blister.\nIt was a shame, leaving some trail undone, but hey, now there's something sweet to come to back for. The Cape George section, or Trailhead 3 remains, which leads down to the lighthouse. Maybe I'll come back to finish next year.\nShannon Burt\nEast Coast editor",
    "directions": "Following the Sunrise Trail, along route 337, in Cape George. Look for any of the three well-marked trailhead signs.",
    "geohash": "f85u",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/2577/reg_bridgejpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/2577/reg_forestgrvjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/2577/reg_gpsmap.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/2577/reg_schoolhousejpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/2577/topo_capegeorgejpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/2577/narrow_C.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/2577/narrow_CapeGeorge-TrailMap-37129.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/2577/narrow_bendjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/2577/narrow_plantjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/2577/narrow_trailmarkersjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/2577/narrow_vistajpg.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/cape-george-trail-near-antigonish-ns-2577",
    "stats": {
        "Activities": "snowshoe hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 5,
        "Time": "7 hrs",
        "Total Distance": "33 km",
        "Town": "Antigonish, NS",
        "Type": "out-and-back"
    },
    "title": "Cape George Trail",
    "trail_id": "2577"
}