{
    "description": "NTS Map:92K3.  The highest peak on Quadra Island, Mt. Seymour (620 Meters) has awesome views of Vancouver Island, Nugedzi Lakes and the Coast Mtns.  If you only have time for one hike on Quadra, this is it.  From the actual peak the views are of the Coast Mtns and just before you get to the peak you will be able to see Vancouver Island.  This 8 kilometer linear trail is well marked and should take about 5 hours return.  On warm days you can even go for a swim in the lake.  Make sure to stop at the viewpoints along the way.  There is a bit of steepness to the trail but no scrambling is required.  If you can time it right you will be able to see cruise ships sailing by.\r\n\r\nFrom the parking area head up the trail.  Pass over a bridge, swing right and then left up a logging road.  In about 25 minutes you will make a right on an old logging road.  In 30 minutes you will head left upwards.  You will then come to an open area, look for the trail to the right.  In about 1 hour you will come to the lake.  Follow the sign here and head towards Mt. Seymour.  You should reach the summit in about 40 minutes.  Enjoy the views.  I preferred the views of Vancouver Island.\r",
    "directions": "Take the ferry from Campbell River to Quadra.  From the ferry head straight and get onto West Rd.  Follow this road onto Hyacinthebay Rd.  Keep an eye out on your left for Nugedzi Lake sign and make a left here.  If you start to head downhill and reach a quarry you have gone too far.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/2578/reg_bluffsjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2578/reg_mount1jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2578/reg_mount2jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2578/reg_mount3jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2578/reg_mount4jpg.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mt-seymour-near-campbell-river-bc-2578",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "5 hrs",
        "Total Distance": "8 km",
        "Town": "Campbell River, BC",
        "Type": "out-and-back"
    },
    "title": "Mt. Seymour",
    "trail_id": "2578"
}