{
    "description": "NTS Map:92K3.  Chinese Mtns (North Peak 305 meters and South Peak 327 meters) and Beech's Mtn (460 meters) on Quadra Island has many great views of Vancouver Island and the Coast Mtns due to the many open bluffs along the trail.  You can do this hike omitting the Beech's Mtn detour and the North Peak of Chinese Mtns but I would not suggest this since the hike is short and getting in as many view points as possible is a must.  Also, you get the chance to sit on top of three peaks!  This 5 kilometer hike is a loop and should take about 4 hours return.  The trail is very well marked with beautiful wooden signs showing the way and is well maintained. When in doubt stick to the well trodden path and avoid some of the smaller trails leading in different directions.\r\n\r\nFor those of you that prefer to hike down stepper terrain follow these directions.  From the parking area, take the left trail and begin your hike.  In less than 10 minutes you will come to a sign post pointing the way to Beech's Mtn, head in that direction.  30 minutes later you will come to another sign post, head straight here. In just over 30 minutes you will be on top of Beech's Mtn.  Now head back the way you came for about 30 minutes, until you get to the sign post pointing you to Chinese Mts.   Head up the trail to the South Peak.  Take in the views for a bit.  Now retrace your steps (for about one minute) and head back to the sign post pointing you to North Peak.  In about 30 minutes you will on top of the North Peak, from this peak you will get a nice view of Rebecca Spit on Quadra.  From here to the parking area it takes 40 minutes.  Hope you enjoyed the hike. \r",
    "directions": "Take the ferry from Campbell River to Quadra.  From the ferry head straight and get onto West Rd.  Follow this road onto Hyacinthebay Rd.  Keep an eye out on your left for a Chinese Mtns sign.  If you see the sign for Nugedzi Lake, you have gone too far (the sign for Chinese Mtns is very hard to see coming from the other direction so now pay better attention).  Road to the trail head is a bit rough, but in 5 minutes of slow driving your car will be there.",
    "geohash": null,
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/2579/reg_mapjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2579/reg_mount1jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2579/reg_mount2jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2579/reg_spitjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2579/reg_straightjpg.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/chinese-mtns-beechs-mt-near-campbell-river-bc-2579",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "4 hrs",
        "Total Distance": "5 km",
        "Town": "Campbell River, BC",
        "Type": "out-and-back"
    },
    "title": "Chinese Mtns (& Beech's Mt)",
    "trail_id": "2579"
}