{
    "description": "Antigonish Harbour with Shoreline Adventures, Cape GeorgePart of my itinerary for my visit to Cape George was a day of sea kayaking. Let's face it. You can't come to a place like this and say you've been here without exploring beyond land's edge. It's a coastal retreat after all. It's like going to PEI and neglecting a trip to the beach! I made a connection with Trudy from  Shoreline Adventures,  and planned a day's paddle with Joe Alkerton, one of their guides.I got a call from Joe the evening prior to our paddle to discuss our trip, and where I would be interested in going. As an outfitter, they offer simple rentals, as well as guided excursions. The later usually are offered on weekends, but if you have a group, they can accommodate you with enough notice. I was looking forward to spending as much of the day on the water as I could, since my feet and legs were spent from cycling here, and yesterday's hiking on the Cape George Trail. If you want to see variety, Joe recommends paddling the inland waters of Antigonish Harbour, near Mahoneys Beach. It's a somewhat protected saltwater mass rimmed by forest, gypsum cliffs, farms and some house development. Besides, it's right where their dock and large cache of sea kayaks and canoes are located. The choice was obvious.In their tour office, I signed the release forms and organized my gear into a small drybag I brought along. Joe and I made use of two glass touring rigs, to quicken our pace. In no time, Joe and I were into our boats, and I was testing out my new digs. It was really nice to have loan of a carbon fiber touring paddle. Its lack of weight would help extend the day's strokes with ease.Joe briefed me on his suggested route, and showed me the map he was using. Making sure we had our safety equipment, plenty of water and sunscreen, we were off. Not long after we set out, Joe pointed out one of the gems of the route, a huge eagle's nest high in a tree on the water's edge. He ensured me that we would enjoy many eagle sightings along the way. (and he was right!)We island hopped our way inland, passing both Captains Island and Black Island before skirting the Eastern shore, toward a small archipelago near Pomquet Cove. Along the coast you will find gypsum cliffs, well worth exploring. The winds were beginning to pick up and the waves were creating some small chop. We used both Sheep and Reef Islands to help buffet the winds. Inspite of the wind and waves, the kayaks surged through with confidence.To flesh out the day's tour, Joe wanted to point out a rail bridge that crossed over the water, just before Plaster Cove, so off we went. I asked him if he'd ever been around it when trains went by. Not very often, was his response, but a few minutes later, a freight train rushed by. I wondered if Joe had timed our being there with the train. Cool, never the less.In order to take advantage of the wind's direction, we headed around William's point destined for a lunch stop and then into Antigonish. The surfing in the swells was a fun reward for what we had done up to that point, and we located a shady little spot for a break from the paddle and to eat lunch. It was near 1 PM by this point.After repacking the boats, we headed West toward Antigonish for a 3K go into an ever narrowing water way. Apparently, it use to be a canal for a ship builder. Now, it's a lush growth area, on the outskirts of the town, with a community running trail skirting the edge in an area called The Landing.With the exception of a well deserved break above Williams Point (my ass was getting sore!) we B-lined it back to our launch point. We saw more eagles, and doubled past the location of the nest we saw earlier that morning. By the time we reached the dock, it was near 4PM, and I was ready to call it a day. We chatted back at the office, collected my things, and headed to a pub, post paddle in Antigonish.All told, we paddled around 30K. Joe was a great guide, skilled both in paddling, and in the arts of gab. The Antigonish Harbor area will certainly fill anyone's day trip. So, if Cape George is in your sites for a kayak destination, (and well it should be) you'll find choices both for sheltered and  open water.  excursions.",
    "directions": "Along the sunrise Trail, route 337 coming out from Antigonish, just pass Fairmount Ridge hiking trail head. Alternatively, you can launch inland, from Jimtown, near Mahoneys beach.",
    "geohash": "f85g",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/2581/reg_UntitledTrueColor01jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/2581/reg_eaglejpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/2581/reg_gettingreadyjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/2581/reg_hullshotjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/2581/reg_kayakCliffjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/2581/reg_meposingjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/2581/reg_rockfacejpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/2581/reg_trainbrdgjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/2581/reg_traincarsjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/2581/narrow_eaglesnestjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/2581/narrow_rockdetailjpg.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/antigonish-harbour-cape-george-kayaking-near-antigonish-ns-2581",
    "stats": {
        "Activities": "river-canoe sea-kayak",
        "From": "",
        "Seasons": "summer",
        "Stars": 4,
        "Time": "7 hrs",
        "Total Distance": "30 km",
        "Town": "Antigonish, NS",
        "Type": "out-and-back"
    },
    "title": "Antigonish Harbour, Cape George Kayaking",
    "trail_id": "2581"
}