{
    "description": "NTS Map:92K5.  This is an awesome hike up a less traveled peak called Mt. Hkusam (1672 Mtrs).  This route is not the same as the one that the endurance race uses for the Hkusam Klimb.  The route is about 9.4 kms, takes 6-7 hours and has an elevation gain of 950 meters.  The route is well marked with lots of flagging, cairns and it is a well maintained trail.  The route is steep in parts and depending on the time period an ice axe and crampons may be needed.  At the top of the mountain you get awesome views of the Sayward Valley, Vancouver Island Mountains and the Mainland Coast Mountains.  Also the hike up through the watershed is beautiful with lots of nice old growth trees.\r\n\r\nFollow the trail over the locked gate and stay on the trail labeled Stowe Creek Trail.  In about 5 minutes you will come across a small bridge over a stream, be careful in this area as the local bear seems to hang out in this area.  Follow the old logging road up and around.  You will cross many smaller streams, just hop from rock to rock.  After 1 hour the trail will head to the left towards Mt. Hkusam and you will see a sign for Stowe Trail.  Just after you will see some blue ribbon on the right, head this way into the woods.  Go over the log bridge and follow the creek on the right.  In about an hour you will see a sign for Hkusam and Bill's lake trail.  Head up to the right of the big fallen log and look for flagging on your left.  In about 20 minutes you will come to a waterfall, either head up on the right side of the waterfall and cross at the appropriate time or about 10 feet from the waterfall you will see a bit of a trail going up, take either.  Once you cross the waterfall you will heading up a steep gully.  Go all the way up.  When you get to the top keep heading straight and look for flagging.  In about 15 minutes you should come out to the big snow bowl.  There are two ways up from here.  On your left you will notice a gully, head up this way and save about 30 minutes.  If that looks to scary for you, head to the right you will notice a step scree slope.  Head up this way and be careful not to knock any loose rocks down, the ascent should take you about 30 minutes.  Now make a left and look for the flagging and rock cairns that will take you around the rock.  Some areas are steep so watch your footing.  Once you get around the rock you will see a wide open area, head up this area to the summit.  For those you that took the shorter route, head left and up to the summit.  Make sure to write your names in the summit registry.  Enjoy!\r",
    "directions": "To get to Mt. Hkusam.  Follow the inland highway north to Sayward.  About 62 kms from Campbell River (as a warning that you are getting close you will see a sign for Dalrymple Creek Trail on your right 5-10 minutes before the turn off) make a right on to Stowe Main, head through the timber yard and make a left on to Timber road.  Follow this road for the next 8.4 kms.  You will come to two points on the road where you can make a left, ignore these; the second one has a little covered hut, if you see this you know you are going in the right direction.  From the little hut onwards you are actually driving on the Hkusam Klimb endurance run route, some parts are quite overgrown so be prepared for lots of branches on the vehicle.  This road is 8.4 kms long and should take about 40 minutes.  There are 98 cross ditches, none are too deep and you cross about 5 streams.  4 wd is not needed but decent ground clearance is; as usual take the cross ditches slowly and you should have no problems.",
    "geohash": "c0yw2",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/2584/reg_HkusamAug5015jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2584/reg_HkusamAug5025jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2584/reg_IMG_2358_Medium_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2584/reg_IMG_2375_Medium_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2584/reg_IMG_2397_Medium_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2584/reg_IMG_2401_Medium_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2584/reg_IMG_2403_Medium_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2584/reg_IMG_2421_Medium_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2584/reg_IMG_2422_Medium_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2584/reg_IMG_2423_Medium_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2584/reg_IMG_2426_Medium_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2584/reg_IMG_2443_Medium_.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/hkusam-mt-near-campbell-river-bc-2584",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 5,
        "Time": "6 hrs",
        "Total Distance": "10 km",
        "Town": "Campbell River, BC",
        "Type": "out-and-back"
    },
    "title": "Hkusam Mt.",
    "trail_id": "2584"
}