{
    "description": "I'd heard of the great scrambling to be had on this mountain but had always been scared off by the approach. You see, I'm just lazy and have a short attention span so pushing a mountain bike up 3000 vertical feet along about 13km of logging road which ranges from extremely well graded to not much more than a narrow trail through slide alder has never been my idea of a good time. I was won over however by the promise of sensational scrambling and a good time with 13 of my closest friends. \r\rThe approach with the bikes was indeed as hateful as I expected but we made good time and were very happy to leave them behind after about 2.5 hours of grunt work. We had a few views along the way that helped to keep me moving in a forward direction.\r\rAfter a bite to eat and stashing the bikes, we began the short hike up through a scraggly forested section to the West Ridge.\r\rAnd then the fun began! This ridge goes on forever and lived up to my greatest expectations. The rock is so sticky I don't think you could fall off it if you tried but bring gloves because it will shred your hands. Apparently it is made up of Dunite which is interesting (to me anyway... i like rocks) because of it's ultramafic composition and unusual origins. If you don't care about rocks... all you need to know is that it is AWESOME for climbing on! \r\rThe exposure is minimal (I should preface this by saying that I seem to have a high tolerance for exposure) so I was absolutely giddy as I found that I could choose more challenging lines without fear of certain death or holds coming off in my hands. The official route is class 3/4 but you can easily up the ante a bit. A few people in our group were more comfortable using the rope in a few sections but generally it's just a scramble. \r\rThere's a beautiful pinnacle of rock about 2/3 of the way along the ridge. It's a great place for a photo if you don't have a fear of heights. Even without a fear of heights I was shaking like a leaf every time I tried to look away from my feet.\r\rThe summit is a jagged, uncomfortable place to sit and there was definitely nowhere to do my signature summit  cartwheel. There was a thunderstorm moving in quickly so after snapping a few pics we were on our way down the North Face.\r\rThe North Face is steep! It was snow covered when we were there but I was having a bit of trouble gathering up the courage to just plunk my ass down and go for it. Fortunately this problem was solved when I slipped. Rather than self arresting I decided to just go with it and see what happens and BOY am I glad I did. That was SO much fun! Unfortunately we were glissading into a white out so we had to cut our fun short and get on with some serious route finding. \r\rWe managed to find our way back to the bikes without incident. Descending 3000ft on a mountain bike is about as much fun as you can have with your pants on. I tried to block out the images of what would happen if I fell and was mostly successful. One of the guys on the trip clocked himself doing 70km/hr according to his GPS. When I described this part of the trip to my son he started laughing at me and said \"Mom you just sounded like you're 16 years old.\" I plead guilty to giggling like a little girl most of the way down and deliberately riding through the puddles :)\r",
    "directions": "This trip is located on the western edge of the Mount Baker Wilderness area off Hwy 542/ \rSee Matt Gunn's \"Scrambles in SouthWestern BC\" for detailed directions & great route beta.",
    "geohash": "c29j",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/WA/2587/reg_miniP1010005JPG.jpg",
        "https://trailpeak.com/storage//content/trails/US/WA/2587/reg_miniP1010053JPG.jpg",
        "https://trailpeak.com/storage//content/trails/US/WA/2587/narrow_miniP1010025JPG.jpg",
        "https://trailpeak.com/storage//content/trails/US/WA/2587/narrow_miniP1010033JPG.jpg",
        "https://trailpeak.com/storage//content/trails/US/WA/2587/narrow_miniP1010035JPG.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/north-twin-sister-near-us-city-2587",
    "stats": {
        "Activities": "mtn-bike hike climb",
        "From": "",
        "Seasons": "summer",
        "Stars": 4,
        "Time": "7 hrs",
        "Total Distance": "0 km",
        "Town": "US City",
        "Type": "out-and-back"
    },
    "title": "North Twin Sister",
    "trail_id": "2587"
}