{
    "description": "NTS Map: 082J10Well...  a couple years later and it still sucks.  We just rode it (for 7 freakin' hours!!) including several very fit and technically astute riders and it was unrideable.  Between the mires and the bogs, both full of cow hoof prints and crap, this was a trail that I will NOT ever consider doing again unless it is with in-laws I don't want to see again.  The first 1/3 and the last 25% are the bogs with teeth jarring hoof prints through them.  This makes for very technical riding and many spills.  I'm still limping from a crash in the first 3km.28.5km, 600m cumulative climbing for the big loop.  3 litres of water at a MINIMUM we all ran out 3-5km from the end on a hot day.The only redeeming feature of this trail is the view over the Coal Creek Canyon about 9.5km in.  1/2 our posse turned around there.{Original post of first 6km}Hmmm, I never met a ride I didn't like but this one came close, though only because the trail is primarily equestrian in use and it makes for a bumpy ride.  Anyone that whines about MTBs and soil erosion had better not own a horse.  But we all have to get along and just think of this as ramping up the technicality of the trail a notch or two.  I wanted cardio & some tough singletrack and I got it (but I hate pushing and there were a few spots I had to push through the mire).{The BOOK says something along the line of...}The trail is a nice ride and can be combined with Phone Line Trail, Mount McNabb Trail, and Price Camp Trail to make a 27km loop.  This loop is written up in Eastcott's \"Backcountry Biking in the Canadian Rockies\" book.  Only about 250-300m of elevation climb, in this loop so that makes it easier than some.  The 28km length makes it a litttle tougher. {WRONG WRONG WRONG } (or we got the directions pretty bass-ackward)(NOTE: Phone Line Trail is not the Telephone Trail near Bragg Creek that is written up twice on trailpeak, but another one named for the same reason, that being it was the route of a telephone cable between ranger stations.It has the usual cobble, mud, stream crossings, meadows, views, and all the other components we expect in a K-Co ride.  Pleasant, do-able by most people, nice length.  We stopped short of our intended ride and the attached tracklog only shows the first 5km/170m elevation of the trail.  This trail continues a total of 11km with a further gain of 100m elevation to the high point and further on from there if desired.  The Sheep can be tough to ford during spring runoff so this likely makes a better midsummer/fall ride.",
    "directions": "West from Turner Valley onto hiway 546 and drive 21km to the Sandy McNabb area.  Follow the road down towards the river bank and optionally on to the parking lot.  The trailhead is crossing the river about 250m back up the Sheep River from the parking lot.  There is a trail down from the road to watch for.  If you cross the river at the Map, look slightly to the left for a trail heading off to the left.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/2590/long_WolfProfile-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2590/reg_IMG-3731-[800x600]-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2590/reg_IMG-3733-[800x600]-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2590/reg_IMG-3735-[800x600]-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2590/reg_IMG-3738-[800x600]-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2590/reg_IMG-3747-[800x600]-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2590/reg_IMG-3755-[800x600]-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2590/reg_IMG-3761-[800x600]-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2590/reg_IMG-3778-[800x600]-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2590/reg_IMG-3781-[800x600]-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2590/reg_IMG-3791-[800x600]-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2590/reg_muckjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2590/reg_onejpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2590/reg_threejpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2590/reg_twojpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2590/topo_planJPG.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/wolf-creek-coal-creek-phone-line-price-camp-loop-near-kananaskis-ab-2590",
    "stats": {
        "Activities": "hike ski-xc mtn-bike",
        "From": "",
        "Seasons": "winter fall summer",
        "Stars": 3,
        "Time": "7 hrs",
        "Total Distance": "29 km",
        "Town": "Kananaskis, AB",
        "Type": "out-and-back"
    },
    "title": "Wolf Creek - Coal Creek - Phone line - Price Camp Loop",
    "trail_id": "2590"
}