{
    "description": "NTS Map: 082G01\nElevation Gain - 1100 m (3,609 ft).\nThis trail is an extension of the Rowe Meadow trail in Waterton National Park. It is 18km & 7-8 hours return. (Lineham Ridge described below by Brian Coffey can be found at Lineham Ridge\nAfter leaving Rowe Meadow (5km from trailhead), start across the creek on a trail for both the Upper Rowe Lakes and for Lineham Ridge. Turn right at the junction (signed) and begin a short (10-15 minutes) moderately steep climb through the trees. Once above the treeline, the trail follows a long sweeping arc across the headwall of Rowe Valley. Near the top of the ridge, a series of switchbacks eases the ascent as it steepens.\nAt the ridge you are rewarded with great views of the Rowe Valley, the Upper Rowe Lakes and down the other side to the Lineham Lakes.\nThere is a metal ground stake with the trail going west or east. If you go west (left), then you will head up Lineham Ridge. \nIf you go (east) right, you will get a breathtaking view of the lower portion of the Ridge, then you can continue east along the ridge up to Mount Lineham. There is a lot of loose rocks (shale) on this steep ascent to the top, so be careful of your footing, as it's a long way down! It's easily to be distracted by the awesome beauty surrounding you. At the top of the mountain, you can see Mt Blakiston across the valley, and Mt Hawkins to the left of Mt Blakiston. Looking above Rowe Lakes you can see Cameron Lake. There is a rock cairn at the top which contains a cansiter with a log book as this is one of the 100 peaks celebrating Alberta's Centennial. \nReturn the way you came.\nPhotos by Al Perreault \nCurrent conditions:",
    "directions": "Trailhead is the Rowe Lakes/Tamarack trailhead on Akamina Parkway (Cameron Lake Rd) in Waterton Lakes National Park.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/2594/reg_Joe-&-Marmot-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2594/reg_July1208-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2594/reg_best1_July120-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2594/reg_lineham01sjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2594/reg_lineham03sjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2594/reg_linehambaldeaglesjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2594/reg_marmottsjpg.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mount-lineham-near-waterton-park-gate-ab-2594",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "7 hrs",
        "Total Distance": "18 km",
        "Town": "Waterton Park Gate, AB",
        "Type": "out-and-back"
    },
    "title": "Mount Lineham",
    "trail_id": "2594"
}