{
    "description": "NTS Map: 082N09The trip distance is return to Helen Lake. Dolomite pass is an additional 3km (18 total) away.The trail starts out meandering through a shady, rooted forest, then cuts up the side of an open slope where you gain most of your 455m.As the trail rounds the hillside, you are popped into a low, wide meadow with lovely views. From here the hike is awesome. You leave the last of the trees behind as you tuck gently up the valley, then cross a lively stream to some tarns, and soon, Helen lake (6km). The ground here can be mucky, and people have widened the trail to over 2 meters! in some spots to avoid the slop - don't be another wayward footprint.Just beyond the lake, a short and sweet 100m ascent takes you to the roof of the valley. Brilliant! Perfect spot for a snack - 360' views and not a stain of civilization in sight.The route to Dolomite pass is easy to figure out - you descend into the valley beyond, toward Katherine Lake in the near distance. The terrain is a colourful moonscape. 3km along and you will see the rocky pinnacles of Dolomite Pass.Easy access, short trip to alpine, and stunning views the entire way. Camping is allowed beyond the pass above Helen Lake - the bowls and peaks of this area are a scramblers dream - basic routefinding skills are all you need! In winter please check the local avalanche conditions and bulletins.",
    "directions": "Take Icefields parkway 33km north of the Lake Louise junction. Watch for signs for the crowfoot glacier viewpoint, trailhead parking is across the highway (on your right if heading north). I recommended Waterfowl Lakes campground for the night, and get an early start in the morning - trail can get busy (but on this one, I really didn't mind sharing).",
    "geohash": "c3j",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/2602/long_IMG-0146-29904.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2602/long_IMG-0151-29904.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2602/reg_DSCN4149R5-56032_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2602/reg_DSCN4179R5-56032.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2602/reg_helenlakeripplesjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2602/reg_helenlkfromridgejpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2602/reg_helenpassjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2602/reg_marmotscreamingjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2602/narrow_DSC-0840-33987.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/helen-lake-dolomite-pass-near-banff-ab-2602",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 5,
        "Time": "4 hrs",
        "Total Distance": "12 km",
        "Town": "Banff, AB",
        "Type": "out-and-back"
    },
    "title": "Helen Lake/ Dolomite Pass",
    "trail_id": "2602"
}