{
    "description": "Having been unsatisfied with the Chief's challenge, coming back down we saw the trail to Upper Shannon Falls, thought we'd give it a go. This trail meanders up and down over a few ridges, before it starts to climb steadily. It does reach Upper Shannon Falls and a nice little pool and rock area for lunch. My advice, eat lunch here, and go back. We didn't however. We pushed on aided by the signs of \"Logging Road Route - and Ultimately Petgill Lake\". After another 45 min. of up, you do reach and nice viewpoint, but if you haven't turned back yet, do so now. Because, if you keep going, the trail gets very thin and it looked as though we may have been the first people of the year. There are still signs (you gotta look) for Petgill lake, and the trail is still sort of marked, but it did seem a lot like bushwacking. No human tracks in sight. After reading the Petgill Lake description on this site, I would say if you want a full-day hike, that's a challenge, go via the Chief trailhead up about 200m and take the right fork to Upper Shannon Falls. Maybe the 2 car method would work best for this one, as you'd come out way down the road if you complete the loop to Petgill and a down. So anyhow, the Chief 2nd/3rd peak loop plus, Upper Shannon Falls Viewpoint and back takes around 7.5 hours. Add another hour to get to Petgill Lake, if you are braver than we and follow the grown-in logging road path with more bear evidence than human.",
    "directions": "Start the Chief trail with the tourists. The Upper Shannon Falls trail is on the map at the bottom, but seemingly leads to no where. I guess the connection exists to Petgill Lake, but it's an adventursome one. Take the 2nd fork to the right, about 200m up, to Upper Shannon Falls and keep going. You should hit Petgill lake in about 4-6 hours. Very nice trail, and no one around. The alternative is the Upper Shannon viewpoint, and is about equal to the Chief 2nd peak in elevation.",
    "geohash": "c2b6t",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/2607/reg_IMG-0727b-4608.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2607/reg_IMG-3346-21791.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2607/reg_SFCacheviewNo0009jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2607/reg_UpperShannonFallsPeakjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2607/narrow_IMG-3343-21791.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/upper-shannon-falls-viewpoint-near-squamish-bc-2607",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 4,
        "Time": "5 hrs",
        "Total Distance": "0 km",
        "Town": "Squamish, BC",
        "Type": "out-and-back"
    },
    "title": "Upper Shannon Falls Viewpoint",
    "trail_id": "2607"
}