{
    "description": "NTS Map: 82O03Elevation Gain: 1200mMount Lady MacDonald is one of those hikes / scrambles that get you addicted to hiking.  I've climbed the mountain twice now, and all the hard work of getting to the summit is worth it when you see the amazing views from up there.Be prepared for a fairly long day, however I've seen people in great shape run up and down the mountain in a matter of 3hrs or so.  The average hiker would take about 6-7hrs to complete this hike allowing for some rest stops at the helicopter landing pad, and then at the summit.  Take lots of water as there is quite a bit of exposure and the sun can really heat you up.  The elevation gain to the summit is 1200m.It would be good to check the Kananaskis trail reports for any bear closures as this is a wildlife corridor and there are some permanent closures in the area, and often there are temporary closures.  In the fall of 2005 a lady was killed by a grizzly on the Benchlands trails.  Don't let this deter you, but be smart, and go with some friends!  The trails are very popular and well used by hikers and mountain bikers.From the Cougar Creek parking area, stay on the West side of the creek and follow the wide trail up into the Benchlands trail system. Soon you'll leave the Benchlands trails behind as you switchback your way up the mountain.  It would be good to get a map to help find your way among the many trails at the foot of the mountain.Once you leave the Benchlands behind, you'll be switchbacking through steep terrain in forest, then through a few meadows where on both times I've climbed the mountain I've seen bighorn sheep grazing.  After a long hike taking gradual switchbacks and then following a ridge up to the col just above the treeline.Just above the treeline you'll find a large helicopter landing pad, a steel ramp for paragliders, and the remains of a teahouse that was being constructed but is now abandoned.  A gazebo just to the east of the teahouse sits on the edge of a large cliff.  The views from here are spectacular.  A number of hikers end their hike here as it's already been a hard push to get this far, and the scree slope above can be daunting for non-scramblers.Once taking two steps forward and sliding half a step back to the top, you'll be treated to an amazing knife edge summit.  The views across the valley toward the three sisters are great, and you can barely see over Chinaman's peak into the spray lakes valley.  More adventurous scramblers will walk the summit ridge, but be warned it's basically a shear drop on one side and a very steep incline on the other.  All in all, a breathtaking day, as long as the weather holds out!",
    "directions": "On the TransCanada highway heading West, take the off-ramp in Canmore north towards the Silvertip resort on Palliser Trail.  Follow Palliser Trail road up to the junction and take left to Benchlands Trail road. Just before the bridge on the left along Elk Run Boulevard, you'll reach the Parking by Cougar Creek. Try to get in early as the parking lot fills up with many people using the various trails in the area. Alternate parking could be on the side streets or nearby business area on Benchlands Trail. The June 2013 flood destroyed the Cougar Creek trail leading to the Lady Mac trailhead, so need to walk on a bed of rocks along the left side passing by houses heading north and just around the bend, head towards the forest where a pink strip tied to a tree leads you to a trail. For first-timers, follow a trail close to the edge until you see a marked Trailhead sign where Lady Mac trail is to your left. Note that there are other trails deep in the forest (bike and Montaine Traverse) before the Lady Mac trailhead.",
    "geohash": "c3jf",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/2611/reg_20130615-163526-44703_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2611/reg_20130615-170022-44703.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2611/reg_Canmore-from-top-of-LadyMac942-45951.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2611/reg_Lady-Macdonald-RIDGE-Canmore-Sept-13-4--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2611/reg_Lady-Macdonald-RIDGE-Canmore-Sept-13-7--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2611/reg_Mount-Lady-McDonald-031-51489.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2611/reg_Mount-Lady-McDonald-056-51489.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2611/reg_Mount-Lady-McDonald-062-51489.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2611/reg_lady1jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2611/reg_lady3jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2611/reg_map.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2611/reg_me-on-LadyMac2952-45951.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2611/reg_top-of-lady-mac-looking-south2950-45951.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2611/reglady2jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2611/narrow_20130615-154953-44703.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2611/narrow_Lady-Macdonald-RIDGE-Canmore-Sept-13-14--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2611/narrow_Lady-Macdonald-RIDGE-Canmore-True-Summit-Sept-13-8--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2611/narrow_Mount-Lady-McDonald-046-51489.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2611/narrow_lady5jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2611/narrow_lady6jpg.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mount-lady-macdonald-near-canmore-ab-2611",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 5,
        "Time": "7 hrs",
        "Total Distance": "6 km",
        "Town": "Canmore, AB",
        "Type": "out-and-back"
    },
    "title": "Mount Lady MacDonald",
    "trail_id": "2611"
}