{
    "description": "NTS Map:92F7.  This hike will take you up to Mt. Curran (1478 Mtrs) and The Squarehead (1400 Mtrs).  It will take you about 6-7 hours to do and is approximately 10 kms.  The nice thing with this hike is that it is a loop if you choose to go to The Squarehead.  From either peak you will see beautiful peaks in Strathcona, across the straight to the Coast Mountains and the southern island mountains.  The trail is well marked (not between Mt. Curran and The Squarehead), well maintained and easy to follow.  A good portion of the trail is on bluffs which give you nice views and some nice rock scrambling.  In the winter this makes an excellent snow shoe hike.  The pictures are a mixture of summer and winter.\r\n\r\nFrom the trail head, head up the trail to a cross roads sign pointing either to Mt. Joan or Mt. Curran.  Follow the trail for Mt. Curran.  You will steadily head up on an overgrown logging road, in about 30 minutes look for a rock cairn and head leftish.  In another 30 minutes in an old burn area look for flagging and make a right.  Then in a little while head out across the burn keeping your eyes open for flagging.   Just keep heading up if you can't find any flagging.  Once up on the bluffs, lock for rock cairns and flagging and keep heading up.  In about 30 minutes you will see a small gully (ditch) heading up, look for flagging, and head up this way.  You will now be in low brush vegetation, keep looking for flagging, you can't get lost here because it is sort of a ridge so just keep following the lay of the land and heading upwards.  In about 30 minutes you will see the summit rock cairn for Mt. Curran, sign your name in the registry and have a snack as you enjoy the view.  Now head back the way you came, until you get to the two large tarns, you will see a rock cairn with a broken stick in it.  From here, survey the land bellow you looking for meadows, try and remember these.  Head about 150 feet back toward Mt. Curran, avoiding the flagging below the rock cairn, and then make a left towards The Squarehead.  For the next hour you will be following flagging, bushwacking and making your own trail.  As you head down the ridge, try and stay on the open rock by slowly making your way down to the right.  Once you are down you want to stay to the left. It's tempting to head right, nice views but will make your journey longer.  The reason being is that this will avoid gaining and losing elevation, and lots of bushwacking.  Whenever you see flagging follow it, other wise just keep heading to The Squarehead.  The final and exciting part in getting to The Squarehead involves a bit of scrambling up a rock wall.  In winter an ice axe is very useful here.  Once up the rock wall, you will see a cairn for The Squarehead summit.  From the summit head towards Mt. Joan (it is the only way to head), in about 10 minutes you will be going down a rock face, look on the left for blue flagging.  The whole decent keep looking for flagging and stay to the left.  Once you are in the saddle, you will see flagging on your left taking you home.  As you start heading down look towards your left for more flagging, it will take you down a steep gully.  Follow the flagging and keep to the left of the creek (if you cross the creek, just stay close to it).  Once you get into the flat area with a large pond, cross the small creek at its smallest width, polls are nice for jumping over this area.  Then head right, look for flagging and follow the well maintained trail.  This part is of trail will take you to an overgrown logging road.  Follow the old logging road all the way back to your vehicle.",
    "directions": "Head either North or South on inland highway and make a left or right at the Cook creek turn off, it is either the first or second set of lights.  Follow this logging road.  In a little while you will come to a Y in the road (Chef creek sign), take the right branch.  Avoid all roads branching off, you want to stay on the main logging road.  In 15.1 kilometers you will come to a bridge that has a sign saying \"load limit 70 tonnes\", make a right here and proceed to a small parking area.  This part of the trip should have taken you about 25 minutes.  I would say if you don't mind a little roughness on your car it will make it to this point, but no further, park your car and walk the next 4 kms.  The road from here gets rougher with many cross ditches.  If you have a 2wd vehicle with decent ground clearance I would go further there is a small area to park 3 kms away.  The last 1 kms is for 4wd, short wheel based and high clearance is best.  The whole trip is a total of 45 minutes (19.1 kms), with the last 1 kms being the worst.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/2614/reg_IMG_1400_Medium_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2614/reg_IMG_1402_Medium_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2614/reg_IMG_1404_Medium_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2614/reg_IMG_1421_Medium_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2614/reg_IMG_1425_Medium_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2614/reg_IMG_2487_Medium_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2614/reg_IMG_2500_Medium_a.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2614/DSCF7839.JPG"
    ],
    "source_url": "https://trailpeak.com/trails/mt-curran-the-squarehead-loop-near-courtenay-bc-2614",
    "stats": {
        "Activities": "snowshoe hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "6 hrs",
        "Total Distance": "10 km",
        "Town": "Courtenay, BC",
        "Type": "out-and-back"
    },
    "title": "Mt Curran (The Squarehead loop)",
    "trail_id": "2614"
}