{
    "description": "I've paddled this area before, but never quite reached the small islands that are scattered in the Harbor. It's been a favorite to many local paddlers, so I came to get it off my \"To-do\" list, but I'm sure to return.\r\n\r\nMy first stop was to drop into the Murray River Gov. wharf. This was my intended launch site, but when I looked at the shellfish area lease map, I saw that I had a bit of a paddle from here just to reach the islands. Looking further at the map, I noticed some roads that would have me let in much closer. Off I drove in search of my more convenient let in.\r\n\r\nAs I passed into Point Pleasant, I saw a short little road to my right that had a small wharf at lane's end. This was just past a girl guides camp road, and next to a bed and breakfast. It wasn't the cleanest launch site, but it was good enough as I thought back to that lease map.\r\n\r\nI launched in what turned out to be a nice sheltered water where the South River becomes Big Basin. There was a pretty gusty tailwind, so I  knew I was going to have a fight on my paddle on my return. On I went. I was surprised to see a nicer (and closer) wharf just behind Clow's Point, so I noted it for future reference and paddled on. Maintaining a generally South-East heading, the islands began to appear. I didn't have a map, so I was truly exploring the islands. I did recall from the wharf map that there were four or five islands in a bit of a chain. With the first set of Islands, came some wildlife. An occasional seal was curiously watching me from a safe distance. Given the chop of the water, I was surprised to have noticed him. I would see many more later on.\r\n\r\nI came upon Reynolds and Thomas Islands first and looked for a way to paddle between them. I found that they were joined by a low grassy ithsmus, and wondered if this was low tide. I continued on the same heading to the next island attempt to cut between. This was Gordon's Island. It was a good choice to cut in here because looking at the map afterward, my path pretty much kept to deep water. After Gordon's Island, the water appears to be pretty shallow, though the silt probably moves around quite regularly. Still, you can see Poverty Beach's sand bars a Kilometer off.\r\n\r\nI successfully rounded between Thomas and Gordon's Island, using the land to protect me from the strong winds, and came upon Cherry Island. I made my way between it and Herring Isl. when I noticed a collection of obese shapes on the shore of the back side of Reynold's Isl. Beached seals! Not only did I see seals, but a tour boat was rounding the island from the opposite side, eyeing the same spectacle. We both watched as they seals awkwardly flopped themselves into the water, where they quickly spread out to look at us. Some came very close to my kayak. I held my position, with camera in hand, looking for a good shot. One came within 10 feet before I noticed him, but I didn't get the shot. \r\n\r\nAfter waving to the tourists and exchanging hellos, I thought it time to head for home. Looking at the track on my GPS told me my current course would intersect back at Big Basin, so what I was seeing was the right way home. I don't always look over my shoulder when I head out. (not smart!)\r\n\r\nHeading near French Marsh Pt. fully exposed me to the winds again, so I put my head down and paddled steadily. Rounding Clow's point, I checked out the fishing wharf I had seen earlier, and marked a waypoint before headed back.\r\n\r\nI noted a small road bridge that might make an interesting inland exploration into what is appropriately called Little Basin. I headed back into South River to the little wharf where I launched.\r\n\r\nMurray Islands is a great afternoon's paddle on a calmer day. The forest covered islands do serve some visual interest with some small sandstone cliffs, typical of PEI coastline. At one location a stand of dead trees serves as a nesting ground for cormerants. Hey don't forget the seals! The place is just silly with them. There are a few grassy areas to land for a snack or a break to stretch the legs. This paddle spot is one \"must-do\" if you ever come to PEI for some sea kayaking.\r\n\r\nShannon Burt\r\nEast coast editor",
    "directions": "Head to Murray River along Route 4, and before you arrive in Murray River Proper, turn left and head along the water on what is called Point Pleasant Road. (Route 17) Turn at Point Pleasant, and look for a wharf along your right, just past the Girl Guide Camp road.\r",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/PE/2616/long_frenchmrch_pt.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/2616/long_gordons_isl.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/2616/reg_best1_cherryisl.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/2616/reg_bigbasin.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/2616/reg_nests_cherry_isl.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/2616/reg_seals.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/2616/topo_murraymap.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/murray-islands-murray-harbour-pei-near-cardigan-pe-2616",
    "stats": {
        "Activities": "river-canoe sea-kayak",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "11 km",
        "Town": "Cardigan, PE",
        "Type": "out-and-back"
    },
    "title": "Murray Islands, Murray Harbour, PEI",
    "trail_id": "2616"
}