{
    "description": "NTS Map: 082J11The trail to Black Prince lake is a continuation of the Black Prince Cirque Interpretive trail.It's a 5.5 km with 600 meters of elevation gain, but 450 of that comes in the last 2 km and even then 500 meters of that 2 is relatively flat.There can be beautiful flowers in the meadows depending on season. (Early August was colourful).The late after view of the cascades in the sun was great. There are great view of the Smith Dorien Valley from the top but the Black Prince lakes themselves aren't that scenic.",
    "directions": "Follow the Directions for Black Prince Cirque trail until you get to what used to be Warspite Lake. (there is no water in Warspite Lake now it's a puddle at best). For interpretive trail markers 9 or 10 step of the trail and go counterclockwise around what used to be the lake. Before reaching the inlet you'll find a good trail heading south to grassy slopes. Aim for a prominent black slit at the bottom of a cliff.A marked trail crosses rocks and heads up by the cascades. After reaching the grassy cirque another trail heads left and up another 150 meters to terminal moraine where you can look down on the inky black Black Prince Lakes.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/2622/reg_blackprincemap.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2622/reg_blprlake_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2622/reg_elevation.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2622/topo_cirque.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2622/narrow_cascades.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/black-prince-lakes-peter-lougheed-provincial-park-near-kananaskis-ab-2622",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 3,
        "Time": "6 hrs",
        "Total Distance": "11 km",
        "Town": "Kananaskis, AB",
        "Type": "out-and-back"
    },
    "title": "Black Prince Lakes - Peter Lougheed Provincial Park",
    "trail_id": "2622"
}