{
    "description": "A relatively easy (but uphill) climb for the first half or so, then a steep climb (wouldn't recommend in the rain or if there is snow) on a well-marked trail (with green paint on the rocks on the steep section).  Very steep sections, wouldn't want to fall or be afraid of heights.  Not technically challenging (hikers should be OK, but you want to be sure-footed. 1500 vertical feet gain from parking area.Back down the way you came until about 1/2 way, then you can loop around back to the parking lot via a different trail than the one you came in on (Blueberry trail is a one-way loop). Parking is a $5 fee, bring exact amount to leave in the envelope.  Great views of Anchorage city, airport, Turnagain Arm, Cook Inlet and up the valleys of Chugach State Park.  Not deep into the wilderness, but you're definitely not in the city! Note the track log also includes a long walk down the start of the \"Powerline Trail\".  That's the long, straight section and is an optional part of the hike.",
    "directions": "Access is from the Chugach State Park parking area off of Glen Alps road in SE Anchorage.",
    "geohash": "bdve",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/AK/2625/reg_nearbypeaks.jpg",
        "https://trailpeak.com/storage//content/trails/US/AK/2625/reg_topofflatop.jpg",
        "https://trailpeak.com/storage//content/trails/US/AK/2625/reg_viewofTurnagainArm.jpg",
        "https://trailpeak.com/storage//content/trails/US/AK/2625/topo_uppertrail.jpg",
        "https://trailpeak.com/storage//content/trails/US/AK/2625/narrow_anchorage.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/flattop-mountain-near-anchorage-ak-2625",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "5 km",
        "Town": "Anchorage, AK",
        "Type": "out-and-back"
    },
    "title": "Flattop Mountain",
    "trail_id": "2625"
}