{
    "description": "A \"Land of lakes,\" PEI isn't, but O'Keefe Lake is one of a few you'll find here in PEI. I have driven past this small body of water a few times, and took this opportunity to let in and paddle its perimeter. It was quite a windy day, so I was seeking sheltered waters.\r\n\r\nBordered by a few cottages and farmlands, I never knew the lake had provincial park status until I looked at the topo map. I don't recall seeing any signage, so perhaps it was designated as such in the past.\r\n\r\nThere is a public launch site right on the main road, and using that keeps you away from the cottager's private land access road. I put in and started the parimeter of the lake.\r\n\r\nIt was grassy near the water's edge, but with quite deep water around the middle, there is no grass to touble you. I am definately marking this site as a great \"jellyfish-free\" place to practice various in- and out-of-boat exercises, or simply a great place to relax and enjoy the suroundings with a canoe or kayak.\r\n\r\nI noticed not one but three eagles in the area, plus various other birds like blue jays and Harons more common to the area.\r\n\r\nShannon\r\nEast Coast editor\r\n\r\n\r",
    "directions": "\r\nFrom Ch'town, take TCH route 1, toward Wood Islands ferry, and turn left at Route 5. Follow it as it zigs and zags until you reach the Avondale junction. After the intersection, look for the boat launch on the left, only a few munutes from there.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/PE/2626/reg_OKeeflake.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/2626/reg_O_kief_29.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/2626/reg_O_kief_44.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/2626/narrow_O_kief_26.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/2626/narrow_O_kief_34.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/okeefe-lake-pei-near-cardigan-pe-2626",
    "stats": {
        "Activities": "river-canoe sea-kayak",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "2 km",
        "Town": "Cardigan, PE",
        "Type": "out-and-back"
    },
    "title": "O'Keefe Lake, PEI",
    "trail_id": "2626"
}