{
    "description": "Extreme altitude, crevasse crossings, rock falls, ice flows, sun exposure, subzero winds.... Good times! \nThe trailhead is a six hour drive from Vancouver, at 5000 ft elevation. We started climbing at 8 am, after getting climbing permits. The 7km trip up to our base camp (camp Muir) at 10,000 ft took just under four hours. There were quite a few day climbers on the way up, with lightweight packs and no equipment. They didn't look too happy about us passing them with our 50lb packs, ice axes, snow shovels, crampons, tents, and basically mounds of stuff hanging off our huge packs! We got to Muir at around noon, just the time that a few climbers were descending from the summit, so we picked their brains about trail conditions etc... While we were talking, Mt. St Helens in the background let off a huge cloud of ash that hovered above its peak for a couple of hours - cool! We dug a campsite out of the glacier and set up camp. After a quick meal we got an early night (around 8am) to get some sleep in before our summit start at midnight.\nMidnight happened pretty much right away. Very tired. Only got four hours of sleep the night before in Seattle. Ate a power bar and put on all of our gear - harness, roped together for safety, ice axe, pack (3L water), warm clothes, crampons... The reason we start so early for the summit is that it is a ten hour climb, and it has to be completed before the glaciers warm up and start to move. When that happens the snow and ice start to melt and get really slippery, the crevasses start to shift, rocks start to fall, it basically gets really nasty to be on the hill. We started up the mountain towards the summit, at 14,400 ft. In the dark, following our headlamp beams, we traversed glaciers, crossed crevasses, scrambled up enormous piles of loose rocks, and trudged, mindlessly, one agonizing foot after another, for six hours. We trudged after some other climbers, following a lantern trail of headlamps up the slope, like a long, slow, caterpillar. At some point the sun rose, a huge pink band opening on the horizon. Near the top, every ten steps required a break for deep breaths of air. There was no breath for talking. We tugged on our rope to communicate when we wanted to speed up or slow down. We finally got to the volcano rim at 7 am, and flopped over the rim to take a break in the caldera.\nAfter a few minutes of sitting on the sharp ice with freezing wind biting through our clothes, eating disgusting power bars, we made way for the final stretch up to the summit. What a great view! The photos say as much as I could. Mt Adams, Mt St Helens, and Mt Hood were all visible from the summit, along with Seattle. All of the surrounding mountains (apart from those three) looked utterly insignificant, despite the fact that they are all alpine mountains, and around 5,000 ft high each!\nWe didn't have long to rest at the top, since the sun was up and staring to warm up. We made our way down carefully, admiring the views and all of the features that we couldn't see on the way up because it was dark, such as the trail winding its way past enormous crevasses that you could have easily dropped a house into.\nBack at base camp at noon, the sun was out full, it must have been around 30 degrees. That would have been fine except for the fact that we had to wear all of our clothes to prevent getting sunburn, so it was sweltering hot. We enjoyed a fantastic ice-cold \"Rainer\" Beer, packed up camp, and descended the rest of the way down the mountain to the trailhead that afternoon.\nAuthor's note:\nIt was very much a worn trail all of the way up (i.e. a trench). There wereabout 50 people who reached the summit the day we did, and most of them upthe DC route. There is very little route finding to do, except in that thereare multiple routes to the summit, some very technical, so you should knowwhich one to take. A company called RMI (Rainier Mountaineering Inc) usesthat route for guided trips for first time mountaineers, and they do a greatjob marking and maintaining the trail so that it is not too technicallychallenging.",
    "directions": "See description and / or GPS",
    "geohash": null,
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/WA/2627/reg_IMG0344JPG.jpg",
        "https://trailpeak.com/storage//content/trails/US/WA/2627/reg_IMG0370JPG.jpg",
        "https://trailpeak.com/storage//content/trails/US/WA/2627/reg_IMG0391JPG.jpg",
        "https://trailpeak.com/storage//content/trails/US/WA/2627/reg_IMG0400JPG.jpg",
        "https://trailpeak.com/storage//content/trails/US/WA/2627/reg_IMG0423JPG.jpg",
        "https://trailpeak.com/storage//content/trails/US/WA/2627/reg_P7123318-7770.jpg",
        "https://trailpeak.com/storage//content/trails/US/WA/2627/reg_P7133321-7770.jpg",
        "https://trailpeak.com/storage//content/trails/US/WA/2627/reg_P7133325-7770.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mt-rainier-dc-route-near-longmire-wa-2627",
    "stats": {
        "Activities": "snowshoe hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 5,
        "Time": "19 hrs",
        "Total Distance": "0 km",
        "Town": "Longmire, WA",
        "Type": "out-and-back"
    },
    "title": "Mt Rainier - DC Route",
    "trail_id": "2627"
}