{
    "description": "This trail is in the Babine mountains park and offers relatively easy access to the alpine. The trail departs the Driftwood Creek Road immediately before Sunny Point, 1.4 km from the parking area. After ascending a steep mining road for 500 m, the route narrows to an excellent trail on an easy grade. At the 3 km mark, the trail winds through a series of rockslides, which are densely covered by slide alder and cow parsnip. Hikers should use caution for the next kilometer as the vegetation obscures the trail and footing can be slippery. The trail travels along the north slopes of Harvey and Pyramid mountains, and passes two small lakes (Copper Lakes) at 6.5 km. After 6km you are in lovely meadows full of flowers and great views up the valleys. It continues upward and eastward until reaching \"Summit pass\".\r\n\r\nFrom the pass you can connect to 2 more trails, Lyon Creek trail and Little Joe Creek trail.\r",
    "directions": "To reach the trail head turn off Highway 16 onto Old Babine Lake Road. This is three km east of Smithers or 300 metres east of the Bulkley River Bridge on Hwy 16. Follow BC Parks signs leading to \"Driftwood Canyon Provincial Park\". Continue past that park another 5 km to the trailhead parking and information kiosk. The road is gated at that point, with no motorized use beyond. \r\n\r\nFor hiking gear check out the local Valhalla Pure store on Main St in Smithers. An excellent inn to stay at nearby is the Stork Nest Inn, offers free breakfast and the owner is a climber, hiker, skier who has lots of info on local trails.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/2628/reg_Mccabe6.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2628/reg_mccabe1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2628/reg_mccabe2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2628/reg_mccabe3.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2628/reg_mccabe4.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2628/narrow_Mccabe5.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mccabe-trail-near-smithers-bc-2628",
    "stats": {
        "Activities": "hike ski-bc",
        "From": "",
        "Seasons": "winter fall summer",
        "Stars": 4,
        "Time": "7 hrs",
        "Total Distance": "16 km",
        "Town": "Smithers, BC",
        "Type": "out-and-back"
    },
    "title": "McCabe trail",
    "trail_id": "2628"
}