{
    "description": "NTS Map: 082N08There are various routes to take to complete this trail.  I will try to describe the trail I took.The trail to Lake Agnes is very popular and you will be with many people. Do not let this discourage you.  The sights on this trail are worth it.The trail head (Elev. 1731 m) is located 0.5 km from the Chateau along the shore side trail.  The trail is broad and well maintained.  The trail follows a steady incline for 2.6 km to Mirror Lake (Elev. 2027 m).   Just before Mirror Lake you will come across a wooden barrier/gate.  At this junction, go to your left about 100 meters to Mirror Lake. From here on you may encounter horses and what they leave behind?.Behind Mirror Lake is the Big Beehive.  From here you can go left and find a junction to the highline trail and the Lake Agnes Teahouse, or you can go right and head to the Little Beehive, Mount St. Piran or the Teahouse.Going to the right for about 0.4 km you will find a junction.  The right will take you to the Little Beehive (Elev. 2210 m and Mount St. Piran (Elev.  2650 m). To the left you will see a waterfall and the Teahouse. Go to the left for about 0.4 km to the stairs at the waterfall which will lead you to the teahouse (Elev. 2134 m).From here on you will encounter fewer people since most have the teahouse as their final destination.Follow the trail around the north side of the lake.  You will end up at a step switchback that takes you to the saddle between Devil's Thumb (Elev 2458 m) and the Big Beehive (Elev. 2270 M). This trail and switchback is approximately 1.1 km.The unmarked trail to the right goes up around the back side of the Devil's Thumb.  The trail is 0.7 km long and involves some sections of scree.  The view is supposed to be magnificent.To the left is the Big Beehive. There is no real trail to the hut at the top but after 0.6 km you will find it.From the Big Beehive/Devil's Thumb junction, head down the south side of the saddle (the side away from Lake Agnes).  The trail goes down some switchbacks and is narrow and tougher to navigate.  This part of the trail is not as well maintained as the first part going to the teahouse.  At the 0.9 km mark you will encounter the Highland / Mirror Lake junction.  The right trail leads to the Plain of Six Glaciers Trail. Going left for about 1 km, you end up at Mirror Lake.From here it is about 3.1 km back to the Chateau.Unfortunately there was a lot of smoke in the air when the attached photos were taken.",
    "directions": "From The Lake Louise Chateau, follow the shore line path for about 500 meters.",
    "geohash": "c3jk",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/2629/long_089-2--40997.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2629/long_Lake-Louise-Little-Beehive-trail-Aou-12-3--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2629/reg_086-40997_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2629/reg_149-40997.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2629/reg_2-Leslie-against-the-mountain-because-the-world-is-not-enough-25825.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2629/reg_DSCN2345-31043.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2629/reg_DSCN2354-31043.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2629/reg_DSCN2356-31043.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2629/reg_P1060215JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2629/reg_P1060238JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2629/reg_P1060257JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2629/reg_beehive1JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2629/reg_beehive2JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2629/narrow_DSC-7820-29667.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2629/narrow_DSC-7832-29667.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2629/narrow_DSC-7888-29667.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2629/narrow_DSCN2347-31043.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2629/narrow_DSCN2359-31043.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/lake-agnes-teahouse-big-beehive-near-banff-ab-2629",
    "stats": {
        "Activities": "snowshoe hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 5,
        "Time": "4 hrs",
        "Total Distance": "11 km",
        "Town": "Banff, AB",
        "Type": "out-and-back"
    },
    "title": "Lake Agnes Teahouse - Big Beehive",
    "trail_id": "2629"
}