{
    "description": "Reach this popular trail by driving North on Hwy 99 from Vancouver.  Drive north approximately 30km past the last set of traffic lights on Hwy 99 north of Squamish (lights at Garibaldi Road).  Turn right at the well marked, paved road - look for the BC parks sign, signalling the turn-off to Garibaldi Park.  Drive 2.7km on the paved road, until you reach the trail head parking lot.  The trail head is near the entrance to the upper parking lot (again well marked).  Leave no valuables in your car, local dysfunctional sometimes run rampant through the Sea-to Sky corridor.The hike to Garibaldi Lake is made up of 9.5km of easily navigated switch-backs, lots of elevation gain (800+metres)here.  Good hiking footwear is recommended ( especially for the trip down as you will encounter tree roots, rocks, and possible muddy areas.  Most of the trek is under the cover of mountain hemlock and other evergreens.  At about the 7km mark, you will come to a rest area where you will have the choice of going left towards Taylor Flats alpine area and the Black Tusk, or right towards Garibaldi Lake.  Not to worry... if you have the time, you can do both.  If camping is your thing, there are camp grounds at both Taylor Flats and the Lake.  There are even bear caches to store food.Speaking of bears, they are a concern in this area.  Note also that dogs are not allowed on the trail. Dogs love chasing bears and bears love chasing dogs who love running back to their owners who hate to climb trees to get away from dog addled bears. Whether you are doing a day hike or an over-nighter, make sure you bring plenty of food and snacks... you will need them.  Although there is generally plenty of water on the trail, it is always a good practice to carry your own fresh water.The hike to completion is a gradual but steady climb for most of the 9km one-way hike. Elevation gain is 800m+.Map of Garibaldi and Black Tusk: NTS Map 92G14NOTE: This is also a popular back-country ski route. Park near the Highway as the road may not be ploughed.  As a ski-route, this is usually an overnight trip as you will spend most of the day reaching Garibaldi Lake or Taylor Meadows.  Strong parties can ski the alpine around black tusk as a long day trip from Rubble Creek.Switch-backs may be icy on the way down, you may have to take skis off.  You will be overnighting in your tent - so be prepared.  If not an experienced back-country skier stick to the flat areas and meadows.",
    "directions": "See description and / or GPS",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/263/regtusk_best_0_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/263/reg_007.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/263/reg_009.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/263/reg_011.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/263/reg_013.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/263/reg_016.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/263/reg_018.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/263/reg_375441262-Lged4-O-14798_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/263/reg_375443150-k2eNt-O-14798.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/263/reg_5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/263/reg_Black-Tusk-025-25741.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/263/reg_Black-Tusk-036-25741.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/263/reg_Black-Tusk-037-25741.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/263/reg_Black-Tusk-054-25741.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/263/reg_DSC07871-27598.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/263/reg_IMG-1156-35444.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/263/topo_001.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/263/narrow_375445210-q49wU-O-14798.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/263/narrow_Black-Tusk-059-25741.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/263/narrow_tuskvertjpg.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/garibaldi-black-tusk-near-squamish-bc-263",
    "stats": {
        "Activities": "snowshoe hike ski-bc",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "7 hrs",
        "Total Distance": "10 km",
        "Town": "Squamish, BC",
        "Type": "out-and-back"
    },
    "title": "Garibaldi / Black Tusk",
    "trail_id": "263"
}