{
    "description": "Mount Temple dominates the skyline from the village and ski hill at Lake Louise. It is the most accessible peak greater than 11,000 ft in the Canadian Rockies and unfortunately, probably one of the most frequently climbed peaks of the Rockies in the summer! We knew that there would be hordes of people on the mountain, even more so due to the fact that we chose to make our attempt on the August 5th long weekend, but still we went ahead.Starting out from Moraine Lake at 7:30, we were at the top of Sentinel Pass by 9:30. There were already a couple of dozen people ahead of us and by coincidence, we ran into with a large number of acquaintances that we knew from various places, which demonstrates how popular a scramble this is - and how many people there can be on the mountain at any given time.The route up from the pass was pretty straightforward initially, with a well defined path cut into the side of the mountain by the large number of hikers that tackle this peak every year. This is referred to by Alan Kane ('Scrambles in the Candian Rockies' author) as the tourist route. We ascended the first cliff band without too much trouble but at the second set of cliffs (at about the 9,900 ft level) some members of my party were uncomfortable with the difficulty of the scrambling and the loose rock. I scrambled up the cliffs first and tried to help up the others - while doing so, I released a few baseball sized rocks below, which did not do much to restore confidence in the route. Climbing helmets are highly recommended, even though for most of the route they are not needed, there is loose rock on the cliffs. Plus, there are so many other people on the mountain on any given day! You just never know if others will kick rocks down on you.For the sake of logistics, the other members reluctantly turned around at this point and I decided to continue on and was eventually able to join up with another group at the summit for the descent. This second set of cliffs was the most difficult scrambling (crux of the day). From that point, it was a bit of a slog to the summit and there was a layer of fresh snow over the last 1,500 ft.Views from the top were awesome and I lingered for a few minutes and chatted with others on the summit before beating a retreat down to the car at 1:45. The descent took a bit less than 4 hours and I was back at the parking lot by 6:00 PM. During the descent, I almost had my head taken off by a bowling ball sized rock that someone released as I made my way down the cliffs... I was assiting a fellow as he descended a rock band. As the chap bent down to pass me his backpack, someone above us kicked loose a nugget that just missed nailing him in the back of the head (and me in the face), literally by a matter of inches. We let fly a few angry swear words as he did not seem to understand the hazard that had been narrowly missed. See warning about helmets above! For another point of view, check out this alternate posting  on trailpeak, which contains  a more complete GPS data set.NTS Map: 082N08Elevation Gain: approx. 1,600 m (5,250 ft). Dist.: ~16 kms. Max. El. ~3,550 m (11,600 ft)",
    "directions": "Drive up to Moraine Lake from Lake Louise Village. Follow the trail to Larch Valley/Sentinel Pass and follow the trail ascending to the right of the pass.",
    "geohash": null,
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/2631/long_P1020204-46769.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2631/long_P1020256-46769.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2631/long_Temple-with-Brendan2-Large--7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2631/reg_DSC04420aa.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2631/reg_DSC04421a.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2631/reg_DSC04425.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2631/reg_DSC04444.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2631/reg_DSC04468.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2631/reg_Mt-Temple-Moraine-Lake-Aug-2013-18--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2631/reg_Mt-Temple-Moraine-Lake-Summit-Aug-2013-1--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2631/reg_P1020248-46769.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2631/reg_P1020251-46769.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2631/reg_P1020258-46769.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2631/reg_P1020287-46769.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2631/reg_P1020293-46769.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2631/reg_P1040596-Large--7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2631/reg_best1_DSC04458.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2631/reg_photoofmounttemplefromlakelouisevillage2005.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2631/topo_mounttemplejpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2631/narrow_Untitled-1-Large-3--7064.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mount-temple-near-banff-ab-2631",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 5,
        "Time": "8 hrs",
        "Total Distance": "16 km",
        "Town": "Banff, AB",
        "Type": "out-and-back"
    },
    "title": "Mount Temple",
    "trail_id": "2631"
}