{
    "description": "Having made your way up to Emma Lake, you may never want to leave.  There are days of ridge wandering along the South Powell Divide to be had, based at the BC Forest Service hut at Emma Lake.The trail starts through some scrub alder, crosses a large slide, and soon arrives at what locals call the Stairmaster.  There is a good reason for this - the trail climbs very steeply for the next while.  However this is mitigated by the fact that you are climbing through some lovely old growth yellow cedar.  On your left is a beautiful creek coming down over huge slabs of granite, and soon you will have an opportunity to cool your toes in some shallow pools.  The trail then breaks out into the alpine, boggy in parts.  Views all around, and a very impressive rock wall on your right.  Both times I have been to Emma Lake I've seen a black bear here.  As the trail rises the glacier on Mount Albert across the valley comes into view.When you reach the ridge your natural impulse is to head straight down to beautiful Emma Lake.  However the trail proper bears to the west (right) and is marked by cairns and some faded ribbons. From this point you'll have views over to Beartooth Mountain and other peaks above Powell Lake.  The descent to Emma takes about 15 minutes.  There was still some ice in the lake on August 6. The lake is large and a wonderful colour.",
    "directions": "Turn off Highway 101 at the Stillwater Main logging road (about 7.5 km north of the ferry terminal). Follow the road up Goat Main (signed to Goat Lake and the Eldred River) until you pass the 37 mile marker.  The road is in good 2WD condition to this point.  Look for B branch heading up to the right, posted for the Emma Lake trail.  (The post may be obscured by vegetation).  From this point on it is 4WD access, although a nimble 2WD might make it quite a bit of the way.  Follow B branch for (very) approximately 5 km.  You'll go through a steam bed crossing. (Unless you are on an ATV or a very high clearance 4wd you should stop before the creek bed crossing and hike the last 1 1/2 kms.) The road swings back to the right towards the end, and ends in the Emma Lake parking lot.",
    "geohash": "c0z",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/2637/reg_IMG-2874-42692_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2637/reg_IMG-2886-42692.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2637/reg_IMG-2924-42692.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2637/reg_IMG-3009-42692.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/emma-lake-near-powell-river-bc-2637",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 5,
        "Time": "6 hrs",
        "Total Distance": "10 km",
        "Town": "Powell River, BC",
        "Type": "out-and-back"
    },
    "title": "Emma Lake",
    "trail_id": "2637"
}