{
    "description": "Brother's creek is a great North Shore Hike, where you'll still find large cedar Groves somehow untouched by the logging of the North Shore earlier this century.To get there, you've got to zigzag through the streets of West Vancouver.  Take Taylor way north under the Upper levels Highway, then turn left on Southborough Drive. At Highland drive, bear left and continue on to Eyremont Drive, then turn left again. At Crestline, go right, then quickly turn left at Henlow. Look for Millstream Road, turning right on it and looking for the yellow gate which is your access. Park nearby. Walk along fire access road until you cross the Baden Powell Trail, turn left, and go right a few hundred meters later.  Continue on this access route towards our waypoint 11. A possible shorter access (which is shown in our map from points 1 to 8) is to park near waypoint 1, at the intersection of Chartwell, Eyremont, and Millstream, then follow the access road up to the Baden Powell trail intersection with Brother's Creek trail. When you get to Brother's creek trail, follow the waypoints in a loop, returning via the Baden-Powell trail on the Western side. Lower portions are fine in winter, however, you'll encounter lots of snow in winter, and, a lot of mud in early Spring.UTM of trailhead above is waypoint 8 on map, where Brother's Creek trail intersections Baden Powell trail, this is another trail reference point.  Note, you can download the text file with waypoints, click on \"view/download GPS\".",
    "directions": "See description and / or GPS",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/264/long_BrotherPICcopy.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/264/reg_IMG-1096-29982.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/264/topo_BrotherFinal.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/264/narrow_IMG-1092-29982_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/264/narrow_IMG-1106-29982.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/brothers-creek-near-vancouver-bc-264",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "7 km",
        "Town": "Vancouver, BC",
        "Type": "out-and-back"
    },
    "title": "Brothers Creek",
    "trail_id": "264"
}