{
    "description": "Although many paddlers park and  paddle the 2km from the mouth of Eels Creek to High Falls, we chose to hike it -- and continue on from there on a right angle to the outstanding Petroglyph park some 6km away. The reward is one of North America's best known petroglyph rocks. The guardian first nation group asks that you not take pictures for spiritual reasons. There are over 900 petroglyphs on the rock outcrop, carved out of the white marble.We recommend the direction of the Creek mouth off Northey's Bay Rd. to the falls, then on to the centre for several reasons. The cold drinks and rest and the disovery of the Centre itself as you emerge from the woods make this the choice way to do it. The other reason is you can do this as a shuttle hike, leaving one vehicle at the centre (or get picked up as we did).In the book  \"Paddling and Hiking\"  Ontario's Southern Shield country, by Kas Stone  - this is listed as trip #5.The paddle or hike to the falls begins at the parking spot off Northey's bay Road (parking area is just before the bridge over Eels creek) if heading west on the road from the Park entrance.We prefered the hike instead of paddling, and here's why.  Many youth canoe into the falls area and camp on the gorgeous exposed granite cliffs and outcroppings.  Unfortunately, this crowd is leaving a ton of garbage and spoiling the falls as a destination.  The hike is up and down on the Canadian shield and under tree covered lowlands. The provincial park should annex this area and ensure campers pay a fee and observe back-country ethics.After hiking the 2km as it generally follows the creek, we lunched.  We did not swim on account of broken glass in the water. We very quickly decided to get going and follow the blue markers on the High Falls trails some 5 or 6km northeast (on basically a right angle away from the creek and hike we had just done) to the Petroglyph Park Centre. You don't ever have to cross the falls area to get to the Blue markered trail, it's on the same side you hiked in on.  Finding the blue markers took some time, but there is GPS data attached to this trail for those who have a GPS and want to use it.This hike is known as the High falls trail, and many people hike it from the Petroglyph park to the falls, however, we hiked it as a shuttle in the opposite direction, leaving one car at the Eels creek parking area off Northey's Bay Rd., and were picked up at the Petroglyph Park by friends. If you are with tourists only, have them drop you off at Eels creek and meet them back at Petroglyph park. They can watch the movie, take their time, while you sweat it out.This hike is magical and well worth the trip. It will feel remote and unspoiled (except for the falls area).  Although I had my kayak with me on this trip *(just in case)* I was very glad we did the hike instead of the paddle -- it is more spectacular. There are wildflower areas and beaver dams and the feeling that you are in a special place.  You are indeed in a special place, a spiritual place, as the Curve Lake Indian band has tended to the rock outcrop which features hundreds of carvings including Thunderbird, Shaman, Serpent, Canoe, the Great Spirit, and various other mystical beings.  This teaching rock is preserved today by First Nations and Ontario Parks, and it's a world class destination.Indeed, after 2 hours of (we had children) rather warm weather hiking, we were thrilled to reach the Learning centre (it appears out of the woods) whose first door leads to a cold drink machine and friendly staff!  We melted into the leather chairs, hydrated, and, immersed ourselves in the displays.This is prime Canadian shield country, the 7km combined hiking to the centre has some small steep sections up and down, and some long boardwalk crossings over wetlands which themselves are  interesting.  Generally, you follow the blue trail markers from the High Falls area some 6km to the centre.  It may take a bit of roaming once on the Granite outcrop at the falls to find the blue markers, we tried, but maybe did not look hard enough, or easterly enough.  However, on retracing our steps away from the falls, we connected into the Blue marker system, and worn-in trail, about 200m back from the falls, in a lowland area along the creek shore where it is lake-like and wide.  You will see our wanderings in the GPS data. We met other hikers coming from the centre, who confirmed, yes, the Centre is about 1.5 hours hike along the blue trail.Once you are on the blue trail, you can't go wrong, you may have to climb over downed trees and gulleys until you reach the provincial park boundary where these are kept clear of the trail, but it is an exciting, mostly high and dry, exceedingly beautiful area for it's biodiversity and terrain.  A highly recommended hike, a so-so paddle (for those trying to decide).",
    "directions": "Take Hwy 28  north 37km from Peterborough.  You will see some provincial park signs identifying the Petrogrlyph park, you should follow those onto Northey's Bay Road but park just after you cross the Creek, some 8km on Northey's Bay Rd. if heading in the east direction (from Peterborough).Alternatively, for those coming from the east, on Hwy 7, take Hwy 40 out of Havelock north to Rd # 6, turn right and follow around the lake until you see Northey's Bay Rd. and follow the yellow sign to the park.  Drive past the park entrance, another few km to the creek, but park on the right before you cross the creek.Paddle (portage up 100m past the rapids) or hike the trail to High Falls.  From there, follow the diretions above or the attached gps data to get on the Blue trail (Blue Trail Markers) which is the High Falls Trail to the Petroglyph park.  It generally follows ridgeline and a nearby stream.  You will eventually, perhaps 1km from the centre see some signs, and, some other trail options that circle a small lake (Nannabush Trail).  You are in the Provincial park and not far to go.  Follow along to the parking area and Learning Centre (the first building to appear) and take a break.  Return on the trail, or wait till your ride arrives.If someone picks you up, you do not have to pay the park entrance fee.  Shuttle back to the car where you left it.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/ON/2642/reg_ClosertoPetroPark.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/2642/reg_JoeAtFalls.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/2642/reg_alongHighFallsTrailtoPetro.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/2642/reg_goingtoPetroGlyphs.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/2642/reg_towardsHighFalls.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/2642/topo_AlmostthereFalls.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/high-falls-to-petroglyph-park-near-peterborough-on-2642",
    "stats": {
        "Activities": "sea-kayak hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "8 km",
        "Town": "Peterborough, ON",
        "Type": "out-and-back"
    },
    "title": "High Falls to Petroglyph Park",
    "trail_id": "2642"
}