{
    "description": "NTS Map:92F7.  This hike is a great day hike taking you up Mt. Joan (1557 Mtrs).  From the top you get great views of Strathcona, the Coast Mountains and South Mountains of Vancouver Island.  This hike should take around 5 hours, covers 11 kms, is well maintained and well flagged.  From the trail head the first hour is spent on an over grown logging road, bring gaters for the low lying prickly bushes.  The second hour has you gaining most of the elevation on a fairly steep trail, bring poles, handy on the way down.  The last hour has you ridge walking along beautiful rock to reach the summit.  Be sure to sign the registry.  Have your lunch and enjoy the views.\r\n\r\nHead up the trailhead, in a short time you will come to a sign post for Mt. Joan, follow this route.  For the next hour or so you will be following an old overgrown logging road up several switch backs.  At the end of the road you head into old growth forest.  At this portion, the trail gets steep.  Keep your head down and push on.  Once you get to the tarn at the top, head to the right and cross the creek at its narrowest point.  Follow the flagging and head towards the cliffs you see in front of you.  In a few minutes you will come to a creek, keep the creek on your left and head upwards through the trees.  Once you leave the trees follow the trail through the low brush and keep an eye out for when the trail heads off to the left.  Keep heading upwards.  When you make it to the top, you are going to make a left and either head up along the rock to Mt. Joan or stay along the rock band to the left.  In about an hour you will be standing on the top of Mt. Joan.  Hope you enjoyed it!",
    "directions": "Head either North or South on inland highway and make a left or right at the Cook creek turn off (one of the few sets of lights between Nanaimo and Courtenay).  Follow this logging road.  In a little while you will come to a Y in the road (Chef creek sign), take the right branch.  Avoid all roads branching off, you want to stay on the main logging road.  In 15.1 kilometers you will come to a bridge that has a sign saying \"load limit 70 tonnes\", make a right here and proceed to a small parking area.  This part of the trip should have taken you about 25 minutes.  I would say if you don't mind a little roughness on your car it will make it to this point, but no further, park your car and walk the next 4 kms.  The road from here gets rougher with many cross ditches.  If you have a 2wd vehicle with decent ground clearance I would go further as there is a small area to park 3 kms away.  The last 1 km is for 4wd, short wheel based and high clearance vehicles.  The drive from the highway is a total of 45 minutes (19.1 kms), with the last 1 kms being the worst.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/2646/reg_IMG_2506_Large_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2646/reg_best1_IMG_2474A_Large_.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mt-joan-near-courtenay-bc-2646",
    "stats": {
        "Activities": "snowshoe hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "5 hrs",
        "Total Distance": "11 km",
        "Town": "Courtenay, BC",
        "Type": "out-and-back"
    },
    "title": "Mt. Joan",
    "trail_id": "2646"
}