{
    "description": "NST Map: 083D16This is a short loop that can be done in an hour or less. Its a nice option for rainy days or after work. 3km of the trail is on gravel road and the rest is fast flowing singletrack. By doing the ride in a clockwise direction there is only a short 2km climb and then a long, long downhill back to town.In winter please check the local avalanche conditions and bulletins.",
    "directions": "This loop starts just after the west railway overpass in Jasper. Follow Connought drive out west towards the Hwy 16/93 junction. Just after the bridge turn right onto the Wynd CN access road. (this road is gated but bicycle and foot access is allowed. Follow the road 3km west until it veers off to the right up a steep hill. At the top of the hill, cross the railway tracks and head a few hundred feet west untill you spot a singletrack heading up the hill. It will be marked trail #3 on the signpost thats there. This is where you start to sweat. Ride/push your bike for almost 2km untill you hit another signed junction. At this point you'll want to take the righthand trail that leads back to Jasper. From here on out is is a fast flowing singletrack that snakes thru aspen and lodgepole pine forest.There are three more junctions before Jasper to keep in mind. One is the Hibernia lake trail. This is just a steep uphill track that takes you to the lake. Ignore it. The next turnoff is right beside a small rockgarden at the bottom of a long hill. This one is a sidetrail the cuts out a rooty section of the ride. Its good for walking but not much fun on a bike. The third junction comes after a small climb out of the roots to the top a ridge in the middle of a large firebreak. Keep right here. Both ways lead to the same spot but the righthand fork is a better ride.(watchout for hikers and dogwalkers here) At this point you are only a KM or so out of town. Follow the trail untill you hit Cabin Creek Dr. and head off to the Ded Dog for beers.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/2649/reg_map.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/marjorie-lake-loop-near-jasper-ab-2649",
    "stats": {
        "Activities": "hike mtn-bike",
        "From": "",
        "Seasons": "winter fall summer",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "10 km",
        "Town": "Jasper, AB",
        "Type": "out-and-back"
    },
    "title": "Marjorie Lake Loop",
    "trail_id": "2649"
}