{
    "description": "NTS Map: 082J16Fish Creek, a provincial park located wholly within Calgary is Canada's largest provincial park in a city (or something like that)  but it is BIG.  A good 16 km end to end and varying from 1 to 3km wide running along the Fish Creek.The trails are numerous and cross and recross each other so there is an endless number of routes to choose from.It got a big hit from Mother Nature last ('05) year when a small dam upstream on FC let go during record rainfalls.  The resulting torrent removed more than 1/2 the bridges along the creek.  The  Sunday hikers who don't want to get their feet wet aren't too impressed but it just made it more like a *real* trail.The bad press seems to have really put people off of visiting this park, on a Saturday afternoon from (11h30-16h00) we saw far less peple then we usually do 100km out of town in K-country.  And this is in our backyard!! w00t! Seriously, I think this has everything to offer that many trails in Kananaskis Country do.  It's got climbs (granted only 120m & you really have to look for it), it's got creek crossings, it's got some cool downhill and schweeet singletrack (and paved and shale paths if you desire).  All within a km of several 7-11s (and their ilk) if you need refreshments.  It also has free access, free parking, free cook-out sites for the after ride BBQ.There is also Sikome Lake near the East End for a refreshing dip.",
    "directions": "South end of Calgary, South of Anderson Road, West of the Bow.  Many places to pick it up.  Just off 37th Street and Anderson Road is the West end and off Bow Bottom Trail at Burnsmead or Sikome, etc. areas are the East end.  South end of Elbow Drive, MacLeod Trail near the Fish Creek C-Train station, etc..",
    "geohash": "c3nc",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/2654/long_fishcreek2-16855.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2654/long_fishcreek3-16855_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2654/long_fishcreek5-16855.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2654/reg_DSCF2711-11674.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2654/reg_P4060593-11674.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2654/reg_map.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2654/reg_st1jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2654/narrow_fishcreek4-16855.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2654/narrow_st2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2654/narrow_stairsjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2654/narrow_washoutjpg.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/fish-creek-near-calgary-ab-2654",
    "stats": {
        "Activities": "river-kayak hike ski-xc mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "4 hrs",
        "Total Distance": "35 km",
        "Town": "Calgary, AB",
        "Type": "out-and-back"
    },
    "title": "Fish Creek",
    "trail_id": "2654"
}