{
    "description": "\"Something tells me we're not in Kansas anymore...\" says Andrew, a friend I went riding with on my second day here in Saint John's. Though a clichéd expression, it did seem more than apropos. This stuff was suicidal as far as I was concerned. I think we're on the opposite coast, by the looks of this!\r\n\r\nWhite Hills trail system is an 8-9K circuit located on a rocky hill in Quidi Vidi that is composed more of log ramps, boulder drop-offs and constructed berms than single track. It's also the location for racing events on full suspension bikes. There's no way we're riding this, I thought, but purely for entertainment and \"academic\" purposes, let's walk our bikes through it. Andrew just laughed and went along for the proverbial ride, or literal non-ride.\r\n\r\nI've never biked in BC, but I've seen several posts on this site that resembled this place. Since visiting this trail, I've asked locals about it, thinking about what kind of riding experience gets you to that skill level. More than not, the answers I'd get spoke more about being young, than of developing experience. That may explain the presence of some 14 year olds we met near the beginning of it.\r\n\r\nI think the pictures will do this way more justice than my writing, as this stuff was way out of my league. There were a few milder sections we did enjoy, like the section along the powerlines. But needless to say, we did more walking than biking.\r\n\r\nWorthy of note is a  micro brewery in the area, so after a day of hard riding in the White Hills, you can park your bikes and reward yourself with an iceberg beer!\r\n\r\nShannon Burt\r\nEast Coast Editor\r\nTopo: 1N10\r\n\r\nRider shots certasy of Canary Cycles, st. John's\r",
    "directions": "Aproach Quidi Vidi, next to St. John's. Look for two green water tanks and a bridge. Trail starts there.",
    "geohash": "fb6w9",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NL/2656/reg_whitehills.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/2656/topo_berm.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/2656/topo_fixture2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/2656/narrow_canary2jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/2656/narrow_canaryjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/2656/narrow_fixture1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/2656/narrow_fixture3jpg.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/white-hills-nfld-near-st-johns-nf-2656",
    "stats": {
        "Activities": "mtn-bike hike snowshoe",
        "From": "",
        "Seasons": "summer fall winter",
        "Stars": 5,
        "Time": "2 hrs",
        "Total Distance": "8 km",
        "Town": "St. Johns, NF",
        "Type": "out-and-back"
    },
    "title": "White Hills, NFLD",
    "trail_id": "2656"
}