{
    "description": "My second day in St. John's, and my plan was to meet up with a friend to rent mtn bikes, and try out the trails in the Signal Hill and Quidi Vidi area of the city. When telling a friend about this upcoming trip, I was told that the trails here in St. John's would certainly be worth seeking out. This much is true! This day was one of extremes. One ride that was very simple, and an other that was suicidal.We got ourselves geared up with hard tails from two different bike shops (Even bike were getting scarce with car rentals virtually unattainable) and purchased a trail guide. (Avalon Mountain Bike trail Guide, 5th edition) With some discussion with the vendors, we were off to Signal Hill. It was very foggy that day, so, unfortunately, the panoramic views of Signal hill would not be had. Fortunately, it was only minutes away.The ride up to Signal hill was a steep, but luckily, short assent. When we arrived, we started looking for landmarks for the trail we wanted to ride. According to the trail guide this was rated easy. (One star) We found a path beside the road and started in. We rode a series of circuits, but I felt it was hit and miss. After looking at the GPS track, we were mainly on the money. Some landmarks in the trail description threw us off, like the absent chainlink fence. It was a fun ride that concluded with a flat tire on my rig. I had a patch kit by chance, but no pump, so we called the bike shop and he came right out and fixed it! Thanks Bill!The trail here is mainly gravel and scrub brush, but given the area, there are rock outcrops that make for some technical riding. It's pitched as a warm-up ride for other routes in the area. It is not documented in the historical site's trail list as an official tourist trail, so there is no conflict in using it. Non-riders did appear on or near the trail, drawn by the endless blueberry patches, so be weary.After finishing what we could find of this trail, we used the official trail system (Lady Lookout and Burma Road trails) to get ourselves to White Hill trail area not far from town. This is touted as a four star wild ride consisting of ramps and other crazy infrastructure. As far as the trails we used to get to White Hills don't bother seeking them out to mtn bike. They're littered with wood step structures and tourists taking in the coastal views making it more of a walk than a peddle. Topo: 1N10",
    "directions": "Right across from the Battery Hotel on the way up to the tower on top of Signal Hill. Pick an in trail, any one will do.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NL/2657/long_IMG-6232-43517_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/2657/reg_mtnbkcar006.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/2657/narrow_pathjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/2657/narrow_towerjpg.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/signal-hill-trail-st-johns-near-st-johns-nf-2657",
    "stats": {
        "Activities": "snowshoe hike ski-xc mtn-bike",
        "From": "",
        "Seasons": "winter fall summer",
        "Stars": 2,
        "Time": "1 hrs",
        "Total Distance": "3 km",
        "Town": "St. Johns, NF",
        "Type": "out-and-back"
    },
    "title": "Signal Hill Trail, St. John's",
    "trail_id": "2657"
}