{
    "description": "After tasting a bit of the White Hills trail system, I wanted to attack something more in my realm of possibility. Kenmount Hill is rated in the Avalon Mountain Biking Trail Guide as three stars in difficulty. It's located at St. John's highest point, where several communications towers now exist. I rented a sweet ride from Canary Cycles, and clipped in. \r\n\r\nKenmount is the site of cross country mountain bike races, and consists of single and double track trail. The terrain is rooty with loose rock. With all the climbing I did on the access road to get there, the section I rode was a quick downhill blast. Turns were built up for speed, and there were occasional ramp problems with cheat routes. Marking tape makes the route more visible to someone new to the area. It's certainly a spot I could spend a few hours on to get to know better.\r\n\r\nThe main trail has several side spurs, and runs in and out of dirt roads and forest. Once you get the hang of the main route, it takes around an hour to run the circuit. avoid the area after a rain storm.\r\n\r\nAs is the way with a new-to-me trail, I feel it better to go explore with someone who knows the area. It makes for efficient use of your riding time. I would suggest making inquiries both at the bike shops and the bigger hotels. With the hotel example, I was surprised to learn that there always seems to be someone there who rides.\r\n\r\nThe images are courtesy of Terry Day and came from Canary Cycles at a recent racing event.\r\n\r\nTopo: 1N10\r\nShannon  Burt\r\nEast Coast editor\r",
    "directions": "Access the area from Blackmarsh Road, taking the Redmond Road; a dirt road used to service the towers and few residential areas. This access road turns into George's Pond Road as you ascend. Trailhead is behind a rear tower guy line.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NL/2658/reg_kenmount1jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/2658/reg_kenmount2jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/2658/reg_kenmount3.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/2658/reg_map.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/kenmount-hill-st-johns-near-st-johns-nf-2658",
    "stats": {
        "Activities": "mtn-bike hike snowshoe",
        "From": "",
        "Seasons": "summer fall winter",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "7 km",
        "Town": "St. Johns, NF",
        "Type": "out-and-back"
    },
    "title": "Kenmount Hill, St. John's",
    "trail_id": "2658"
}