{
    "description": "Team Pangor is a convenient little trail, easily accessed by Parking at the Lower Seymour Parking lot (see our Seymour Bike Trails listing for directions).  Ride up old buck, and turn left at the top when it then forks left and right.  Continue along the Baden-Powell trail for a while, and look for one of the major trail entrances on the left, but before Boogyman (you'll hear riders hooting and hollering in there). If you click on \"view/download GPS\" you will see a nice GPS plot of Pangor itself in yellow, whereas the access trail (Old Buck and Baden-Powell) is shown in purple.  Download the GPS track into your GPS unit if unsure.\nNicely maintained trail, a few ladders and tricks, a swamp below with a long ladder ride but overall a low penalty box, nice trail.  Dumps you out on Bridle path, which takes you back to the Parking lot.  A nice afterwork ride with some classic North Shore, features, blue square to black diamond but by no means double-black.\nDistance of 3-4km (roughly) is for complete loop from parking lot, otherwise trail is very short from beginning to end, maybe 1 km.\nDirections from Vancouver:Take 2nd narrows bridge to North Van, Shortly after crossing, look for signs to Mt. Seymour Parkway, on the right, Follow along Mt. Seymour Parkway, approx 5km, looking for Mt. Seymour Road (takes you up to the ski hill if you were to take it all the way). There is a mall - Northhlands mall, at the intersection,Just under a kilometer up Mt. Seymour Road, look for a turnoff on the left for \"Northlands Golf Course\".On the immediate right, is the parking lot, probably full of riders.For shuttlers, leave one car here and take the other up to the upper parking lots (above Neds), or further, abive CBC!",
    "directions": "See description and / or GPS",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/266/reg_Burm-14110.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/266/reg_Ladder-14110.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/266/reg_Log-Ride-14110.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/266/reg_best1_Down-Ladder-14110.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/266/topo_topofinal.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mt-seymour-team-pangor-near-north-vancouver-bc-266",
    "stats": {
        "Activities": "mtn-bike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "5 km",
        "Town": "North Vancouver, BC",
        "Type": "out-and-back"
    },
    "title": "Mt. Seymour - Team Pangor",
    "trail_id": "266"
}