{
    "description": "My first full day in St. John's, and I was off to Flat Rock, about 20 minutes away from the city. I had made arrangements with Leo Van Ulden, a climber who works at Wallnuts, the local climbing gym. He was planning an early morning's assault with his friend Ian, so I was welcome to tag along. Eventually there were six of us by mid morning. \r\nFlat Rock is a coastal crag consisting mainly of crystally-conglomerate rock with plenty of vertical crack features, and little ledges and flakes. There is a route book in the revision stages being compiled by Leo, which interestingly enough will have GPS waypoints for route spots. To state the vastness of this area, there are over a hundred routes along these cliffs, many of them bolted. This area is currently the most popular scene on the Avalon Peninsula, but is never crowded. Many routes are a single-pitch, with a small number being doubly so with nice belay ledges. There is also bouldering to be had in the area. \r\nWe kept to the \"Big Wall\" area where the range of difficulty goes between 5.8 to 5.11 & change. I especially enjoyed the layback crack work on the easier ranked climbs I did, but there are notable over-hanging roofs and other challenging features to keep the mix interesting. \r\nMany of the climbs require leading, but there are a number where a top rope can be anchored from the paths along the edge of the cliffs.\r\n\r\nTopo: 1N07\r\n\r\n\r\n(Bottom right image by John Duffett)\r\n\r\n\r",
    "directions": "\r\nFlatrock is located 20 km. from downtown St. John's, drive north out of St. John's on Torbay Road for approximately 18 km. at which point there is a road leading off to your right with a large sign indicating access to Flatrock. (This road is Wind Gap Road.) \r\n\r\n \r\nRelated Site",
    "geohash": "fb6",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NL/2660/reg_flatrk003yellowfeaver.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/2660/reg_flatrk012sml.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/2660/reg_flatrk021.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/2660/reg_watching.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/2660/narrow_flatrk015.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/2660/narrow_flatrk022sml.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/2660/narrow_shannoninflatrock.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/2660/narrow_small_flatrk030.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/flat-rock-nfld-near-st-johns-nf-2660",
    "stats": {
        "Activities": "climb",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 5,
        "Time": "7 hrs",
        "Total Distance": "0 km",
        "Town": "St. Johns, NF",
        "Type": "out-and-back"
    },
    "title": "Flat Rock, Nfld",
    "trail_id": "2660"
}