{
    "description": "C'est la longue boucle qui passe par le Lac Pioui et quelques autres sommets.  Distance: 9.9 km - base: 424 m. - sommet: 976 m. - dénivellation ascendente: 860m. - A faire dans le sens des aiguilles d'une montre.  Vue spectaculaire la plupart du temps.  Sentier bien entretenu, glissant lorsque mouillé, quelques sections abruptes mais des escaliers de bois ou des marches de roches facilitent la majorité des pentes abruptes ou en roc. Peut devenir très froid et extrèmement venteux.  Apportez de l'eau, un lunch, des vêtements chauds, une camera et de l'huile à mouches en saison.  Vous apprécierez des batons de randonnées si ça devient mouillé.  Peut être très achalandé les fins de semaine et durant les Vacances de la Construction.Vous pouvez également emprunter l'aller-retour qui monte directement au sommet mais vous manquerez une bonne partie du paysage.http://www.trailpeak.com/index.jsp?cat=bike-mt&con=trail&val=1708This is the long scenic loop that goes through Lake Pioui and a few mountain ridges. Distance: 9.9 km - base: 424 m. - summit: 976 m. - vertical climb: 860 m. Do it clockwise. Spectacular view most of the way. Well groomed trail, slippery when wet, a few quite steep sections but all dangerous steep or rocky inclines have wooden stairs or rock steps. Can be very cold and extremely windy. Bring water, lunch, warm clothing, a camera and mosquito repellent in season.  Trekking poles can be handy if it gets wet. Can be quite crowdy on weekends and during Construction Holidays.You can also take the direct return to the summit but you will miss a lot of the scenery. http://www.trailpeak.com/index.jsp?cat=bike-mt&con=trail&val=1708",
    "directions": "Environ 2 hrs De Québec. Prenez la Rte 138 Est.  10 km passé Baie St-Paul, tournez à gauche sur la Rte 381 Nord. Le sentier est environ 10 km au nord de St-Urbain sur la 381, du côté nord de la route.  Droits de 3.50$ à payer à l'accueil où il y a des toilettes, des breuvages et snacks ainsi qu'un stationnement gratuit et de l'information.About 2 hrs from Quebec City.  Take Rte 138 East. 10 km after Baie St-Paul, turn left on Rte 381 North.  The trail head is about 10 km north of St-Urbain on 381, to the right of the road.  A fee of 3.50$ must be paid at the Registration Center where there are restrooms, beverages and snacks, free parking and information.",
    "geohash": "f2mz",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/QC/2668/long_mlc1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/2668/long_mlc2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/2668/long_mlc4.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/2668/reg_map.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/2668/reg_mlc3.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/2668/topo_mlc5_best1_.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/long-loop-longue-boucle-mont-du-lac-des-cygnes-near-charlevoix-pq-2668",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 5,
        "Time": "5 hrs",
        "Total Distance": "10 km",
        "Town": "Charlevoix, PQ",
        "Type": "out-and-back"
    },
    "title": "Long loop - Longue boucle - Mont du Lac des Cygnes",
    "trail_id": "2668"
}