{
    "description": "Severed is one of the original North Shore trails that has been a staple for riders on the Shore.  Recently fixed up, it is a joy to ride again, for it's moderate ramps, moderately steep descent, and the occasional ladder.\nSee our \"Seymour Bike trails\" listing for directions to parking, you ride up Old Buck from the Lower Seymour parking lot, and, go left on Baden-Powell when you reach the top (you'll know the top of Old Buck because you'll be out of breath).  \nGo past Pangor, and Boogyman, and look for the Silver trail marker, marking the turnoff of the Baden-Powell - you'll know the correct place because we've taken a picture of it for you, given you the co-ordinates (see view/download GPS in the trail options), and, there is a metal placoid at the juntion. You won't see a sign for \"Severed Dick\" but this is the place. If you look down from here, you'll see the small ladder in the 2nd pic (the ladder has been fixed up). If you go past the trail-head, you'll ride up to the powerlines, a few hundred meters up the trail.\nThe twist we've thrown in with the GPS tracks provided here are that we also rode Pingu (accessed by turning right at the top of Old Buck, going up to the Powerlines, and, then seeking out Pingu up top). A short ride, you end up where you would have been on Baden-Powell had you turned left at the Y-junction at the end of Old-Buck. Look for the entrance to Pingu on the left.\nNote: The small ladder in the picture which can be seen from the trail head has been fixed up so looks different now. When you ride down this section for a short while you will come to a 'T' in the trail with another metal sign, choose the left option.  Other is a hiking trail marked as \"Good Samaritan trail\".\nDirections from Vancouver:Take 2nd narrows bridge to North Van, Shortly after crossing, look for signs to Mt. Seymour Parkway, on the right, Follow along Mt. Seymour Parkway, approx 5km, looking for Mt. Seymour Road (takes you up to the ski hill if you were to take it all the way). There is a mall - Northhlands mall, at the intersection,Just under a kilometer up Mt. Seymour Road, look for a turnoff on the left for \"Northlands Golf Course\".On the immediate right, is the parking lot, probably full of riders.For shuttlers, leave one car here and take the other up to the upper parking lots (above Neds), or further, abive CBC!",
    "directions": "See description and / or GPS",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/267/reg_3DFinalSymr.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/267/reg_Dean.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/267/reg_Severed1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/267/reg_SeveredTOPO.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/267/reg_best1_2499773132-e031ef62f2-14110.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/267/narrow_best2_2499775972-baa5889933-14110.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mt-seymour-severed-dick-near-north-vancouver-bc-267",
    "stats": {
        "Activities": "mtn-bike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "2 km",
        "Town": "North Vancouver, BC",
        "Type": "out-and-back"
    },
    "title": "Mt. Seymour - Severed Dick",
    "trail_id": "267"
}