{
    "description": "NTS Map: 082G01. Distance: ~20 kms, Elevation Gain =  1674 m (5,500 ft). Max. Elevation: 2940 m (9645 ft). Hawkins Horseshoe is a favourite ridge walk for many people from southern Alberta, with stunning views of alpine lakes, peaks and glaciers. Last year I attempted the route (solo) via the Lineham Falls trail and made it to the summit of Mt. Blakiston by a moderately difficult scrambler's route up the drainage basin from the Lineham Falls trail. Although I made it up Blakiston, I did not follow the ridge to Mt. Hawkins due to the presence of early season snow on the ridge and much harsher cold conditions than I was prepared for. This year, with the Chinook outdoor club from Lethbridge we approached Hawkins horseshoe from the opposite direction (from the Rowe Lakes trail). This is a much easier approach and is recommended! Mt. Blakiston can be a slog if the scree is not avoided to the left of the drainage basin, and is a lot more fun to descend if the correct route is taken. (Things could be a bit dicy if the incorrect route is taken down Blakiston, cuz of the cliff bands near the top).The club met at our usual meeting spot in Lethbridge at 7:15 AM. We arrived at the Rowe Lakes trail head a bit before 9:00 AM and were soon on our way. By lunchtime we had gained the highpoint of Lineham ridge and enjoyed beautiful views of Rowe Lakes to the southwest and the Lineham Lakes directly below to the south. Weather was perfect for hiking and we had to don windbreakers at this point to stay warm for our lunch. A second group from the hiking club opted for a shorter day and chose to hike up Mount Lineham as an alternative outing. We waved at our comrades as they made their way up to the ridge below us just before lunch, and tried to follow their progress up the mountain as we made our way around the ridge. After lunch we followed the ridge to the summit of Mt. Hawkins with no problems. Most of the members of the hiking club did not even go to the summit and passed just 10 metres below (I guess not all are afflicted with this silly peak-bagger's obsession).  Generally, this entire route should be classified as a hike, with only moderate scrambling required for a short section of ridge between Hawkins and Blakiston. The best option is to stay high on the ridge and avoid trying to take shortcuts by traversing around high points on the ridge - I say this because while passing over the last bump before the summit, some tried to take a shortcut by traversing below it on the side of it and ended up having to backtrack due to unco-operatively steep terrain. The easist descent is via the rubble/scree-covered slopes below the summit of Blakiston (i.e., backtrack down from the summit back along the ridge to the col just before the summit- at the point where photo 9d and waypoint 9d were taken to avoid having to navigate the cliff bands.) I would have taken more waypoints and photos to describe the downroute but unfortunately my batteries kicked the can at this point. The downward route-finding is not too difficult with a number of possibilities existing, with the main issue being rockfall.  Switchbacking our way down, we were back at the cars by 7:30 PM. A few went too far over and encountered some cliffs and had to backtrack carefully to join the rest of the group. We pre-parked a second vehicle at the Lineham Falls trail and avoided the hike back up the road to the Rowe Lakes trail. Berries were ripe on the Linham Lakes trail and there was much fresh bear scat along the path for the last few kilometres. We even briefly got stuck in a bear jam on the way back, with a number of tourists stopping to gawk at a brown bear and cubs that were dining on berries at the side of the road. All in all it was a great day! The outing was a wee bit long (11 hours of hiking), but definitely worthwhile.[editor's note 1: Orignal post has been edited (re: the descent). Descent off Blakiston via the Horseshoe is the same as for what is described on Trailpeak for Mt. Blakiston (click here to read). [editor's note 2: the GPS trail uploaded by the original poster consisted of a handful of waypoints. This has been replaced by another user's GPS beta (note: this GPS track was taken in the opposite direction) - looks good but do not rely solely on the GPS data for navigating the scrambly bits - i.e.  use at your own risk!]",
    "directions": "Park at the Rowe Lakes trail and follow the trail to Lineham ridge. Alternatively, start at Lineham Falls trailhead and do it the opposite way.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/2670/reg9c.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2670/reg_1nearthetopoflinehamridgemtlinehaminbackgroundJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2670/reg_2topofridgeJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2670/reg_3viewfromthetopofmthawkinsjustabumpintheridgeJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2670/reg_5brucewhitebecomingatreeJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2670/reg_6.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2670/reg_7.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2670/reg_9blucieandmarilynabovelinehamfallsJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2670/reg_9d.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2670/reg_9e.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2670/reg_IMG-0367-Large--7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2670/reg_IMG3625JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2670/reg_IMG3657JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2670/topo_hawkinshorseshoejpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2670/narrow_8.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2670/narrow_9.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2670/narrow_IMG3641JPG.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/hawkins-horseshoe-near-waterton-park-gate-ab-2670",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "8 hrs",
        "Total Distance": "20 km",
        "Town": "Waterton Park Gate, AB",
        "Type": "out-and-back"
    },
    "title": "Hawkins Horseshoe",
    "trail_id": "2670"
}