{
    "description": "This trail requires a shuttle to the top of the trailhead. After a brief downhill start, it has a long climb, 5.5km's and 1000 ft vertical, to the RIM top. Once you're at the top, be sure to veer off to your right to view the panoramic view of the valley floor. From here the trail heads down for about 17 km's, with a vertical drop of 2800 feet. The trail is mainly double track with lots of ledge drop offs, turning into singletrack with some switchbacks near the end.\nUPDATE:  Actually a better option is to start higher than the Porcupine Rim trailhead, keep going on up to LPS (Lower Porcupine Singletrack), MPS (Middle), UPS (Upper), or The Whole Enchelada.\nUPS is definitely doable by anyone (less technical, more single track, and ALL downhill than Porc Rim) and way more fun.  Really the only twisty, tree-filled section on all of Porc.  DO IT.  It probably even takes less time than starting at the Porc Rim trailhead as you don't have the crappy grunt uphill for 3+ miles.",
    "directions": "Get the trailmap from one of the bike shops in town. We went to Poison Spyder on Main Street. From the town of Moab, take the road to the famed \"Slickrock\" trail. Go past slickrock till the road ends at the trailhead       N38 34.909 W109 25.014\nAccommodations:\n\n A lot of people in the MOAB area stay at condos managed by www.moabutahlodging.com, speak with Andrea. They offer a range of in town homes to budget and upscale condos.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/UT/2675/reg_IMG-1169-Medium--6828.jpg",
        "https://trailpeak.com/storage//content/trails/US/UT/2675/reg_IMG-1189-Medium--6828.jpg",
        "https://trailpeak.com/storage//content/trails/US/UT/2675/reg_IMG-1190-Medium--6828.jpg",
        "https://trailpeak.com/storage//content/trails/US/UT/2675/reg_IMG-1191-Medium--6828.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/porcupine-rim-moab-near-moab-ut-2675",
    "stats": {
        "Activities": "mtn-bike hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 4,
        "Time": "4 hrs",
        "Total Distance": "34 km",
        "Town": "Moab, UT",
        "Type": "out-and-back"
    },
    "title": "Porcupine Rim Moab",
    "trail_id": "2675"
}