{
    "description": "NTS Map:92F11 This is a short 25 minutes (1.3 Kms) one way hike from Circlet Lake in Strathcona Park to Amphitheatre Lake.  The reason why I am writing this hike up is so that you don't waste your time going to Amphitheatre Lake.  The hike itself is uneventful and the lake is nothing special.  The lake bed is mud and the surrounding terrain is nice, but not worth the effort.  You would be much better off to either stay at Circlet Lake or hike for 45 minutes and go to Moat Lake, which is truly awesome.  The GPS data is from the trailhead.\r\n\r\nFor those of you who have too much time, follow the board walk trail around Circlet Lake until you come to where Circlet Lake is draining.  Cross the stream at two points, hop from rock to rock, water level permitting.  Once across look for a well worn path and rock cairns.  In about 15 minutes you will come to two large tarns, pass them on the right and then pass another large tarn on the left.  The last 10 minutes will have you descend to Amphitheatre Lake.  The trail is not marked, but well traveled and is very easy to negotiate.",
    "directions": "To get to the Paradise Meadows trailhead head towards Mount Washington Ski Resort.  Take highway 19 and turn onto Strathcona Parkway.  The road is paved and follow it until you can make a left turn for Raven Lodge.  Follow this road all the way until you get to Raven Lodge.  Park here.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/2677/reg_IMG_2729_Large_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2677/reg_IMG_2733_Large_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2677/reg_IMG_2735_Large_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2677/reg_IMG_2738_Large_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2677/reg_amphi2_Large_.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/amphitheatre-lake-near-courtenay-bc-2677",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 2,
        "Time": "1 hrs",
        "Total Distance": "3 km",
        "Town": "Courtenay, BC",
        "Type": "out-and-back"
    },
    "title": "Amphitheatre Lake",
    "trail_id": "2677"
}