{
    "description": "NTS Map:92F11.  This hike takes you to the top of Jutland Mountain (1830 Mtrs) in Strathcona park.  The views from the top are awesome, with great views of Mt. Albert Edward, the Coast Mountains and the Mountains of Strathcona Park.  To reach the top of Jutland you can either do a long day trip (9 hours, 26 Kms) or a short hike from Circlet lake (4 hours, 9 Kms).  The is well marked until you get on the ridge and reach the sign post pointing you to either Mt. Abert Edward or Jutland Mountain.  From here to the top of Jutland, you will have to follow the sparse cairns and just follow the lay of the land and avoid some of the steeper bits.  As long as you are heading up everything is fine.  The terrain is not difficult and a pair of hiking poles will make the descent easier on your knees.  Once you get to the top make sure to sign the registry.  Enjoy!\r\n\r\nFrom the trail head, follow the signs to Circlet Lake.  The trail during this part of the hike is well maintained but is not marked.  At every major junction you will come to a sign post pointing you in the right direction. After about 3 hours (9.4 kms) you will come to the turn off for Circlet lake.  For the people who have camped at Circlet lake, this where you start.  From here follow the signs to Mt. Albert Edward, you will start heading up steeply towards the ridge.  Once you reach the alpine you will see many cairns to mark the way and also a well worn trail.  After about an hour you will come to the top of the ridge and see a huge rock cairn with signs pointing towards Jutland Mountain.  Head towards Jutland following the sporadic cairns.  In a short while you will come to a large rock wall, head to the left of the wall.  As long as you are heading upwards all is well.  In about 30 minutes you will come to another rock wall, look for the best path to the right.  Once on top of the rock wall, the summit is only a short distance away.",
    "directions": "To get to the Paradise Meadows trailhead head towards Mount Washington Ski Resort.  Take highway 19 and turn onto Strathcona Parkway.  The road is paved and follow it until you can make a turn for Raven Lodge.  Follow this road all the way until you get to Raven Lodge.  Park here.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/2678/reg_AE_Medium_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2678/reg_IMG_2718_Medium_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2678/reg_IMG_2720A_Medium_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2678/reg_IMG_2722_Medium_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2678/reg_jutland_Medium_.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/jutland-mountain-near-courtenay-bc-2678",
    "stats": {
        "Activities": "snowshoe hike",
        "From": "",
        "Seasons": "spring winter summer",
        "Stars": 4,
        "Time": "4 hrs",
        "Total Distance": "9 km",
        "Town": "Courtenay, BC",
        "Type": "out-and-back"
    },
    "title": "Jutland Mountain",
    "trail_id": "2678"
}