{
    "description": "NTS Map: 082N08The trail to the Devil's Thumb is actually a side trip from the Lake Agnes/ Big Beehive trail.Where the trail up the switch back turns to the Big Beehive, go the other way to the Devil's Thumb.  The following description does not include the Lake Agnes Trail which takes you to the trail head.  The approximate distance is 1.4 km return.  The unmarked trail to the right goes up around the back side of the Devil's Thumb. The trail is 0.7 km long and involves some sections of scree.  Follow the trail for about 10 meters.  The trail will branch to the right and stop at a small cliff.  This cliff has ledges at various heights and must be climbed.  It is very easy to climb and only about 5 meters high.  At the top of the cliff you can see the trail to the left.The trail winds along the side of the mountain offering many nice views of the Plain of Six Glaciers Valley.  The trail becomes narrow at some points and is covered with loose rocks.  The loose rocks pose a hazard since a slip and you may find yourself sliding down the side of the mountain.  In some spots, the hill gives away to cliffs and a slip may prove very dangerous.  The trail will come to an open spot between the Devil's Thumb and some peaks to the west. The trail continues up the slope and if you look hard enough you will find a faint trail.  This trail looks like a bunch of foot holes in the ground.  Scramble up this hill to the ridge.  To the right is the final ascent to The Devil's Thumb.  Pick you own path up this part.  The climb is steep but in not difficult.The view from the top is well worth the effort.",
    "directions": "See Lake Agnes/Big Beehive Trail.",
    "geohash": "c3jk",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/2679/reg_dt1aJPG_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2679/reg_dt2aaJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2679/reg_dt3aJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2679/reg_dt7aaJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2679/reg_dt8aJPG.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/devils-thumb-near-banff-ab-2679",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 5,
        "Time": "2 hrs",
        "Total Distance": "2 km",
        "Town": "Banff, AB",
        "Type": "out-and-back"
    },
    "title": "Devil's Thumb",
    "trail_id": "2679"
}