{
    "description": "The Spout Path section of the renowned East Coast Trail is a 16K path that edges the dramatic coastline of Newfoundland's rocky East Coast. To hike the Spout Path proper, the route actually takes 21K due to an unloved, 6.3K cart trail / access path entering from Petty Harbour.\r\n\r\nOur original plan was to over-night on the trail. We planned to hike this route, tent near the Spout, and then extend the route further to the next section, to make it worth two days of hiking. But when schedules failed us, we simply turned it into a day hike.\r\n\r\nAlthough backcountry hiking is sought more often for its solitude, I was told that hiking the ECT is really meant to put you in touch not only with the island's landscape, but also with the its genuinely friendly people. While in the area, we stayed at a B&B called  Wild Roses   in The Goulds. Not only did they offer lodging and breakfast, but as is common to many establishments, they expect you for dinner and offer provisions for a packed lunch for the trail. Shuttle services picked us up at our trail's end in Bay of Bulls. It was often hard to remember you're in someone else's home, and not your Mom's!\r\n\r\nI haven't set foot on other trail sections on the ECT, but from reading other accounts from Google searches, the Spout Path is a memorable one for many who have hiked the system extensively. One thing worth repeating from the well documented map-set the Trail Association sells, is that this section is one of the more difficult. Besides good fitness, I would also suggest a sturdy pair of hiking boots and hiking pole. The terrain is pretty rough in places. I'm not sure of the surrounding information, but a couple of days before we were there, a woman was airlifted with a broken leg. The day we were there, we came upon a group whose member rolled an ankle, coming down some rocks near the lighthouse. I noted that he was wearing trail shoes with a multi-day pack. It was probably just plain bad luck, but we wore boots, and didn't have problems.\r\n\r\nStarting at the end Shoal Bay Road, we parked our rental, and started in on 6.3K of featureless gravel cart track at around a quarter after nine. Signage was adequate.  Let's just say that the section passed quickly thanks to good company. After an hour and change, we were at the junction of the East Coast trail. You could smell the salt air, hear the waves crashing, and through the trees, you could make out the rugged boulders being hammered by crashing surf. It was a feast for your senses. At the right time of year, (Mid August, it wasn't!) you can add migrating whales and ice bergs to the mix. Approximate distance signage was presented at the junction. Knowing what side the ocean was suppose to be is your best navigational aid for this coastal trek. For us, it was on our left.\r\n\r\nThe trail is a foot path that ranges between soft peaty ground within a forest canopy meandering not far from the coast, boardwalk infrastructure over meadow inland bogs, timber-anchored steps up steeper rocky hills, and the hard reality of boulders. Some of the trail routes itself less than a foot from sheer cliff drop-offs, and as noted by my wife, probably not suitable for children. There are no warning signs or railings. It's \"Au-Naturelle\". These occasional route features certainly give one visual perspective of the awesome rock masses that you're perched upon. A perspective otherwise only appreciated from the ocean.\r\n\r\nThe agenda for the day was pretty much set. It would be a series of gulches, sea stacks, capes and waterfalls, interspursed by meadows and forest groves of weather-warn evergreens. It was a trail where you could see where you were going, and where you had progressed in terms of the vast bigger picture. For sure, the journey from A to B would not be  straight due to the hills, capes and points.\r\n\r\nAt a little more than half way through the hike, we stopped to lunch at the spot where the path gets its name; The Spout. Fed by none other than the Spout River, it is a fresh water geyser, created by water filling a vertical rock cavity, then compressed by salt water wave action from a cave far below. The narrow two-foot opening where it enters, acts as the portal from which a thirty foot or higher burst of high pressure spray jets toward the sky. Up close and personal, it's loud and powerful! You can safely get right up next to the hole on a good weather day. The feature alone is well worth the hike through!\r\n\r\nAfter lunch and many pictures, we set our boot treads back onto the trail. We headed toward the light house, and eventually to Bay of Bulls, our ultimate destination, more highlights were to be had, though none like the spout experience.\r\n\r\nDrop Cove offers a beautiful monolithic sea stack of basalt where you will see an eagle's nest and accompanied family living the high life. There are several other stacks, gulches and an arch that will drop your jaw repeatedly. If you happen along on a wet day, be very careful making your way where the trail comes along the cliff's edge.\r\n\r\nAmong the waterfalls you'll encounter, there is a notable one at Freshwater. What is interesting with this one is how it finds its way along a diagonal three foot ledge and occasionally cascades as it makes its way to the ocean. Again, on a good dry day, you can leave the path, and rock-hop over big and small boulders to make your way down the ledge. It makes a great vantage point. \r\n\r\nIn general, there are a few occasions where you can leave the path either for a fresh vantage point or for a lunch spot along the rocks on the water's edge. Sculpin Island is an example of such a spot where you can explore among the lower rock outcroppings and watch the waves crashing. \r\n\r\nThe second half of the trail is less dramatic in elevation, but no less a rugged coast line. There is no lack in the quantities of blueberries to be picked along the way, especially the meadow sections of The Flats.\r\n\r\nLooking at the map, it's funny to see so many place names in a given space, and on top of that, named ship wreck sites off the coast. No doubt, there's a story behind every spot like Useless Bay and Bread & Cheese. It is Newfoundland after all; where else will you get such unique monikers?\r\n\r\nPassing Gunridge puts you at the Spout Path trail's end. Seeing it from a distance, you begin to see the surrounding community, with its fishing dock, and surrounding cove. The trail exits onto a dirt road with a small parking lot marked with ECT signage. We reached it by mid afternoon. Shortly after that, there are homes in the Bay of Bulls community; any of which you can ask to use a phone to call for your ride if needed.\r\n\r\nThe Spout Path is a hike that comes highly recommended, not just by me, but by local outfitters and tourism people alike who have seen more of the ECT than I have. With the ECT providing such a wide range of trails in its system, you can get it all in one. A hike like this offers rewards such as truly stunning Newfoundland scenery, the potential for whale and ice bergs sightings, backcountry camping and an unique geographic feature for those willing to muscle the miles to get through it.  \r\n\r\nShannon Burt\r\nEast Coast Editor\r\n\r\nTopo Map:1N7 -Bay of Bulls\r",
    "directions": "Heading out from St Johns, get onto Route 10 towards the Goulds and Bay of Bulls. Look for Shoul Bay Road, on your left, and head to its end for the 6.3K spur trail which takes you to the East Coast trail proper.",
    "geohash": "fb6",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NL/2687/reg_CUfalls.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/2687/reg_IMG-4662-32295.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/2687/reg_IMG-4667-32295.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/2687/reg_IMG-4696-32295.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/2687/reg_IMG-4714-32295.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/2687/reg_baldhead.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/2687/reg_crashing.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/2687/reg_edgefalls.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/2687/reg_littlefalls.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/2687/reg_smlstacks.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/2687/narrow_IMG-4691-32295.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/2687/narrow_IMG-4727-32295.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/2687/narrow_IMG-4734-32295.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/2687/narrow_IMG-4735-32295.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/2687/narrow_gully.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/2687/narrow_rockymeadow.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/2687/narrow_seastack.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/2687/narrow_spire.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/2687/narrow_thespout.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/spout-path-east-coast-trail-near-st-johns-nf-2687",
    "stats": {
        "Activities": "snowshoe hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 5,
        "Time": "7 hrs",
        "Total Distance": "22 km",
        "Town": "St. Johns, NF",
        "Type": "out-and-back"
    },
    "title": "Spout Path, East Coast Trail",
    "trail_id": "2687"
}