{
    "description": "NTS Map: 92G6. If you thought the views from the Grouse Mountain Skyride were good  you haven't experienced the summit of Crown Mountain (1501 metres). An added bonus will be your escape of the tourist hoards, few will be venturing beyond the restaurant and concert bowl area. If you really want a work out you can definitely increase your status as an urban hiker by saying, - Yes, I did the Grouse Grind and Crown Mountain in a day. Where as the Grind is an uphill staircase in the trees the continuation on to Crown  will provide an openness  with  a wilderness feel, fresh breezes and great local vistas. If you can identify the local mountains? on a clear day you will likely see Mt. Rainier south of Seattle, Mt. Garibaldi to the north, Arrowsmith near Port Alberni and Mt. Cheam in Chilliwack. The workout will have your thighs torqued especially if you do the Grind.  Most people will opt for the Skyride approach.Head out of the Skyride east toward the Grouse Peak chairlift and stay left on the old service road. Follow the marked trail descending to a small pass and then heading up to skirt  Dam Mountain  and over to Little  Goat.  From here the trail gets a bit rougher and rooty as you descend down to Crown Pass.  Hikers that want to continue down into the Lynn Creek Headwaters via Hanes Creek  as a loop can continue down and east. For Crown it's uphill, 421 metres to be exact. The trail is rooty and can be damp and buggy on a real warm day but persevere soon you will be in the heather of the alpine. Watch your footing, some experience as a hiker may be required here, the trail may be a bit slippery from remnant snow melt in the trees above. The trail ends at a rocky ridge where an easy scramble leads on to the summit. Have lunch here you earned it and be smug because you attained a neat and moderately challenging summit away from the urban masses.ApproachCross the Lions Gate Bridge or approach from the Upper Levels Highway and head north on Capilano Road  to the Grouse Mountain Skyride. The Grouse Grind starts to the east of the Skyride. Crown Mtn. starts east at the top of the Skyride.Elevation Gain 700 MetresHigh Point      1501 MetresOption:A hiking loop is possible via Crown Pass down bouldery  Hanes Creek and into the Lynn Headwaters area. Arrange for a shuttle. The total distance is approximately 20 kilometres.Click on \"view/Download GPS\" to see the way-points for this trail. After getting off the sky-ride at Grouse Mountain, follow the trail that takes you left of the upper ski lift, and over to Dam Mountain, Little Goat Mountain, and then down a valley and up to Crown Mountain.",
    "directions": "See description and / or GPS",
    "geohash": null,
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/269/Crown_mtn.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/269/reg_003-2012-10-27-15-07-00-UTC--7514.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/269/reg_Crown-Mountain-216-6103.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/269/reg_Crown-Mountain-223-6103.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/269/reg_Crown.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/269/reg_Lyons-Mtn-from-Crown-Mtn-34598.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/269/reg_P1060500-30409_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/269/reg_P1060501-30409.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/269/reg_The-Crown-34598.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/269/reg_crowngrougp.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/269/reg_topofcrown-30409.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/269/topo_GoatfromCrown.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/crown-mtn-lynn-headwaters-regional-park-near-vancouver-bc-269",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 5,
        "Time": "5 hrs",
        "Total Distance": "9 km",
        "Town": "Vancouver, BC",
        "Type": "out-and-back"
    },
    "title": "Crown Mtn - Lynn Headwaters Regional Park",
    "trail_id": "269"
}