{
    "description": "Kayaking Witless Bay Ecological Reserve with Jim Price\r\n\r\nOn our last full day in St. John's NF, we were slated for a paddle with Paradise local Jim Price, owner of  Eastern Edge Outfitters. Thinking we would likely be letting in near to where he lived, we scheduled a B&B stay in his area called  Rooms Inn Paradise.  The joke was on us when after packing up and following a list of driving directions as long as your arm to get there from The Goulds, Jim had planned for our paddle destination to be close to where we were the night before. Go figure!\r\n\r\nOur paddling spot would be just past Bay of Bulls, in Witless Bay where an island archipelago has been given an ecological reserve status for migrating bird colonies. Called the Witless Bay Ecological Reserve, it spans five islands, and lays host to numerous nesting sea birds. According to Jim, the colonies include leach's storm petrels, murres, black legged kittiwakes, gulls and puffins. The five islands collectively provide nesting grounds to millions of birds. Great Island itself supports the largest colony of Atlantic Puffins in Eastern North America. Given some of the percentages of species drawn to these islands, it makes sense to protect the area. It's certainly a prime destination if your into bird watching, and if the season's right, whale and berg watching too.\r\n\r\nIn the nearly three hours we paddled the area, we explored around three of the five islands making up the reserve. We explored around tiny Pee Pee Island, Ship Island, and Great Island. The other two in the reserve include Green, and Gull Island. Many mistakenly call the later Bird Island.\r\n\r\nNot being much of a birder myself, and with whale sightings out of season, the eye candy for me was going to be the geography. I love paddling among Islands. Great Island alone hosts sea caves, rock gardens and an arch worth exploring. With our appetites initially whetted back in the Madeline Islands with its sea caves and arches, we were very excited to see the local version honed from granite and basalt.\r\n\r\nWe launched from a slipway near St. Michael's close to a wharf and headed toward Great Island. Right off the bat, we knew we were in true ocean waters. Conditions were not calm despite what seemed to be a calm sunny day.The chop of the waves made progress somewhat slow, being thrashed about in the cold water. Certainly these were not conditions for a novice, or for a paddler unaccustomed to open water. We felt confident, but glad to have Jim as our guide to lead the way.\r\n\r\nThe truth is that Jim was the ideal person to have with us. It was lucky enough just to have our schedules match as he spends much of his warmer months visiting the kayak outfitters in the Atlantic region, teaching sea kayak instruction to guides and enthusiasts alike. His name came highly recommended by people O paddle with back home in PEI. If you get a chance to paddle with him, you will experience his larger than life \"laugh\" amd his practical down to earth view of the world. We were in great hands.\r\n\r\nGiven the current conditions, Jim felt our first destination would be to explore a sea cave on Great Island. Protected by outcropping rocks, it would serve as a sheltered spot to safely explore the dark cavity. The islands themselves stand as rocky cliffs, offering few potential safe landings if an emergency were to arise. Being designated an ecological reserve, nothing less than an emergency allows you landing on the islands. With that in mind, choose your conditions wisely, and paddle with at least one competent partner.\r\n\r\nWe explored one of the huge \"eye socket\" caves that made up what was called Skull Caves. The photos will explain where they get their meaning. When inside, no headset lamp could ever illuminate the water-formed wall features found within. Whether from our eyes being used to the bright light of day, or simply the immense space that swallows up little LEDs, but not even a camera flash would cut inroads into the cave's black. Your best photo-op is to shoot silhouettes from within the cave looking out. They often make for a classic shot.\r\n\r\nThe seas weren't settling, so our next plan was to round to the opposite side of the Island for some shelter from the developing winds. Jim had a surprise waiting for us at the Eastern end of Great Island. This is the location of a sea arch, where if the conditions are right, you can paddle through on your way around the island. Jim led the way through the swells, and with the right timing, and guidance, one by one, each made our way through. The swells and the rocky geography made navigating not a B-line sort of matter. It was a wild rush to go into the midst of all that angry surf and foam, and to come out in a calm serenity on the other side. This was certainly the most interactive highlight of the trip.\r\n\r\nAs we made our way south and then west, the seas chopped far less. The conditions made paddle play much safer. The terrain offered rock gardens and more caves to explore. I saw Jim paddle up and over a low seaweed-covered rock as a swell covered it in wash. It wasn't a trick I was going to follow just yet! That water was pretty cold!\r\n\r\nOur good fortune had it that the conditions changed for the better even after paddling back into more exposed waters, so we headed past Ship Island on the way shoreward to see a hydroelectric dam. Given Newfoundland's cliff-lined coast, and its inland ponds, it makes sense to harness the natural flowing fresh water on its way to the sea.\r\n\r\nAfter nearly three hours of touring around the islands and coastline, we headed back to the cars to wrap things up. From my experience paddling the waters in PEI, Newfoundland's coastal waters certainly are not the same. Paddling these parts can take things up a notch in skill level and preparedness. The water is colder, and landing spots, fewer. As Jim put it, \"sure we have beaches. The only difference is that our grains of sand are this big!\" as he makes a rock size shape with his hands. This past day helps to solidify my resolve to return to this region in the coming years, but next time briging our own kayaks and other gear to explore further the offerings of newfoundland's adventure scene. When I do come back, I'll be sure to give Jim a call.\r\n\r\nShannon Burt\r\nEast Coast editor\r\n\r\nTopo Maps: 1N07 (Bay of Bulls)and 1N02 (ferryland)\r",
    "directions": "Take Highway 10 from St' John's toward Burn Cove. You'll see the islands form the roadside.",
    "geohash": "fb6k",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NL/2690/long_skullislandJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/2690/reg_archinsurfJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/2690/reg_flyinpuffinJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/2690/reg_greatislandJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/2690/reg_islandsaheadjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/2690/reg_nearcribbyJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/2690/reg_seascapejpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/2690/reg_witlessbaymapjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/2690/narrow_socketshotJPG.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/witless-bay-ecological-reserve-near-st-johns-nf-2690",
    "stats": {
        "Activities": "sea-kayak",
        "From": "",
        "Seasons": "summer",
        "Stars": 5,
        "Time": "3 hrs",
        "Total Distance": "12 km",
        "Town": "St. Johns, NF",
        "Type": "out-and-back"
    },
    "title": "Witless Bay Ecological Reserve",
    "trail_id": "2690"
}