{
    "description": "NTS Map: 083D16Trail 7 tours the outer edge of the Athabasca river valley as it follows the contours of the Signal Mountain Bench, Maligne Canyon, and the Athabasca River back to Jasper. Most of the trail is singletrack with a couple sections of doubletrack between Jasper Park Lodge and the Maligne Rd. Despite a couple of long steep climbs along the back of the golf course and on the way up to the top of Maligne Canyon this is a fairly flat ride which makes is a perfect trail for beginners. Expect to see all kinds of users out there, expecially horses (JPL runs trail rides along a section behind the golf course). This can lead to severe muddy sections after rainfall or early in the year when the frost is still coming out. The best part of this ride is the fact that there is a teahouse at the top of Malinge Canyon to refuel after a hard climb and there is plenty of bailouts along the way if you want to end things early on. ** this is a link to the official Parks Canada trail map. Its ok but really just serves as a rough guide. http://www.pc.gc.ca/pn-np/ab/jasper/activ/activ19_e.asp",
    "directions": "This ride starts right from the centre of Jasper at the intersection of Conaught Dr and Hazel Ave.  Follow Hazel across the railway tracks and south to the Hwy 16/93A intersection. On the south side of the Hwy 16 to the left of 93A you will see a rough double track that leads off into the trees. Follow the doubletrack down thru the trees untill it emerges beside the bridge at Old Fort Point. Head west across the bridge into the parking lot. Here you will see several trailheads. Ignore the trailhead behind the sign, it will connect with trail 7 but takes you thru a boggy horsetrail in the process. The one you are looking for is a rocky double track on the right hand side of the road leading north out of the parking lot right after the gate. Follow this trail up into the trees and follow it untill you come to a fork. Stick to the right and it follow it untill you emerge from the trees and another junction. You will see a narrow singletrack leading off the left. Follow this until the trail widens again and prepare to climb as it will lead you up and around the Jasper Park Lodge golf course. Be carefull on this section because you can run into horseback tours, bikers coming downhill, and hikers not paying attention to whats going on. After a few km of climbing and decending you will come around a rocky corner and across a wooden bride. Once past this bridge you will come across the junction of trail 7 and 7D. (7D is your first bailout and will take you back to Jasper Park Lodge) Stay to the right and follow the old doubletrack to the next junction of trail 7 and 4E. (bailout #2, taking you back to Lake Annette). Again, stay right and follow the doubletrack untill it comes out on a paved road. This is the old Maligne Lake road (bailout #3 taking you back to Lake Edith and eventually JPL). Look to the right and you will see a double track heading south into the trees. Follow this untill you see a small singletrack heading off the right. Take the turn here and it will lead you to a wide doubletrack that imediately starts to climb. This is the second monster climb on the ride. Follow the trail straight up untill you hit the skyline trail parking lot, cross the parking lot and continue climbing untill the trail emerges at the Maligne Lake Rd and Maligne Canyon teahouse. This is a good spot for a rest. The teahouse serves up coffee, cake, and  cold beer. You can also take a short walk around the top of Maligne Canyon and marvel at the giant limestone gorge (bikes are not allowed here so find a safe place to lock up). Once you are rested head off to the north end of the parking lot (big interepertive sign marks the trailhead) and CAREFULLY (lots of pedestrians here!!!) follow the trail down towards the bridge. Right before the bride you will see 2 trails. The trail to the imediate right is a horse trail, the one you want is labeled 7H and climbs up to the top of the ridge above the canyon. A short climb will reward you with a superb view of the Athabasca river valley, the Trident Range, and Yellowhead Pass. From here you are rewarded with sweet downhill as the trail twists and turns towards the bottom of the canyon, eventually deposit you back onto trail 7. Turn right and follow the trail along the Malinge river untill it spit you out at the 6th bridge. Cross the parking lot and find a sandy singletrack on the righthand side of the road that leads off into the forest along the Athabasca river. Follow this rolling single/doubletrack untill you emerge from the trees at Moberly Bridge  and head on up to Hwy 16 directly on the other side. Once you are across the highway you will see an unmarked rocky singletrack the climbs the bank up into the trees. This is called the Graveyard trail, a beautiful rolling singletrack that will lead directly back to Jasper without you having to ride the highway. When you emerge out of the trees beside the welcome to Jasper sign, you are home. Make your way up the road to the townsite and find the Ded Dog for a cold brew.",
    "geohash": "c3k",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/2691/long_jasper-2010-018-39275.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2691/long_jasper-2010-031-39275.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/trail-7-near-jasper-ab-2691",
    "stats": {
        "Activities": "hike ski-xc mtn-bike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "21 km",
        "Town": "Jasper, AB",
        "Type": "out-and-back"
    },
    "title": "Trail 7",
    "trail_id": "2691"
}