{
    "description": "Fundy Coast Multi day\nThere's nothing like a brilliant plan that comes together, and this one came tout suit over a scallop dinner less than a week prior to the go-date. The plan, in a nutshell, was to leave St. Martins, go past the entire Fundy Parkway, and the entire Fundy Foot path coastline, puting our longest distance to the edge of Fundy National Park, where it is boardered by Goose River. My friend Allan who routinely hikes the Fundy Foot Path in New Brunswick, had been dying to \"paddle the path\", taking it in from a marine perspective.  there's no better way to do that than by sea kayak!\nWith what would probably be the last big trip of the summer, it was late August and we were off Sunday morning from Charlottetown, headed for the community of St. Martins, NB. After around 4 hours driving, and a less than satisfactory fish n' chips lunch, we set to scouting a launch site. Our first option proved to be our last at the marine wharf, so after taking boats off the roof, and gearing up, we put paddles to the water at around 1PM. With a handful of gravel beaches as emergency landing options along the way, I felt our plan to paddle the region wasn't so fool hardy. Everything was there for our exploration. The weather was warm and sunny, a mild tail wind set us off, and we were bound for Cradle Brook.\nThe prettiest part of our journey was slated to be the section we were doing today. The plan was to poke along the coastal cliffs if the water conditions permitted. St Martins fames itself for its nearby sea caves, but they are nothing compared to what we were going to see along the way. It just proves to show that life is better by kayak.\nDay 1 Sunday 22K\nWith the tide coming in, we headed out from a small sheltered water near Mac's Beach in St. Martins. Harbored water is never the stuff to judge sea conditions, but as we turned left entering Quaco Bay, not much seemed to change. If you have ever paddled Fundy's water, you would know what to typically expect with its big swell and chop. Being the site of one of the world's highest tides, you will find strong currents, and at times chop from confusing seas and jutting geography. So this seemed unusually gracious, and had me wondering what the Fundy Sea Gods had in store for us later.\nWe passed Macumber Point and headed East-North-East to edge the coast in search of sea stacks and caves. This section offered the greatest eye-candy potential. The area is renowned for its dramatic tectonic aftermath caused by shifting plates around the Fundy fault line. The result is the beauty we see all along this coast. The rocks reveal a stratum of diagonal lines, layer upon layer of sandstone, basalt and other conglomerate material.\nWe discovered near Fownes Head a sea cave, and we explored right inside its narrowing cavity, taking several shots. Between there and Cradle Brook, we paddled along fallen car-sized boulder strewn shores, and tested our skills navigating between gaps in what poked out of the water. It truly was the highlight of the day. We did pass through the occasional spot of disturbed waters, especially where points jutted out into the current. On other occasions, you could see spells of choppy water just sitting there among a calm sea. Fundy waters do seem unusual, but paddling wasn't a problem.\nWe reached our camp site at around 6PM, and muscled our drybags inland and set up camp. Given my three trips to Alan's one, I certainly do need a lesson or two in gear reduction!\nAfter getting boats up beyond the tideline, I set in on making the evening's dinner of shrimp, curried and pan seared with a vegetable medley, and a white sauce with rice. With that and a bottle of vino, we were set for an evening by the camp fire. With cell phone access for up to date weather reports, Saturday was slated for overcast skies. Cell phone weather certainly was a nice feature to have on the trip, especially one where paddling is involved.\nIt was also the first time to try my new drybag, especially designed for food storage and safe tree-pitching. Like a kind of  party favor, mine was in the cool shape of a pink pig. At 25L, it can hold a lot of camp food!\nDay 2, Monday 40K\nWell it rained in the night, but well after midnight, and stopped before we woke up. Even the fly was dry that morning. What more could you ask for? With a more or less dry day ahead, and calm conditions, we decided to day-trip further up the coast, leaving our base camp where it lay. After a good meal of flavored oatmeal and spiked coffee, the boats were down brought to low tidal shoreline. We were off toward the border of the Fundy National Park, where the Fundy Foot Path draws to a close at Goose River.\nFrom the initial launch, we could see a distant landmark up ahead. That would be Martin Head; a solitary hill mass connected to shore by a 1 Km gravel bar. One can only dream up how that all came to pass, given the erosion, plate shifts and tidal currents. Along the 8K section, we came across several gouges in the rocky cliffscape carved out by rivers, creeks, and glaciers of old. Between our camp and Martin Head, there was Little Salmon River, Rapidy Brook, Wall Brook and Telegraph Brook. If you were to hike the trail associated with the coastal route, you would have to travel over and around these landmarks. This paddle trip gave us the good fortune that comes with water seeking level ground.\nAlong the way we encountered more rock gardens, and boxed beaches of coarse gravel. The weather was overcast skies with occasional drizzle. Fortunately it was more often off than on. With one break after the morning's launch, we were at Azor's beach by 2PM for lunch. There we found a cool rock pile left behind by a hiking party. Given that it was still standing like a deck of cards, I would guess that it was made on the weekend. We hadn't quite made our final destination of Goose River, but given the good nature of the water, and the way we anticipated the tides to turn in our favor, we decided to go for it and paddle the extra 2.5K to meet our goal of reaching the National Park. We found that doing distances like on these day trips, it gave me experience in estimating travel times. These were all loosely confirmed by my GPS's ETA feature, which was pretty cool.\nPaddling back to base camp was pretty much a B-line affair. We didn't bother skirting the shore, and thus hastened our return time. We returned just after six with only one rest stop behind Martin Head on a little gravel beach. I was quite surprised at how difficult it was to recognize Cradle Brook as we came upon it. The GPS said it was right there, but with the drizzly haze, land shapes, and maybe the angle of approach, I just wasn't seeing it until we were almost on its narrow shore.\nThat evening we ate Allan's pork stew and polished our remaining bottle of wine accompanied by campfire. Cell reception seemed to alude Allan's phone, so all reports from base camp came from mine. The weather for Tuesday would be rain, and all we could do was hope that it wouldn't start until we had our gear packed away.\nDay three Tuesday 22K\nThe tent Fly is dry. This is good! No rain that evening, and no rain so far that morning. We ate re-heated leftovers from Alan's stew, and seemed to forget about coffee. Breaking camp shortly after nine, and with both boats loaded, we attempted to launch our kayaks in a steady surf. The Fundy Sea Gods had awakened to answer the two day reprieve of calm conditions. With a few cresting swells in my launch attempt, I was sloshing around in the cockpit. I gave up trying to fight with the spray skirt, and paddled my way out to Allan. Rafting up, I pumped it the best I could. With cold water sloshing around my ankles, I would have to wait for a rest stop to empty it completely.\nThe route home was similar in rationale from the day before. Using Fownes Head as a point of reference, we paddled a straight line in the tailwind and following swell headed for home.\nAt times we had nice surf conditions, and at other times we had to concentrate on dealing with side and rear cresting wallops that would hit or burry  the nose or tail. Fortunately with no close calls, we made good time, assisted by a rising tide. We took a rest at the edge of Melvin Beach, where I finally got the slosh out of my boat. After a bit of a rest, we were back at it, rounding Fownes Head and aiming for Macumbers Point.\nWith plenty of water inside the small harbor at St Martins, the covered bridge was a welcoming sight, as we landed our crafts. The car was fetched, and in little time, we were loaded up and bound for a 2 O'clock lunch up the road. This time, it was a jumbo burger platter at a slightly different venue. The food was A-1. It was great to be back on land, and a great ending to our trip. Looking out the window from the restaurant, past the small sea caves and sandstone cliffs beyond Macs Beach, we laughed to see how calm the water had become.\nShannon Burt\nEast Coast Editor\nPS Although this was an unsupported trip, you can rent kayaks and take single to multi day tours from an outfitter right at the dock called River Valley Adventures.",
    "directions": "Heading towards Moncton on Route 2, take Route 1 to Sussex Corner, passing it and heading to St. Martins.",
    "geohash": "f81",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NB/2693/reg_1042edited.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/2693/reg_IMG_1009.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/2693/reg_IMG_1016.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/2693/reg_IMG_1018.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/2693/reg_IMG_1021.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/2693/reg_IMG_1058edited.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/2693/reg_IMG_1081edited.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/2693/reg_fixedskysml.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/2693/reg_martinhead.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/2693/reg_rockpile.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/2693/topo_IMG_1050edited.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/2693/narrow_IMG_1005.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/2693/narrow_IMG_1024edited.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/2693/narrow_IMG_1030edited.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/2693/narrow_IMG_1076.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/fundy-coast-nb-st-martins-near-sussex-nb-2693",
    "stats": {
        "Activities": "river-canoe sea-kayak",
        "From": "",
        "Seasons": "summer",
        "Stars": 5,
        "Time": "21 hrs",
        "Total Distance": "84 km",
        "Town": "Sussex, NB",
        "Type": "out-and-back"
    },
    "title": "Fundy Coast NB St. Martins",
    "trail_id": "2693"
}