{
    "description": "Elevation gain 600 m (2000 ft)\r\n\r\nGrizzly Den trail is an excellent access to the SugarBowl-Grizzly Den Park in summer and winter. The park has 3 cabins, 2 of them are accessed easily via this trail. \r\n\r\nThe first cabin is Mile 8 log cabin, and it is reached after 1.5km from the parking in about 30 minutes. The trail has been completely re-routed and constructed by the crew of Ken and Karen in August 2006, with a new bridge as well. Mile 8 cabin is an excellent place to spend a night, especially in winter. (there is a woodstove, but no cookstove or utensils) Winter access is a 10-13 km ski along the FSR.\r\n\r\nThe trail becomes narrow and overgrown past 8 Mile log cabin, as it winds through spruce balsam forest, through wet meadows, across several creeks, then ascends into timber to an A-frame cabin, called Grizzly Den cabin. The cabin is comfortable, sleeps 10-12 and has good firewood supply and a small cookstove (users must bring propane cylinders). A large pot is supplied for heating water but other utensils may not be available. \r\n\r\nThere is a small peak above the cabin and a ridgewalk will connect to the Raven Lake cabin trail. Trailhead to peak is 9 km with an elevation gain of 1050 m (3500 ft). Time to hike to the peak is about 5 hours return from the carpark.\r\n\r\n \r\nIn winter please check the Avaluator (Online Trip Planner) rating: Simple.\r\nMore trip planner route details \r\nhere.\r\n\r\n\r\n\r",
    "directions": "\r\nFrom Prince George travel east on Highway 16 for approximately 88 km to Hungary Creek Forest Service Road. About .3 kms past Hungary Creek, turn right on to the Forest Road and drive south keeping on the main road. Travel 13 km on the Forest Service Road to a clearing and trail sign. A parking lot is provided at the trailhead on the left.\r\n\r\nThe 3 cabins in the park are maintained by the PGBRS (Prince George Backcountry Recreation Society)  and donations are to be sent to them for cabin use, envelopes are provided. $10/night suggested donation.\r\n\r\n\r\n\r\nFor more info on the area trails, you can buy a copy of the \r\n\r\n\r\nPrince George and District Trail Guide \r\n\r\nfrom the Caledonia Ramblers Club, who organize many hikes and ski trips annually. \r\n\r",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/2702/reg_P7300723JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2702/reg_P7300726JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2702/reg_P7300731JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2702/reg_P7300732JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2702/reg_P8270385JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2702/reg_gdentrailjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2702/reg_mile8-ski.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2702/topo_gdenmap1jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2702/topo_mile8-ski.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2702/narrow_gdencabinjpg.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/grizzly-den-cabin-near-prince-george-bc-2702",
    "stats": {
        "Activities": "hike ski-bc",
        "From": "",
        "Seasons": "winter fall summer",
        "Stars": 3,
        "Time": "5 hrs",
        "Total Distance": "12 km",
        "Town": "Prince George, BC",
        "Type": "out-and-back"
    },
    "title": "Grizzly Den cabin",
    "trail_id": "2702"
}