{
    "description": "This is the spectacular new High Note trail on the south side of the summit of Whistler Mountain.\nThe Whistler mountain top hiking map says: 10 kms, 345 el change \"Provides unmatched alpine views of the Coastal Mountains. A mosaic of natural splendour that engages one's curiosity.\" I agree.\nThere are 3 ways of getting there:\n1) The really hard way: walk up the 16 kms from the village along Singing Pass to the Musical Bumps trail, and once west of the Flute summit, catch the trail on your left. It's 6 kms to the Peak from here. This also includes a steep climb to the Peak at the end. You'll probably be so tired by the time you get to the High Note trail you won't enjoy it. Budget at least 6 hours and make sure you reach the Peak by 4 pm or you'll have to walk down to the Gondola (it closes at 5) OR\n2) The easist way: Fork out $30 (less for kids and seniors) and ride the Gondola from the village and then the Peak chair to the Peak. Head west and down on the High Note trail. It circles around south and then east till it meets the Musical Bumps trail. From there, turn left (north) and head down to the Gondola (4.5 kms) or west again at the Burnt Stew trail and go back to the Peak (3 kms). OR\n3) The third way: Take the Gondola to the Roundhouse, and rather than taking the Peak chair, hike along trails 12 (Little Whistler Way) and 14 (Peak Road) to the Peak (total 3.2 kms, el gain 355 m), and then follow the High Note trail as described in 2) above.\nIt's preferable to do it counterclock wise as it has more downs than ups, especially the final climb to the Peak.\nSee the map and GPS data for directions. The attached GPS data is for 2). See Roundhouse to Peak for the GPS data for 3)",
    "directions": "Get to Whistler, go to the Gondola base, and either take the Gondola or the Singing Pass trail.",
    "geohash": "c2bs",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/2703/long_-birthday-week-050-17033.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2703/reg_WHN1361.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2703/long_5-Point-Mule-Deer-on-High-Notes-17033.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2703/long_Mule-Deer-on-High-Notes-Aug-3rd-08-17033.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2703/reg_-birthday-week-062-17033.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2703/reg_IMG-0048-25237.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2703/reg_WHN1365.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2703/reg_WHN1372.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2703/topo_WhistlerMtnMap2006sm.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2703/narrow_best1_WHN1368.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/whistler-high-note-near-whistler-bc-2703",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 4,
        "Time": "4 hrs",
        "Total Distance": "10 km",
        "Town": "Whistler, BC",
        "Type": "out-and-back"
    },
    "title": "Whistler High Note",
    "trail_id": "2703"
}