{
    "description": "NTS Map:92F13.  With an elevation gain of 1800 meters, King's Peak (2065 Mtrs) makes for a long day hike but once you are on the top it all becomes worthwhile.  The entire hike should take between 10-12 hours and is 15 kms long. No technical climbing is required for this route but there is quite a bit of scrambling on some screerocks and up a gully. If it is a hot day, at the upper bowl there is a stream to replenish your water supplies.  The first 15 minutes of the trail gives your legs a chance to warm up and then the incline begins.  There are very few areas that are level on this hike.  The lower portion of the trail is extremely well maintained, with lots of stairs and well made switch backs.  From the halfway mark you will be following the worn path, the occasional flagging and rock cairns.  From the top, the views of the surrounding peaks are fantastic and you can see right down into Iceberg Lake.  But the real beauty from up here is looking right at Elkhorn Mountain, which feels like it is only a stones throw away.  Truly awesome!!!  If a 10-12 hour hike is not to your liking you can also do this as a two day backpacking trip, with camping spots at one of the two bowls.  But be prepared to sweat a lot on getting to your camping destination.  If you should run out of steam, you can have your lunch either on top the Ramparts with beautiful views or on top of the Queen's Face or just past the Queen's Face for views of Elkhorn Mountain.These directions will take you up King's Peak the hikers route.  From the trail head, head up the trail and in about 20 minutes you will get to the power lines.  Admire the nicest trail sign for King's Peak and cross the bridge.  The trail for the next hour is well maintained with lots of switch backs and steps.  Take a short break at the first waterfall.  From the waterfall it will take about 35 minutes to get to a stream crossing.  If the water level is high you might have trouble here, just look for the best spot and pick up the trail heading upstream.  Keep the stream on your right.  In about 20 minutes you will come to a waterfall, cross the stream, head upwards and cross the stream again.  Follow the trail along the stream.  In about 30 minutes you will have to cross the stream again at a big bowl.  Head towards the prominent gully.  For here to the gully should take you about 30 minutes.  From the top of the gully enjoy the views for a bit and pick up the trail heading over the ramparts and heading rightish around Queen's face.  Once you start navigating around the Queen's Face, look for rock cairns to lead you.  Once you get to the saddle between Queen's Face and King's peak follow the trail up to King's Peak, this should take only about 20 minutes.",
    "directions": "Take highway 28 to Gold River.  Just past Lady Falls Picnic site, you will notice a sign for Elk River Viewpoint.  On the left you will see an overgrown rough road, if you have a 4x4, you can take this road and cut about 30 minutes off the hike.  Unfortunately I don't know the condition of the road.  For the rest of us with 2wd, just a bit further, you will see on the left a sign for King's Peak.  Follow this 1 km dirt road to the trail head.  From Courtenay it takes about 1.5 hours to get to the trail head.",
    "geohash": "c0ye",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/2706/reg_IMG_2756_Large_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2706/reg_IMG_2763A_Large_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2706/reg_IMG_2766_Large_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2706/reg_IMG_2770A_Large_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2706/reg_IMG_2773_Large_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2706/reg_IMG_2792a_Large_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2706/reg_IMG_2795A_Large__best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2706/reg_IMG_2800a_Large_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2706/reg_IMG_2810_Large_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2706/topo_IMG_0885A_Large_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2706/narrow_IMG_2757_Large_.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/kings-peak-near-campbell-river-bc-2706",
    "stats": {
        "Activities": "climb hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 5,
        "Time": "10 hrs",
        "Total Distance": "15 km",
        "Town": "Campbell River, BC",
        "Type": "out-and-back"
    },
    "title": "King's Peak",
    "trail_id": "2706"
}