{
    "description": "NTS Map:92F11 This is a very easy hike to Divers Lake and Rossiter Lake in Strathcona Provincial Park.  For you anglers these two lakes provide access to some nice quiet fishing lakes, for us hikers the views from Divers Lake of Mt. Brooks and Strata Mtn are really nice.  This is a loop hike that takes only a couple of hours, 7 kms long and basically flat for the entire hike.  Proper waterproof footware is ideal as there are some wet areas to navigate aroundthrough.  The trail is sparsely marked and you will be following a well worn path for the most part.  The GPS route is worth having for this hike.\r\n\r\nFrom the parking area, follow the road over a bridge and past a steel fisheries building on your right.  In about 10 minutes you will know you are heading the right direction if you pass a Strathcona Park sign.  In another 10 minutes you will come to the end of the road.  You will notice that there are two trails here, take the left trail (you will be coming back on the right one).  The path for the next 30 minutes is well worn and takes you to Divers Lake.  The trail for the next little while is around the lakes edge.  If the lake level is high you will have to bushwhack around the lake.  Otherwise tread carefully along the rocks that line the lakes edge.  Follow this until you get to the stream draining the lake, jump across and pick up the trail on the other side.  This portion will take you to Divers Meadows.  In about 15 minutes you will be in the meadows.  Head right around the large tarn and keep going around the large cluster of trees.  Follow the trees until you come to a large pond, here make a left and keep the trees on your left and the pond on your right.  Follow the shoreline until you come out to a large open area.  Head across the open area and pick up the same trail that got you here.  Once you get to the stream draining Divers Lake, get yourself across.  This portion of the hike is a little more difficult and you need to pay closer attention to trail looking for sparse flagging.  Having just hopped across the stream you will notice a faint trail straight ahead of you through the bushes.  Follow this trail and in a while you will come to a log crossing.  From the log crossing you are 5 minutes from Rossiter Lake.  Cross the open grass lands to the lake, this area can be very wet at times.  At the lake head right and pick up the trail through the woods.  In a little while you will come out to the road.",
    "directions": "To get to the trailhead head towards Mount Washington Ski Resort. Take highway 19 and turn onto Strathcona Parkway. The road is paved and follow it until you can make a left turn for Raven Lodge. Follow this road all the way until you get to Raven Lodge.  Keep going and you will see a dirt road.  Head down this road until you can make a left on the road (in a few minutes).  Follow this road downwards for at least 5 minutes, until the road starts to bend to the right.  You will notice a road on your left here, park in the small area.  If you see a wooden bridge up ahead with a steel shack on your left, you are in the right spot.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/2710/reg_IMG2821aLargeJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2710/reg_IMG2824aLargeJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2710/reg_IMG2825Largejpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2710/reg_IMG2827Largejpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2710/reg_IMG2828aLargeJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2710/reg_IMG2840aLargeJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2710/reg_strathcona1-20083.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/divers-lake-near-courtenay-bc-2710",
    "stats": {
        "Activities": "snowshoe hike",
        "From": "",
        "Seasons": "winter fall summer",
        "Stars": 2,
        "Time": "2 hrs",
        "Total Distance": "7 km",
        "Town": "Courtenay, BC",
        "Type": "out-and-back"
    },
    "title": "Divers Lake",
    "trail_id": "2710"
}