{
    "description": "NTS Map:92F1.  The top of Mt. Benson (1019 Mtrs) in Nanaimo gives great views of the Straight of Georgia, the Coast Mountains and the surrounding mountains behind Mt. Benson.  There are many routes up Mt. Benson, this one starts at Witchcraft Lake, takes about 4 hours and is 8 kms long (round trip).  The lower portion of the route is well worn, steep in sections and flagged in places but care must be taken to not wonder off the path do to the many paths all over the place.  Hiking poles are a real asset here because the path is hard packed dirt that you can easily loose your footing on if you build up too much speed.  The upper portion of the route is well worn and very straight forward.  Close to the top there is one steep section that has a rope to assist you up.Pick up the trail at the end of the road, which proceeds around Witchcraft Lake (looks more like a pond).  In about 5 minutes you will be making a left over a bridge or across some logs.  Go straight and look for a trail that heads up on your right, a sign marked Mt. Benson is nailed to a tree.  In about 20 minutes the trail heads left up some steep terrain.  Keep moving and in 25 minutes you will come to a sign pointing to Mt. Benson to the right.  The trail then takes you to a rock pile in 10 minutes, head right.  In 5 minutes you will come to an old logging road with a large rock cairn on it, make a right here and head up the logging road.  In another 5 minutes you will come to another rock cairn, hang a left here and look for an orange blaze.  In 5 minutes or so, you will see a flagged path on your left, ignore this.  After 10 minutes of heading upwards, you will come to the rock face with the rope.  After scaling the rock face, it will take you about 10 minutes to come to a logging road, hang a left here.  Follow the trail upwards and in about 20 minutes you will be on top of Mt. Benson.  Sit back and watch the action down in Nanaimo.",
    "directions": "To get to Mt. Benson take Jinglepot road to Kilpatrick.  Hang a right onto Bensonview Road.  Follow this road right to the end and park along the side of the road.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/2711/longBenson-Summit-Viepoint-360-13755.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2711/long_Benson-Low-Viewpoint-Panorama-13755.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2711/reg_IMG2848aLargeJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2711/reg_IMG2849Largejpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2711/reg_IMG2858Largejpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2711/reg_IMG2861Largejpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2711/reg_IMG2865Largejpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2711/reg_IMG2875Largejpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2711/reg_IMG2876Largejpg_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2711/reg_IMG2878Largejpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2711/reg_Mount-Benson-July-20-2008-005-16516.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mt-benson-near-nanaimo-bc-2711",
    "stats": {
        "Activities": "mtn-bike hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 3,
        "Time": "4 hrs",
        "Total Distance": "8 km",
        "Town": "Nanaimo, BC",
        "Type": "out-and-back"
    },
    "title": "Mt. Benson",
    "trail_id": "2711"
}