{
    "description": "Before now, this trail has never been described in any hiking trails book or on any website that I know of, which is quite amazing, because it's definately one of the best trails in Nova Scotia. It climbs to the top of the highest mountain in the province. It's not the highest point, but it is the highest mountain from base to top. It's not attached to a long ridge or on top of a big plateau, it's its own mountain. The trail follows the ridge on the right side of the mountain.\r\rAfter parking your car, start up the trail, you start climbing almost immediately, it's a steady climb all the way to the top. The trail is well defined and well marked where it needs to be, so it should be easy to follow.\r\rOnce you reach the top, after about a kilometre and a half of climbing, you can either turn left or right, to the left is a lookoff with great views of the Aspy Fault plateau below you, the ocean, the beach at Cabot's Landing, the nearby village of Dingwall and the plateau of the national park in the distance, there's also a plastic jar under a tree where you can sign your name on a piece of paper and say what you thought of the trail. To the right is another great lookoff, this one looks down over a different part of the Aspy Fault plateau to Bay St. Lawrence, on very clear days, you may even be able to see Newfoundland as well. Enjoy the hike!!!\r\rBe sure to bring water as you may need to take breaks along the way.\r",
    "directions": "Take the Cabot Trail to Cape North village and turn off toward's Cabot's Landing provincial park, after passing the park entrance, keep an eye out on the left for the trail head, which is marked with orange flagging tape and two yellow stones. If you pass the sign for Bay Road Valley, you've gone too far.",
    "geohash": "f8",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/2715/reg_image-45998.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/wilkie-sugarloaf-near-ingonish-ns-2715",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 5,
        "Time": "2 hrs",
        "Total Distance": "3 km",
        "Town": "Ingonish, NS",
        "Type": "out-and-back"
    },
    "title": "Wilkie Sugarloaf",
    "trail_id": "2715"
}