{
    "description": "Home of  The Canada games (I think I saw?) and many local XC MTB races, this is an unexpected gem in the middle of the prairie.  I don't remember most of the route names other than Discotech and the Toilet Bowl but there is many, many lines that can be combined to make a trail of your required distance.  We did about 8km but you could easily make 20+ out of it without getting bored.It is a relatively small area, probably only a few square km, but it makes good use of the banks of the valley and coulees it sits in.  There are a couple serious, twisty downhills (not real long, this is SK after all) that got the adrenalin going.  In all there were 5 or 6 sections that, if I wasn't trying to keep up with a local rider I met in the parking lot, would've made me think twice about taking them at at the speed I did.  (Thanks again for the tour Darren!)There seems to be a dedicated group that maintains it (I'm not from there, just passing through) as it was squeeky clean, well groomed and the logs and other obstacles have been recently replaced.",
    "directions": "Go NW of Regina on HiWay #11 about 10.5km past where it turns off of Albert (#6).  Turn West on secondary HiWay 734.  At 7.7km where the HiWay takes a hard right to the N, go straight (watch for cars as I KNOW you'll be thinking of singletrack) down the gravel road.  Another  1.8km (around a couple left hand turns) and you will find the well marked parking lot.  There are a few signs on the way so you won't get lost.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/SK/2717/reg_2jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/SK/2717/reg_3jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/SK/2717/reg_4jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/SK/2717/reg_5jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/SK/2717/reg_6jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/SK/2717/narrow_1jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/SK/2717/narrow_Ivan1.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/wascana-trails-provincial-recreation-site-near-regina-sk-2717",
    "stats": {
        "Activities": "snowshoe hike ski-xc mtn-bike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "15 km",
        "Town": "Regina, SK",
        "Type": "out-and-back"
    },
    "title": "Wascana Trails Provincial Recreation Site",
    "trail_id": "2717"
}