{
    "description": "The Stein Valley is one of the last untouched watersheds in the southwestern part of British Columbia. The enormous 107,191-hectare Stein Valley Nlaka'pamux Provincial Park encompasses a wilderness area known for its spectacular scenery and important historical, cultural and spiritual values. This is a user-maintained area, with 150 km of hiking trails and routes, four cable crossings, a suspension bridge and several wilderness campsites.  The Stein Valley Mid-traverse starts at Blowdown pass and exits where the Stein meets the Fraser River just north of Lytton.\nBlowdown Pass (Mid-Valley Traverse) is one of the approaches used when hiking into Stein Valley Nlaka'pamux Provincial Park. Hikers are assisted by a logging and mining road that leads 9 miles (15 km) to the pass from Hwy 99 and then descends towards Cottonwood Creek. Plan on taking four to five days to complete the 32-mile (52-km) moderately difficult hike from Blowdown Pass to the Stein trailhead near Lytton. For those with their sights set a little lower, there's amazing alpine hiking around Blowdown Pass itself. Gott Peak (elevation 8,350 feet/2,545 m) is an easy 2.5-mile (4-km) round-trip scramble from the pass. However, watch the loose footing and also the weather, which is prone to change quickly. Amazing views of surrounding peaks and wildlife are guaranteed on most days.",
    "directions": "The park lies west of Lytton and approx. 185 km southwest of Kamloops or 290 km northeast of Vancouver, both via the #1 Highway. The main trail head is located on the west side of the Fraser River by Lytton, accessed by crossing the Lytton Ferry. After disembarking from the ferry, follow the road to the right for 4.8 kilometers to the junction with the Stein Valley Road (marked). Turn left and follow it to the parking lot. Other trail heads for accessing the Park are located at Lizzie Lake, Blowdown Pass and Texas Creek. \nBlowdown Pass is one of the approaches used when hiking into Stein Valley Nlaka'pamux Provincial Park. Hikers are assisted by a logging and mining (a small white sign 8\" x 16\" stating \"BLOWDOWN\") road that leads 9 miles (15 km) towards the pass from Hwy 99 and then descends towards Cottonwood Creek.  You can (could) drive a 2WD vehicle up the first 10 km. There is a small area accomodating about 8 vehicles where the 2WD portion ends. The road from there has large boulders, ruts, etc.  The last 5km of the logging road leading up to the pass require either very serious 4x4 or ATV but its too nice a hike to ride. There is a very nice campsite at a small lake just before the park. If you are an Ontario lowlander (like me), give yourself time to adjust to the altitude or you'll get a great head rush (or blackout) as your body deals with the lack of oxygen.  No motorized vehicles allowed in the park.  We left a vehicle at the Lytton Trailhead and had a second vehicle drop us off at the 10km mark on the Blowdown logging road.",
    "geohash": null,
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/2720/reg_IMG-1852-33605.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2720/reg_IMG-1856-33605.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2720/reg_IMG-1999-33605.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/stein-valley-blowdown-pass-traverse-near-pemberton-bc-2720",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 5,
        "Time": "28 hrs",
        "Total Distance": "55 km",
        "Town": "Pemberton, BC",
        "Type": "out-and-back"
    },
    "title": "Stein Valley Blowdown Pass Traverse",
    "trail_id": "2720"
}