{
    "description": "Mount Richardson (August 26th, 2006): El. Camp: 2,208 m (7,243 ft), El. Summit: (3,090 m) 10,136 ft, Elevation Gain: 882 m (2,893 ft) Distance: 7 km round trip from Hidden Lake; 7,.9 kms from Fish Creek Parking area to Hidden LakeTime: 6.5 hours from Hidden Lake, Difficulty: Class II (II)MM Mount Richardson is the highest peak in the Skoki area and the views from the summit do not disappoint. The easiest ascent route is via Hidden Lake, which is a 2.5 hour hike in from the Fish Creek Parking area at Lake Louise. I hiked solo to Hidden Lake the previous evening, rendezvousing with some other people from the Chinook Outdoor Club from Lethbridge who had arrived in the area before me. The first hour of the route in from Lake Louise is kinda boring. The route follows a dusty, dirt road that is barricaded to public use but had more than a couple of gravel trucks driving back and forth as they are continuously performing road work. The route to Hidden Lake is also the first leg of the trail leading to Skoki Lodge, described elsewhere on Trailpeak. Hikers pass through the bottom of the ski hill, which was resplendent with fireweed in full bloom as I made my way. I arrived at the campground at 6:30 PM, singing away at the top of my lungs to alert any bears in the area. Much to my chagrin, the campground was full and much closer to the Skoki Lodge trail than I thought, and thus I received a comment or two from some of the other campers on my rendition of Harry Belafonte's Â?The Banana Boat song'. (Daaaay-oh!) There is a historic log cabin along the trail, known as ?Halfway Hut' just before the campsite that is worth checking out. The most straightforward way up Richardson's summit is to by the west ridge. At Hidden Lake, there is a faint trail that leads towards a low saddle on the ridge, although my hiking group chose to beeline to the ridgetop via a drainage. This is a popular scramble and is described in some detail in Alan Kane's Scrambles book. Once on the ridge, a discernible path is found that can be followed. The trail skirts around some of the difficult cliffy spots. Near the top the route is a bit of a slog as you chug-a-lug your way up some large scree. At the summit there is the biggest summit cairn I have ever seen. This is a truly impressive structure! At the time of our summit, it was over 8 feet tall and I was able to use the cairn as a camera tripod to take some group photos. The true summit is actually a few minutes further afield along the ridge. From the true summit, you can look back at the north face of Richardson and appreciate the glacier that extends from the summit to the lakes below. A note on access: (2006) there was a parks summer student conducting a very detailed survey with trail users and from what we could tell, the park is investigating grizzly bear migratory corridors and would like to restrict access to the Skoki trail by requiring hikers to take a shuttle only at certain times of day from Fish Creek to the true trailhead at the ski hill. Check with the Banff website in future years to find out if this restriction ever ?flies'.",
    "directions": "Take turnoff from highway to the Lake Louise downhill ski hill. Turn off to the Fish Creek Parking area and hike up the barricaded access road.",
    "geohash": "c3jk",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/2729/reg_DSC04630JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2729/reg_DSC04642JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2729/reg_DSC04647JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2729/reg_DSC04649JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2729/reg_DSC04653.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2729/reg_DSC04665.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2729/reg_DSC04668.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2729/topo_mtrichardson1jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2729/narrow_DSC04624JPG.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mt-richardson-near-banff-ab-2729",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 5,
        "Time": "8 hrs",
        "Total Distance": "7 km",
        "Town": "Banff, AB",
        "Type": "out-and-back"
    },
    "title": "Mt. Richardson",
    "trail_id": "2729"
}