{
    "description": "Map Ref: 82J07We got exceedingly lucky on this ride.  A late September weekend, an amazing 22C day with no clouds and even better no Grizzlies.  The colors of the trees were just about as good as you can hope for in Alberta, maybe another week or two will be the peak season.This trail was very pleasant.  190m of climb in 8.5km is quite doable by most people.  There are great views as you ride along the edge of a serious valley.  It had rained a bunch in the previous week and there were a few mud puddles to splash around in.  There is a fording of the Highwood River required at about km 2.5 so that'll give you a chance to wash down the legs, but don't go too deep or there will be serious shrinkage.  Because of the fording, this should only be tried at manageable water flow rates, mid-summer to fall.This can be extended all the way up to the Lake of the Horns (see separate trailpeak entry).  Just add another 3 or so km and +400m of elevation change.  Push, pull, drag & ride your bike as far as you can up this trail, it's a great, twisty, bush slapping downhill coming back.Once you leave the parking lot, head past the weather station, ford the Highwood, then at the first noticeable major Y, go right, after that it s all self explanatory.  Along the trail, you'll see lots of mini Ys in the road, they all link up so take either.This trail is near (42km North and 100m higher than McPhail)",
    "directions": "SW of Calgary, 85km at a bearing of 215 degrees.  You're looking for the Cat Creek Provincial Recreation Area (Equine).  From the North, go W on #1 to Hi-way #40 and drive about 102km S, Cat'll be on your right.  The Southern approach is to go W on #22X, then S on #22 until you get to Longview.  Back up 300m and go W on 541 about 42km until you get to the Highwood Junction (#541, #40, and #Forestry Trunk Road).  Keep going on the pavement back up North about 5.2km and you're at Cat Creek.  Find a parking spot.Trail head starts at North end of parking loop, at end of equine uses parking area.  Go around the locked gate and down the sorry excuse for a road (but a good example of a MTB path).NOTE:  This section of hi-Way #40 (from the Highwood Junction up to Peter Lougheed Park) is closed from Dec 15 to June 15 (or there abouts) to let the Elk and the Sheep do their thang.  It's probably too snowy or too much water flowing then anyways.",
    "geohash": "c2yq",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/2734/long_profile.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2734/reg_2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2734/reg_3.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2734/reg_4.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2734/reg_DSC01869-Medium-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2734/reg_DSC01870-Medium-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2734/reg_DSC01989-Medium-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2734/reg_best1_1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2734/topo_plan.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2734/narrow_5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2734/narrow_DSC01992-Medium-6828.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mcphail-creek-trail-near-kananaskis-ab-2734",
    "stats": {
        "Activities": "hike ski-xc mtn-bike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 4,
        "Time": "4 hrs",
        "Total Distance": "20 km",
        "Town": "Kananaskis, AB",
        "Type": "out-and-back"
    },
    "title": "McPhail Creek Trail",
    "trail_id": "2734"
}