{
    "description": "Elevation gain 450 m (1500 ft)The Raven Lake trail ascends steeply through old growth spruce forests to alpine meadows and an A-frame cabin. The Raven Lake trail is very wet, slippery, and steep, especially in winter. But the trail crew is out there Aug-Sept 2006 to re-route the trail and improve it. So by this winter and for next summer there will be a very nice trail to access this cabin. From the cabin hiking and ski touring is possible to Susie's Peak, Raven Peak, Pat's Pass and Leprachaun run. It is possible to continue from here to visit the other 2 cabins in the Sugarbowl - Grizzly Den Provincial Park via the  Raven Lake to Grizzly Den Cabin Circuit. The trail heads around the ridge on the east side of Raven Lake and follows the east side of Raven Mountain. The trail then descends below Jacqueline Rose Ridge, heading through Pat's Pass and then to the Grizzly Den cabin. Return to the Mile 8 cabin and parking lot via the Grizzly Den trail. This will be about a 25 km circuit, over 2 days. In winter please check the local avalanche conditions and bulletins.",
    "directions": "From Prince George travel east on Highway 16 for approximately 88 km to Hungary Creek Forest Service Road. About .3 kms past Hungary Creek, turn right on to the Forest Road and drive south keeping on the main road. Travel 13 km on the Forest Service Road to a junction and sign. Turn right and travel an additional 2.6 km past the Grizzly Den trailhead to the Raven Lake trailhead parking lot. In winter the road is not plowed, so ski access adds another 15km to get to this trailhead. The 3 cabins in the Sugarbowl - Grizzly Den Provincial Park are maintained by the PGBRS (Prince George Backcountry Recreation Society)  and donations are to be sent to them for cabin use, envelopes are provided. $10/night suggested donation.For more info on the area trails, you can buy a copy of the  Prince George and District Trail Guide from the Caledonia Ramblers Club, who organize many hikes and ski trips annually.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/2741/reg_012-20518.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2741/reg_DSCF0940-20518.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2741/reg_P7300704JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2741/reg_P7300706JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2741/reg_P7300720JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2741/reg_P7300730JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2741/narrow_P7300705JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2741/narrow_gdmap0JPG.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/raven-lake-near-prince-george-bc-2741",
    "stats": {
        "Activities": "hike ski-bc",
        "From": "",
        "Seasons": "winter fall summer",
        "Stars": 3,
        "Time": "4 hrs",
        "Total Distance": "10 km",
        "Town": "Prince George, BC",
        "Type": "out-and-back"
    },
    "title": "Raven Lake",
    "trail_id": "2741"
}