{
    "description": "NTS Map: 092G14\r\nThis Trail leaves Alice Lake climbing the Debeck's Hill FSR from the south end of the lake.  This loose gravely road climbs steeply for about a kilometre.  \r\nCrouching Squirrel is the first obvious single track leaving the left side of the road.  It contours the slope for a while, passing the entrance to Mid-Life Crisis on the left, then the exit to Rigs In Zen on the right, before dropping steeply down to Hop Ranch Creek.  A number of steep rock rolls and some fast loose sections give this trail a pleasing level of excitement. \r\n\r\nAt the bottom of the trail, a left turn across a small bridge, followed by a brief hike-a-bike will reconnect you to Jack's Trail.  Heading left on Jack's will get you back to Alice Lake.\r",
    "directions": "\r\nThis trail can accessed from the south end of Alice Lake.  The Alice lake is a few kilometres north of squamish, on the east side of the hwy.  Turn off the Alice Lake road past the rangers booth into the camp ground, and park at the far end of the lake. \r\nAn alternate loop is to approach Jack's trail from Garibaldi Highlands.  Turn off the hwy on east on Garibaldi Way, go left on Skyline Drive, following it through onto Braemar Dr, turn right on The Boulevard, then left onto Perth Drive, taking it all the way to the end.  Just before the end on the left is the start of Lumberjacks trail.  Ride this to it's end, then right  briefly onto the north end of Trestle Trail then left on  the FSR. Jack's trail is the first obvious hiking trail starting less than a kilometre on your left.  There's a sign about 150m into the trees.  This will take you to Alice Lake.\r\n\r\nCurrent Conditions:\r\n\r\n\r\n\r\n    \r\n        \r\n      \t\r\n\r",
    "photos": [],
    "source_url": "https://trailpeak.com/trails/crouching-squirrel-hidden-monkey-near-squamish-bc-2745",
    "stats": {
        "Activities": "mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "4 km",
        "Town": "Squamish, BC",
        "Type": "out-and-back"
    },
    "title": "Crouching Squirrel Hidden Monkey",
    "trail_id": "2745"
}