{
    "description": "NTS Map: 092G11/092G14\r\nThis smooth flowing trail is one of the standards that typify the old school style of riding still to be found around Squamish, and will suit the intermediate rider.\r\n\r\nRide your bikes a few kilometres up the road past from the car, past Quest University, taking the second forest service road (Ring Creek North FSR) on the left. Pass the SORCA shelter until you reach a sharp right hand switch back. The lower section of the Skookum trail leaves the road left from the corner, dropping steeply down for 100m, crossing a high roped log then up to another FSR. Stay right on the FSR at the top, and take the upper Skookum trail on your right.\r\n\r\nFrom there you can either turn around and ride back the way you came, or go left onto Middle PowerSmart, or off that onto IMBA Smart.\r\n\r\nIf you're still hungry for more at the bottom of lower Skookum, you can continue with the moderate drops of upper and lower Pseudo Tsuga.  Flat Alley, a straight loose dirt bike trail, will get you back onto Garibaldi Park Road.  Heading right back down the hill will get you back to your car.",
    "directions": "This description describes a moderate loop that starts and ends at the Carpenter's Son Bridge car park on the Garibaldi Park Road\r\n\r\nA short way north of Squamish, turn east off Hwy 99 at Mamquam Road (Canadian Tire). At the end the road becomes a dirt road called the Garibaldi Park Road. Follow this along a few kilometres until a hiking trail crosses the road, with space for parking on the right.\r\n\r\nCurrent Conditions:\r\n\r\n\r\n\r\n    \r\n        \r\n      \t\r\n\r",
    "geohash": "c2b",
    "photos": [],
    "source_url": "https://trailpeak.com/trails/skookum-near-squamish-bc-2749",
    "stats": {
        "Activities": "mtn-bike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "0 km",
        "Town": "Squamish, BC",
        "Type": "out-and-back"
    },
    "title": "Skookum",
    "trail_id": "2749"
}