{
    "description": "Cypress Falls is a relatively easy hike/walk to a spectacular canyon featuring shooting water falls.  A good lower elevation hike, it is an easy West Vancouver destination for families and those out for an easy hike.\nThis is an ideal Spring time hike as it is below the snowline, and, perfect any time of the year in fact.  Most people are not as familiar with this part of Cypress Provincial Park but it will delight the local and visitor alike with it's waterfalls, and pockets of old growth trees.\nIf you use the map on trailpeak, you will note that you are making your way to Cypress Creek. Once you cross the creek (wooden bridge) you have Cypress Falls on the left, and a whole network of trails for eploring the creek at higher elevations.  Some of the larger trees in the area that you will see on your descent to the falls are over 400 years old and have survived indiscriminate logging in the area some seventy or eighty years ago.  Lots of ferns, fir, and cedar, typical of the Northwest raincoast.\nWandering the network of trails in the area can take a few hours, and you can hike upwards for a while before coming back down to see the falls, however, the falls can be reached in just a half hour for those who want to get there first.\nA good place to park is at the first switchback on the road to the Cypress Bowl ski area.  Driving from Vancouver, exit the upper levels Hwy 99 when you see the sign for Cypress Bowl Ski area.  Drive past the \"Deer Ridge\" condos on the left, and, into the park, passing by the maintenance yards on the right.  Continue on to the first switchback, and looking to the left, you will see a small parking area.  From there, follow to the second point (not labelled, visible as a yellow dot) on the attached map, along a paved service road.  As you climb the paved road somewhat, for a kilometer or so, you will see a sign simply marked \"trail\" on the left.  Follow this another kilometer or so, until you descend and cross the creek using a wooden bridge.  If you stay immediately left, you will see a fence, and the small trail next to it leads you directly to the falls (see vicinity of point 5).  If you follow our markings (points 7, 9, 12, 15, 19 on our map) you get a bit more of a hike, and the circular route brings you back to the falls.  After point 19, continue down the switchback on the trail until you hear the roar of rushing water get louder. You will see a wooden fence keeping you off the ledge of the canyon.  Very impressive.\nIf you click on \"Download GPS\" you will see a nice preview of the GPS points. If you have a GPS unit, you can download this file into your unit, and compare as you walk -- although this trail is not that hard to find, the entrance is a bit tricky.",
    "directions": "See description and / or GPS",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/275/reg_Cypress-Falls-hike-036-6103.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/275/reg_best1_Cypress-Falls-hike-015-6103.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/275/reg_vic.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/275/topo_Cypresstopo.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/275/narrow_Cypress-Falls-1-17260.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/275/narrow_Cypress-Falls-10-17260.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/275/narrow_Cypress-Falls-4-17260.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/275/narrow_Cypress-Falls-hike-017-6103.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/275/narrow_IMG-2502-18182.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/275/narrow_best2_Cypress-Falls-hike-011-6103.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/275/narrow_falls.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/275/narrow_kt.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/cypress-falls-near-vancouver-bc-275",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "4 km",
        "Town": "Vancouver, BC",
        "Type": "out-and-back"
    },
    "title": "Cypress Falls",
    "trail_id": "275"
}