{
    "description": "This intermediate trail provides a quick loop that will give you a taste of what Squamish's trails have to offer.  There are no drops or high built structures, so this is a trail most people can have a go at.\r\n\r\nFrom the Carpenter's Son Bridge car park, ride further up the Garibaldi Park Road, past the new Quest University, then take the second forest service road (Ring Creek North FSR) on the left.  A few kilometres along this you'll come across what looks like a bus stop, the SORCA shelter.\r\n\r\nThe first stretch of Pseudo Tsuga drops off down left just before the shelter.  At the bottom you'll drop out onto another forest services road.  Head back left, past the entrance to High & Dry.  \r\n\r\nThe second  single track entrance on your left is the lower section of Pseudo Tsuga, a little steep, though smooth, to start, but it mellows out pretty quickly.  This will drop you onto a short dead-end stretch of trail which opens onto another FSR.\r\n\r\nHeading left will get you back to Garibaldi Park Rd, passing an optional third newer drop to Pseudo Tsuga that connects mid way to Flat Alley, or you can heading left and drop down Flat Alley from it's start.\r\n\r",
    "directions": "\r\nThis description describes a moderate loop that starts and ends at the Carpenter's Son Bridge car park on the Garibaldi Park Road\r\n\r\nA short way north of Squamish, turn east off Hwy 99 onto Mamquam Road at Canadian Tire. At the end the road turns into a dirt road called the Garibaldi Park Road. Follow this along a few kilometres until a hiking trail crosses the road, with space for parking in front of a few large boulders on the right.\r\n\r\nCurrent Conditions:\r\n\r\n\r\n\r\n    \r\n        \r\n      \t\r\n\r",
    "geohash": "c2b",
    "photos": [],
    "source_url": "https://trailpeak.com/trails/pseudo-tsuga-near-squamish-bc-2750",
    "stats": {
        "Activities": "mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "7 km",
        "Town": "Squamish, BC",
        "Type": "out-and-back"
    },
    "title": "Pseudo Tsuga",
    "trail_id": "2750"
}