{
    "description": "Starting elevation (Hidden Lake): 2,207 m (7,243 ft) Summit elevation:  2,941 m (9,649 ft)Distance: 11 kms (roundtrip from Hidden Lake)Note: 7.9 kms from Fish Creek Parking to Hidden LakeTime: 5.5 hours from Hidden LakeFossil Mountain is not a difficult scramble but still a moderately strenuous undertaking due to the elevation gain and distances involved.From our campground at Hidden Lake, the Skoki Lodge trail ascends gently to Ptarmigan Lake. The trail skirts around the North side of the Lake and soon we found ourselves on top of Deception Pass. Instead of dropping down the other side of the Pass to Skoki Lodge, we started the long grunt up towards the top of Fossil Mountain by hiking up a well worn path in the rubble of Fossil's lower reaches. The path disappears in a drainage and it is mostly a hike up to the summitÂ? although the drainage gets quite steep near to the top and there a lot of loose scree, but nothing more difficult than class II.We left the campground at about 9:00 AM and were at the summit before noon. We were back at our campsite by 2:00 PM and hiked out to our cars at Fish Creek by 5:00 PM.Views at the top of Fossil were awesome. I enjoyed them even more than nearby Mt. Richardson, which we had hiked the day before, since it is a smaller summit and you get more of a sense of 360 degree views.In winter please check the local avalanche conditions and bulletins.",
    "directions": "Park at the Fish Creek area on the way to the Lake Louise downhill ski area and follow the blocked off road that leads eventually to the Skoki Lodge trail (you have to follow the road for about an hour until you reach the base of the ski hill).",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/2751/reg_1ptarmaginlakeJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2751/reg_2fossilmtnfromdeceptionpassJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2751/reg_4DSC04707.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2751/reg_campathiddenlaketofossilmtn.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2751/reg_fossilsjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2751/topo_6DSC04734.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2751/narrow_3DSC04691JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2751/narrow_5bakerlakeDSC04725.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/fossil-mountain-near-banff-ab-2751",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "6 hrs",
        "Total Distance": "11 km",
        "Town": "Banff, AB",
        "Type": "out-and-back"
    },
    "title": "Fossil Mountain",
    "trail_id": "2751"
}