{
    "description": "Starting el.: 1,403 m (4603 ft); Max. el.: 2,482 m (8,142 ft); Elevation Gain: 1,080 m (3,543 ft) \r\n\r\nDistance: 10 kms\r\n\r\nTime: 10 hours, including time to trailhead and looking for lost digital camera (at least an hour could be shaved from this time if a more direct route was taken to the ridge). \r\n\r\nWe were not sure of best route up and spent a couple of hours at the beginning of the day messing around as we tried to find our way up. We initially started out on a path further up the road, but ultimately we decided on the mapped route (shown below) to avoid some potential bushwhacking at the top of the ridge. There was a faint path that we managed to find above the highway, which paralleled the road below and eventually got us to the ridge. The ridge we took was just north of a drainage gully that extended all the way to the road below.\r\n\r\nOur route worked out, but if I were to do this hike again I would recommend ascending straight up the drainage gully. The drainage gets quite steep up high but the ridge could still be reached. \r\n\r\nAs we made our way up the ridge I kept having that weird feeling of someone watching us, and at one point I glanced up to the summit and got a fleeting glance of what I thought was another hiker. I realized that there was a group of mountain goats right up at the top of the ridge and was amazed to follow their route that seemingly went straight up a crack in the cliff face. There was not too much difficult scrambling on our route up to the top of the south summit of Syncline¡K mostly class II with some class III if you sought it out. \r\n\r\nSyncline actually has three distinct peaks that we were hoping to bag all in one day. Another option that others have done is to follow the connecting ridge from the middle summit to Mount St. Eloi to the North. We managed to get over to the middle summit of Syncline but due to time commitments (and a shortage of water) we bailed on the North summit and descended by the route shown. \r\n\r\nOur descent was not the most pleasant experience. Initially there were some good scree runs as we dropped off the West ridge that connects the South and middle summits. The scree ran out after about half way down and we got sucked into a drainage that at times was tricky due to some steep and slippery conditions. At the bottom of the West ridge there was an old road that is still used by ATV¡¦ers and riders. \r\n\r\nI lost my Sony Cybershot camera at some point during the day :( The photos shown here are courtesy of M. Brown of Fort Macleod. \r",
    "directions": "Follow the road in towards West Castle Ski area from Pincher Creek and park at the side of the road under the drainage gully of Syncline at one of the road pulloffs... See map...",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/2752/reg_1LookingoverSsummittoTableMtntheprairiesbeyondjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2752/reg_3WsummitfromtheSsummitjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2752/reg_GladstoneVictoriaDrywoodCastleWindsorjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2752/reg_JamescarefullydescendssteepterrainbehindTrevorjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2752/reg_StEloifromtheWsummitjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2752/reg_SurveymarkeronSsummit.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2752/reg_TheSouthernScramblersconqueryetanotherone-SSynclin.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2752/reg_Trevoralwaysmanagestofindsomegreatstufftoplayon.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2752/reg_reg_synclinehike1a.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2752/topo_2WealsobaggedtheleftmostblacknubalongthewayaJPG.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/syncline-mountain-near-pincher-creek-ab-2752",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "8 hrs",
        "Total Distance": "10 km",
        "Town": "Pincher Creek, AB",
        "Type": "out-and-back"
    },
    "title": "Syncline Mountain",
    "trail_id": "2752"
}