{
    "description": "An excellent trail with easy access to the alpine above the ski area on Hudson Bay mountain. The trail leads to the left of the ski lifts towards the mountain ridge and a hidden lake under the steep cliffs. This trail is the start of the scrambling route up to the south summit of Hudson Bay Mountain. That route follows the ridgeline but ends in a short steep exposed section below the summit. Weather conditions in the alpine are severe even in summer, I found very high winds up there in August.The trail is popular in summer and is also a good place for skiing or snowshoeing in winter.One can also explore the shallow ponds of the meadow area to the right of the trail. On the way back, hike north of the chair lift to a great viewpoint over Smithers, the Bulkley Valley and surrounding mountains.  This is also a great ski trip in winter to Hudson Bay Mountain south summit via the Prarie.In winter please check the local avalanche conditions and bulletins.",
    "directions": "From highway 16 go west to Railway Ave and turn south. After you cross the railway tracks continue on the Ski Hill Road for 24 km, follow signs to the ski area. Park at the very last parking lot to the left where you find the Green T-bar. Start up the hill on the left of the T-bar along a very rough dirt road leading towards the highest cabins. There is a footpath left of the last cabin you come to. Follow it steeply uphill until you reach meadows where the trail becomes very easy to follow.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/2754/reg_P8080456.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2754/reg_P8080458.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2754/reg_P8080459.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2754/reg_P8080460.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2754/reg_P8080462.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2754/reg_P8080466.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2754/reg_P8080467.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2754/reg_P8080470.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/crater-lake-near-smithers-bc-2754",
    "stats": {
        "Activities": "hike ski-bc",
        "From": "",
        "Seasons": "winter fall summer",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "6 km",
        "Town": "Smithers, BC",
        "Type": "out-and-back"
    },
    "title": "Crater Lake",
    "trail_id": "2754"
}