{
    "description": "Elevation gain: 212 metres. (700ft) This is an excellent trail for access to Top of the World Park, a remote wilderness area deep in the BC Rockies. The route is well-maintained with occasional wet spots. The trail passes through dense forest, along a riverside, and past slide areas to Sayles meadow.  All along this hike there are flowers blooming at different times in summer and a variety of fungi and mushrooms. There is a horse trail also, on the other side of the Lussier river, used for ski access in winter.There is a nice cabin at Fish Lake (at 5800ft) accommodating 20 people and 16 tent pads are situated around the lake perimeter. This area is a popular place in summer for fishing and hiking with good access to the alpine terrain above. Hut fees are $15/night. There is a 2km trail around the lake also.Janice's detailed trail and road directions and her enthusiastic personal narratives, help hikers of all skill levels to explore on their own, using her book as their guide.",
    "directions": "Access is from highway 93 south of Canal Flats. There is a turnoff 5 km south of Canal Flats with a sign for  Whiteswan Provincial Park. Drive the Whiteswan Forestry Road to a junction at 20km near the campground and keep right. Continue to 29.6km and turn right crossing Coyote creek. Continue to the 52km sign at the Fish Lake parking lot on a wide gravel logging road. Total distance from Kimberley is about 112km. The trail to Fish Lake starts at the trail sign by the parking lot. This trail is also a good place for running, if you have good trail running shoes. I use Montrail runners a lot for good support on rough trails. Check out Gord's Running Store in Calgary for a great selection of shoes. Gord is a top trail runner and is very helpful and knowledgeable on runner's needs.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/2763/reg_CAM-0002-33605.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2763/reg_Fish-Lake-Cabin-19-April-08-02-13338.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2763/reg_Fish-Lake-Cabin-19-April-08-13338.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2763/reg_Heading-back-from-fish-lake-13338.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2763/reg_IMG-3822-33605_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2763/reg_tow11JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2763/reg_tow1jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2763/reg_tow3jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2763/reg_tow5JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2763/reg_tow6JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2763/reg_tow8.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2763/narrow_tow2jpg.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/fish-lake-near-invermere-bc-2763",
    "stats": {
        "Activities": "hike ski-bc",
        "From": "",
        "Seasons": "winter fall summer",
        "Stars": 3,
        "Time": "4 hrs",
        "Total Distance": "13 km",
        "Town": "Invermere, BC",
        "Type": "out-and-back"
    },
    "title": "Fish Lake",
    "trail_id": "2763"
}