{
    "description": "Time and distance are return.The long haul up to the Palisade fire lookout site in Jasper National Parkis more popular with the mountain bike crew than it is with hikers or equestrian riders. Take a good water supply as there is no reliable source on route.From the end of the Pyramid Lake road follow the gated fireroad for 7km to the junction with the Pyramid Mountain trail and turn right. The road continues for another 3km to the old lookout site for a total elevation gain of almost 900 metres. The lookout, perched atop the shear cliffs of the Palisade, provides commanding views of the Athabasca river valley as it cuts through the mountain range after mountain range on its journey to the arctic ocean. This broad low elevation valley contains some of the most important wildlife habitat in Jasper Park has also been home to humans for up to 9000 years. Yet most of the mountains bear names applied during the 19th century fur trade.After taking in the views form the lookout site it is well worth your while to scramble up to the large cairn on the ridge to the west. From the cairn push fifty metres through the bush to an open slope with views towards the Victoria Cross Range. Some mountains in this range are named in honour of Canadians awarded the British Empires highest award for bravery. Of the mountains seen from this hidden viewpoint only Mount Zengel is named for a soldier. Sergeant Raphael Louise Zengel won the Victoria Cross http://www.vac acc.gc.ca/general/sub.cfm?source=collections/cmdp/mainmenu/group01/vc near Warvillers, France, on August 9th 1918 for rushing ahead of his platoon and single handedly attacking German machine gun nest.The trip back down to Pyramid Lake is a blast on a good bike but the speeds can get scary for a novice. Tighten your brakes and hold on tight. The best single map to take along is Gemtrek's 1:100000 \"Jasper and Maligne Lake\". The trail also appears on the 1:50000 government topo \"83D16 Jasper\" but you'll also need \"83E1 Snaring River\" \"83F4 Miette\" and \"83C13 Medicine Lake\" if you want to name the mountains seen from the lookout.Submitted by 'mtncat'.In winter please check the local avalanche conditions and bulletins.",
    "directions": "From the town of Jasper travel 7km up the Pyramid Lake Road past Patricia and Pyramid Lakes to the parking lot at the end of the paved road. Alternately cyclists can bike right from town for a return trip of 34km and a 1000 metres of vertical.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/2768/reg_ColinRange_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2768/reg_PyramidMtn.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/palisade-lookout-near-jasper-ab-2768",
    "stats": {
        "Activities": "hike mtn-bike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 4,
        "Time": "8 hrs",
        "Total Distance": "20 km",
        "Town": "Jasper, AB",
        "Type": "out-and-back"
    },
    "title": "Palisade Lookout",
    "trail_id": "2768"
}