{
    "description": "Elevation gain 400 meters. This is an easy bike ride followed by a short hike to a spectacular waterfall. A fairly level, wide and well graded gravel road leads 22 km to Snake Indian Falls. It follows the beginning of the North Boundary Hiking Trail where Snake Indian Falls is one of the scenic highlights of the route.  The ride is mostly uphill for the first half, reaches about 5000ft and drops to Shalebanks Campground at 12km.  Snake Indian Falls is a short 200 meter hike down a rough trail near km 22. The waterfall thunders over a sheer limestone cliff more than 100 meters to the river below. Photos of the falls are courtesy of Katie von Gaza.  One kilometer beyond the falls, there is a trail to the Willow Creek area and the Rock Lake exit to highway 40.",
    "directions": "Drive highway 16 about 9km east of Jasper and turn at the Snaring Campground junction. Follow this road 5km to the campground and continue across the bridge to a parking lot. Here check the sign, as traffic is one-way, alternating every 2 hours.  This is the Celestine Lake Road which is open May through September.  Follow this road another 22km to the start of the North Boundary trail. The Celestine lake road is narrow, winding, very rocky and rough - drive carefully.  There is great accommodation for hikers in nearby Jasper, check out the Jober's Cottage at 705 Geikie St. (780-852-3893) Email: jcottage@telus.net and website is:      Jober's Cottage",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/2773/long_1553251-10152626263564709-5277973645329176052-o-51621.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2773/long_53770-10152626270029709-2522969342676980752-o-51621.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2773/reg_snake-falls1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2773/narrow_10446140-10152626264714709-4633229884281284112-o-51621.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2773/narrow_snake-falls2.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/snake-indian-falls-near-jasper-ab-2773",
    "stats": {
        "Activities": "mtn-bike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 3,
        "Time": "5 hrs",
        "Total Distance": "44 km",
        "Town": "Jasper, AB",
        "Type": "out-and-back"
    },
    "title": "Snake Indian Falls",
    "trail_id": "2773"
}