{
    "description": "The Three Blind Mice area overlooks Okanagan Lake to the west.  There are many trails within this area so be careful not to get turned around.  This area is mainly composed of beautiful ponderosa pine rock bluffs and grasslands. These trails offer downhill runs that flow through the forest and beautiful views of the orchards and vineyards that border the Okanagan Lake.  Here are three popular routes that can be taken on this vast variety of trails suitable for all levels of ability.Route 1:From the upper entrance start by traveling down the Rusty Muffler Trail, turn left onto Mule Deer and continue through to Black Bear loop crossing Riddle Road.  From Riddle Rd travel down Fred to Three Witches which will take to the \"end of the line\".  Pass the fence and head south on the Yellow Brick Road Trail.  Continue on White Tail back to Riddle Road.  This will finish off the \"Z\" pattern.Route 2:This 10km route is accomplished by starting at the top of the Reservoir Route Trail, continuing down the Reservoir Route Trail, then up Riddle Road.  This will be a quick descent back to Naramata Road with an elevation drop of 600m.Route 3:At the lower entrance, start by traveling down the White Tail Trail.  Keep left on the first two junctions, and right at the third junction the the Yellow Brick Road Trail.  This trail will take you to a fence known as the \"end of the line\".  Keep right and travel down the Three Witches Trail back to the White Tail trail. Bike shop / rentals: Freedom Bike Shop Accomodations: Summerland Resort",
    "directions": "Travel to Penticton via Hwy 97 located at the south end of Okanagan Lake and turn east onto Westminster Ave.  Follow this road through Penticton to Naramata Rd.  The upper entrance is located east of Naramata Rd on Arawana Rd at the 5km mark, just past the cattle guard on the right.  The lower entrance, also known as The Pearly Gate, is located east of Naramata Rd.  Turn right 100m past Hillside Estate Winery onto Riddle Rd.  Once on Riddle Rd, turn left after one km past the Kettle Valley Railway/Trans Canada Trail.  You can also reach this location by riding along the KVR/TCT trail from Vancouver Place, located within Penticton.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/2778/reg_DSC02298-8269.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2778/reg_DSC02388-8269.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2778/reg_three-blind-mice-3-jpg_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2778/reg_threeblindmice1jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2778/reg_threeblindmice2jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2778/reg_threeblindmice4jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2778/reg_threeblindmice5jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2778/topo_threeblindmicemapjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2778/narrow_Ztrail-8269.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/three-blind-mice-trail-network-near-penticton-bc-2778",
    "stats": {
        "Activities": "hike mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "4 hrs",
        "Total Distance": "30 km",
        "Town": "Penticton, BC",
        "Type": "out-and-back"
    },
    "title": "Three Blind Mice Trail Network",
    "trail_id": "2778"
}