{
    "description": "5.9 sport 3-4 pitches - The Gorge (Galaxy Buttress)\r\nThis route offers three to four pitches of relatively easy climbing for the grade, but the exposure and incredible views down the arete to the Cheakamus gorge make this a climb not to be missed.\r\nPitch 1 5.8 20m (3 bolts)\r\nFrom the bottom station, traverse right across the face until you reach the arete.  Follow the arete up to the belay ledge.\r\nPitch 2 5.7 40m (8 bolts)\r\nFollow the arete up past a small ledge (possible belay) to a large angled ledge in a right facing corner.  Take the time to enjoy the spectacular views of the raging Cheakamus below.\r\nPitch 3 5.9 25m (3 bolts)\r\nHead out on the face to the right of the corner.  A few tricky moves off the start lead to much easier ground.  There is a belay station in a little from the top, though it's easy to miss.\r\n\r\nScramble up right to the road, taking care not to kick loose rocks down on each other.  A fixed rope has been put in place for part of the way.\r\n\r",
    "directions": "Driving north of Squamish you pass a big orange bridge (BOB).  The road continues to climb then passes through a canyon before heading back down to meet the Cheakamus River.  About 2.5km past the canyon you'll see a pull off on the left with a tourism information board.  Park here.\r\nAt the southern end of this pull out you'll see a feint trail marked with tic-a-tape.  It follows the road south for 100m before heading down and across a talus slope.  Continue south through a narrowing canyon, then follow the trail along the base of the cliffs on the left, staying left wherever possible.  You'll first pass the Court House area, then Gotham City, both on your left.  Stay high past Gotham city then follow a feint trail across the talus, heading down towards Galaxy Buttress on the other side.  You'll find a rap station with numerous hangers on the way down.  \r\nUsing this station, rappel down to a few metres above the base of the buttress, clipping both ends of the rope as you go to keep it off the talus.  This way you won't have loose rocks getting released from the slope when you pull the rope before you start the climb.\r\nThere is an older shorter route in to the buttress, but the hike in has been recently upgraded, and is worth the extra time.",
    "geohash": "c2bkj2",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/2786/reg_IMGP2662JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2786/reg_IMGP2671JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2786/reg_IMGP2672JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2786/reg_IMGP2673JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2786/reg_best1_IMGP2657JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2786/narrow_IMGP2667JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2786/narrow_IMGP2675JPG.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/star-chek-the-gorge-near-squamish-bc-2786",
    "stats": {
        "Activities": "climb",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 5,
        "Time": "4 hrs",
        "Total Distance": "0 km",
        "Town": "Squamish, BC",
        "Type": "out-and-back"
    },
    "title": "Star Chek - The Gorge",
    "trail_id": "2786"
}