{
    "description": "Elevation gain is about 3000ft from the halfway cabin to the ridge above the fire lookout. This is a great hike, very close to McBride with views over the Fraser valley.Start hiking from the abandoned cabin, and continue up the steep and muddy dirt road. This road continues for another 5km to a dead-end overlooking a gully. Now turn right and find route through some bush for a short way uphill. Soon the treeline is reached and a path continues uphill to the right and an abandoned fire lookout is reached. The lookout provides little shelter from the wind, but it has a roof to protect you from some rain. The views are fabulous and you can hike up some more to reach the ridge and can continue to the nearby summit. Open tundra allows for further exploration of the alpine and some scrambles on the peaks.",
    "directions": "Drive west on highway 16 towards McBride and turn right at the hiker sign 1km east of McBride on Mountainview road. Follow the paved road as it swings left until you reach another hiker sign at Rainbow Rd. Now turn right - uphill - and drive about 4km on a narrow steep gravel road (or use your mountainbike for a 1700ft climb!). You will reach an open, cleared parking area (at about 4100ft), with tables and fire pits. Good place to park and enjoy view of the valley. There is an old decrepit cabin very near, no windows or door. [Advertisement]In McBride stay at the comfortable cabins in a secluded spot above the Fraser river, minutes from the trails at Beaver Creek Lodge with fabulous views of all the surrounding peaks.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/2790/reg_tcabinjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2790/reg_teare0JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2790/reg_teare2JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2790/reg_teare3JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2790/reg_teare4JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2790/reg_teare5JPG.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/teare-mountain-lookout-near-mcbride-bc-2790",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 4,
        "Time": "5 hrs",
        "Total Distance": "15 km",
        "Town": "McBride, BC",
        "Type": "out-and-back"
    },
    "title": "Teare Mountain Lookout",
    "trail_id": "2790"
}