{
    "description": "Grub, Stub and Pity the Fool make up a triple downhill run well worth the long ride up. Starting at the highest point of any Cumberland Trails at 610m, the trail offers flowing singletrack downhill, a selection of stunts, skinnies, and some pretty technical sections. Not for the faint of heart, riders who can't negotiate the long approach will probably turn around before trying this trail. Snow covers the trail for most of the winter and spring, but this makes for a great summer ride when the stunts and conditions are prime.\r\rA must do for riders spending a weekend in the Comox Valley.",
    "directions": "Located near Cumberland, grab a trail map at Dodge City Cycles or the Riding Fool before heading out. Park at the CRI parking lot, and proceed through the yellow gate at the bottom of the hill and begin the ride up. Follow the main logging road up past all other trails to the top Lookout. Depending on the weather and snow line, Stub and Pity the Fool are available from this lower access road. The climb to Grub proceeds to the left and continues up through the clearing. The road will become less clear as you come into small alders along the trail. Look for a small trail going up to the right to a rocky bluff. Grub starts from the top of this and proceeds as a nice rip down. Grub drops you onto the aforementioned logging road and then cross over to Stub. Continue down stub with a small climb along a washed out road bed to the fork for Pity the Fool and Cumberland Cruncher. Pity goes right, Cruncher left. \r\rPity proceeds to drop down pretty quick and steep through a section of twisty narrow segments. \r\rYou are dropped out onto a clearing and you can see a yellow gate out at the end of the logging road. \r\rThis puts you back onto the Comox Lake road which you can turn right and ride back towards Cumberland. Past Perseverence creek, turn just right onto the old coal train rail bed. this nice flat trail brings you back most of the way to town. At the Chinatown heritage site, head up across the road onto Camp Road or keep along the roadway to the first yellow gate and back to the parking lot.",
    "geohash": "c0z4",
    "photos": [],
    "source_url": "https://trailpeak.com/trails/grub-stub-pity-the-fool-near-courtenay-bc-2799",
    "stats": {
        "Activities": "mtn-bike",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "12 km",
        "Town": "Courtenay, BC",
        "Type": "out-and-back"
    },
    "title": "Grub, Stub, Pity the Fool",
    "trail_id": "2799"
}