{
    "description": "Time and distance are return.In 1862 several groups of intrepid adventures called \"Overlanders\" set off from Red River (Winnipeg) by horse, cart and foot bound for the Caribou Goldfields in New Caledonia (British Columbia). One of these groups, led by Thomas McMicking, passed through the Athabasca valley in what would eventually become Jasper National Park. Not only will you be following in the steps of a gold rush on this historic trail, you will also pass right by the front door of an historic cabin.From the Sixth Bridge parking area cross the bridge over the Maligne River and turn left. (turning right here will take you 1.5km up the Maligne River to Maligne Canyon Full Loop) Following the Maligne towards its confluence with the Athabasca the trail cuts the corner and emerges along the bank of the larger river. Continue downstream on the braided Athabasca River to a bridge and junction with a horse trail from the Maligne Range. (where the wardens keep their horses) Turn left and continue on the Overlander Trail.The trail zips through a small patch of forest before emerging at a willow and alder meadow that is wet and muddy through the early season. At 2.5 km the end of the wet is heralded by another bridge / horse trail junction from the Maligne Range, turn left once again. If you brought your bike the next four klicks are a delightful cross-country ride to the John Moberly homestead below Mount Colin. Both John and Ewan Moberly were children of the fur trade, otherwise known as Métis. Born at Jasper House to Suzanne Cardinal Karakonte and Henry John Moberly (Hudson Bay Company clerk at Jasper House 1855-61) the brothers settled in the valley before the creation of the park or arrival of the railroad.On the north side of Garonne Creek a rough trail makes a steep and sometimes exposed ascent to the Mount Colin Centennial Hut. (http://www.alpineclubofcanada.ca/facility/mt_colin.html). At 9 km (near a lookout) you might notice the smell of Mrs Swift's (another pre-park settler) sulphur spring down by the river. Beyond the spring the terrain begins to roll and the biking becomes a bit more challenging. Passing below Mount Hawk the trail skirts the lower edge of a burnt forest, one of the first prescribed burns lit by Jasper's warden service in back in 1989.Rounding the corner of Morrow Peak at 15 klicks another climbers trail branches right to Morro Bluffs (http://www.rescuedynamics.ca/jasper.rocks/MorroBluffs.htm). A short distance later a well used trail branches left 500 metres to a climbing area called Morro Slabs and a parking area where Hwy 16 crosses the Athabasca River. The Overlander Trail continues straight ahead and crosses a low ridge before descending a shaded gully and ending at the Â?official' parking area on Hwy 16. The southwesterly exposure of this historic trail makes it ideal for early season travel. Most years see it ready by early April but what makes good travel for hikers also makes it popular with early rising bruins so be sure to let the bears know you're coming. The first half of the trail (to the cabin and back) makes for an easy mountain bike trip and excellent x-c ski. (The trail is not groomed and good snow conditions rare.)Submitted by 'mtncat'.",
    "directions": "Drive east of Jasper on Hwy 16 for 2km and turn right on the Maligne Lake Road. Cross the bridge and follow the Maligne Lake Road another two klicks then turn left then left again down to the 6th Bridge picnic area. The picnic area is equipped with tables, fire pits, privies and bear-proof garbage bin. The gated road continues to the Maligne Range warden stables. For the other end of the trail drive 20km east of Jasper on Hwy 16. The first parking lot after the bridge over the Athabasca is the unofficial parking lot, the official trailhead is 500m further.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/2800/reg_029-Copy-11997.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2800/reg_030-11997.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2800/reg_032-11997.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2800/reg_037-11997.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2800/reg_042-11997.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2800/reg_043-11997.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2800/reg_048-11997_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2800/reg_049-11997.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2800/reg_050-Copy-11997.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2800/reg_055-11997.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2800/reg_CabinandshackJPG.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/overlander-trail-near-jasper-ab-2800",
    "stats": {
        "Activities": "hike ski-xc mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "12 hrs",
        "Total Distance": "32 km",
        "Town": "Jasper, AB",
        "Type": "out-and-back"
    },
    "title": "Overlander Trail",
    "trail_id": "2800"
}