{
    "description": "Expresso is on Vancouver's North Shore. Of the three popular local mountains that make up the Shore,  Mt. Fromme (often called mistakenly called Grouse by mountain bikers) is the more popular area for those who don't mind climbing to earn their drop. \nAt the top of Mountain Highway (on Mt. Fromme), ride past the entrance gate and then the water towers gate (there are toilets here).  Count the switchback corners.  The entrance is a not far past the entrance to Pipeline, and is a little over halfway between the fifth and sixth corner, about a forty minute ride, 3 or 4 kilometres, from your car.\nThis trail is one of the more \"moderate\" of the black diamond (advanced) trails on Fromme.  There are plenty of steeps, small drops, and ramps, all the standards that make Fromme such an awesome place to ride.  It drops you out on the Baden Powell Trail.\nFrom there you can go left back along the Baden Powell to Mountain Hwy, drop almost straight down on the mellow but flowy Dempsey, or go right until just before a rocky knoll which marks the entrance to Lower Crippler.\nExpresso is quite commonly ridden after dropping out of Upper Oil Can or Seventh Secret.\nMore Mt Fromme mountain biking trails can be found here.",
    "directions": "To get to the parking area, drive North along Mountain Highway almost to its end and park.  There are parking restrictions for the last few blocks, so be careful you don't set yourself up to be towed.\nLocal Conditions:\n                  \t\nfantastic night footage of Expresso from Rob & Dean\n \nmore mountain biking videos can be found here",
    "geohash": "c2b",
    "photos": [],
    "source_url": "https://trailpeak.com/trails/mt-fromme-expresso-near-north-vancouver-bc-2802",
    "stats": {
        "Activities": "mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 5,
        "Time": "2 hrs",
        "Total Distance": "6 km",
        "Town": "North Vancouver, BC",
        "Type": "out-and-back"
    },
    "title": "Mt. Fromme - Expresso",
    "trail_id": "2802"
}