{
    "description": "NTS Map: 011I03\nEditor's Note: (June1st, '08) Due to construction and private land ownership, the trailhead on the Appin Road east side has been be re-routed. Look for a culvert and a small clearing in the woods, just up from the old entry way. As always, be curtious to those living in the area, so as not to jepordize the ever delicate\"trail user / private land owner\" relations. -S.Burt\nThis section use to be a portion of the formal Bonshaw trail system, but has now been labeled seperately as the Appin Road trail. It runs the geographically rich terrain between the Appin road and Bulger Park Road. Note that in winter, the Bulger Park Road is not plowed to the trailhead. you'll have to snowshoe down most of the road's span.\nThis is a trail system that has experienced a rebirth over the past five years. Forest clearing operations laid key sections of the route bare, plus some land owners blocked off portions. With fresh forest growth and re-routing around blocked land, the Appin Road trail system has become a very popular piece of technical single track.\nThis is a trail system in that although it is linear in nature, there are alternative paths that give you long or short ways through it. It doesn't have a lot of trail markers, but is easy to find and follow in the summer months. Come winter, I rely on my GPS to find the way!\nThe key feature in the terrain is a gully formed by a creek.  this provides ample opportunity for some great climbs, descents and bridge crossings.\nIt's a great afternoon's ride that will keep you coming back.",
    "directions": "travel along the Trans Canada highway (Route 1) and enter the Bonshaw community. Either look for the Green road (a church marks the road) or the Appin Road. (6K farther away from Charlottetown) Along the Green Road, there is a road on the right called bulger Park Road. Take it and it will turn into a narrowing dirt Road.  At the bottom of a hill, start looking for a stream on your left. There is a very steep hill the trail climbs straight up.\nAlong the Appin road, drive for 3 -4 minutes until you reach a field on your left with a barn style garage. On your right, just before this field will be woods and a culvert. That's the trailhead.",
    "geohash": "f84y",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/PE/2820/reg_appinrd.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/2820/narrow_narrow_bridge.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/2820/narrow_narrow_oldtrailmarkers.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/appin-road-east-near-charlottetown-pe-2820",
    "stats": {
        "Activities": "snowshoe hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 5,
        "Time": "1 hrs",
        "Total Distance": "5 km",
        "Town": "Charlottetown, PE",
        "Type": "out-and-back"
    },
    "title": "Appin Road East",
    "trail_id": "2820"
}