{
    "description": "NTS Map: 011I06\r\nCTO (initials unknown) is a linear path found in the Brookvale provincial park landmass, and was created by local mountain bikers, but I suspect it spills onto a circuit of snowshoe trails near the North end.\r\n\r\nI had no idea how to locate the trailhead until I had the chance to ride it with the Sunday morning group a couple of weeks ago in the late fall of 06. With that opportunity, I took along the GPS, with hopes of getting an accurate track. (and I did, to some extent.)\r\n\r\nUnlike many of the unmarked trails the group rides, this one had orange flagging at routine intervals. Besides that, it's an easy path to follow for the most part with or without flagging.\r\n\r\nWe came back to the trail a week later with the GPS to get a better track. This time hiking the path, thinking that the slower we went, the more accurate the unit's reception. Winter had struck once again with a few centimeters of snow, making everything look quite a bit different.\r\n\r\nOur plan was to approach the trailhead a bit more directly by means of some back roads. Not that much backroad travel mind you, but some none the less.\r\n\r\nWe ended up following a CRV once we got onto the narrowing road, and used lower gears as we descended some of the hills. We didn't seem to slip all that much, so paid little heed to the road surface.\r\n\r\nWe found the trailhead, and were on our way for an hour's hike. The woods looked great with fresh snowfall, though parts were slipperly in regular hiking boots. In the summer, this trail is rather wet, so a few days of freezing weather firmed things up.\r\n\r\nSome trail features of note iclude a few sets of bridges, and the \"bamboo torchure\" section, where low cut alder stumps stick out along the trail making for fun route picking on a bike. The route is primarily flagged with orange tape, but on the north end, I think the route gets shared with snowshoe paths because there is yellow and blue tape, as well as alternative routes. The path itself stumbles on and off of the park's cross country skl trail network which are wide swaths of clearings through the woods.\r\n\r\nAs it's not a loop trail, and with time restraints, we got 2/3rds of the way before we turned for home. Thinking our adventure was over, we reached the car and set to the business of heading home. We turned around without any problems, but we discovered that with no winter tires on our sedan, the road we descended, was not going to be climbed on our return. So much for Plan A. Plan B was to backtrack further along a different road. Although not knowing where that road went, we hoped it would work its way around the hills. With a bit more of a run at it, the hill we met up with left us spinning a third of the way up. We ended up sliding backwards and spinning the front end around in a less than stylin' manner. Luckely there were no ditches on these log roads, and suffered no real damage to the car in ditching plan B.\r\n\r\nOur only other option, with the exception of leaving the car and calling for a ride, was to drive further on the original (McKenna) road by the trail head, though we didn't know where it would come out or what sorts of hills we would encounter further on. A Big risk, but we took it.\r\n\r\nFortunately for us, the general route of the road was downward, and with the use of lower gears, we managed to keep the car on the road, and were able to climb the few short hills we encountered. We laughed pretty hard once we were in the clear, realizing the possible outcomes of our potential imobility. One never thinks of the driving part of the hike to be the greater adventure! \r\n\r\nShannon Burt\r\nEast Coast editor",
    "directions": "Either start at the Nordic center (the more sane approach in winter) or take the appin road until it ends at the McKenna road. Turn left and look for a small inlet log road to the left. The trailhead is right at the corner.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/PE/2823/reg_dec8CTO20JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/2823/topo_CTOmapjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/2823/narrow_dec8CTO21JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/2823/narrow_dec8CTO22JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/2823/narrow_dec8CTO24JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/2823/narrow_dec8CTO26JPG.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/cto-near-charlottetown-pe-2823",
    "stats": {
        "Activities": "snowshoe hike mtn-bike",
        "From": "",
        "Seasons": "winter fall summer",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "5 km",
        "Town": "Charlottetown, PE",
        "Type": "out-and-back"
    },
    "title": "CTO",
    "trail_id": "2823"
}