{
    "description": "NTS Map:022B16\r\nThe Gaspesie National Park is located in the heart of the Gaspe Peninsula, and is bordered on both ends by wildlife reserve territory. It contains the Chic Choc mountain range, some of the most rugged of the old Apalachian chain (the Notre Dame Mountains district) According to Wikipedia, in Mi'kmaq, Chic Chocs means \"impenetrable barrier\"\r\n\r\nIn the Summer, the park offers several hiking and canoeing opportunities. Many are posted already here on trailpeak.com. Come Winter, the heavy annual snowfall (8M) provides an entirely different experience of snowshoeing, various skiing options, and climbing. Winter travel within the park utilizes trails that take one through a series of huts or Refuges. The route to the East is called the McGerrigle route, as it goes through the McGerrigle mountain range. The hut routes to the West include La Lacs, Les Chablis, and Le Noroit circuits through the Chic Choc range. \r\n\r\nOur three day backcountry ski adventure took us through the McGerrigle range on the East side of the park, and the itenary went something like this...\r\n\r\nDay 1 Leaving the parking lot you climb steadily up along route 14 with the Ste Anne North-East River to your right. Route 14 is unplowed during the winter, and is a wide path that takes you up into the mountains. Eventually breaking from route 14 just south of Riviere des Portes, the route veers right along the foot of Petite Mont Ste. Anne. (elevation 1147M). The route takes you between both Petite Mont Ste Anne and Mont de la Table where the Mine Madeline hut lies. (Ice climbing spots will be in view from the refuge's window!) This is not an exciting first day due to the nature of skiing a road. The only thing to save you from sheer boredom is the developing views of Petite Mont Ste Anne, and looking behind you, at the vast Chic Choc expanse to the West. \r\n\r\nIf a two night stay were planned, a separate day trip would be an option. A 10K trail will take you all the way to Lac Rene, passing both Mont Comte (1229m), Mont Jacque Cartier (1270M; highest in the park), Mont Dos de Baleine (1249M) and Mont de la Passe (1231M). This route connects to the SIA which cuts through the park on a general East-West direction. you could also go ice climbing on the various available ice lines.\r\n\r\nDay 2. Leaving the Mines de Madeline hut, You descend along yesterday's route briefly before turning left along a flagged, and gated equestrian / ski path. For the first few Kilometers of the route, a wide enough passage offers views of Mont de la Table to your left, and Petite Mont Ste Anne at your back. To your distant West, you'll see the expanse of the Chic Choc range. It is a 10K route that gets narrower due to closer tree growth after 3 or 4 K. Soon you'll forget that you are traversing the foot of Mont de la Table but you will pass the shores of two small lakes that dot the base of the mountain. First is Lac des Portes de L'Enfer, and second, Lac Dugue.\r\n\r\nSoon after the lakes, you'll need to dig out your skins for a long climb up toward around the base of Mont Xalibu. Eventually after two such climbs,  Xalibu itself comes into view. It is very beautiful and rewarding to see.\r\n\r\nThe remaining Kilometer or so almost becomes a snowshoe path in the way it twists and is sometimes nearly choked with stumps, roots and deadfall. Be careful as you pass along this last section if you are weary from the day's travels. With no access to communications, a bad fall may put a difficult end to your journey.\r\n\r\nFinally the path lands you at the door of La Roselin hut for your second refuge. A half Kilometer away, Lac American positions itself in the forground for the money-shot view of the cirque between Mont Xalibu and Mont Joseph-Fortin (1080M). A 4.5K path will take you to the summit of Mont Xalibu, but it is closed during the winter months as it is a reserve area for the local Wintering Caribu population.\r\n\r\nLa Roselin hut is truly rustic in both appearence and function. It sleeps eight in four stacked sets of bunks that are positioned somewhat privately. A wood stove serves as heat for the refuge, and a big dining room table serves the space for the communial life of hut-dwellers.\r\n\r\n If you spend two nights here, a day trip to Mont Joseph Fortin and Mont Richardson would be in order. Just plan and be equipped for the early night- fall of around 4PM.(at Christmas time) (put a GPS, headset lamp and warm clothing in your pack)\r\n\r\nDay three has you headed for home. Putting Mont Xalibu to your back, the path runs less than two kilometers, (created for summiting Mont Xalibu) before reaching route 160 West. Along the way, a row of mountains, Mont Joseph-Fortin and Mont Richardson  (1180M) may be visible off to your left if it's not snowing. After less than 2K, the route gives the option to branch away from the wider roadway to enter the forest. It parallels Route 16, the other route option. The total run of the forest path (SIA route) is approximately 5K, and the total run between the hut and the interpretive center should be around 9-10K on a gradual, but sometimes steep downward ride of your life. This is also half of an advanced cross country ski route called",
    "directions": "Route 132 travels around the Gaspe, with route 299 cutting down the middle. Two-Thirds North along the 299 lies the Gaspesie National Park. Our McGerrigle Route starts on Route 14, and returns along route 16 on a forest path. (SIA)",
    "geohash": "f8",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/QC/2836/reg_Frostyjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/2836/reg_alongrt14jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/2836/reg_avalanchejpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/2836/reg_chicchocsjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/2836/reg_climbday2jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/2836/reg_lacamericanjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/2836/reg_minemadelienejpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/2836/reg_monttablejpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/2836/reg_steanneNEjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/2836/reg_xalibujpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/2836/topo_xalibu2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/2836/narrow_myBC24sjpg.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mcgerrigle-route-chic-chocs-gaspesie-near-matane-pq-2836",
    "stats": {
        "Activities": "snowshoe hike ski-bc ski-xc",
        "From": "",
        "Seasons": "winter fall summer",
        "Stars": 5,
        "Time": "21 hrs",
        "Total Distance": "31 km",
        "Town": "Matane, PQ",
        "Type": "out-and-back"
    },
    "title": "McGerrigle Route, Chic Chocs, Gaspesie",
    "trail_id": "2836"
}