{
    "description": "NTS Map:022B16\r\n\r\nYou will find this trail in the Gaspesie National Park in Quebec's Chic Choc mountains. This is a groomed trail come winter, and is rated difficult according to the park's guidebook. We came across the best parts of it on our last day of our backcountry skiing trip through the McGerrigles loop.\r\n\r\nThis is a very steep trail at times, and might be best served with skins when ascending. We had the luxoury of descending this path however, and what a rush it was! Some of the route makes sharp turns at the bottom of the descents, so care needs to be taken. Our backcountry skis with metal edges came in handy in controling our speed, though it is marked as a cross country route.\r\n\r\nThe actual route makes a 10K loop. Depending on where you like your speed, one would ascend using route 16 which has a groomed shoulder space along both sides of an unplowed summer road. Once reaching the cul de sac, you could either take a spur trail into Lac American, or enjoy a greatly improved change of scenery, going into the forest portion of the loop for the ride of your life. The change takes you into a prettier, narrow path. The snow covering the trees is dream-like, and to me, is what Winter in the Chic Chocs is all about.\r\n\r\nThe mountain views would greatly improve if the skies were clear, and the path not so narrow. Going up the wider road would offer great views of Mont Albert to your back, and Mont Richardson to your right. A backcountry ski route will take you to both Mont Richardson and  Mont Joseph Fortin if you were hut-staying in Lac American area. With darkness more than setting in by 4PM, one needs to carefully plan distances.\r\n\r\nThis route takes you down some steep hills, and gentle traverses back behind the Gite Du Mont Albert, and lands you behind the Interpretive center.\r\n\r\nShannon Burt\r\nEast Coast Editor",
    "directions": "Find the Gaspesie National park on route 299 in the Gaspe region. The trailhead starts behind the Interpretive center or on route 16, an umplowed summer road.",
    "geohash": "f8",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/QC/2837/reg_lac_american.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/2837/narrow_gromedtrailjpg.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/ruisseau-du-portage-near-matane-pq-2837",
    "stats": {
        "Activities": "hike ski-bc ski-xc",
        "From": "",
        "Seasons": "winter fall summer",
        "Stars": 5,
        "Time": "3 hrs",
        "Total Distance": "10 km",
        "Town": "Matane, PQ",
        "Type": "out-and-back"
    },
    "title": "Ruisseau du Portage",
    "trail_id": "2837"
}