{
    "description": "The Delta Watershed Park is Easiest accessed on 64th Ave. just west of 120th St. in Delta. There are 2 main trail heads there with ample parking.   The Watershed Park has approx 28 km in trails that are good for hikers, day walkers, horseback, and mountain biking.  \nMost of the trails are great for the beginner while trail difficulty does increase in areas such as some stunts that have been built and the famous \"Gravity Bowl\" which is absolutely for intermediate riders. A person can have a great ride in the span of just a couple of hours but to experience the whole park one would have to dedicate a good part of the day. \nSome of the local residents who walk/hike the watershed have been fighting with the city of Delta to have Mountain biking banned from the park. The majority of users here are bikers, hands down. This is a current on-going issue and fellow bikers need to attend city meetings to see that the banning of Mountain Biking at the Watershed never happens.  \nIn the Fall of 2001 the City of Delta has done some construction to the main paths by replacing the dirt/pine needle paths to a crushed limestone path for easier more pleasant, non-muddy walk.   \nNote: To the best of my knowledge the reconstruction is only to the main waking paths and it's important that these paths be respected by bikers. If we rip up these paths it will not be long before the City of Delta reconstructs all the paths and bans mountain biking completely.",
    "directions": "See description and / or GPS",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/284/reg_topoDelta1.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/delta-watershed-park-near-delta-bc-284",
    "stats": {
        "Activities": "hike mtn-bike",
        "From": "",
        "Seasons": "summer",
        "Stars": 4,
        "Time": "7 hrs",
        "Total Distance": "0 km",
        "Town": "Delta, BC",
        "Type": "out-and-back"
    },
    "title": "Delta Watershed Park",
    "trail_id": "284"
}