{
    "description": "The James Callahan trail that traverses Gros Morne Mountain, Newfoundland's second highest point (806m) is a strenuous journey that takes its toll emotionally as well as physically. The hike is a must for all visitors to Gros Morne National Park, and even those who do not wish to attempt the summit can easily enjoy the 90 minute hike to the base of the mountain where moose and black bears are a common sight before the background of \"big gloomy\". The 16km loop begins just south of Norris Point at just a few meters above sea level and takes most people 6-8 hours to complete.      The first section of the trail is a 4km gradually rising forest trail that takes you to the base of the mountain. The trees begin to give way to bog as you climb higher and on a hot day the welcome shade from the spruce and firs is lost as you reach the rest area at the base. There are interpretive signs here and I recommend taking a few minutes to read them. They offer valuable information about the mountain as well as some info about the wildlife you might expect to see as you climb. There is a small brook that runs by here, and if you have a purifying agent with you it can offer a chance to refill your water bottles.      The next section of the trail features a 1km climb that gains nearly 500 meters of elevation. The trail up the scree climbs over blasted fragments of quartzite left over from the last glaciers and is strenuous to say the least. The seemingly endless climb can usually be completed in 1 - 1.5 hours. Be prepared as you reach the top to encounter high winds, rain, fog, and even snow (even in summer).      As you reach the summit of the mountain the landscape becomes a seemingly uninhabitable arctic barren plateau, made up of blasted rock, and with very sparse vegetation. It is indeed part of the Arctic Alpine Sub Zone. Animals do live here however and some such as moose and caribou are common. Arctic Hares, Rock Ptarmigan, and Black Bears are common in the area but in most cases blend in well enough that they are rarely seen. The plants at this altitude are very sensitive, and for this reason you should always stay on the trail while hiking the mountain.       There is a sign at the summit for your photo-op, and just beyond there is a small ridge that offers enough protection from the wind to make a good lunch spot. On the north end of the summit is Ten Mile Pond. The view of the pond from the top of Gros Morne is world renowned, but don't get your hopes up. The thick grey fog that earned the lonely mountain its name can appear out of nowhere, making it essential that you stay on the trail and follow the designated markers.      When you've finished taking your pictures of Ten Mile Pond, the trail begins to wind downwards again as you make your way down into Ferry Gulch. This section offers a great view of the Long Range Plateau, and the primitive campsite at the far end of Ferry Gulch is often the last night for travelers coming off the plateau after completing the 35km Long Range Traverse hike. There is a spring here to refill your bottles again, and for those who wish to spend the night there are three designated tent platforms, as well as a bear box for your food. I've often seen what I think has to be the biggest moose in the park roaming near the spring just before dusk.      The last part of the hike back down is a steady downward march that can often be the most difficult part of the hike. The shores of Bonne Bay become visible in the distance as you round the back of the mountain and make your decent back to the base. Just when you think you are done, you have only the last 4km back to the parking lot and you are done. For some reason it always seems to take longer coming out than going in.  This is a great trail for hikers of any level, but the mountain should always be treated with utmost respect. Bad weather can make the hike uncomfortable at the least, and there have been fatalities in recent years when hikers got lost in the fog. It is not a recommended hike for children and pets are not allowed. For more information, contact park officials before heading out.Ryan YoungNfld Editor",
    "directions": "Gros Morne National Park",
    "geohash": "f8y",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NL/2846/reg_Newfoundland-2011-130-37009.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/2846/long_gm-jg-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/2846/reg_Newfoundland-2011-106-37009.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/2846/reg_boo2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/2846/reg_gm01-7064_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/2846/reg_gm1-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/2846/reg_gm10-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/2846/reg_gm2-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/2846/reg_gm3-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/2846/reg_gm4-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/2846/reg_gm5-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/2846/reg_gm6-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/2846/reg_gm7-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/2846/reg_gm8-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/2846/reg_gm9-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/2846/reg_jamesctrail.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/2846/reg_rockpt.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/2846/reg_tenmilepond.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/james-callahan-trail-gros-morne-mountain-near-rocky-harbour-nf-2846",
    "stats": {
        "Activities": "snowshoe hike",
        "From": "",
        "Seasons": "winter fall summer",
        "Stars": 4,
        "Time": "7 hrs",
        "Total Distance": "16 km",
        "Town": "Rocky Harbour, NF",
        "Type": "out-and-back"
    },
    "title": "James Callahan Trail (Gros Morne Mountain)",
    "trail_id": "2846"
}