{
    "description": "If you don't have the time or the stamina to hike to Camp Muir (Rainier Base Camp) then the Skyline Trail is an excellent substitute.  The trail is a total 9 Kms, takes about 4.5 hours and has an elevation gain of almost 600 meters.  The view the entire time hiking upwards is awesome, you are constantly looking at the Nisqually Glacier and Rainer.  On your way down you get to look at Mt. St. Helens and other beautiful peaks.  Not to be overlooked with the amazing mountain scenery are the waterfalls along the way.  We did this hike in the fall the colours of the meadows are amazing.  The trail is very well marked with sign posts at all junctions.  For first little while the trail is even paved, but this soon leads to a dirt trail.   Make sure to bring some sort of wind jacket with you, the wind off the Nisqually Glacier can be quite cold.\r\n\r\nThe trail starts to the left of the Paradise Inn.  Follow the signs for Panorama Point or Skyline Trail.  We took the detour for the Glacier Vista, it will add next to nothing to your time and gets you a little closer to the Nisqually Glacier.  In about an hour you will be at Panorama Point and you get a great view of Mt. St. Helens and the southern mountains.  Check out the toilets here, they have been carved out of the rock and are quite neat!!  In about 30 minutes keep your eyes open for Marmots.  We noticed a few sunning themselves on the rocks.  Make sure to stop and admire the two waterfalls, Sluiskin and Myrtle falls.  Once back down to the Paradise Inn, make sure to head over to the Jackson Visitor Center where you can look through a telescope and see the Muir base camp and the climbers.\r",
    "directions": "To get here from Seattle take the I-5 south to Hwy 7 to Elbe.  Then take Hwy 706 east to the Nisqually entrance (The South West Entrance).  You will have to pay $15 for the car.  Make sure to get here early otherwise you will have to park way down on Valley Road and add as much as 20 minutes to your hike each way.",
    "geohash": "c236",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/WA/2856/reg_IMG_3242_Large_.jpg",
        "https://trailpeak.com/storage//content/trails/US/WA/2856/reg_IMG_3244_Large_.jpg",
        "https://trailpeak.com/storage//content/trails/US/WA/2856/reg_IMG_3247_Large_.jpg",
        "https://trailpeak.com/storage//content/trails/US/WA/2856/reg_IMG_3262_Large_.jpg",
        "https://trailpeak.com/storage//content/trails/US/WA/2856/reg_IMG_3264_Large_.jpg",
        "https://trailpeak.com/storage//content/trails/US/WA/2856/reg_IMG_3267_Large_.jpg",
        "https://trailpeak.com/storage//content/trails/US/WA/2856/reg_IMG_3269_Large_.jpg",
        "https://trailpeak.com/storage//content/trails/US/WA/2856/reg_best1_IMG_3246_Large_.jpg",
        "https://trailpeak.com/storage//content/trails/US/WA/2856/narrow_IMG_3271_Large_.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mt-rainier-skyline-near-us-city-2856",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "5 hrs",
        "Total Distance": "9 km",
        "Town": "US City",
        "Type": "out-and-back"
    },
    "title": "Mt. Rainier - Skyline",
    "trail_id": "2856"
}