{
    "description": "Map sheet 21i09\r\n\r\nMill River Provincial Park seems to be doing things right in terms of offering great recreational services, not only to its resort patrons, but also to the wide ranging community of Western Rural PEI.\r\n\r\nJust recently, I had the opportunity to sample one of their three XC trails which run around their golf course facility. The three loops range in length and dificulty. There is an easy 3.6K, a moderate 4.5K, and a difficult 6.5K trail.\r\n\r\nThe circuit is relatively flat, with gently rolling hills, a few short steep climbs and subsequent satisfying descents. There is a really picturesque creek crossing that makes the loop worth returning to in lap-fashion.\r\n\r\nThe trails are groomed, and for the intermediate and advanced loops, are lit for night skiing. Markers clearly show the way. All trails are double tracked, and in most cases, seem wide enough to permit skate skiing and snowshoeing.\r\n\r\nIt was raining at the time I took to the trail, and I was in backcountry gear. That, along with the slushy snow meant that it took me about an hour to complete the 6.5K loop. Saying that, the facility could easily entertain a skier for a full afternoon, or evening of loop-de-loops!\r\n\r\nThe facility offers rentals for XC, snowshoeing gear, as well as tubing. Access to the network costs $5.00 for the day. It's a great option for residents of Western PEI who would otherwise have to travel over an hour to reach the  Brookvale  facility.\r\n\r\n-Shannon Burt\r\nEast Coast editor\r\nGps data is limited to a single waypoint.\r",
    "directions": "About 90 minutes from Charlottetown along route 2 West, or 30 minutes from the confed. bridge along route 1A and route 2 West.",
    "geohash": "f863uj2kf6f2",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/PE/2857/long_millriver_05.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/2857/reg_millriver_07.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/2857/narrow_millriver_06.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/2857/narrow_millriver_08.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/2857/narrow_millriver_09.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mill-river-provincial-park-near-alberton-pe-2857",
    "stats": {
        "Activities": "snowshoe ski-xc",
        "From": "",
        "Seasons": "winter",
        "Stars": 4,
        "Time": "4 hrs",
        "Total Distance": "14 km",
        "Town": "Alberton, PE",
        "Type": "out-and-back"
    },
    "title": "Mill River Provincial Park",
    "trail_id": "2857"
}