{
    "description": "Elevation gain: 200 meters\r\nThis trail leaves the \r\nBlue Lake Centre and runs all the way down to the Findlay Forest Service road. It is mostly a single-track route and is set for classical skiing in winter. It starts out from Blue Lake and soon begins a long descent, great fun on skis or bikes. \r\nAs the trail flattens out it reaches open meadows and the fence of a ranch. If you turn west at the fence line, you can reach the small Engstrom pond. A rough track also continues past the fence and back to the forestry road. \r\n \r\nThe Turtle lake area is also accessible via a side trail from the upper portion of the Findlay trail at 2 junctions about 2-3 km from the start.",
    "directions": "Drive south of Invermere, past Fairmont and turn off Highway 93/95 onto Findlay Creek RD, approximately 4 km North of the Canal Flats gas station. Follow the signs for 26 km until you reach Blue Lake Centre. Check all the forks and intersections for Blue Lake signs, there are a number of side roads. The road is plowed all winter by Tembec operations. \r\nThis trail starts to the left from the main trail near the lake, junction has a signpost. Watch out for logging operations in winter of 2006-7 in this area.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/2871/reg_findlay1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2871/reg_findlay2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2871/reg_findlay3.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2871/reg_findlay4.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2871/reg_findlay5.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/findlay-trail-near-invermere-bc-2871",
    "stats": {
        "Activities": "mtn-bike ski-xc hike",
        "From": "",
        "Seasons": "summer fall winter",
        "Stars": 3,
        "Time": "3 hrs",
        "Total Distance": "12 km",
        "Town": "Invermere, BC",
        "Type": "out-and-back"
    },
    "title": "Findlay trail",
    "trail_id": "2871"
}