{
    "description": "Map Reference:\n82 K/7 Duncan Lake\nLatitude & Longitude Coordinates for Jumbo Pass cabin:\n50° 21' 37\" N    116° 37' 27\" W\n11U 526694 5578870 at the cabin.\nThe new 8 person cabin was a joint project involving the Columbia Valley Hut Society and a  Forest Renewal B.C. grant. It sits on the ridge, along the Purcell divide, about .5 km north of Jumbo Pass. There is quality hiking, scrambling and ski touring available in this small alpine location. Views are superb and include Karnak and Jumbo Mountains to the north-east and Cauldron/Horseshoe glaciers to the south-west. A nearby tarn, just to the  east of the cabin, is the summer season drinking water source.\nIt should be noted that, according to the Columbia Valley Hut Society, this hut is already over used, and bookings are required. The outhouse barrel was already full Dec 2006, after a couple of months, possibly due to many unbooked visits to the hut. The stove and lantern need 1lb green propane cylinders, bring 1 of those for each day in the hut. There is a limited supply of firewood, do not use it all up for cooking. There is no white gas stove and one white gas lantern. \nBookings info at http://www.cvhsinfo.org/hut.htm \nsee also:this website.",
    "directions": "Trailhead parking (roadside) will vary from one year to the next as it is dependant upon current government funding for back-country road maintenance and the existence of active logging in the area. Drive the Toby Creek road for 18 kms past Panorama Mountain Resort, then turn right onto the Jumbo Creek road. For winter access, this junction generally marks the end of the plowed portion of the road. For summer travelers, the traditional parking area is located at the 15.4 km mark on the Jumbo Creek Road. The trail begins by following a skid road that heads off to the left from the road.\nWinter access to huts of the Columbia Valley Hut Society is long and tedious via logging roads, a skidoo can be helpful. Call Ted in Invermere if you need a skidoo ride: (250)342-3793 or cell (250)341-1323. He is helpful and takes skiers to remote trailheads.\n RK Heli-ski can sometimes take people by chopper to Jumbo Pass hut, call them to make arrangements. Cost can be as low as $600 for 5 people for a drop-off, flying from the winter parking lot. see RK Heli ski for more info.\nNOTE: the access route in winter passes across some large avalanche run-out zones, do not camp near any of these or stop in these areas. Check the avalanche conditions and avoid skiing this route if the stability is poor.\nFor more information on day hikes or backpacking trips into this area, see Mountain Footsteps, a New Edition by Janice Strong. http://www.janicestrong.com.\nA video/photo essay of a ski trip in Jumbo Pass",
    "geohash": "c2vn",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/2883/long_jp1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2883/long_jp2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2883/long_jp3.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2883/long_jp4.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2883/long_jp5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2883/reg_jumb-ht-8779.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2883/reg_jumbop1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2883/reg_jumbop2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2883/reg_jumbop3.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2883/reg_jumbop4.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2883/reg_jumbop5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2883/reg_jumbop6.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/jumbo-pass-near-invermere-bc-2883",
    "stats": {
        "Activities": "hike ski-bc",
        "From": "",
        "Seasons": "winter fall summer",
        "Stars": 5,
        "Time": "6 hrs",
        "Total Distance": "10 km",
        "Town": "Invermere, BC",
        "Type": "out-and-back"
    },
    "title": "Jumbo Pass",
    "trail_id": "2883"
}