{
    "description": "This is an easy trail near Whitehorse, along Schwatka lake, Yukon river to Canyon City. The  Yukon Conservation Society offers free guided hikes here in the summer.\r\n\r\nTrail generally follows the water edge past beaver lodge. Turn left at intersecting trail into the forest, climbs a hill, then turns right back into the bush. Next you follow a ridge with views of the lake, continue towards boat launch and trail to parking area. \r\n\r\nwalk across parking, past picnic tables and take middle path, leads to a wide trail. At the 4-way junction go right for a scenic route along the river. You will reach the edge of the canyon, whose rapids were a major hazard in the gold rush days. Continue past the suspension bridge that crosses the canyon and reach the red ski trail junction. Continue along the old tramway route to Canyon City.\r\n\r\nCanyon City was created during the gold rush and a tramway connected it to Whitehorse, 8km away. Now you see only some old building remains and discarded bottles, cans.\r\n\r",
    "directions": "\r\nFrom Whitehorse cross the Yukon river bridge and drive along Lewes Boulevard. Drive past lights and take the a right onto Nisutlin drive. Turn left off Nisutlin onto Chadburn Lake road just before the fish ladder. there are parking spots and picnic places after 1.5km on the right. Trail is next to the lake from here. Drive is about 10 minutes from SS Klondike.\r\n\r\nPhoto credits: A. Graham, UArctic Photo Pool, 2006.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/YT/2886/reg_P1120833-8779.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/YT/2886/reg_miles1JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/YT/2886/reg_miles2JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/YT/2886/reg_miles3JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/YT/2886/reg_miles4JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/YT/2886/reg_miles5JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/YT/2886/reg_miles6JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/YT/2886/reg_miles7JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/YT/2886/reg_miles8JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/YT/2886/reg_milesc2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/YT/2886/reg_milescnyn1.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/miles-canyon-near-whitehorse-yt-2886",
    "stats": {
        "Activities": "hike mtn-bike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 3,
        "Time": "4 hrs",
        "Total Distance": "11 km",
        "Town": "Whitehorse, YT",
        "Type": "out-and-back"
    },
    "title": "Miles Canyon",
    "trail_id": "2886"
}