{
    "description": "This spectacular traverse is a west coast classic, a must do on any serious ski tourer's hit list.  With numerous cabins along the way, spectacular views, and plenty of good skiing, this traverse offers plenty of opportunity for additional exploration.  The many peaks in the area offer the more serious mountaineer many reasons to visit this area more than once.\r\n\r\nThis trip is normally approached from Squamish, with a prior car drop at the Garibaldi Lake trail head. Whilst an alternate higher route exists west the Gargoyles, this description takes the valley east of the Gargoyles.\r\n\r\nFrom the trailhead, follow the winter route to Elfin Lake.  Head NNW of the Elfin Lake cabins, staying high until the ground steepens, before heading more eastward to cross a series of gullies.  Start heading across the SE slopes of The Gargoyles until easier ground allows you to descend to Ring Creek.  Follow the east banks of the creek and climb the Garibaldi Glacier just west of Opal Cone.  Good camping can be found on the flats of the Bishop Glacier at the foot of the Garibaldi Neve.  \r\n\r\nClimb the Garibaldi  Neve, in a generally northerly direction until high ground is reached.  Follow the Neve up NW to a point just north east of The Tent.  Take mellow slopes down the North Pitt Glacier, staying east of The Sharkfin through steepening ground.  When the snowpack is shallow, be aware that there are potentially dangerous crevasses in this area. Head north past Glacier Pikes on your right, and ski down the Sentinel Glacier to Garibaldi Lake.  The \"Sentinel Bay Hilton\" is nestled in at the foot of the Glacier.\r\n\r\nSkate across the lake to the Garibaldi Lake camp ground, and descend via the Garibaldi Lake hiking trail.\r\n\r\nIt should be noted that bad weather, and an unstable or shallow snow pack can turn this traverse into an extremely difficult undertaking.  It is not recommended in early winter or late spring. It also requires that Garibaldi Lake be frozen to avoid huge detours through difficult terrain.\r\n\r",
    "directions": "\r\n\r\nNTS Map: 92G14.\r\nTo drop a car, drive north along the Sea to Sky Hwy from Squamish.  Approx. 10km past Squamish, a sign on the east side of the road marks the turnoff to the Garibaldi Lake hiking trailhead.  This road is ploughed in winter.  Park at the end of the road, leaving plenty of room for the plough to pass.  Drive back towards Squamish, and turn east off the Hwy down Mamquam Rd, past the Canadian Tire store.  Follow this road up past the new Quest University.  Follow the sign left past the fork in the road towards the Garibaldi Park entrance. \r\n\r\nCurrent Conditions:\r\n\r\n\r\n\r\n    \r\n        \r\n      \t\r\n\r\n\r\nfootage care of Pow Wow Creations\r\n\r\n\r\n\r",
    "geohash": "c2b",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/2893/long_alititude_profile_of_garibaldi_neve_traverse.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2893/long_pan_of_Mount_Garibaldi.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2893/reg_Garibaldi_Neve_Traverse_3158_The_Gargoyles.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2893/reg_Garibaldi_Neve_Traverse_3163_climbing_the_Garibaldi_Glacier_with_Garibaldi_in_the_background.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2893/reg_Garibaldi_Neve_Traverse_3181_camped_on_the_Neve.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2893/reg_Garibaldi_Neve_Traverse_3201_looking_back_at_Viking_Ridge_and_the_Mamquam_Icefield.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2893/reg_Garibaldi_Neve_Traverse_3226_skating_across_Lake_Garibaldi.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2893/reg_best0_Garibaldi_Neve_Traverse_3219_looking_across_at_Black_Tusk_and_Garibaldi_Lake.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2893/topo_reg_map_of_garibaldi_neve_traverse.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2893/narrow_Garibaldi_Neve_Traverse_3205_Skiing_past_The_Sharkfin.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/garibaldi-neve-traverse-near-squamish-bc-2893",
    "stats": {
        "Activities": "snowshoe ski-bc",
        "From": "",
        "Seasons": "spring winter",
        "Stars": 4,
        "Time": "16 hrs",
        "Total Distance": "45 km",
        "Town": "Squamish, BC",
        "Type": "out-and-back"
    },
    "title": "Garibaldi Neve Traverse",
    "trail_id": "2893"
}