{
    "description": "Elevation gain: 1144m A beautiful hike or bike ride up Partridge creek valley. From the summit of Tally-Ho there are good views of Bennett Lake and the Coast mountains.Immediately after the trailhead at the creek, the trail becomes rock-strewn and a bit steep. But the surface and grade improve within 1km, and great for biking from then on. Follow the trail around the flank of Tally-Ho to the pass between Partridge and Stevens creeks. At the pass, there are roads going off in different directions and you will go downhill for a few 100 meters. As you descend, keep left and watch for a road going up the mountainside on your left. Go up this route and take the left fork when it branches. The road ends at some old mining trenches below the top.",
    "directions": "Drive south along the South Klondike highway and turn right on Annie Lake road. Drive 25km to the Wheaton River bridge. Road is unmaintained past here with some rough sections. Park at the gravelpit 8km past the bridge. This old exploration road forks in 800 m, turn left soon as crossing the creek.Copyright Yukon Conservation Society, used with permission. (Permission granted until January 2012.)For more information and additional trails please see the excellent guidebook: \"Whitehorse & Area Hikes & Bikes\" (the definitive guide to hiking and biking in the Whitehorse area) published by  Harbour Publishing, on sale by the  Yukon Conservation Society, supporting conservation efforts in the Yukon.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/YT/2897/reg_P1010195-27060.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/YT/2897/reg_tho1_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/YT/2897/topo_tho-map.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/tally-ho-mountain-near-whitehorse-yt-2897",
    "stats": {
        "Activities": "hike mtn-bike",
        "From": "",
        "Seasons": "summer",
        "Stars": 4,
        "Time": "7 hrs",
        "Total Distance": "20 km",
        "Town": "Whitehorse, YT",
        "Type": "out-and-back"
    },
    "title": "Tally-Ho mountain",
    "trail_id": "2897"
}