{
    "description": "NTS Map: 082J10\r\n\r\nA great area to go XC skiing if there is enough snow.  It's not as high as Peter Lougheed and is a little more inland from the Rocks so it gets less snow.  It does have 40?  More?  km of XC trails in a pleasant wooded setting.  I think all are Green or Blue rated and there is an abundance of maps & markings.  All trails seem to have some common links so you can add trails to get the workout you want.\r\n\r\nDown at the lower parking lot (South of the hiway #546) is a perfect little skating rink complete with an iced path to skate between the pond and the parking lot.  At the pond there is a few pick-i-nick benches and firepits.  If the weather is cooperating, I'd suggest having lunch there.\r\n\r\nThis trail is 19km West of and 200m higher than:\r\n\r\n\r\n\r\nClick Here  for Sheep River PP information. \r\n\r\nClick Here  for Sandy McNabb trail grooming information.",
    "directions": "Drive to Turner Valley and go West on HiWay 546 (a.k.a. Sunset Blvd and/or the West facing road at the 4 way stop sign) about 19km to the Sandy McNabb Recreation Area.  In the winter the hiway is barricaded here so it's especially easy to find.  You can park on the road or drive about 600m to a small parking lot on left side of road.  If you're not planning on XC skiing, you can drive down to the lower parking lot as well.  \r\n\r\nThe trails can be picked up where they cross the hiway and/or at the corrals near the hiway/access road.  You'll see some markers as you enter Sandy McNabb.\r\n\r\nOn the way back, the food, beer and Saturday afternoon open mike with talented Blues performers at the Black Diamond (3km East of Turner Valley) Hotel all get seven thumbs up (there was 4 of us and one only 1/2 liked it)",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/2898/long_ProfileJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2898/reg_DSC06352MediumJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2898/reg_DSC06361MediumJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2898/reg_DSC06371MediumJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2898/reg_DSC06391MediumJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2898/reg_DSC06392MediumJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2898/topo_planJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2898/narrow_DSC06357MediumJPG.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/sandy-mcnabb-kananaskis-trail-network-near-kananaskis-ab-2898",
    "stats": {
        "Activities": "hike ski-xc mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "10 km",
        "Town": "Kananaskis, AB",
        "Type": "out-and-back"
    },
    "title": "Sandy McNabb (Kananaskis) Trail Network",
    "trail_id": "2898"
}