{
    "description": "NTS Map: 092G07The Mount Seymour area has some fantastic snowshoe routes, which take you to various viewpoints looking back on the city of Vancouver.  Easy to get to, take Mount Seymour Parkway up to the top, basically to the same parking lot as the downhill skiiers (and past the mountain bikers hannging out on the lower part of the mountain).  From Vancouver, take either the Lion's gate or 2nd narrows bridge (2nd narrows being closer).  If taking 2nd narrows, your 2nd exit on the right will take you along Mount Seymour Road, and, you will look for Mount Seymour Parkway 5km or so on the left (at a mall). Road signs will help you. Turn left onto Mount Seymour Parkway and drive to the top.  Park in the skiers lot and walk to the far end of the lot, near the downhill lifts.  Our map (courtesy of Mount Seymour) shows trails on the right of the lifts however there are trails to the left of the parking lot as well(again at the end), which take you up various routes, somewhat more difficult than the marked trails shown here.  Overall a nice place to snowhsoe due to the proximity to Vancouver, the warming huts, food, and snowshoe rentals up top.",
    "directions": "See description and / or GPS",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/29/reg_KT-Slides-A02.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/29/reg_KT-Slides-A09.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/29/reg_SnowshoeSeymour.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/29/reg_topoShoe1.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mt-seymour-snowshoe-near-vancouver-bc-29",
    "stats": {
        "Activities": "snowshoe",
        "From": "",
        "Seasons": "winter",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "5 km",
        "Town": "Vancouver, BC",
        "Type": "out-and-back"
    },
    "title": "Mt. Seymour Snowshoe",
    "trail_id": "29"
}