{
    "description": "NTS map 082N08We approached Paradise Valley from the Fairview Loop, which starts at Chateau Lake Louise.  For the standard route, see note 1 at the end of this text.  The Fairview loop starts at the east end of the Lake Louise parking lot (the furthest end away from the hotel). The Fairview loop is a popular trail and is groomed. Updated GPS Note:   The GPS log now (Feb 2013) shows all the waypoints herein, plus a GPS tracklog from a winter trip starting at the Moraine Lake Road winter trailhead, up the road to the well signed Paradise Valley trailhead (300m past the first trailhead you see), up the trail just about to the 3rd (4th actually) bridge and back out from Paradise following the creek to Moraine Lake Road. And then down Moraine Lake Road to Tramline Trail and down tramline to the bottom parking lot by the railway station (free downhill coasting... wheeee!).",
    "directions": "The Fairview loop starts at the east end of the Lake Louise parking lot (the furthest end away from the hotel). The Fairview loop is a popular trail and is groomed. Note 1: The standard route described in Chic Scott's 'Ski Trails in the Canadian Rockies' starts from Moraine Lake. Given that it might be easy to miss the junction at the first meadow, I would reccommend the standard route to people who don't want to mess around with route finding (although that said, be sure to check out Scott's book. It is really not as straigtforward as to say 'just go to Moraine Lake', there are also a couple of intersections).",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/2903/reg_IMG_1220sml.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2903/reg_IMG_1221sml.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2903/reg_IMG_1226sml.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2903/reg_IMG_1232sml.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2903/reg_IMG_1233sml.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2903/reg_paradisevalley1copy.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2903/reg_paradisevalley2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2903/narrow_IMG_1234sml.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/paradise-valleylake-annette-near-banff-ab-2903",
    "stats": {
        "Activities": "ski-xc",
        "From": "",
        "Seasons": "winter",
        "Stars": 4,
        "Time": "7 hrs",
        "Total Distance": "20 km",
        "Town": "Banff, AB",
        "Type": "out-and-back"
    },
    "title": "Paradise Valley/Lake Annette",
    "trail_id": "2903"
}