{
    "description": "Topo map: 11L08\r\n\r\nThe Souris Striders cross country ski club run a lodge and trail system on the East end of PEI. The system consists of three trails, totaling 17K. The trails include a beginner (3.5K green) intermediate (6K Blue) and an advanced trail. (8K black diamond)\r\n\r\nHaving never before visted, we took an afternoon to explore the area, and were able to fit in one trail, given that we only had an hour. If one were to do things right, you would go for the entire afternoon or evening, for that matter, since they offer night-lit trails.\r\n\r\nWe selected the intermediate route because it was 6K in length. It runs through a mixed forest, and crosses the creek-size Souris River at a couple of places.\r\n\r\nThe hill climbs are long, and given the sticky snow conditions on our visit, seemed easy, but on a nice day, once could justify the intermediate rating after a couple of laps around.\r\n\r\nIn PEI, there are four primary XC ski centers, here,  Brookvale, the PEI National Park, and  Mill River Park. It's great that the the skiers of Eastern PEI have such a great facility, in such a short drive.\r\n\r\nShannon Burt\r\nEast Coast editor.\r\n\r",
    "directions": "Follow Route 2 to Souris, and once entering the town, look for a gas station, and Chapel Road. This turns into the Souris Line Road, or route 305. Follow it North for 6K, and you will see the parking lot and lodge on your left with the map sign.",
    "geohash": "f85x",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/PE/2911/reg_sign.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/2911/reg_snowyhead.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/2911/reg_xclodge.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/2911/topo_sourisstriderclub.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/2911/narrow_bluetrail.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/2911/narrow_sourisriver.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/souris-xc-striders-ski-club-near-souris-pe-2911",
    "stats": {
        "Activities": "ski-xc",
        "From": "",
        "Seasons": "winter",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "6 km",
        "Town": "Souris, PE",
        "Type": "out-and-back"
    },
    "title": "Souris XC Striders Ski Club",
    "trail_id": "2911"
}