{
    "description": "Papineau Labelle is only 2 hours from Ottawa and is easily one the jewels of the Montreal_Ottawa corridor for cross country skiing.  Fortunately or unfortunately, Ottawa XC skiers have 200km of groomed ski trails within 20 min of town so often overlook Papineau Labelle. Papineau Labelle is a wildlife preserve, essentially a provincial park run by SEPAQ.For those who discover it, there is almost limitless terrain ranging from forested slopes to wicked downhills.  The terrain is rolling to mountainous, and the ski routes in Papineau Labelle criss cross a large area to get to over 15 huts. Beginner skiers can find flat routes for the most part (along the old train tracks), it's just as scenic.  You won't see many people regardless of your route.Many people book early (say fall) to get the privelege of staying in a lovely cabin such as \"Heron\" - our lunch break on day 1, which is complete with two story winter lodge facilities.At this point -- just 10km or so from the information Center where you park --  a number of huts dot Lac Ernest. Many people ski in Friday evening, or perhaps early Saturday.  We however were destined for one of the furthest huts, De L'Avers, some 24km from Gagnon.  Fortunately, we noticed from the maps we'd pass many huts, and it is generally known that you can stop in any hut during the day for lunch.  This was very helpful for us, as we stopped at Heron, and then Fascinant.  However, we did not have much time to dilly dally in Fascinant, since it was getting dark.Our route provided us a somewhat rushed tour of the park, taking us initially in the somewhat challenging l'Ouest ski trails until we appeared at Heron.  After our break, we split into two groups, 2 of us wanting flat non-challenging terrain (the #3 road) until Fascinant, and the other two going for the roller coaster hills.  They eventually wound up on the choo choo (former train tracks) trail which is flatter and they caught up to us at Fascinant hut, where we were waiting and warming.Continuing onwards, we skiied another 8+ km into our cabin completing the top loop of a candy cane looking route into rustic De L'avers, consisting of one main room, and a bunk area.  But home sweet home greeeted us after 6 hours of skiing at 5km an hour.  Starting at noon may have made it a bit tight on time, but we had a lovely 45 min of moonlit skiing into our cabin that was magical, as we climbed 3km out of Fascinant, then sloped down for a few more to glide into our hut.And within minutes our group had the stove going, and the snacks and wine out.  It was so warm, we had to open windows.  Papineau Labelle SEPAQ staff get full marks here, they snowmobile in each night to make sure all of your group made it into the hut.  Although it wasn't particularly cold on our visit, this area can see -40 temps.  So be prepared for layering and unlayering.Other welcome items of hut life, propane stoves here, woodstove, water nearby, outhouse, and, a garbage bin, i.e. no need to pack everything out.  For a fee, you can even have your packs snowmobiled in.  However, we hauled it. The advantage of a hut is gourmet dinner, wine, spreading out, and socializing. For an article on hut life, click here.Day 2 our group had a gourmet brunch, and, packed up rather slowly.  Another late start, in part owing to our inability to control the hut temp the night before, it must have been +40 in there! Getting to sleep was tough.The route for day 2, some of the most incredible terrain I have ever skied.  It helped that it was -3 and sunny.  We skied through flat open areas, lightly forested with sun beaming on us. We then moved into an enchanted forest skirting the side of some rugged hills. This was my favourite area, not top technical, and, it seemed if there is a winter Shangri La, it is here. Birds plentiful, old growth trees, primordial rock, moss, and, the feeling of winter paradise. The group grew quiet and spread out as we each tuned into our surroundings, as if nature itself were our head phones. After a couple of hours we started our ascent into the mountains, stunning yes, difficult yes.  I hurt my foot and wished I had fatter back country skis with me. You can ski Papineau Labelle on skinny skis if you stick to the easy trails, like the train tracks from Gagnon up to the Lake Ernest huts. If you take the back route (as we did) home on day 2, make sure you have touring or back-country skis, as there are some black diamond descents and ascents that are quite challenging.  You could also be breaking trail, which slows you down.  Carry first aid, and be prepared.A full 6 hours from our start, we finally made our lunch break at L'Hote cabin.  We didn't realize we'd only be making 2km an hour progress on day 2.  We were enjoying the scenery like giddy children, but arrived at L'Hote in the dark, tired and rushed.  And still 10km to go!  A quick lunch /  dinner, and the group pushed on. I turned the GPS off here (L'Hote), so it is easy to identify L'Hote on the google map above. You'll see the portion of lake we skied on, and the picture to match.  For those with GPS, you can download the waypoints for this trip including L'Hote, Fascinant, De L'Avers, and Gagnon.Our group reassembled at about 8:30 to 9 p.m. at Gagnon Sunday evening, just enough time to drive into Papineauville for some famous Poutine and Pizza! We felt so very far away from Ottawa, and immersed in the mountains and culture of Quebec.  A wonderful trip but I'd schedule 3 days into this area to really get to know it. Our grand tour of 50km over two days with packs was challenging.  However we had the advantage of seeing a lot of terrain so we know what to come back for.  We loved the cabin at L'Hote, as well as Heron.  However, our cabin at the far reaches of the park gave us a feeling of being out there. Having everything we needed, we reveled in this cozy sanctuary amidst the snow, stars, and trees.Some practical info:- you must book a a hut for 2 nights min- unless you book within 7 days- Gagnon is several kilometers past the town of Duhamel, can't miss it- the SEPAQ staff are very helpful!- they will review the maps with you, and give each of you one- handy with a topo map, pick up 31 J 3 click topo maps above and order.See PDF map versions of Secteur Bondy and  Secteur Sourd.Cost: $22 pp per nightTo Book call SEPAQ at: 1 800 665 6527 then choose language, then  option #2.  The park office # 819 428-7510 may also be useful for specific questions on the park.",
    "directions": "Drive to Duhamel, Quebec, and drive through town another 5 or 10km up to Papineau-Labelle park, at the Gagnon information Centre, close to Lac Gagnon.  Park, see the staff, and, there is a washroom and change area (a common area) anyone can use to do final preparations.From here, you follow the map based on the route you want to take, in the direction of Lake Ernest and \"Heron\", or, perhaps \"L'Hote\" cabin west of you.  Easy options are the train tracks heading north, and there are more challenging trails, in particular the route from De L'Avers hut to L'Hote, as we did on day 2.our Route Summary:- Leave Gagnon, cross road at entrance (south) of centre- go 2.2 km on trail L'Ernestine- get to road junction, cross it- proceed on to L'Ouest trail, for rolling forest 3.8 km- at signed T junction, go right 3.1 km to Heron Cabin (don't take L'Hote direction)- From Heron, proceed to Fascinant either on choo choo trail on the other side of Lc Ernestine, or rollier options (see map), or road #3 if short on daylight- 8.2 km from Fascinant to L'Avers, bearing left, following map or GPS.* keep in mind there are almost limitless trail options and what seems like unlimited combinations of loops, so check in with SEPAQ staff -- and make sure they know your route.",
    "geohash": "f24",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/QC/2920/reg_diva_and_mike_lavers_hut.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/2920/reg_heronhutjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/2920/reg_lhote_pap_lab_via_lake.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/2920/reg_mike_pap_lab.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/2920/reg_papineaulabellelavershutjpg_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/2920/reg_poserspaplabwayinjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/2920/reg_rest_break_day_1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/2920/topo_AdrianatPapineauLabelleskijpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/2920/narrow_diva_lu_day_2.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/papineau-labelle-ski-huts-heron-to-de-lavers-near-duhamel-pq-2920",
    "stats": {
        "Activities": "ski-xc",
        "From": "",
        "Seasons": "winter",
        "Stars": 5,
        "Time": "14 hrs",
        "Total Distance": "50 km",
        "Town": "Duhamel, PQ",
        "Type": "out-and-back"
    },
    "title": "Papineau Labelle Ski Huts - Heron to De L'Avers",
    "trail_id": "2920"
}