{
    "description": "NTS Map: 011L06\r\nWhat does one do, when they have a forest for a back yard? You build a trail of course! This one was built by proprietor Larry Cosgrave, and he invited a number of us out for an impromptu snowshoe get-together late in the season.\r\n\r\nThe trail winds its way over  much of the most interesting terrain available. Most notable is the abandon (and I do mean abandon; as in grown in) rail line that farmers, back in the day, had available for shipping  access from their land. What remains now almost appears as a natural half pipe. The trail scurries up and down several times, as part of the joy-ride experience for mountain biking.\r\nOther obsticles include bridged-over stream crossings.\r\n\r\nOur excursion brought us through much of the trail, plus a bit of bushwacking where the trail became unrecognizable under snow.\r\n\r\nTrail access is available not only from Larry's home, but also from the main road, and from the rails to trails line. (Which glad to say, is not part of the trail system here!)\r\n\r\nShannon Burt\r\nEast coast editor\r\nThe dog's name is \"Jed\"",
    "directions": "From Charlottetown, Head out Route 1 to North River. Take a right at the intersection, and then take a left at the Kinkora road. Go along this road until you reach the Loyalist Road on the right. Travel this until you reach where the Rails to Trails crosses this road. You can access the trail from here.\r\n\r\nAlternatively, you can head out on route 2 West toward Hunter River, and look for the Loyalist Road on your left.",
    "geohash": "f85p2",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/PE/2922/narrow_marchparty09JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/2922/narrow_marchparty_08.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/2922/narrow_marchparty_10.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/larrys-trail-near-charlottetown-pe-2922",
    "stats": {
        "Activities": "snowshoe hike mtn-bike",
        "From": "",
        "Seasons": "winter fall summer",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "3 km",
        "Town": "Charlottetown, PE",
        "Type": "out-and-back"
    },
    "title": "Larry's Trail",
    "trail_id": "2922"
}