{
    "description": "The Cow Head Lighthouse Trail is probably one of the most underrated trails in the whole Gros Morne area. It is a short 4km half day hike that is very easy but it can be turned into a full day of learning and adventure if you yearn to learn. \nThe trail is located on the Cow Head Peninsula or \"The Head\" as it is commonly known. The head itself is connected to the mainland only by a narrow isthmus, just wide enough for a two lane road, as has historically been the centre of fishing activity for this part of the coast. Families used to live here during the summer fishing season and return to the \"winter side\" of the bay, which is the current site of the community, in the fall.\nThe start of the trail is at the community outdoor theatre near the communication tower. The trail itself winds through a thick medieval looking forest with tunnels of tuckamore lining the sides in between open areas. There are a couple of viewing platforms built along the way offering views of the Gulf of St. Lawrence and the expanse of the inland coastal lowlands and the Long Range Mountains. After the trail crests the top of the head it turns back towards the ocean and the lighthouse itself. \nThe lighthouse was built in 1909 and was used as a beacon for passing ships for over five decades. It was manned until 1960 when it was modified to be an automatic beacon. The lighthouse is no longer in use but you can go inside and get a feel of the history within those walls.\nFrom the lighthouse you can take three different trails. The first returns to the parking lot near the theater. The second one goes out onto the coast at Sandy Point where you can walk among the 500 year old breccias that makes up the beach. The third trail will lead you to the point of the head which will also take you down onto the beach if the tide is right.\nCow Head Peninsula is a geologist's paradise. The 500 million year old rocks are world renowned as the only rocks showing the boundary between the Cambrian and the Ordovician Eras. The strange landscape looks out of place, even in Newfoundland and is a great place to explore.\nYou may also come upon evidence of archaeological digs in the area. Archaeologists have removed over 200 artifacts from three sites on the head. They represent 3 groups the Maritime Archaic, Groswater, and Dorset Eskimo, dating back 4500 years. Cow Head chert (a hard silicate rock used for tools by the natives) has been found as far south as New England and as far north as Ramah Bay Labrador.\nDespite the usual windy conditions that accompany most hikers to the head it is a great place to explore and have fun. The trail is easy and the beaches can easily be traversed with a little caution. Anyone who has an extra afternoon in Gros Morne should do this trail and learn about the history of this rare and precious area.\nRyan Young\nNewfoundland Editor",
    "directions": "Cow Head is at the northern tip of Gros Morne National Park. Just follow route 430 (viking trail) from Deer Lake north to Cow Head. aprox 1 1/2 hrs. The trail begins at Cow Head Penninsula at the end of Pond Road.",
    "geohash": "f8y",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NL/2930/long_IMG-0735-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/2930/reg_-MG-0756-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/2930/reg_4768128167-b91541633b-m-30193.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/2930/reg_4768780856-089aced686-m-30193.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/2930/reg_IMG-0718-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/2930/reg_IMG-0719-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/2930/reg_IMG-0724-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/2930/reg_IMG-0730-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/2930/reg_IMG-0733-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/2930/reg_IMG-0762-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/2930/reg_IMG-0774-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/2930/reg_IMG-0779-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/2930/narrow_nf120006jpg.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/cow-head-lighthouse-trail-near-cow-head-nf-2930",
    "stats": {
        "Activities": "hike snowshoe",
        "From": "",
        "Seasons": "winter fall summer spring",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "4 km",
        "Town": "Cow Head, NF",
        "Type": "out-and-back"
    },
    "title": "Cow Head Lighthouse Trail",
    "trail_id": "2930"
}