{
    "description": "This easy 4km trail begins near the town of Woody Point in the southern portion of Gros Morne National Park. It is the only park trail that really lets you appreciate the magnificent spectacle that is the Tablelands. The 600m plateau rises up above Bonne Bay like a red giant, dominating the landscape. This 500million year old mountain chain was created when a large slab of the Earths mantle was thrust up through the surface. The peridotite rock visible here usually lays buried 12km underneath the surface.The trail follows an old road from the parking lot to the start of Winterhouse Brook Canyon. It winds its way through the alien red rock that would look more at place on Mars than on Earth. Glaciers have carved the shape of the mountains and several large canyons remain as a reminder of the last ice age.The plant life on the tablelands is also quite rare and unique. The rare isolated pockets of serpentine barrens give rise to a full community of arctic alpine species. Many of the dwarf plants that grow here may be hundreds of years old and less than an inch tall. The harsh environment has forced many clearly noticeable adaptations on the local flora. A small stream at the end of the trail makes for an excellent resting place and is a great little spot for photographers or artists. The rocks near the stream are composed of green serpentine and sometimes form patterns that look similar to snakeskin.The Tablelands hike is very short hike that can be done in two hours but it is a must do for all visitors to Gros Morne National Park. The geology here is a major reason that the park was established and a huge factor in receiving recognition from UNESCO. This amazing place offers spectacular scenery that can be seen nowhere else in the world. If you visit western Newfoundland don't put this one off.",
    "directions": "Take route 430 (viking trail) north from Deer Lake to Wiltondale. Then turn left onto route 431 and follow it to the town of Woody Point. Turn left at the exit to Trout River and watch for the sign that signals the trailhead.",
    "geohash": "f8yc",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NL/2931/reg_tl1-8764.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/2931/reg_tl2-8764.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/2931/reg_tl3-8764.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/2931/reg_tl4-8764.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/2931/reg_tl5-8764.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/2931/reg_tl6-8764_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/2931/reg_tl7-8764.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/2931/reg_tl8i-8764.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/2931/reg_tl9-8764.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/tablelands-near-bonne-bay-nf-2931",
    "stats": {
        "Activities": "hike ski-bc",
        "From": "",
        "Seasons": "winter summer",
        "Stars": 5,
        "Time": "3 hrs",
        "Total Distance": "4 km",
        "Town": "Bonne Bay, NF",
        "Type": "out-and-back"
    },
    "title": "Tablelands",
    "trail_id": "2931"
}