{
    "description": "The trail to Bakers Brook Falls begins at Berry Hill Campground just a few kilometers north of the town of Rocky Harbor in Gros Morne National Park. The 4.5km trail is very flat and easy in all but very wet conditions. There are boardwalks built over most of the wettest sections making the trail accessible for most of the year.\n               The trail itself runs through the black spruce and balsam fir stands that make up the majority of  the coastal forest that runs through the park. Plenty of fallen trees line the forest path but there is not a lot of interesting scenery to catch the eye. Moose, Squirrels, and Grey Jays are the most common wildlife to be seen, with the occasional fox mixed in for good measure. There are lots of wildflowers growing beside the trail for those who take interest in the local botany. The provincial flower of Newfoundland, the Pitcher Plant, is just one of many to look for. \n              Despite the lack of awe inspiring adventure on the trail, the falls themselves are an amazing sight. Only 10 meters high, it is not their height that distinguishes them but the way they have been created. There are several different sets of falls staggered along the river. Together they make a long continuous series of ledges and drops before reaching the big falls at the end.  You can even swim beneath the falls during the summer months when the water is warm. \n               This trail is suitable for all ages and skill levels and offers some great photo opportunities.\nRyan Young\nNewfoundland Editor",
    "directions": "Take route 430 (viking trail) north from Deer Lake to Berry Hill Campground, located 1km north of Rocky Harbour. The trailhead is located in the campground parking lot.\nmap 12h/12",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NL/2932/reg_All--62849.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/2932/reg_bbfallsjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/2932/narrow_bbfalls2jpg.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/bakers-brook-falls-near-bonne-bay-nf-2932",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "10 km",
        "Town": "Bonne Bay, NF",
        "Type": "out-and-back"
    },
    "title": "Bakers Brook Falls",
    "trail_id": "2932"
}