{
    "description": "Elevation gain: 200 meters.\r\n\r\n\r\n\r\nThis is an easy, but scenic trail to a small lake via spruce and aspen forests. Views of Lake Laberge and the valley of the Yukon river are also seen from the ridges and there are nice rocky outcrops as well along the way. Good route for a hike or bike ride.\r\n\r\nAfter a right turn at the T intersection, you continue on the main trail through the forest, which is used by locals riding some trucks or ATVs also. Side trails lead off to Grizzly valley and other forks are logging roads as well. Upon reaching the lake you can follow the east side for a while until it gets too boggy. In winter you can continue on skis towards the Takhini area. \r\n\r\nYou can return to the parking by taking a steep sandy road downhill to the right from the lake and it leads you to powerlines which can be followed back to the trailhead.\r\nCurrent conditions:\r\n\r\n\r\n\r\n\r\n\r\n\r",
    "directions": "\r\n20 km drive north on N Klondike hwy, park across from Horse creek road. No trail signs. Park by small pond and walk up the road 500 m, where you take the left fork and shortly right at a T-intersection.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/YT/2939/reg_mlk16JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/YT/2939/reg_mudl1-8779.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/YT/2939/reg_mudl11-8779.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/YT/2939/reg_mudl2-8779.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/YT/2939/reg_mudl3-8779.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mud-lake-near-whitehorse-yt-2939",
    "stats": {
        "Activities": "hike mtn-bike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 3,
        "Time": "4 hrs",
        "Total Distance": "12 km",
        "Town": "Whitehorse, YT",
        "Type": "out-and-back"
    },
    "title": "Mud Lake",
    "trail_id": "2939"
}