{
    "description": "\"It was, then it wasn't, and finally, is once more.\"\nThe Fitspatrick mountain trail tells a story about trail use that unfortunately, other trails never live to tell. Back before 2000, my mom took me out on this hike. I have no idea where she heard of it, but it was a linear path, and god knows how we would get back to our car, unless we walked the road back. Back then, a great trail \"it was.\"\nAt that time, it was a great trail. All single track, and offered one a real feeling of remoteness. Fast forward years ahead, to around 2001/2002 and I take a friend on the same trail, looking to share the same discovery I experienced way back when. This time, the single track now doubled, and visibly damaging the landscape, as streams found their way through deep ruts created by spinning wheels. It turned out that a local land owner took a liking to ATVing, and rerouted the trail to his place. Even as we hiked, a family came through on their rigs. The great trail now \"wasn't.\"\nIt was a joy to hear that during my last summer's trip to the Cape George region, that I heard that the Mountain bike group from New Glasgow has reclaimed the trail. Now banned from ATV use, the trail was brought back to health, and frequently used by the area's mountain bike groups for weekly rides. During the summer of 2006, they held their first race on the trail, and it was a successful event. By all accounts, the Fitzpatrick trail \"is once more!\"\nAs part of our small trip during March Break, we came home through the area, and had the chance to sample the trail once again. I am pleased to report first hand that the trail is in a much better state then it was when overtaken by ATVers. I have noted that there are still parts that suffer from the double track appearance, but the health of the trail is certainly back again. I certainly think it goes to show that when a dedicated group of trail users like mountain bikers lay claim a trail, things really improve. I believe they could learn a few trail management techniques in terms of waterway management, but never the less, they have done a great job restoring a great trail for use by hikers and bikers.\nSome highlights to the trail include the great terrain you'll pass through. There are two new windmills up on a hill, and serve as great land marks. The portion past the chalets still have a double track characteristic, but before the chalets, the trail is beautiful technical single track. There is a split in the trail at the chalets, and may be from the race development, but offers an additional path that looks to be a fun ride, and a great hike as well. This is a premier day hike destination by my standards.\nTo see the status of the current trail system, I was able to find a pdf of all the trail circuits that go well beyond the original Fitz trail. Find it  HERE!\nShannon Burt\nEast coast editor\nTrailpeak.com",
    "directions": "head to scotsburn, and look for their comminuty ball diamond. The trailhead is behind the tennis courts.\nAccessible at Scotsburn behind recreation grounds at route 256, and from Millsville, less than one-half km along Elmfield Rd. from the Herman Church Cairn at the intersection of Millsville and Elmfield Roads. This trail was developed entirely by the Pictou County Trails Association, with the cooperation of the landowners along the route.\nAlternatively, head to StoneAme Challets, and you'll easily find trail access there.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/2957/long_20170430-153249-58567.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/2957/long_20170430-155854-58567.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/2957/reg_18260918-10158580262860075-840723992-o-58567.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/2957/reg_18296972-10158580242680075-883642628-o-58567.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/2957/reg_20170430-142413-58567.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/2957/reg_Fitzpatrick-Mountain-Trails-BMP-24258.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/2957/reg_best1_marchbreak_36.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/2957/reg_marchbreak_16.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/2957/reg_marchbreak_19.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/2957/reg_marchbreak_21.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/2957/reg_marchbreak_38.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/2957/narrow_2011-11-13-08.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/2957/narrow_20170430-165758-58567.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/2957/narrow_20170430-172133-58567.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/2957/narrow_marchbreak_12.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/2957/narrow_marchbreak_34.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/2957/narrow_marchbreak_40.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/2957/narrow_marchbreak_48.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/fitzpatrick-mountain-trails-near-new-glasgow-ns-2957",
    "stats": {
        "Activities": "snowshoe hike mtn-bike",
        "From": "",
        "Seasons": "winter fall summer",
        "Stars": 4,
        "Time": "6 hrs",
        "Total Distance": "15 km",
        "Town": "New Glasgow, NS",
        "Type": "out-and-back"
    },
    "title": "Fitzpatrick Mountain Trails",
    "trail_id": "2957"
}