{
    "description": "Constructed around 2000 as a community project, the Lennox Island trail takes you through pretty much the entire island land mass. Situated on a reserve, this community trail was constructed in order to honour their forfathers.The trail showcases the nature of the land and the protected bay. Peat is a common natural resource in the area, and the trail takes you through one such area. It's an easy, level ground path, but I rate it as average due to its extended length.My trip through the area was in winter, and I found no posted map indicating the total length of the trail network. Let's just say that the trail is bigger than the couple of hours I expected to spend. Though well marked, and with beautiful views, the trail needs some work in mapping signage.I think the trail by winter would be the most ideal as a snowshoeing or xc skiing venture. I recall the bugs in summer to be a killer! No doubt that was the reason I kept seeing many bat houses in the trees!",
    "directions": "Off route 2, Look for Elerslie and route 12 which takes you onto Lennox Island reserve. The trailhead is easily found from there. Background can be obtained from the info center.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/PE/2958/reg_69361247-447464005841323-7036564935307952128-n-63404.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/2958/reg_69529094-436807423592026-7139616546657140736-n-63404.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/2958/reg_IMG-2287-63404.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/lennox-island-memorial-trail-near-summerside-pe-2958",
    "stats": {
        "Activities": "snowshoe hike ski-xc mtn-bike",
        "From": "",
        "Seasons": "winter fall summer",
        "Stars": 3,
        "Time": "3 hrs",
        "Total Distance": "10 km",
        "Town": "Summerside, PE",
        "Type": "out-and-back"
    },
    "title": "Lennox island memorial trail",
    "trail_id": "2958"
}