{
    "description": "NTS Map: 082J15This is a literally a walk in the forest, there is no trail. It's pleasant up hill walk to an open area on top a a small hill that has good view of several peaks to south and Prairie Mountain to the west. If you want to do an off trail hike this is the one to do.Ben's Hill is probably not the official name of this hill but there is a circle of rocks with the name Ben inscribed there and what seems like a monument so it's it seems fitting to call it Ben's Hill.You will need to use a GPS to do this one and follow the way points to the top. Park at WP 1, cross the road and go up hill to towards WP2, from then on head upwards towards the Circle waypoint. You could follow the creek but I suspect you would come right to the Shell Gas compressor station. When close you'll hear the compressor station.We did this March 24 and there wasn't much snow around. It's generally up hill but doesn't feel that steep. It's a slower walking without a trail as you frequently have to go around blown down trees. There is a good chance of seeing wildlife in the forest",
    "directions": "Park at Way Point 1 and follow the GPS route to the circle at top.Point 1 is on Hiway 66, 15.8km West of the *second* (more westerly) entrance to Bragg Creek.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/2963/long_IMG-7878-900x467--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2963/reg_BensHill-c-7279.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2963/reg_BensHill-f-7279.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2963/reg_BensHill-m-7279.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/bens-hill-near-kananaskis-ab-2963",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring summer fall winter",
        "Stars": 3,
        "Time": "3 hrs",
        "Total Distance": "7 km",
        "Town": "Kananaskis, AB",
        "Type": "out-and-back"
    },
    "title": "Ben's Hill",
    "trail_id": "2963"
}