{
    "description": "Elevation gain ~ 1,000 m\r\n\r\nIn the summer this ridgewalk would be an easy walk-up. It is a suitable early season route and was a good learning experience for myself for scrambling in winterish conditions. Note: on most maps, this is an un-named summit that is connected to Mount Galwey and is in fact higher than the named summit. My hiking companion J remembers seeing a map on the road lookout (between Waterton and Pincher Creek) that calls it 'The Horn'. \r\n\r\nQuick summary of the day: \r\n- 9AM arrived in Waterton Park and parked next to the Buffalo Paddocks. Proceeded to hike into Horseshoe basin. \r\n- We took an extra hour down a route that I had convinced J would be a short cut. It was quite cloudy and by the time we could see through the mist to where the route was going, it was clear that the next ridge over accross the valley to the north was the better option (and the option that J had scouted out from the highway). So we dropped back down 200-300 m to the valley and got to the base of the other ridge by noon. Funny how shortcuts work sometimes! (Note: The correct route is shown on the maps in this posting).\r\n\r\n- Mountain weather! The mountain Gods were displeased with us. When we started out at the Bufflo Paddocks it was a bit rainy, but higher up we were in a full fledged snowstorm. We were immersed in clouds on the ridge and our views completely disappeared, but every now and then the clouds would part a bit and we would get glimpes of the prairie to the east and the ridges and peaks around us. The clouds and the mist made for some ethereal views. We made it to the summit by 2:30... It was blowing really quite hard on the upper parts of the ridge and I just froze my hands off for about an hour or so. We didn't stick around up high for too long and by 4 PM we were already about halfway down when the clouds lifted and we could see the summit. It was as if the mountain was mocking us and saying, \"Happy April fools day, FOOLS!\"\r\n\r\n- Completely bagged. We made it back to the valley bottom by 5 PM and were back at the cars by about 7:15. All in all it was a good day. A good test of our endurance, considering this was the first long hike of the year for both of us!\r\nCurrent conditions:\r\n\r",
    "directions": "Starts at the Buffalo Paddocks. Cross the slew going west and you will see a sign for Horseshoe basin.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/2967/long_2mergedshotonridge4jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2967/long_NGalweyrouteGE0.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2967/long_NGalweyrouteGE3.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2967/long_NGalweyrouteGE4.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2967/reg_1startingoutJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2967/reg_2zonsummitridge2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2967/reg_3isclearingupnowthatwearealmostdown.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2967/reg_NGalweyrouteGE1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2967/reg_NgalweyrouteGE2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2967/topo_NGALWEYjpg.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/north-summit-of-galwey-near-waterton-park-gate-ab-2967",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "9 hrs",
        "Total Distance": "18 km",
        "Town": "Waterton Park Gate, AB",
        "Type": "out-and-back"
    },
    "title": "North summit of Galwey",
    "trail_id": "2967"
}