{
    "description": "Dingee trail\nThis set of trails was originally cut for the purpose of forest management by the local land owner. Starting at the driveway, the route follows a rough log road, beside a field on the property. The trail narrows as it enters a stand of softwood, and continues to climb east, toward a log road running North / South off the Campbell Hill Road. Turning right takes you toward a field where you need to cross a fence. Return west toward the house to complete the route. The field offers great views of the surrounding hills, the Saint John River and the silhouette of Maine's Mount Katydin, off to the South West. \nAn alternative is to follow a parallel trail along the Campbell Hill road off the same field, and follow it to the same log road. Instead of branching off the log road to access the field, continue left on the narrow road to continue further into the woods.\nBy winter, with fresh snow, the forest looks stunning. I snow shoed these trails just after an Easter snowstorm. It was an incredible experience to find so much snow (knee deep) when back at home, our Winter had come to a close.\nShannon Burt\nEast Coast editor",
    "directions": "Off of Route 2 passing Florenceville, take the exit, and follow the road to Bath, and then toward Bristol. Pass the liquor store, and take the next right up toward the Crabb logging mill. You'll see signage to bible camps and what not. This is the Campbell Hill Road to the right. Follow this until the road narrows and almost becomes a well maintained dirt road. You'll see a two story home on the hill to the right. Its driveway takes you to the trail head. Be courteous, and let the land owners know you're on the trail. Note that the Shiktahawk trail and river are along the way to this trail. A great sequence of routes if you're out mountain biking, and want to chain together a longer run.",
    "geohash": "f",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NB/2971/reg_IMG_3068.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/2971/reg_IMG_3081.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/2971/reg_IMG_3086.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/2971/narrow_IMG_3071.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/2971/narrow_IMG_3072.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/dingee-trail-nb-near-bristol-nb-2971",
    "stats": {
        "Activities": "snowshoe hike ski-xc mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "6 km",
        "Town": "Bristol, NB",
        "Type": "out-and-back"
    },
    "title": "Dingee Trail, NB",
    "trail_id": "2971"
}