{
    "description": "MWSC Nordic Heritage Ski Center\nWhat a way to wrap up the '07 winter season with a bang! Traveling from snowless PEI to New Brunswick, a surprise Easter snow storm dumped around a foot of snow on a wide ranging area, breathing new life to the transitioning winter season. Take those skis out of storage, and gather up the winter gear. There's snow!\nIf you do any research on trails in Northern Maine, you'll notice that several specialized facilities (Maine Winter Sports Centers) and just about every community's high school has some sort of cross country trail system. This is the result of a trust by a Maine woman who donated big dollars for the area to develop winter activities to promote both fitness and winter sport. The way it was organized, it was also meant to contribute to the communities' economic welfare through trail building and events. From what the locals tell me, it's been a success on all accounts.\nThe Nordic Heritage Ski Center is but one shining example of this. It's a world class cross country facility, ranked, by what was told to me, fifth in the world. Located North of Presque Isle, Maine, it offers year round activities with top notch mountain bike trails, XC ski trails, a telemark slope, roller skiing, and a biathlon range.\nI was very impressed with the scope of the facility. The location offers wax huts, a lodge with a sauna, kitchen facilities, and social area all free to use. No fees or membership is imposed to use the trails and buildings. It was a week into April, and we just had a major Easter snow storm, piling a foot of snow on to almost bare ground. This was enough snow to extend the season into mid April for sure.\nI sampled some of the 20K of ski trails, starting with the set of night-ski lit intermediate \"ROTARY\" loops to the east. I moved on to Presque Isle Loop, and began to wrap up my visit with a sampling of Over the Mountain.  Somewhere along the way, I spilled on to the Fort Fairfield loop, and then joined a fellow skier on Gallagher Loop to conclude my visit. Some of the signage needs revamping, but the error gained me some welcome company that day. The trails take great advantage of the hill where they're constructed. Great switch-back climbs and descents make the variety of trails both challenging and appealing to all levels.\n-Shannon Burt\nEast coast editor\nThr trails were designed by John Morton of Thetford Hill, Vermont. He's an Olympic skier and coach, as well as Rich Edwards of the International Mountain Biking Association. By winter, the 20 miles of mountain bike trails double as snowshoe trails. Also, with the mention on their website of a tele slope, I'll remember to take along my Tele skis and skins for next year.",
    "directions": "Between Presque Isle and Fort Fairfield Maine, on Rte 167, look for their sign and enterance road.",
    "geohash": "f2r9y",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/ME/2974/reg_IMG_3093.jpg",
        "https://trailpeak.com/storage//content/trails/US/ME/2974/reg_IMG_3094.jpg",
        "https://trailpeak.com/storage//content/trails/US/ME/2974/reg_IMG_3095.jpg",
        "https://trailpeak.com/storage//content/trails/US/ME/2974/narrow_IMG_3092.jpg",
        "https://trailpeak.com/storage//content/trails/US/ME/2974/narrow_IMG_3096.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/nordic-heritage-ski-center-near-fort-fairfield-me-2974",
    "stats": {
        "Activities": "snowshoe hike ski-bc ski-xc mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 5,
        "Time": "5 hrs",
        "Total Distance": "20 km",
        "Town": "Fort Fairfield, ME",
        "Type": "out-and-back"
    },
    "title": "Nordic Heritage Ski Center",
    "trail_id": "2974"
}