{
    "description": "Aroostook State Park, Maine\nDuring the Easter long weekend of '07, we had a gracious dumping of fresh snow, extending the pretty much exhausted snow season well into April. With the snow in mind, I researched some XC trail opportunities, and came up with Aroostook state park as part of my itinerary.\nApparently, this park was the first to be given state park status, and no wonder. It offers activities for us outdoor minded individuals year-round. With its 600 acres and great ranging geography, it's a haven for adventure.\nBy winter, it has a number of XC ski and snowshoe trails taking advantage of its hilly terrain. Some of the snowshoe routes are steep! With a hill of a mountain, the look offs are truly rewarding.\nI took it upon myself to tackle Quoggy Jo Mountain trail, which circumnavigates the hill, with the addition of a look off spur trail. (In fact, Quaggy Jo is the shortened form of its Indian name, Qua Qua Jo which translates to twin peaked.) I say tackle because the trail had not been groomed, so I set to the task of breaking trail in almost knee deep snow. At times the snow was wet, and stuck to the bottom of my narrow xc skis, making this truly an exhausting endeavor. I wished that I had my BC skis on this trip. \nThere are a number of named sections along this route, aptly describing the terrain. The first hill you encounter, \"Rocket Hill\" and further on, \"Roller Coaster Hill\" is a great example of this. I was however, determined (and successful) to do the loop and see the look-off view.\n I noticed several snowshoe trails leading to the same look-off point. I had snowshoes with me in the car, but wished I had more time to spend in the park. Given the number and variety of the trails, I think one could easily spend a day or two taking it all in. I also noticed camp sites at the top of the mountain look off trail. Given the snow, I couldn't help but think of the winter camping potential, though I don't know if it's permitted. Their website says that they charge fees to use the park year round, but I paid nothing to use the trails.\nBy Summer, with the lake, the range of activities grows even more. (why i put canoeing in the list of activities.) I certainly plan on revisiting this park in the Summer and Fall. \n-Shannon BurtEast coast editor\nThere are more trails in the offering: (taken from their website)\nHiking on nearby Quaggy Jo Mountain and trout fishing on Echo Lake are popular local activities. \nNorth Peak Trail: (1.25 miles) Starts at the day-use parking area. Scenic views through upland hardwoods and conifers.\nNorth-South Peak Ridge Trail: (1 mile) This trail meanders along the ridge between the two peaks through areas with diverse forest floor vegetation.\nSouth-Peak Trail: (.75 mile) Steep and rugged, but an interesting climb starting from the campground and following a rocky outcrop to the peak. \nThe 4 mile cross-country ski trail can also be used as a summer hiking trail. Some of the Park trails leave park property, and abutting land owners have given permission to the visiting public to access the land. Please respect landowners' rights as well as their property.",
    "directions": "Look for the signs along Route 1 approaching Presque Isle, Maine from the South.",
    "geohash": "f2r9h",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/ME/2976/reg_IMG_3098.jpg",
        "https://trailpeak.com/storage//content/trails/US/ME/2976/reg_IMG_3100.jpg",
        "https://trailpeak.com/storage//content/trails/US/ME/2976/reg_IMG_3111.jpg",
        "https://trailpeak.com/storage//content/trails/US/ME/2976/reg_haystackinback.jpg",
        "https://trailpeak.com/storage//content/trails/US/ME/2976/narrow_IMG_3105.jpg",
        "https://trailpeak.com/storage//content/trails/US/ME/2976/narrow_IMG_3107.jpg",
        "https://trailpeak.com/storage//content/trails/US/ME/2976/narrow_snowshoeroute.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/quaggy-jo-trail-aroostook-state-park-near-presque-isle-me-2976",
    "stats": {
        "Activities": "river-canoe hike ski-bc ski-xc mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "8 km",
        "Town": "Presque Isle, ME",
        "Type": "out-and-back"
    },
    "title": "Quaggy Jo trail, Aroostook State Park",
    "trail_id": "2976"
}