{
    "description": "April 7th, 2007\r\n\r\nIt was a really cloudy day as we started our way towards Cloudy Ridge. The clouds were hanging pretty low, maybe 1,200 feet above us and we couldn't see any of the summits. It was a good day for practicing map and GPS navigating skills.\r\n\r\nWe fought our way up the steep and snow covered cutline (the boundary of Waterton Lakes National Park; see map) up onto the lower part of the ridge and passed some bear tracks in the snow. We passed lots of bear tracks on this route, so be bear aware in this area... make noise and hike with a group.\r\nWe made it to our destination of the day - a little nub just below the clouds - and took a bit of time to snap some photos.  At 3:15, just as we were leaving to return to the cars, the clouds suddenly started to disperse! In excitement, I ran halfway up to the next nub and took a bunch more photos. It was cool to finally see all the summits and ridges around us. It was also shocking to see just how far off we were from the true summit. I thought we would be about halfway, but we were still 800 metres below the top of Cloudy Ridge, having ascended about 400 metres to the two 'nubs'. \r\n\r\nWe dropped down the cutline and discovered a big rotting carcass of a dead cow near the oil-road. Perhaps the bear had eaten its fill of this dead cow and was hanging aroud? There was no evidence of the bear being around there recently, though.\r\n\r\nA good day, considering the strange weather. Plus, we figured out a possible route to the summit for another day.",
    "directions": "Take highway 6 from Pincher and turn right (west) on township road 34. Turn south (left) on range road 303. Either drive to the barricade and follow our route, or park a little ways back at the gate and follow the gravel road for a couple of kms towards the gas plant.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/2977/long_08mergedshot1ofdungarvansmljpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2977/reg_05viewtowardsthesouthJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2977/reg_07summitofcloudyridgeJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2977/reg_MBDungarvanisawesomeonthisdaycopyjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/2977/topo_cloudyridgehikebjpg.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/cloudy-ridge-near-pincher-creek-ab-2977",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "8 hrs",
        "Total Distance": "12 km",
        "Town": "Pincher Creek, AB",
        "Type": "out-and-back"
    },
    "title": "Cloudy Ridge",
    "trail_id": "2977"
}