{
    "description": "Elevation Gain: ~3,000 ft (~900 m). A classic off-trail scramble in Glacier National Park, Montana (USA). \nI did this hike on an extremely windy day in the fall of 2006 with some friends from the Chinook Outdoor Club from Lethbridge (Alberta).\nWe itended to ascend to the summit of Mt. Piegan and also bag Mt. Pollock and Bishop's Cap, which are quite close by and easily summited by the connecting saddle from Mt. Piegan. It was so windy that I was actually knocked off my feet a couple of times, so we cut our losses after summitting Mt. Piegan and returned back by the Piegan Pass trail. \nThe most straightforward route is to approach the summit by parking at the Siyeh Bend in the Going to the Sun Road, and hiking up the Piegan Pass trail to the saddle between Pollock and Piegan. Another approach is to drive slightly further up the road and hike straight up the drainage, as shown on the attached map.Note: Submitted GPS data is just a waypoint shot or two on the summit ridge.\n Generally Class II(II) all the way, depending on the route taken, although there are class IV and V routes available if so desired!\n See also the Piegan Pass Trail, also on Trailpeak.",
    "directions": "Going to the Sun Highway. Either park up at the Siyeh Bend or further up at the Lunch Creek parking spot (we completed a loop by starting at the Lunch Creek drainage and descending to the big bend by the Piegan Pass hiking trail, then walking back along the road to our cars). It is recommended to check the Glacier National Park website for conditions on the road before heading out in early summer as the road is often not fully open until late June or early July.",
    "geohash": null,
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/MT/2980/long_01500011.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/2980/long_01500014copy1.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/2980/long_01500022.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/2980/reg_01500001jpg.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/2980/reg_01500005adjustedjpg.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/2980/reg_01500006JPG.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/2980/reg_01500010JPG.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/2980/reg_01500017.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/2980/reg_01500021adjustedJPG.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/2980/topo_01500012.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/2980/topo_pieganmtnajpg.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/piegan-mountain-glacier-park-montana-near-babb-mt-2980",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 4,
        "Time": "8 hrs",
        "Total Distance": "0 km",
        "Town": "Babb, MT",
        "Type": "out-and-back"
    },
    "title": "Piegan Mountain (Glacier Park, Montana)",
    "trail_id": "2980"
}