{
    "description": "The Spruce Lake High Trail is one of the more common ways to access this section of the Southern Chilcotin and the Taylor Range. Snowfall is abundant in the area and the snow pack will surprise first time visitors who may be anxious on the disturbingly dry drive from Lillooet to the trail head. Even at the trail head the snow pack may seem on the shallow side. Have no fear as this changes rapidly with some elevation.\nThe Taylor Range is bounded by Gun Creek on the south and west and Tyaughton Creek on the north and east. The rest of the Chilcotin is more difficult to access in winter, involving either a long approach or a heli drop (which can be arranged through Tyax). The exception to this is the Dickson Range to the SE, which appears to have lots of possibilities and is more rugged in nature. There is a private locked cabin in the Eldorado basin (available for rental in winter), and a private cabin in the Taylor basin (generally buried in winter). The skiing is more mellow here than the coast, but there are many very nice 25-35 degree open alpine ridge lines and tree runs. One must be careful to note the prevailing SW winds, as they are often strong, especially high in the alpine, and some areas can be severely scoured (notably at Camel Pass). These can lead to substantial wind loading on lee slopes.\nTo access the Taylor range via the Spruce High Trail (the most convenient way), head up the old 4x4 road for about 1km, past several branches until you reach a fork under a craggy unnamed peak (1300m). Take the left (west) branch. After about 2km you will reach the edge of the park. At this point all signs of snowmobile traffic disappears (or it should!). Continue several more km to the sub alpine below an unnamed peak of 2150m. Good camping opportunities can be found here (just be careful not to camp on the heli pad!). There are two options at this point. The first is to contour NW below the NW ridge of the peak 2150 to Camel Pass. This is the most expedient route to get to the Taylor cabin. If you are camping and are looking for some great skiing, the best is to head straight to peak 2150 and drop down the other side. Be careful in doing so as there will be a cornice, which tends to diminish to the NW. If you are heading for the cabin, the final ascent to Camel Pass is best done by boot-packing, as this area is particularly wind buffeted.   \nThis trip can be done in two days, but as there is so much terrain to explore, three or four are recommended.  Great skiing can be found all over the Taylor range. The drainage to the north of peak 2150 has some nice 1000' runs on SE facing slopes, and good protected camping in the basin. Good tree skiing can be found above the Taylor basin proper on north facing slopes. Big open slopes are available above the Taylor cabin area, but are best reserved for times of low avalanche risk, as these will tend to be wind-loaded.\nMaps:\n092J15 - Bralorne\n092O02 - Noaxe Creek - if you want to explore north of the cabin",
    "directions": "From Lillooet, drive towards Gold Bridge. Turn right onto Tyaughton Lake Road (signs for Tyax Lodge). In winter this road is snow ploughed to Tyax Lodge, at the north end of the Tyaughton Lake. Park on the right just before a small housing development at the south end of Tyaughton lake (if you pass Hornal Rd or if you reach the lake you've gone to far). On the west side of the road (across from where you are parked) is an old jeep road, the first part of which is often used by sledders and is therefore fairly obvious. There is only room for a few cars directly across from the trail head. Be careful not to park in the way of snowploughs.\nLocal Weather:",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/2984/reg_Spruce-Lake-High-Trail-5-6103.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2984/reg_Spruce_Lake_High_Trail_1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2984/reg_Spruce_Lake_High_Trail_2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2984/reg_Spruce_Lake_High_Trail_3.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2984/reg_Spruce_Lake_High_Trail_6.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2984/reg_best1_Spruce_Lake_High_Trail_4.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/2984/topo_Spruce_Lake_High_Trail_Map_2.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/spruce-lake-high-trail-chilcotin-near-lillooet-bc-2984",
    "stats": {
        "Activities": "mtn-bike ski-bc hike",
        "From": "",
        "Seasons": "fall winter spring",
        "Stars": 4,
        "Time": "16 hrs",
        "Total Distance": "20 km",
        "Town": "Lillooet, BC",
        "Type": "out-and-back"
    },
    "title": "Spruce Lake High Trail - Chilcotin",
    "trail_id": "2984"
}