{
    "description": "NTS Map: 092J03. Callaghan Country has an otherworldly feel to it.  Unless you are a backcountry ski guide, you probably won't see this much powder all winter. The Callaghan ski area just South of Whistler is being considered for the 2010 Olympic games XC ski race routes. It is remarkably flat, and very expansive.The sub-alpine plateau where Callaghan Backcountry Lodge operates will leave you breathless.  There is so much powder and snow.The spacious and cozy B&B that you stay at is hidden high up in the mountains in a setting that can't be matched at lower elevations; there is just something different about it ? probably the fact that you have a whole mountain range to yourself.  The proprietors are very well versed in local flora and fauna, and will likely join you on your XC ski tour for the day.  Because of the isolation you'll see signs of animals everywhere, and, you may even see Grizzly tracks later in the Spring. The trails are groomed for XC skiers, and Backcountry skiers have a wider area to operate in.  There are avalanche zones to consider for those who venture past the groomed trails into the backcountry, so you may want to consider hiring a guide if you are not an advanced backcountry skier. For cross-country skiers the groomed trails are safe and appopriate for all levels. If you are looking for a rare combination of luxury and unmatched wildnerness and beauty, this weekender is highly recommended.  Staying up at Callaghan Backcountry Lodge is not inexpensive, but you will be hard pressed to find a more unique experience, particularly a large flat XC ski area with lots of powder so close to Vancouver.  The lodge sleeps roughly 14 visitors, so you might think about booking in as a group. If you think you've covered just about every XC ski trail in the Whistler or Vancouver area, consider Callaghan Country a real treat - and tell us what you think.",
    "directions": "See description and / or GPS",
    "geohash": null,
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/3/3D_pwdr.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3/reg_22.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3/reg_5_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3/reg_PIC2room.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3/reg_PIC3ski.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3/reg_PIC5heli.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3/reg_map.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/callaghan-country-near-whistler-bc-3",
    "stats": {
        "Activities": "ski-xc",
        "From": "",
        "Seasons": "winter",
        "Stars": 5,
        "Time": "3 hrs",
        "Total Distance": "30 km",
        "Town": "Whistler, BC",
        "Type": "out-and-back"
    },
    "title": "Callaghan Country",
    "trail_id": "3"
}