{
    "description": "Clayoquot Sound is a paddler's paradise, with miles of uninhabited sandy beaches, green forested mountains, open ocean swell and crashing surf.  \r\n\r\nBest for intermediate to advanced paddlers, most landings on the west coast are surf beaches, and require some technical skills to launch and land safely.  You will get wet!  A number of tour operators run trips into the area if you are unsure of your skills.  \r\n\r\n\r\nSpend a day or two exploring Meares Island, just off the tip of Tofino, or go for a week and circumnavigate flat Vargas Island.  \r\n\r\nHead to Flores Island as your final destination, and stop at tiny Whaler Islet for lunch, a perfect little sand bar halfway there.  The south and west side of Flores is almost completely ringed with beautiful sand beaches, and Gibson Marine Park in Whitesand Cove is a great place to stop.  There is a recently completed boardwalk leading from the small village of Ahousat (stop in the cafe for an cold drink!) through lush green rainforest along the south coast to Cow Bay and up to Mt. Flores (elevation 902 metres), a great walk on a windy day if you can't paddle (which happens quite often).  \r\n\r\nLaunch from the funky town of Tofino, at the tip of the Esowista Peninsula, (take Highway 4 west after taking the ferry to Nanaimo and driving up the island highway) after a nice drive through Pacific Rim Park.  Stop at Long Beach to check out the surf.  Hazards: there is constant busy boat and float plane traffic off Tofino - keep an eye out!  The tide runs quickly around all the small islands off Tofino as well - try to launch with the ebb.  \r\n\r\nVisibility can be obscured as fog banks roll in and fog often lasts for days.  Most beaches have surf - make sure if you land you can get off again!\r\n\nMap of Clayoquot Sound: NTS Map 092F04",
    "directions": "See description and / or GPS",
    "geohash": null,
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/30/reg_Clayo2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/30/reg_Margaret.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/30/topo_2DClayo.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/30/narrow_whaler.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/clayoquot-sound-near-tofino-bc-30",
    "stats": {
        "Activities": "sea-kayak",
        "From": "",
        "Seasons": "summer",
        "Stars": 5,
        "Time": "49 hrs",
        "Total Distance": "74 km",
        "Town": "Tofino, BC",
        "Type": "out-and-back"
    },
    "title": "Clayoquot Sound",
    "trail_id": "30"
}