{
    "description": "Best done counter clockwise starting in Wasagaming.\nStart at the Visitor Centre in Wasagaming to get the latest trail conditions as there is a section of trail on the south end of Clear Lake  which might not be passable in spring and early Summer.\nOpen 9:30 - 5:30 May Long to October Long. \nOpen 9:30 to 8 July and August.\n204-848-7275 Riding Mountain National Park Information \nOption Start 1: You can either start at the entrance of the Wasagaming Campground where the Wasagaming bike trail starts. Follow the Bike signs through the Campground as they lead you to Deep Bay Parking lot.\nOption Start 2: Start at the Main Pier and get a great view of the Lake and an sense of where you will be heading. Head east along the  Lakeshore Walk(yes you may bike on it) You might need to walk you bike down the bank to get to the section of the trail that get you to the lakeshore part. Once you are on the Lakeshore part it will also take you to Deep Bay. Once you are there you need to get to the above parking lot to get onto the old road which will take you to the East end of Clear Lake. From there you hug the lake shore as you pass by the Clear Lake Golf Course, Wishing well. You will continue past the road on your way to Glen Baeg Picnic site. You will pass a small pump house on the lake side and the entrance to the North Shore section of the Clear Lake trail starts. This is a very fun and technical section that may wet at time due to natural springs. You will pass the north shore cottages (3 areas) and then you will eventually get to the Spruces Picnic area. From there you will need to go onto #10 hwy. Hug the shore as there is short cut to get you to the Aspen Picnic site which is fairly close. From Aspen you have to take the gravel road (Lake Audy Road) to the junction of the Keeseekooweenin First Nation Reserve. \nTake the road through the reserve to get to the juction of 354 and Camp Wannakubac Road. Go East toward the Camp Wannakumbac. As you pass the camp you will kinda see the lake. There you will be able to get off the road and back to the trail. Turn right(south) and head on the last leg of the Clear Lake trail. You will pass many church camps, group camp, a picnic site. You will get to the Isthmus where the trail become a narrow sand bar between South Lake and Clear Lake (beautiful spot, one on my favourites). This is a section where you might have to wade into the water. Caution - Do not go for the shortest route in the water as it can be quite deep. Wade out into Clear Lake (30 to 40 feet from shore) in a horse shoe type route around the deep area) This mean you should not be in more than 2 or 2.5 feet of water. ) This is why I suggest Counter clockwise --- you will only get wet for the last 2 km and a nice hot shower awaits in Wasagaming.\nThen you will shortly get to the boat cove parking lot. You can still hug the shore to where you will ascend into the old campground and pass the Jamboree Hall, the play ground and the Tennis courts. And voila you are back to Downtown Wasagaming.\nI hope this helps.\nRichard D.\nEasy going leaving Wassagaming till you get to the other side of lake near the Audy Lake Rd and Hgwy 10. It gets a little more hilly here.",
    "directions": "From the town, proceed to the boat launch and follow the directions",
    "photos": [],
    "source_url": "https://trailpeak.com/trails/clear-lake-trail-riding-mountain-national-park-near-wasagaming-mb-3013",
    "stats": {
        "Activities": "mtn-bike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "33 km",
        "Town": "Wasagaming, MB",
        "Type": "out-and-back"
    },
    "title": "Clear Lake Trail - Riding Mountain National Park",
    "trail_id": "3013"
}