{
    "description": "Elevation gain: 700m (2300ft) Map: 82K7This is a lovely alpine lake at 7000ft in a basin below Jumbo glacier. Trailhead access is a 52km drive west of Radium on gravel roads, takes about 1.5 hours.The hike starts at the end of Horsethief creek road, and it takes around 3 hours to reach the lake some 9 km away. The path is steep with many switchbacks along the creek. There is a campsite in the subalpine meadows just before the lake. The lake is very scenic with many icebergs floating in it. The glaciers are 2.5 kms away at the far end of the lake. In order to reach the glacier, the climbing routes and ice climbs or to do some close-up photography  of the floating chunks of ice, take along a super light packraft from Alpacka Raft. That way you can get around on the lake and cross to the other side easily without bushwhack or exposure to falling rocks. Read more about packrafts in the article on trailpeak.If you camp here, you can do some more hikes and climbs, daytrips to peaks nearby. Glacier Dome is a nice hike west of the lake, with some snow and glacier travel (ropes needed) to the top at just under 10,000ft. For more information on day hikes or backpacking trips into this area, see Mountain Footsteps, a New Edition by Janice Strong.Janice's detailed trail and road directions and her enthusiastic personal narratives  help hikers of all skill levels to explore on their own, using her book as their guide.",
    "directions": "Drive west from Radium at 4-way stop. Turn left for Horsethief creek road after 1.5km. Take left fork at 3.8km. Continue straight at 4-way junction near 9km sign. Also continue straight at 14km sign. Keep driving this narrow road, keep straight at 39km sign and also keep past footbridge at 46k sign (camping site). Park at the 50k sign, end of road and trailhead (52k from Radium).",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/3021/long_lhgr1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3021/reg_IMG-0014-24756.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3021/reg_lakeofhangJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3021/reg_lofhg1.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/lake-of-the-hanging-glaciers-near-invermere-bc-3021",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 4,
        "Time": "6 hrs",
        "Total Distance": "18 km",
        "Town": "Invermere, BC",
        "Type": "out-and-back"
    },
    "title": "Lake of the Hanging Glaciers",
    "trail_id": "3021"
}