{
    "description": "The '3 Sisters' is a set of 3 mountains just east of Canmore, which has become the symbol of the town.From the trailhead, travel up Stewart Creek, picking the available paths on either side of the creek.  After two kilometers up Stewart Creek, you will need to take the right fork in the creek and begin a noticeably rockier climb in the creek bed.  A daunting rock wall will appear above and to the right of the creek.  The top of Middle Sister will be above this wall, but the scramble route will take you to the left around the wall.  After climbing up the creek, you emerge onto a more open area on the right hand side of the creek bed.  Ahead will appear a long even slope of larger rock with a visible trail up the middle.  Eventually this slope turns to the north, where the trail becomes better defined, but still long trudging towards the top.  Even before the top comes into sight, the views can become quite magnificent as you look to the east, down the Bow River.  Top right photo is Canmore from the top of Middle Sister, Photo at mid left is the Bow river across the top of Little sister, looking east. Photo at mid right is straight down, if you dare.The length of the trail is about 9.2km each way for a total of 18.5 km, but it will feel much longer.  Also the 9.2km doesn't allow for all the side to side wandering that a person does to find the best route. I would regard the trail as a safe place to take anyone, as the use of hands in scrambling if very limited, and the risk of falling is small.  From that point of view, I would rate the trail as easy.  In terms of effort, it is quite tiring, so like any trail of this length and elevation gain, it would be considered physically demanding, and many would call it difficult. The round trip time for us was about 11 hours, but it could be done in anywhere from 7 to 11 hours.Submitted by Don Benson",
    "directions": "The start of the trail is marked with a sign identifying \"Trailhead Three Sisters Middle Mountain\" as the starting point.  This is on a road on the left hand side of Three Sisters Blvd, about half way between the golf course and the Trans Canada Highway.  From here go a couple of kilometers along the road as it passes along beside the golf course, and bends to the right as you go around the east end of the golf course, eventually arriving at Stewart Creek.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/3026/reg_1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3026/reg_3jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3026/reg_5jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3026/reg_6jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3026/reg_7jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3026/reg_Middle-Sister-Canmore-Sept-13-12--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3026/reg_Middle-Sister-Canmore-Sept-13-15--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3026/reg_Middle-Sister-Canmore-Sept-13-2--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3026/reg_Middle-Sister-Canmore-Sept-13-7--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3026/reg_MiddleSisterGooglejpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3026/narrow_2_best1_.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/middle-sister-near-canmore-ab-3026",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "20 km",
        "Town": "Canmore, AB",
        "Type": "out-and-back"
    },
    "title": "Middle Sister",
    "trail_id": "3026"
}