{
    "description": "The Stone Corral Hiking Trail is sixty kilometres south of Tumbler Ridge by road. The Stone Corral is an exquisite tarn surrounded by vertical limestone cliffs. It was only discovered by a party of local cavers in 1999, and quickly added to Monkman Provincial Park.\r\n\r\nAn expertly written and illustrated sixteen-page booklet describes twenty points of interest along this varied and fascinating trail. These include two easy small caves, springs, ponds, an historic site, fossils, a superb example of rock folding, two great viewsites over the mountainous terrain of Monkman Park, and the Stone Corral itself. The hiker is introduced to poisonous plants, and informed about the karst topography through which the trail winds.\r\n\r\nThe two caves give non-cavers a safe introduction to this activity. Corral Cave is a simple walk-in chamber with some interesting features. Porcupine Cave has two entrances - it includes an optional tight crawl-through (for the lean only) after which your clothes may be festooned with quills. It is difficult to get kids to leave this place!\r\n\r\nThe trail was built by an E-team in 2000. It has steps at a number of steep sections, with considerable elevation change. When you have finished this unique trail, don't forget to visit one of Canada's great waterfalls, Kinuseo Falls, just two kilometres from the Stone Corral trailhead.\r\n\r\nFor more trails in the Tumbler Ridge area, please reference \"Tumbler Ridge, Enjoying it's History, Trails, and Wilderness\", by Charles Helm. You can also use the trailpeak search engine and type in \"Tumbler Ridge\" in the \"near city\" field to find a few other samples.\r",
    "directions": "See description and / or GPS",
    "geohash": "c39zd",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/306/reg_01.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/306/reg_03.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/306/reg_05.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/306/topo_stonecorraltrailmap.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/306/narrow_02.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/306/narrow_04.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/the-stone-corral-hiking-trail-near-tumbler-ridge-bc-306",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 5,
        "Time": "3 hrs",
        "Total Distance": "4 km",
        "Town": "Tumbler Ridge, BC",
        "Type": "out-and-back"
    },
    "title": "The Stone Corral Hiking Trail",
    "trail_id": "306"
}