{
    "description": "If you are attempting the un-judges route you will have likely already have made it to the summit via another route so you will know how awesome the views from the top are.  Unlike the judges route, the un-judges route up Mt. Arrowsmith is not for the faint of heart.  This route involves lots of 3rd and 4th class scrambling with considerable exposure, the rock is in poor condition and is easily broken off.  Depending on the time of year an ice axe and crampons may also be needed.  Even though the route is well flagged, the ability to route find is also very important since it is easy to lose the flagging and in some cases the flagging just stops. The trail begins with a hike through the woods with beautiful large trees, as you gain elevation you lose the trees and rock becomes the norm.  The initial part will take you to the south summit, you will then traverse over to the main summit and take the judges route down.  Just before you get to the old logging road, you will hang a left and get back to the start of the un-judges route.  Total time for this trip should take about 7 hours and covers a distance of 6-7 kms   This is a fantastic route and on a clear day the views from the top are awesome.  Do not attempt this in rainy weather since most of the route involves rock that when wet will be extremely slippery.  Spring is the best times to do the route because it makes easy travel over some of boulder terrain.\r\n\r\n\r\nFrom where ever you park head up the road (I say this because due to dead falls you may not be able to drive to the trail head).  If the road is clear and you managed to park at the end, prepare to bushwack, right at the end of the road start heading up in the woods.  You will come across flagging just keep your eyes open, don't head down to the creek at this point.  Also be careful about the flagging, one of the timber companies was marking their territory and flagged some kind of boundary line, so pay attention to which flagging you are following.  In about 15 minutes you will want to keep your eyes open for pink flagging this will take you down a bit.  Keep following and you will be heading toward the creek that you have been hearing.  Follow the flagging over the creek.  In about 25 minutes you will come across multiple flags, going straight and down, avoid this and go up.  Basically from now on you are heading upwards, so even if you lose the flagging just head upwards towards the south summit as best you can.  In about 35 minutes you will come across some rock scrambling.  Pay attention to the flagging.  20 minutes later you will come across a hanging forest; this is the last large stand of trees that you will see.  In about 40 minutes you will come across a huge rock face, head to the left a bit and find a route up this rock face.  You will then come out to the south summit.  Take a break here if you want and then turn your attention to the main summit.  This portion involves some up and down and of course some good scrambling.  When proceeding over to the main summit, just take your time and find the route over the rock faces.  There is no flagging from here to the main summit so you will have to make your own way.  From the main summit, follow the well worn path back down the judges route.  Roughly 1.5 hours from the summit you will see a tree with the yelloworange flagging and some pink flagging hanging off that flagging.  This is where you want to make a left through the woods.  Keep your eyes open in 1 minute you will see some yellow flagging, follow this all the way until it meets the unjudges route that you have done already.  If you miss this turn off, you will come out to the judges route parking lot.  Just walk down the logging road to the un-judges route parking area.\r\n\r\n*Note, if you are following the GPS route, near the south summit the unit lost satellite contact.  I tried to move the points around to fit the route, so do not follow it for accuracy near the south summit.\r",
    "directions": "Follow highway 4 out to Port Alberni, at the top of the bump before Port Alberni you will see a sign for Arrowsmith Ski Hill sign, make a left here.  You will now come across active logging and lots of clear cutting.  Stick to the main road, do not take any turn offs.  In about 3 kms, make a left at the T-junction.  Watch for logging trucks. Drive for about 10 km and then turn left on Cameron River Main.  You will now start heading up a bit of grade.  The road itself is in good condition in this area.  Go for about 2 kms, look on your right for a road heading up (about the 3rd  road).  You can drive your vehicle up here (very rough and overgrown), I would strongly recommend a 4x4 but I have seen many cars do things they aren't suppose too!",
    "geohash": "c0",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/3069/reg_IMG_3393_Large_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3069/reg_IMG_3406_Large_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3069/reg_IMG_3428_Large_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3069/reg_IMG_3431_Large_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3069/reg_IMG_3442_Large_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3069/narrow_IMG_3365_Large_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3069/narrow_IMG_3391_Large_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3069/narrow_IMG_3395_Large_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3069/narrow_IMG_3396_Large_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3069/narrow_IMG_3423_Large_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3069/narrow_IMG_3425_Large_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3069/narrow_IMG_3438_Large_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3069/narrow_IMG_3440_Large_.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mt-arrowsmith-un-judges-route-near-port-alberni-bc-3069",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring",
        "Stars": 5,
        "Time": "7 hrs",
        "Total Distance": "7 km",
        "Town": "Port Alberni, BC",
        "Type": "out-and-back"
    },
    "title": "Mt. Arrowsmith (Un-Judges Route)",
    "trail_id": "3069"
}