{
    "description": "The Heriot Ridge Gowland Harbour trail is a hike that will give you views of Vancouver Island, the Coastal Mountains and everything in between, it is located on Quadra Island.  On a clear spring day the mountains of Vancouver Island and the Coastal Mountains are absolutely awesome with their snow cover!!  The trail is very well marked with lots of sign posts and is well maintained.  If you take in all the view points and have a decent lunch the total trail time is about 4 hours and is 5 kms long.  Some of the view points involve a bit of scrambling but nothing major and the hike requires an average level of fitness.  The first view point is one of the best, from here you will have views of Heriot Bay, Vancouver Island and the Discovery Island Chain, so if that is all you want then budget 30 minutes round trip from the parking area.\r\rThe trail starts at the end of Hopespring road, part on the side of the road and head towards what looks like a driveway, you will see a sign pointing you down a path in a few seconds.  In about 15 minutes you will see a sign pointing you to Heriots ridge follow this for 5 minutes and you will be at the first view point.  Once you have had your fill head back down to the sign and follow the trail for the Gowland Trail.  In about 10 minutes you will come across another sign post, keep following the Gowland trail.  In 15 minutes you will see a sign to old growth trees, this is a 5 minute turn off and is well worth it to see about 5 big old trees.  Once you have seen the trees head back.  When you come to the turn off for the view point on the Rousseau Ridge, take it and in 15 minutes you will be on top with more great views.  Then head back the same way and you will come to another sign, follow the Thompson trail.  Keep following the Thompson trail for the next hour and make sure to take in the last view point, it offers a nice view and the scramble up is enjoyable.  Make your way back and in 10 minutes you will be at Thompson road, make a right at the road and then another right at Hopespring road.\r",
    "directions": "Take the ferry to Quadra Island.  From Quathiaski Cove head up on and follow the signs for Cortes Island (West Rd), which will take you to Heriot Bay.  Just before you get to Heriot Bay make a left on Carmer Road which will then take you to Hyacinthe Bay rd, make a right.  In a short time you will come to Hope Spring Rd on your left.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/3072/reg_IMG3501Largejpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3072/reg_IMG3516Largejpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3072/reg_IMG3523Largejpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3072/reg_IMG3527Largejpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3072/reg_IMG3528Largejpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3072/reg_IMG3532Largejpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3072/reg_IMG3534Largejpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3072/topo_IMG3500Largejpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3072/narrow_IMG3521Largejpg.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/heriots-ridge-near-campbell-river-bc-3072",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 4,
        "Time": "4 hrs",
        "Total Distance": "5 km",
        "Town": "Campbell River, BC",
        "Type": "out-and-back"
    },
    "title": "Heriots Ridge",
    "trail_id": "3072"
}