{
    "description": "The Flatbed Pools trailhead is just two kilometers east of Tumbler Ridge. Usually trails so close to urban areas are built for the convenience of locals and have little to recommend them, but this one is an exception. It leads along the edge of an escarpment with some good views before descending gently into the valley of Flatbed Creek and visiting three delectable rock pools. \r\n\r\nEach pool is different - two have sandy beaches, each has its own rustic benches. In summer the pools are blessed with long hours of sunshine are are good for swimming. The most beautiful is the Overhanging Rock Pool. \r\n\r\nClose to the trail are remarkable fossil sites. There is an ankylosaur trackway - in 2001 dinosaur bone was discovered nearby. There is also a fossil oysterbed. The fossil sites are not signposted and may be visited only with a guide.\r\n\r\nAlthough there is some elevation change, there are steps in the steeper places and the contour of the trail is gentle enough that you hardly notice the climb.\r\n\r\nFor more trails in the Tumbler Ridge area, please reference \"Tumbler Ridge, Enjoying it's History, Trails, and Wilderness\", by Charles Helm. You can also use the trailpeak search engine and type in \"Tumbler Ridge\" in the closest city field to find a few other samples.\r",
    "directions": "See description and / or GPS",
    "geohash": "c3cc",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/308/reg_02.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/308/reg_03.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/308/reg_IMG-20120429-00187-11997.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/308/topo_FIG06FLATBEDFALLSREGIONALPARK.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/308/narrow_01.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/308/narrow_04.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/flatbed-pools-hiking-trail-near-tumbler-ridge-bc-308",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 5,
        "Time": "2 hrs",
        "Total Distance": "4 km",
        "Town": "Tumbler Ridge, BC",
        "Type": "out-and-back"
    },
    "title": "Flatbed Pools Hiking Trail",
    "trail_id": "308"
}