{
    "description": "This trail essentially traverses the spine of the Indian Arm/Coquitlam Lake divide, and ascends three peaks along the way.  The trail begins with an ascent of the popular Polytrichum trail on the east side of Buntzen lake.  From the polytrichum lookout, it is another 1-1.5 hours to climb through the lakes district to get to Lindsay Lake.  To this point the trail is well-marked, however above the lake the trail becomes more rugged, less travelled, and at times unmarked.  From Lindsay Lake, you continue heading north, and eventually ascend Eagle Peak (1hr from lake).  From this treeless peak the view is spectacular:  To the west is Indian Arm, Vancouver, Mt Seymour and the Georgia Strait.  To the east, Coquitlam Lake, Coq. Mountain, Widgeon Peak, Burke and the Fraser Valley.  Immediately north are the next two peaks on your route, along with endless mountains in the background.Continuing north, you descend into the saddle, and once again ascend to the next peak.  After the third and final peak (Dilly Dally), you descend to Dilly Dally Pass.  From here, your direction is west, as you wind your way back down to the valley below.  Eventually the trail turns south, and at the bottom you pop out on the road to Buntzen Bay, a tiny village up Indian Arm.  From here you follow the road south until it comes out on the Buntzen pumphouse road.  Continuing south you pass Swan Falls and eventually get to the north end of Buntzen Lake.  You can continue along the road, or take the trail along the east side of the lake, to get back to the parking lot.This is a very long trail, in a remote area, with several steep pitches.  Parts of it are not well-marked.  Please be prepared, and have a map, compass, gps, etc.  It will take you 6 hours if you are hyper fit and giving it, probably 10 hours at a more normal pace.",
    "directions": "From Coquitlam/Port Moody, ascend Heritage Mountain and follow signs for Anmore.  If you find Anmore, you're almost there and there will be signs for Buntzen Lake.  Take note of the park hours when you enter Buntzen, as the gate closes for the night.  Drive to the lake, and park in the first lot (not the overflow lot) close to the dog offleash area.  Directly east of this parking lot is a gated gravel road.  Your trail (Polytrichum/Halvor Lunden) starts on the other side of this road, not far from the gate.  Two trails start here, make sure you take the one on the left.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/3083/long_dilly-dally-2-30790.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3083/long_dilly-dally-3-30790.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3083/reg_P8170017-28048.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3083/reg_PICT2250JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3083/reg_PICT2256JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3083/narrow_PICT2247JPG.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/dilly-dally-near-coquitlam-bc-3083",
    "stats": {
        "Activities": "snowshoe hike",
        "From": "",
        "Seasons": "spring summer",
        "Stars": 4,
        "Time": "8 hrs",
        "Total Distance": "26 km",
        "Town": "Coquitlam, BC",
        "Type": "out-and-back"
    },
    "title": "Dilly Dally",
    "trail_id": "3083"
}