{
    "description": "This is an old mining road that leads you easily to timberline. The start of the trail is purposely left \r\novergrown to deter all motorized access, but soon you will find pleasant hiking on a decent old road. \r\nAt 5000ft near the alpine there is a good campsite and a fork in the old road. The left fork crosses \r\nCabinet creek and goes up a side valley for a km to a mine camp at 5500ft.\r\n\r\nThe right fork enters the basin and climbs up steeply on the north side. The ridge is open and cold if windy. \r\nThe trail circles the headwall in a southerly direction to 6500ft on the ridge. \r\n\r\nThese peaks and plateaus are prime hiking and camping country. Lovely views in all directions, west to Howson Range \r\nand NW to Hudson Bay mntn, north to Babines. Can continue to walk west to the Camel Hump and some old trails \r\nto Mooseskin Johnny lake.\r\n\r\n\r\n\r\nCurrent conditions:\r\n\r\n\r",
    "directions": "\r\n\r\n\r\n\r\nFrom hwy 16 in Telkwa turn west at the traffic light and drive Riverside St over the bridge past the Bulkley River. Continue on  \r\n\r\nCoalmine road south from Telkwa. Keep left where the road forks at Km 6 and drive this FSR keeping right at 3km. \r\nFollow the Hunter Basin signs keeping left. At 14.8km fork keep right for Hunter Basin (signed, left fork is Hankin Plateau access).\r\nPark at the road end on a steep section about 2km up. Trail starts to left in a very overgrown section.\r\n\r\nThe trailer park near Telkwa is home to the famous custom bootmaker Charlie Van Gorkom whose boots have been featured \r\nin national magazines. For info on his amazing hiking boots to fit people with problem feet visit http://www.hikingbootshandcrafted.com",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/3090/long_hunb3JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3090/long_huntb1JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3090/long_huntb2JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3090/long_huntb4JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3090/long_huntbJPG.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/hunter-basin-near-smithers-bc-3090",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 4,
        "Time": "5 hrs",
        "Total Distance": "15 km",
        "Town": "Smithers, BC",
        "Type": "out-and-back"
    },
    "title": "Hunter Basin",
    "trail_id": "3090"
}