{
    "description": "A long, steep and muddy ascent to the ridge under a canopy of large cedars. The route is recently cleared by the PGBRS, and is well flagged all the way to the ridge. But the higher you go, the more mosquitoes are encountered in July. Take bug nets. This is not a trail for beginners out for an easy stroll. \nViews from the ridge are to the Fraser river below and peaks beyond the river, all the way to Mt Robson in the Rockies. Can continue along the ridge to a communication tower and another trail which return to the highway from the west end. The west trail head is 5km west along hwy 16 on a somewhat washed out gravel road. \nCurrent conditions:",
    "directions": "Drive west of McBride past the Slim Creek bridge, another 8.7km, and find the   Ancient Forest sign pointing to the small gravel road southwest of hwy 16. This is located 114 km east of Prince George and almost 1 hr drive from McBride. Walk up the old road to the trail sign, go left to Driscoll trail. To the right is the Ancient Cedar Forest trail, a much shorter hike, but very worthwhile to see some 1000 year old cedars. Map provided by Rob Bryce at Ancientcedra.ca",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/3098/long_Map-of4-8779.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3098/long_dr1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3098/long_dr2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3098/long_dr3.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3098/long_dris.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/driscoll-ridge-near-prince-george-bc-3098",
    "stats": {
        "Activities": "snowshoe hike",
        "From": "",
        "Seasons": "winter fall summer",
        "Stars": 4,
        "Time": "6 hrs",
        "Total Distance": "12 km",
        "Town": "Prince George, BC",
        "Type": "out-and-back"
    },
    "title": "Driscoll ridge",
    "trail_id": "3098"
}