{
    "description": "Desolation Sound is a great place to paddle, relatively close to Vancouver.  The water is warm and mostly calm and sheltered, oyster beds are everywhere, (check for red tide!) and the scenery is spectacular, with towering snowcapped mountains in the background.  You can depart from either Lund, first exploring and possibly camping on the Copelands (although this might be a better return campspot), or, depart from Okeover Inlet, at the government wharf. Okeover Inlet is opposite Lund, on the sheltered side.  We left from Okeover inlet, as one of us (me) was on crutches, and these were strapped to the boat.  This created a certain challenge as there aren't a lot of white sandy beaches (in fact none) on this route.  For those, think about going to the Broken Island Group,or, perhaps Tofino (but Tofino and Clayoquat is more advanced).  In Desolation Sound, you have some very picturesque but small island groups such as the 'Curmes' (kayakers favourite for tenting) that require a little bit of muscle to get the boats out of the tidal zone.  You can reach the Curmes on day one, mind you it is a full day of paddling from Okeover Inlet.  In our case, we camped in nearby Tenedos Bay, which was most beachlike (and easy for me), and it has three tent platforms. A very sheltered area, with calm water and lots of smoothed rock windy shoreline to explore. The camp spot at Tenedos Bay is close to lake Unwin for fresh water. A stream winds it's way down from Lake Unwin right by your camp area, and this is where you can filter water from.  Very picturesque area of small pools and cascading water. A nice place to hang.  Outhouses at Tenedos and Roscoe Bay - with TP!Fresh water is limited on this trip, with stops at Tenedos bay, and, Roscoe Bay (amoungst others) for fresh water.  Black Lake just off Roscoe Bay was pure magic, one of the cleanest, clearest, and warmest lakes I have ever swam in.  It's large. And not a tough hike to get there once you tie your kayaks up near the picnic tables and camp area.  Pure Bliss on a sunny day, and we had 4 days of sun, and, extremely calm waters.  It might not always be as calm as we were lucky to have, however these waters are relatively easy to paddle and ideal for beginner to intermediate paddlers.  During the busy weeks of summer, the greatest hazard may be that of the power boats and sail-boats visiting the marine park.  But the views, easy paddling, and, fresh water swim spots are worth it.  In  the heat of the summer, certain places in  this region get 72 degree ocean water, oweing to the opposing tidal action from North and South that tends to keep the water from flushing in and out.Overall you can do a 3-4 day trip, if you simply want to paddle into Tenedos bay, camp, and do a day trip to Roscoe from there, as we did. Or, make it as long as 5-6 or 7 days by going further past the Redondo Island(s), or up a number of inlets that extend up Deolation Sound. Careful though, some of it is Grizzly territory on the mainland.  A good first timer trip is laid out in the scan of the marine chart below.  In our case, Day One we paddled to Tenedos, after exploring the Curmes for a bit. Day two was over to Roscoe-Bay, and, fresh water swimming.  Day three we wanted to paddle like hell but held up near a very small Island group (Mary Island), where we lounged in the sun, then returned for some awesome chicken Curry at base-camp!  Day 4 we returned to Okeover Inlet, so, 2 days transit paddling, two days exploring, but, this was just our route, there are so many, and the GPS points (see 'Download GPS') shows many of the camp spots in Desolation Sound, easily a dozen or more. You'll likely get a marine chart provided to you when you rent (if you rent) a kayak, which is sufficient, identifying fresh water sources, and, camp spots.",
    "directions": "Take the ferry from Horseshoe Bay to Langdale, then another ferry from Earls Cove to Saltery Bay.  Drive north on Highway 101 and launch from Lund on the west side of the Malaspina Peninsula, or just before Lund, turn right at Malaspina Road and launch from the public dock at the campsite in Okeover Inlet, then paddle out to Desolation Sound Marine Park.  At Tenedos Bay, you can hike into Unwin Lake for a lovely fresh water swim and if you're feeling energetic, think about portaging your boat in to explore.  Power and sailboats love this area, but tend to congregate in specific spots (Prideaux Haven being one of the most popular) so it's easy to get away from them.  Camping is very limited, with almost no sand beaches.  Make sure you leave time before dark to find a spot.Hazards:  Watch out for boat traffic around Lund.  Many landing spots are covered with oysters which are razor sharp - be careful, especially when hauling up your fully loaded kayaks with bare toes!Note: we have supplied a topo, a marine chart (not suitable for navigation), and, GPS waypoints that you can download into your GPS and use as 'ball park' positioning for camp spots such as tenedos, Roscoe (aim for Roscoe-Aim), and, Curmes.  Always take a marine chart with you and know how to take a bearing off the compass rose.  Do plan for tides, as the difference can leave your boat stranded hi on shore or floating away, but note that in this area, the tides are less severe due (but still a factor) to the cancelling action of north and south sea flows. That's why the waters are warm(ish) though.  Regarding tides, if you land at low-tide, you can have quite a haul through the inter-tidal zone to get your kayak to high ground.  Plan accordingly.  This is a good self-guided kayak experience, but, if your skills are not up to par with self-guided travel, you are best to investigate a guided option.Map of Desolation Sound: NTS Map 092K02",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/31/long_DesoTopo.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/31/reg_Dcp_0266.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/31/reg_Dcp_0269.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/31/reg_Dcp_0270.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/31/reg_Dcp_0273.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/31/reg_Dcp_0280.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/31/topo_TurntheCorner_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/31/narrow_Dcp_0282.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/31/narrow_DesoMarineFinal.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/31/narrow_pic1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/31/narrow_pic4.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/desolation-sound-near-powell-river-bc-31",
    "stats": {
        "Activities": "sea-kayak",
        "From": "",
        "Seasons": "summer",
        "Stars": 3,
        "Time": "35 hrs",
        "Total Distance": "40 km",
        "Town": "Powell River, BC",
        "Type": "out-and-back"
    },
    "title": "Desolation Sound",
    "trail_id": "31"
}