{
    "description": "Allan Kane in his book \"Scrambles in the Canadian Rockies\" says that: ?the approach to Mount Hood can be as involved as the actual climb.?  He is not kidding!  The bushwhacking, detours, elevation loss, etc. adds at least an hour to this trip.\r\rStart at the King Creek parking lot.  The hike through King Creek Canyon isn't too bad but you have to balance on logs to cross the creek as all the bridges and parts of the trail have been wiped out.  As the creek gets closer to the forks you actually have to scramble some narrow ledges.  At the forks you have two choices.  The obvious choice is to follow the well established trail up the Eastern embankment. This is likely where most people will go wrong.  This trail leads to an Aboriginal site of interest and then continues to parallel the Northern fork of King Creek perhaps 100m above it.  Eventually the trial turns into an overgrown animal trail? perhaps Kane's ?sheep trail? but not likely.  I believe the correct trail probably follows the creek but maybe only a few meters above it? which has now partially been wiped out by the flood plain of the creek.  The other option is to stay in the creek bed, which has water intermittently above and below ground.  Regardless both options are poor, very time consuming and will likely leave you scratched up and/or in danger of a wipe out on the slimy rocks. DO NOT CLIMB HIGHER above the creek as you will get stopped by steep terrain before you attain the correct ascent ridge to the col.     \r\rContinue to follow the creek and when it arcs East and terminates at a slabby waterfall you will know you are at the correct ascent ridge.  Climb the very steep grass covered in odd water loving vegetation.  The ridge continues upwards and turns into sharp shale like scree.  When the ridge ends you are faced with a somewhat daunting looking maze of gullies and rock outcroppings guarding the normal route to the col.  The normal route employs a notch in the cliff bands below the col.  This notch is a couple hundred meters South of the ridge terminus where you are standing and a few hundred meters above.  Kane's route description and picture in his book is not the route that I chose and is not the route that appears to be favoured as evidenced by the trails making their way up the slopes.  \r\rAt the terminus of the ridge is a cairn and an evident trail up 3rd class rock on your left.  I would suggest that you take this route.  The gully that sits North of the rock fin is long, loose, fairly steep.\r \rThe route I took goes left at the cairn on the well used rock and continues straight up for a bit and then traverses in an angle to the notch.  With the exception of a few spots this is mainly an easy to moderate 3rd class choss heap.  A few spots get a tiny bit more technical and requires careful hold selections.  That being said I'd suggest that you may wanna WEAR A HELMET.  \r\rOnce you attain the col there is a trampled scree trail North to the summit that is basically steep hiking/easy scrambling.  The summit register is over 20 years old, obviously this summit sees very little traffic. The views are very respectable, featuring the lakes to the South West. \r\r",
    "directions": "Take Highway 40 though Kananaskis and park in the King Creek parking lot close to the winter gates.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/3106/reg_hood022jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3106/reg_hood045jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3106/reg_hood054jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3106/reg_hood084jpg.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mount-hood-near-canmore-ab-3106",
    "stats": {
        "Activities": "hike climb",
        "From": "",
        "Seasons": "summer",
        "Stars": 3,
        "Time": "7 hrs",
        "Total Distance": "12 km",
        "Town": "Canmore, AB",
        "Type": "out-and-back"
    },
    "title": "Mount Hood",
    "trail_id": "3106"
}