{
    "description": "Looking at PEI topo maps, it reminds me that every region has its own distinct land features. Out west, has its tight topo lines indicating mountain ranges, Ontario with its lakes, and here on Canada's smallest province, our rivers truly stand out as most distinctive. Like inland reaching fingers, our river systems flow to the ocean that surrounds us, and one great example of this is the South West River in the Western area of the province.\r\n\r\nLocated near New London Bay, and Cavendish's famous sandy beaches, the Southwest River flows from the direction that gives it its name. Though labeled as a river, most rivers on the island technically are not, due to the amount of volume sourced from the ocean's tidal rise. Consequently, most fresh water runs are streams and creeks. The Southwest River certainly doesn't feel like a river either due to its width.\r\n\r\nBy measure, the route length is around 8K, and is bordered in places by dense underwater grasses and sea lettuce growth. I figure this is due to the shallow nature of such a wide flow, and makes going very slow!\r\n\r\nI launched near Campbellton, on a road to McEwens Island called Browns Road. Most cottage roads are private, but this one is free to use, and takes you right to the water's edge. If you plan your launch and return with the tides, you'll have little carrying to do to float your boat.\r\n\r\nThe route can be split into thirds, with the first finishing at a highway bridge. The biggest attraction there are the eagles and their nest, supported by a man made platform up on a power pole. The next third is punctuated by red rocky cliffs that reach the shore, mixed with green forest growth. It's nice to see cottage owners maintaining some sense of seclusion instead of going for the open concept, sprawling lawn spaces rolling to the water's edge. Cottages are only hinted at by seeing the occasional roof line or window in the bush. The remaining third; the upper end of the river, is much flatter, and claimed by farming. Interspersed among the rolling fields, are more cottages and homes higher up on the hills. The water becomes more marshy with more grasses and algae along the shore.\r\n\r\nMy goal was to reach a bridge near the community of Margate, but I never found the way into the bridge. The water was getting shallow and the grasses were holding back the progress of my paddles. At that, I turned for home. \r\n\r\nShannon Burt\r\nEast Coast editor\r",
    "directions": "From Route 6 that runs along the Cavendish Beach area, head Northwest, passing Stanley Bridge and New London Bay. To your left is the Campbellton Road, or route 238. From that road, take Browns Road on your left. To make this paddle shorter, launch at the bridge and warf at New London, along Route 20's bridge that crosses the same river. This is where the eagle's nest is located.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/PE/3107/long_IMG0477JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/3107/reg_IMG0479JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/3107/reg_IMG0480JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/3107/reg_IMG0481JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/3107/reg_IMG0483JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/3107/reg_mapsounthwestjpg.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/southwest-river-pei-near-campbellton-pe-3107",
    "stats": {
        "Activities": "sea-kayak river-canoe",
        "From": "",
        "Seasons": "summer",
        "Stars": 3,
        "Time": "3 hrs",
        "Total Distance": "17 km",
        "Town": "Campbellton, PE",
        "Type": "out-and-back"
    },
    "title": "Southwest River, PEI",
    "trail_id": "3107"
}