{
    "description": "Ptarmigan Tunnel is a man-made hole in Ptarmigan Mountain in Glacier N.P. in Montana. The trail is shared with the Iceberg Lake trail for the first half of its length (2.5 mi.). Leaving the Many Glacier trail head you will soon be on open slopes with tremendous view of the Iceberg and Swiftcurrent Valleys. After you pass Ptarmigan Falls, you will soon encounter the junction of this trail (turn right, signed). Now starts about 1/4 to 1/2 mile of pretty good uphill, no switchbacks. After that, however, the trail levels out and stays mostly that way to Ptarmigan Lake. From there the headwall is an imposing sight (in background of photo 5), but is easier to hike than it seems.\nThe trail switchbacks up to the tunnel about 800' above the lake. The tunnel is about 100' long, about 7' high and cold. The views on the other side are spectacular, or so we were told. On this day there was a cloud bank on that side and we saw nothing. It reminded me of Reinhold Messner who climbed Everest 3 times and found the same view as us each time.\nThis is a good diversion from the normal Many Glacier are hikes which can be very crowded in July and August.\nI forgot to mention the field of wild flowers on the way into Many Glacier, so spectacular it caused a traffic jam (first photo).\nNote: Time and distance are for return trip.",
    "directions": "The trail head is at the Many Glacier parking area at the Many Glacier Motor Inn in Glacier National Park, Montana.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/MT/3108/reg_pt01jpg.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/3108/reg_pt02jpg.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/3108/reg_pt04jpg.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/3108/reg_pt05jpg.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/3108/narrow_pt03jpg.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/3108/narrow_pt06jpg.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/3108/narrow_pt07jpg.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/ptarmigan-tunnel-near-babb-mt-3108",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 4,
        "Time": "5 hrs",
        "Total Distance": "18 km",
        "Town": "Babb, MT",
        "Type": "out-and-back"
    },
    "title": "Ptarmigan Tunnel",
    "trail_id": "3108"
}