{
    "description": "Wine women and Song... and bicycles!\nNote, this trip threads through three Atlantic provinces, and one might easily start in any one of them within our route.\nFor the past ten yours some friends have been doing a cycle touring trip to start off the summer right. With the construction of the confederation Bridge, the possibilities opened up to do a cottage winery tour. At around the Canada day weekend, no doubt to escape the crowds that come around Charlottetown for the Festival of the Lights, they would leave to cycle tour three Atlantic provinces, three wineries, a free bridge shuttle and a free ferry ride return to our island province. A \"free ride\" they called it.\nI joined the ever changing crew about six years ago and cut my teeth on cycle touring through much of these trips.\nOur tour starts at incredibly early hours each morning, and we met up at around 8AM in Charlottetown. Our crew consisted of seven. Two sisters (Patricia and Loretta; the \"women\" in the title), Rob and Dave, two of the mainstays of the trip, (with the latter being the birthday boy),Wayne, Scott and myself. Our first day would put us through three provinces, and have us shuttled over the world's longest bridge (13K) spanning waters that freeze in the winter. (unfortunately the crossing is no longer free, since last year, they've started charging $8.00 a head to get across) After 112Kms, and the Bay Verte Winery (AKA The Wine Garden Estates) we arrived at Amherst Shore campground, a Provincial Park along the sunrise trail in Nova Scotia. It usually makes for the hardest and longest day of the whole trip, depending on the winds. There were several opportunities along the way for picking up food and other necessities, thus keeping one's bike load as light as possible. Remember to always leave some space in those panniers for at least a bottle of wine, liqueur or schnaps!\nThe Bay Verte winery is a small location that specializes in fruit wines, as well as liqueurs and locally grown grape varitals. It has a German Flaire, as do many of the vintners in the region. Perhaps it has something to do with a similar climate; I'm only guessing. I came away with a red wine for dinner, as well as a peach liqueur for an apertif. My friend Scott bought a maple liqueur and we put a bit of that to great use in a fresh salmon dish the next day.\nOne thing that you must be prepared for on trips like these is the culinary competitions that springs to life every evening. Out come the woks, camp stoves and spices, and soon enough after tents have been pitched, the aromas start to waft amidst the roar of jet stoves. Most people in the group carry all their own gear, meaning seperate tents and cooking gear, though sharing meals is common. On our first night, we made curried shrimp stirfry with pasta with a white sauce. It paired all right with a locally grown merlot. The truth is I really like red wines! You do get to sample the wines at these wineries.\nAfter our first long day of cycling, and with a fine meal matched with fun wine and conversation, our campfire flames subsided and we were down for the night. 8AM would be our departure time tomorrow, but the truth is, it never happened. I think the time we broke camp the next day was at a quarter to nine. Rob, our starting marshal, wasn't saying much to us for much of the morning...\nDay two requires us to do almost the same distance(90K), and this has been a recent change since the closing of the Nelson Memorial Campground. Our new destination was Sunset Watch Campground, in Brule Point. It has an interesting backstory, as Rob found out in a conversation with one of the owners. With no chance of purchasing a campground they had eyes on, they bought a run down one in Brule, and for the first year or so, had only five campers use their services. All they wanted was to have a place to camp all their own, and why not make some money while they're at it? It's come a long way since then, and according to the story, \"they're living the dream.\"\nOn route to Brule, we'd break off the sunrise trail to visit Malagash, home to the Jost [Yost] winery. We approached our tasting destination just after lunch time, not before seeing both a small bear cross the road as well as a deer. It seems Loretta keeps attracting the wildlife! With a safe, collision-free travel, we arrived at the winery and headed in to sample, shop and eat some lunch. I came away with a bottle of 2005 L'Acadie Pinot Grigio. I felt it would pair well with the salmon dish we'd have that night. Regardless, it was a great summer wine just to sip by itself. (remember, I like red wine, first and foremost)\nDespite our late departure from Amherst Shore, we arrived at Brule Point early thanks to the prevailing tail winds. It was lucky for us, because on our own tails were the rumbles of thunder storm clouds and distant curtains of rain. We never set up tents so fast with the dropping tempretures and increasing wind. We certainly were a spectacle amid 5th wheel camp trailers and RVs with varandas! Little kids with toy electric cars drove through our sites as we set up camp. It was hellarious, like the circus was in town. Where's the calliope?  (maybe it was inspired by all that lyca and spandex)\nSoon after making camp, we received word that we'd have free use of their Recreational shelter to prepare our dinners, and even use to sleep if the rain were to persist. We'd even have access to their propane stove and fridge. Even better, the band that was to be playing later that eveing, was rehersing as we made our meals. I'm not sure who impressed who more! Their music, or the smell of our cooking.\nThe storm blew over, and we ate to rain drumming wildly on the metal roof. I started recording audio streams from various experiences on the trip, and managed to sample the rain, the bleating sheep at a rest stop, some campfire conversation, and east coast music. The problem is that if I start to play the sounds to people, I'll break the code of \"what happens on the trail, stays on the trail!\"\nThat night, we managed a pretty nice camp fire. We capped it off by re-visiting the rec center to hear the band play. Rob finally got his free bear after a myrid of requests! With that, we called the eve of Canada Day -a night.\nLeaving Brule Point nearly on time, our plan was to meet the ferry to take us back to PEI by 1PM. It was a fun, fast ride, assisted by more tail winds. So far on this trip, it had felt much easier than previous experiences to tackle the hills and do the distances. I was feeling good!\nAfter undulating hills and a short cut off from the sunrise trail to the ferry, we arrived at the Caribou Port early. (only did 60K that day) Everyone was in fine shape. We waited for the ferry to dock while we lunched and chatted. We had no need to rush as time was on our side.\nThe ferry ride takes 70 minutes, and during the summer, they have a program called \"Music on Deck\" to entertain passengers with local talant. We chatted up a couple who were touring by motor cycle, and as the ferry opened its gates on arrival, we bid them farewell. Fiveteen minutes later, we arrived at Northumberland Campground to spend our final night of the tour, and to visit our final winery, Rossignol Estates.\nAfter pitching camp, we left to visit the winery in Little Sands. It was 7K further down the shore to the East. A tail wind once again made quick work of our adventure, and we arrived just as the owner pulled up in his truck with kayaks decorating his roof. The winery here has really come in to its own over the past few years, and with a recent competition, took home five metals for locally grown varitals, including the Isle Saint Jean Red. We paired it with a hearty pasta dish that evening, and it held its own! It turns out that three of us bought the same kind. Unfortunately, the owner didn't take us up on our warm invitation to drop by with a case of wine.\nGetting back to the campground proved a bit taxing, carrying all that wine, and now having a head wind to contend with, so three of us made some fun out of it and raced, taking turns, drafting-style, to fight the wind. It worked, and was a thrill to boot. Rob, who use to race in his younger years, really enjoyed the experience. Since I love pack riding, I was up for it as always. Bikes without panniers feel weightless!\nThat evening, we had a visit by Dave's and Rob's wives. They brought birthday cake and a BBQ. I added a hamburger to the pasta meal Scott and I prepared, and I was absolutly stuffed! All of us walked the sandy shores along the water, and in the low sunlight, came across  some tourists from Maine, who were watching seals not far away. At a glimps, the seals looked like rocks, but with binoculars, you could see them clearly. The tourists were beside themselves over the view, which was funny to witness. Off in the distance, along the coast of Nova Scotia, one could see more of the curtains of rain, and I was pleased with where we were!\nThe night wrapped up and the wives went home to fight traffic from the Canada day fire works. Our fire wasn't so great that night due to damp or unseasoned wood. Since tomorrow would be another easy day (65 odd K), departure time wouldn't be so early. Actually, our leaving times had been improving since that first morning. I think Rob was becoming proud of us.\nThe way home was to follow Route 1 all the way to Charlottetown. It was an uneventful 60K ride that brought us to the tables of Piazza Joes, the customary afternoon lunching spot where we always wrap up our winery tour. The wives rejoined the force as well as some old friends who use to cycle with us when they were able to. It was great seeing them again. We toasted to another successful trip! An o'de to vino!\nshannon Burt\nEast coast editor",
    "directions": "Leaving Charlottetown, we follow route 1 West to Bordon. The shuttle service at the confed. bridge costs $8.00 per person, and can accomodate 10 bicycles on their trailer. Remount in New Brunswick at the info center of Cape Jermain, and continue along what would be route 15 until you reach a turn to Bay Verte, along the Sunrise Trail. This is the general path to follow with the exception of Malagash to reach Jost Wineries. Upon reaching the Caribou ferry terminal, dock at PEI, and take route 1 West back to Charlottetown.\nThe GPS waypoints contain key points of interest, including the cottage wineries, the campgrounds, and supply stops.",
    "geohash": null,
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/PE/3120/reg_amherstshore.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/3120/reg_brulecamp.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/3120/reg_brulemusic.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/3120/reg_jostestates.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/3120/reg_lupins.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/3120/reg_morelupins.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/3120/reg_oldpeihouse.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/3120/reg_patriciaetal.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/3120/reg_postrain.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/3120/reg_rossignolestates.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/3120/reg_sunrisetrail.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/3120/reg_winegardenestates.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/3120/narrow_bridgeshuttle.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/3120/narrow_churchstopNB.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/3120/narrow_rossignol.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/sunrise-trail-winery-cycle-tour-near-charlottetown-pe-3120",
    "stats": {
        "Activities": "mtn-bike",
        "From": "",
        "Seasons": "summer",
        "Stars": 5,
        "Time": "28 hrs",
        "Total Distance": "340 km",
        "Town": "Charlottetown, PE",
        "Type": "out-and-back"
    },
    "title": "Sunrise trail Winery cycle tour",
    "trail_id": "3120"
}