{
    "description": "Passes through Kahshe Barrens Reserve - excellent Canadian Shield terrain with ridges, ponds, barrens, forest and swamps. The trail is marked by a few signs, cairns, and some ribbons - no blazes or paint. It's best to look for the worn paths. Pay attention or you can lose the route in open parts. From the south: heading north the trail is on a jeep track - look for a pond on the right after a short way - then becomes an old access road. It follows the old road passing many ponds (you have to go a bit off the trail to see them) to a large cleared right-of-way a major Hydro line (Minden-Swift Rapids). The trail leaves the cleared area and climbs to a ridge (if you go straight, there is a large pond about 100 meters ahead). The route continues over open ridges and in bush between them. At the 2 km sign the long bridge over the swamp is submerged and impassable but go a bit east and cross on a beaver dam then head west back to trail. There is also an excellent outlook to the east over a large barrens area a bit east on the rise before the dam. At the 3 km sign, you arrive at a particularly beautiful pond to the west of trail with light rock outcrops into the water. There is one direct outlook from the trail but go down to the shore on the north end for the best views. At 4 km the trail crosses under a phone line with low towers - poorly marked here - easy to lose trail due to the bare rock - so be careful. Continue to a memorial bench with an excellent view over large swamp meadows, cliffs and water. This is an excellent destination for a round trip. The trail continues to cross Laroger Road ([private road to Muskoka 6 east, Kahshe Lake to west) and goes west on the road to the remainder of the trail, which enters from the north. The final part traverses a swampy and very buggy area (should be re-routed to the ridges), heading east north east to end at parking near Riley Lake Road on Muskoka 6.",
    "directions": "Highway 11 - exit at Cooper's Falls Road (Simcoe 52)south of Severn Bridge. Follow 52 - it becomes Muskoka 6 through the ghost town of Cooper's Falls to the well-marked trailhead on the north side of the road (look for pedestrian crossing signs). There is parking at the trailhead but the approach is bad. It is probably better if you park on the side of the paved road where it gets wider to the east. For the other end, continue on Muskoka 6 heading east then north. The parking lot is on the west side near Riley Lake Road. The trail head is a bit south of the parking. You can make a loop by leaving a bike at one end and riding it back.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/ON/3121/reg_IMG0002JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3121/reg_IMG0003JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3121/reg_IMG0004JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3121/reg_IMG0005JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3121/reg_IMG0006JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3121/reg_IMG0008JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3121/reg_IMG0011JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3121/reg_IMG0026JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3121/reg_IMG0033JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3121/reg_Image19-21867.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3121/reg_Image20-21867.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3121/reg_Image25-21867.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3121/reg_Image5-21867.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3121/reg_Image7-21867.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3121/reg_Inukshuks-show-the-way-on-nude-hiking-trail-21867.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3121/narrow_Advisory-notice-on-nude-hiking-trail-21867.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/coopers-falls-trail-trans-canada-trail-near-gravenhurst-on-3121",
    "stats": {
        "Activities": "snowshoe hike mtn-bike",
        "From": "",
        "Seasons": "winter fall summer",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "8 km",
        "Town": "Gravenhurst, ON",
        "Type": "out-and-back"
    },
    "title": "Cooper's Falls Trail  (Trans-Canada Trail)",
    "trail_id": "3121"
}