{
    "description": "Mt. Stimson (10,142') is located in a remote part of Glacier National Park, Montana. Due to Stimson's location, it takes at least 3 days to climb this peak. There are different routes to the summit - we took the Pinchot Creek route, requiring a crossing of the Flathead river (which we did in canoe). We crossed Pinchot Creek a couple of times just by wading. This route is described in some detail in Gordon Edward's \"A Climber's Guide to Glacier National Park\". \r\nThe approach was some of the toughest hiking I have ever done and I would honestly not reccommend this route to most people; it was just very taxing, both mentally and physically. The elk trails that we attempted to follow often just mysteriously ended and we found ourselves floudering around, bushwhacking or climbing over endless deadfall! It might be more interesting to take 5 days and to do this scramble by the southeast spur route, since although there is more distance on that route, there is less 'offtrail' distance to cover. That said, the approach took us 12 hours the first day to our campsite; summit day was a 16 hour day (including 2 hours of being lost while trying to find our tent in the dark); the return trip to the car was about 11 hours. Total elevation gain on summit day was 5,300'. Distance from the cars to the saddle of the mountain is estimated to be about 10 miles (16 kms). GPS shots unfortunately are just a handful of random shots I made along the way and would not be overly helpful for a person trying to follow the Pinchot Creek route up (no waypoint at our trailhead, for example).For a more longwinded account, check out my blogspot\r\nhttp://trevorhelwig.blogspot.com/2007/07/mt-stimson.html\r\n\r\n Note: Mt Stimson is the second highest peak in Glacier National Park.",
    "directions": "See description and / or GPS",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/MT/3123/long_IMG_1861.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/3123/long_mergedshotatsummitsml.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/3123/reg_IMG_1842.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/3123/reg_IMG_1865.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/3123/reg_IMG_1879.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/3123/reg_elksdashingaccrossasnowfield.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mt-stimson-near-us-city-3123",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 4,
        "Time": "21 hrs",
        "Total Distance": "35 km",
        "Town": "US City",
        "Type": "out-and-back"
    },
    "title": "Mt. Stimson",
    "trail_id": "3123"
}