{
    "description": "This trail goes to the Pacific Ocean beach of Keeha Beach. It is basically flat, with a low at 13 m (near the trail head), and a high at 43 m. \nIt should be a short hike to the beach, BUT for the MUD and the fallen trees. As a result of the wind storm of Dec 2006, many trees block the trail, and it is extremely muddy. \nIt seems like a short hike to the beach (3.5km one way), BUT the MUDDY swampy areas and the fallen trees make for a much more difficult hike. \nWhen the trail forks for Keeha or Cape Beale about a third of the way in, stay LEFT for Keeha Beach - there is a sign, it just isn't very clear.\nThis trail gives you a work out; be prepared to get wet and muddy in even the hottest/driest months! You will go past a lake, but just keep on going until you hit a HUGE incline, that is covered with dead fall (the toughest part of the hike) But it is all worth it in the end when you hit the beautiful sandy beach ! I wouldn't recommend this trail to beginners, and I would recommend camping on the beach for at least one night! \nFYI: Bears and other wildlife are spotted often - there is a food locker at the end of the trail, or haul your food up a tree 100 meters from your camp",
    "directions": "From Port Alberni on Vancouver Island, drive the 100km road to Bamfield, a beautiful resource town on an inlet feeding into Barkley Sound.  Approximately 1 km east of Bamfield, go south on South Bamfield Road for around 2km. Parking is 400m north of the trail head.  The trail head is shared with Cape Beale's trail head and forks to Keeha Beach about a third of the way in.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/3128/long_20170718-190012-43396.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3128/reg_Keeha-Bay2-005-16421.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3128/reg_Keeha-Bay2-022-16421.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3128/reg_Keeha-Bay2-048-16421.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3128/reg_Keeha-Bay2-085-16421.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3128/reg_Keeha4521jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3128/reg_KeehaBridge4522jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3128/reg_P8165920-11958.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3128/reg_P8175943-11958.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3128/narrow_Keeha-Bay2-007-16421.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3128/narrow_P8165759-11958.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3128/narrow_P8175964-11958.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/keeha-beach-near-bamfield-bc-3128",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 1,
        "Time": "4 hrs",
        "Total Distance": "7 km",
        "Town": "Bamfield, BC",
        "Type": "out-and-back"
    },
    "title": "Keeha Beach",
    "trail_id": "3128"
}