{
    "description": "This South Ram River trail can be used with trails listed under \"Bighorn\" in TrailPeak.com.  The \"Bighorn\" trails all allow ATVs from July 1st to March 15th.  This South Ram River trail is largely used by equestrian riders; however, it can be backpacked quite easily.  ATVs are only allowed on the first 4 km of trail from December 1st to March 15th.\r\n\r\nThe trail head is located near a parking area at the east end of the Hummingbird Recreation Area. This trail is approximately 18 km (one way) where it meets up with a trail going north to Canary Creek.  Depending on weather and determination, this trail can be a 2 or 3 day backpack when looped with Canary Creek.  If you do this loop, there's about a 3.5 km walk along a road from Canary Creek/Hummingbird Creek confluence back to the South Ram River trail head.  At about 18 km, where a trail heads north to Canary Creek, there is an option to continue west along the South Ram River.  I have not been that route so I do not know its condition, but I have seen photos from equestrian riders.  It gets deep into the mountains where there is an historical warden cabin and falls and glaciers.\r\n\r\nThe first river crossing is almost immediately after the trail starts.  You cross Hummingbird Creek just west of its confluence with the South Ram River.  The trail has very little vertical gain (about 250 metres over 18 km), except for a short, steep climb at the beginning of the trail, shortly after crossing Hummingbird Creek.  The first 4 km of trail is an old exploration road and has received heavy equestrian traffic.  If the conditions are wet, this section is very muddy up to the first crossing of the South Ram River.  The remaining 14 km still has sections of the old road visible, but it is largely equestrian trail and is in pretty good shape for hiking as much of the road has been overgrown.  At the end of the first 4 km of trail, there is a nice set of falls.  The first crossing of the South Ram River is shortly after the falls, and the views and terrain become much more interesting from this point on.\r\n\r\nIn addition to the initial crossing of Hummingbird Creek, two crossings of the South Ram River will be necessary.  During spring runoff or heavy precipitation, there can be substantial base flows and diurnal stream flow fluctuations.  These conditions can turn a calm knee-deep crossing into a treacherous waist-deep crossing so it is best to be aware of stream flow conditions, particularly for Hummingbird Creek and the South Ram River, and Canary Creek can also have tremendous volumes of water with significant precipitation.\r\n\r\nIf you are carrying on North to Canary Creek, the section of trail from the South Ram River to Canary Creek (named Pleasant Valley?/ATV trail) is steep but the uphill climb is only about 150 metres and about 2 km to a high point with excellent views of Pleasant Valley and the South Ram River before descending to Canary Creek.\r\n\r\nRandom camping is available throughout, but there are numerous \"outfitter\" camps (more commonly used sites with fire pits, tree stump seats, etc.) along both the South Ram River and Canary Creek.\r\n\r\nApproximate trail lengths:\r\n-\tSouth Ram River trail head to trail junction for Canary Creek  - 18.1 km\r\n-\tSouth Ram River to Canary Creek - 3.8 km\r\n-\tCanary Creek to road/Hummingbird Creek Confluence - 9.7 km\r\n-\tRoad/Hummingbird Creek/Canary Creek Confluence back to trail head - 3.5 km\r\nTotal Loop:  Approximately 35 km\r\n\r\nN.B.  The waypoints are all in NAD 83 but Topo sheets 83B04 and 83C01 are in NAD27.  The trail also briefly goes into Topo sheets 82O13 and 82N16",
    "directions": "From Calgary:\r\n-\ttake hwy 22 to Sundre, then Caroline.\r\n-\tContinue west from Caroline.  Do not turn north on hwy 22 but continue west on hwy 591.  (The road is paved for about 30 km after Caroline but becomes gravel for the rest of the trip to the Hummingbird Creek Recreation Area)\r\n-\tThe junction of hwy 591 with 940 (aka Forestry Trunk Road) is about 40 west of Caroline.\r\n-\tTake hwy 940 north for approximately 60 km(?)\r\n-\tYou will then cross a bridge over the South Ram River.  On the other side of the valley, you'll pass the Ram Falls camping area. (You may want to go see Ram Falls either before or after your trip)\r\n-\tThe turn in to the Hummingbird Recreation Areas is about 2.8 km north of the bridge.\r\n-\tTurn west in to the Hummingbird Recreation and the parking/staging area/trail head is about 6 km.\r\n\r\nFrom Edmonton:\r\n-\ttake hwy 16 west to hwy 22\r\n-\thead south on hwy 22 to Rocky Mountain House and hwy 11\r\n-\tturn west on hwy11 until hwy 734 (Forestry Trunk Road)\r\n-\tturn south onto 734.  This is all gravel road from this point on (this road eventually becomes hwy 940)\r\n-\tdrive south until the turn for the Hummingbird Recreation Area.  If you pass the Ram Falls camping area and then the bridge over the South Ram River, then you have gone too far, as the turn is about 2.8 km north of the bridge\r",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/3129/reg_SouthRamRiver1jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3129/reg_SouthRamRiver2jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3129/reg_SouthRamTrailGooglejpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3129/reg_SouthRamTrailjpg.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/south-ram-river-near-rocky-mt-house-ab-3129",
    "stats": {
        "Activities": "mtn-bike hike",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 3,
        "Time": "21 hrs",
        "Total Distance": "36 km",
        "Town": "Rocky Mt House, AB",
        "Type": "out-and-back"
    },
    "title": "South Ram River",
    "trail_id": "3129"
}