{
    "description": "The Torrance Barrens Provincial Reserve covers a large area of unusual geology - parallel open ridges with water in between. It is a dark sky preserve for astronomy. The trailhead is clearly marked and maps are available. There are two main loops and extensions. The parking area on Southwood Road is the common starting point. The loops are marked with signs in one direction. The uploaded hike is a combination. It begins at the trailhead and goes back a short distance on the main loop to the first ridge. It heads east on an unmarked route to join the Pine Ridge Loop on the ridge. It descends to a point where there is a lovely unmarked side trail to a point in the middle of a large rocky pond. The trail continues to the next ridge and turns west. Pine Lake is just over the ridge but not visible without leaving the trail. We placed a cairn at an interesting point where the lake ends. There is some confusion with snowmobile route signs and various markings. The trail eventually leaves the ridge and crosses fens to a major junction, marked with more cairns than you can imagine. At this point you can choose to extend the loop or return. The best route back is not marked with signs facing you - it involves aiming for the ridge and a bit east onto the main loop and back to the trailhead. The main loop continues in the other direction to the road, crosses the road and goes through some bush between the road and the railway. It crosses back to the parking area. I don't recommend that part - using the main loop in reverse is really nice with views over Highland Pond.",
    "directions": "The trailhead parking is on Southwood Road (Muskoka 13) south of Gravenhurst. From the south, there is access from Highway 11 at Severn Bridge and also at Kilworthy. Muskoka 13 is narrow and winding - a lovely drive. It roughly follows the route of the CN mainline. After passing the Southwood pioneer church and cemetery (after Morrison Lake) the road comes into the open area of that is the Torrance Barrens. Look for the parking area signs on the right side. From the west, from Bala on Muskoka 169, Muskoka 13 goes south at Torrance. After about 10 km you arrive at the trailhead parking area. There is additional parking further in.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/ON/3133/reg_13-torrence-barrens-39207.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3133/reg_14-torrence-barrens-39207.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3133/reg_16-torrence-barrens-39207.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3133/reg_IMG0702JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3133/reg_IMG0703JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3133/reg_IMG0704JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3133/reg_IMG0711JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3133/reg_IMG0720JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3133/reg_IMG0721JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3133/reg_IMG0723JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3133/reg_IMG0726JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3133/reg_IMG0727JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3133/reg_MG70022JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3133/reg_MG70031JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3133/reg_MG70034JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3133/reg_MG70042JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3133/reg_MG70043JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3133/reg_best1_MG70045JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3133/reg_lakejpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3133/topo_TorranceBarrensMapjpg.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/torrance-barrens-pine-lake-loop-near-gravenhurst-on-3133",
    "stats": {
        "Activities": "snowshoe hike mtn-bike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "4 hrs",
        "Total Distance": "9 km",
        "Town": "Gravenhurst, ON",
        "Type": "out-and-back"
    },
    "title": "Torrance Barrens - Pine Lake Loop",
    "trail_id": "3133"
}