{
    "description": "High Road and the Low Road\r\n\r\nIt was around the third or fourth summer since I've put the bridge crossing on my to-do list. By this time, when I asked some paddling buddies about doing the crossing with me, there was a sigh, and a yawning reply, \"Been there done that.\" So I could see that this was going to be a project I was going to have to head up myself, though not to do all by my self.\r\n\r\nI got in touch with Ryan, as in Ryan from Newfoundland, as in one of our co-editors who just so happens to be here on the Island working as a kayak guide. Hey, an Editor's trip, Yahoo! He was pretty stoked to have the opportunity to paddle along such an iconic structure, joining two provinces over the Northumberland Strait.\r\n\r\nNow the Confederation Bridge is unique in its situation, and somewhat funny in its specifics. It's the longest bridge over ice covered waters. It couldn't get bragged as the longest bridge period. No, it's got to be the longest over water that sometimes freezes! That's special I guess.\r\n\r\nSo, to plan this trip, my first reference was from the book, \"Paddling in Paradise\" written by Alison Hughes. She crossed the strait back in 2003. In planning such an adventure, determining the slack-tide time ranges would be critical. It was preferred to go for high tidal flows, so the strategy was to drive across the bridge with the kayaks to NB, park and let-in as the tide was about to peak, and arrive on the other side as it did peak, or was beginning to drop. Grab the shuttle back to NB and drive the car back. We were expecting to cross in about two hours, given the distance, (13K) and our typical speed. (7-8Km/h). Giving some time for taking pix and to explore, a two hour crossing was a safe bet. Our window of opportunity gives us three or four hours, so I wasn't worried about tidal influence. All I was worried about was winds and other weird currents out in the open water.\r\n\r\nWe seemed to have planned the day just right according to weather forecasts and tide charts. 10K winds from the south and sunny with cloudy periods. Great. With butterflies, we approached the toll booth; \"the point of no return.\" I asked the attendant about the surface conditions, and she called in for details. Reporting back, we were told the winds were going to be 15-20 knots from the south, yet the flags at present were unenthusiastic at best. Well, we made the decision to commit with the paying of the $40.00 bridge toll, and off we went.\r\n\r\nIt's really hard to accurately judge the wave action from way, way up on the bridge. It didn't look bad at all on a grand scale, but way down on the surface was something we were going to have to discover first hand at ground zero. (ASL)\r\n\r\nWith all the planning and nerves, the actual paddling of the strait was more a matter of business once we got down to it. The open water crossing was more a psychological stressor than anything else, as it was only 13K, and you could see the island in the distance. For the first half hour, I felt stiff as I moved my boat foreword, determining just what we were getting ourselves into. After that, I relaxed, reminding myself that I've been in far worse conditions for greater distances, and had no problems. The Bay of Fundy had nothing on these seas.\r\n\r\nThe sea surface was characterized with 2 foot diagonal swells, with little to no difference on either side of the bridge piers. Occasionally the swells would grow a bit, and then calm back down. Taking pictures was the most nerve racking, but once again, more the psychological element of open water than anything else.\r\n\r\nWe took pictures, switched sides, and studied the bridge's underbelly wondering if anyone could see us from the top when we were far enough away. After about 10 or 15 piers, the whole bridge thing got a bit repetitive. Yhat made for no new photo ops. For me, it was time to surge on and get the crossing done.\r\n\r\nThe last fifth of the span was met up with three foot chop, but still nothing we couldn't handle. You certainly needed your concentration in the boat, but the wave action fell into an easily predictable interaction. No surprises.\r\n\r\nI spotted a section to the left of the bridge where boulders ceased and a grassy hill might make for good spot to take out. My recollection said that my friends who did this before, landed on the right side of the bridge by the wharf, but this is where we choose to land. The water at the shore was sheltered, and the landing was a breeze. We unloaded our things, and ran each boat up the steep bank to the grass above.\r\n\r\nOnce we arranged our gear, we noticed people who had stopped after paying their toll, to take pictures of the bridge, and some were quite amazed at our presence there with our boats, and even more surprised, hearing of our just completed crossing. One Ontario woman took our photo, and then proceeded to shuttle me across so I could bring back my car. This turned out to be great luck since we no longer needed to hike our kayaks back toward the shuttle station. I could simply pull the car over on my return and load the boats and gear on the spot.\r\n\r\nSo the crossing was done in less than two hours. The conditions were, given an open-water crossing, ideal. Ryan had a unique Island experience to brag to his buddies back home, and I had the satisfaction of planning and executing another safe and successful trip. I certainly would do it again, and if no stops were taken, the paddle would take between 90 minutes or an hour of hard paddling.\r\n\r\nShannon Burt\r\nEast Coast editor\r",
    "directions": "Plan around either a slack high or low tide, entering the water just before peak and expecting to finish at or just after peak tide.\r\nFrom PEI, launch at the Bordon wharf or adjacent beach access point. From NB, park your vehicle at the Cape Jormaine info center, and follow a rocky path to the shore just to the right of the bridge.\r\n\r\nCross by sea kayak and upon arrival, get the bridge shuttle service to take you back to NB to retrieve your car. ($8.00 fee)",
    "geohash": "f84",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/PE/3134/long_epicphotojpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/3134/reg_longreachjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/3134/reg_onmywayhomejpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/3134/reg_postpaddleposejpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/3134/reg_thechallengejpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/3134/reg_wellunderway2jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/3134/narrow_Trollsperspectivejpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/3134/narrow_highroadlowroadjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/3134/narrow_scaleshotjpg.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/confederation-bridge-crossing-near-summerside-pe-3134",
    "stats": {
        "Activities": "sea-kayak",
        "From": "",
        "Seasons": "summer",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "13 km",
        "Town": "Summerside, PE",
        "Type": "out-and-back"
    },
    "title": "Confederation Bridge Crossing",
    "trail_id": "3134"
}