{
    "description": "The 10.5 northernmost kilometres (of 75 total) of the world famous West Coast Trail, from the trail head just south of Bamfield, BC to Pacheena Point Lighthouse.\nWe were told by hikers we met that this was the easiest section, and we certainly did not find it difficult. In fact, it was a beautiful trail, with maximum elevation at 125m.\nOn July 8, 2007, it was quite dry (just a few lightly muddy sections) and nearly all cleared of the many trees that fell on it during the December 2006 storms. No evidence of bears, but a few deer. \nWe went all the way to Pacheena Point Lighthouse, 10.5 kms away, a beautiful point to break and have lunch (with some junk food available for lighthouse keeper's son's \"school fund\"), but no outhouse (closest one is 2 km further at Michigan camp site).\nOn the way back, approx. 750m from the trail head, you'll come to a point at sea level, where you'll see a blown down shack between the trail and the beach. Take the trail to the beach, and if the tide is low, head north on the beach over the rocks, and return to the trail head via beautiful Pacheena Beach, at the head of Pacheena Bay. Approx. 500m past the rocks, look for an opening in the shrubs along the beach. It's the short access trail to the trail head Information Centre.\nDON'T FORGET TO REGISTER BOTH ON AND OFF THE TRAIL AT THE INFORMATION CENTRE.",
    "directions": "Trailhead is approx 5 kms south of Bamfield on the road in. Look for the large \"Pacific Rim National Park\" and \"West Coast Trail\" signs and drive approx 500m down that side road.\nThe beautiful coastal resource town of Bamfield can be reached by driving south from Port Alberni on Vancouver Island.  The road is accessed by approx. 100km of dirt road, so give yourself plenty of time.",
    "geohash": "c0xj",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/3141/reg_WCTPRParkSign4577jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3141/reg_WCTSeaAtPacheenaLH4546jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3141/reg_WCTSignAtPacheena4545jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3141/reg_WCTTHSign4576jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3141/reg_best1_WCTPacheenaBeach4567jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3141/narrow_WCTLadder4525jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3141/narrow_WCTPacheenaLH4542jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3141/narrow_WCTRootSystem4529jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3141/narrow_WCTTrail4538jpg.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/west-coast-trail-10-northernmost-kms-near-bamfield-bc-3141",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 4,
        "Time": "6 hrs",
        "Total Distance": "21 km",
        "Town": "Bamfield, BC",
        "Type": "out-and-back"
    },
    "title": "West Coast Trail, 10 northernmost Kms",
    "trail_id": "3141"
}