{
    "description": "A reclaimed Rail Trail and 'Linear Park' administered by a consortium of area municipalities and veteran trail builders. Interesting path takes you through a number of towns so you don't even have to pack a tent if you don't want to. \r\n\r\nNor do you have to do it all. The handy proximity to towns means you can do whatever section(s) you want.\r\n\r\nNice looking trail in surprisingly scenic countryside. Sure it's flat(ish) but really, really pretty countryside. You will be pleasantly surprised if you don't just HAVE to have singletrack and steep grinds to ride up & down. \r\nThe entire trail is described in more detail in 5 other trailpeak entries, \"Search Trails\" and type in Iron Horse to find the 5 listings. Refer to the individual sections for detailed GPS logs.\r\nAn in-depth website covers most aspects of the trail, please see http://ironhorsetrail.ca/ for more info.\r\n\r\nThe most scenic area of this section of the trail starts (if Eastbound) about 6km East of St. Paul.  The trail gently drops down the Crookedheel Creek Ravine, past sloughs, 'DragonFly Alley' (my name for it after getting pegged off in the face about a dozen times by DragonFlies) and quiet, scenic countryside.\r\n\r\nThere is another interesting spot just East of Ashmont, the 'WYE' where the trail splits to the NE leg to Cold Lake and the SE leg to Heinsberg.\r\n\r\nI can also highly recommend the sink in the men's room of the Co-op gas station on the East end of St. Paul as a place to find that slow leak.\r\n\r\nThis trail is in the general area of: \r\n\r\n\r",
    "directions": "You can pick it up just about anywhere along it's length, Waskatenau in the West, Cold Lake in the NE, Heinsburg/Elk Point in the SE, St.Paul, Vilna, etc.\r\n\r\nVilna, Ashmont, Spedden, St. Paul, Edourdville all have staging areas with parking.  \r\n\r\nYou could even camp at a number of places along the line such as the WYE (above) and Edourdville.\r",
    "geohash": "c9",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/3146/reg_DSC05740_Medium_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3146/reg_DSC05745_Medium_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3146/reg_DSC05779_Medium_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3146/topo_DSC05741_Medium_.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/iron-horse-trail-ashmont-elk-point-section-near-st-paul-ab-3146",
    "stats": {
        "Activities": "snowshoe hike ski-xc mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "14 hrs",
        "Total Distance": "50 km",
        "Town": "St. Paul, AB",
        "Type": "out-and-back"
    },
    "title": "Iron Horse Trail (Ashmont-Elk Point Section)",
    "trail_id": "3146"
}