{
    "description": "This is a fun little walk that allows you to have a beer at the beginning of your walk, then again at the halfway point and then once again at the end.  Hence it is known as the Pub to Pub walk.  Total time for this walk is about 1 to 2 hours depending on your walking speed and if you walk on the path or along the ocean.  Total distance is about 6 kms.  The entire trail is well marked, flat and you can't get lost on it.  Stay tuned for some nicer pictures when the weather is more co-operative.\r\n\r\nFrom the trail head take the Ferguson Trail which is on your left.  You are heading towards the ocean and keep going this way.  In about 10 minutes you will come to a sign for the Padres Walk, follow this to the right.  There are now two trails going to the pub, one a long the beach and one just on the other side of the beach.  Take you pick.  When you get near the pub, you will notice an RV campground, don't take the short cut and go through the campground.  If you are going on the beach keep going past the pub into the parking lot.  If you are taking the path follow it to the left around the RV campground\r",
    "directions": "Take the old island highway to Campbell River, at Oyster River make a right at Regent St. (you will see the Living Waters Fellowship Church at the corner).  If you go over the Oyster River you have gone too far.  Follow Regent St. and go over the bridge, you will see the pub on your right, park just past it in the parking lot.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/3150/reg_IMG_3577_Large_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3150/reg_IMG_3583_Large_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3150/reg_best3_IMG_3578_Large.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3150/topo_IMG_3576_Large_.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/pub-to-pub-oyster-river-park-near-courtenay-bc-3150",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "6 km",
        "Town": "Courtenay, BC",
        "Type": "out-and-back"
    },
    "title": "Pub to Pub (Oyster River Park)",
    "trail_id": "3150"
}