{
    "description": "With the tall ships in town, I took the opportunity to go visit Summerside. It's a location that I've been wanting to paddle for a while now, as I visit the region frequiently.\r\n\r\nI let in around the end of the Blue Shank Road where there is a carpooling parking lot. After this trip, I think I might skip this launch site, as the perimeter is lined with boulders. For a glass boat, this is downright hateful for launching and landing.\r\n\r\nA highlight for this particular trip is Holeman Island. It's a piece of land where a lighthouse is situated. I didn't make it on this trip.\r\n\r\nThis route can best be described as an urban paddle, with many homes and city buildings lining the water. They have a nice city park with a board walk lining the waterfront further to the North.\r\n\r\nMy paddle was shorter than expected due to my timing with the tall ships, and the wind conditions. Here's the story...\r\n\r\nExiting the car, I noticed how steady the breeze was. The forcast said around 15K, but it felt more like 20. Never the less, I was undetured. After all, I paddle a Navigator which tracks pretty steady in the nastiest of conditions.\r\n\r\nIn the distance, I could see the Bluenose II with its sails down. (remember your dime image?) It appeared to be moored at the dock. Beyond that, I could see a square rigger ship. I made up my mind to B-line it to the Bluenose first. Steady paddling got me to within a couple of football fields when I noticed it had started moving. A couple of harbour dingies were shunting it out, as it and the other ship were headed to meet yet another tall ship later on that morning.\r\n\r\nI chased as long as I could, but got thinking that they might think me a terrorist or something. I took a photo or two, and then considered heading out to Holeman Island. By then the swells were getting near three feet, and considering I was paddling alone, I decided to turn back. For today, it just wasn't worth it.\r\n\r\nReturning was hastened by the tail wind, and mild surf. I arrived back at the parking lot and managed to find a place to let out without scraping the boat on underlying rocks. I did manage however to slip on said rocks and drop my boat. Luckily, only superficial damage came to it and my toe!\r\n\r\nshannon Burt\r\nEast coast editor\r",
    "directions": "From confederation bridge, leave highway 1 for route 1A to Summerside. Look for the Blue Shank Road to the right after the bridge. Alternatively, cruse summerside, and look along Water Street for water access.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/PE/3156/reg_bluenose2jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/3156/reg_summerside1JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/3156/reg_summersidejpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/3156/reg_sumside-02-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/3156/reg_sumside-05-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/3156/sumside_02.JPG"
    ],
    "source_url": "https://trailpeak.com/trails/summerside-harbour-near-summerside-pe-3156",
    "stats": {
        "Activities": "sea-kayak",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "7 km",
        "Town": "Summerside, PE",
        "Type": "out-and-back"
    },
    "title": "summerside harbour",
    "trail_id": "3156"
}