{
    "description": "NTS Map 073L07/08\r\nBy riding standards, this was a disappointing section of the IHT (and I've done the whole thing now).  A big portion of this section is mostly sand, nearly impossible to ride unless you're in training for the Tour de {fill in the blank}.  The good & bad news is it parallels the highway so it is easy to jump over & make some time.  Scenery wise, it was average.\r\nThe highlighhts of this section was the City Center motel in Bonnyville (clean & recent, tasteful refurbishment (and no, I didn't get a free room to say that)).  The second and more significant highlight is the trestle over the Beaver River, about 5km West of Cold Lake, great scenery & a fun ride across.  If you want to see it, I'd suggest you just drive to Cold Lake and ride out to it, the trail between it & CL is decently packed for adequate riding.\r\n\r\nA reclaimed Rail Trail and 'Linear Park' administered by a consortium of area municipalities and veteran trail builders. Interesting path takes you through a number of towns so you don't even have to pack a tent if you don't want to. We stayed in motels in Smoky Lake, Spedden, and St. Paul on our 4 day trip of other sections. \r\n\r\nNor do you have to do it all. The handy proximity to towns means you can do whatever section(s) you want. \r\n\r\nNice looking trail in surprisingly scenic countryside. Sure it's flat(ish) but really, really pretty countryside. You will be pleasantly surprised if you don't just HAVE to have singletrack and steep grinds to ride up & down. \r\nThe entire trail is described in more detail in 5 other trailpeak entries, \"Search Trails\" and type in Iron Horse to find the 5 listings. Refer to the individual sections for detailed GPS logs.\r\nAn in-depth website covers most aspects of the trail, please see http://ironhorsetrail.ca/ for more info. \r\n\r\nThere is another interesting spot just East of Ashmont, the 'WYE' where the trail splits to the NE leg to Cold Lake and the SE leg to Heinsberg. \r\n\r\nThis trail is in the general area of:",
    "directions": "You can pick it up just about anywhere along it's length, Waskatenau in the West, Cold Lake in the NE, Heinsburg/Elk Point in the SE, St.Paul, Vilna, etc. \r\n\r\nVilna, Ashmont, Spedden, Bonnyville, Cold Lake and more all have staging areas with parking",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/3157/reg_DSC06150-Medium--6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3157/reg_DSC06165-Medium--6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3157/DSC06165 (Medium).JPG"
    ],
    "source_url": "https://trailpeak.com/trails/iron-horse-trail-bonnyville-cold-lake-section-near-ashmont-ab-3157",
    "stats": {
        "Activities": "snowshoe hike ski-xc mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 2,
        "Time": "14 hrs",
        "Total Distance": "40 km",
        "Town": "Ashmont, AB",
        "Type": "out-and-back"
    },
    "title": "Iron Horse Trail (Bonnyville-Cold Lake Section)",
    "trail_id": "3157"
}