{
    "description": "Boughton Island is located off the central north-east shores of PEI, and unknown to us, until this summer, is a popular hangout for pleasure boaters of all types. Not so popular that it's party central, but popular enough that on arriving, you realize that the plan you hatched wasn't that original.\r\n\r\nThe Island itself is a few square kilometers in size, and is forested with a small bank of collapsed stones and sand around its perimeter. We didn't paddle its circumference, but from the line we saw, could easily imagine what PEI must have been like upon first discovery.\r\n\r\nAs we approached the island, the sun was already setting, not leaving us much time to be picky about our camp site. Our original plan for camp (a provided waypoint from a friend) appeared to be occupied, by the sounds of a loud radio and smoke rising from a camp fire. Consequently, we eyed a few patches of grass along the shore, closer in, that looked like they were free of trees, and narrowed down our selection based on a nice sandy beach.\r\n\r\nIt appeared that a few hundred meters away from our landing was a pleasure boat. It turned out that they had run out of gas, and were essentially stranded on the island. Given the beauty of the place and the incredibly hot weather we were having, that wasn't all that bad for them. They had a cell phone and plenty of water, so they were fine, just uninvited company.\r\n\r\nWe pitched the kelty tent just inside the trees where the ground was flat, and made our kitchen on the beach. I got set to collecting branches from fallen trees for firewood. Everything was bone dry from the immensely hot weather over the past week, and we had a one-match fire in no time.\r\n\r\nOur neighbors brought their boat close to shore, seemingly to enjoy the fire we had made, though they stayed below deck. At that, we said good-bye to any sense of backcountry privacy! It appeared as if we had arrived by means of this posh cruiser, instead of our sleek and faithful self powered kayaks that were tied up just beyond our line of vision; A fantasy of a life, richer than reality! (though with no gas, fortune wasn't beaming on them this time.)\r\n\r\nWith the weather so hot, we nixed the tent fly and slept on top of our bags using only the liners. The sounds in the forest seemed pretty weird. I'm guessing they were frogs, but there was this constant soft slurping or bubbling sound that wooed us to sleep. I couldn't help comparing, in my mind, the our situation, versus the couple in the cruiser. We came prepared to stay for the night, in a camp style abode, while they didn't come prepared to stay for the night, in the lap of luxury.\r\n The next morning met us with more hot weather. With breakfast made, and coffee brewing, a roll in the kayak seemed the best way to cool off.\r\nAfter packing up, we headed back to the fishing wharf back in Launching, and headed for home.\r\n\r\nOur route was the shortest version, and given some options, you could draw this trip out to a 10-16K paddle, each way. The 16K paddle would take you from Cardigan, heading East, South-East along its river out to the Island. (included on the GPS route) Another option is to leave from a let in point in Annandale, along the Boughton River, and paddle South, in open water along the coast to the Island.\r\nShannon BurtEast coast editor\r\n\r",
    "directions": "Travel from Charlottetown along Route 1 toward Wood Islands. Take Route 3 to Pools Corner, and left onto Route 4. Look for the signs to Cardigan, and either launch from the Gov. wharf there, or continue up the 311, along the King's Byway toward the community of  Launching. A fishing wharf with a boat ramp makes a great spot to short paddle the island. Waypoints provide several let in options.\r",
    "geohash": "f85",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/PE/3165/reg_boughtonisland01JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/3165/reg_kayaktrip_04.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/3165/reg_kayaktrip_15.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/3165/reg_kayaktrip_16.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/3165/reg_map.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/3165/topo_kayaktrip_02.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/3165/narrow_boughtonisland06JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/3165/narrow_kayaktrip_01.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/3165/narrow_kayaktrip_12.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/boughton-island-near-cardigan-pe-3165",
    "stats": {
        "Activities": "river-canoe sea-kayak",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "7 km",
        "Town": "Cardigan, PE",
        "Type": "out-and-back"
    },
    "title": "Boughton Island",
    "trail_id": "3165"
}