{
    "description": "Ram Ridge\r\n\r\nIf you are camping in the Ram Falls area and are looking for a day hike, then the trip up Ram Ridge is an option.  The hike is rather mundane for the first 3 ½ kilometres as it largely follows a cutline and road; however, once you reach the end of the cutline, the hike becomes much more interesting.  The payoff in terms of view is reached once you reach the exposed ridge.  Although there are good views looking east over the Foothills prior to scrambling up the scree, the best panoramic views are seen from the ridge, including a view west into the South Ram River valley.\r\n\r\nApproximate distance: 10 to 11 kilometres (return)\r\nApproxmate elevation gain: 450 metres\r\nNTS Map Sheet: 83B04\r\n(n.b. GPS track and waypoints are in NAD 83 and mapsheet may be in NAD27)\r\n\r\nThere are two options for starting the hike.  The first option is to park in the open gravel excavation on the east side of Hwy 940 just across from the cutline. There is a description of the hike in \"Hiking Alberta's David Thompson Country\" by Pat Kariel and Eric Schneider who recommend starting right at the cutline and avoiding the 4x4 track.  This may involve scrambling through scrub and crossing a stream and wet areas and finding your way back to the cutline and road on the north side of the stream.  The second option is to go a little further down the hill (north) on 940.  There is an old road into a trapper's cabin.  You can snug the vehicles up on the side of the old road off of 940.  This makes the hike a little longer, but the trail may be easier to follow and may keep your feet dry.  Walk the road to the trapper's cabin and look for the trail/road to continue west.\r\n\r\nAlthough the cutline is mostly what you might expect from a cutline, it did not appear (in 2006) to have received much, if any, ATV traffic.  A lot of the trail had been overgrown with grass, shrubs, and wildflowers making for a relatively pleasant walk for most of the first 3 ½ to 4 km to the end of the cutline.\r\n\r\nAs you near the cutline's end, there is no real trail entrance, although, there may be flagging tape still there.  You can enter the woods (south or left side of trail) at any point between the first flagging tape and the end of the cutline.  There are remnants of game trails, but mostly you'll have to pick your own way through the woods by traversing slightly uphill through the woods for about 100 to 150 metres.  Then start going straight uphill.  You should fairly quickly reach a large meadow area.  From this meadow area, you can see the ridge and where you need to go.\r\n\r\nWhile looking straight uphill, it would be best to pick a route to the saddle or low point slightly to the right (north) of the large knoll and aim for that point; however, your route may not be straight up as you'll have to study it for a bit and pick the best way up. There is no defined trail and caution is recommended as the rocks are quite sharp and loose; however, with some caution and commonsense, the scramble is quite doable. (n.b. some people may find this section a little challenging and pushing their comfort level because of loose rock, steepness, and exposure)\r\n\r\nOnce you have reached the saddle of the ridge, the rewards are evident with great views.  (Look for some small, interesting caves just below the ridge line. This, in fact, was the only shelter available during a brief thunderstorm with hail.) You can then choose to walk southeast along the ridge to another high point for a view into the South Ram River. Or you could explore the ridge to the north.\r\n\r\nAn option to return, if you have gone out to the south end of the ridge, is to cut below (east) the knoll and carefully traverse the scree just above the tree line. (check out the GPS tracks against the GoogleEarth image on trailpeak.com)  This will take you back to the open meadow and you can make your way down the way you came up.  Using this traverse (there is no trail) on the way up could also be done if you don't want to scramble up the first way described and you are confident of where you are heading.\r",
    "directions": "Directions to trailhead:  see the directions on trailpeak.com for the South Ram River hike.  They are essentially the same except for, rather than turning into the Hummingbird Recreation Area, stay on the Forestry Trunk Road (Hwy 940).  The trail head is about 6 ½ kilometres north of the bridge over the South Ram River, or 4 kilometres north of the turn into Hummingbird Recreation Area.  There is a description of the hike in \"Hiking Alberta's David Thompson Country\" by Pat Kariel and Eric Schneider.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/3172/reg_RamRidge1jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3172/reg_RamRidge2jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3172/reg_RamRidge3jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3172/reg_RamRidgeGooglejpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3172/reg_RamRidgeMapjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3172/reg_SouthRamRiver1jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3172/reg_SouthRamRiver2jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3172/reg_SouthRamRiver3jpg.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/ram-ridge-near-rocky-mt-house-ab-3172",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 3,
        "Time": "6 hrs",
        "Total Distance": "11 km",
        "Town": "Rocky Mt House, AB",
        "Type": "out-and-back"
    },
    "title": "Ram Ridge",
    "trail_id": "3172"
}