{
    "description": "Hardy Lake is a provincial park with no facilities. Bikes are not allowed and there is no camping. Canoeing is permitted. The Hardy Lake trails begin at the parking lot on Highway 169 about 12 km w of Gravenhurst. The trails are nicely shaded. Most follow the lake although several lead to Lake Muskoka. There are three trailheads in the parking lot but only one, at the west end, is obvious. This is the main loop, which  has an awful start down an old stretch of blacktop to the lake. Instead, at the main sign in the parking lot, take the trail that goes out north, (look for red ribbons) perpendicular to the lot. This traverses a barrens then skirts some lovely ponds, joining the main trail. Turn right (east) and continue on the main loop trail passing several junctions to Lake Muskoka. The trail continues in old growth pines to a wondeful bridge to an island and another bridge. From This is halfway around the lake. It you continue the trail soon diverges onto the old road to Torrance (there is a parking lot at the end of Hardy Lake Road from Torrance with a trail that soon leads to the loop.) The loop trail is not very nice back to 169. I'd stay the best thing is to turn back and then divert at the third junction (the sign and map have been removed) to a trail in the bush and then south to the parking lot. This gives you a beautiful lakeside trail and interesting bush with good variety. The lake is excellent for swimming and there is a great peninsula east of the bridges or the island between the bridges for swimming. And the trail is well shaded.",
    "directions": "On the north side of Highway 169 west about 12 km from Gravnehurst - to signs \"Hardy Lake Trails Parking\" after Walker's Point Road and before Torrance.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/ON/3177/reg_HardyLake004jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3177/reg_HardyLake011jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3177/reg_HardyLake020jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3177/reg_HardyLake026jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3177/reg_HardyLake035jpg.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/hardy-lake-trail-near-gravenhurst-on-3177",
    "stats": {
        "Activities": "hike snowshoe",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "8 km",
        "Town": "Gravenhurst, ON",
        "Type": "out-and-back"
    },
    "title": "Hardy Lake Trail",
    "trail_id": "3177"
}