{
    "description": "Fog and Granite\nFinally, we got the opportunity to kayak an area within the region of Halifax, Nova Scotia. Let me tell you, it's a destination worth returning to.\nSome friends of mine who had lived in the area, suggested Terrance Bay, which, by chance, is a great bouldering spot to boot. It soon became obvious as a paddling destination when, as we approached along route 333, we saw signs for at least three different kayak outfitters. We used those as a breadcrumb trail to find a suitable launching site. East Coast Outfitters (ECO) ended up being our final destination, and with some help from the lady at the counter, we let in across the road and were off in the fog.\nThis region borders on the Atlantic Ocean, and comparing the waters to those around PEI on this occasion, was chilly, even for the end of July! This may also account for the fog we experienced as the morning turned into afternoon and slowly began to burn off. If you live in the area, you'll know the dangers of venturing into the thick of it without navigational instruments. In this case, my GPS and spare batteries aided in keeping my head clear as to our whereabouts. We also kept very close together, so as not to loose each other in a moment of distraction. The Fog can create a confusing situation, which we can attest to in our differing opinions as to getting back to the car. We ended up backtracking, and of course, the GPS was correct.\nAlthough our route wasn't really a plan more than it was an interest in exploring the coast line sheltered by Islands further out, it was suggested that we let in on one side of the road, and rounding a few landmasses, we would paddle for an hour and come back on the other side. One landmark of interest to us was Shannon Island. I guess it's obvious as to why the interest.\nWe hoisted our kayaks across the road and let in to Wreck cove from a little white sandy beach. Turning right, we passed along Nowlan's and Brien's points before eyeing a narrow channel (Ryan's Cut) separating Hennessey's Island from Ryan's Island. Running through that, we went under a bridge into a fishing wharf area of Lower Prospect. I noticed a plaque dedicated to a 19th century shipping disaster which happened in the area. I thought nothing of it until I came across a reference to it in a local paddling guide book after doing the trip.\nAt this point, instead of rounding into Lacy's Cove, to access the other side of the road as was our suggested plan, we headed downward to Lower Woody Island, which we circled before returning home.\nThe water was calm where we paddled, except for areas where it was shallow. Here, swells caused waves to crash. All around us, there were house-sized tumbled bounders of granite. The area shows strong evidence of a glacier's aftermath, with deposited rocks strewn everywhere. The water was clear, deep and cold. Often you could see huge rocks lurking below. Occasionally, you would have to watch how close you came to the shoreline, as swells could draw your boat against the rocks.\nPaddling along, my wife asked me which place I liked to paddle more. Here, or in PEI. While both have their attractions, this is certainly the more dramatic and far more isolated location. Though this was a small sampling of the coast line, it certainly does fit as a classic example of the shoreline description from Sheet Harbour down to Lunenberg.\nAfter beaching, we loaded our boats back onto the car and thanked the outfitters for their information. This trip was certainly a tease, and an enticement for us to return for more.\nShannon Burt\nEast coast editor\nAn update:\nWe have visited this region once a summer for the past three years, and this time around, have made it a two night kayak camping trip. We basically launched from the same Wreck cove area, and paddled up toward Ryan's Island, passing the narrow passage of Ryan's Gut to circumnavigate Shannon Island. Approaching Marrs Island, you're in open water, and will experience ocean swells. If you're an experienced paddler, this will not be a problem, but for the inexperienced, or mixed parties, there's a lot of protected waters within the boundaries of Ryan's Island perimeter.\n We checked out Betty Island but couldn't find a decent landing spot at first, so checked out Hearn Island where a sandy beach made for a too-good-to-be-true landing and camp site equipped with fire rings.\nToo good to be true came on Saturday night because come around 9:30pm, the friendly locals visited us and amped up the party atmosphere for an all-nighter. Friendly and harmless crowd, but may not be your cup of tea. Our second night had us back at Betty Island for a landing to the left of the model home you'll see from the shore. there is a sandy cove (tiny and well protected) where you will find a nice spot for a few tents.\nThe return home will take you around a half hour, with the most open paddling being the 10 minutes leaving Betty Island. Afterward, you will be in island-protected waters, returning on the opposite side of the road where ECO does business.\n-August, 2010",
    "directions": "Out of Halifax, take Highway 3, west. From there, head towards Peggys Cove on route 333, and follow the ECO signs past Terence Bay, into Lower Prospect.",
    "geohash": "dxfs",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/3178/long_mapjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/3178/long_wideshot.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/3178/reg_ECOviewjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/3178/reg_IMG0042JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/3178/reg_IMG0043JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/3178/reg_IMG0044JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/3178/narrow_prospectjpg.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/lower-prospect-by-kayak-near-halifax-ns-3178",
    "stats": {
        "Activities": "sea-kayak river-canoe",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 5,
        "Time": "21 hrs",
        "Total Distance": "6 km",
        "Town": "Halifax, NS",
        "Type": "out-and-back"
    },
    "title": "Lower Prospect by Kayak",
    "trail_id": "3178"
}