{
    "description": "Savage Harbour is located around the Central North Shore area, just right from the PEI National Park and Tracadie Bay. It's home to many cottages, and shelters a fishing wharf.\r\n\r\nPaddleing the area to me, brings more beauty once you leave the harbour than inside it. If you like shore birds, than that's an entirely different story. We did see eagles and comerants. The harbour itself is fairly shallow, at least at its mouth, though not scrappingly so at the tidal time we were there. Stick to the nav buoys, and look out for other boats, as it is the shipping lane.\r\n\r\nExit the harbour mouth, and plot a course East, parallel to the beach. Typical of the entire North Shore, dune formations built up long ago, are now covered in grassy turf, creating perminant landmarks to the otherwise featureless beachscape. It is these dune-hills that the harbour itself doesn't have.\r\n\r\n6K up the same coast, (East) will get you to the edge of a popular golf course (Crowbush), while 15K the other way will get you into the above mentioned PEI national park, where you can land your craft and enjoy the white sandy beach, and accompanying bathing suit lifestyle, without the access fees! Bring a lunch and a beach towel. The water is beautifully warm!\r\n\r\nEsat Coast editor\r\nshannon Burt",
    "directions": "From Charlottetown, head out on Route 2 East toward Mount Stewart. Passing there, look for highway 217 to your left. At the junction, go right onto the 218 until you see the wharf. We launched at their boat ramp. It's an easy launch and landing.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/PE/3180/reg_savageharbour01JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/3180/reg_savageharbour02JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/3180/reg_savageharbour03JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/3180/reg_savageharbour04JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/3180/reg_savageharbour05JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/3180/reg_savageharbourmapjpg.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/savage-harbour-by-kayak-near-charlottetown-pe-3180",
    "stats": {
        "Activities": "sea-kayak",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "10 km",
        "Town": "Charlottetown, PE",
        "Type": "out-and-back"
    },
    "title": "Savage Harbour by kayak",
    "trail_id": "3180"
}