{
    "description": "Time and distance are for a round trip. Elevation gain ~1,500'.The Indefatigable Trail in Kananaskis Country is one of those must-do hikes with probably the best views in the park. Having said that, the park has de-commissioned this very popular trail from its official trails list. The reasons cited are the frequency of bear-related trail closures and the fact that the trail is quickly becoming eroded.Both are valid reasons. By August of every year, the trail is usually closed due to bear activity. And the trail is widening every year. Why? Because it is a reasonably steep trail with lots of rubble over hard packed earth or rock - much like ball bearings on a slope. Thus many hikers have taken to walking beside the trail, wider and wider to avoid slipping. But if you are careful, you should have no problems with this trail.As a testament to the popularity of this trail, there used to be 2 benches, one at the midpoint and one at the end of the trail so that hikers could either rest or just sit and admire the view. As part of the decommissioning of the trail, these have been removed. The trail sign has also been removed and replaced with a small pile of boulders.The trail starts off in nice, cool forest but soon gains steepness as it turns to a more gravelly surface. From then it's pretty much straight up. Just take your time and you will be rewarded with fantastic views. If you're not really sure-footed and don't like the ball bearings (we call them 'rollers'), allow as much time coming down as going up.Because there are no more warnings posted (because it's not an official trail anymore), you should check at the visitor centre for bear activity.And where did that name come from? Mt Indefatigable was named to commemorate a WW1 battleship of the same name.",
    "directions": "The trail starts at the Interlakes parking area (at Upper Kananaskis Lake). Walk across the dam and about 100 metres along the lakeshore trail you will see the pile of boulders and the trail to your right.",
    "geohash": "c3n05",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/3181/Indefatigable1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3181/long_Indefatigable1-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3181/reg_107-38526.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3181/reg_IMG-0739-50248.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3181/reg_Indefatigable2-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3181/reg_Indefatigable3-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3181/reg_Indefatigable4-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3181/reg_Indefatigable5-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3181/narrow_Indefatigable6-7064.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/indefatigable-near-kananaskis-ab-3181",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 5,
        "Time": "3 hrs",
        "Total Distance": "5 km",
        "Town": "Kananaskis, AB",
        "Type": "out-and-back"
    },
    "title": "Indefatigable",
    "trail_id": "3181"
}