{
    "description": "photos coming soonTime and distance are for a slow return trip. Elevation gain is ~250'.\r\n\r\nWarspite Lake is a small, cirque lake on the Black Prince Lake trail. Although it is called an interpretive trail (IT), don't be fooled into thinking it's easy. Kananaskis Country has some of the easiest and some of the hardest interpretive trials around. This is one of the hard ones. AS IT's go, it's hard, but as a hiking trail it's relatively easy and a short one for a few hours diversion.\r\n\r\nThere are 10 IT stops along the trail, although there probably won't be brochures at the trailhead. However, if you're getting tired, stop at the trail stops anyway, and try to figure out why they're there.\r\n\r\nThe trail starts out flat until it crosses the Smith-Dorrien Creek on a bridge, then starts up an old logging road. The grade is moderately steep but take your time and enjoy the views as the trees open up. Before too long you will level out and come the the loop portion of the trail. The IT portion is to the right. Soon a boulder field appears and right after that is the lake. Listen for squeaks coming from the boulder field. If you hear some, look for pikas. An interesting aspect of the boulder field is the number of fairly large spruce trees growing out of, or right through the rocks themselves.\r\n\r\nA trail runs around the right side of the lake and continues up the left headwall to the Black Prince Lakes. Return either way (loop or back the way you came).\r\n\r\nThis is grizzly country - make lots of noise.",
    "directions": "Parking area is marked as 'Black Prince' on the west side of the Smith-Dorrien/Spray Lakes Road, about 10 km north of the junction of the Kananaskis/Lougheed Road.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/3184/reg_warspite1-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3184/narrow_warspite2-7064.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/warspite-lake-near-kananaskis-ab-3184",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "5 km",
        "Town": "Kananaskis, AB",
        "Type": "out-and-back"
    },
    "title": "Warspite Lake",
    "trail_id": "3184"
}