{
    "description": "The hike to Capes Lake is a very nice linear hike that takes you to a high view point of the Comox lake area, then through old growth forest and finally to Capes Lake for lunch.  At Capes Lake you will have glimpse of the Comox glacier to your left and another beautiful peak to your right.  The first couple of hours are where you gain all the elevation and then you slowly gain the last bit as you head towards Capes Lake.  The trail is well marked with a beaten path throughout, blue blazes at the start, then flagging tape and rock cairns.  Total distance is about 12 kms, 6-7 hours return and a top elevation of 1041 meters.  Make sure to bring plenty of deet, the entire hike was very buggy when we did it.  Other then one section the trail involving a step area with a rope for aid, the trail is uneventful and anyone reasonably fit can accomplish it.\r\n\r\nFrom the parking area follow the logging road on the left and in about 100 meters you will see another road branching off to the left - take this.  For the next 20 minutes you will be walking on an old road, just keeping looking for blue blazes, ignore the road leading off to your left.  You will then come to two very large rocks, one with blue writing on it. This is the start of the trail.  Keep an eye for blue blazes, a lot of which have been covered over with moss.  When you come out to your first view point, the trail heads to your left.  You are now in an old clear cut, keep an eye out for flagging and keep heading up.  In a short while you will be in old growth again.  Once you get to a set of bluffs look to your left for flagging.  Keep trudging on.  When you get to the junction for Capes Lake and Idiens lake, make a left for Capes Lake.  In about 15 minutes you will come across a rope to help you down a step section.  The trail meanders along and in about an hour you will be at the lake.  Sign in at the registry located at the bottom right of the memorial.  Enjoy!\r\n\r\nIt is possible to head up to the Lee Plateau from Capes Lake, I will not go into detail for this route because it involves a lot of route finding and trying to find the flagging.  If you download the GPS tracks, you will be able to find this without any problems and it will take you just a bit before the junction for Capes Lake and Idiens Lake.  To get you going, the route for this starts with your back to the memorial, the trail begins to your left.  Look for flagging and head up, once at the top head towards the Comox glacier for a fantastic vista!  It is worth it just to see this.  Going this way may add an extra hour to the hike.\r",
    "directions": "Directions to the trailhead are as follows.  From Courtenay, take Lake Trail road to the Comox Lake Dam.  It is roughly 18 kms to the trail head from here, approximately 25 minutes.  Follow Comox Lake Main, when you go across the Cruikshank River (a very long high bridge) make a right onto Cruikshank main.  You are then going to drive for a bit and when you come to South Fork Main make a left and in a minute or so you will see a large clear parking area to your right.  Park here.  There should be a gravel road to the left of where you parked.  Access passed the dam is gated, staffed and restricted.  You will need to enter either before 6am or after 6pm.  Be very careful on this road because logging trucks and maintenance crews are not expecting you.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/3188/IMG_3638_Large_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3188/reg_IMG-3638-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3188/reg_IMG-3639-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3188/reg_IMG-3640-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3188/reg_IMG-3641-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3188/reg_IMG-3644-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3188/reg_IMG-3648-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3188/reg_IMG-3650-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3188/reg_IMG-3657-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3188/reg_IMG-3660-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3188/reg_IMG-3678-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3188/narrow_IMG-3643-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3188/narrow_IMG-3684-Large--4612.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/capes-lake-near-courtenay-bc-3188",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 3,
        "Time": "7 hrs",
        "Total Distance": "12 km",
        "Town": "Courtenay, BC",
        "Type": "out-and-back"
    },
    "title": "Capes Lake",
    "trail_id": "3188"
}