{
    "description": "In hindsight our trip members were very grateful that Crotch Lake was last in line when lake names were being handed out.If it held the name \"500 Island lake\", or, \"Towering pine lake -- over granite shoreline\" or \"Large pristine lake without cottages\" all of which are true, then it would be over run.    Additionally, a canoe / kayaker could be put off at the boat access area, as we found it full of trucks and powerboat trailers.  We even debated leaving altogether, without giving the Crotch a chance.  The spirits of the lake had surely done all they could to discourage another visitor. After some friendly debate, we pressed on, curious. What we found was paradise.It was the Saturday of a long weekend, and what's worse, we didn't we didn't know if there were any camping spots left as we did not book ahead.Securing the very last parking spot in the boat access area, we shoved off at 5 p.m.  My sea kayak was raring to go, it wanted to speed down the lake, but our old canoe was somewhat of a tugboat.As soon as we turned the first corner, we realized how big this lake was.  Dotted on the horizon, one could pick out a number of Islands, and this was just the south Crotch.  Our green \"viking\" canoe paddlers were a bit unsure initially -- and the winds had picked up, so we hugged the south shoreline and paddled in the shadows of what otherwise was a glorious sunny evening.Boat traffic all of a sudden became insignificant, as the large lake dwarfed any boats and most of their noise.  No cottages or houses whatsoever except for two close to the launch point.  Lots of granite shoreline, this is part of North Frontenac country, defined by the Canadian Shield.  It was beautiful.  Still unsure about where to camp, we pressed on along the south shoreline, eyeing the far shore in the distance.  You'll see in the GPS preview, my kayak darting across to the first set of Islands, looking for a vacant camping spot, then dashing back to chat with our \"viking\" paddlers.  There are in fact 77 \"official\" camp spots on this lake, some of them so idyllic  it's hard to put in words.  Soft granite landings rounded by thousands of years of weather, hundreds of peninsulas and points giving campers circling views.But none of these places would be for us - the Crotch was at capacity even if you couldn't tell.  I paddled back to our canoe crawling along the far shoreline, curious if they could take the waves whipped up by the afternoon winds.  \"Try it I said, if it gets too rough you can turn back\".  I pressed on to cross the Crotch yet again to dart in and out of the Islands looking for our resting spot.  I found none, the sign we saw on one Island resolved to be a \"no camping\" sign.  Many of the smaller Islands are do not allow camping, and rightly so, they simply don't have the size to deal with grey water or human waste.  No trace camping is required here, and those who pick up and read \"how to shit in the woods\" will again be blessed by the lake spirits of the Crotch.  Yes, the Crotch was the subject of many of our jokes, which helped cheer our spirits as we desperately looked for a place to camp.Finally, as I turned to see the \"Viking\" bravely carrying it's passengers across the lake like an undersized dog that wants to play, I realized the winds had died down.  Some higher power had opened the door to the next leg of our journey.  Even though it was now 7:30 p.m., we felt relaxed by the scenery.  The lake seemed to tell us not to worry, that it had something in mind that it was about to reveal.With the canoe safely across, we explored the far shore at the very \"crotch\" of the Crotch.  And here, within 15 minutes of our agreed upon turnaround time, we found an idyllic Island, catching almost all of the evening sun and a light breeze.  It was large enough certainly, about 100m long. But with very little flat ground, it was no doubt passed over by other campers ( reservations are required these days).The limitless twisting shoreline and rock outcrops around us made it feel as if we had the lake to ourselves.  In reality, there were families tucked away not more than a kilometer out of view.As we landed, it was cause to open a bottle of wine and enjoy the evening sun for a few moments and take some pictures.  We had a leisurely enough dinner, even a swim before sunset. We were 3/4 of way through dinner when the M airforce descended upon us.  The mosquitoes were overwhelming, so with a glance to my new MSR mesh tent, we made a dash for the bug free zone.Here we finished desert, and, the 3 of us continued our dinner time banter (and more Crotch jokes) while the Crotch gave us it's next spectacle, a night sky of stars, the milky way, and, the odd satellite or shooting star. We smiled for one Satellite which seemed to be using a flash to take a picture of us. North Frontenac is now recognized as a dark sky destination, if it's stars you want to see, the Crotch will deliver.There seemed plenty of room in the MSR. Oweing to it's almost invisible mesh, we just stargazed for the next two hours. We determined where most of the shooting stars would appear by quadrant of the tent, just as we spotted aircraft, satellite, and very low orbit mosquitoes unable to get to us.  The tent walls are so sheer, 300 mosquitoes (I actually tried to count) landed on it  wondering why their dinner had been denied.  Again we thanked MSR for both the roominess of the tent and it's mesh composition. At only 3.8 lbs, this was already my favourite tent, with a rounding endorsement by the other 2 that enjoyed it as a gazebo.After some time, the mosquitoes left, and it was time to clean up dishes, take a moonlight swim, and then retire, each to our own tent.The next day it was a slow relaxing breakfast, finally pushing off about noon. This time we explored the shoreline of the Peninsula, seeing firsthand the large number of campsites along the shore.  We zig zagged along, then Island hopped over to the opposite shore where we found a few small beaches for day use.  There are several such beaches  on the Crotch. As we rounded the corner and returned along the shore opposite our day 1 route, we found another beach and had it all to ourselves.  Not only did we snack, but we swam across the small channel to the large outcrop (100m) of granite (you can just make it out in one of the beach shots) and enjoyed our tree top setting and view of the lake.  What a great way to cap our 24 hours of adventure; a beach lunch, swim, and climb.Feeling the effects of the hot sun, we returned the final kilometer or so to our launch point, it was about 5 p.m.  Would we do the Crotch again, yes!  We each talked about how good it would be mid-week with even less traffic.  We saw several other groups canoeing, and kayaking, and here on the Crotch, it seems there is peace between the boaters and canoers, even on a long weekend.",
    "directions": "There is a north boat access area, and a south.  We only explored the south Crotch, which is part of the Mississipi canoe route.  Travelling east or west along Hwy 7 (we came from Ottawa), you take Hwy 509 north until you see Ardoch Rd.  From our direction, the turnoff to 509 happens just after the turn off to Sharbot lake on Hwy 7.  Once on Ardoch, you can stop and get a permit at the local gift shop (and ice-cream if I remember correct), then press on where you will see a sign indicating the access (gravel) road on the right that brings you to the south boat launch area, it's maybe 10 or 15 minutes on Ardoch, not long.  There is a large parking area (you need a permit to park), and, easy car access for either kayak or canoe.  Launch and head straight out of the harbour and within 500 m you will be on the large expanse of the Crotch.  A tip for canoers, do your crossing right away, and follow the north shoreline, as this is where the bounty of campsites are.  You will eventually get to the Peninsula and channel that separates the north from south Crotch, and, you will see a multitude of camp sites here, usually marked by a camp sign on a tree.  A map is available online if you google the Crotch, showing all 77 camp-sites, however, it is also fun to explore, pick, and choose.  Catching as much light as possible for sunset is one factor and we were glad for it.  Bring some form of mosquitoe netting for the group, or a tent that can act as your gazebo, allowing some communal bug free time and stargazing.NOTE: This is crown land, so do as much as you can to practice no trace camping, pack it in, pack it out.  Everything!",
    "geohash": "drcr",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/ON/3190/reg_ku-beach-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3190/long_ourIsland-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3190/reg_beach-near-launch-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3190/reg_boattrailpeak-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3190/reg_climb-swim-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3190/reg_dusk-5_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3190/reg_kurt-beach-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3190/reg_lu-and-adrian-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3190/reg_myisland-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3190/reg_our-stargazing-room-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3190/reg_ourplace-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3190/reg_summer-2012-011-40613.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3190/reg_summer-2012-012-40613.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3190/reg_summer-2012-014-40613.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3190/reg_summer-2012-018-40613.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3190/reg_swim-beach-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3190/narrow_summer-2012-009-40613.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3190/narrow_summer-2012-017-40613.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/crotch-lake-kayak-canoe-near-ottawa-on-3190",
    "stats": {
        "Activities": "river-canoe sea-kayak",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 5,
        "Time": "14 hrs",
        "Total Distance": "30 km",
        "Town": "Ottawa, ON",
        "Type": "out-and-back"
    },
    "title": "Crotch Lake Kayak / Canoe",
    "trail_id": "3190"
}