{
    "description": "This hike takes you to Mt Becher via the more difficult and longer Boston Ridge Trail.  Park at the \"Mt Becher via Boston Ridge\" sign located at the hairpin turn with the large pullout on your left.  Head along double track and after about 5 minutes you'll come to an opening.  Too the left is the start of Two Sheiks MTB trail and on the right are a series of 3 large gap jumps.   You will want to proceed south and then angle uphill on the double track.  After a few minutes you'll notice a trail to your left and a bike ramp/jump just in the forest.  Take this trail and follow it down hill.  Shortly you will come to a trail of to the right heading down to Boston Creek - it's flagged with tape.  Head down to the creek with a nice waterfall.  Across from the exit to creek bed is more tape and the creek exit.  Exit here and you'll see the trail continuing off to the right - well signed with a yellow \"BR Trail\" marker.  After this trail is very well marked for the next 8km.  Occasionally an eagle eye is required to spot the next marker but they were all there.  Trail is not as well traveled as the main trail up over Forbidden, so a bit of bushwacking can be expected as the trail was overgrown in some places.",
    "directions": "Take Forbidden Plateau Rd to the large parking are at the second to last sharp turn before reaching the old burned down lodge.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/3201/reg_800m-from-summit-of-Mt-Becher---end-of-Comox-Lake-10382.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3201/reg_Forbidden-chair-lift-and-the-comox-valley-10382.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3201/reg_Small-mountain-meadow-10382.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3201/reg_The-way-down-10382.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3201/reg_Theres-a-trail-in-there-somewhere-10382.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3201/reg_Trail-Head-sign-10382.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3201/narrow_Waterfall-on-Boston-Creek-10382.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mt-becher-via-boston-ridge-near-courtenay-bc-3201",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 4,
        "Time": "5 hrs",
        "Total Distance": "0 km",
        "Town": "Courtenay, BC",
        "Type": "out-and-back"
    },
    "title": "Mt Becher via Boston Ridge",
    "trail_id": "3201"
}