{
    "description": "The Bromont Bike park is a dream to ride, it gives lots of flow, some technical descents, and, will suit every riders ability.\r\n\r\nMy ability is intermediate, and I like the flow, so I mostly rode trails 7 and 6 -- and I have to say, I thoroughly loved seven!\r\n\r\nSeven has flow, berms, some run outs to some gaps, some 2 to 3 foot drops, some large A-frames (like on Neds in Vancouver), and some Whistler style bridge constructs that take you down some fairly serious vertical over chicken wire covered wood.  Very very nice.  I loved the drops that are fashioned out of boulders, these trails are well constructed.\r\n\r\nSo close to Montreal, I imagine it's very busy here on a weekend, but I had the pleasure of riding Bromont on a Wednesday.  It's also only $99 for a season pass -- I am getting one next year! \r\n\r\nOn this Wednesday, it was myself and a slow moving bike camp, and, 8 or 10 other riders on our trails, pure heaven, no worries about someone riding up your butt like on A-line in Whistler.  As the day wears on, the hill gets more crowded, so start early and enjoy.  I did. You'll also have a constant backdrop of screaming kids from the waterpark, as busloads of children on summer camp cover the lower mountain.  It adds to the summer festive feeling actually.\r\n\r\nI also tried trails like 19 that winds it's way along a stream, with single track and some technical rooty sections.\r\n\r\nWhether rooty technical, or flowy berm studded A-line style trails, Bromont has done an excellent job of it.  The chair is slow, but who cares, the staff do a great job of loading / unloading *(but be ready to listen in French to all instructions or you could miss something important)*.  At one point my feet were dangling under the chair as we passed the station that drops lugers off, and my feet got caught on the decking, I suppose the staff were yelling at me in French, but I didn't clue in.  Thankfully, it was a minor pull on my legs instead of ripping them off (I am tall).\r\n\r\nThis area would be ideal for a family, as there is a luge run and a series of connected water slides whose patrons use the same lift you do (during the week).  Smart, this means Bromont can afford to run their bike park mid-week which is great.  On weekends, a different lift operates for the bikers, and, perhaps one day I'll return to check out more trails on the weekend.\r\n\r\nAfter a half-day of riding, I had to press on to Vermont, so my day there consisted of riding trails six and seven, and I just loved seven thankyou! Merci!",
    "directions": "Getting to Bromont is simple.  Montrealers and Ottawans alike take Highway 10 South of Montreal, passing Granby then watching for signs to Ski Bromont.  It's just a few kilometers off the highway 10, and it has a resort feeling, this is a popular ski area but summer also offers great road biking, great XC trails, and, the bike park! Google Ski Bromont, or just click here for their bike park page.",
    "geohash": "f2h3",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/QC/3207/long_SkiBromont.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/3207/reg_ben2-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/3207/reg_benajmin-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/3207/reg_drop-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/3207/reg_kurt-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/3207/reg_kurt2-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/3207/reg_othersideofrunout-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/3207/reg_pdj5-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/3207/reg_runouttojump-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/3207/reg_skillsarea-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/3207/reg_whipby-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/3207/narrow_Cross-country-action2-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/3207/narrow_KP5Z0318-5.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/bromont-bike-park-near-granby-pq-3207",
    "stats": {
        "Activities": "mtn-bike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 5,
        "Time": "14 hrs",
        "Total Distance": "30 km",
        "Town": "Granby, PQ",
        "Type": "out-and-back"
    },
    "title": "Bromont Bike Park",
    "trail_id": "3207"
}