{
    "description": "Inner thigh - outer thigh (now named north and south dogsled) is wonderful singletrack for intermediate to advanced riders, however if taken slow -- even beginners can handle it.  There are however some bridges over swamps that one wouldn't want to fall into.  The longest bridge is nicknamed Confederation Bridge and it's pictured above. The bridges are almost as wide as a sidewalk, so it would be difficult to fall in.I love this loop, it's got some great technical features but let's you ride and get some flow going.  The pictures are in sequence, we had the camera out for 2/3 of it, giving you an idea of the sequence of obstacles.There are some rock outcrops that give you the yoyo effect which is fun, and in dry conditions you can really rip this loop.  There are also some technical climbing sections, not of great length, but a challenge to stay on the bike.  Ride this with a plushy full suspension bike and enjoy the ride.  Or for skinny XC types, your bike will love it too. The trail has been lovingly maintained by OMBA.Directions need a bit of explaining, but once you do this loop, it's easy.  Parking at K2 (see below), ride east along the edge of the woods on the double track with the new subdivision on your left. At the first major intersection, go right, and follow the main trail corridor staying on that main trail until you get to a T (bird feeder). This shows well in the satellite image above. Go left at the T initially as the map shows, and then generally stay right as you would think you would when completing a loop. When you come to a trail intersection that has an A frame bridge to your right, take it, i.e. keep looping right (as long as you are doing the loop clockwise from the T -- if not these directions are opposite). Don't try to imagine a trail that looks like an inner or outer thigh, that will just confuse you.  It's a loop. On the final third of the trail, you'll see spur trails to the left, don't take them if you want to complete this loop. One spur however is the popular Pete's Wicked and the C group usually takes this trail, eventually joining up to Rock Hopper, and then out.For a complete loop of inner/outer however (which you can session by doing multiple times) be careful to ride back to your main intersection - commonly known as the Bird Feeder, this is the T intersection that you started inner thigh on.  Of course, the GPS data loaded in your GPS would show you where you are relative to the loop.  So if you stray too far, you'll know. It can be confusing in there as there are no signs. Why after all this time there are no signs is a mystery, but in the end, this adds to the natural primordial feeling with a twist of Stone-Henge that is worth preserving.Another great option is to join OMBA (Ottawa Mountain Bike Association) weekly rides, as their Wednesday group of intermediate riders usually ends up here -- I think that level is C or B?  Or is it C+, B- they have many groups and it's fun in the fall as you ride this at night with headlights.",
    "directions": "To park at K2 (Klondike and 2nd line), drive on March Road thru the hi-tech wasteland past Mitel, Alcatel, Halogen, etc. etc.  When you get to the flashing lite at the end of the urban area and recent subdivisions, you'll turn left on Klondike.  Go to the end, through the subdivision, to the right turn that becomes 2nd line.  Park at that corner.  Note the garbage bin placed there by OMBA.  Leave no garbage, enjoy the ride.",
    "geohash": "f21cz",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/ON/3209/reg_brent10-5_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3209/reg_brent11-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3209/reg_brent12-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3209/reg_brent5-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3209/reg_brent6-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3209/reg_brent7-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3209/reg_kurt-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3209/reg_kurt2-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3209/reg_kurt3-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3209/reg_kurt4-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3209/reg_kurt8-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3209/reg_kurt9-5.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/kanata-lakes-inner-thigh-outer-thigh-near-ottawa-on-3209",
    "stats": {
        "Activities": "hike mtn-bike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 5,
        "Time": "1 hrs",
        "Total Distance": "0 km",
        "Town": "Ottawa, ON",
        "Type": "out-and-back"
    },
    "title": "Kanata Lakes, Inner Thigh - Outer Thigh",
    "trail_id": "3209"
}