{
    "description": "Time and distance are for return trip.\r\n\r\nOn the eastern side of Mount Robson Provincial Park http://www.env.gov.bc.ca/bcparks/explore/parkpgs/mtrobson.html sits the imposing massif of Mount Fitzwilliam (2907m) which was named in 1863 by Doctor Walter Butler Cheadle in honour of his travelling companion William Wentworth Fitzwilliam the Viscount Milton. Cheadle chose a peak in the Monashee Mountains between Valemont and Blue River to carry his name. Considered the first tourists to cross Canada, Milton and Cheadle endured many hardships during their long journey, including wintering on the prairies and nearly starving to death along the North Thompson River. To the north-west of Mt Fitzwilliam and tucked behind Yellowhead Mountain sits Mount O'Beirne, which seems to have been named for a pain in the ass who tagged along with the interpid duo between Fort Edmonton and Fort Kamloops. There are a number of books telling the story of Milton and Cheadle but the best is 'The North-West Passage by Land'.\r\nThere are two distinct sections to this trail; the first 7km to the Rockingham Creek campground is on a well constructed trail and the last 7km to the wilderness campground by the alpine lakes is a rocky, rooty and sometimes vague track. Many people choose to camp at Rockingham Creek which has six tent pads, latrine, bear pole and fire circle, then visit the upper basin as a dayhike. But if the weather is favourable then it is much nicer to camp at trails end in the upper basin where there are only two flat tent sites and a latrine.\r\nFrom the parking lot cross the highway and climb to the pipeline right-of-way and turn right. The trail follows the pipeline for about a kilometre then turns left and enters the forest next to the registration board. The next two kilometres offer a stiff switchbacking climb up the shoulder of Waddington Peak before the grade eases and the trail angles towards Rockingham Creek. By the time you have reached Rockingham Creek c/g you will have climbed almost 500 metres, so a rest on the bridge is well deserved.\r\n \r\nBeyond the campground the trail changes in nature as it continues its climb skirting below the north face of Mount Fitzwilliam. You'll have to cross a soggy subalpine meadow and hop across the edge of several rockslides before reaching the creek and headwall below the upper basin. The trail now turns to a cairn marked route as it crosses the rocks to a small trail sign below a large gully. While a rough trail does climb steeply to the left of this gully, the trail sign points out an easier way. Plunging into the trees for a moment the trail pops out along a creek bed and crosses to a little canyon at the far end of the headwall. Cross the creek issuing from the canyon, scramble up to a large cairn, then follow any route/cairns you can discern up this shallow gully until you reach the next trail sign. Cross the gap to the right of the trail sign and locate the trail to the campground which is next to the creek that drains the largest lake in the basin. This campground is 14km from, and nearly one kilometre above, the trailhead next to Yellowhead Lake.\r\nThe Fitzwilliam basin is a delightful place for easy exploration with numerous lakes ans scrambles to amuse the adventurous. It is also a popular haunt for grizzly bears so be sure to keep a clean camp and make plenty of noise on the trail/route.\r\nWhile there is no fee charged for this hike, you are required to sign the register where the trail turns off the pipeline right-of-way. This is an unfortunate location for the register, as it is over a kilometre from the parking lot before you find out if the campgrounds have reached capacity. Lucky for you the campgrounds rarely fill up. At 28kms return, this hike is in the range of strong dayhikers but keep in mind the route finding challenges and be prepared with map and compass.\r\nThe Friends www.friendsofjasper.com of Jasper National Park www.pc.gc.ca/jasper can set you up with the two maps you'll need for this trip: '83D15 Lucerne' and '83D16 Jasper', as usual with these 1:50000 government topos the trail is incorrectly plotted.Submitted by 'mtncat'.",
    "directions": "This trail is in British Columbia but appears in the Alberta section because the nearest town is Jasper, Alberta. The trailhead parking lot is on the north side of Hwy 16, 28 kilometres west of the town of Jasper, Alberta. At 21km you'll cross the continental divide at Yellowhead Pass (1131 m) and enter British Columbia's Mount Robson Provincial Park. Just over the divide sits the Portal Lake picnic area and trail, a nice spot for lunch and a stretch before hitting the Fitwilliam trail, another 7km down the road at the Yellowhead Lake boat launch.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/3217/reg_Big-lake-taken-above-wilderness-campground-0.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3217/reg_Gully-and-route_-east-end-of-headwall-0.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3217/reg_IMG-0760-22660.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3217/reg_Mt-Fitzwilliam-from-the-wilderness-camp-0.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3217/narrow_Gully_-west-end-of-Headwall-0.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3217/narrow_IMG-0735-22660.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3217/narrow_IMG-0751-22660.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3217/narrow_Mt-Fitzgerald-Hike-May-23-2009-008-22660.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3217/narrow_Mt-Fitzgerald-Hike-May-23-2009-022-22660.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mount-fitzwilliam-near-jasper-ab-3217",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 4,
        "Time": "8 hrs",
        "Total Distance": "28 km",
        "Town": "Jasper, AB",
        "Type": "out-and-back"
    },
    "title": "Mount Fitzwilliam",
    "trail_id": "3217"
}