{
    "description": "From Highwood Pass parking lot head north past Ptarmigan Cirque turn off onto boardwalk past benches and signs. Follow path through tree and work your way into meadow to trail going north. (This is the same path just north of parking lot that is signed to keep off because of fragile nature of meadow so head north on interpetive path a far as possible.)There should be a large boulder blocking way. Veer left and start heading up into forest.Keep ascending on main path and soon Pocaterra Cirque will come into sight. The trail will now head down thru forest then across avalanche path to a small creek. The trail now goes up to the west.Go around tarn, still heading west you will see the trail. Stay left of creek and soon you'll be following a grass patch along the talus onto a well defined path. Follow up to the west as far as you can. Look north and there's the path ascending to the pass. Stay on the snow patches rather than the rock, it's much easier on the ankles abd knees. The pass is at about 2550m. and you've travelled about 4.5km. North west goes down along Pocaterra Creek. East is the Pocaterra Ridge. Look south from pass to see Pocaterra Cirque, Tyrwhitt Cirque and above it the Grizzly Col. But these are walks for another day.",
    "directions": "Highwood Pass parking lot on Kananaskis Trail (hiway 40).\rThis stretch of hiway 40 is closed Dec. 01 to June 15 every year.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/3219/reg_P1010009-11674.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3219/reg_P1010062-11674.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3219/reg_P1010080-11674.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3219/reg_P1010096-11674.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3219/reg_P1010143-11674.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3219/reg_Pocatera-Ridge-005-14636.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3219/reg_Pocatera-Ridge-021-14636.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3219/narrow_Pocatera-Ridge-025-14636.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/little-highwood-pass-near-kananaskis-ab-3219",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 4,
        "Time": "4 hrs",
        "Total Distance": "0 km",
        "Town": "Kananaskis, AB",
        "Type": "out-and-back"
    },
    "title": "Little Highwood Pass",
    "trail_id": "3219"
}