{
    "description": "If you're a strong hiker and only have one day to hike during your trip to Jasper National Park then consider a trip up Portal Creek to Maccarib Pass. This scenic hike is often overlooked in favour of shorter trips like Cavell Meadows and the Opal Hills. The 24km distance is both the distance of the dayhike (to the pass and back) and the one way distance to Amethyst Campground in the  Tonquin Valley . The region is home to grizzly bears and woodland caribou, two of the greatest icons of the wild still remaining in Canada. Unfortunately their future is not secured, learn more at http://www.speciesatrisk.gc.ca/ and the Jasper website.Hikers can start the trail right from the parking lot, after 300m a bridge over Portal Creek leads to the main trail. This short section of trail is a bit rugged, so people on horseback should cross Portal Creek on the Marmot Basin Road and start off on the main trail. There is a public corral at the trailhead, but the tack shed belongs to a horse outfitter with cabins in the valley called Tonquin Valley Packtrips http://tonquinvalley.com/ (they cater to hikers as well). The first 4km to the Circus Valley Creek bridge is forested and within earshot of the very noisy Portal Creek. It is wise to make lots of noise along this section of trail to avoid a surprise encounter with a grizzly. Approaching the Circus Valley Creek the forest begins to open up, revealing glimpses of Marmot Mountain high above. Having crossed the bridge the trail changes in nature and there is fantastic scenery for the remainder of the journey.After crossing extensive rock-slides below Peveril Peak the trail drops down an avalanche slope to the valley floor. Just short of 9km a very beautifully located Portal Creek c/g is reached. The campground has four tent pads, two tables, a bear pole with cables and a green throne (latrine) out back. To keep you company the grave of Percy Goodair is behind the campground; Percy was killed by a grizzly while serving as a warden back in 1929.Beyond the campground the trail begins a moderate ascent to the summit of Maccarib Pass. On the way you'll pass beautiful wildflower displays and a picnic area (with latrine) used by horse parties heading into the Tonquin. While the summit of the pass is nice (over 700m higher than the trailhead), there are better views to be had from the ridge that rises north of the pass. This lofty summit is also a good place to scan for macarrib, the Quinnipiac word for caribou. The Quinnipiac are an eastern tribe and part of the Algonquin linguistic group. The name was applied in 1916, as were many others in the area by Morrison Parsons Bridgland, a surveyor with the Dominion Land Survey. http://bridgland.sunsite.ualberta.ca/index.html .Backpackers carrying on to the Tonquin Valley now have a pleasant downhill jaunt in open country with wonderful views. At 19km the hiker/horse Maccarib campground is reached, the only horse camp in the Tonquin. Behind this campground is a short path up to Majestic Meadows, go there! Traveling on towards to the Tonquin Valley you'll pass two trails on the right, the old Meadow Creek trail (abandoned and overgrown trail to Hwy16) is just beyond the campground then the signed trail to the Tonquin Valley Lodge and Moat Lake at 20km. Continue straight ahead on a heavily braided, and at times very muddy trail, for the Amethyst Lakes c/g at 24km. Both Maccarib and Amethyst campgrounds have eight sites, bear cables, tables and privy.The Friends of Jasper www.friendsofjasper.com sell the maps you'll need for this trip which include the 1:50000 government topos '83D16 Jasper' and '83D9 Amethyst Lakes', or Gemtreks 'Jasper and Maligne Lake @ 1:100000'. Reservations, which can be made up to three months in advance, are a good idea if you are visiting on a weekend in summer or early autumn. In winter, more often than not, skiers follow Portal Creek and other open areas on the valley floor instead of the summer trail. There are be no signs marking the way in winter so be sure to have maps and solid route finding skills if you plan to travel in winter. Avalanche training would also be considered a must. http://www.avalanche.caPlease be aware that camp fires are not permitted in the Tonquin Valley and dogs are now taboo as well.Submitted by 'mtncat'.",
    "directions": "Drive south of Jasper on the Icefields Parkway (Hwy 93) for 7km, after the park gate turn right on Hwy 93A. Two km up 93A, after the bridge over Portal Creek turn right on the Marmot Basin ski hill road. Six and a half km up the ski hill road the parking lot appears on the left. (just before another crossing of Portal Creek).If you plan on hitching a ride then it is best assume you'll be hiking the ski hill road from Hwy 93a, but there is an old unsigned trail that can be used to shorten the trip to 3km. It starts on the right less than 100m up the road from Hwy 93a and climbs steeply (300m in 2km) above Portal Creek. Emerging from the forest on the Marmot Basis road, turn right and pound the pavement for another kilometre to the parking lot. (If your heading out this way the trail begins in a large pullout on the left side of the road) \t\t\t\t\t\t",
    "geohash": "c3",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/3220/long_2016-06-17-11.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3220/reg_Caribou_-Macarrib-Pass-0.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3220/reg_IMG-1661-10101.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3220/reg_IMG-1667-10101.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3220/reg_Looking-down-the-Portal-from-Macarrib-Pass-0.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3220/reg_Portal-Creek_-Macarrib-Pass-0_best1_.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/maccarib-pass-near-jasper-ab-3220",
    "stats": {
        "Activities": "hike ski-xc",
        "From": "",
        "Seasons": "winter fall summer",
        "Stars": 5,
        "Time": "7 hrs",
        "Total Distance": "24 km",
        "Town": "Jasper, AB",
        "Type": "out-and-back"
    },
    "title": "Maccarib Pass",
    "trail_id": "3220"
}