{
    "description": "Mt. Myra at 1810 meters is a fantastic objective providing awesome views of Strathcona Provincial Park.  Just some of the peaks visible from the top are Mt. Thelwood, Moyeha Mtn, Mariner Mtn, Mt Tom Taylor and many more.  You can even the see the west coast.  The route up starts up on an old cat road that is quite rough but easy to follow.  From Tennant lake you head up to Sandbag lake, trail is marked with flagging and cairns.  One section up to Sandbag Lake involves some good scrambling requiring you to grab hold of some green anchors.  From Sandbag Lake the route is also flagged, cairned and in some places the path is well trodden but can be a bit tricky at times, so as long as you head upwards you are fine.  Be prepared for snow, late in the summer it should be soft enough that regular hiking boots can handle it.  The entire distance is roughly 17 kms round trip and should take about 8-9 hours.  If you would like to cut down the hiking time, you can camp at Tennant or Sandbag Lake knocking 2 to 4 hours off respectively, keep in mind these campsites are wilderness sites, no fees but also no tent pads and whatever flat ground you can find is your home for the night.  \r\n\r\nThe route to the top of Mt. Myra described here is the hiker's route.  From the parking lot head across the road and keep walking for a little while, once you head over the bridge take the trail on the left.  This is your trail for the next couple of hours.  Just keep your head down and power your way up this section.  Once you get to the dam, head up to the left.  You are now at Tennant Lake.  You will notice to your left 2 dams, head over both of these, at the second dam you will have to do a little scramble.  From here on to Sandbag Lake you will be looking for flagging and cairns.  Your next obstacle on the way to Sandbag Lake is a couple of scrambling areas that will require you to use your hands to hold on to the nearby green anchors, don't worry they're tough and will hold you.  This section can be tricky when wet so just take your time.  From Sandbag Lake, cross the little stream on the left and pick up the trail that starts to go around the lake, you will notice the trail goes to the left and up.  Keep following the rock cairns and flagging for the next hour or so.  When you come around the corner and see Mt. Myra in front of you, you want to head for the gullies kind of on the left of Mt. Myra.  The first gully you encounter is quite steep and requires the use of green anchors again.  When you get to the top of this gully head straight and look for the yellowish rock gully.  You now have two choices, if you don't like the look of this gully, loose rock, screeish type terrain, then head to the left for about 5 minutes and you will see rock cairns taking you to the top.  Either way gets you to where you want to go.  In no time now you will be at the top with the huge rock cairn.  Thank You Quagger and Co. for re-building this cairn after the last one was destroyed by back country hooligans.  Once at the top sit back and ponder your next objective!\r",
    "directions": "From Courtenay take either the old highway or the new highway to Campbell River.  Once there take Hwy 28.  You will then come to a bridge, don't go over the Buttle Narrows bridge, just keep heading straight on Buttle Lake road (or Western Mines Road).  Follow this road all the way through the mine and you will see parking on the right.  Park here.  Total time from Courtenay is about 2 hours.  Make sure to leave nothing visible in your car so that you don't return to a broken into car.",
    "geohash": "c0y",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/3226/reg_IMG-3839a-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3226/reg_IMG-3852A-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3226/reg_IMG-3864a-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3226/reg_IMG-3865a-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3226/reg_IMG-3868-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3226/reg_IMG-3869a-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3226/reg_IMG-3882-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3226/narrow_IMG-3846-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3226/narrow_IMG-3883-Large--4612.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mt-myra-near-campbell-river-bc-3226",
    "stats": {
        "Activities": "hike ski-bc",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 5,
        "Time": "8 hrs",
        "Total Distance": "17 km",
        "Town": "Campbell River, BC",
        "Type": "out-and-back"
    },
    "title": "Mt. Myra",
    "trail_id": "3226"
}