{
    "description": "Headwall Lakes hiking trail is a mix of many different kinds of trails from around Kananaskis Country. Start at the south east corner of the popular Chester Lake parking lot on the trail/road with the blue cross-country skiing sign. Follow blue path to fork, ~1 km., and veer left onto blue/yellow trail. In ~1 km. come to another fork and stay right onto yellow/orange trail and follow ~3/4 km. where path bends onto yellow ski trail. All this time you have been gently ascending on wide trails through cool forests. Follow the yellow signed trail untill it desends to the bridge over Headwall Creek. Cross bridge and go left, follow along creek. Shortly path will veer right steeply up hill. When trail levels out look to the left for a small cairn. This is where you leave the wide road for a narrow boot worn path through the forest. The path from here on is easy to navigate. After ~2 km emerge from trees at a giant talus slope. Travel along between rockslide and creek. Before entering tree again you will hear a waterfall, to the left is Mount Chester and right is Mt. James Walker. Here the path is steep, you will see the route. Upon cresting the first headwall turn around and look at the peaks on the Great Divide. Work your way along and soon view the frist Headwall Lake. The scene is stark and awe inspiring. Tread along the lake to the second headwall. Staying to the right side of the cascade make sure your hands are free for the very steep ascent. On reaching the top the second lake appears. Here your elevation is about 2350m and you've gained ~450m in 7 km. From the second lake a path leads off to options of scrambling up to The Fortress and/or dropping down a scree slope to Chester Lake.",
    "directions": "On Hiway 742 (Spray Trail), from Canmore go ~42 km south or north from Kananaskis Lake Trail ~22 km, to Chester Lake parking lot which is across from Burstall Pass trailhead. Park in south east corner. This moderate hiking trail is a liittle more strenuous than most average paths because of some rocky trails and the very steep ascent on the second headwall. It's not a difficult route, just a bit more than moderate.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/3236/reg_DSCF1395-11674.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3236/reg_P1010007-11674.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3236/reg_P1010010-11674.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3236/reg_P1010014-11674.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3236/narrow_P1010019-11674.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/headwall-lakes-near-kananaskis-ab-3236",
    "stats": {
        "Activities": "snowshoe hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "7 hrs",
        "Total Distance": "14 km",
        "Town": "Kananaskis, AB",
        "Type": "out-and-back"
    },
    "title": "Headwall Lakes",
    "trail_id": "3236"
}