{
    "description": "Full Itenerary\rDay 1: Canoe L - P 295 - Joe L - Fawn L - Little Doe L - Tom Thompson L - P 2320 - Ink L - McIntosh L - P 405 - Timberwolf L - P 765 - Misty L (Camp 1)\rDay 2: P 705 - Pandion Pond - P 335 - Shah L - P 1125 - Tim River (Around rapids: P 275, P 460 ) P 125 - Shippagew L - P 1335 - Longer L (Camp 2)\rDay 3: Burnroot L - P 155 - Perley L - Petawawa R - P 420 - P 90 - P 320 - P 365 Catfish Rapids (Camp 3)\rDay 4: Sunfish L - P 1105 - Newt L - P 750 - Manta L - P 1945 - Hogan L - P 3750 - Big Crow L - Little Crow L - Proulx L (Camp 4)\rDay 5: P 1390 - Opeongo L\r\rDistances: 120 k canoe (incl. 18 k portages), 40 k biking to return to access point 5.\r\rThe trip is not a full canoe loop. We left bikes at the end point and used them to return to our car. I rated the trail 'difficult' because of the pace, its probably 'average' in any other sense.\r\rThis is a pretty fast-paced route that takes you to the heart of Algonquin park and gives you an opportunity to explore a lot in a fairly short time. Because Algonquin is an extremely well-developed park with lots of maintained portages, canoe routes and campsites, there are many ways of shortening/extending this trip to suit your own pace and experience. As is this trip required us to get up pretty early and paddle/portage for most of the day. Except for the first day we started out around 8 am each morning and set up camp around 6 pm in the evening. Every day we had a good long lunch break (an hour or more) to have some hot food, tea, to swim, enjoy nature, and get some rest.  For comparison and to give an idea of our skill level: our average paddling speed was around 5 km/h, on average we did a 1 km portage in about 30 min total time, we rested for 15 min on portages longer than 1 km, and we did the 3.75 km portage in 1.5 hrs.\r\rThe route took us through a variety of waterways: huge lakes, tiny ponds, bogs, creeks, narrow rivers, and a few rapids. Tim river is a long, winding and shallow river where you get to practice turning skills a lot. There were a couple of windy spots on large lakes and in long narrow spots. The North Arm of Opeongo Lake was windy, but the rest was fine.  The weather was very good throughout the trip, which helped a lot.\r\rAnimals: We saw a lot of wildlife very close, most of it on boggy rivers (Tim and Petawawa) - moose, herons, beavers, and a black bear. We saw the bear as we were came around a bend - it was swimming across 30 m or so ahead. It got to the bushes on shore and got out, then came around and studied us curiously from an opening in the woods for a few minutes. Then it turned and disappeared, and we were on our way.\r\rPortages: We passed three of the rapids marked on the map where we could clearly see the route, but decided to portage around the rest. In August water levels are low but some of those rapids may be passible earlier in the season.  All portages are clearly marked on the map and on shore, and distances are accurate.  We did all portages in one carry - my boyfriend carried the canoe and a smaller backpack, I carried a bigger backpack and paddles.  The longest portage on this route is 3750 m (Hogan L to Big Crow L), it has two steep sections, but for the most part is pretty flat and well-maintained. Most portages have a couple of resting spots with beams nailed across trees to lean the canoe. \r\rSome logistics: on the first day we got to the park early, reserved the interior campsites (at access pt), and took our bikes to Opeongo Lake. We tied them to a post (park rangers agreed to keep an eye on them), came back to Canoe Lake to pick up a rental canoe at Portage Store, and started paddling around 12 pm. On the last day we finished paddling at 1 pm, biked back to Canoe lake, drove to pick up the canoe, dropped it off and were on our way back to Toronto. In retrospective, biking is a great way to shuttle, but it takes a lot of time, and gets tiresome after 18 k of paddling that day especially considering Algonquin hills.\rWe did this route on the Civic holiday weekend '07 with two extra days. We started out on Friday and returned on Tuesday beating the long weekend crowds both on the way there and back. \r\rCampsites: a campsite has to be reserved for every night. You reserve a campsite on a lake, but can't pick which one - its first come-first served. It seems Algonquin keeps around 25% of all spots on a lake unreserved, so you usually have a choice. All campsites we stayed at were clean, cleared, and well-maintained. The price is $10pp/night and the max. number of people on a campsite is 9.\rMaps: for planning a pdf map of canoe routes can be found here: http://www.cs.cmu.edu/~crpalmer/algonquin/map.html. Up-to-date maps are sold at the park.\rOptions:\r1. No biking: you can shuttle a car to access pt. 11, or get a shuttle from one of the outfitters for a price.\r2. Opeongo Lake has some open water that some might want not want to paddle across. Opeongo Outfitters runs a water taxi on the lake that goes from their store to the portage to Proulx Lake. You can book it in advance, or just wait for it there - they take people back and forth quite often during summer days (call them to find out for sure).\r",
    "directions": "Access Algonquin park from Hwy 60 and drive to Portage Store (Canoe Lake Access).\rStart at Canoe L (access p. 5), finish at Opeongo L (access p. 11).\rContact: Portage Store 705-633-5622 (summer); Opeongo Outfitters 1-800-790-1864.\r",
    "geohash": "f",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/ON/3237/reg_catfish-10436.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3237/reg_moose-10436.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3237/reg_river-10436.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3237/reg_sunset-10436.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3237/reg_triangles-10436.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/canoe-lake-to-opeongo-lake-algonquin-park-near-huntsville-on-3237",
    "stats": {
        "Activities": "mtn-bike river-canoe",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 5,
        "Time": "5 hrs",
        "Total Distance": "120 km",
        "Town": "Huntsville, ON",
        "Type": "out-and-back"
    },
    "title": "Canoe Lake to Opeongo Lake (Algonquin park)",
    "trail_id": "3237"
}