{
    "description": "Distance:  The loop is approximately 21.5 km long\r\nElevation Gain:  Approximately 700 metres to the highest point along the Iceline Trail.  With the numerous ups & downs over the lateral moraines of a number of lobes of the Emerald Glacier, the accumulated elevation gain was a touch over 900 metres, so the listed elevation gain is a little misleading as to what your legs might tell you at the end of the day.\r\nDifficulty:  Moderate to difficult.  As much of the hike is above tree-line and over rock, weather conditions could make this challenging, so proper planning and having appropriate gear ? as always ? is essential.\r\n\r\nWhat more can be said about this trail that hasn?t been said already.  According to Parks Canada, ?Yoho? is a Cree expression for awe and wonder: this hike could be considered as a signature hike for Yoho?s the beauty of Yoho National Park.\r\n\r\nIf you?re interested in glacial geomorphology, this hike has it in spades.  You can almost hear the echoes of glaciers scraping along the rock.  You literally walk up and over several lateral moraines from the Emerald Glacier, which retreated almost that morning, on a geological time scale anyway.  The rock, in some areas, is worn smooth by the glacier?s advance, and is exposed by its simultaneous - and seemingly contradictory - retreat.  The grooves left on this rock feel almost like glacial fingernails on a limestone chalkboard.  The rock over which you walk was probably covered by the Emerald Glacier less than a hundred years earlier.  The remaining glacier is actively dripping, gleaming, and glistening only few hundred metres from you as evidence of its liquefying retreat leaves you stepping carefully over strategically placed rocks in its turquoise-coloured streams and shallow ?flumes?. \r\n\r\nYou can almost reach out and touch the glacier.  In fact, although we did not do so, scrambling a short distance above the trail will get you up close and personal with the waning remnants of a retreating Emerald Glacier whose flanks are steadily disappearing off of the rugged, steep northeast-facing cliffs of the The Vice-President peak above you.\r\n\r\nIf you are simply seeking fantastic alpine views and a unique perspective from across the Yoho Valley of Takakkaw Falls and its icy reservoir, Daly Glacier, then you will be equally sated and rewarded for your efforts.\r\n\r\nThere are excellent write-ups of this hike, including the ones in ?The Wonder of Yoho: Scenes, Tales, Trails,? by Don Beers, and in ?Don?t Waste Your Time In The Rockies? by Kathy and Craig Copeland.\r\n\r\nThis particular route is a variation of routes already described on trailpeak.com under ?Takakkaw loop via Iceline and Whaleback? and ?Emerald Lake to Takakkaw Falls via Iceline?.  This loop is shorter than the other two hikes and can easily be done in a day.  In fact, the hike length can be shortened by taking the cutoff to Celeste Lake, which is shortly south of the Iceline Trail?s highest point of elevation.  We had to take (Aug.2, 2007) the longer loop via Little Yoho Valley as the bridge just near where the Celeste Lake Trail meets the Little Yoho Trail had been blown out by flooding.  As we later passed by it while near the end of the Little Yoho Valley trail, there was evidence of active construction.  So, assuming it was repaired later in 2007, the Celeste Lake option in the loop will be available; however, it is best to check first when planning your hike.  We opted for starting the hike at the Hostel end and getting most of the vertical climb out of the way while it was still cool (a little frost was on the trail at the beginning) and the legs were fresh.\r\n\r\nAlthough we had to hike several kilometres further than the Celeste Lake option would normally have taken us (about 4 km further), we were amply rewarded.  The continued marching over moraine after moraine provided even more glacial geomorphological delights as well as more outstanding views and sub alpine meadows and a great lunching point above the Iceline Trail?s high point on a moraine over-looking the Yoho Valley?s splendor, which included outstanding views of Isolation Peak and The Whaleback.\r\n\r\nThe only, minor drawback was the seemingly long walk (about 4.5 km) back down the Yoho Valley at the end of the day.  ?Don?t Waste Your Time?? did not even give it 1 boot-print out of 4 and we cannot disagree; however, letting one?s mind drift back to what it had registered over the earlier part of the day will easily take your mind off of the rather mundane final leg down.  Besides, as mentioned in the directions, your car is now ½ kilometre closer! (if you parked in the Takakkaw Falls parking lot, that is, and not at the Hostel)\r",
    "directions": "From Calgary, drive west on Highway 1 (Trans Canada Highway) approximately 200 km to the turn north to Takakkaw Falls in Yoho National Park. (You will need to purchase or have an appropriate National Parks pass.)  The parking area at the end of the road to Takakkaw Falls is 13.3 km north from Highway 1.  (The turn to Takakkaw Falls is 3.6 km east of Field, B.C.  (The turn is approximately 60 km east of Golden, B.C. and about 205 km east of Revelstoke, B.C., both of which are located on Highway 1)\r\n\r\nParking for the Iceline trail is in the Takakkaw Falls parking area (51.497255 N; 116.483012 W).  It is a flat walk of about ½ km to the trailhead adjacent to the Whiskey Jack Hostel, located on the west side of the road into Takakkaw Falls.  You will pass by it on the way to the parking area.  There is no parking allowed at the hostel other than for its patrons.  (Besides, you?ll appreciate your car being ½ km closer at the end of the day.)\r",
    "geohash": "c3j",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/3247/reg_CelesteLakeJunction-11124.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3247/reg_EmeraldGlacier-11124.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3247/reg_IMGP1745-40997.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3247/reg_IMGP1755-40997.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3247/reg_Iceline-LittleYohoValley-YohoValley-11124.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3247/reg_Iceline1-11124.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3247/reg_Iceline2-11124.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3247/reg_Iceline3-11124.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3247/reg_Iceline4-11124.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3247/reg_IsolationPeak-11124.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3247/reg_TakakkawFalls2-11124.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3247/reg_Whaleback-11124.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3247/reg_YohosArk-11124.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3247/reg_image-53653.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3247/narrow_TakakkawFalls-11124.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/iceline-little-yoho-valley-yoho-valley-loop-near-field-bc-3247",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 5,
        "Time": "9 hrs",
        "Total Distance": "21 km",
        "Town": "Field, BC",
        "Type": "out-and-back"
    },
    "title": "Iceline -Little Yoho Valley- Yoho Valley Loop",
    "trail_id": "3247"
}