{
    "description": "An excellent hike in Kokanee Glacier Provincial Park, near Nelson BC. \r\n\r\nFor this hike, we went as far as the new Kokanee Glacier Cabin at the north end of Kaslo Lake. Cabin is not an appropriate word for this building, lodge describes it better. \r\n\r\nOur hike was 18 kms return, approx 450 m elevation gain. You might want to go the extra 1.2 km to the old Slocan Chief Hut, built by miners in 1896, but now a historic site (since 2002), and to the high point on the trail, for views of the glacier.\r\n\r\nA note of interest (and possible concern): porcupines at the Kokanee Glacier Park TH like to munch on brake linings, electrical wiring, and even tires of parked vehicles. This is particularly important if you leave your car overnight. Use some of the chicken wire left by other hikers to circle your vehicle to protect it (see photo).\r\n\r\nFor more info, go to www.env.gov.bc.ca/bcparks/explore/parkpgs/kokangla.html\r",
    "directions": "From Nelson, cross the bridge over the West arm of Kootenay Lake and head east on Hway 3A 18.5 kms towards the Ferry crossing to Crawford Bay. On the way, look for signs to Kokanee Glacier Park (NOT Kokanee Creek campground), and turn left immediately at the Kokanee Forest Road and ascend 16 kms (and approx 1000 m up) on the gravel road. It's fairly rough and steep in parts. There were some conventional cars up at the parking lot. They must have hit bottom quite a few times on the drive up (and down). I personally wouldn't drive there in anything but an SUV.",
    "geohash": "c2u",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/3255/reg_Kokanee4721-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3255/reg_Kokanee4723-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3255/reg_Kokanee4740-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3255/narrow_Kokanee4724-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3255/narrow_Kokanee4732-7359.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/kokanee-and-kaslo-lakes-near-nelson-bc-3255",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 4,
        "Time": "5 hrs",
        "Total Distance": "18 km",
        "Town": "Nelson, BC",
        "Type": "out-and-back"
    },
    "title": "Kokanee and Kaslo Lakes",
    "trail_id": "3255"
}