{
    "description": "This is an ideal family paddle if you have a shuttle car - this is a one way trip!\r\rGays River is a slow-moving tributary of the Shubenacadie River. It is marshy and creeky near the headwaters (near Egmont Lake), but gets more open, and has a little more current, downstream. The river feels surprisingly remote and secluded, given that you are so close to a highway, but the trees are dense on either river bank. There are some really interesting land features along the way, and lots of waterfowl, fish and muskrats in the water.\r\rOn the day we did it, this was an ideal family paddling excursion - quiet but steady current, and a nice short distance. Note that we paddled this river just shortly after a heavy rainfall, and there was obvious flooding of the banks. There were no rocks or dangerous sections, but I don't know the conditions when the water level is lower.\r\rAlso note that much to our surprise (and dismay!), we did come across 3 people on jet-skis. There are lots of blind corners, so it's easy for them to be surprised by finding a canoe/kayak. Listen for powercraft and be prepared to 'park' along the banks if necessary.\r\rWe took out at Cooks Mill Road - next time, we plan to paddle to the Shubenacadie River and take out there.",
    "directions": "Take Hwy 102 to Elmsdale. Pass through the junction with Hwy 2 and keep straight. This road bends left after a short distance, and becomes Hwy 277.\r\rFor an easy takeout at Cooks Mill Road, turn left off Hwy 277 at Milford Road, then right onto Cooks Mill Rd. Park your shuttle car just beyond the bridge.\r\rFor the put-in, continue along Hwy 277 to the junction with 224. Follow 224 to Lake Egmont Road. Turn left. 1/2km in, you'll see a rural fire-hydrant and a small bridge over the headwaters of Gays River (photos were taken at this put-in).",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/3257/reg_DSC02283-11691.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/3257/reg_DSC02284-11691.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/3257/reg_DSC02289-11691.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/3257/narrow_DSC02293-11691.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/gays-river-paddle-near-halifax-ns-3257",
    "stats": {
        "Activities": "river-canoe river-kayak",
        "From": "",
        "Seasons": "fall spring",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "13 km",
        "Town": "Halifax, NS",
        "Type": "out-and-back"
    },
    "title": "Gays River (paddle)",
    "trail_id": "3257"
}