{
    "description": "Sun Mountain has a series of trails that serves mountain bikers and hikers. Some trails are off limits to mountain bikes. Sun Mountain is by no means difficult, but there are some fun, fast, flowy single track that will keep you smiling. Sun Mountain is a great place for a beginner rider and a fun place for more experienced riders. You could easily spend all day exploring these trails. You can get excellent trail maps a Sun Mountain Lodge. The trails are well marked; it is difficult to get lost. \r\rThe trail described below is our favourite routes. I like to complete this trail by convincing someone to drop us off at the top of Meadowlark Trailhead. This is where the GPS track starts.  Continue along Meadowlark Trail until you reach the Lower Inside Passage Trailhead. Ride Lower Inside Passage and drop in to Rader Creek (this is where the fun really starts!) to Patterson Lake trail. Follow Patterson lake trail to Cabin Trail then Chickadee (it is not as confusing as it sounds!). Chickadee Trail spits you out into a parking area. You need to cross the road to the Yellow Jacket Trailhead. Follow Yellow Jacket to Hough Homestead where you will join up with the Black Bear trail. The trailhead to Black Bear is approximately 15-20 meters down the lower Fox trail behing Hough Homestead. Ride Black Bear to Winthrop Trail and than back into Winthrop via highway 20. Continue through the 4-way stop in town and the ride ends at the Winthrop Brewing Company for a well-deserved beer or three.\r\r",
    "directions": "Driving Highway 20 (the North Cascades Highway to Winthrop), cross the bridge into Winthrop and turn right at the 4-way stop downtown. Continue through town approximately 1 mile. South of the town, the road curves to the right, crossing another bridge across the Methow River, and immediately after crossing the bridge the road will \"Y\" - turn right onto Twin Lakes Road. Follow this road 3.2 miles to Patterson Lake Road. Turn right onto Patterson Lake Road, and follow the signs 6.4 miles to Sun Mountain Lodge (Sun Mountain Lodge, 604 Patterson Lake Road, Winthrop, WA 98862). From here, drive up Thompson Ridge Road for approx 2 kms to the trail head. It is well marked.",
    "photos": [],
    "source_url": "https://trailpeak.com/trails/sun-mountain-near-us-city-3271",
    "stats": {
        "Activities": "mtn-bike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "28 km",
        "Town": "US City",
        "Type": "out-and-back"
    },
    "title": "Sun Mountain",
    "trail_id": "3271"
}