{
    "description": "Access Corkscrew either from the upper parking lot (shuttle) where many mountain bikers park to access Ned's, Pingu, Boogyman, etc. (using trailpeak, look up the CBC trail for a larger topo with road map, look for the P circle off the 2nd hairpin driving up Mt Seymour). Or use the waypoints attached. \nSpecific",
    "directions": "Exiting the parking lot, cross the road and head to the concrete barrier.  Enter the trail area just there, and immediately go left for Corkscrew.  When dumping out of Corkscrew onto the Powerline Trail, go left and take Pingu down to the Baden Powell Trail (off of which Severed, Pangor, and Boogyman can be accessed).  In the case of Boogyman, go right again (and just past Pangor) and look for Boogyman.  Boogyman is also written up on trailpeak.\nCorkscrew is a nice starter trail before doing some of the lower trails like Boogyman (double black), Severed Dick, and Pangor. Attached is the GPS track for corkscrew, and the waypoints for both Corkscrew and Boogyman.\nDirections from Vancouver:Take the Second Narrows Bridge to North Van, Shortly after crossing, look for signs to Mt. Seymour Parkway, on the right, Follow along Mt. Seymour Parkway, approximately 5 km, looking for Mt. Seymour Road (takes you up to the ski hill if you were to take it all the way). Northlands Mall is at the intersection,Just under a kilometre up Mt. Seymour Road, look for a turnoff on the left for \"Northlands Golf Course\".On the immediate right, is the parking lot, probably full of riders.For shuttlers, leave one car here and take the other up to the upper parking lot (above Boogeyman, Neds, & cokscrew)\nLocal Conditions:\n                  \t\nSome cool footage of  CBC, Corkscrew, Pingu, Pangor ...",
    "geohash": "c2b89",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/328/reg_Ted.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/328/reg_bighit.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/328/topo_crkscrewmap.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/328/narrow_mark1.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mt-seymour-corkscrew-near-north-vancouver-bc-328",
    "stats": {
        "Activities": "mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "1 km",
        "Town": "North Vancouver, BC",
        "Type": "out-and-back"
    },
    "title": "Mt. Seymour - Corkscrew",
    "trail_id": "328"
}