{
    "description": "Spencer's Gorge conservation area offers shared hiking/biking trails with many scenic lookout points.  The trail itself is mostly natural footpaths with some wooded areas but they are fairly easy to navigate.  Riding west from the trail entrance will take you to Webster's Falls - a popular place to visit for hikers and bikers.  Travel to the east and you'll pass by Tew's Falls - a stunning 41 metre waterfall.  Continue on and you'll reach Dundas peak offering an amazing view of Dundas and west Hamilton.  Even further down you'll find the path becomes densely wooded and presents a somewhat more technical ride.\r\rOverall, the trail is a non-technical, scenic ride - worthwhile if you're interested in some easy afternoon biking.  I'd highly recommend a visit just to take in the sights!",
    "directions": "From Dundas, head north on Sydenham Road to Harvest Road and turn left (west).  Follow Harvest Road for approximately 2.5 km to the Conservation entrance on your left.  An alternate route would be to follow King Street north (#8) in Dundas (which also to is called Brock Road) to Harvest Road.  Turn right (east) on Harvest and follow approximately 1 km to Conservation entrance on your right.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/ON/3290/reg_S1000420JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3290/reg_S1000421JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3290/reg_S10004252jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3290/reg_S1000427JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3290/reg_S1000432JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3290/reg_S1000442JPG.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/spencers-gorge-near-hamilton-on-3290",
    "stats": {
        "Activities": "mtn-bike hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "0 km",
        "Town": "Hamilton, ON",
        "Type": "out-and-back"
    },
    "title": "Spencer's Gorge",
    "trail_id": "3290"
}