{
    "description": "Well, I'm not sure that I'm the best person to write this particular posting, being that I'm from the east coast, and probably should stick to writing about places more common to it. I say this jokingly, because given the heady nature of living near sea level, it puts copious amounts of oxygen coursing through my veins. Hence, any rendition I have of my trip to the Rockies has a bias, in part by the altitude change, and partly by the first time Wow-Factor of mountains! \r\n\r\nThe trip started, as most of my bigger ones do, by hatching a plan. Success can most often be guaranteed when you trust the word from the locals. Such reliable words came from our Alberta editor Al Perrault's never ending list, and was finalized with a call to the Banff National Park's office. As I spoke to the rep, I figuratively stepped back to hear the sound of my lofty requests, and couldn't help but start to laugh. I heard myself asking for a three day backpacking trip that wasn't too hard (concerns about altitude's effects), but got us away from as many people as possible, and gave us stunning views of the mountains, with as many side trip opportunities as possible. It was a tall order lacking any \"Get real\" factor, given that this was Banff (the most populated national park in the country) in the heart of the tourist season. I could imagine her eyes rolling in their sockets as I spoke. \r\n\r\nAs it turns out, my phone call to the park was made in early June, for the trip in mid August. She highly recommended the Skoki Loop trail in Lake Louise. The trail entered the Slate Range from Lake Louise, and ran through a small collection of mountain peaks, which day hikes could easily tag one or two per day. After hearing the description and booking the campsites, I found out that we were the first to book them that summer. Skoki Loop is prominantly listed in their \"suggested hikes\" brochure. How could everyone else over look this potential gem? \r\n\r\nThe hike totals 34K in three days with only a small portion having an overlap of trail; a cross between a loop and a lasso, as it were. An easy day-two, would afford us the chance to peak bag Skoki Mountain if all went according to plan. \r\n\r\nOur first day would have the most altitude acquired, as we started at Fish Creek trailhead, and started up 4K worth of gravel service road. It took us a bit of time to find the parking lot due mostly to bad directions by local store and parks workers in Lake Louise. We were already late getting started and I was nerviously expecting to be arriving at our first site (Baker Lake) well past supper time. But the delay in finding the trailhead saved us both time and energy because, to our huge luck, within the first 10 minutes of hiking, we were offered a ride by a parks worker doing a laundry pickup in his huge passenger van. In doing some research, I think the reason he offered us a lift was, in part, because this was bear territory. I heard that they were seriously thinking about providing a shuttle service along this same Temple Fire Road, to reduce potential human / bear run ins. Funny, the driver never mentioned bears... \r\n\r\nAfter thanking the driver for the lift, we gladly left the dusty road behind. We set foot on what looked more like a trail than before, all be it, more like an old logging road, or one beseiged by ATVs. We were still in the woods, and occasional meadows, so our forward view of mountains was obscured. Behind us however loomed Mount Temple. If ever a mountain dominated its landscape, this one takes the cake. Eventually, we climbed ourselves out of most of the forest. By now, the trail took on a characteristic of well traveled deep ruts. This is evidence of horse travel, a prominant mode of transport to and from Skoki Lodge. Not much time later, we'd pass a group of pack ladened horses on their return. \r\n\r\nWith the breaking away from the trees, came stunning views before us. The first rugged crag view was of Redoubt Mountain on our right, and passing it, put us onto aptly named Boulder Pass. To our left is Ptarmigan Peak. Huge rocks lay strewn everywhere. Halfway Hut positions itself near the base of Redoubt mountain. As its name indicates, it marks half way between the trailhead and Skoki Lodge. It was built around the same time as the lodge (1930's) as a warming hut and refuge for backcountry skiers. \r\n\r\nPretty soon, the trail leveled off and we could see Fossil Mountain, Deception Pass (our route going home), and Ptarmigan Lake. We actually saw snow along the scree at the lake's edge. We could see Baker Lake, further to the North East, our destination for the first night. Beyond that, according to the map, was the Sawback Range. We were almost there, and the load on my back was feeling pretty heavy. The last bit of trail descended and skirted the lake, taking us into a treed area where the camp sites were laid out. \r\n\r\nBaker Lake had its pros and cons as a place to stay. The camp sites were in a common open space, with seperate locations for eating, and for food storage. Given that we were next to the lake, the bugs presented themselves in dense clouds, making time outside of the tent nearly unbearable. Thank god for Deet and our bug jackets. On the other hand, I saw my first real-life view of Alpen Glow. As the sun set, the Sawback Range was bathed in beautiful warm red light. The cold air that night cleared away most of the bugs, and I managed to poke my face out long enough, in the wee hours, to see a few falling meteors from the Perseids, which had peaked in frequency only a few nights before. \r\n\r\nOur second day greeted us with ice on the fly, and a crisp chill still lingering. Another beautiful day lay ahead, and our plan was to hike around the back side of Fossil Mountain and into Skoki Valley, wedging us between Fossil and Skoki. We were happy to leave the flies behind. The route is called the Cotton Grass Trail, and can also take you to Red Deer Lakes toward Cyclone Mountain if it wern't for the junction to Skoki. You could also forget Skoki Valley all together, and loop around the Skoki too, and come around the back end of Merlin Meadows camp. It's nice to have options. \r\n\r\nThe views along the Cotton Grass Trail were amazing for us mountain novices. Over our shoulders, a \"V\" shape formed between Anthazoan and Brachiopod Mountains. To the right, the Sawback Range with Oyster Peak. To our left, Fossil Mountain, and up ahead, Cyclone. They all gave us the feeling of being mildly boxed in. Along the way, we saw ptarmigans, picas and and marmots both on and off the trail. \r\n\r\nThis was relatively a flat and fast 8-9 K hike, with the only altitude gain being the pass between Skoki and Fossil peaks. Here, we climbed back into larch forest, and welcomed the shade. Antlers puctuated the junction, forking Deception Pass to the left, and to the right, our route to Skoki Lodge, and eventually Merlin Meadows camp, for our second night's stay. \r\n\r\nHere in Merlin Meadows, we had the place to ourselves.The tent sites were far a part, and secluded. Merlin Creek was a great source for water, and proved to be a chilly, though refreshing dip too. We arrived soon after lunch, so with the greater part of the day to spare, and with camp established, we set out to bag ourselves Skoki Mountain. \r\n\r\nThe path leading to the peak is located just past the pit toilets behind Skoki Lodge. You can learn much about the route from those running the lodge. The steep trail winds its way through forest, and we had to take breaks every five to ten minutes to recoup from the exertion. I attributed this more to the steep terrain, than from the elevation. After a go at this, we finally cleared the tree line, and were given better views of peaks beyond the mountains we neighbored. One of note was Molar Mountain to the North West. From here, it was a scree climb. We were told to head \"skyline left,\" and that we'd see a faint path with occasional carns. There were several route options in that general direction, and the going was haphazard requiring carefully placed footings. Of greater concern to us was the incoming cloud cover from behind the Wall of Jericho and Ptarmigan peaks. Looking omnious and rain bearing, we didn't want to get stuck on the Skoki in a rain storm, less thunder and lightning. After reaching 8300 feet of the peak's 8700 odd feet, we decided to turn and descend for camp. In the end, the clouds never reached us, and by supper time, we were under sunny skies once again. Safe from harm none the less, and a good decision at the time. \r\n\r\nThat night afforded us a campfire and the remains of our red wine. The views from the camp were equally impressive, though entirely different from back at Baker Lake. Here, we had Skoki, Merlin Castle, The Wall of Jerricho, and Ptarmigan Peaks, with their lingering snow layers. The temp never dipped below freezing that night, and we actually awoke to a dew-free fly! \r\n\r\nLeaving Merlin Meadows camp was a low point becuase it both marked the final day of our hike, and soon enough, the end of our stay in Alberta. Our first two days afforded us clear skies, with extended views, but on this third day, forest fire smoke from the bordering states had rolled in to haze out any real detail. One photo shooting back from Deception Pass shows this well. \r\n\r\nDeception Pass was a great hike in the direction we went. we saw the distinctive blue color of glacial fed waters of the Skoki Lakes. (Myosotis and Zigadenus) with a rock shelf between them, and a waterfall off the lower. I couldn't help but want to come back to the area in the winter with backcountry skis and skins, to see an entirely different terrain. \r\n\r\nAfter cresting the pass, we were given a broad view of the place where we had come from on day one. Welcoming us back were Redoubt Mountain and Ptarmigan Lake. We plunged down the pass and back to our first day's trail en route for home. Lunching at Halfway Hut, we passed day hikers, and some \"Highly excitable\" lodge residents, who like us, were wrapping up their stay in the mountains. \r\n\r\nThis time, we had to hike down the Temple Fire Road, with its dust and steapness. Thankfully, this time, with lighter packs. We encountered no transport vans, or anyone on foot for that matter. There was a benefit to this, too, as nearing the end of the road, we encountered a small group of big horned sheep out on the road. One even seemed to pose in the woods for a photo before dashing off into the bush. By mid afternoon, we came upon the parking lot and laid eyes on our rental car. It was nice to have the packs off and even finer to have swollen feet out of boots. Sandal days are here again! \r\n\r\nShannon Burt\r\nEast coast editor\r\ntrailpeak.com\r",
    "directions": "Head toward Lake Louise, and turning at the exit, head right instead of left toward the town of Lake Louise. Continue along the road toward the ski hill, and look for Fish Creek trail head by turning right at the Skoki Lodge sign. The Fish Creek parking lot and trailhead will be on your right.",
    "geohash": "c3j",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/3291/reg_Skoki-2009-086-25110.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3291/reg_Skoki-2009-091-25110.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3291/reg_skoki1-12mt-temple-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3291/reg_skoki1-13tarmagin-lake-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3291/reg_skoki1-14-horses-and-fossil-mtn-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3291/reg_skoki1-15baker-lake-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3291/reg_skoki1-18Alpen-glow-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3291/reg_skoki2-21brachiopod-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3291/reg_skoki2-23wall-of-jerrico-merlin-castle-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3291/reg_skoki2-24skoki-merlin-castle-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3291/reg_skoki3-39-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3291/reg_skoki3-41-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3291/reg_skoki3-48-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3291/narrow_skoki1-16bakerlake-camp-6702.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/skoki-loop-near-banff-ab-3291",
    "stats": {
        "Activities": "hike ski-bc",
        "From": "",
        "Seasons": "winter fall summer",
        "Stars": 5,
        "Time": "21 hrs",
        "Total Distance": "34 km",
        "Town": "Banff, AB",
        "Type": "out-and-back"
    },
    "title": "Skoki Loop",
    "trail_id": "3291"
}