{
    "description": "Originally we said: 1000 meters of climbing !! Well 952 actually but it rounds to 1000.\r\n\r\nThis was according to some website's calculation (who shall remain nameless other than to say it wasn't trailpeak).  But talking to my calves & thighs after & consulting the tracklog, we're not so sure.  We'll guarantee over 400, possibly even 500m total climbing, once you add up all the ups, downs & back ups, etc.\r\n\r\nOn a freakin' amazing September day starting from Lake Louise with 22 of my closest friends we rode from the parking lots across the street from the CPR station, up the Tramline Trail (~5km, 180m elevation gain) to the Lake Louise parking lots.  We raised a few eyebrows, I guess Ma & Pa Kettle from Moose Pasture, Manitoba weren't used to seeing that much Capsicum in one place.  I heard one of them say \"There's gonna be trouble, that's way tooo much pepper for one bear.\"  Anyway, I digress.  After a bathroom break for the girls (reaalllyyy?) we wound around a convoluted little route to the staff lodge and found the Ross Lake trailhaed  (it's like a trailhead but in Gaelic).  The climbing continued.\r\n\r\nRocks, roots, a trail that seemed to disappear at the edge of a creek (don't worry, I found it just on the other side), and some really cool gullys where you coasted down & picked up some speed for the other side, but when you go to the top of the other side, you weren't really prepared for the sudden left hander 90 degree turn (with a minor 100m tumble down through the rhubarb & bears if you missed it).\r\n\r\nUp to a high point (of 1838m ASL) along the side of Mt Niblock / Mt. St. Piran, then 3km down to Ross Lake. This down wasn't all enjoyable as this is where the technical rocks dumped a few friends on their heads.  Not me, no siree.  I never fall down rocky sections (when I'm er, ah, walking like a little girl).  1km later you ride down a wooden boardwalk that appears out of the dank, dark forest and guides you to the sunny shores of Ross Lake where a veritable buffet of PowerBars and CLIF Scooby Snacks awaits (wait... WHAT !!?  I thought you brought the Scooby Snacks.  D'Oh!)\r\n\r\nBy the way, somewhere along that rocky section of down, you entered British Columbia.  'Nuff said.\r\n\r\nThis was a trail that while tough & with some very rocky, technical sections, never seemed to gain that much altitude.  At least that's what we all though until it was time to go home.  w00t!!!  A little bumpy but kilometers and kilometers of sweet gravity assisted ridin'.  My GPS says I topped out at 46.6kmh.\r\n\r\nWe came a cross a couple groups of two riders who luckily were pushing at the areas where we had to pass them.  21 riders all doing 18-27 kmh.  We also came across 4 cuties from Cal-E-Fore-Neigh-A on a Horsie ride led by the ever capable \"Tex\".  Seriously though, you do want to cool it when you see horses ahead, they really get spooked by bikes.  Nearly every horse I've ever met.  Personally I think they're worried about job security.  100ml of chain lube keeps me going for a year but you need about 4 brazillion pounds of hay for these dung daddies.\r\n\r\nGreat ride, everyone on the trip made it out in one piece to enjoy a cold beer in the warm sunshine on the deck of the Canmore Rose & Crown.  26.6 km return.  Do it.\r\n\r\nThis trail starts at:\r\n\r\n\r",
    "directions": "CPR Train Station in Lake Louise.  Get to Lake Louise (you know, the one 150km West of Cowgary), take the main street across the highway overpass, past the village, through the 4way stop sign (after stopping) and take your first right. We're talking maybe 500m from the highway.  Follow this road 500m until you see 2 parking lots on the left side.  Take the 2nd one if possible, trail head is at the far end.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/3292/long_SpeedProfileMediumJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3292/reg_DSC06290MediumJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3292/reg_DSC06295MediumJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3292/reg_DSC06300MediumJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3292/reg_DSC06312MediumJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3292/reg_DSC06323MediumJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3292/reg_DSC06330MediumJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3292/reg_DSC06332MediumJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3292/reg_DSC06335MediumJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3292/reg_ProfileJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3292/narrow_DSC06286MediumJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3292/narrow_DSC06336MediumJPG.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/ross-lake-via-tramline-near-banff-ab-3292",
    "stats": {
        "Activities": "snowshoe hike ski-bc ski-xc mtn-bike",
        "From": "",
        "Seasons": "winter fall summer",
        "Stars": 4,
        "Time": "4 hrs",
        "Total Distance": "27 km",
        "Town": "Banff, AB",
        "Type": "out-and-back"
    },
    "title": "Ross Lake via Tramline",
    "trail_id": "3292"
}