{
    "description": "Done as a hike in ankle deep snow in mid-Sept 2007.\r\n\r\nThis is a hike with lots to offer, from wide open meadows, to a bit of scrambling on rocks, to walking through forest, to reaching the top of Healy Pass with fantastic views.\r\n\r\nWe had done this hike a few years ago by hiking up from Sunshine base to the Healy Pass trail, and heading east to Sunshine Village and taking the shuttle back down to Sunshine base.\r\n\r\nWe recommend you spend the $24/person (Sept 2007), take the shuttle up from Sunshine base to Sunshine Village and spend your energy walking the meadows and Healy Pass rather than hiking the Healy Creek trail from Sunshine base up to the Healy Pass trail (530 m up).\r\n\r\nWe took the long tour of the meadows, headed south towards the Mt Assiniboine trail, crossed into BC, circled around to Rock Isle Lake, Standish Viewpoint, back north to the Monarch Viewpoint (and back into Alberta), and then headed west towards Healy Pass. This tour is 1.2 km longer than heading directly west on the Healy Pass trail from Sunshine Village, but well worthwhile for the great views and pleasant walk through the meadows (with very little elevation gain).\r\n\r\nThe walk west towards Healy Pass goes through Simpson Pass and once again along the BC border. Although sections are through forest, much of the trail is in open meadows. At Simpson Pass, you will find a first trail down to Sunshine base. Do NOT go down, keep going west along Healy Pass trail.\r\n\r\nAt the Healy Creek junction back to Sunshine base (called Bourgeau parking, the 2nd trail down to Sunshine base), head west 1.5 k and approx 200 m up to Healy Pass. Don't miss the views of The Monarch, Monarch Ramparts, the tip of Mt Assiniboine, and to the west, Egypt and Scarab lakes, and northwest, Pharaoh Lake. The trail continues on to Egypt Lake, for camping and a hut.\r\n\r\nYou can then walk back down to Sunshine base via Healy Creek trail. It is 7.7 k from the junction, but quite gradual and easy, although long and boring (but better to descend it than climb it).",
    "directions": "From Banff, drive west on the TC Hway approx 10k to Sunshine Village, go south 8k on the signed Sunshine Village road and park at the Sunshine gondola station, at 1675m.\r\n\r\nIn summer, the gondola does not operate, a shuttle drives up hourly on the hour from 9 am to 5 pm, and back down hourly from 9:30 am to 5:30 pm. Call 403-762-7889 for info.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/3294/reg_Healy5242jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3294/reg_Healy5267jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3294/reg_Healy5272jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3294/narrow_Healy5254jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3294/narrow_Healy5271jpg.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/sunshine-meadows-to-healy-pass-near-banff-ab-3294",
    "stats": {
        "Activities": "ski-xc hike snowshoe",
        "From": "",
        "Seasons": "summer fall winter",
        "Stars": 4,
        "Time": "6 hrs",
        "Total Distance": "22 km",
        "Town": "Banff, AB",
        "Type": "out-and-back"
    },
    "title": "Sunshine Meadows to Healy Pass",
    "trail_id": "3294"
}