{
    "description": "The Ball's Falls conservation area offers a variety of riding for everyone.  The actual trails - mostly on the west side of the twenty mile creek are easy to navigate.  The consist mostly of ide footpaths with some hills.    On the east side of the creek there is a far more challenging trails - heavily rooted and rocky.  If you're looking for a more technical ride, hit the creek bed - I've yet to see any water in it.  You'll see in the picture, the bed is large expanses of flat rock that can be quite a challenge and a good workout.  Not sure where it ends, but it seems to go on forever.\r\rThe conservation area has a lot of historical sites to see as well.  Originally, it was the home of George Ball in the early 1800's.  On the site, George built a woolen mill and a flour / grist mill.  You can still see the ruins of the former woolen mill from the trail.  Also on the site are a blacksmith shop, lime kiln, historic church, etc.  \r\rEntrance fee for the conservation area is $3.50 (honour system).  I've rated the trails as average although the actual trail is easy.  The challenging parts are the creek bed and the trail east of the creek.  Overall, the only flaw with this trail is that it's very short.  An hour should be enough to complete the actual trails.  If your looking for a quick easy ride - this is the place.  If you ride the creek bed, you can spend hours navigating the rocks and it's much more challenging too!",
    "directions": "From the QEW, exit on Victoria Avenue and head south.  Follow Victoria Ave. all the way up the Niagara Escarpment.  At the top you'll see Sixth Avenue.  Turn left on Sixth (heading east) and follow directly to Ball's Falls.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/ON/3296/reg_BF1JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3296/reg_BF2JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3296/reg_BF3JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3296/reg_BF4JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3296/reg_BF5JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3296/reg_BF6JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3296/reg_BF7JPG.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/balls-falls-near-st-catherines-on-3296",
    "stats": {
        "Activities": "mtn-bike hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "0 km",
        "Town": "St. Catherines, ON",
        "Type": "out-and-back"
    },
    "title": "Ball's Falls",
    "trail_id": "3296"
}