{
    "description": "We did this trail as a hike in mid September, 2007. We met some people along the trail who indicated they've been up to the hut in the winter, on skis, and skied back down, on the snow covered creek.\r\n\r\nWe give it a 3 star rating because there is considerable scrambling over poorly marked rock slides on the way to Bow Hut. It does however have good redeeming features, such as the gorge, the views in the canyon along the creek up to the hut, and of course Bow Glacier Falls.\r\n\r\nWe give it a \"Difficult\" rating because of the limestone boulder to cross over the gorge which can deter many, the difficult scrambling over 3 poorly marked rock slides, and the very steep scramble up to the hut.\r\n\r\nThe 3 km walk around Bow Lake is stunning, both for the lake and the views of the surrounding mountains and glaciers. It starts at historic Num Ti Jah Lodge (www.num-ti-jah.com) and circles around the north and west side of the lake. You then arrive at the gorge, and decide whether to go to the Bow Glacier Falls, or to Bow Hut. We did both. \r\n\r\nClimbing over the limestone boulder, we took the south route and headed towards the hut. This involved going through 3 rock slides, which we found to be poorly marked. We actually did not make it right to the hut. We stopped approx 1 km away, before the final steep scramble up to the hut. For access to the hut, contact the Alpine Club of Canada (www.alpineclubofcanada.ca).\r\n\r\nOn the way back, we forded the Bow Hut creek just above the gorge where it meets Bow Glacier Creek and headed southwest towards Bow Glacier Falls, seen in the distance. We walked the area between the 2 creeks, looking for a spot to cross to the west side of Bow Glacier Creek (and avoid having to cross back over the limestone boulder at the gorge). We crossed far upstream, barefoot, where the creek is very shallow, and walked right up to the falls. We then headed back on the west side of Bow Glacier Creek, and rejoined the main trail at the gorge, then back to the trailhead at Num-Ti-Jah Lodge.",
    "directions": "Drive up the Columbia Icefields Highway approx 40 km north from the TC Hway at Lake Louise, and park at the trailhead at Num-Ti-Jah Lodge. Head west 300m or so between the lodge and the beach and you'll find the actual trailhead.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/3297/reg_Bow5297jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3297/reg_Bow5310jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3297/reg_Bow5313jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3297/narrow_Bow5307jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3297/narrow_Bow5325jpg.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/bow-lake-bow-hut-bow-glacier-falls-near-banff-ab-3297",
    "stats": {
        "Activities": "ski-xc hike snowshoe",
        "From": "",
        "Seasons": "summer fall winter",
        "Stars": 3,
        "Time": "4 hrs",
        "Total Distance": "15 km",
        "Town": "Banff, AB",
        "Type": "out-and-back"
    },
    "title": "Bow Lake, Bow Hut, Bow Glacier Falls",
    "trail_id": "3297"
}