{
    "description": "An 18 km hike with approx 300 m elevation gain, with good variety, several waterfalls, Twin Falls themselves, Twin Falls Tea House (especially if it's open), a walk through a rock field with great views, a dried up lake bed.\nMuch of the hike is through forest with limited views, but you'll go by several waterfalls, Angel's Staircase Falls, Point Lace Falls, Laughing Falls. At 8 km, you'll come to Twin Falls, an 180 m leap off a massive cliff of Cathedral limestone. There are benches to sit on below the falls, a great place for lunch. Twin Falls Tea House is nearby, however it was closed for the season in mid September, 2007.\nReturn by a different trail: continue east from the tea house along Marpole Lake trail. Soon, you'll come to a huge rock slide, at least 1 km wide. Fortunately, it has probably the best walking path across a rock field you'll ever come across. It is also the point along the whole trail that has the best unobstructed views of the mountains and glaciers to the north and east (see photo).\nAfter the descent back down to the level of the Yoho River, you will come to the Duchesnay Lake junction. The lake is only 400 m away. Make sure you make the short detour to this feature: it is a shallow green lake that dries to a pond by autumn \"Walk across my swimming pool!\" (see photo)",
    "directions": "From Banff or Lake Louise, drive west on Highway 1 (Trans Canada Highway) into BC to the turn north to Takakkaw Falls in Yoho National Park. (You will need to purchase or have an appropriate National Parks pass.) The parking area at the end of the road to Takakkaw Falls is 13.3 km north from Highway 1. (The turn to Takakkaw Falls is 3.6 km east of Field, B.C. (The turn is approximately 60 km east of Golden, B.C. and about 205 km east of Revelstoke, B.C., both of which are located on Highway 1) \nParking for the Twin Falls trail is in the Takakkaw Falls parking area (51.497255 N; 116.483012 W). Walk NW approx 1/2 km to and through the campground to the trailhead.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/3298/long_TwinFalls5341jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3298/reg_E-at-top-of-TF-fivebyseven-10003.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3298/reg_TwinFalls5332jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3298/reg_TwinFalls5354jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3298/reg_TwinFalls5359jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3298/narrow_IMG-20140629-163510-51117.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3298/narrow_TwinFalls5337jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3298/narrow_TwinFalls5342jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3298/narrow_TwinFalls5355jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3298/narrow_TwinFalls5357jpg.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/twin-falls-near-field-bc-3298",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 4,
        "Time": "5 hrs",
        "Total Distance": "18 km",
        "Town": "Field, BC",
        "Type": "out-and-back"
    },
    "title": "Twin Falls",
    "trail_id": "3298"
}