{
    "description": "The Allanburg trails are easy, scenic trails that are well suited to walking / hiking and casual riding.  The trails are mainly fine gravel and very wide permitting many cyclists and hikers.  The trail runs alongside the welland canal and travel from the Allanburg lift bridge to Beaverdams road to the north.  There are some lookout areas offering picturesque views and a bridge that takes you over some rapids.  \r\rNote:  To the east of the trail from the parking area, you'll see a dirt path.  I'm guessing this might lead to some more dirt trails (single-track stuff) however I didn't try it out.  Stay tuned and I'll post an update in a trail review after my next ride at Allanburg.",
    "directions": "Take the QEW to St. Catharines.  Exit at the #406 and head south to Regional Road #20 (Canboro Road).  Turn left (heading east) on Canboro Road and follow until you reach Holland Road and turn left.  If you go too far here you'll go over the Allanburg lift bridge over the Welland Canal.  Follow Holland road for about 350 metres until you see a path from the road on your right.  You've arrived.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/ON/3300/reg_AB1JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3300/reg_AB2JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3300/reg_AB3JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3300/reg_AB4JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3300/reg_AB5JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3300/reg_AB6JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3300/reg_AB7JPG.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/allanburg-trails-near-st-catherines-on-3300",
    "stats": {
        "Activities": "mtn-bike hike",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 2,
        "Time": "1 hrs",
        "Total Distance": "0 km",
        "Town": "St. Catherines, ON",
        "Type": "out-and-back"
    },
    "title": "Allanburg Trails",
    "trail_id": "3300"
}