{
    "description": "The Twelve Trail runs along the Twelve Mile Creek in St. Catharines.  The trail starts just south of downtown and runs south, parallel to the creek to the hydro generating station.  Climb up \"hydro hill\" and the trails continues through a heavily wooded area - nothing but some awesome single-track here.  Actually most of the trail is single-track and can be busy with joggers / bikers.  Pay attention as there are a lot of blind corners.  It's definitely a good ride - lots of hills with small jumps and twisty paths.  An alternate starting point (making for a somewhat shorter ride) is an exit off of Glendale Avenue as shown on the GPS track.  \r\rWhat I like most about the Twelve Trail is the mixed riding.  The wooded area is rooted, hilly and twisty.  The open area is also hilly with some small jumps that can get ya moving fast.  \r",
    "directions": "Take the QEW to St. Catharines.  Exit at the #406 and head south to Glendale Avenue.  Exit left on Glendale (heading west) and follow for 2.3 km.  You'll be turning right from Glendale onto a dirt road (the old Glendale Avenue).  If you end up crossing a bridge before your turnoff, you've gone too far.   \r\r",
    "geohash": "dpxtk",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/ON/3302/reg_TT1JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3302/reg_TT2JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3302/reg_TT3JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3302/reg_TT4JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3302/reg_TT5JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3302/reg_TT6JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3302/reg_TT7JPG.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/twelve-trail-near-st-catherines-on-3302",
    "stats": {
        "Activities": "mtn-bike",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "0 km",
        "Town": "St. Catherines, ON",
        "Type": "out-and-back"
    },
    "title": "Twelve Trail",
    "trail_id": "3302"
}