{
    "description": "Lake Minnewanka is a staple of  Banff National Park.  Unusually they allow some powered boats on the lake (upside if you're a fisherman, downside if you don't want to hear them).  Along the Northern shore you will find a popular trail and what is referred to as the best single-track open to bikes in all of Banff National Park.  It is likely open to bikes as it is very rocky and a lot of bikes can ride across rocks without substantially damaging them.  I believe along the Southern shore there is another trail as well but that is NOT the focus of this writeup.\nLake Minnewanka itself has a lot of history, in fact it has been dammed 3 times to supply hydro-electric power.  The most recent damming (early 1940's) covered up a small resort village, which in conjunction with associated bridges, pilings, etc. make the lake popular with recreational SCUBA divers.  For those of you wisely used to staying above water, there are guided boat tours of the lake and of Devil's Gap.\nI digress, back to the trail.  It is a popular biking and hiking trail so watch out for each other.  The trail is relatively flat, there is a 70m elevation gain starting about 1.5km out that after 3.2km drops back down to the starting elevation.  There are some minor ups and downs as this continues for a total of 17km until you get to the ranger cabin.  We turned back a few kilometers before that unfortunately to make a date with some BareNaked Ladies (playing in Calgary that night).  You can continue past the ranger cabin and even make it out to the Forestry Trunk Road (#40) eventually should you have a shuttle plan in place.  It will be in the neighbourhood of 50km from the parking lot to #40.\nWhat does cause some 'issues' is that the trail skirts along the side of the mountains you're riding across, so some people may not be entirely at ease riding along when slipping a couple meters off the side will result in the dreaded 'body meeting small rock boulder' syndrome.  Also, this is prime bear country and in fact on this September day the trails up to Alymer Lookout and area were closed with big pictures of Yogi himself attached.\nAlthough we were riding, this trail seems to be very popular with hikers of all skill levels.  Past about 7km out though we didn't see any hikers, just MTBs.\nGPS data now (May 08) goes right to the warden cabin.\nThis trail is right beside:",
    "directions": "To get there, go West young man (and woman) from Calgary, into Banff National Park (don't forget the park pass) and look for the Lake Minnewanka / Banff townsite exit.  Go North on that road (South goes into Banff) and follow the signs to Lake Minnewanka parking lot.  The trailhead is well marked, right beside the lake on the North side.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/3307/long_MiniProfile-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3307/reg_DSC06349JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3307/reg_DSC06353JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3307/reg_DSC06355JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3307/reg_DSC06363JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3307/reg_DSC06364JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3307/reg_DSC06380JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3307/reg_DSC06384JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3307/reg_DSC06390JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3307/reg_DSC06395JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3307/reg_IMG-4623-Medium--6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3307/reg_IMG-4625-Medium--6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3307/reg_LAKE-VIEW-FROM-TRAIL.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3307/reg_STEWART-CANYON-VIEW-FROM-BRIDGE-25122.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3307/reg_planJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3307/narrow_IMG-4627-Medium--6828.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/lake-minnewanka-north-shore-near-banff-ab-3307",
    "stats": {
        "Activities": "mtn-bike ski-xc hike river-canoe snowshoe",
        "From": "",
        "Seasons": "summer fall winter",
        "Stars": 4,
        "Time": "5 hrs",
        "Total Distance": "0 km",
        "Town": "Banff, AB",
        "Type": "out-and-back"
    },
    "title": "Lake Minnewanka (North Shore)",
    "trail_id": "3307"
}