{
    "description": "Similar to the Singing Pass trail on this site (trail # 503), but following an initial different route, plus going all the way to Russet Lake and with more complete GPS data.\nThis route starts from the Peak, the summit at Whistler, at the top of the Peak chair (el 2160 m), rather than at the Gondola (1850 m). It also goes from top to bottom, ie, take the Gondola and Peak chair to the summit, head east across the Musical Bumps all the way to Russet Lake (with several ups and downs, for total ascent of 570 m), and then down the Singing Pass trail back to the village.\nIt also goes via the Saddle and the Burnt Stew trail, an easier and slightly shorter trail than via Harmony and Symphony Lakes (which is not that picturesque anyways). If you're going to go all the way to Russet Lake, use this route to save your energy, you'll need it.\nThe views are greatest in the area of Flute Summit, with Cheakamus Glacier, Black Tusk, and even Cheakamus Lake down below (see photos). Best time is early to mid August, for the mountain meadow flowers.\nRusset Lake is clearly worth seeing, for itself, for the views around it and for the outhouse with possibly the greatest view in the world. You can camp at Russet, either tenting or in the hut (I was there on 9/11; eirie feeling, that the rest of the world was on red alert, and all we could hear was the babble of the brook flowing from the lake, with no radio, cell phones, etc...) (see photo).\nThe walk down the Singing Pass trail is not particularly spectacular, other than the meadows at first, the views of Seventh Heaven, and, closer to the bottom, the route of the new Gondola which will link the summits of Blackcomb and Whistler mountains by the fall of 2007 (see photo).\nFollow the GPS data for the route along Burnt Stew, over the Bumps, to Russet Lake and then down the Singing Pass trail.",
    "directions": "At Whistler Village, take the Whistler Gondola to the summit, or if you elect to walk up, follow the signs for Singing Pass (or ask for directions). They are nearby.",
    "geohash": "c2b",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/3311/reg_1-AB-32132.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3311/reg_BurntStew5388jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3311/reg_FluteCache5399jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3311/reg_FluteCache5401jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3311/reg_HPIM6677JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3311/reg_IMG-1309-adjusted--22121.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3311/reg_POP-32132.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3311/reg_RONATAB-32132.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3311/narrow_FluteCache5393jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3311/narrow_MusicalBumps5405jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3311/narrow_MusicalBumps5407jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3311/narrow_RussetLake5403jpg.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/musical-bumps-russet-lake-singing-pass-near-whistler-bc-3311",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 5,
        "Time": "7 hrs",
        "Total Distance": "25 km",
        "Town": "Whistler, BC",
        "Type": "out-and-back"
    },
    "title": "Musical Bumps, Russet Lake, Singing Pass",
    "trail_id": "3311"
}