{
    "description": "There are really 3 trails: Skyline, Hoodoo,& Lake Trail. All are fairly easy trails untill you pass the first campsite, then the trail becomes a game trail, not so easy to follow, but fairly flat. The Skyline and Hoodoo trails bring you up close to the sandstone cliffs which make for great pictures and views of the valley,while the Lake trail keeps you in the thick flora of the valley floor. TIP: Bring your Gators for the meadows before noon",
    "directions": "From Highway 16, turn north (right if travelling from Edmonton) onto Switzer Drive (this is the first exit into Hinton when travelling from Edmonton or the eastern most exit when travelling from Jasper). Continue down Switzer Drive until reaching a T-intersection (approximately 1 kilometre). Turn right. Follow this road for approximately 500 metres and take the first left (onto a large well-maintained gravel road). This road travels down and crosses the Athabasca River. Just before crossing the Athabasca River Bridge you will be on an active logging/hauling road. Drive with extreme caution (please review the following link for driving guidelines \"Safety First\"). After crossing the Athabasca River Bridge you will be on the Willow Road (also called the \"W\" road). Follow the \"W\" road for approximately 4 kilometres (kilometre signs are posted on the side of the road), until an intersection on the right side of the road is reached at the \"W9\" km sign. This is the Emerson Creek Road (also known as the \"A\" road). Turn right here and travel for approximately 51 kilometres (just past the \"A\" 59 kilometre road sign) and then look for signs indicating the Wild Sculpture Trailhead, which is on the right side of the road.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/3316/reg_-DSC1324copy-13223.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3316/reg_-DSC6859copy-13223.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3316/reg_S2010013JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3316/reg_S2010014JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3316/reg_S2010031JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3316/reg_S2010032JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3316/narrow_S2010023JPG.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/sundance-creek-trail-near-edson-ab-3316",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "10 km",
        "Town": "Edson, AB",
        "Type": "out-and-back"
    },
    "title": "Sundance Creek Trail",
    "trail_id": "3316"
}