{
    "description": "This linear hike will take you up the old CPR trail to the defunk Mt. Cokely ski hill.  Views from the top of Mt. Cokely are awesome.  Great 360 views of the Coast Mountains across the Johnson straight, the mountains Strathcona Provincial park and of Mt. Arrowsmith, a stone?s throw away.  This is a long fairly long hike, taking somewhere in the 8 hour range.  We did the hike on snow shoes, so it may be quicker on dry ground.  Total distance is roughly 20 kms and is well marked, a little harder in the snow but do able.The trail starts off walking down the old road and when you get to a sign post with a map, head the route heads upwards.  The route begins its uphill grind, it may not be as steep as some other trails but it is a continuous uphill climb none the less.  In about 30 minutes you will get to a nice bridge, you can stop for a second and enjoy the nice cascading waterfall.  In 30 minutes you will come to a sign for McKey Creek Falls, head left here.  After 30 minutes, you will see a sign for a lookout east and west loop, head east.  After 20 minutes you will come to a sign for the lookout, head right.  In a little while you will the terrain will be less steep and more of a gently uphill battle.  Keep going until you get to the road.  At this point head left and take the road all the way to the base of the ski hill.  Once at the base just slowly make your way up Mt. Cokely to on the right side.  Once on the top head towards the radio repeater and enjoy the views!  To get back down again just follow your footsteps.",
    "directions": "From Parksville, drive toward Port Alberni and stop at Cameron lake (N49 17.271 W124 35.134) and park, careful crossing highway to head to the trail head.  Walk up the dirt road for about 1km, at which point you'll find the trail sign and map.  If you have a 4x4 or don't mind doing off road driving in your car then you can drive the 1 km, there is parking for about 6 cars depending on how people park and more just a bit further back on the drive in (you will see it on your right).",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/3318/reg_IMG-4438-4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3318/reg_IMG-4446-4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3318/reg_IMG-4451-Large--4612_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3318/reg_IMG-4452-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3318/reg_IMG-4464-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3318/reg_lookingatsummitjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3318/reg_ridgeviewjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3318/reg_summitviewinwinterjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3318/reg_summitviewjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3318/narrow_IMG-4433-4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3318/narrow_mountCokelyfromcameronlakejpg.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mount-cokely-from-cameron-lake-cpr-near-port-alberni-bc-3318",
    "stats": {
        "Activities": "snowshoe hike",
        "From": "",
        "Seasons": "spring summer",
        "Stars": 3,
        "Time": "8 hrs",
        "Total Distance": "22 km",
        "Town": "Port Alberni, BC",
        "Type": "out-and-back"
    },
    "title": "Mount Cokely from Cameron lake (CPR)",
    "trail_id": "3318"
}