{
    "description": "Great Things about the Trail:\n-it is beautiful\n-fabulous tide pools\n-sea lions and killer whales\n-crab and salmon platters at NitNat crossing\n-Monique at Chéz Monique\n-composting potties at most camp sites\nNot So Great Things:\n-it is hard\n-it is muddy\n-it is built for long legged 6 footers...ingenuity needed for us hobbits\n-hard to find some beach accesses, especially as there are no km markers on beach\n-you need to keep food away from bears\n-not enough composting potties en route...tough on the ladies\n-takes two days just to get to the trail head\nAdvice\n-get the best gear you can\n-take at least 6 days so you can stop and admire the place\n-take at least one hiking pole\n-take a folding bucket; it is much easier to filter your water out of the bucket than a running stream\n-take a bottle of ibuprofen\n-keep a set of tent jammies in a ziplock, including cuddly socks so you can be clean and dry at night\n-buy high test cola whenever you can, drink one and take another one for snack time; they really help when you bonk\n-take enough cash to have the crab and salmon plates at NitNat...the crab is the best I have EVER had, and the salmon came with a much appreciated baked potato and butter!\n-take more cash to have fish burgers or fish plates at Chez Monique...and Toblerones...\n-eat a protein bar at bedtime\nIn early 2007, as part of my \"Get My Fat Ass off the Couch\" campaign, I horrified my bear-phobic husband by proposing we hike the West Coast Trail as my 50th birthday celebration. He paled, but when my second choice was an expedition to watch the NWT caribou migrate, he wisely chose Vancouver Island black bears over Frozen North grizzlies and polars. So we began to train.\nHaving begun the year entirely out of shape, and very overweight, I knew that even completing the requisite training was a bit of a gamble. So from January to June, I attended increasingly demanding circuit training classes, and from June to September, trained hard on my own, hiking around our little town (and up and down the local beach stairs, which are brutal) with my pack (Tatonka) on my back and increasing the weight by 5 lb. a week until I could manage 40 lb. I was actually so uncertain my ageing carcass could manage this that we put off buying most of our gear (tent, stove, filter unit etc.) until very late August. To begin with, we only bought the packs and boots.\nSo I arrived at the trail head not at all confident I could complete the WCT. My plan was to assess my physical condition nightly, with the option of bailing at the NitNat crossing if necessary (the guys there will take you home with them at day's end and you can arrange to get out from the head of NitNat Lake). I also decided that as this was my birthday, and a big one at that, we would hike sensibly from North to South, making a two night stay at Sooke Harbour House a fitting reward for completing the trail.\nAnd yes, we hiked north to south, reasoning that the relatively easy northern sections would allow us to warm up gradually, and then face the tougher southern sections with lighter packs. This was a Good Idea.\nIt took most of a day to get to Port Renfrew. We stayed overnight at the West Coast Trail Hotel, which has the nicest pillows imaginable, and ate at the Port Renfrew Pub, which has the nicest beer imaginable. We left our car at the hotel, and caught the West Coast Express bus at 8:30 am, arriving at the Bamfield/Pachena trail head at 12:30 pm. We did the 1:30 orientation, and although we had planned to stay in Bamfield overnight, decided as it was sunny to hit the trail right away. By the time we reached the Pachena Point Lighthouse, a thick, wet fog had rolled in. We made Michigan  camp site by dusk and stopped there for the night. We even found enough wood (south of the creek) to have a nice fire. I was damned tired.\nThe next day we hiked to Tsusiat Falls. Tsusiat Point had been recommended, but it has no potty, and it is hard to pee on the trail. The rainforest is largely impenetrable, so good luck following Parks Canada's request to  walk off the trail, well into the forest, to tend to business. And Tsusiat Falls has a lovely, fairly warm pool beneath it in which to bathe and wash things. It was great to be clean and the beach there is quite beautiful. Hike to the north point for sunset.\nDay Three was a big one. Cheewhat had been closed in May due to a bear that was hanging around while the local guys did their annual salmon smoking, so we had to hike straight through to Cribs. A 17 km day is bad enough, but the sections bracketing NitNat are really nasty. And this is where I learned that the ladders, which I had feared most, were infinitely preferable to the massive roots and mud sections (MRM's).  There is really nowhere on the trail you can admire the scenery as you hike, but on the MRM's, you **must** carefully watch the ground and calculate every single foot placement. We stopped for lunch at the NitNat crossing, sublime food and good chats with other hikers, then pushed on to Cribs for the night. My husband fell into the swamp above NitNat (pack momentum...), and was lucky not to go right under. He managed to hook his leg over a log at the last moment and had a beaut of a bruise to show for it. Cribs is interesting, and has a lovely sand beach, but I found the scenery grim and forbidding. The surf really pounds there all night, too.\nWe needed a rest day, and had packed enough food to take two if we needed them, so we decided to hike to Carmanah and spend two nights there, maybe going up the creek to the Giant as well. Of course we stopped at Chez Monique and I only wish I could have asked Monique more questions. She is fascinating, opinionated and delightful. Her food was divine! Arriving at Carmanah, we noted with dismay that thousands of seagulls blanketed the beach and creek. The  stench! And the feathers and the noise...sigh, we carried on to Bonilla Point.\nStay at Bonilla. I was piqued it did not have a potty, so the little sea cave north of the camp site is icky...but it was the nicest  campsite we stayed at. Absolutely beautiful, lovely sand beach, points to explore at low tide, and a perfect waterfall and pool (icy) to bathe in. We meant to stay here two nights, but got all perky and set off the next day for Walbran...which was also infested with seagulls, so we used the fabulous potty there and hiked on to Logan. \nI loved Logan. We met three wonderful American hikers on the bridge there and they took our photos for us. Alas, these very amusing gentlemen, who insisted their packs were filled with crumpled up New York Times, hiked onward after wishing me a very happy birthday, but we set up at Logan and I had a wonderful time combing the 9' high piles of logs for fishing floats, leaving a pile on the beach for someone to string up. I even found an entire logging bridge washed down the creek! With so much wood around, we had a glorious fire....good thing because the monsoon arrived in the night. We hiked in pouring rain the next day. We should have re-waterproofed our boots at Logan, but did not carry the wax. Next time, we will!\nThe sections bracketing Camper are, IMHO, the toughest on the trail. Just beastly tough slogging and some nasty inclines that barely qualify as a trail. You need your poles here. As we arrived at Camper, we met some groups of really under-prepared hikers headed north. One group was having trouble with the cable car. ..odd as the water was so low we hiked across the river (all the cable car crossings were dry enough to do on foot this fall). We met another pair just above Camper...exhausted. They had arrived at Owen Point a bit late for the tide, but decided to do it anyway. The shelf was awash, and one of them slipped and fell off into the surf. Dangerous stuff. She managed to get back on, but was now soaked in icy seawater, including all her gear. And it was raining. They were exhausted and teary, so we patted them on the back and said Camper was only around the corner, and that they should immediately brew some hot tea, have a snack, and start a big bonfire to dry out. As they left, one turned to me and said miserably \"my pack is so heavy\". I told her it would get lighter and the terrain easier, but noticed as she turned away that her pack was fitted badly, hanging way too low at all points. I had spent quite a bit of care adjusting mine on the second day to make it ride tight and high, which keeps it balanced and comfortable. I hope someone helped her with that.\nWe hiked on to Beach Access B. Hilariously, we rejected Access A as nasty...only to find it is a paradise compared to B. We stopped there in order to time our hike around Owen Point (the tides were barely low enough and we would have to get there and get around quickly...B is a good place to do that). Someone had told us B was a great camping spot. Uhhhh...NOT! It is a muddy, dark little hole in the salal. No wood, no place to have a fire, no potty. Gross. But it was nearly dark, so we pitched our tent and tarp, and slung the food up a tree down the trail. Just as darkness fell, I happened to be gazing through the small break in the salal at the beach shelf, and to my astonishment, a pair of hikers walked by, headed toward Owen Point. The shelf at BA B is horribly slippery, and slopes sharply down to crashing surf. I shouted to my husband that there were hikers passing on the beach. He thought I was joking, but I insisted he come out as I was terrified these people were going to attempt Owen Point in the dark and at a high tide. He sprinted down to the beach shelf and convinced them to come up and camp at BA B for the night. They were headed to 150 Yard Creek as someone had told them it had good camping.   Well, maybe, but all we saw the next day was that there are one or two spaces where the trail and creek cross, which would have meant their bushwhacking about 1/4 of a km up the creekbed from the beach. Not easy at any time, let alone in the dark and rain. When they came in off the beach, they decided they didn't want to stay as BA B is damp and they did not have a waterproof tent bottom. They headed off down the trail to BA A but came right back. It was now full dark and they could not hike the trail, lacking flashlights or headlamps. No poles either, and they had forgotten to waterproof their boots before starting the trail. They were sadly under-geared, cold and wet. I felt so bad for them, but it was time to get into bed and rest up for the next day. We carefully stripped off our extremely muddy and wet gear at the tent door, stowing it under our capacious vestibules (Mutha Hubba tent), gleefully donning our nice dry polypropylene long johns and big thick socks. We slid into our DownHugger bags, blessed our decision to pack Exped Downmat 7's, and had the best sleep of the trip, deliciously dry and warm.\nNext morning, it was foggy, raining  and darned chilly. We ate a big hot breakfast and decided with regret that doing Owen Point in those conditions was an invitation to disaster. So much as we loathed the prospect of more mud and roots, and in spite of a group telling us the forest route was a nightmare of difficulty, we set off for Thrasher via the forest. And yes, it was tough. I think one of the toughest parts of the trial is the northern approach to Thrasher. Huge roots, huge mud. Your poles are such good friends here.\nUpon reaching Thrasher, we decided not to stop for the night. We were in good shape and given the bad weather, we were ready to hike out. We pushed on, a bit apprehensive that this section's wicked reputation would finally bring us to our knees. But it was easy! (note: I think it would be harder to hike this particular section south to north) We made record time through here, in spite of a couple of tough inclines, and arrived in sunshine at the ferry, delighted to find Gerhardt and his cousins (whom we had started with and bumped into nearly every day)at the crossing. We all high-fived, took photos and generally did a victory dance. I was never so proud of myself as when I saw that trail head sign. What an accomplishment! We celebrated at the Coastal Café over halibut and sweet potato fries...after a long, hot, soapy shower!\nHiking the West Coast Trail was the hardest physical challenge I have ever faced. It doesn't require skill, but it does require good gear and a *whole* lot of stamina. You have to prepare well. You have to self monitor as you hike, being sure to snack and hydrate well when you feel you are starting to bonk...you learn to do this BEFORE you bonk!!! And you have to get along well with your hiking mate(s). My husband is a treasure; we had a gas! Hiking in September was great as the trail is fairly empty, but still has enough hikers around for company at night. I hope you all decide to go on this hike...it has left me with some wonderful memories, great photos, and a huge sense of pride. Have fun and email me your trip reports!",
    "directions": "You have two options for starting, from the north end of the trail (Bamfield) or the south end (Port Renfrew). There is a bus, the West Coast Trail Express that runs between Victoria, BC and these two points, on a fascinating route along the back country logging roads. Best option is to park your car at the end you will be FINISHING at, take the Express to the other trail head and hike back to your car. Or you can park it in Victoria and time your finish to enable you to take the bus back to Victoria that day. It would be a shame to miss out seeing Bamfield and Port Renfrew, though.",
    "geohash": "c0x",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/3319/long_DSCN0271-53736.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3319/long_IMG-1861-42913.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3319/reg_1TsusitacampJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3319/reg_1atloganJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3319/reg_1daswampJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3319/reg_1enrouteJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3319/reg_1michiganmealJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3319/reg_521885-10150957555487993-2001102140-n-23980.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3319/narrow_181139-10151022729028535-629632238-n-23980.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3319/narrow_380646-10151022294158535-1819028163-n-23980.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/west-coast-trail-near-bamfield-bc-3319",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 4,
        "Time": "35 hrs",
        "Total Distance": "75 km",
        "Town": "Bamfield, BC",
        "Type": "out-and-back"
    },
    "title": "West Coast Trail",
    "trail_id": "3319"
}