{
    "description": "This trail follows the falls to the east of Luskville falls to the very top of the escarpment where large open areas provide excellent views of the Ottawa Valley.  Once at the top you can chose to travel west (with a little bushwacking)and hook up with the Luskville Falls trail. The GPS data follows this route and then follows the Luskville falls trail down into the parking lot.",
    "directions": "Instead of driving into the Luskville Falls parking lot, drive to the end of the road and follow the trail up the \"Other Luskville Falls\"  Follow the path to the west side of the falls and follow it to the top.  It is best to go in the spring so that the creeks are flowing at their peak.\r\nLuskville is found half way between Quyon and Alymer on highway 148.  Look for the old town hall on the north side of the highway.  Take the dirt road and drive towards the escarpment.  \r\n\r\n(Original directions) Cross the river from Ottawa at Champlain bridge, or, from Hull, get on hwy #148 going East towards Luskville and Quyon, passing through the village of Aylmer. Before you get to the hamlet (village) of Lusk along 148 (closer to 15km from Aylmer), maybe a few hundred meters before the turnoff to Lusk, you'll see a sign on the right hand side of the road, a brown NCC sign indicating \"Gatineau Park\" access. It's a simple Cul de Sac laneway that also leads to the \"Ranche Chutes\". All told about a half hour drive once you are on the Quebec side. \r\n\r\nAbout 500m down that gravel NCC road, just before you reach 'le ranch', you'll see a gated laneway leading to the parking area for the hike. \r\n\r\n\r\n\r\nSome go to the end of the Cul De Sac and take the path less travelled, straight past the cul de Sac where you will see another waterfalls and some rock scrambling to be had.)\r",
    "geohash": "f21g",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/QC/3326/reg_april009JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/3326/reg_april012JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/3326/reg_april014JPG.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/the-other-luskville-falls-near-hull-pq-3326",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "4 km",
        "Town": "Hull, PQ",
        "Type": "out-and-back"
    },
    "title": "The Other Luskville Falls",
    "trail_id": "3326"
}