{
    "description": "This is a fairly short trail  (if you start frmo the upper parking lot off the parkway) which extends along some of the cliffs of the Eardley Escarpment.  It travels through a variety of habitats including mature Maple woods and a Hemlock grove.However, the trail as mapped (GPS) is for those looking for an extended hike with some lung busting cardio -- start at the bottom of the escarpment along Chemin de La Montagne.  You park at a crossroads where you see an old driveway that has become overgrown, going up a moderate slope, however that quickly turns intogoegeous singletrack trail -- it will take you up to Black Mountain, ahem, which is also called King Mountain (you'll come across a monument to survey Canada and some great lookouts over Ottawa, possibly the best the Gatineaus have to offer).  On this hike, from Chemin de la Montagne, it goes in stages: the cardio up to a plateau, a small hidden pond with a beaver dam to cross over, another cardio section to the road/parkway, then you walk up along the parkway to the start of the upper loop that gives you the views.  You enter the King Mtn rest stop and picnic area with washrooms, and, do another cardio section to get up to the escarpment, and cliffs.  When you gain the top ridge, you get great views at several points, and complete a circle descending and returning to the parking/picnic area.  You now get back on the parkway, and, heading back the way you came, enter the forest again at the point you popped out on the road.  Now you reverse your trek up, having a nice walk down with a lot less sweat, finally returning to Chemin de la Montagne. Now, there is another option, for returning to your car.  It is to descend from the suvey monument just right of the rock outcrop, and, scramble your way down until you connect with an old hiking trail that since has been dicontinued.  I've done this in reverse, climbing then scrambling to emerge at the survey monument, and it's a real steep scramble -- however, as the years pass, very overgrown.  Also have seen a bear in this area.  If you want to explore this alternate \"scramble\" route off King Mtn -- have a look at the entry here. Not for the feint of heart or directionally challenged.",
    "directions": "Travel east from Gatineau along Aylmer Road.  Turn Right on Promenade de la Gatineau.  Follow this road for 10.4 kilometres.  Follow the signs to Champlain Lookout.  The trail is on the lefthand side of the road.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/QC/3332/reg_June06011JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/3332/reg_June06014JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/3332/reg_KNG-0003-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/3332/reg_KNG-0004-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/3332/reg_KNG-0005-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/3332/reg_KNG-0006-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/3332/reg_KNG-0008-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/3332/reg_KNG-0009-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/3332/reg_KNG-0010-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/3332/reg_KNG-0013-5_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/3332/reg_KNG-0014-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/3332/narrow_DSC04411JPG.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/black-king-mountain-gatineau-park-near-gatineau-pq-3332",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "winter fall summer",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "2 km",
        "Town": "Gatineau, PQ",
        "Type": "out-and-back"
    },
    "title": "Black / King Mountain - Gatineau Park",
    "trail_id": "3332"
}