{
    "description": "Looking for a challenging, technical ride?  This is definitely the place?.\r\rHilton Falls Conservation area offers some very tough trails and a few easier ones - something for both the intermediate and advanced riders.  Scattered among sections of the Bruce Trail and various side trails you'll find plenty of biking only trails that can keep ya busy for hours.  Oh, and if you ride during the spring or summer bring some bug spray or you'll be eaten alive by mosquitos.\r\rThe Bent Rim trail is without a doubt the most challenging ride.  Rated as double-diamond, it's rocks, rocks and more rocks with some trees, bridges and hills thrown in for good measure.  No big drops or steep downhills though - just lotsa rocks.  This trail is reasonably well marked with signs but I sometimes veered off only because it was leaf covered and difficult to see.  If you're not prepared to ride rocks, don't bother - you'll be doing more walking than riding.  Be sure to bring some tools and a flat repair kit though, cuz it's a long, rocky walk out.  This trail is an absolute must-ride if you like it rough.\r\rOther more intermediate trails are Bog'd Up, CM Rocks, Wally and the Beav and 5 Bridges.  Of these, CM Rocks is probably the most technical with the others being easier rides though still challenging with roots, logs and some rocks.  No worries about hikers and horses though - these trails are all designated as bikes-only.  Make sure you grab a map at the trail centre first though.  Unlike the Bent Rim, these trails are not very well marked and can be confusing.  Come before dusk so you don't get stuck in the dark.  I typically ride these trails as a wind-down after tackling the Bent Rim.  Ride 'em all and you're busy for a solid 3 hours.\r\rAdmission: $7.00 (car & bike)\rVery close to both Kelso and Mountsberg Conservation areas and Glen Eden ski hills in Milton\r",
    "directions": "From Burlington: Take Appleby Line north as far as it goes to Campbellville Road.  Turn left on Campbellville and the park entrance is immediately on your right.\r\rFrom the 401:  \r(Coming from the west) Take the Guelph Line exit and head north to Campbellville Road.  Turn right on Campbellville Road and follow to park entrance on left.  \r(Coming from the east) Take the hwy #25 exit and head north on #25 to Campbellville Road (also called #5 sideroad).  Turn left on Campbellville Road and follow to park entrance on right.",
    "geohash": "dpxp",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/ON/3352/reg_HF1-11658.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3352/reg_HF10-11658.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3352/reg_HF11-11658.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3352/reg_HF12-11658.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3352/reg_HF13-11658.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3352/reg_HF14-11658.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3352/reg_HF2-11658.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3352/reg_HF3-11658.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3352/reg_HF4-11658.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3352/reg_HF5-11658.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3352/reg_HF6-11658.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3352/reg_HF7-11658.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3352/reg_HF8-11658.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/3352/reg_HF9-11658.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/hilton-falls-near-hamilton-on-3352",
    "stats": {
        "Activities": "mtn-bike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 5,
        "Time": "3 hrs",
        "Total Distance": "0 km",
        "Town": "Hamilton, ON",
        "Type": "out-and-back"
    },
    "title": "Hilton Falls",
    "trail_id": "3352"
}