{
    "description": "I suggest you have good balance good brakes, full suspension, and 'nads.  There isn't a lot of room for error here folks, or you'll be pushing up rhubarb.  Riding across a 45 degree slope means falling off the wrong side means a 3-4 meter fall.  Steep downs pointing right into a sharp uphill section.  At the top of one climb, a tight left.  Of course, those younger than 45 do heal faster....  Seriously though, this is a fairly tough trail considering you can get off Calgary Transit a block from it.  It follows the banks of the Bow, up and down and up and down for about 5km.  From there you can find other trails along the river or head on back up.  There are a few 'stuntz', keep your eye open that you don't wander over them.\r\n\r\nYouTube knows about it, why don't you?\r\n\r\n250m of elevation gain in under 10km (really, closer to 4km since there is equal down and some flat) will get your blood pumping, it averages out to a 6% grade.  The 250m of elevation loss gives the requisite adrenaline rush, helping to compensate for coughing up a lung.\r\n\r\nTry it during a light October rainstorm like I did on my first ride there ever.  The clay & rocks and wooden boardwalk get especially greasy.  The boardwalk was kinda fun, several up and down steps, but all spaced suitably for riding both directions. In the rain, the trail was a little like the crazy mine-cart roller coaster cliché.\r\n\r\nIf someone finds the little yellow push-button knob from my VistaLight, let me know, I miss it.\r\n\r\nCurrent conditions:",
    "directions": "34 Ave / 50 Street NW Calgary  (1 block West of the middle of Market Mall).  1/2 block North and you will see a park (Bowmont Park Natural Area) opening up to the river bank, there is a way around the fence at the North End.  This is the top, South-East end of the trail.  It goes NW from here (and down).",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/3355/long_SSBobProfile-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3355/reg_SSBobPlan-6828.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/side-show-bob-near-calgary-ab-3355",
    "stats": {
        "Activities": "mtn-bike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "10 km",
        "Town": "Calgary, AB",
        "Type": "out-and-back"
    },
    "title": "Side Show Bob",
    "trail_id": "3355"
}