{
    "description": "Hiking up to two stunning passes with views of the continental divide, abundant lakes, flowing glaciers and a roaring fire to ease the feet at night...what more can one ask for in the Rockies?\r\nAfter leaving the Bourgeau parking lot, the first 7km of this trail are relatively uninspired forest walking, but in saying that be prepared for the rewards to come.  I find repeating A.O. Wheeler's quote helped me through here...\"outstanding among them for scenic charm and interest may be classed the group of peaks, lakes and alpine meadows of the Egypt Lake area\"...  Soon the forest begins to open up and the larch trees begin to dominate the surrounding forest.  \r\n \r\nOnce out in the open you are granted uninterrupted views of the Monarch and the Continental Divide.  Hopefully the views will take your mind from the lengthy uphill (Roughly 700m from the Bourgeau to Healy Pass) you have now almost completed.  Continuing along the trail you ascend over tiny streams, past more larches and ever increasing vistas.\r\n \r\nHealy Pass is the highlight of this first day.  There are plenty of good size boulders in the pass to recline on and least your eyes roam.  Mt. Assiniboine,  an abundance of lakes and glacier clad peaks all vie for attention. The walk down to the Egypt Shelter lets the legs stretch after the long uphill.  The campground is always a nice summer option but the availability of the shelter in the shoulder seasons is definatly a recommended alternative.  Warm fires, a roof over your head...well as long as no one in your party snores.\r\n \r\nThe closest water is the stream you cross just before arriving at the shelter.  There just also happens to be a good sized sitting rock at the waters edge should you feel the need to relax just a little bit more.\r\n \r\nDay 2 takes you up into the Whistling Pass, this time the climb is made a bit easier by the lighter load you'll be carrying.   However, the pass does lie up roughly 300m from the shelter so be prepared for another climb.  I would recommend going here first in the day as the pass loses sun early in the early/late season.  Another stunning vista from the pass encourages more exploration...one more for the list.  Returning along the same path one of the highlights is the Scarab Falls lookout.  Defintely not to be missed while you are in this area.  There are a lot of options on this day that are really restriced by your imagination and, well, of course day light hours.\r\n \r\nDay 3 is a return to the Sunshine Gondola station via the same route you came in on.  Our total walking time for this variation was roughly 9 hours walking and a total of 3000m elevation change (bring chocolate).",
    "directions": "From Banff drive west along the Trans-Canada taking the Sunshine Village exit.  Parking is in the lots  for the ski area, make sure to display a valid park pass and \"clean\" your car of valuables before you leave.  The trail head is behind the gondola station.",
    "photos": [],
    "source_url": "https://trailpeak.com/trails/healy-pass-egypt-lake-shelter-whistling-pass-near-banff-ab-3362",
    "stats": {
        "Activities": "hike ski-bc",
        "From": "",
        "Seasons": "winter fall",
        "Stars": 4,
        "Time": "30 hrs",
        "Total Distance": "36 km",
        "Town": "Banff, AB",
        "Type": "out-and-back"
    },
    "title": "Healy Pass - Egypt Lake Shelter - Whistling Pass",
    "trail_id": "3362"
}