{
    "description": "The Stawamus Squaw is not as scenic as the Stawamus Chief, but it is an interesting hike for a hot day, as it is mostly in the forest, where there is a lot of shade. There are also a low volume of people who use the trail, as it is relatively unheard of.\r\rTo begin, hike on the same trail as you would to get to the peaks of the Chief. It is a steep section with stairs. About 2 km up, there is a fork in the road where a sign says that going right will take you to the 3rd Peak & Squaw. Turn right. That will take you to a low maintained trail. The trail meanders through thick tree cover that blocked much of the light from above. An old overgrown road will slowly emerge. \r\rThe best viewpoint is 5 minutes off of the trail, and is marked with florescent tape. It gives you an amazing view of Valleycliffe (a residential neighbourhood), the downtown area and the 3rd peak of the Chief. Follow the tape back to the road and continue. A logging road comes up, with a sign that will direct you to the left. Continue until the second sign directs you to the left again, where the end is approximately 30 minutes away.\r\rThe end of the Squaw produces a view that is...nothing special. The surrounding trees get in the way. There is a pile of debris from an old tower (fire, military, if anybody finds out its purpose I'd be interested to know) that was there in the 70s. The foundation is still intact. \r\rThe return trip is the same. I would not recommend trying to save time by continuing on the logging road, as you have to cross about 2 dozen streams, even in the fall when you think that they would be all gone. The MacMillan/Bloedel logging road that was open just a few years ago now has a gate, so it is unaccessible for a second car. It basically took us the same amount of time on the way back via the logging road as it did for the way there via the trail.\r\rWord of advice: Bring good water resistant hiking boots, as it can get pretty swampy on the trail, even in the fall. This isn't the Chief hike, and it is overgrown in some parts, so gaiters, pants, or high socks are recommended.",
    "directions": "To get to the Stawamus Squaw, use the same parking lot that you would to hike the Stawamus Chief. Head south from Squamish for a short distance until you see the parking lot on your left.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/3365/long_Squaw.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3365/reg_1008070941-12398.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3365/reg_1008070942-12398.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3365/reg_1008070947-12398.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3365/reg_1008071036-12398.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/the-stawamus-squaw-near-squamish-bc-3365",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 4,
        "Time": "5 hrs",
        "Total Distance": "15 km",
        "Town": "Squamish, BC",
        "Type": "out-and-back"
    },
    "title": "The Stawamus Squaw",
    "trail_id": "3365"
}