{
    "description": "Kanata Lakes has a bit of everything. It has some technical XC riding and some more advanced North Shore style ladders and drops.  It is very very good, and much of it will be preserved, so make sure you visit!\r\n\r\nIt differs from the Gatineaus in that it is largely 'flat', but has lots of ups and downs on exposed Canadian Shield rock which makes for ideal wheelie drops and practice areas.  If you are used to shuttling, some of these trails will remind you of what real riding involves.  It could turn you into a weeping mess, it's tough, technical, and really fun if you go for the Westerly area now known as South March Highlands ( see map in listing for parking area at K2/Klondike or Huntmar). \r\n\r\nThere are three well known parking areas overall.  Two of these allows for convenient access to the South March Highlands and these parking areas are show in our Outback listing.\r\nThe third and possibly the most popular area is off Goulbourn forced road. You simlpy head west across the road out of the parking lot. You can't go wrong, follow the main trail which has some fu ridgeline but then runs out of room at the hydro lines and train tracks. You can follow this easement across the train tracks to the South March Highlands area. What many people miss who head west out of the parking lot at Goulbourn Forced road, is the wilder area \"across the train tracks\".  This area is ridge-like with lakes and known as South March Highlands.\r\n\r\nThe area near Goulborn forced road parking lot may also get developed. Some of the area further west towards Huntmar will be preserved, this is where mountain bikers and OMBA (ottawamba.org) are focusing their riding.  Take the trail called Outback  for example, is probably one of the top 10 technical XC trails in Canada.\r\n\r\nMaps are available from mtbkanata.com, and ottawamba.com, or you can view it in entirity on trailpeak here\n\r\nThe \"popular\" parking area closest to the wilder trails is along March Rd until you come to Klondike.  Which is just past the hi-tech buildings in Kanata, then turn right (SW) at Klondike (by the historic hotel and pizza joint) and drive up to 2nd line.  You'll also see that parking area in our outback map. This is near recent subdivision, but, the trails are preserved, and it is gorgeous terrain for technical mountain biking.  Especially if you ride outback, which will wander in what feels like the middle of the Canadian shield, for 2-3 hours.  Outback can be reached off Huntmar road, just under the train bridge.  It's a good access point.\r\n\r\n  OMBA has weekly nite rides leaving from K2 & Klondike, and, best to check OMBA out anyway, they are doing great work on the trails.  I attended a trail day, where we rock armored a section, and, added a ladder, then went out to BBQ.  Mountain Bike Associations have popped up all over Canada.  \r\n\r\nIf you click on the GPS download icon above, you will see waypoint 001 which identifies the parking area of Forced Road that many mountain bikers still use for tamer riding.  The North West part of the breadcrumb trail can be followed to get to some stunning Canadian shield (outback) riding and you can get that gps trail data from our outback listing.  It's twisty, and very much fun!  But you may be better off finding the parking spot at K2/Klondike (2nd line) or Huntmar for that.\r\nAs good or better than riding the Gatineaus in my opinion.  Between the DH riding at Camp Fortune and Calabogie, Ottawa area riders now have everything they need to be 'happy at home'.\r\n\r\nFrom the parking area on Forced Road, head across the street just left, then right onto the trail that winds through a bit of a clear-cut, where I saw a large buck, and pretty far north and west.  The furthest point (fingertip) on the GPS map represents some pretty hardcore exposed rock riding that is twists, climbs, and drops through rugged shield and swamp along \"ridgeline\". It also passes by a few mystery lakes.\r\n Trail names in here include \"Pete's Wicked\", \"ridgeTop\", \"Outback\", and, \"Rock Hopper\". There are many more.  Outback is a seriously large loop that is vwery technical, with climbs and descents, drops, and rock, did we mention rock.\r\nParking:\r\n\r\nTo sum up, you park at GFR (Forced road) for intro to the area and easier riding.  You get to the area known more as South March Highlands by parking either at Huntmar under the train bridge (or near) or by parking off 2nd line and Klondike (off March road, the blinking light as you head past hi-tech land and suburbia).  See our outback listing for a map which includes the Huntmar parking area. Friggin great!",
    "directions": "See description and / or GPS",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/ON/338/reg_3d8d.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/338/reg_Untitled-24-0.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/338/reg_bike.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/338/reg_drop.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/338/reg_leavespath.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/338/reg_ramp.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/338/reg_rock3tree.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/338/topo_launch.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/kanata-lakes-near-ottawa-on-338",
    "stats": {
        "Activities": "mtn-bike",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "30 km",
        "Town": "Ottawa, ON",
        "Type": "out-and-back"
    },
    "title": "Kanata Lakes",
    "trail_id": "338"
}