{
    "description": "Wow, what a day.  Still Ridin' on the last weekend of October.  w00t !!1!  \r\nTo quote Bubbles, \"Boys, this is really greasy.\"  Well, it was a little. The melting light snow left over from a couple days ago made this a little muddy with this really greasy mud on top of some ice in places, a few minor spills, no casualties.\r\nWe did one full figure 8 trail twice.  20.8km, 590m of cumulative climbing. I had to pull on the riding shorts after the first 1/2 of a loop, too warm. (+7 & sunny)\r\n(Editor's Note) Our lawyers made us add: Past Performance and weather does not guarantee similar future performance or enjoyment.  Use of the outdoors may include encounters with rocks & bears.\r\nAnyways, this is a decent trail, easy access, a few sights, but hey, who has time to look at sights when you're pedaling your lungs out.  Virtually all skinny track, some trees and some side slope traverses.  Another advantage, due to parking in the middle of a figure 8, you're never more that ~2km from your vehicle should you need to walk out.  Not hugely technical, but you have to pay attention.  Fairly rocky means FS feels nice on the keester and you never really get to let go.\r\nProbably the best, closest, easiest to access all singletrack trail in the area if you want a short ride. This is mostly a biking and walking trail (1 hr is for bike BTW), I'm not sure if there is often enough snow to snowshoe. Close to Calgary (51km from COP intersection), and as of Summer '08, pavement right to it's front door, so perfect for after work rides in the fall. It is a 10km loop with a shortcut roughly in the middle. ~260m of cumulative climbing (Easy!) virtually all if it rideable by your average rider. \r\nYou can ride this in the early winter, it freezes but doesn't get snow till well into winter. After the recreation areas are gated for the winter, you can park on the road between the short cuts and you are in the middle of a figure 8. The great thing here is you are never more than about 2.2km from your car should you need to walk out. \r\nWith the sweet, new, pavement, I can see the interest in and use of this trail going WAY up. \r\nThis trail is in the general area of:\r",
    "directions": "\r\nHead west of Calgary on Hiway 1 to the well marked Hiway 68 (Sibbald Creek Trail) exit (about 17.5km past hiway 22 overpass) and AFTER the Jumpingpound Road. It is 21km West of the Calgary Olympic Park intersection. Take the exit, go under the highway for about 12km to the Pinetop Recreation Area. If this is gated you can park on the road there or a further 2km West to get in the middle of the figure 8.\r\nTrail leaves from the bottom West side of the parking area.  Trail also crosses highway 68 twice, once 2.1km East of you and again 1.6km West of you.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/3382/long_PowerfaceLoop-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3382/long_PowerfaceLoopProfile-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3382/reg_600-237710922.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3382/reg_600-237712012.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3382/reg_600-237713852.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3382/reg_DSC-0095-1280x853--14960.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3382/reg_DSC-0098-1280x850--14960.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3382/reg_DSC-0107-1280x853--14960.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3382/reg_DSC06462-Small--6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3382/reg_DSC06468-Small--6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3382/reg_DSC06472-Small--6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3382/reg_DSC06473-Small--6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3382/reg_DSC06475-Small--6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3382/narrow_DSC-0102-849x1280--14960.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3382/narrow_DSC06467-Small--6828.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/jumpingpound-loop-near-calgary-ab-3382",
    "stats": {
        "Activities": "snowshoe hike ski-xc mtn-bike",
        "From": "",
        "Seasons": "winter fall summer",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "10 km",
        "Town": "Calgary, AB",
        "Type": "out-and-back"
    },
    "title": "Jumpingpound Loop",
    "trail_id": "3382"
}