{
    "description": "Last Easter, I discovered for myself, Maine's NHSC, or Nordic Heritage Ski center. It advertised great xc skiing in winter, and taunted me with 20 miles of single track for the snow-less seasons as well. I knew I had to make a point in coming back.\nWith a Thanksgiving long weekend, we were bound for New Brunswick once more, and since Florenceville is so close to the border, I set aside a day to revisit the center.\nIt is advertised as being associated with Presque Isle, but really is far closer to Fort Fairfield.\nThe leaves here seem to progress faster than they do where there is ocean, so it was a real visual treat to see all the colors in the leaves, even with half capreting the ground.\n20 miles of single track wasn't the sort of thing I felt like tackleing on one day alone. I Saw the map, and chose a near by trail and went from there. I was hoping to join up with some other riders who really had some routes down.\nSure enough, after about a half hour, I met with a guy named Jim Parks. With some short introductions, we were on our way together to explore more trails.\nOne notable route included the enchanted forest, with its decorated entry way and thick softwood stands. Not much time was had to take pictures, as we rode intermediate ranked trails. I was expecting technical riding to be had, but their system meant fast and smooth trails. Luckely, Jim narrated the way through with shouts of \"hard-lefts\" and \"fast rights.\" Most of the utterances were hard to hear, so I simply used the shoutings as times to be aware that something was coming up fast.\nBy their trail planning, the bulk of the trails wre designed for intermediate riding. 20 percent was beginner grade, and the remaining 10 percent for expert runs. After riding the intermediate stuff, I was wondering if my home trail of Bonshaw puts my riding experience on par with their expert trails. I'll have to find out when I return next year.\nThe trails are well marked and frequent maps show your position within the park. These trails double as snowshoe trails come winter, so that would make for a great romp when the snow flies.\nMany thanks to Jim for his tour of the trails. It was a great ride, and definately worth visiting! The autumn leaves were a bonus.\nShannon Burt\nEast coast editor",
    "directions": "From Canada, approach Perth Andover along Route 2, and look for the border crossing toward Fort Fairfield, Maine. The road where the NHSC is located, is Presque Isle Road. Around the same location of NHSC is a small ski hill on the same side of the road.",
    "geohash": "f2r9y",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/ME/3385/reg_jim-6702.jpg",
        "https://trailpeak.com/storage//content/trails/US/ME/3385/reg_silouette-copy-6702.jpg",
        "https://trailpeak.com/storage//content/trails/US/ME/3385/narrow_jim-copy-6702.jpg",
        "https://trailpeak.com/storage//content/trails/US/ME/3385/narrow_partched-6702.jpg",
        "https://trailpeak.com/storage//content/trails/US/ME/3385/narrow_uppergoat-6702.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/nhsc-nordic-heritage-ski-center-mtn-biking-near-fort-fairfield-me-3385",
    "stats": {
        "Activities": "snowshoe hike mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "5 hrs",
        "Total Distance": "25 km",
        "Town": "Fort Fairfield, ME",
        "Type": "out-and-back"
    },
    "title": "NHSC Nordic heritage Ski center mtn biking",
    "trail_id": "3385"
}