{
    "description": "Rohr Lake sits on an alpine bench north east of Mount Rohr, in the Cayoosh Range.  It's a beautiful, uncrowded hike, conveniently starting from a high point on the Duffy Lake Road, and takes you through steep trees quickly into alpine meadows below long ridge lines.\r\n\r\nAfter parking your car, hike up the road, staying left at the obvious intersections.  Shortly after crossing a large creek coming off Rohr, the trail starts to go up steeply through a series of switch backs.  At the large sign post, take the trail to the right towared Rohr.  The left trail will take you to the Marriott Basin (Wendy Thompson Cabin).\r\n\r\nThe trail climbs up through trees to an alpine meadow.  Going straight (east) will climb up steeply through a boulder field along a feintly marked/cairned trail to another rocky alpine meadow.  From here the trail wanders south through boulder strewn marmot country, past a small lake on your left, and gains Lake Rohr's north western banks.\r\n\r\nAlternatively, halfway along the lower alpine meadow on the right, a trail climbs steeply up the right side of a boulder field.  The is the recommended route, I suspect because it is more visable and so easier to follow.  It is, however, very steep, and can get quite muddy and treacherous when wet.  It is nearly always wet.\r\n\r\nThere is a camp ground at the western end of the lake, right of where the trails arrive at Rohr Lake.  There are few flat tent spots, some shaded from the morning sun, and fires are possible, though not advised.  There are a few additional tent spots on the other side of the creek.  The lake is clear as a bell, allowing you to see the beautiful rainbow trout in the shallows.\r\n\r\nThe summit of Mount Rohr is easily accessible from it's north eastern ridge.  Heading around to the eastern end of the lake, follow a small creek east through morraine and summer snow fields to gain the ridge.  Follow the ridge to gain the peak from the obvious line north of the Rohr Summit, or pick your way through cliff bands to gain the ridge south of the summit, then climb east through steeper ground and cliff bands to the summit.  The views from the summit are some of the most spectaculur you'll get in this area, the Mt Joffre, Vantage, Mattier, Cayoosh, the Place Glacier group, Marriott, ...\r\n\r\nAnother side trip gains the ridge north east of Rohr Lake.  From there (or from the trail just west below the ridge) you can wander north seemingly endlessly towards the Marriott Basin and Mount Marriott, or drop down east into Haylmore Creek with it's stunning alpine lakes at the creek's headwaters.\r\nThe bugs can be really bad, so bring nets or lots of deet.  This area does not draw the crowds, and is really worth the visit.  The camp ground is three to four hours hike from the car, the summit of Mt Rohr is a couple of additional hours from there.  You can do this as a long day trip, but it's an amazing place to spend some time exploring.\r",
    "directions": "\r\nOn Hwy 99, drive east of Pemberton, passing through the small town of Mt Curry.  Turn right, staying on Hwy 99, passing the northern shores of Lillouet Lake. Drive up the steep hill of the Duffy Lake Road, past the Joffre Lakes signs.  A little further on you will go over the summit of Cayoosh pass, and then head down to a bridge crossing Cayoosh Creek.  Very shortly afterwards you will see a dirt road on your left, heading north along the eastern banks of Cayoosh Creek.  Turn left here.  (If you miss this track, you will soon pass a BC roads work shed on the right)  You can either park at the first available spot on the dirt road, or if you have good vehicle clearence, and are not worried overly about your paint work, you can head further up the road where there are numerous places to park a few cars.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/3386/long_Rohr-stitch-4-6103.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3386/long_Rohr-stitch-5-6103.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3386/long_best1_MtRohr-3687c-6103.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3386/reg_7-steeper-11896.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3386/reg_8-route-uppper-11896.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3386/reg_MtRohr-3661-6103.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3386/reg_MtRohr-3674c-6103.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3386/reg_MtRohr-3683-6103.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3386/reg_MtRohr-3697c-6103.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3386/reg_MtRohr-3718-6103.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3386/reg_MtRohr-3737-6103.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3386/narrow_MtRohr-3682c-6103.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3386/narrow_MtRohr-3692c-6103.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3386/narrow_MtRohr-3740-6103.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/rohr-lake-and-mt-rohr-near-pemberton-bc-3386",
    "stats": {
        "Activities": "hike ski-bc",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "8 hrs",
        "Total Distance": "15 km",
        "Town": "Pemberton, BC",
        "Type": "out-and-back"
    },
    "title": "Rohr Lake and Mt Rohr",
    "trail_id": "3386"
}