{
    "description": "Dam Mountain is a spectacular snowshoe route. It would have been even more spectacular if it were not fogged in (there is one clear day picture thrown in from a previous trip to give you an idea).\nWhat's nice about this route is that it follows a groomed track which is patrolled all the way to Dam Mountain.  You can get to the Peak of Dam Mountain without too much difficulty; the last part is steep as the pictures show, but it's not that long.  Once up top you can enjoy the view, then continue and rejoin a groomed route looping back to the trail you came up.  The terrain is spectacular, and on a clear day (and one without avalanche conditions) you can venture a little further -- not so on our visit as 27cm of snow had just fallen over a layer of crusty snow.  Nevertheless, our route was safe and open -- as I mentioned, this route to Dam Mountain is patrolled.\nThe total distance is roughly 3 km return which in deep snow is a workout.  To reach the trail, exit the lodge and head north past the skating rink  and past the grizzly bear refuge (to your left) and ski runs (to your right).  When you approach the bottom of the peak chair, turn west (left) and follow the old service road (bordered by a crag to the north and a steep drop off to the south) until you will reach a large mapboard.  From here, follow the trail blazes and signs to Dam Mountain.\nThere is GPS data attached to this trail (see \"download GPS\"), which if loaded into your GPS can help you find route points. \nIt takes roughly an hour to get to the peak.  It's a great cardio workout as there is a fair bit of climbing, but quite doable for anyone on snowshoes.  As you can see, I even used my old wooden ones that I had since childhood, however, not long after, I upgraded to Atlas with crampons.",
    "directions": "See description and / or GPS",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/339/reg_2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/339/reg_mountain3.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/339/reg_other.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/339/topo_summitt.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/339/narrow_best1_kurt.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/339/narrow_topo.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/grouse-dam-mountain-near-vancouver-bc-339",
    "stats": {
        "Activities": "snowshoe",
        "From": "",
        "Seasons": "winter",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "5 km",
        "Town": "Vancouver, BC",
        "Type": "out-and-back"
    },
    "title": "Grouse - Dam Mountain",
    "trail_id": "339"
}