{
    "description": "From the parking lot it is a worthwhile detour to talk the short walk along marble canyon.  The multi-coloured rock makes this canyon unique in the area and is a good way to start off this fantastic hike.  This section of the trail takes you alongside marble canyon and will eventually reconnect with the trail continuing on to the Fay Hut.  From the upper bridges you can see the trail to your right.  \nIf traveling in the shoulder seasons be aware that the orientation of this valley restricts the hours of sunlight.  Keep in mind while visiting the area the fire of 2003. It has turned the early kms of this hike from a typical forest walk into an open viewed amble.  The fire has also changed the valley in terms of safety. If traveling on windy days mind the newly burnt trees and fragile root system.  One of the benefits of the burn is the change in the forest floor cover.  If traveling in spring/summer you'll be treated to a fantastic display of fire weed.  Although in spring the trail will prove to be exceedingly soggy underfoot with many stream crossings and fords.\nThere are no surprises along the next section of the trail.  Some washouts and detours, again, due to the fire occur but are easily followed (cairns or flagging tape).  After 10 km you reach the junction for the Fay Hut.  Continuing straight ahead will lead you towards Kaufman Lake, a trail that has not been cleared after the fire and is reported to take quite a lot longer than expected.\nFrom this junction the real climb begins, getting steeper as it goes.  The trail gains 600m in these final 2km as compared to the 200m you just climbed in the last 10km.  At 1850m you will come to a large bridge taking you across Fay Creek and to the steepest part of the climb.  Leading towards a gully below the hut you arrive at the most challenging part of the trail.  In the summer season there is a rope to assist your 50m climb up this gully but the rope will either be iced up/under the snow/removed if you travel here in the winter.\nOnce atop the gully you have less than a kilometer to go before reaching the beautifully appointed and situated Fay Hut.  Put your feet up in front of the fire and enjoy the view.",
    "directions": "From Banff take the Trans Canada west to the Castle junction (roughly 30km).  Take the exit toward Radium and another 30km down the road you'll find the parking lot for Marble Canyon / Fay Hut.  \nAn alternative route to this from Golden would be to head south on Hwy 95, following the Canadian Pacific Railway, then turning left on Hwy 93 just before Radium Hot Springs to approach the Marble Canyon trailhead from the south.\nEnsure you contact the Alpine Club of Canada for the combination to the door otherwise you'll be out of luck when you reach the hut (1.403.678.3200).",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/3391/long_pano-filtered-12404.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3391/reg_-1-of-3--12404.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3391/reg_-2-of-3--12404.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3391/reg_DSC-0752-13195.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3391/narrow_-1-of-1--12404.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3391/narrow_-3-of-3--12404.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/fay-hut-trail-near-radium-hot-springs-bc-3391",
    "stats": {
        "Activities": "snowshoe hike ski-bc",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "10 hrs",
        "Total Distance": "24 km",
        "Town": "Radium Hot Springs, BC",
        "Type": "out-and-back"
    },
    "title": "Fay Hut trail",
    "trail_id": "3391"
}