{
    "description": "Elevation gain: 3400 ft\nMt Ripinsky is the highest point above Haines, the north peak is at 3650ft. This is a spectacular but steep trail to reach the summit. The climb can take 3 to 5 hours, trail can be muddy or snowy. You will see great views of the Lynn Canal, Douglas Island, Mt Riley and small islands near Haines...\nThe trail ascends via large hemlock and spruce to a viewpoint at 1600ft. Then it makes its way into alpine meadows at 2500ft. Until late July water or snow can be found near the top. Johnson creek will provide water at 2500ft. there is also a small pond below the summit ridge, but it dries up in late summer.\nNOTE: do not try to descend the south face of Mt Ripinsky to the highway, steep cliffs bar the way. In bad weather, just follow the trail back to the forest. Visibility may be zero in snow or rain in the alpine, be careful!!\nClick for Haines, Alaska Forecast",
    "directions": "Take Second Ave north from Haines, then continue straight on Young Road, and when it forks kepp left along hillside. Pass wooden water tank on left, entering Skyline Estates. Follow power line as the road becomes rough and one lane. \ntrailhead is 1.7 miles from Main St, on left in front of a gate. You can see the tank farm and Lutak Inlet now.\nMt Ripinsky overview map is scanned from the brochure: \"Haines is for Hikers\" - A guide to the local trail system. This pamphlet is available to be picked up at the Haines Visitor Center on 2nd Ave, or contact hcvb@haines.ak.us\nFor further information on Haines and southeast Alaska, please check the Haines website and contact the Visitor Office at hcvb@haines.ak.us",
    "geohash": "bfx9",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/AK/3410/reg_best1_ripinsky-8779.jpg",
        "https://trailpeak.com/storage//content/trails/US/AK/3410/reg_rip-view-8779.jpg",
        "https://trailpeak.com/storage//content/trails/US/AK/3410/reg_ripns-map-8779.jpg",
        "https://trailpeak.com/storage//content/trails/US/AK/3410/rip-map.jpg",
        "https://trailpeak.com/storage//content/trails/US/AK/3410/ripns-map.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mt-ripinsky-near-haines-ak-3410",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 5,
        "Time": "6 hrs",
        "Total Distance": "12 km",
        "Town": "Haines, AK",
        "Type": "out-and-back"
    },
    "title": "Mt Ripinsky",
    "trail_id": "3410"
}