{
    "description": "Elevation gain: 1700 ft A very nice hike to the top of Mount Riley, 1,760 feet, high point on the Chilkat Peninsula. The peak has great views of Haines, the Lynn Canal, the inlets and all the glaciated mountains. Trail from Mud Bay Road is the shortest, direct route to the top. Trail runs SE along the ridge. At the top of the first steep climb, turn right when a trail from Lily lake intersects. Now follow a ravine, cross a small stream, then climb up through old growth trees. After this about 0.5 km of muskeg and then the small rocky outcrop is reached at the summit, surrounded by green forests. Two other routes lead to the top via Lily Lake and from Portage Cove. These are shown on the trail map and are described in the hiking pamphlet.Click for Haines, Alaska Forecast",
    "directions": "Turn south along 3rd Avenue, behind Fort Seward and follow Mud Bay Road for almost three miles. Parking and the trailhead are prominently marked. The path starts on top of a bank across from the parking area.Mt Riley trail map is scanned from the brochure: \"Haines is for Hikers\" - A guide to the local trail system. This pamphlet is available to be picked up at the Haines Visitor Center on 2nd Ave, or contact hcvb@haines.ak.usFor further information on Haines and southeast Alaska, please check the Haines website and contact the Visitor Office at hcvb@haines.ak.us",
    "geohash": "bfx8",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/AK/3411/reg_best1_riley-8779.jpg",
        "https://trailpeak.com/storage//content/trails/US/AK/3411/reg_riley-map-8779.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mt-riley-near-haines-ak-3411",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 4,
        "Time": "4 hrs",
        "Total Distance": "9 km",
        "Town": "Haines, AK",
        "Type": "out-and-back"
    },
    "title": "Mt Riley",
    "trail_id": "3411"
}