{
    "description": "Elevation gain: 5100 ft.\r\n\r\nThis is a great ridgewalk spanning the alpine ridge of Mt Ripinsky.\r\nIt is a long day hike (8 - 10 hours) or 2-to-3-day backpack. The ridge walk takes in Ripinsky, Peak 3,920, and 7 Mile Saddle, and is the only high-elevation trail trip near Haines. It?s a beauty, with glorious views of wild peaks and valleys, ocean on two sides, and the broad, gray Chilkat River as it empties into the Pacific.\r\n\r\nTrail starts steep in pines, many switchbacks, then up into spruce and hemlock. It opens up into brush at about 2000ft. There is a spring at 2400ft near 7 mile Saddle. You can camp here in the Saddle or continue to Peak 3920, a steep climb. After this the ridge drops to 2800 ft and the scrambling down is a bit steep and tricky. Continue to north peak of Ripinsky, but the trail is easy to lose in rocky snow covered areas. Map, compass and GPS are good to have for this hike.\r\n\r\n\r\n Click for Haines, Alaska Forecast",
    "directions": "\r\nDrive west of Haines to about 0.2 miles east of the 7 mile marker. There is a small parking area just on the right side of the road. The trail starts up a short boardwalk here.\r\n\r\nSkyline trail map is scanned from the brochure: \"Haines is for Hikers\" - A guide to the local trail system. This pamphlet is available to be picked up at the Haines Visitor Center on 2nd Ave, or contact hcvb@haines.ak.us\r\n\r\nFor further information on Haines and southeast Alaska, please check the Haines website and contact the Visitor Office at hcvb@haines.ak.us",
    "geohash": "bfx9",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/AK/3412/floe-8779.jpg",
        "https://trailpeak.com/storage//content/trails/US/AK/3412/reg_best1_sk1-8779.jpg",
        "https://trailpeak.com/storage//content/trails/US/AK/3412/reg_sk2-8779.jpg",
        "https://trailpeak.com/storage//content/trails/US/AK/3412/reg_skyline-map-8779.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/ripinsky-skyline-trail-near-haines-ak-3412",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 5,
        "Time": "8 hrs",
        "Total Distance": "16 km",
        "Town": "Haines, AK",
        "Type": "out-and-back"
    },
    "title": "Ripinsky Skyline trail",
    "trail_id": "3412"
}