{
    "description": "This one of those lesser known trails on Mt Seymour, great to do on snowshoes in the winter. \nApprox 1/2 way between First Lake (on the Dog Mountain trail) and Second Lake (on the trail up to the peaks) is the North Shore Search and Rescue cabin. The cabin is closed to the public, but it is at the south end of just another trail on Mt Seymour, one that isn't well known. Note that it's very difficult to get there from the First Lake / Dog Mtn trail, you have to go north up the trail towards the peaks, and then west. There are some great views of the Vancouver area from the cabin. After taking a break at the cabin, back track approx 500 m (to waypoint # 162), and go left (west) up to a view point (name?). \nYou can then back track more, back to the turn off to this trail (waypoint # 161) and either head up (north) to the peaks or west to Dog Mountain (see other trails on this website).",
    "directions": "Take the Trans Canada Highway over the 2nd Narrows bridge and get off on the Mt Seymour Parkway Exit. Then follow the signs for the Mt Seymour Provincial Park Ski Area until you finally arrive at the main parking area. Go to the very end of the parking area where you will see the Provincial Park trails marked with orange marker tape. Follow the the trails along the left side of the Ski Runs. approx 75 m past the Dinky Creek turn off on the left, go left across the small bridge, follow that trail approx 600 m to waypoint 162, then go approx 250 m to the cabin. On the way back, at waypoint 162, go west approx 400 m to the other view point.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/3420/reg_MtSeymourCabin5573-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3420/narrow_MtSeymourCabin5574-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3420/narrow_MtSeymourCabin5575-7359.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mt-seymour-sr-cabin-near-north-vancouver-bc-3420",
    "stats": {
        "Activities": "snowshoe hike",
        "From": "",
        "Seasons": "winter summer",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "5 km",
        "Town": "North Vancouver, BC",
        "Type": "out-and-back"
    },
    "title": "Mt. Seymour - S&R Cabin",
    "trail_id": "3420"
}