{
    "description": "The Lizzie Lake Cabin sits on the north bank of a stream draining Arrowhead Lake into Lizzie Lake, at the head of the Lizzie-Stein Divide, and offers a great base to ski tour this unique section of the Lillooet Ranges.\nThe Lizzie Lake area, though often an arduous winter trip in, offers access to a huge playground of skiing, with the open slopes of White Lupine Ridge above the trees behind the hut, more mellow glades on the other side of the creek, Arrowhead Mountain, Tynemouth Mountain, Long Peak, and unlimited variation in terrain for those who wish to explore the ridges, lakes, peaks and open faces further.\nThe trail in is pretty straight forward to the Lizzie Lake Provincial Camp Ground, then climbs steeply through trees above the Lake to the Gates of Shangri-La, east of Lizzie Lake.  The trail can be quite arduous if you are breaking fresh tracks through deep snow, being 15km of climbing with 1300m of steady elevation gain.  It can take more than 12 hours on the way in, and around half that on the return.\nFrom the car, follow the Road for about 300 metres to a fork.  The original trail continued straight ahead, but the road has been washed out a short way along and is impassable by vehicle or on foot.  So, take the road up the hill to the left.  At the first right hand switch-back, a small rock cairn (possibly buried) marks the start of the washout bypass trail.  This trail follows above the road back the way you just came, then skirts very steep and slippery slopes above the washout, rejoining the Lizzie Branch FSR a short way past the washout.  It takes about 30-45 minutes.\nFollow the Lizzie Branch FSR south east, staying on the north side of Lizzie Creek.  After crossing a small stream, stay right at a road intersection, and cross another stream before starting the climb up towards Lizzie Lake.  Stay left at the next intersection, then stay right at the one after that.  Once through the pass, leave the road, passing a sign as you enter the Lizzie Lake Provincial camp grounds at the north end of Lizzie Lake.  At the edge of the camp ground, you will pass a sign board with a map of the Stein Valley Nlaka'pamux Heritage Park.  Just before arriving at the lake, head slightly to the left and you should see a trail sign nailed to a tree.  This is the start of the new trail to the Lizzie Lake Cabin, and the Stein Traverse.\nThe trail is marked by orange markers and red ticker tape, but can be a little difficult to follow in winter.  It passes through four or five steep narrow creeks, climbing gradually through the trees above the north side of Lizzie Lake, until an altitude of about 1580 metres where it breaches a small gap in steep cilffed slopes.  This is called the Gates of Shangri-La.  If you're too high or too low you will encounter steep treacherous terrain.\nFrom here the going gets easier, as the valley slowly opens up with the final kilometre of trail heading gently along a meandering, boulder strewn creek.  Shortly, the cabin becomes visible 200m above the north bank of the creek, slightly hidden at the start of the trees.\nThe cabin is a rustic log hut, built in the late 60's by David Nickerson.  In 2001 it was cleaned up and repaired by a team of people including a nephew of the late D. Nickerson.  This log cabin is breezy and the residence of at least one rat, or perhaps a very large and noisy mouse.  The cabin is equipped with two coleman white-gas mantle lamps, one that has a refillable tank, the other uses those green disposable bbq cylinders.  It also has a coleman stove (not sure if it works), a large wood burning stove, and loads of saws, axes and splitters for cutting wood.  \nThere is often a supply of wood, but use it sparingly as it is an act of love by summer visitors who stock the wood pile each fall.  There is usually only enough for a hand-full of winter trips.\nThe cabin sleeps 8 comfortably.  The stove pipe is often buried in snow, and will smoke dangerously unless this is freed.  As for all cabins, please look after it, put your fires out before you leave, leave it cleaner than it was when you arrived, make sure there is a supply of wood for anyone needing to make a fire quickly, take out your garbage, and treat it with all the respect it deserves.  This cabin is visited infrequently throughout the winter.",
    "directions": "From Pemberton, follow Hwy 99 east to the small town of Mount Currie.  Turn right to follow Hwy 99 along Lillooet Lake.  Once the Hwy leaves the lake, it climbs steeply up towards Duffey Lake.  Almost immediately after leaving Lake Lillooet, you turn left onto Lillooet River Road, a well maintained and snow groomed all season dirt road.  Pass Twin One and Twin Two Creeks.  Cross one more unnamed creek, and park on the left hand side of the road, at the start of the In-Shuck-Ch / Lizzie Branch Forest Service Road, at about 15km from leaving Hwy 99.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/3457/reg_1c-table-mtn-11896.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3457/reg_Lizzie-Lake-Cabin-Map-2-6103.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3457/reg_best1_lizzie-lake-cabin-02-6103.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3457/reg_best2_lizzie-lake-cabin-04-6103.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3457/reg_lizzie-lake-cabin-01-6103.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3457/reg_lizzie-lake-cabin-03-6103.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3457/reg_lizzie-lake-cabin-05-6103.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3457/reg_lizzie-lake-cabin-06-6103.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3457/reg_lizzie-lake-cabin-07-6103.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3457/reg_lizzie-lake-cabin-08-6103.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3457/reg_lizzie-lake-cabin-09-6103.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3457/reg_lizzie-lake-cabin-10-6103.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3457/reg_state-of-trail2-11896.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3457/reg_trail-windfall2-11896.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3457/narrow_Lizzie-Lake-Map1-6103.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3457/narrow_lizzie-lake-cabin-11-6103.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/lizzie-lake-cabin-near-pemberton-bc-3457",
    "stats": {
        "Activities": "ski-bc snowshoe",
        "From": "",
        "Seasons": "winter spring",
        "Stars": 4,
        "Time": "21 hrs",
        "Total Distance": "30 km",
        "Town": "Pemberton, BC",
        "Type": "out-and-back"
    },
    "title": "Lizzie Lake Cabin",
    "trail_id": "3457"
}