{
    "description": "In the winter, Moraine Lake Road (MLR) is closed to traffic just off the road to the Chateau and trackset for both classic and skate XC skiing.  It offers a nice, safe, avalanche-free ski trail affording a few views of the Bow Valley and eventually the reason for having a Canadian $20 bill (well the old one anyway).\nIt is, for the most part, all up on the way out, and all down coming back.  Generally quite moderate slope, barely enough to coast when coming back down.  It ends at a viewpoint where you can see Moraine Lake in the distance.  A non-groomed skier-set trail continues on from this point.  \nNOTE:  This non-groomed trail is not part of this write-up and crosses one or more avalanche chutes.  Do not continue past the end of the grooming unless you are trained and equipped for the possibility of avalanches, including rescue and first-aid techniques.\nYou can access the Paradise Valley trailhead from MLR as well as one or two other trails.\nCurrent conditions:\nIn the summer you can ride or hike the road but you will be sharing the road with large busses, tourists, and who knows what else.  I'd suggest you find somewhere else to enjoy the area from.",
    "directions": "Take TransCanada Hiway to Lake Louise.  Take off-ramp into L.L.  Go South through the 4way stop, under the train tracks and up the road to the Chateau Fairmont Lake Louise.  Approximately 2km from the highway you will see a road turning to the left (SouthEast) signed Moraine Lake Road, turn down here.  In the winter, park at the road closed area which is only 100m or so.  Ski trails are the groomed road bed itself.  In the summer you can drive up to Moraine Lake and ride down or hike in the area.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/3459/long_XC-Skiing-Moraine-Lake-Rd-Lake-Louise-Donna-and-Marry-on-fire-Dec-6-2015-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3459/long_moraineprofile-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3459/reg_DSC09052-Small--6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3459/reg_DSC09058-Small--6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3459/reg_DSC09067-Small--6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3459/reg_DSC09076-Small--6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3459/narrow_XC-Skiing-Moraine-Lake-Rd-Lake-Louise-mt-Temple-background-Dec-6-2015-44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/moraine-lake-road-near-banff-ab-3459",
    "stats": {
        "Activities": "mtn-bike ski-xc hike",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 3,
        "Time": "4 hrs",
        "Total Distance": "19 km",
        "Town": "Banff, AB",
        "Type": "out-and-back"
    },
    "title": "Moraine Lake Road",
    "trail_id": "3459"
}