{
    "description": "NTS Map: 083d16Elevation Gain: 1,250 m (4,105 ft).This is a great day hike, only a few minutes from the town of Jasper and you only have to hike one way.  There is a tramway that takes visitors up the mountain to an observation deck, restaurant and gift shop within 1km of the summit.  It is possible to purchase a 1 way ticket from the upper tramway terminal so you can hike up and ride down.(cost about $10).The hike up starts off in the forest and you pass through the varied alpine ecosystems until emerging above treeline jsut below the upper terminal.  The terrain is not particularly difficult but the altitude gain of 1250m in 8km is one of the steepest in the parks.  From the terminal a 1km hike leads up to the summit of Whistlers' mountain where you will find a pointer with an arrow that can be aimed at nearby peaks, revealing their names.  From Whistlers, there are several other peaks within a couple hours' hike.The trail switchbacks and climbs until your heart wants to explode. It is steep, and more of an aerobic challenge along the lines of the famous Grouse Grind in Vancouver, but x 5 more so.But for those who look at a tram or gondola and immediately think of a way to hike up and take the tram down, this could be for you. Also in the area, and across the Icefields Parkway, is the Valley of the Five Lakes  hike, a beautiful hike/mountain bike ride which is flat in comparison. There are many other hikes in the vicinity of town, particularly those that climb in behind Jasper to Mina, Cabin, Riley, Patricia, and Pyramid Lakes.  These hikes are typically 2 or 3 km to the lakes, and Pyramid Lake road is a good access road to two parking places (at Cabin Lake Road and Pyramid Stables).The distance is 8km one way, from the Hostel.",
    "directions": "Follow Whistlers road past the entrance to Whistlers campground towards the tramway until you see the gravel road branching off to the left.  The trailhead is at the end of this road.  We had mountain bikes so we parked our vehicle at the tramway and biked the 2km back to the trailhead.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/346/reg_IMG-0566-11997.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/346/reg_IMG-0567-11997.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/346/reg_IMG-0568-11997.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/346/reg_IMG-0569-11997.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/346/reg_IMG-0586-11997.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/346/reg_IMG-0587-11997.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/346/reg_IMG-0589-11997.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/346/reg_Whistlers.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/346/reg_Whistlers10.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/346/reg_Whistlers12.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/346/reg_Whistlers16.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/346/reg_WhistlersHike.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/346/topo_newhand.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/346/narrow_IMG-0801-21068.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/whistlers-summit-near-jasper-ab-346",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 4,
        "Time": "6 hrs",
        "Total Distance": "8 km",
        "Town": "Jasper, AB",
        "Type": "out-and-back"
    },
    "title": "Whistlers Summit",
    "trail_id": "346"
}