{
    "description": "There are a total of 14 kms of snowshoe trails and more than 50 km of maintained cross-country ski trails (mix of Easy, Intermediate and Difficult trails). Most of the snowshoe trails are cut from the forest, but at least one trail (White Rabbit) is left in a natural state. Bushwacking is often required but the trail is clearly marked with signs (the next sign always visible from the previous location).\r\rThe Sovereign Lake Nordic Centre is located in Silver Star Provincial Park and is operated by the Sovereign Lake Nordic Club in co-operation with BC Parks. A day pass ($8.00) is required to enjoy the trails.  A full service day lodge is available at the parking area. The Black Prince Cabin is accessible by snowshoe and cross-country ski trails, and is a simple shelter with 6 picnic tables and wood burning stove for heat. For additional info and maps of the trails, visit www.sovereignlake.com.\r\rI was snowshoeing on this particular trip, and the GPS data includes a portion of the Trapline trail, the White Rabbit trail, and the portion of the Cabin Fever trail which leads to the Black Prince Cabin. Only 0.5 km of the Wild Goose trail is shown -- I quickly abandoned the trail knowing that I could not break trail the entire way sinking in knee deep snow. The trails are relatively easy, with the exception of White Rabbit. It is listed as Intermediate, but I found it tougher than the Difficult trails because there is no cut trail and bushwhacking through willows was required. The snowshoe trails cross the x-country ski trails occasionally, but you are mostly secluded from the hordes of skiers.",
    "directions": "Sovereign Lake is located 22 km northeast of Vernon, in Silver Star Provincial Park. From Highway 97 (to Vernon) follow Silver Star Road (48th Avenue) for 20 km. Make a sharp left turn and follow Sovereign Road for an additional 2 km. Take the left road at the T-intersection for the remaining .25 km to the parking lot.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/3463/reg_Sovereign-1--6704.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3463/reg_Sovereign-2--6704.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3463/reg_Sovereign-3--6704.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3463/reg_Sovereign-4--6704.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/sovereign-lake-near-vernon-bc-3463",
    "stats": {
        "Activities": "ski-xc snowshoe",
        "From": "",
        "Seasons": "winter",
        "Stars": 3,
        "Time": "7 hrs",
        "Total Distance": "14 km",
        "Town": "Vernon, BC",
        "Type": "out-and-back"
    },
    "title": "Sovereign Lake",
    "trail_id": "3463"
}