{
    "description": "The name Skerwink is most likely derived from a local seabird, the Haigdown (Shearwater family), which the locals called Skerwingle or Scurwink. Another possibility is that the name migrated with the early English settlers, this coastline resembling that of England. \nThe coastal features of Skerwink have assumed names applicable to their shape. Sea stacks, particularly on the Port Rexton side, have names such as ?Music Box? because of the music created when the wind blows around them, and ?Flat Fish? because of its resemblance to a Flounder. \nThis prominent headland will provide ample opportunities to view seabirds such as black-legged kittiwakes, gannets, and great black-backed gulls, while minke and humpback whales can be seen breaching the oceans surface. \nPort Rexton and the surrounding communities are also visible from the trail. This includes the towns of English Harbour, Champney?s, and Trinity. Port Rexton received its name in 1910, when the towns of Ship Cove and Robinhood amalgamated. The town was dependant upon the Labrador fishery and was quite prosperous with a population of 500 people in 1884. The cove offered a good harbour for large vessels, and the land was used quite effectively for farming and the raising of livestock. The collapse of the Labrador fishery resulted in a population drop from 790 residents in 1921 to 449 residents in 1951. \nThe trail also passes by Sam White?s Cove, named after a merchant who established a lucrative fishing business in c1699. It is also believed that the area was occupied by troops, due to the presence of trenches and the unearthing of a cannon ball by a local resident who was tilling the ground for a garden. It is also claimed that Skirwink Head contains the grave sites of several French soldiers.\n'This boat will mean a watery grave for you.' Those were the words of the wife of Will Butler, upon his purchase of the Marion Rogers, a 57.5 ft schooner. Her words proved true on November 27, 1938, as Butler and six others made their way from St. John?s to Trinity. Although the day had started out with clear skies, an unexpected blizzard caused the schooner to crash on the rocks just fifty yards from the lighthouse. They were so close to home that the residents could hear their cries for help, but the weather made it impossible to help them. The wheel of the Marion Rodgers is now placed in the garden of Les Butler, Will Butler's son, as a monument to those who lost their lives so close to home. This shipwreck is located on the Trinity side of the Skerwink Trail, just off Fort Point.\nThis Coastal trail provides opportunities to see and photograph whales, icebergs, and eagles, as well as views of the communities of Port Rexton and Trinity \nMore information on the Discovery Trail can be found at: http://www.thediscoverytrail.org/english/hikediscovery/index.html",
    "directions": "Accessible from Trinity East, (next to church) off Route 230.",
    "geohash": "fbd54",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NL/3467/reg_IMG-3395-57494.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/3467/reg_IMG-3452r-57494.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/3467/reg_IMG-3475r-57494.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/3467/reg_skerwink-8764.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/3467/reg_skerwink2-8764.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/3467/narrow_IMG-3400-57494.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/skerwink-trail-near-trinity-nf-3467",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "5 km",
        "Town": "Trinity, NF",
        "Type": "out-and-back"
    },
    "title": "Skerwink Trail",
    "trail_id": "3467"
}