{
    "description": "This trail is a small portion of the ~48km Baden Powell trail, which runs from Deep Cove to Horseshoe Bay, along the mountains of North Vancouver.  This segment, running from Grouse Mountain to Skyline Drive (Mosquito Creek), is a convenient hike due to its return-loop nature, ample parking (at either end), and easy access via transit (Grouse Mountain).\nAssuming a starting point at Grouse, the hiker is treated to a fairly steep incline, after which the trail flattens off and works its way around to Skyline Drive.  The trail is well maintained, with only 2 or 3 mildly tricky bits coming up out of the creek crossings.  Those hiking the trail in the winter or spring should be prepared for exceedingly muddy and somewhat slippery conditions.\nNOTE: The GPS track I've uploaded doesn't include the portion of the BP connecting to Grouse, as I often take a route through an old quarry that keeps me from having to do battle with Grouse Grinders.  See the trailhead instructions below for more info.\nMore information on other sections of the Mosquito Creek Trail:\nMosquito Creek Cascades\nMosquito Creek\nMosquito Creek Hiking Trail",
    "directions": "Assuming a starting point on the Grouse Mountain side, follow the hoards of people towards the start of the Grouse Grind.  Where they all start to head up the mountain, carry on straight, following the \"BP\" trail markers on the trees.  From there, carry on to Skyline, where you can choose to head back to Grouse via the Baden Powell or the less strenuous powerline access road.\nAssuming a starting point on Skyline Drive, keep driving up Skyline until your path is blocked by a large orange gate.  Park well off the road and walk past the gate to the only sharp right switchback (see the GPS track for more accuracy).  There you'll see the Baden Powell head off into the bush.",
    "photos": [],
    "source_url": "https://trailpeak.com/trails/baden-powell-grouse-mountain-to-mosquito-creek-near-north-vancouver-bc-3492",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "4 km",
        "Town": "North Vancouver, BC",
        "Type": "out-and-back"
    },
    "title": "Baden Powell - Grouse Mountain to Mosquito Creek",
    "trail_id": "3492"
}