{
    "description": "I have been holding out on my winter camping venture for January 2008, and finally settled on the last weekend of the month. It turned out that it was probably the coldest night of the year so far. The temps dipped to minus 21C, and the sleeping was cold!\nRandy, A friend of mine had expressed some interest in winter camping, so we co ordinated on his plan to go in to Campbell's Pond, just within the boundary of PEI's national park. It would have been kind of stupid to just park the car and set up tents, so to add to the camping adventure, we would ski in to a suitable location. When the forecast made it clear that the night was going to be very cold, everyone opted out except for me. I still was committed to my \"camping at least once a month\" mantra, figuring that I had the gear to do so. This last ditch attempt for January wasn't exactly \"come hell or high water\", but in the spectrum somewhere opposite hell for sure.\nAfter plotting the necessary road and geography points on the GPS, I set out after 9pm with backpack gear and my Aplina Lite Terrain BC skis and boots. I had waxed them according to the estimated evening temps, so it was great to again, see my \"grip wax mojo\" working. The terrain was fairly flat, and the going was fairly easy. I find that the wide design of the skis makes it much easier to stride without fear of rolling an ankle.\nThe road was unplowed, and I made my way toward my destination. Along the way were several cottages, all closed up. the road wasn't gated like it would be in the summer, so all I saw when I entered the park boundaries was a sign. I didn't really have that far to go, just under 2K to get close enough to the pond. I hit one clearing that seemed like it would be nice, but noticed some XC tracks going further toward my waypoint of interest, so off I went. I got to a second clearing, and I thought for sure that this was the pond. There were trails to explore, but time wasn't on my side.\nI started making camp on a nice platform of snow, when I found that some of my deeper boot \"post holes\" had slush at the bottom. Thinking that I had actually pitched directly on the pond, I decided to move back on to the trail at the edge of the woods for safer ground. If I wasn't onthe pond, this place was marshy at least. \nAll the time I was setting up camp, I could hear a fox yelping off in the distance. I was thinking that he should do something better to conserve his energy than to come over here to investigate, given the freezing temp and me not wanting to have to deal with a pesky animal.\nDid I mention how cold it was? I initially settled in and could only manage to read a page from a magazine I brought along. I switched to my MP3 player and managed to fall asleep for an album or three. Once I woke again, I never could get back to sleep. Different parts of my body were slightly cold, at least cold enough not to be able to relax and drift back. At a little after 6AM, I had had enough. I knew I had to get back early, so I broke camp. Turns out I had brought all the right gear for comfort, for as much comfort I could manage. I wore a down jacket while I packed everything. It kept me nice and toasty all the while. I skied out as the skies were brightening, and made it back to the car in fine time. January is in the bag!",
    "directions": "Head to Grand Tracadie on Route 6, and look for Watt's Road heading north. The far end is probably baracaded when the National park is operating in the summer.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/PE/3493/clearing.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/3493/reg_best1_campbellpond-2-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/3493/reg_clearing-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/3493/reg_low-temps-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/3493/reg_tent-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/3493/narrow_campbellpond-1-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/3493/narrow_headingout-6702.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/campbells-pond-bc-ski-pei-nat-park-near-grand-tracadie-pe-3493",
    "stats": {
        "Activities": "snowshoe hike ski-bc ski-xc mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "3 km",
        "Town": "Grand Tracadie, PE",
        "Type": "out-and-back"
    },
    "title": "Campbell's Pond BC ski (PEI Nat. Park)",
    "trail_id": "3493"
}