{
    "description": "Fox Island has two distinct plateaus, the lower of which (known as ?the Porch?) has clear evidence of trenches that were used as a defence during Queen Anne?s War. The war began in 1701 as a result of conflict between England and a Spanish-French alliance. It ended with the Treaty of Utrecht in 1713, which granted sovereignty of Newfoundland to England and gave the French fishing rights from Bonavista to Point Riche. \nLike many small communities in Newfoundland, Champney?s was a steadily growing fishing community in the 19th century, reaching a peak population of 177 people in 1836. Many people from this small community were engaged in the seal hunt on February 28, 1892, when a blizzard claimed the lives of 28 men. This tragic event has become known as the ?Trinity Bay Disaster.? \nAn archaeological dig on Fox Island in 1995 revealed the remains of approximately 15 earthen features or structures, a number of which are in excess of 8 m in length. The principal area of occupation was enclosed with an earthen parapet wall, and a number of bastions were strategically positioned on prominent points of land. \nLocal residents have also utilized the area for growing vegetables, harvesting capelin, gathering berries, and hunting birds. Residents have literally put their mark on the area, as noted by names carved into the bedrock. Many older residents of the area have fond memories of ?Sunday outings? on the beach connecting Fox Island to the mainland.\nFox Island is not (or perhaps, no longer) an island, as it is conected to the mainland by an isthmus. The trail crosses this isthmus and then proceeds to the summit of this prominent headland that juts 35 meters above sea level. The inquisitive hiker will enjoy exploring this trail with its history and scenery. \nMore information on the Discovery Trail can be found at: http://www.thediscoverytrail.org/english/hikediscovery/index.html\nRyan Young\nNewfoundland Editor",
    "directions": "The trail head is located at the end of the community of Champney?s West, off Route 230.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NL/3496/reg_foxisland1-8764.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/3496/reg_foxisland3-8764.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/fox-island-trail-near-bonavista-nf-3496",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "3 km",
        "Town": "Bonavista, NF",
        "Type": "out-and-back"
    },
    "title": "Fox Island Trail",
    "trail_id": "3496"
}