{
    "description": "NTS Map: 092G07Belcarra Regional Park\r\n\r\nIf you want a lazy afternoon or early morning stroll consider these excursions: Jug Island and Admiralty Point.\r\n\r\nThe parking lot at Belcarra Regional Park splits them both.\r\nThe northern portion is a hike over to Jug Island on Indian Arm. Head right through the forest and cross a small paved access road and you are on your way. This trail offers a bit of elevation gain (200metres)over some knarly roots and through a few puddles if it has rained. A small beach opposite Jug Island is your reward at the other end. In the summer months you'll share this beach with kayakers that have traveled over from Deep Cove ant other times just indiginous water fowl. Allow 2 hours and be prepared for the climb back up to the high point on the way back.\r\n\r\nThe southerly trail to Admiralty Point has an even grade with little elevation gain. You may even want to continue a further kilometre to burns Point to the east. Small side paths will take you down to hidden bluffs and beaches with different views of Burrard Inlet.\r\nWatch tugs and freighters ply the passage between the point and Barnet Marine Park on bottom flank of Burnaby Mountain. Allow a couple of hours for a peaceful meander and wonder of the original homesteaders that inhabited this beachfront, for all that remains are old foundation footings and non-native shrubs overgrown with ivy and periwinkle.\r\n\r\nIf you have time head down to the pier if you want to see some interesting activity. Every weekend a small crab fishery takes place here. If you want to be a conservationist note that crabs under 6 inches should be thrown back. Policing of this fishery is minimal and anything you observe and report may stem the depletion of the local crab population.\r\n\nElevation Gain 200 Metres\r\n\nHigh Point 100 Metres\r\n\nDistance 5.2 Kilometres Each\r\n\nApproach\n\r\nTravel to Port Moody via either the Barnet Highway from Hastings Street in Burnaby or from the Trans-Canada and Highway 7A. Follow Ioco Road until you see signs for Belcarra Regional Park. Follow the road into the park, up the hill and down to the parking area.\r",
    "directions": "See description and / or GPS",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/35/reg_IMG-9865-20877.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/35/reg_map.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/35/topo_BelcaraSmall.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/belcarra-regional-park-near-vancouver-bc-35",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "10 km",
        "Town": "Vancouver, BC",
        "Type": "out-and-back"
    },
    "title": "Belcarra Regional Park",
    "trail_id": "35"
}