{
    "description": "INDIAN ROCK TO COMMANDO BAY\nLeft Indian Rock on Wednesday, August 29, 2007, 6:54AM. once I got to \"-GH-bch 1\" I decided to go \"au natural\" from that point in the trip. It was a hot day in August and a bit shaded in the morning as I kayaked along the edge of the Okanagan Lake. Thought I would record my trip with photo so I took out my cellphone and started snapping photos along the trip some of them are posted in here. I arrived at Commando Bay at 08:43AM just short of 2hrs. The water was mainly calm both ways. There were one couple there at the mainland part of the bay so I remained on the rock formation in front of the bay where I parked my kayak between the rocks and opened my thermos and had a coffee and relaxed in the sun. Having a dip in the lake when I got too hot. Didn't bother with clothes in this secluded part of the lake. No one complains if they happen to see me and there are usually not too many people along the edge of the lake due to large rocks in the water hidden under the surface along the way. After my coffees and lunch and a good time of relaxation I headed back.",
    "directions": "*I put-in at N49 39.209 W119 37.719 (Somerset road)\n*I would recommend this route if you are on a kayak or canoe. Watch for large rocks as you travel along the edge of the lake. Bring water and a lunch/snack.\n*Takes about 2hours each way. 15km total (7.5km each way)My GPS said my speed was average 6kmh.\n*If you are going to kayak \"au natural\" this is a good spot to strip N49 40.113 W119 39.262 \n*Large boats tend to stay away from the edge of the lake due to the rocks.*If you are going to camp, I believe there is no charge at these camp sites \"Goode's Creek\" \"Van Hyce Beach\" but I am not sure. \n*GARBAGE-IN-GARBAGE-OUT! PLEASE, if you camp take your trash out with you. The route was clean when I went and it would be great if it stayed that way. :)*Most of all relax and enjoy!",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/3500/reg_-GH-030-RockFormationView-Indian-rck-Commando-bay--0.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3500/reg_-GH-033-CommandoBay-Indian-rck-Commando-bay--0.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3500/reg_-GH-037-KayakParking-Indian-rck-Commando-bay--0.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3500/reg_-GH-043-CommandoBay-Indian-rck-Commando-bay--0.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3500/reg_-GH-bch-1-Indian-rck-Commando-bay--0.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3500/narrow_-GH-000-Leaving-Indian-Rock-Indian-rck-Commando-bay--0.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3500/narrow_-GH-044-CommandoBay-Indian-rck-Commando-bay--0.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/commando-bay-okanagan-lake-near-penticton-bc-3500",
    "stats": {
        "Activities": "river-canoe",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "4 hrs",
        "Total Distance": "15 km",
        "Town": "Penticton, BC",
        "Type": "out-and-back"
    },
    "title": "Commando Bay - Okanagan Lake",
    "trail_id": "3500"
}