{
    "description": "A loop of Iroquois Peak, eighth highest in the Adirondacks, and Algonquin Peak, second highest, samples some the most amazing scenery and terrain in the High Peaks region. Though it makes for a long day this hike will leave you with few regrets other than that it had to end. \nFollow the blue trail markers from the trail register towards Marcy Dam. At km 0.5 the trail crosses Algonquin Brook via a short wooden bridge. From the bridge the trail gradually climbs as it makes its way south towards a junction with the Algonquin Peak trail at km 1.6. Take a left and head to Marcy Dam. With only a minor gain in elevation the trail passes over rolling terrain as it follows Marcy Brook to the dam located 3.7 km from the trailhead. The trail crosses Marcy Dam and heads right at the junction with the trail to Phelps; trail markers are now yellow. The trail now follows the bank of Marcy Brook for 1 \u009d km before crossing over it at Avalanche Camp via a bridge. At the camp the trail splits; left is the trail to Lake Arnold, and right is the trail to Avalanche Pass, stay right. \nFrom the camp the trail climbs steadily as it approaches the pass, reaching it at km 6.7. The trail now drops down as you hike the 0.8 km to Avalanche Lake. The scenery here is some of the most awe inspiring in the Adirondacks as you emerge from the forest and are welcomed by the sheer cliffs of Mount Colden and Avalanche Mountain seemingly sprouting from water. The trail follows the right hand shore of Avalanche Lake and is quite rugged as it travels over bridges and ladders, and winds its way between and over large boulders. If the trail is wet caution should be taken here as it can be quite treacherous. At the south end of Avalanche Lake the trail crosses the outlet and reaches a trail register and junction at km 8.4. The trail to the left heads to Mount Colden, the trail to the right heads to the DEC Interior Outpost as well as Algonquin and Iroquois Peaks. Head right; trail markers are now blue. \nThis section of trail involves very little change in elevation and quickly reaches another junction at km 9. You will again take the trail to the right and the trail markers have reverted to yellow. Take a deep breath because the climb you are about to undertake is quite unrelenting and offers up some of the steepest trail in the Adirondacks. The trail closely follows a brook which it will cross several times as you ascend towards the col between Algonquin and Boundary peaks. The trail leaves the banks of the brook for good at about km 11. The trail finally starts to moderate in grade as you reach the col at km 11.7. The trail to Iroquois peak heads left from the col at a large cairn. Do not expect any trail markers or paint blazes as this is not an officially maintained trail, however the trail is relatively well defined and in open areas rock cairns indicate the path. To reach Iroquois you must first ascend Boundary Peak, from here you have a clear view of your destination which is then shortly reached 1 km beyond the col. \nViews from the summit of Iroquois are breath-taking with many of the 46ers clearly visible. Now follow the rock cairns back to the official trail, from you can retrace your steps back to the trailhead or take the more direct route by returning via Algonquin Peak, the latter route is described. From the col follow the maintained trail as it heads North over Algonquin Peak, much of the trail is over bare rock and offers enjoyable hiking. Be sure to follow the rock cairns and paint blazes to preserve the delicate alpine ecosystem. The summit is reached at km 14.5 and views are even more sweeping than from Iroquois. When descending from the summit be especially careful to follow the paint blazes or you may miss where the trail enters the forest. The trail descends steadily through the forest, with one very steep section of bare slab before leveling out at the junction with the trail to Wright Peak at km 16. Continue heading straight and you?ll pass a large rock outcrop some 6-9 m tall to your left a \u009d km later. From here the trail alternates between sections of steep descent and flats. At km 17.5 you?ll come to the next major landmark, a waterfall just off the trail on your right. The trail continues its moderate to steep descent until reaching the Whales Tail trail turnoff at km 19. From here the trail descends at a more comfortable rate, really nothing more than a pleasant stroll through the forest. At km 19.8 you?ll reach the junction with the Marcy Dam trail, your now back on familiar trail, simply retrace your steps from the hike in back to the trailhead. You should expect to take 9-10 hours to complete this 21.4 km loop.",
    "directions": "Heart Lake trailhead\nFrom the West take Route 73 East from Lake Placid for 5.5 km, turn right onto\nAdirondack Loj road. Follow the road for 18.5 km to the gates of the AMC High Peaks Information Center. If traveling from the East take Interstate 87 to exit 31. Turn right onto Route 9N for 24 km. Turn right onto Route 73/Route 9N and follow for 3 km. At Keene continue to follow Route 73 for 17.5 km, turning left onto Adirondack Loj road. Trailhead is at the East end of the parking lot located closet to the visitors centre.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/NY/3553/reg_algonquin-and-iroquis-049-13556.jpg",
        "https://trailpeak.com/storage//content/trails/US/NY/3553/reg_algonquin-and-iroquis-078-13556.jpg",
        "https://trailpeak.com/storage//content/trails/US/NY/3553/reg_algonquin-and-iroquis-103-13556.jpg",
        "https://trailpeak.com/storage//content/trails/US/NY/3553/reg_algonquin-and-iroquis-111-13556.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/iroquois-and-algonquin-peaks-loop-near-lake-placid-ny-3553",
    "stats": {
        "Activities": "snowshoe hike",
        "From": "",
        "Seasons": "winter fall summer",
        "Stars": 4,
        "Time": "10 hrs",
        "Total Distance": "21 km",
        "Town": "Lake Placid, NY",
        "Type": "out-and-back"
    },
    "title": "Iroquois and Algonquin Peaks loop",
    "trail_id": "3553"
}