{
    "description": "Trail starts at the base of Whistler Mountain. Walk up the ski trail to the water tower and follow the signs.\nThe first 4.0 km are on an old road with a fairly steep ditch at km 3.0. Bear right on a smaller trail at km 4.0 and start climbing on a moderate mountain trail. There are a few areas which can be tricky to cross after large snow falls so make sure you have poles and snowshoes with good traction.\nFrom the water to the top is 11 km. Bring plenty of a water as there are mountain streams but they are hard to access after heavy snow falls. Watch for skiers who use the trail to head back to town.\nYou may end up \"opening\" the trail for the last 2-3 km. It's hard work but well worth the effort. \nOn my next trip I will try to find a way to snowshoe up and ski down -- if anyone has advice on how to fix skis to my hiking boots please send e-mail. I suppose you could also plan to reach the top of Whisler mountain and use the ski lifts to come back down but I have never tried that.\nOver the years, I have been up that trail 4-5 times.",
    "directions": "At the skier \"drop off\", go up Whistler Mtn's left-most ski slope until you see the water tower. Follow the small road the begins a few meters after that.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/3569/reg_P1000092-13190.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3569/reg_P1000120-13190.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3569/reg_P1000123-13190.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3569/reg_P1000124-13190.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3569/reg_P1000132-13190.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/singing-pass-winter-route-near-whistler-bc-3569",
    "stats": {
        "Activities": "snowshoe ski-bc",
        "From": "",
        "Seasons": "spring winter fall",
        "Stars": 4,
        "Time": "8 hrs",
        "Total Distance": "21 km",
        "Town": "Whistler, BC",
        "Type": "out-and-back"
    },
    "title": "Singing Pass - Winter Route",
    "trail_id": "3569"
}