{
    "description": "This is a well-maintained and well-marked backcountry ski and snowshoe trail that starts from the car-park of the Mt. Seymour ski resort.   In summer it is a popular hiking destination.\nThere is a parks notice board at the start of the trail that has a map, and in winter, often has posted the current avalanche and weather report.  Heading up the hill (right) is the trail to the first and second pumps, and further out, the Mt Seymour summit.  Heading left is the Dog Mountain trail.\nThe trail follows along side the ski resort for the first stretch.  There are numerous small trails heading out to viewpoint to the left, but be aware that this area is not immune to avalanches, and that there are many cliffs and ice falls for the unwary.\nOnce past the resort, the trail wanders around a little.  In winter it is clearly marked with orange snow poles.  The last stretch of the trail to a small col and summit of the first pump are a bit steeper, but the most of the trail is reasonably moderate.\nThe trail can be quite busy on weekends, especially in stable clear conditions, though the crowds quickly thin the further away you get from the ski resort.",
    "directions": "Follow direction for Mt. Seymour ski area in north Vancouver. From main parking lot, the trail head can be found to the left of bottom of the Mystery Chair.  It is clearly marked by a covered parks notice board.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/3576/long_Seymour-DB-018z-6103.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3576/reg_DSC00991-33134.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3576/reg_DSC00999-33134.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3576/reg_DSC01000-33134.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3576/reg_DSC01008-33134.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3576/reg_DSCN7144-13207.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3576/reg_DSCN7158-13207.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3576/reg_IMG-3101-6103.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3576/reg_best1_IMG-3040-6103.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mt-seymour-1st-peak-near-north-vancouver-bc-3576",
    "stats": {
        "Activities": "snowshoe ski-bc",
        "From": "",
        "Seasons": "spring winter summer",
        "Stars": 2,
        "Time": "4 hrs",
        "Total Distance": "8 km",
        "Town": "North Vancouver, BC",
        "Type": "out-and-back"
    },
    "title": "Mt. Seymour - 1st Peak",
    "trail_id": "3576"
}