{
    "description": "This is a 13 km stretch of the Kettle Valley Railroad / Trans Canada trail just north of Princeton CB. It is in the beautiful Jura Grasslands area, the southern portion of it (see the photo map, the area between Jura and Princeton). Being a rail road bed, it is basically flat. but in this area, a gentle downhill, approx 250m over the 13 km, from just east of the Hembrie Mtn Rd south to Rainbow Lake Rd. As the slope is downhill from north to south in this area, best to do it from north to south.In this area, the rail bed crosses the road (Princeton-Summerland Rd, also known as Hwy 40) twice. If you want to do the full 13 km, start at the 2nd crossing (just east of the Hembrie Mtn Rd), if you want to do the shorter 10.5 kms trip, start at the first crossing, just east of the \"Maverick Hitch and Post sign. The 2.5 k stretch between the 2 crossings is quite spectacular and worth doing if you have the energy to do it.A note of interest: if you start at the first crossing (the one near the \"Maverick Hitch and Post\" sign, because of the loop of the railbed, remember that going north from this point means heading south on the railroad and going south in fact heading north.To do the whole trail, you need 2 vehicles, 1 at each end to avoid having to back track and retrieve your car.In the winter, do it on snowshoes or on skis, in the summer on bike or on foot. Lots of places to stay around Princeton, including the Princeton Castle, off Rainbow Lake Rd, where we stayed.",
    "directions": "From Hway 3 in Princeton, go north on Bridge St (at the Petrocan station), drive north 1 block, turn right onto Hwy 5A (Tulameen-Merritt), go 600 m and turn right onto the Old Hedley Rd, then 300m later, left onto the Princeton-Summerland Rd (Hwy 40) (just after the \"Princeton Castle\" sign). Drive 2 km to Rainbow Lake Rd (this is the road to \"Princeton Castle\"). This is the south end of the trail, or drive a further 5.7 kms to the first crossing (the one just past the \"Maverick Hitch and Post\" sign) , or an extra 2 km or so to the 2nd crossing (the one just past Hembrie Mtn Rd).",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/3641/regKVRJuraSouth5767-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3641/reg_KVRJuraSouth5768-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3641/reg_KVRJuraSouth5776-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3641/reg_KVRJuraSouth5788-7359_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3641/narrow_KVRJuraSouth5770-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3641/narrow_KVRJuraSouth5771-7359.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/kettle-valley-railway-jura-grasslands-south-near-princeton-bc-3641",
    "stats": {
        "Activities": "snowshoe hike ski-xc mtn-bike",
        "From": "",
        "Seasons": "winter summer",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "13 km",
        "Town": "Princeton, BC",
        "Type": "out-and-back"
    },
    "title": "Kettle Valley Railway - Jura Grasslands South",
    "trail_id": "3641"
}