{
    "description": "The Earl Grey Pass trail is a 37 mile (61 km) 5 day hike through two valleys of the Purcell Mountains south west of Invermere, BC.  The trail takes you west up Toby Creek to Earl Grey Pass, then drops you down along Hamill Creek to Argenta near the north eastern end of Kootenay Lake.  The Earl Gray Pass Trail  crosses the Purcell Mountains from the East to the West Kootenays, passing through old growth forests of Spruce, Hemlock and Cedar.  Native wildlife includes deer and elk, mountain goat, beaver, coyote and wolf, black and grizzly bear, and at least 90 bird species.\nThe trail can be done in either direction, as a return trip, or with a car-drop or pre-arranged pick-up at one end.  \nThis route was historically followed by First Nations people, and then by miners in the late 1800's.  Earl Grey, the Governor General of Canada in the early 1900's, built a cabin near the start of the trail on Toby Creek in 1909.\nFrom the eastern trail head, hike along the northern banks of Toby Creek to the top of Earl Grey Pass.  On the way, explore the remains of Earl Grey's family Cabin and the now abandoned Mineral King Mine.  From the pass you can scramble the ridge north of the pass to a shale peak (8841ft) for spectacular views.\nWest of the pass it's mostly downhill.  Drop down past a small spring to North Forks camp at the base of Blockhead Mountain, then follow Hamill Creek on a trail that has many blow downs, 5 cable car creek crossings and numerous creek crossings.\nAvailable wilderness camping sites (measured from the eastern trail head) include Earl Grey Cabin (1.5 km), Tepee Camp (8.5 km), Toby Falls (14.5 km), Earl Grey Pass (16.5 km), Rock Creek (30.5 km), Boy Scout Camp (39 km), Big Bar (42.5 km), and Garnet Beach (46.5 km).\nExpect all the dangers of wilderness camping in BC, including bears, fast changing mountain weather, slippery and muddy trails, log crossing, river crossings by cable car (bring gloves), other water crossings, game trails, slippery bridges, avalanche paths, blow-downs and creek crossings.  This is not a trail for the inexperienced, and will require map reading and route finding skills, experience camping in bear country, and careful judgement on where and how to cross the many rivers on the trail.\nDepending on the spring melt and resulting river volumes, this trail is normally attempted in August and early September.\nMore information and trail maps can be found here at the BC Parks web page for the Purcell Wilderness Conservancy.\nMaps: 1:50,000 scale topographic maps 82K/2, 82K/7, and 82K/8.  A larger scale back road map for the area would also be a good idea.  Eastern Trail Map , Western Trail Map",
    "directions": "To get to the Toby Creek trail head (eastern trail head) follow a secondary road north of Invermere 18 kms towards Panorama Resort, then go 20km down the the gravel road beside Toby Creek to the old Mineral King mine. Just past the abandoned mine site, cross Jumbo Creek.  Keep left and continue past a horse corral for about 1km.  Take the right fork and follow it up hill to a parking area. It is a 200m walk to the Park Boundary and trail head.\nThe western trail head is accessed from the town of Argenta, north east of Lardeau off Hwy 31.  Take the Argenta Rd south through Argenta to Wolfe Rd.  Follow this north then take the right Forest Service Road (FSR) to the trail head at the head of Carter Creek.  This is the standard finish to the hike.  Drop a car there at the trails western trail head.  Drive around to eastern end of the trail on the Toby Creek FSR.  \nThis trail can be done in the opposite direction, in which case the car drop will be on the Toby Creek FSR.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/3642/reg_Earl-Gray-Trail-Map-6103.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3642/Earl-Gray-Trail-Map.gif"
    ],
    "source_url": "https://trailpeak.com/trails/earl-grey-pass-trail-near-invermere-bc-3642",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 4,
        "Time": "35 hrs",
        "Total Distance": "61 km",
        "Town": "Invermere, BC",
        "Type": "out-and-back"
    },
    "title": "Earl Grey Pass Trail",
    "trail_id": "3642"
}