{
    "description": "Scenic, though in forest scenic, not open vista kinda way.  Great conditions, nice trees, trails and routes.  A bit of a climb, about 300m cumulative climbing.   A very good trail.\nI coulda sworn I read there are artifacts from the old lumber industry site that used to be in this area (and hence what the trail was named for) along this trail,  but I didn't see any sign of them.  Maybe the fact the snow was up to my hiney (heiney?) was covering them up, I'll try again in the Summer.\nSNOW!  Wow, what a great spot.  There is NO snow in Calgary, there is TONS of snow here in early March.  Nice, deep, virgin, clean, beautiful snow.\nWe extended the intended 5 km track by 2.5 or so, by continuing on North from the turnaround at the North end.  This was where we found some of the nicest area, including a stump just made to sit on and have lunch.   In this area is we found an old-over grown road that made a nice trail off the trail to practice our tight-spot negotiation with.  \nThe only tricky navigation was about 1/2 way back on the return (Eastern) leg.  There is a map there and 3 major trails.  I'm an off-roader at heart and took a minor, minor trail off into the hill behind the sign.  Well I'll be darned if I didn't promptly see the little orange diamond route marker.  The 'entry' behind the sign wasn't marked so I guess I got lucky following someone else who knew the exact right way.\nWe did the trail clockwise and it seemed to be the best as the hills at the SE side were steeper (according to both my legs and my GPS)  and they will be more fun to do coming down.\n \nThere are also a number of XC trails in the area, with probably 30 or more km of trails to mix 'n Match.",
    "directions": "Sawmill parking area is 15 km from the South end of the Smith-Dorien (Spray Lakes) road running from Canmore at the North end to Peter Lougheed Provincial Park in the South.  \nIt is faster and safer to get to it by driving 50.0 km S on HiWay 40 from the Trans-Canada #1, into Peter Lougheed and turning right onto Smith-Dorien.  The large parking lot is easy to find and well signed on the East side of the road.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/3692/reg_DSC00008-Medium--6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3692/reg_DSC00009-Medium--6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3692/reg_DSC00012-Medium--6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3692/reg_DSC00016-Medium--6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3692/reg_DSC00022-Medium--6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3692/reg_DSC00027-Medium--6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3692/reg_DSC00034-Medium--6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3692/narrow_DSC00007-Medium--6828.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/sawmill-near-canmore-ab-3692",
    "stats": {
        "Activities": "snowshoe ski-bc ski-xc mtn-bike",
        "From": "",
        "Seasons": "winter fall summer",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "5 km",
        "Town": "Canmore, AB",
        "Type": "out-and-back"
    },
    "title": "Sawmill",
    "trail_id": "3692"
}