{
    "description": "This trail takes you through the central park of Kalamalka Lake Park.  I runs along the south side of the \"mountain\" in the middle os the park.  Along the cliff  there is a crazy lookout where the cliff drops away and it can give you the willys to get too close.  The climb is not difficult, but feels relentless in some spots.  The coolest part is the view of Cosens Valley from the top of the trail.\nTo form a loop to take you back to the Red Gate, take the 2 km Parabola trail. \nThe  loop uses Coldstream Creek Rd to connect between Kidston Rd and Cosen's Bay Road\n\nNew GPS attached May 22, 2008, is mine (Sdecarie) and is a complete riding loop that uses Cosen's Bay Road then Sidewinder trail back to the Red Gate",
    "directions": "Kidson Road takes you right along the park and past the Red Gate and parking area.  It is just a pulloff with room for about 6 or 7 cars.  Take Kalamalka Lake Road of highway 97, just south of Vernon, go down the switchbacks and stay right at the weird yield place.  Follow this road along the shoreline and turn right onto Kidson.\nYou can start at either the above mentioned gate or at the Kalamalka Park entrance on Cosen's Bay Road.",
    "geohash": "c2gj",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/3760/reg_DSC00004-7279.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3760/reg_DSC00005-7279.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3760/reg_DSC00006-7279.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3760/reg_DSCN1184-6465.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3760/reg_DSCN1192-6465.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3760/reg_DSCN1199-6465.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/lookout-trail-near-vernon-bc-3760",
    "stats": {
        "Activities": "snowshoe hike mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "5 km",
        "Town": "Vernon, BC",
        "Type": "out-and-back"
    },
    "title": "Lookout Trail",
    "trail_id": "3760"
}