{
    "description": "A well-known trail in Banff NP that starts just off the Trans-Canada hiway and heads 13km back into the hills.  And I mean hills.  The pot of gold at the end is the historic Shadow Lake Lodge, built by the CPR in 1929, and now tea & cookie heaven (for C$15 that is - did I mention it's owned by Brewster now?).  I think the views are limited until the end when you get to the lake.  You can ride your MTBs up to about 2.5km from the end when you get to the sign for the Egypt Lake turn.\r\rIt is reasonably steep, gaining 423m over 13km (averages 3.2% grade, but it  felt like more.\r\rThis was a late winter / spring trip and during fairly warm weather.  Hence, the freeze/thaw was working it's magic and this trail was a little nasty.  XC ski poles skipping off the ice nasty.  Add to that we were following the delivery skidoo track up to the lodge and it wasn't track-set after, so it was a rough, icy track that left your skis often randomly wandering around underneath you.\r\rThis trail is right close to: \r\r\rThe trail rating may increase in earlier winter season with less ice and/or in the summer, but the fact that you're in the trees for the majority of the trip will not change.\r\r",
    "directions": "West of Calgary on TC #1, past Banff, past the Sunshine ski area turn-off about 5km to the well-signed Redearth Creek parking lot / trailhead.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/3770/reg_DSC00044-Medium--6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3770/reg_DSC00047-Medium--6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3770/reg_DSC00050-Medium--6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3770/reg_DSC00053-Medium--6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/3770/reg_DSC00057-Small--6828.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/redearth-creek-near-banff-ab-3770",
    "stats": {
        "Activities": "mtn-bike ski-xc ski-bc hike snowshoe",
        "From": "",
        "Seasons": "summer fall winter",
        "Stars": 2,
        "Time": "5 hrs",
        "Total Distance": "26 km",
        "Town": "Banff, AB",
        "Type": "out-and-back"
    },
    "title": "Redearth Creek",
    "trail_id": "3770"
}