{
    "description": "NTS Map: 092G06Click on \"view/download GPS\" to see a preview of the GPS data for this trail.  If you have a GPS unit you can download this data and load it into your unit using the G7toWIN shareware which supports GARMIN GPS amoungst others.  It helps you stay on track because in this case there are lots of \"tributary\" trails that can be confusing at times. Otherwise follow the general directions below.\r\n\r\nThe Baden-Powell trail runs from Deep Cove all the way to Horseshoe bay, and provides many variations of hikes done in smaller segments. This segment of the Baden Powell trail was suggested by Peggy Moir, who has provided a list of trails well suited to those who don't want a lot of elevation gain.  Having said that, this trail does have some steeper sections and gulleys, which can be slippery, especially if venturing off the main route.\r\n\r\nA common theme with Peggy and her husband are hikes that involve a turnaround point around ?lunch time?, and, blueberries (alas not on this trail).  The lunch point here is the Grouse Mountain Sky-ride area.Basic directions are to enter the trail from the upper end of St. Mary's, that you get to via Upper Lonsdale in North Vancouver. Take upper Lonsdale (or St. Georges) all the way to the top, then turn right for a few blocks until you reach St. Mary's.  Drive up to the end of St. Mary's and you'll find a small parking area suitable for hikers.  The trail merges with Baden-Powell, which you takes you roughly to the Sky-ride on Grouse Mountain, have lunch, and turn around.  After entering the trail, you can follow the Powerline to Mosquito Creek, cross the bridge, and then get back on the Baden-Powell trail.  There are lots of views along the trail, hence Peggy's vote for staying in the open. As we've marked there are other options, as marked above.  \r\nThis trail is available all year round, however, since it is at a somewhat higher elevation, you may encounter some snow in winter.",
    "directions": "See description and / or GPS",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/38/3D_FINAL.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/38/topo_final.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/38/narrow_Keith.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/38/narrow_St.GeorgeSmall.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/badenpowell-stgeorge-to-skyride-near-vancouver-bc-38",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "7 km",
        "Town": "Vancouver, BC",
        "Type": "out-and-back"
    },
    "title": "BadenPowell - St.George to Skyride",
    "trail_id": "38"
}