{
    "description": "The Newport Cliff Walk is home to some of the best ocean views in Newport as well as a \"behind the homes\" look at some of the coolest mansions you have ever seen.\nThe trail starts right off Memorial Blvd, next to first beach.  From there you will walk along the paved path behind many nice houses, including the buildings at Salve Regina University.  You will continue walking along for a few miles and you will have different streets that you can exit onto from the cliff walk.  After a while the path turns from paved to packed dirt and climbing over smaller rocks.\nWhen you reach the end, it will put you at the entrance to Ocean Drive. From here, you can walk along Bellevue Ave back all the way to your car, or you can catch the trolley.\nThings to bring:\n-water\n-Snack\n-Sun block\n-Camera\n-Sweatshirt",
    "directions": "Park anywhere near 1st Beach in Newport and walk up the hill until you see the entrance to the Cliffwalk.  You can also head down Bellevue Ave and turn left onto Narragansett Ave at the intersection.  This street will bring you straight to the 40 Steps of the Cliffwalk and you can park near there as well.\nTo reach the other end of the trail, take Bellevue Ave and follow it for a mile or so.  The road turns right and at the end. You can either turn right here or there is a turn around point with an island in the middle of the road.  That is the end of the trail.",
    "geohash": "drm",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/RI/3883/reg_NewportCliffWalkM1-13452.jpg",
        "https://trailpeak.com/storage//content/trails/US/RI/3883/reg_pvdlw-phototour14-13452.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/cliff-walk-near-newport-ri-3883",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "10 km",
        "Town": "Newport, RI",
        "Type": "out-and-back"
    },
    "title": "Cliff Walk",
    "trail_id": "3883"
}