{
    "description": "Hollyburn Peak is an uphill snowshoe route to the peak, which delivers a spectacular view of Georgia Straight, the Lions, and the nearby Grouse Mountain area.The 3.5 hour out and back snowshoe route to Hollyburn Peak is actually within Cypress Provincial Park, and therefore, while it may start from the same parking lot as the cross-country ski and snowshoe area up on Cypress Mountain (XC ski area turn-off not downhill parking lot), there is no charge to use the trail.  In other words, you don't have to pay for the $3-4 snowshoe day pass that would otherwise be sold to you at the snowshoe rental shack.The route starts at the covered sign (kiosk) that you will see just before the XC ski shack area where people start skiing.  Your route avoids this paid area of groomed trails, and instead snakes its way up the mountain, for the first while staying close to or adjacent to the XC ski trails.  You start off under the power lines, slowly climbing, and then level off.  The route is marked by orange poles.  It's a well-trodden trail, even in the snow, but you can still download the waypoints and GPS track from trailpeak. Point 001 is the sign and start of the trail; the point marked peak is your destination.  The trail is well marked, and other snowshoers will point the way if you are unsure.  Hint, keep going up.To get to the trail (XC ski area on Cypress) take the Cypress Bowl exit from the Upper levels Highway in North Vancouver (heading to Horseshoe bay) keeping a keen eye out for the sign to Cypress.  Drive up to Cypress, as if you were going to the downhill ski area, but when up top, take the XC ski and snowshoe turnoff to the right, before you get to the downhill area.  You will see the signage (looks like a small shelter, but is a Parks Kiosk) and park anywhere nearby.Note there is also a shuttle bus up to the park, and if you squint, you may be able to make out the bus times in the kiosk picture above, otherwise call Gray Line of Cypress Ski Hill.",
    "directions": "See description and / or GPS",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/389/long_IMG-3247-Panorama-43219.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/389/long_PM055-Sanguine-Silence-Vancouver-Cypress-Landscape-Chris-Collacott-avision.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/389/reg_P1230054-39035.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/389/reg_cypress1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/389/reg_cypress2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/389/reg_hollyburn111.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/389/reg_kiosk.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/389/reg_lions.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/389/reg_m_a.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/389/reg_oldfella.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/389/topo_hollyburn112_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/389/narrow_image-43169.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/hollyburn-peak-near-vancouver-bc-389",
    "stats": {
        "Activities": "snowshoe",
        "From": "",
        "Seasons": "winter",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "5 km",
        "Town": "Vancouver, BC",
        "Type": "out-and-back"
    },
    "title": "Hollyburn Peak",
    "trail_id": "389"
}