{
    "description": "The trail starts at a steady incline. After 6 or 7 minutes, you'll reach a stream that is easily crossed. Cross the stream and hike up to a well cleared and wide pathway. Turn left and continue down the pathway (if you turn right, you'll be on your way to Mt. Braden [see my other trail post for that]). Continue down the pathway until you reach several \"no trespassing signs\" and see a series of interesting blue plastic objects in the distance.  Continue to follow the trail as it takes a hard right and continues upward. Over the next hour, you'll steadily gain elevation until you reach the peak.\nThe path is fairly well marked. You should continually be on a well defined dirt path, so retrace your steps if you do not see a well worn dirt path beneath your feet.\nThe final 15-20 minutes climb to the peak is very steep and rocky. I imagine that hiking down could be very dangerous on a rainy day.\nThe view of surrounding peaks is quite worthwhile - all and all, a nice hike if you want to be home in time for lunch.",
    "directions": "The trail head coordinates are N 48,25.000 & W 123,35.028. There is an area for parking a few hundred metres from the trail head.\nNOTE from a local resident on Sooke Rd:\nThere is no legal access to these trails from Sooke road.  All of the east side of Sooke road is private property and closed to the public.  The west side is a mix of private property and government lands which are closed to the public.  If you choose to hike these trails, you will be trespassing.  You may be charged, fined, and/or jailed.   For legal access, lobby the Capital Region District Parks Board and your local politicians.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/3906/reg_P1010005-13200.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mt-sugarloaf-near-victoria-bc-3906",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "6 km",
        "Town": "Victoria, BC",
        "Type": "out-and-back"
    },
    "title": "Mt. Sugarloaf",
    "trail_id": "3906"
}