{
    "description": "For great mountain views of the Canadian North Cascades do this short hike. Its close to the lower mainland, doesn't see a lot of traffic and provides quick respite to the rigors of urban stress.Years ago Ford Mountain had a Forest Fire Lookout but that has since disappeared. You can imagine what it must have been like spending a night here during a raging electric storm, hoping the lightning rod would do its job.Some gnarled and charred trees are around the hummocky summit area attesting to recent high voltage outbursts.Rewards are high with austere mountain vistas. To the north lays the Cheam Range with Welch (2377m) and Foley (2286m) the highest peaks to the east. Directly across the Chilliwack River to the south, the Nesakwatch Creek Valley with Slesse Mountain (2377m) at its headwaters stands dominant.Looking over to Slesse Mountain its famed NE Buttress directly faces you. This mountain route has been a technical prize for climbers since eminent mountaineer Fred Beckey climbed it in August 1963. In 1956, a winter storm caused a DC-3 to crash just right of the buttress killing all 62 passengers.The trail is accessed by about 4 kilometres of steep logging road. The last 3 km require a 4x4. Add about an hour or so if you choose to hike the road through two small cut-blocks. In the fall the roadside is covered with fireweed and is quite pleasant so it's not all that bad to walk where most will drive. The trail begins with a Chilliwack Forest Service map (no longer present - see below) and follows square orange trail markers steeply through mountain hemlock groves. In another hour or so you should reach the 1421m summit.  When you finish climbing the switchbacks that get you up the mountain, you'll think, where is the peak area for my 360-degree views.  You'll get those, but not until walking a few kilometers along the ridge to the actual peak where the old concrete posts are.  There are even some alpine flowers up top, in the peak area.If you are on limited time, do this hike. It's a good pump if you want to push it--it is rather steep. For those that want to go slowly It's short. How ever you do it, you'll be glad you did even it is just for the sake of ridding your mind of visions of gonzo motorists, crying babies and hordes of people. The trail is an ideal one, cut out of moss covered forest floor. Again, although you can drive much of the steep logging road up on, you are eventually on a steep hiking trail, there is no 'road' to the top. Most people would in fact park much further below and avoid all the logging road ditches.For great mountain views of the Canadian North Cascades do this short hike. Its close to the lower mainland, doesn't see a lot of traffic and provides quick respite to the rigors of urban stress.Best June to October. There is GPS data attached to this trail (see \"download GPS\"), which if loaded into your GPS can help you find route points.Location:  Chilliwack River Valley.    Topographic Map 92 H/4  1:50,000Access: Drive Hwy One to Chilliwack. Follow signs to Chilliwack Lake Provincial Park. At the Chilliwack River Bridge turn left and follow the river east for about 28.5 kilometres and turn left on the Ford Mountain Forest Service Road. This is just past the \"Ford Mountain Correctional Institution?; there will be a large sign for the \"prison\".  Then you'll cross the Chilliwack river one more time and look for the FSR on the left, a bit further. A GPS map was produced; see above. It is four kilometres to the trailhead from the highway.  2-wheel drive vehicles will only make it so far--4x4s may make it another 2-3km if they can cross the logging road 'ditches'.  There are a number of pullouts suitable for parking a vehicle, if you find you are not comfortable climbing the steep road any longer.  Note: If you are driving up the road, you'll notice you come to a locked gate on the main logging road.  Some might be tempted to park here and continue walking along the 'main' road, but don't do that.  Looking back and left of the gate, you will see a narrower 4x4 road rise steeply away.  This is your route.  Maybe 500 meters up this road, the hike starts, as one would expect, on a steep single-track trail.  Your best bet is to park below, or at the gate area. See GPS data marking the road turnoff (FSR), the 2 wheel drive parking area (estimated, 2 wheel drive vehicles can go as far as the first \"ditch\" in the road), and where we parked our 4x4.",
    "directions": "See description and / or GPS",
    "geohash": "c29x",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/392/reg_SAM-1457-40607.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/392/reg_SAM-1462-40607.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/392/reg_topoFord.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/392/reg_vicb_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/392/topo_view.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/ford-mountain-chilliwack-near-chilliwack-bc-392",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 5,
        "Time": "3 hrs",
        "Total Distance": "2 km",
        "Town": "Chilliwack, BC",
        "Type": "out-and-back"
    },
    "title": "Ford Mountain - Chilliwack",
    "trail_id": "392"
}