{
    "description": "Expect scenic and ecological values on this trip to be outstanding. Riding Gun Creek to Spruce Lake as an out-and-back singletrack adventure will introduce you to only a minute fraction of trails available in this area. The Garden of Eden atmosphere that typifies this special place requires special care, so limit the frequency and length of your stay.  When encountering equestrian and hiker traffic DISMOUNT. Equine beasts are super-sensitive and react skittishly to the steel steed.   Common sense will go a long way and help give credence to the mountain bike community. Starting at the Jewel Creek/Spruce Lake Trailhead the trail parallels Gun Creek, subtly gaining elevation through a conifer forest mixed with aspen and cottonwood. There are frequent open areas along the creek to enjoy the view. At Eldorado Creek, cross a small foot-bridge and continue up old forested moraines before rejoining Gun Creek. The route crosses a sturdy bridge and continues up the creek. There may be a few short sections where the bike will have to be pushed.  Across the river, goat trails are identifiable on the cone shaped scree slopes.Crossing Gun Creek again, some elevation is gained until the open slopes of the alpine grasslands are reached. Early in the season this area is lush and profusely flowered. Reaching the junction at 11.5 kilometers, climb a further 200m in 2kms, to reach campsites on the east and north end of Spruce Lake. You may even want to bring your fishing rod.This ride is moderate, scenic and wholly recommended. The trail is completely singletrack with few obstacles. The descent is extremely exhilarating. Your level of excitement will easily prompt joyful whoops to warn the bears of your presence!If you feel strongly about this area give support to the Southern Chilcotin Mountains Wilderness Society, General Delivery, Gold Bridge BC VOK 1PO.",
    "directions": "See description and / or GPS",
    "geohash": "c30",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/393/long_elev.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/393/reg_710320827290da9c014bjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/393/reg_7103363110cf5f2f660ojpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/393/reg_710369537ccb66fcbb2ojpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/393/reg_7111935960222f2131eojpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/393/reg_711218214dc6998237eojpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/393/reg_7112247763f8b5a63dcojpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/393/reg_711227950cca2f09b28ojpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/393/reg_7112339080da9e6c2d7ojpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/393/reg_Backpacking-aug-13-345-45857.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/393/reg_best2_710325281c2f5b88c71ojpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/393/narrow_map.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/spruce-lake-gun-creek-southern-chilcotin-near-lillooet-bc-393",
    "stats": {
        "Activities": "hike mtn-bike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 5,
        "Time": "6 hrs",
        "Total Distance": "26 km",
        "Town": "Lillooet, BC",
        "Type": "out-and-back"
    },
    "title": "Spruce Lake-Gun Creek - Southern Chilcotin",
    "trail_id": "393"
}