{
    "description": "The Flatiron trail starts as the same trail to Needle Peak, near Coquihalla Summit, but instead of going north to Needle Peak after 3.3km, go west to The Flatiron Mtn, that flat mountain you see on the west side once you get above the tree line. You can see the listing for Needle Peak on Trailpeak.Start at the Zopkios exit (217) on the SOUTH side of the Coquihalla Hwy. Parking can be found on a small overgrown gravel road directly below (north) of the roadwork maintenance shed. Do NOT park in the above area with the sign stating \"Authorized Entry Only\". Winter access to the trail is along the north side and around the back of the works shed. Summer access is a bit west along the overgrown gravel road, directly after crossing a small creek. You will see a green BC Parks sign indicating the beginning of the trail.The first 2 km or so is very steep, in the 150 m/km range, but then levels off as you get to the top of the trees and above the tree line. The view of Yak Peak at this level is spectacular, so take time to turn around when taking a rest. As a bonus, you see the highway at times, well below, with the trucks moving like caterpillars, and the cars of course buzzing by like fleas. As the trail starts to level off, continue heading south along the ridge over granite and heather coated meadows. You will see a couple small cairns along the way to point yourself in the right direction, as well as orange trail markers nailed to trees. Eventually at the 3.3 km mark, you will reach a wide open clearing with a very large cairn in the center. On it will be a green BC Parks plaque noting the directions of the diverting trails. At this point, you will want to head right/west along a small goat path that descends onto the col between Needle and Flatiron. The trail is easy to follow, but will be marked with pink and orange trail tape. Take care in a few sections that are a bit exposed to cliff edges. After 1.5 km you will start to ascend into Flatiron's cirque which contains a small alpine lake and flat areas suitable for camping.Flatiron can be summitted on either the north or south-east side off the lake, and is an easy scramble. The top contains a communications tower and couple small tarns, as well as a spectacular 360 view with Needle Peak in prominence.Driving",
    "directions": "From Hope, drive north on Hwy 5 (Coquihalla Hwy), approx 45 km to exit 217. Stay on the south side (there are washrooms on the north side, accessible by a tunnel under the Hwy), park out of the way in the works yard.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/3954/reg_FlatironCaBigRock5859-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3954/reg_FlatironCoqMtn5836-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3954/reg_FlatironEastBowl5839-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3954/reg_FlatironLunchShelter5823-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3954/reg_FlatironMtn5835-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3954/reg_best1_FlatironNeedle5842-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/3954/narrow_FlatironYakPk5819-7359.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/the-flatiron-near-hope-bc-3954",
    "stats": {
        "Activities": "snowshoe hike ski-bc",
        "From": "",
        "Seasons": "winter summer",
        "Stars": 4,
        "Time": "5 hrs",
        "Total Distance": "11 km",
        "Town": "Hope, BC",
        "Type": "out-and-back"
    },
    "title": "The Flatiron",
    "trail_id": "3954"
}