{
    "description": "l?Escapade is a trail just west of Montreal. It is in Rigaud, near Mont Rigaud just out of town -- it's a perfect XC gem and discovery. The trail is groomed for 2 tracks every Thursday and the day after a storm. The trail is basically a loop with rolling hills, there is the option to start at the bottom and ski up the hill to the loop from 2 locations (but don't do this if you are skiing -- it's better to park at the upper parking lot of Bourget). Doing the basic rectangle is about 14kms. Starting from the bottom and then skiing the loop makes it about 20kms. There are picnic tables around the trail, very good trail maps at all the starting points and throughout the trail. The picnic tables are now completely buried under snow and difficult to find. There are a number of view points, the main one being on the south side of the trail giving views, when clear, of the St Lawrence river and further into New York State.Information and a trail map can be found here (French):http://ville.rigaud.qc.ca/index.php?q=attraits-evenements_escapade_sentiersThe loop has some advanced (steep) uphills and downhills -- but overall the grade is gradual. There is also a branch off the trail (look at the lower left corner of the box) where you can get some extra kilometers in, as the trail runs to a large hydro cut past a lake.  If you tack this on, you could be skiing for an extra hour.  We did so unintentionally as it was getting dark and we missed the turn to \"cabane au sucre\" as we kept to the groomed high ground.  So it may seem simple, but take a map with you. You will feel like you are in wilderness, however, there are estate homes dotted along the route --in just a few places.  You do have to cross a road a few times to complete the loop.  See the Satellite / GPS map.",
    "directions": "There at least 4 places from where you can start, probably the most popular is to start at the Sucrerie de la Montagne where there is a very large parking area and taffy on the snow after you're done.From MontrealFollow Autoroute Félix Leclerc - Highway 40West DirectionTake the Exit 17 (Montée Lavigne)Turn left Montée Lavigne for 2 kilometersTurn right St-Georges Road for 6 kilometersSucrerie de la Montagne will be on your right300, rang St-Georges, Rigaud.",
    "geohash": "f254",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/QC/3957/reg_rigaud-0646-0.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/3957/reg_rigaud-4879-0.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/3957/reg_rigaud-4881-0.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/3957/narrow_rigaud-0648-0.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/3957/narrow_rigaud-0651-0.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/escapade-rigaud-xc-near-rigaud-pq-3957",
    "stats": {
        "Activities": "snowshoe hike ski-xc mtn-bike",
        "From": "",
        "Seasons": "winter fall summer",
        "Stars": 5,
        "Time": "3 hrs",
        "Total Distance": "22 km",
        "Town": "Rigaud, PQ",
        "Type": "out-and-back"
    },
    "title": "Escapade - Rigaud XC",
    "trail_id": "3957"
}