{
    "description": "This trail is an excellent mountain bike trail for those who love the freeriding. It is mainly a feature trail consisting mainly of features, but little terrain. Not too technical.It takes about 15 minutes to get up to the trailhead from the main road, and depending on how fast of a biker you are it can take from 10 minutes to half an hour to get down the trail. There are many man made features such as ladders, skinnies, and huge gaps. There is a gap called the 40-footer. Technically it is 35 feet, but there is a gap. It is not that steep, but near the end of the trail it gets fairly steep. Can be worn down quite alot because of the previous mountain bikers. All features can be avoided by side trails, so no making way through the bush anymore.",
    "directions": "Eastbound, Westbound to Chilliwack to Dilemma, Vedder Mountain:\rFrom Trans-Canada Highway 1 Westbound, take Vedder Rd exit and go south on Vedder Rd. Go all the way down on Vedder Rd and cross the Vedder River Bridge, and turn left towards Cultus Lake on Columbia Valley Highway (Rd.) Go down on the road until you see the Vedder Mountain FSR (Forestry Service Road), and turn right onto it. Go up the FSR until you see the 1st gate (past the gravel pit)  and turn right on the road before the gate. Depending if you are leaving your truck at the gate or taking it up and hiking to get it. Go up the gravel road until you see the Dilemma trailhead (sign posted) and start from there. Then enjoy the trail.",
    "geohash": "c29",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/3967/reg_IMG-0096-11526.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/vedder-mountain-dilemma-near-chilliwack-bc-3967",
    "stats": {
        "Activities": "mtn-bike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 5,
        "Time": "1 hrs",
        "Total Distance": "0 km",
        "Town": "Chilliwack, BC",
        "Type": "out-and-back"
    },
    "title": "Vedder Mountain - Dilemma",
    "trail_id": "3967"
}