{
    "description": "This trail is a portion of the Appalachian Trail in The Great Smoky Mountains National Park.  The trail is not a loop (straight out and back), but can be made into a loop if you use other trails (makes for a much longer hike).  The trail is moderate in difficulty during snow and ice free months.  I hiked it in mid-March and there was a bit of ice on the trail in some spots.  The hike is 8 miles or 12.5 kilometres and has an elevation gain of just over 300 metres or 1000 feet.  The view is great along most of the trail.  The highest point on the hike is near the Icewater Spring Shelter.  The trail eventually leads to Charlie's Bunion, an interesting geologic formation that provides a spectacular view of the surrounding area.\nIt took me 1 hour and 40 minutes each way to hike this trail.  With stops at Charlie's Bunion and a few other vantage points it took nearly 4 hours total.\nI have provided the GPS tracks for the outbound portion of the trip, to return to the trailhead use the same tracks.",
    "directions": "From Gatlinburg, TN or Cherokee, NC take US 441 up to Newfound Gap.  Park in the parking lot that straddles the Tennessee/North Carolina border.  The trailhead is located at the east end of the parking lot",
    "geohash": "dnkd",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/TN/3989/long_2008-03-15-353-10307.jpg",
        "https://trailpeak.com/storage//content/trails/US/TN/3989/long_Charlies-Bunion-10307.jpg",
        "https://trailpeak.com/storage//content/trails/US/TN/3989/reg_2008-03-15-359-10307.jpg",
        "https://trailpeak.com/storage//content/trails/US/TN/3989/reg_best1_2008-03-15-336-10307.jpg",
        "https://trailpeak.com/storage//content/trails/US/TN/3989/narrow_2008-03-15-358-10307.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/charlies-bunion-near-gatlinburg-tn-3989",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 5,
        "Time": "4 hrs",
        "Total Distance": "13 km",
        "Town": "Gatlinburg, TN",
        "Type": "out-and-back"
    },
    "title": "Charlie's Bunion",
    "trail_id": "3989"
}