{
    "description": "Photos by Greg Maurer of www.alpenglowpro.com. Photo Workshops, Limited Edition Prints and Panoramas.\nWaterfall spray and open alpine with thick heather, musky fragrance, brought by the cool draft of high snowy slopes bath your skin;  beauteous tent platforms are perched on the edge of an azure sky, all grant a sweet absolution for your sweat - you have to pay for great rewards. You'd expect no other deliverance from Princess Louisa Inlet, a hidden coastal appendix guarded by precipitous granite walls and tidal rapids.\nSkill with a compass, map and a handheld GPS will help you on your way, for the trail becomes sketchy with goat fur on the occasional stunted fir the only marker. Light mountaineering skills for at least one in a party is mandatory for the completion for this rewarding traverse which includes a smattering of glacial travel and a scramble ascent of a 1950 metre summit (technically unnamed but known as 'Sun Peak'). Wait for a crisp September high-pressure weather pattern and you'll be set for a very full four-day or a less hectic weeklong trip.\nThis is a point-to-point trip, from tide-water to alpine, through remote wilderness with no resources. You will have to arrange for pickup on the Sims Creek/Elaho River side. Be self-sufficient in case the unthinkable happens. Have adequate skills in carrying a multi-day pack that might include light mountaineering gear like an ice axe, crampons and one rope per party. People with more experience might carry less.\nElevation Gain - 2100 metresHigh Point - 1950 metresTime Needed  4  -  7  Days:  multi-day  back pack\nMapsFederal Topographic 92 - J4, 92-J5                Description - Step by Step for Success\nTravel to the small coastal village of Egmont on the Sechelt Peninsula via Horseshoe Bay and Highway 101.  Bus transport may arranged in Vancouver.Take a water taxi or charter a flight to the head of Princess Louisa Inlet and camp at the provincial campsite at Chatterbox Falls. \nFollow the obvious trail out of the campsite. The trail quickly gains elevation and deviously finds a way through granite bluffs and old growth forest. This is somewhat like Vancouver's Grouse Grind but only longer and more scenic. Take your time. Midway you reach a great waterfall that can provide an excellent shower. Further along a short scramble through a granite bluff will take you higher into the forest. If you tire there are a few places to camp enroute. Near tree-line the trail crosses into a boulder choked gully where one particularly awkward boulder requires either some worming through a hidden tunnel or a climbing move over the front. There is even a rope in place.\nBe patient; the alpine is close at hand. Congratulate yourself for climbing 1300 vertical metres with a heavy pack and appreciate the vista. Follow the trail and gain about 30 metres elevation in the next kilometre or so to Loquilts Lake. Spend the night here; you have earned it.\nThe glacial topography in the area is unique; providing great examples of glacial molding and plucking. Plan to spend a night at the lake. You may want to use Loquilts as a base camp for further exploration for a few days or follow a cairned route north though the headwall to camp on the upper granite apron at the twin alpine tarns less than a kilometre northwest (approximately 200 metres vertical). Lots of rambling in the area should you decide to do either. The youth camp at Malibu Rapids occasionally has a group camping at Loquilts Lake.\nFrom the granite apron follow a sketchy path through steep meadows traversing to an obvious glacial moraine. Follow the moraine until the small glacier (which originates on the east flanks of 1950m ?Sun Peak? on your left) plateaus. Cross here and aim for the rocky outcrops on the north side of the glacier. Head up the snow/minimal ice (depends on the previous year's snow pack) toward the rocks that come off Sun Peak's short north ridge. Drop your pack and scramble to the summit.\nDescend the snowy slope to the east, stay right and cross the bouldery glacial terraces north, staying relatively high before you reach heathery ridges. There are no markers here and, at the time of writing, no cairns. The route-finding though is pretty straight forward. On the east side of the heathery ridge there are perfect granite tent platforms. So spend a night or two here and marvel at your position.\nDescend off the ridge northeast being careful of steep snow initially and then hard packed steep rocky meadow. Keep right, and then traverse left into gullies aiming for a large tree-line tarn. After a short swim to wash the sweat and fir needles from your back, pick up a steep marked trail that descends into the Sims Creek Valley for an arranged pickup to Squamish and Vancouver.\nContacts:\nEgmont Water Taxi 604-898-8454, for a guided excursion.",
    "directions": "See description and / or GPS",
    "geohash": null,
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/399/reg_plouisa.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/princess-louisa-to-sims-creek-traverse-near-powell-river-bc-399",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 5,
        "Time": "28 hrs",
        "Total Distance": "30 km",
        "Town": "Powell River, BC",
        "Type": "out-and-back"
    },
    "title": "Princess Louisa to Sims Creek Traverse",
    "trail_id": "399"
}