{
    "description": "A great all-year-round trail and the overwhelming choice for those learning to ride on the North Shore.\nIt's mostly flat (well, when compared to the rest of the Shore). Its other advantages include: you share the same parking lot with the hucksters; the bridle path has a few ladders; some technical climbs; and some tricky slopes; but won't get you into trouble like some of the more difficult trails.  You'll see lots of other riders on this trail as most other trails on Seymour dump out onto it (e.g. Pangor, Severed, Boogey), so you get to reconnoitre the Shore!\nRide this trail over and over until you master some of the obstacles, then graduate yourself to Severed Dick, Ned's, or team Pangor or Corkscrew.\nFrom the parking lot, proceed up the trail \"Old Buck\", but fortunately you don't have to grunt up the whole way with the rest of them accessing Ned's, Severed, Pangor, and Boogeyman. Instead, just past the first gate, you will see a turnoff onto the trail called \"Bridlepath\" - take it!\nA great trail with a taste of the Shore.  As you follow it along, you will have a few nice uphill sections where you can practice your technical ascents, and a few nice rooty slopes down.  A stream to cross, and then you eventually get to a fork in the trail. To continue straight seems that you are going up a streambed.  This is actually the bottom of Severed Dick, and one day, you will ride this out!  But for now, other than riding up Severed for a bit, turn left at the big dirt mound, and cross another little stream and rock area.  See if you can ride it.\nNow you are on the trails that connect you up to Wills Way (another left) for which you will see a sign.  That eventually dumps you out on Hyannis Drive, and you can take the road home, or, you can reverse your ride for some more fun.  Do this trail over and over, and before long you'll be heading up the mountain. If you own a GPS unit, or even if you don't, click on \"Download GPS\" for a preview of the trail which you can load into your GPS unit. Since it includes some of the road, it may be helpful for those visiting Vancouver in finding the absolute best place to ride in the world!\nDirections from Vancouver:Take the Second Narrows Bridge to North Vancouver, Shortly after crossing, look for signs to Mt. Seymour Parkway, on the right, Follow along Mt. Seymour Parkway, approximately 5 km, looking for Mt. Seymour Road (takes you up to the ski hill if you were to take it all the way). There is Northhlands Mall, at the intersection,Just under a kilometre up Mt. Seymour Road, look for a turnoff on the left for \"Northlands Golf Course\".On the immediate right, is the parking lot, probably full of riders.For shuttlers, leave one car here and take the other up to the upper parking lots (above Neds), or further, above CBC!",
    "directions": "See description and / or GPS",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/401/topo_Bridletopo.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mt-seymour-bridle-path-near-north-vancouver-bc-401",
    "stats": {
        "Activities": "mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "4 km",
        "Town": "North Vancouver, BC",
        "Type": "out-and-back"
    },
    "title": "Mt. Seymour - Bridle Path",
    "trail_id": "401"
}