{
    "description": "S-- Boy has a gentler entry than S-- Girl, although both depart from essentially the same area and end up on essentially the same part of the lower Cypress Mountain.\nTo get to --- Boy, take the Cypress Parkway up the mountain to the third switchback, where there is Provincial Park parking.  This is one switchback past the lookout that many drive by. The Provincial Park lot also has a lookout, but you have to pull off the road and drive through the trees a bit.\nIf shuttling, park here; if riding up, it is this corner, on the far side of the road, behind the concrete barrier that S--- Boy starts.  Starting from above the switchback, enter in behind the barrier, and follow the thin sandy trail right snug against the barrier.  With a keen eye on the right, you will see two trails more than halfway around the switchback, but while still behind the barrier.  The first is --- Girl, the second, sboy.\nRocky trails, steep descents, definitely advanced, with lots of switchbacks.\nMy wheel pancaked half way down, so I hope you can take these directions, and the attached GPS points if you have a GPS unit, and you'll have no problem finding the trails.  s Boy dumps out on the road; ride or shuttle back up.  s Girl intersects another trail at its end; turn left and follow it out to rejoin sBoy, or keep going and you'll eventually hit the road. Click on GPS download above to see a rough entry map (only of the parking and entrance area).  Point 002 is s Girl, and just past that you'll see two overlapping tracks heading off the switchback (and some single dots down the switchback - ignore) , and this is s Boy.  Waypoint 003 was marked in a clearing just into s Boy, so that may help you also. Again, my wheel broke, so you see a very short GPS track but enough to get you on the trail.  Steep, rocky and fun!\nTrail Descriptions for Cypresss Mountain trails for moutain biking can be found here.\nDirections from VancouverTake the Lions Gate Bridge, and head to West Vancouver (or follow the signs to Whistler).After looping around the bridge exit to head West on Marine Drive, just a few hundred meters along, you turn right and drive up Taylor Way Up the hill, stay left and get on the Upper Levels highway (99) heading in the Whistler directionNow, just a few kilometres along, and you'll see the turn off to 'Cypress Bowl Ski area'; take this.  This also leads to Cypress Provincial Park, which is a large part of the mountain.It's flat for a bit, and then as you pass the maintenance yards on the right, you are essentially entering the park.Start counting switchbacksPark at the third switchback.   As you turn the corner, there is a large parking lot on the right, don't miss it.",
    "directions": "See description and / or GPS",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/402/narrow_wiilf1.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/cypress-mtn-s-boy-s-girl-near-north-vancouver-bc-402",
    "stats": {
        "Activities": "mtn-bike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "1 km",
        "Town": "North Vancouver, BC",
        "Type": "out-and-back"
    },
    "title": "Cypress Mtn - S-- Boy & S-- Girl",
    "trail_id": "402"
}