{
    "description": "Bear Mountain is a sweet downhill ride that really flows. It's actually closer to Mission than Abbotsford.  Lots of burms, a few table tops and lifts, nothing too technical (but of course that all depends on your speed), and not too steep.  A real joy to ride.  \r\n\nYour best bet is to park at the entrance to the trail, and walk your bike up the trail; it's not too steep--about 30-40 minutes uphill. You reach a clearcut up top, and that's when you take a break and get ready to ride down (10-15 min.)\r\nDirections\nTo get to Bear mountain, take Dewdney Trunk Road after following the Loughheed Highway as far as you can East out of Coquitlam (i.e. not your first turnoff on Dewdney Trunk Rd.). Directions are as if you were driving to the Mission Woodlot (another amazing place to ride), but keep going on Dewdney Trunk Road.  You will drive over the Hayward resevoir (dam); keep going. When you reach the Bear Mountain area, a few kilometres later, you will see a small lake on your left and a parking area just off the road, and a sign for the Bear Mountain trails. If you go too far, you will see some signs for the nearby Lafarge Gravel pit also on your left.  Opposite the trail area is a gun club (this is rural). The Red Mountain cross-country bike trails are also on the other side of the road. Of course, purchasing a $190 GPS unit will also allow you to download the co-ordinates from the 'GPS download' option above, and, you can use that in your car to \"hone in\" on the trail; very convenient.  Click on \"Download GPS\" to see a preview of the trail and GPS data you can download free from us.\r\n\nYou can also approach from the other direction, from Mission itself. Take Hwy 1 from Vancouver, then Hwy 11 into Mission.  Bear right in Mission, head up Grant, left on 7th, and then right on Cedar.  From Cedar, go left on Dewdney Trunk Road, and now look for Lafarge signs on your right as you curve into the area.\r\n\nElevation gain is only 220 meters.  You can do this a couple of times.  Notice there is no shuttling here, so it's you and your bike, but it's not that steep that walking up is a problem, and there are some flat sections (few). The trail is a really nice change from the Shore, very flowy, so you can keep your speed up.  They have races here every year in late May. Check them out.\r\n\nOther:\n\r\nThe top of the trail (where you turn around) is a clear cut area; see picture below. You can ride up the gravel road to this point, by continuing on Dewdney, and turning left up the back-road, then another left, if I remember right.  Anyway, there is a gravel road up; ask riders at the bottom.  We simply hike-a-biked up the trail.  Not so bad.\r\n\n\nBear Mountain - Mission, B.C., Canada\n\nBear Mountain 2005 DH Helmet Cam\n\r\nmore mountain biking videos can be found here",
    "directions": "See description and / or GPS",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/414/topo_jay1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/414/reg_beartopo.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/414/reg_park.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/414/reg_top0001.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/bear-mountain-near-abbotsford-bc-414",
    "stats": {
        "Activities": "mtn-bike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "1 km",
        "Town": "Abbotsford, BC",
        "Type": "out-and-back"
    },
    "title": "Bear Mountain",
    "trail_id": "414"
}