{
    "description": "\r\nIn the middle of Manning Park is the Manning Park Resort, which is a great starting point for a range of activities. During the wintertime, Manning Park Resort offers some of the best cross-country skiing near the lower mainland. As the summer approaches there is a great summer campsite for RV'ers and campers with all the luxury trimmings you want the last day of a week of hiking. As well it is a good starting point for what is considered one of the best outdoor trips around: The Heather Trail/3 Brothers trail. The Heather Trail is located in Manning Park, named after Ernest C. Manning, who was the Chief Forester of British Columbia from 1935 to 1940. The park has 66,500 hectares of the best hiking Mother Nature can offer. Come in mid July, and find that the flowers are blooming all around you to the point you don't know were to put your feet. It literally looks like a wall-to-wall carpet of differently coloured flowers. Another difference is that you are actually starting to hike at the 2,000 meter level, and the elevation gain is a lot less than most other hikes which may take you to this altitude and alpine scenery.\r\n\nThe Manning Park Resort also has a little convenience store, a cafeteria, a restaurant and a great pub.  \r\n\nHow to get to the Manning Park Resort/ Trail Head to the Heather Trail\r\n\nManning Park Resort is in the middle of the Hope Princeton Highway approximately 45 minutes drive from Hope. Coming from Princeton you will find Manning Park Resort approximately 15-20 minutes after passing the East Gate community. Once at Manning Park Resort make a right turn coming from Hope, and proceed up to the Microwave Tower. Just a minute before you reach the top of the Microwave Tower is the trailhead that I recommend using to enter the Heather trail; it's on the left side of the road. The other option is to continue to the top, but this leaves a bit more elevation to gain on your return.\r\n\n\nThe Heather Trail\r\n\n\nDistance above (44 km) is return.\r\nOnce on the trail you will loose 400 feet in about one hour before you reach the Buckhorn Campground after 5 km. The trail to Buckhorn Campground is more like a double track highway, but this will disappear from your mind as soon as you start to see the views on your left side (west). Leaving the Buckhorn Campground, you start on the only real elevation gain on your way to either the First Brother or Nicomen Lake. During the next 2 km you will gain about 1,000 feet, but once there you will find the sweat is a small price to pay for what will meet your eyes. Rolling meadows of an endless amount of blooming flowers for miles on end. Now the trail is close to flat with some minor elevation changes (+/-500 feet over 10 km).  At 10 km, and after around 2.5 to 3 hours of hiking, you get to the intersection of the trail going to the First Brother. At this point you have to make a decision. Going up to the First Brother and back can be done in a day, no problem. If you plan to stay overnight at the Kicking Horse Campground, going up the 1 km to the peak of the 7,452 feet First Brother is a super option. If you only have 2 days, and want to go to Nicomen Lake you should envision how it would be on the top rather than finding out first hand. The hike from Kicking Horse to Nicomen Lake is a good 4 hours, and Nicomen Ridge is longer then it seems. \r\n\nFrom the intersection of the trail to the First Brother it is another 45 minutes/3.5 km to get to the Kicking Horse Campground. To get to the campground, make the left turn off the trail. The campground has wooden platforms to pitch the tent on. The campground itself is situated in a drop-off between to ridges by a stream. If you decide to camp at Kicking Horse, you should arrive early, as this is a very popular campground being in such great scenery and only 13.5 km or 4 hours away from the trailhead.  If you decide to continue, you should make sure that you fill up your water bottles before you leave the campground. This is also the half way point to Nicomen Lake, but continue on for another 45 minutes to an hour before you sit down for a longer break. When you leave Kicking Horse you start to gain some of the elevation you just lost going down to the campsite. Just after the first kilometre, you will once again be in a pristine alpine landscape. Continuing to the top of this hill, you will find the perfect spot for a lunch or just sit down and enjoy the view.\r\n\nAfter leaving your lunch spot on the top of this ridge you will hike around it slowly turning around the end and down a gully. At the bottom of the gully you have again lost some 300-400 feet, which you will regain immediately going up to the beginning of Nicomen Ridge. To get to the Nicomen Lake Campground, follow the ridge to the end, and then descend the 600 feet to the lake. It will take you some 1.5 to 2 hours to reach the end of the ridge, and another 20-30 minutes to the lake campground. It will take you around 4 hours from Kicking Horse Campground, and you have hiked 22 km from the trailhead. Once you have reached the campground you will find that this site is not crowded whatsoever. In fact you have finally reached a place were you will find that peace and quietness you have sought. There are numerous campsites around the lake, so take the time to find a good one, and don't take the first one you see.      \r\n\nMiscellaneous Links:  \r\n\n BC Parks: Manning Park \n Manning Park Resort",
    "directions": "See description and / or GPS",
    "geohash": null,
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/417/long_n877365472-1000361-3186-3127.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/417/reg_Kileythepackdog.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/417/reg_ManningOverview.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/417/reg_NicomenRidge.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/417/reg_Trailto1stBrotherPeak.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/417/reg_UpFromNicLake.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/417/reg_campatNicomenLake.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/417/reg_n877365472-990403-9089-3127.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/417/reg_n877365472-990478-3155-3127.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/417/reg_n877365472-995617-1446-3127.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/417/reg_n877365472-996222-693-3127.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/417/reg_n877365472-996223-977-3127.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/417/reg_n877365472-996313-4509-3127.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/417/reg_n877365472-999167-1567-3127.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/417/reg_viewalongtrail.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/417/topo_FlowersHeather2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/417/topo_Trailto1stBrotherPeak.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/417/narrow_FlowersHeather.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/417/narrow_n877365472-990409-507-3127.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/417/narrow_n877365472-995614-153-3127.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/417/narrow_n877365472-996322-3783-3127.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/heather-trail-near-hope-airport-bc-417",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 5,
        "Time": "8 hrs",
        "Total Distance": "44 km",
        "Town": "Hope Airport, BC",
        "Type": "out-and-back"
    },
    "title": "Heather Trail",
    "trail_id": "417"
}