{
    "description": "The Monadnock-Sunapee Greenway Trail is 51 miles long and runs from Mount Monadnock north to Mount Sunapee. The trail was constructed by the Society for the Protection of New Hampshire Forests and the AMC and is currently maintained by The Monadnock-Sunapee Greenway Trail Club. The club has published a trail guide book and map - go to www.msgtc.org.\nThe trail crosses over a significant number of roads and over more than 80 private landowner's properties. Please be respectful of private property, Pack in - Pack out, and take only pictures. Because of the large number of road crossings this trail is perfect broken up into day hikes and there are 6 approved campsites along the trail so it's also perfect for a through hike. Take your pick and enjoy a small piece of southern New Hampshire.\nSection One - Monadnock to Route 101\nThe southern terminus of the trail is actually at the summit of Mount Monadnock so take your pick of trails to get to the summit. You can camp in Monadnock State Park and take any of the numerous trails to the summit. I like to park at the trailhead on Shaker Road and take the Marlboro Trail up to the summit. It's 2.1 miles long and this distance is in addition to the trail length of 6 miles for this section - so plan your day accordingly. It's always windy at the summit so bring a windshear jacket.\nFrom the summit head north on the Dublin Trail over the ledges. You'll go through a spruce and fir forest and then a maple and birch forest. You reach Old Troy Road in 2.2 miles from the summit. Head east (that's a left turn for those that are direction challenged) and follow the road for 1/2 a mile. Watch for the trail sign and head north (right) into the woods. It starts off as a nice mixed hardwood and softwood forest in this tract and ends up in a really nice hemlock stand. Follow the blazes carefully as you go on and off some old logging trails and cross a couple brooks in here. At the 3.6 mile mark you'll come to Old Marlboro Road. Head east (right) and follow the road for 1/3 of a mile. At the 4.0 mile mark you'll head north (left) into a hemlock stand. Again, watch carefully for the trail blazes. You'll go by a little vista southward of Monadnock, a bog area, an old woodshed, and a beaver dam and finally emerge on Route 101.\nEditor's note: Attached GPS data is just from a parking lot South of the summit to the summit & back via a different route, not for the whole trail, nor even the first section described herein.",
    "directions": "Begin: Take Route 101 into Dublin. At 0.2 miles west of the Dublin fire station take Upper Jaffrey Road into Monadnock State Park.\nEnd: The Route 101 crossing is 4 miles west of the fire station in Dublin and 4 miles east of the junction of 101 and 124 in Marlborough.",
    "geohash": "drse",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/NH/4174/reg_2006-Mount-Monadnock-011-16310.jpg",
        "https://trailpeak.com/storage//content/trails/US/NH/4174/reg_2006-Mount-Monadnock-012-16310.jpg",
        "https://trailpeak.com/storage//content/trails/US/NH/4174/reg_2006-Mount-Monadnock-020-16310.jpg",
        "https://trailpeak.com/storage//content/trails/US/NH/4174/reg_2006-Mount-Monadnock-031-16310.jpg",
        "https://trailpeak.com/storage//content/trails/US/NH/4174/reg_2006-Mount-Monadnock-035-16310.jpg",
        "https://trailpeak.com/storage//content/trails/US/NH/4174/reg_IMG-6194-16310.jpg",
        "https://trailpeak.com/storage//content/trails/US/NH/4174/reg_IMG-6206-16310.jpg",
        "https://trailpeak.com/storage//content/trails/US/NH/4174/reg_IMG-6209-16310.jpg",
        "https://trailpeak.com/storage//content/trails/US/NH/4174/narrow_Monadnock-Sunapee-Greenway-13176.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/monadnock-sunapee-greenway-trail-section-1-monadnock-to-route-101-near-dublin-nh-4174",
    "stats": {
        "Activities": "snowshoe hike ski-xc",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "5 hrs",
        "Total Distance": "10 km",
        "Town": "Dublin, NH",
        "Type": "out-and-back"
    },
    "title": "Monadnock-Sunapee Greenway Trail - Section 1 - Monadnock to Route 101",
    "trail_id": "4174"
}