{
    "description": "Note: Attached Google Earth view shows you the trail network map in 3D (GPS'd). You can also download the GPS data for this trail network and place into your GPS to see your location versus the trail.Over the past few years the Ledgeview area has been developed into a virtual mountain bike park. This central Fraser valley 500 metre hill (McKee Hill), has been transformed by the local mountain bike community into an area networked by snakey, smooth, singletrack providing great cruising and other trails with the technical difficulties of challenging stunts. The loop riding here is varied, fun, short and extremely worthwhile. You'll want to do laps, for sure.  A mixture of old doubletrack that previously existed as old skid and 4x4 roads provides access to the summit and challenging singletrack wanderings. All motorized road activity has been stopped by concrete barriers which makes this area especially appealing to ride.McKee is one of the most southerly foothills of the mountains that make up the Coast Ranges to the north. Its geology is the result of glacial compression. The sandstone and conglomerates that predominate have been deposited by various glacial advances, the last being about 10,000 years ago. The conglomerates contain a matrix of pebbles and sandstone that have been compressed to the consistency of concrete. The traction on this surface is great even when wet.  Beware however of the pure sandstone rifts which are about as smooth as a baby's bottom. When wet, these are deadly. Algae have penetrated the surface making it super slick. Park above Ledgeview Golf  Course near the water tower. The main primitive road starts on the south side of the road and leads to the summit in 3 Km.  The Buttafuoco Trail is one of the old standbys of Ledgeview and has been renamed and split into several different trails. Two in particular right off the summit:  Little Butt which is easier and to the right, and the difficult start of Main Butt off to the left.You'll know you're on the short Main Butt because it starts with a steep drop leading to an even more dramatic several metre plunge over a conglomerate overlap. These technical challenges are the crux of the ride.  Both Butts converge into Upper Paper RouteExcellent viewpoints show Sumas Prairie and Mt. Baker.Take care here, for the viewpoint is directly below a chute and not fenced. Should you not stop, this ultimate drop will have you marveling at the view while airborne. The elevation loss over the cliff is more than 200 metres which should give you about 4 seconds to locate a good place to crater. Continue left traversing around the McKee's north side (Upper Paper Route to Lower Paper Route - part of Old Buttafuoco) through  beautiful deciduous forest. The trail descends with roots, logs, small drops and chutes providing technical challenges. Don't consider this ride if it is wet unless you like wipeouts. Buttafuoco was a slimy New Yorker; at times this trail can be a real pig-dog. When it's dry it might be called the Buffa-fuoco.    Approach From Vancouver travel Hwy 1 (Trans-Canada Hwy) and take theSumas Exit 92 and turn right toward Mission. Travel  1.3 km and turn right. In 2 km at the top of the hill take the Old Clayburn Road exit and turn right. Follow Old Clayburn Road for 2 km and turn right onto McKee Way. Turn left on to McKee Road at the top of the hill. Follow McKee uphill past the Ledgeview Golf Course for 2 km  and park.   Ride0km\t200m\tHead  right onto a primitive skid road and travel uphill0.5km\t250m\tKeep right and follow the main skid road2.8km\t450m\tGrassy meadow3.0km\t500m\tSummit left to Buttafuoco.",
    "directions": "See description and / or GPS",
    "geohash": "c29p",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/420/long_30footjumppicJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/420/long_35-sequence-16491_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/420/long_aah-16491.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/420/long_da-plow-picture-11907.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/420/long_logdroppicJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/420/long_penis-pincher-picture-11907.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/420/long_ryan-ahh-16491.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/420/long_under-picture-11907.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/420/long_woodjumppicJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/420/reg_HPIM0336-11907.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/420/reg_IMG-3939LB-33816.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/420/narrow_IMG-0226-11634.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/420/narrow_rocky11n.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/420/narrow_rocky2n.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/420/narrow_rocky7amy.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/420/narrow_rocky9n.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/ledgeview-abbotsford-near-abbotsford-bc-420",
    "stats": {
        "Activities": "mtn-bike",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 5,
        "Time": "2 hrs",
        "Total Distance": "8 km",
        "Town": "Abbotsford, BC",
        "Type": "out-and-back"
    },
    "title": "Ledgeview - Abbotsford",
    "trail_id": "420"
}