{
    "description": "A great high-speed rush of adrenaline.  If you are sitting at home and want to go for a great ride, come to Ned's.  It is very versatile, and even a novice rider can ride most of it but really slowly.  A good rider can do everything at about 30 km/h.\nIf you go slowly, watch out; you may get run down by out of control bombers!",
    "directions": "Right near the mushroom parking lot on Mt. Seymour.  Just follow the people since it starts right at the road. You basically cross the road and enter the trail just opposite and over the concrete road barrier. To get to the parking lot itself, it's up Mt. Seymour (as if you were going to the ski hill) and, after a number of switchbacks, you'll see the parking lot on the right. Others ride up Old Buck, and then continue on past the power lines and straight up that rocky gully trail (that no one rides down).  That'll get you there too.  Or hang out at the bottom Seymour parking lot and catch a shuttle ride.  Or offer one. Please see this trail entry for the 'tour' of Seymour which has all the trailheads GPS'd out, and how to connect to the other trails like Corkscrew/Pingu.\nTry going down Corkscrew, and then taking the cut-off to the right instead of going down the rock wall stairs :-(), pictures courtesy of  Todd Davidson.",
    "geohash": "c2b89",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/421/reg_marlandsit.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/421/topo_markusonneds.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/421/narrow_bc_brynlog_m.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/421/narrow_bc_creekcrossclose_m.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/421/narrow_bc_holedrop_m.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/421/narrow_bc_steepdrop_m.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mt-seymour-neds-atomic-dust-bin-near-north-vancouver-bc-421",
    "stats": {
        "Activities": "mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 5,
        "Time": "1 hrs",
        "Total Distance": "2 km",
        "Town": "North Vancouver, BC",
        "Type": "out-and-back"
    },
    "title": "Mt. Seymour - Neds Atomic Dust Bin",
    "trail_id": "421"
}