{
    "description": "Abbot Pass Hut, Mt. Victoria, Yoho and Banff National Park.This National Historic Site gives access to classic mountaineering routes on Mts. Victoria and Lefroy. Also used as a destination in itself. Summer access involves a 3-6 hour steep hike. Not used in winter. Class A, sleeps 24. This delightful stone cabin is certainly the most unique of the ACC huts, both for its location and design. Sitting astride the wind-swept crest of Abbot Pass at the impressive height of 9,598 feet, it is second only to the Neil Colgan hut as the highest permanent structure in Canada. Built in 1922 and earning a rich history ever since, this hut makes a perfect base for mountaineering attempts on Mts. Victoria and Lefroy or as an objective for strong hikers and scramblers.Remember- you are entering an alpine environment. Appropriate knowledge, equipment and safety precautions are required.GPS Coordinates: 51???21'54\"-116?17'12\" NAD83 11U 549660 5690657For detailed information please visit the ACC hut webpage.",
    "directions": "There are three approaches to Abbot Pass in the summer, two of which require technical skills and experience. The easiest and most logical way is to approach from the Lake O'Hara side, hiking the scenic trail to Lake Oesa then following the interesting and strenuous route up the wide scree gully which drops directly from the pass. Hikers may opt to take the scheduled bus to  Lake O'Hara. This hut is visited very rarely in winter, and only by extremely experienced mountaineers. One must spend considerable time in avalanche terrain; not recommended.The hut has room for 24 people and has a propane system for cooking and lighting. An efficient wood stove provides the heat.  Alpine Club of CanadaInformation and copyrighted photos used with permission.",
    "geohash": "c",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/4212/long_AbbotPassWaypoints-46717.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/4212/long_Abbott-Hut-from-Google-Earth--46717.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/4212/reg_P1010314-31648.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/4212/reg_P1010315-31648.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/4212/reg_ScreeBelowHut-46717.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/4212/reg_ViewBelowHut-46717.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/4212/reg_abbot-2-8779.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/4212/narrow_P1010299-31648_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/4212/narrow_P1010317-31648.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/4212/narrow_abbott-1-8779.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/acc-abbot-pass-hut-near-field-bc-4212",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 5,
        "Time": "8 hrs",
        "Total Distance": "12 km",
        "Town": "Field, BC",
        "Type": "out-and-back"
    },
    "title": "ACC- Abbot Pass Hut",
    "trail_id": "4212"
}