{
    "description": "Asulkan Cabin is located in Rogers' Pass area of Glacier National Park, BC.\nTerrific base for summer mountaineering and backcountry skiing. Access is a 3-5 hour hike or ski. Class A, sleeps 12. \nThe Asulkan Cabin at Rogers Pass is owned and maintained by Parks Canada. The Alpine Club of Canada takes reservations for the cabin. \nThe cabin is located at the head of the Asulkan Valley, and has about a 3-5 hour approach, longer if there is new snow.\nThe hut is a beautiful panabode style building which sleeps 12. Cooking stove (no oven), lighting and heat are supplied by propane. The hut is stocked with cooking and eating utensils and sleeping pads.\nThe Asulkan Cabin is well situated for skiing in the Asulkan Valley. The Seven Steps of Paradise, Asulkan Pass, Sapphire Col and the Dome Glacier can be reached as day trips from the hut. See also the \nGlacier Crest trail in summer along this access route.\nGPS Coordinates: 51\u009d12'42\"-117\u009d\u009d27'48\" NAD27  11U 467636 5673465\nFor detailed information please visit the ACC hut webpage.",
    "directions": "At the end of the Asulkan summer trail at an elevation of 2100 metres (grid reference MG 673737 on Murray Toft's \"Touring at Rogers Pass\" or topographic map 82N/3) \nSummer parking is at the Illicillewaet campground. You can drive here from Golden or Revelstoke along highway 1 to Rogers Pass.\nVehicles can park at the Illicillewaet/Asulkan winter trailhead parking lot during the winter (500 metres west of campground entrance - the same winter lot as for the Wheeler Hut). \n Alpine Club of Canada\nInformation and copyrighted photos used with permission.",
    "geohash": null,
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/4213/reg_S6000179-14696.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/4213/reg_asulkan-1-8779.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/acc-asulkan-cabin-near-golden-bc-4213",
    "stats": {
        "Activities": "hike ski-bc",
        "From": "",
        "Seasons": "winter summer",
        "Stars": 5,
        "Time": "8 hrs",
        "Total Distance": "16 km",
        "Town": "Golden, BC",
        "Type": "out-and-back"
    },
    "title": "ACC- Asulkan Cabin",
    "trail_id": "4213"
}