{
    "description": "The annual Comox Snow to Surf race has become a classic (20 years running) team event featuring a relay from Mt. Washington to the ocean.  Teams of 8 do the following:\r\n\r\n\r\nDownhill Ski (after running up)\r\nXC ski some beautiful trails\r\nRun (2 legs - i.e. two runners)\r\nMountain Bike\r\nRoad Bike\r\nCanoe\r\n\r\n\r\nFor those who want to practice the route, download the GPS track (yes our team carried a GPS unit and we mapped the route for you!) and follow the route from start to finish!\r\nThe race is held on the April 28 weekend, and this year (2002) was sunny, warm, and just great.\r\n\r\nThe town of Comox is very friendly, clean, and kind of funky. The event itself features a parade, evening party, and post race beer gardens close to where the canoers finish.  A great event, very friendly, very social.\r\n\r\nDon't worry about racing it; there are some top teams that are very good.  But the real goal is to have fun as a team and complete the event.\r\n\r\nMany people go to this race and end up moving to Comox, it is so nice there! Perhaps the secret is out.\r\n\r\nA nice way to do the event is to stay at one of the local B&Bs, and stay an extra day to lollygag in the town, or go mountain biking nearby.",
    "directions": "To get to Comox, take the ferry from Horseshoe Bay (Vancouver) to Nanaimo, then drive north on the main highway (the signs will tell you), o, take the oceanside route and check out Parksville, Qualicum Beach, and a few small towns along the way.  But you won't find anything nicer than Comox/Courtenay, a real community with amenities and outdoor recreation galore.\r",
    "geohash": "c0",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/423/reg_0004.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/423/reg_0005.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/423/reg_0006.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/423/reg_0009.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/423/reg_0010.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/423/reg_canoe.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/423/reg_kurtski.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/423/reg_team.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/snow-to-surf-comox-near-comox-bc-423",
    "stats": {
        "Activities": "river-canoe ski-xc ski-downhill mtn-bike",
        "From": "",
        "Seasons": "spring",
        "Stars": 5,
        "Time": "5 hrs",
        "Total Distance": "0 km",
        "Town": "Comox, BC",
        "Type": "out-and-back"
    },
    "title": "Snow to Surf - Comox",
    "trail_id": "423"
}