{
    "description": "The Lower Seymour Conservation Reserve (LSCR) is located along the Seymour River just north of Lynn Valley on the west side of the river and Blue Ridge on the east side of the river.  The Reserve extends all the way north to the Seymour Dam and fish hatchery.  The LSCR road runs for 10 km from the gates of the Reserve (at the north end of Lilloeet Road) to a point approximately 1 kilometre downstream of the dam and hatchery.  \nThe road is paved and easily cycled, roller bladed, or walked.  It climbs approximately 100 metres to its peak at about the 7km mark along the road, and then descends about 70 metres to its end.  A pretty, unpaved trail continues for about another kilometre up to the Seymour River fish hatchery.",
    "directions": "You can access the LSCR by driving North along Lilloeet Road to its end at the parking lot of the LSCR.  Lilloeet Road meets Hwy 1 (Upper Levels Hwy) near the north end of the Second Narrows Bridge.  Alternatively, one can park at the top of Lynn Valley Road on the west side of the Seymour River and walk across the Rice Lake Road Bridge and into the LSCR.",
    "geohash": "c2b",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/4230/reg_LSCR-Road-13830.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/4230/reg_P1210123-13336.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/4230/reg_P1210127-13336.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/4230/reg_P1210172-13336.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/lower-seymour-conservation-reserve-road-near-vancouver-bc-4230",
    "stats": {
        "Activities": "hike mtn-bike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 5,
        "Time": "1 hrs",
        "Total Distance": "20 km",
        "Town": "Vancouver, BC",
        "Type": "out-and-back"
    },
    "title": "Lower Seymour Conservation Reserve Road",
    "trail_id": "4230"
}