{
    "description": "If you like the grandeur of wild alpine wilderness punctuated with solid granite spires that reach for the sky, this hike will be for you. Outside of Baffin Island in the Arctic, there are few places in Canada that have so many monolithic granite peaks condensed in one area. This 2-hour hike will give you a chance to marvel at the many 3000 metre igneous uplifts present in this part of the Purcell Range.\nPrepare for a steep hike replete with ladders to the Conrad Kain Hut at Boulder Camp. Your elevation gain will be 700 metres in 5 kilometres, so have a good brekky. En route you will cross torrents of glacial runoff and be misted by cascading waterfalls. The trail is usually in good condition and a great stair-master workout. You will probably be in awe of Sherpa-like climbers hoofing loads of climbing gear and food for lengthy visits.\nCamping is relegated to platforms around the Conrad Kain Hut and up at Mount Applebee a further half hour and 200 metres in elevation. Payment is expected by BC Parks in the hut and at the campsites.\nTrails are few in the area. Travel for hikers above the hut is on glacial moraine and boulders. Only prepared climbers experienced in glacial travel should venture onto the snow, as there are likely hidden crevasses below waiting to swallow the unprepared.\nUse National Topographic Series Maps, Scale, 1:50,000, sheets 82K/15 (Bugaboo Creek) and 82K/10 (Howser Creek). These maps will cover the park except the western boundary.\nApproach\nBugaboo Glacier Provincial Park is located in southeastern BC, halfway between Golden and Radium Hot Springs, and west of Highway 95 (60 km south of Golden). Access to the park is via a good gravel road, open late spring through late fall, that begins at Brisco, 27 kilometres north of Radium Hot Springs on Highway 95. This 45-kilometre road into the park is frequently traveled by logging trucks, so drivers should exercise extreme caution at all times. Park visitors should park their vehicles in the public lot and not in that of the Bugaboo Lodge (Canadian Mountain Holidays), unless permission is granted. Visitors are recommended to protect their vehicle with chicken wire to deter small animals from chewing on wires and tires.",
    "directions": "See description and / or GPS",
    "geohash": "c3hb",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/426/bug_hike.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/426/long_Bugaboos-25741.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/426/reg_Donkey-Ears-2971.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/426/reg_IMGP0371-2971.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/426/reg_IMGP0376-2971.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/426/reg_IMGP0378-2971.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/426/reg_IMGP0385-2971.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/426/reg_Snowpatch-Spire-2971.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/426/reg_larches-below-Snowpatch-2971.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/boulder-camp-conrad-kain-hut-bugaboos-near-golden-bc-426",
    "stats": {
        "Activities": "climb hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 5,
        "Time": "7 hrs",
        "Total Distance": "10 km",
        "Town": "Golden, BC",
        "Type": "out-and-back"
    },
    "title": "Boulder Camp Conrad Kain Hut Bugaboos",
    "trail_id": "426"
}