{
    "description": "Bow Hut , Wapta Icefield, Banff National Park\nGPS Coordinates: 51d38' 06\"-116d29' 24\" NAD27 11U 535296 5720566\nPopular base for mountaineering and backcountry skiing, can be used as part of the Wapta Icefield Traverse. Access from the highway takes 3-6 hours of challenging skiing or hiking. Class A, sleeps 30.  \n   \nAn excellent base for mountaineering and ski-touring on the Wapta Icefields in both the summer and the winter. It is the largest, best equipped and most accessible of the four huts on the Wapta. See also the Whyte (Peyto), R.J. Ritchie (Balfour) and Scott Duncan Huts.\nPossibly the most efficient and best-situated of the ACC huts, Bow is a base for some of the very finest ski-mountaineering in all of the Rockies. It is a bright, spacious structure located on the edge of the Wapta Icefield and is used as a stopover during a traverse of the Wapta or as a destination in itself. Several days can be spent here doing classic tours and ski ascents of peaks on the Icefields. This newer version of the hut was built in 1989 and has a propane system for cooking and lighting and a wood stove for heating.\nFor detailed information please visit the ACC hut webpage.  \n\n\nsee also Bow falls trail.",
    "directions": "The most common approach is the scenic one from Bow Lake and it takes most parties about three to six hours. Members of the party should have experience travelling through avalanche terrain. The hut can accommodate 30 people comfortably. \nDrive up the Columbia Icefields Highway approx 40 km north from the TC Hway at Lake Louise, and park at the trailhead at Num-Ti-Jah Lodge. Head west 300m or so between the lodge and the beach and you'll find the actual trailhead. In winter ski across the lake.\nThough most popular as a winter destination, there are tons of great summer objectives from this hut as well.\n Alpine Club of Canada\nInformation and copyrighted photos used with permission.",
    "geohash": "c3jj",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/4263/reg_best2_bow-2-8779.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/4263/reg_bow-1-8779.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/acc-bow-hut-near-banff-ab-4263",
    "stats": {
        "Activities": "hike ski-bc",
        "From": "",
        "Seasons": "winter fall summer",
        "Stars": 5,
        "Time": "6 hrs",
        "Total Distance": "16 km",
        "Town": "Banff, AB",
        "Type": "out-and-back"
    },
    "title": "ACC- Bow Hut",
    "trail_id": "4263"
}