{
    "description": "Castle Mountain Hut, Castle Mountain, Banff National Park\nGPS Coordinates: 51d18'06\"-115d56'30\" NAD83 11U 573779 5683904\nUsed by rock climbers for the terrific long limestone routes on Castle Mountain. Technical rock climbing access (3-5 hours). Not used in winter. Class B, sleeps 6. \n   \nThe word 'perched' definitely comes to mind when trying to describe the location of this small but comfortable shelter on Castle Mountain. Sitting on the Goat Plateau halfway up the peak, this hut serves as an excellent base for the many good rock routes on the upper cliffs of Castle Mountain. \nThis is primarily a summer hut, since the approach would be very avalanche prone and difficult in winter and not at all recommended. Experienced scramblers can enjoy this hut as well but must be capable of dealing with tricky scrambling terrain as well as significant exposure and should be equipped with a rope for protection in the gully.\n \nThis is a Class B hut with capacity for up to 6 guests. It is equipped with a propane stove and lantern, however, you must supply a green Coleman propane canister (approx. 2 lbs). As a back up, white gas stove and lanterns are still available at the hut.\nFor detailed information please visit the ACC hut webpage.",
    "directions": "The normal approach takes the trail to Castle Mountain Lookout then follows a less obvious and intricate route which breaks through rock bands via 4th and low 5th class terrain to the large gully which is followed by the easiest line to the Plateau. There are sections of serious exposure in the gully. Once on the Plateau follow a trail in the scree to the east, reaching the hut after a short hike. Total time for the approach is 3-5 hours.  Reference material available \n Alpine Club of Canada\nInformation and copyrighted photos used with permission.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/4265/narrow_castle-1-8779.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/4265/narrow_castle-3-8779.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/acc-castle-mountain-hut-near-banff-ab-4265",
    "stats": {
        "Activities": "hike climb",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 4,
        "Time": "8 hrs",
        "Total Distance": "0 km",
        "Town": "Banff, AB",
        "Type": "out-and-back"
    },
    "title": "ACC- Castle Mountain Hut",
    "trail_id": "4265"
}