{
    "description": "This trail will take you to the top of a mountain, where you will find caves with native cave paintings in them. The local natives who used them, had rituals and celebrations in and around the caves. The view is spectacular, and can be done within 1 and a half to 2 hours (especially 2 if you enjoy the cave paintings.) The trail begins with 15-20 minutes of flat ground, it then goes straight up on a slope for about 45 minutes so have some good shoes. Take caution when you can see the caves near the top, you'll be on the rock bluffs below, it gets steeper here. I wouldn't try taking the single cave to the left without rock climbing gear. You will see the big crack so go and do it up! Coming back is very short you'll find you may get down within 10 minutes! Have fun.\nTrail is best in Summer, Late Spring and Early Fall.",
    "directions": "The caves are within a 45 minutes drive of downtown Kamloops. From Kamloops take the Trans Canada Highway towards Savona. Continue until you see the Savona Mill on your right hand side and also a gas station. Keep an eye out on your left hand side for Tunkwa Lake Road. The road is before the mill and gas station, so if you went past the gas station, turn around. Take a kilometre reading from the start of Tunkwa Lake Road, and continue along the main road. The road will turn to good gravel, continue on this road until Km 10.9 from here you can see the caves in the mountain on your right, high on the ridge. Move on to Km 11.1 where you will turn right off Tunkwa Lake Road and over a cattle guard. From this point go 0.5 Km, past the power lines, and just 20m past another road on your left. This will bring you to a fork in the road. The fork is not equal, the left side is the major road and the right is somewhat hidden--also there is a deep rut dividing the main, left road from the right fork. Turn to the right at this fork, and park just inside it. Walk up this right sideroad, and you will see it ends at a turn-around. This is the trailhead, and there should be some forestry ribbon, but the trailhead is pretty obvious. Stay on main trail, it's well worn in. Cell phone service is available usually from top.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/4269/long_20150721-152837-52607.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/4269/long_20150721-153448-52607.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/4269/long_20150721-154502-52607.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/4269/reg_IMG-6469-37359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/4269/reg_IMG-6480-37359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/4269/reg_IMG-6487-37359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/4269/reg_IMG-6520-37359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/4269/reg_PICT0001-13902.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/4269/reg_PICT0003-13902.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/4269/reg_PICT0006-13902.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/4269/narrow_PICT0002-13902.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/4269/narrow_PICT0004-13902.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/4269/narrow_PICT0005-13902.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/4269/narrow_PICT0007-13902.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/savona-caves-near-kamloops-bc-4269",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "6 km",
        "Town": "Kamloops, BC",
        "Type": "out-and-back"
    },
    "title": "Savona Caves",
    "trail_id": "4269"
}