{
    "description": "Like a lot of Cypress Mountain these trails are steep and technical.  Wild Cherry starts with a steep rocky section with a couple of extremely steep and narrow rock chutes (optional for the faint of heart).  Keep you eyes open for a couple of rock face and stump hucks along the way.\nRoach Hit and Roach Clip are a little bit faster, but they still have their steep technical sections (this is Cypress after all).  Roach Clip throws you out onto the road with a fast, windy, let-go-of-your-brakes section.  A great finish to a great trail.\nTrail Descriptions for Cypresss Mountain trails for moutain biking can be found here.",
    "directions": "If you are shuttling up, park at the second lookout (just past the third switch back).  Bike back across the road and enter through the gate.  Just after the gate the trail splits in two, and you want to go right, through the wire fence.  Start climbing, and just before the trail opens up (about 1/2 a kilometre or so) you will see Wild Cherry on your left.  If you get to the picnic table you have gone too far.\nWild Cherry comes out onto a wide path.  Go left to the very rocky trail and head down.  Just as the trail curves left and becomes sandy you will see Roach Hit entering through the bushes.\nRoach Hit comes out across a creek.  Head straight across the path to Roach Clip.  Roach Clip will throw you out onto the Highway. Head down to your car for loop #2.",
    "geohash": "c2b2",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/427/reg_cypressrock.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/cypress-mtn-wild-cherryroach-hit-clip-near-north-vancouver-bc-427",
    "stats": {
        "Activities": "mtn-bike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 5,
        "Time": "1 hrs",
        "Total Distance": "0 km",
        "Town": "North Vancouver, BC",
        "Type": "out-and-back"
    },
    "title": "Cypress Mtn - Wild Cherry/Roach Hit &Clip",
    "trail_id": "427"
}