{
    "description": "This aquamarine alpine pool sits like a rare jewel at the edge of a thousand foot precipice. The water's iridescent hues reflect stunted alpine fir trees, shrubbery, and sky, giving one a feeling of utmost tranquillity. Best of all, few people, even locals, know where this precious gem is hidden.Palmer Pond, near the Cascade Divide, is named in respect of Lieutenant Palmer of the Royal Engineers. He crossed the divide in 1859.The pond is situated alongside a portion of historic Hudson's Bay Brigade Trail. This trail was used in the mid-1800's to transport goods by horse between Hope and Tulameen. The trail is easy to follow -- courtesy of literally hundreds of forefathers' day pack horses that, in places, have trod the trail knee-deep into the soft earth.Leave your vehicle at the Jacobson Lake Forest Service campground and walk along the roadway for half a kilometer to where the Brigade Trail crosses the road. To your right, the road's west side, a simple sign marks the trail. It reads with usual Canadian non-ostentation: \"Historic Trail. BC Forest Service.\"The track gradually ascends through sun-dappled fir and spruce forest for a kilometer. Then, it descends to trickling Podunk Creek, named for Podunk Davis, a trapper from the early 1900's who is legendary in these parts for his tales of escapade. Nearby Davis mountain is also named in his honour. Davis is best known for finding the lost adventuress, May Warburton. In 1926, Ms. Warburton was attempting to navigate the Dewdney Trail from Hope to Tulameen, alone. She had been disoriented for about two weeks, stumbling haplessly in dense bush, when Davis happened across her. Reports say that when she laid her weary eyes on Podunk, replete with his flowing hair and white beard, she thought it was the angel Gabriel.Most likely you won't lose your way, but the track does become muddy and slippery around the creek. After a short distance the trail leaves the creekside and climbs more steeply for another kilometer. At 2.5 kilometers it exits the forest and opens onto a high meadow called Conglomerate Flats, named for the massive aggregate rocks that have tumbled off the nearby mountain. The meadow is often bedecked in dazzling wildflower finery.The final half-hour push to Palmer Pond is an uphill course from the right of the meadow. Upon reaching the pond, one may circumnavigate its tiny perimeter through twisted scrub to emerge on the pool's northern edge. There, one will discover that the basin of water is enclosed by a mere six-to ten-foot span of rock. The view is dramatic, but caution is called for... the pond exits over a sheer thousand foot drop.",
    "directions": "ApproachFrom Vancouver travel Hwy 1 (Trans-Canada Hwy) to Hope. From Hope, take Hwy 3 (Hope-Princeton Hwy) to Princeton. Turn left off the main highway into Princeton. Follow Bridge Street to its end and cross the historic one-lane wooden bridge that has been featured in Hollywood movies. After crossing the bridge, turn left, and make your way to Coalmont and then on to Tulameen. Leave Tulameen following the Tulameen River Road (a bumpy rock-strewn gravel road that can be negotiated by two-wheel drive at slow speed) for 17 kilometres. At 17 kilometres the Tulameen River Road intersects a Coquihalla Hwy logging road. Turn left and proceed 21 kilometres farther to Jacobson Lake Forest Service campground. Park at the campground to begin your hike to Palmer Pond.Hike;0 km Jacobson Lake campground.5 km Brigade Trail marker2.5 km Conglomerate Flats3.5 km Palmer Pond",
    "geohash": "c2cb",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/429/reg_pp01.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/429/topo_pp05_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/429/narrow_pp02.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/429/narrow_pp03.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/429/narrow_pp04.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/429/narrow_pp06.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/429/narrow_pp07.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/palmer-pond-near-princeton-bc-429",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 5,
        "Time": "5 hrs",
        "Total Distance": "7 km",
        "Town": "Princeton, BC",
        "Type": "out-and-back"
    },
    "title": "Palmer Pond",
    "trail_id": "429"
}