{
    "description": "Elk Lakes Cabin, Elk Lakes Provincial Park, B.C.\n GPS Coordinates: 50d 33'06\" - 115d 04'40\" NAD83 11U 0636495 5601673\n \n Excellent base for hiking, skiing and mountaineering. Access involves an easy 3-4 hour hike or ski. In summer there is vehicle access via a gravel road.\n Class A, sleeps 10. \n    \n The Elk Lakes Cabin is nestled between the French and Italian Military Groups of the Rocky Mountains; set amongst massive cliff faces, waterfalls, lakes, craggy summits, and hanging icefalls in Elk Lakes Provincial Park, B.C. The area has many easy trails for hiking while also providing access to more serious mountaineering objectives should you desire to climb. In winter, ice climbs abound, and backcountry skiers will find plenty of great terrain with loads of B.C. powder to play in. Overall, the terrain around the Elk Lakes Cabin is quite similar to that near the Elizabeth Parker Hut at Lake O?Hara in Yoho National Park. \n \n For detailed information please visit the ACC hut webpage.",
    "directions": "Access on foot or cross country skis from Alberta is through Peter Lougheed Provincial Park in Kananaskis Country. Drive to the Elk Pass trailhead and follow the trail for 5 km to Elk Pass on the BC/Alberta border. From here, follow the trail for 4.2 km until you reach the Elk Lakes Cabin (there is a sign indicating that you are at Elk Lakes Provincial Park; 200 metres beyond is the cabin). Most parties will take 3-4 hours to hike or ski from Peter Lougheed Provincial Park. You can also use a mountain bike on the designated trail to access to the cabin, but cycling is not allowed elsewhere in the park. To cycle to the cabin, you must follow the hydro line trail through Elk Pass (it runs parallel to the hiking path).\n   \n Dogs are not permitted on the Elk Pass trail (whether leashed or not) or at the Elk Lakes Cabin itself.\n \n  In summer, vehicle access from BC is through Elkford. From Calgary drive south on the #2 Highway to Fort McLeod, head west through Crowsnest Pass to Sparwood, and turn north towards Elkford. After Elkford, drive 70 km along a forest service logging road to the Elk Lakes Provincial Park boundary. The drive takes approximately six hours from Calgary or 2.5 hours from Fernie. Cars with low clearance are not recommended.\n \n The Elk Lake Cabin sleeps 10 and has propane cook stoves and lights. There are pots, pans, dishes and cutlery in the kitchen. Fresh water is nearby. Sleeping is dormitory style and mattresses are provided. You will need to bring your own sleeping bag and food. \n  \n Camping\n \n Backcountry camping is permitted at Lower and Upper Elk Lake on a first come, first served basis. Pit toilets, firepits, food caches, and tent pads are provided with the sites. Wood is available at the cabin free of charge.\n \n Fees are $5 per person; children 16 and under are free.\n \n Fees should be paid to the hut custodian at the cabin or via the self-registration boxes located at each campground. The hut custodian and/or a Park Ranger will visit your site should you have any questions.\n \n  Alpine Club of Canada\n \n Information and copyrighted photos used with permission.",
    "geohash": "c2yp",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/4291/reg_elklakes-1-8779.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/4291/reg_elklakes-2-8779.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/acc-elk-lakes-cabin-near-elkford-bc-4291",
    "stats": {
        "Activities": "hike ski-bc mtn-bike",
        "From": "",
        "Seasons": "winter fall summer",
        "Stars": 5,
        "Time": "8 hrs",
        "Total Distance": "17 km",
        "Town": "Elkford, BC",
        "Type": "out-and-back"
    },
    "title": "ACC- Elk Lakes Cabin",
    "trail_id": "4291"
}