{
    "description": "Sydney Vallance (Fryatt) Hut, Fryatt Valley, Jasper National Park.\nGPS Coordinates: 52d30'18\"-117d52'48\" 11U 440270 5817572\nCompletely renovated in 1999, this hut is an excellent base for hiking, mountaineering, and ski touring. Summer access is a 6-8 hour hike. Winter access is a full day of skiing. Class A, sleeps 12.\n   \nA relatively little-known and little-visited valley, this area is one of the true gems of the Rockies!  The Fryatt Hut offers a superb base for exploration both summer and winter with excellent alpine climbing and ski-touring all within fairly easy reach of the cabin. \nThe hut received a major facelift and interior makeover in the summer of 1999 and is now a much improved version of the former cabin.  A winter visit would certainly be a comfortable one indeed!  The interior is roomier with a new bunk design, new benches and tables. It has a propane system for cooking and lighting and a wood stove for heating.\nFor detailed information please visit the ACC hut webpage.  \nAlso visit the trail description for the Fryatt Valley on trailpeak.",
    "directions": "The approach is usually completed in a long day, but some folks will appreciate the Parks campsites which are strategically located along the trail, breaking the trip into two days during the summer.  Bikes can also be used for the first 11 km, as far as the first campsite at Fryatt Creek, which will substantially reduce the total approach time and makes for a fun trip out! Yet another option is to canoe across the Athabasca River, cutting off 7 km. In winter it is a good idea to inquire as to whether the Athabasca River has frozen over (usually by the end of December).  If so, then parties can cross immediately from the Icefield Parkway and, with good snow conditions, easily reach the hut in a day with an early start.  Winter access involves crossing some avalanche paths - check conditions before you go.\nCapacity for this hut has been reduced to 12 year-round, which will mean plenty of space even when full.  This place is a must-visit for everyone. \n Alpine Club of Canada\nInformation and copyrighted photos used with permission.",
    "geohash": "c3k",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/4293/reg_fryatt-1-8779.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/acc-fryatt-hut-near-jasper-ab-4293",
    "stats": {
        "Activities": "climb hike ski-bc",
        "From": "",
        "Seasons": "winter fall summer",
        "Stars": 5,
        "Time": "14 hrs",
        "Total Distance": "44 km",
        "Town": "Jasper, AB",
        "Type": "out-and-back"
    },
    "title": "ACC- Fryatt Hut",
    "trail_id": "4293"
}