{
    "description": "Deek's Creek is a spectacular hike that the hordes on their way to Whistler on Hwy 99 drive pass without so much as a glance.  Unfortunate. Great views, nice coastal hike. The above distance is for return. An ideal spring hike for April/May when other hikes are still covered in snow.\r\nAbout 10 miles outside of Horsehoe Bay (start paying attention to creek signs at mile 9 if you start counting miles right at the overpass in Horsehoe Bay), you will pass Logger's Creek, and then the next is Deek's Creek, which has a bridge over it to allow the creek to flow underneath the highway.  Just past the bridge is the a pull-off area where you may see some parked cars.  There is a nice turnaround area a kilometre or so down the road for you to return to this parking area.  Do not turn left off the highway into this parking area; the traffic is too intense for that.\r\nOnce parked, you may or may not know that there is an Old Deek's Creek trail right near the creek which is now unmaintained, and this is not the trail you will take.  Instead, proceed north along the highway, preferably on the left side of the barrier, about 150m, until you see some trail markers on the opposite side of the road.  Enter here. This is marked as Waypoint #2, if using our waypoints; waypoint #1 is the parking area.\r\nNow the trail is very well maintained, and you pretty much just follow it up! It is steep initially.  Up for about a half an hour until it levels off a bit, then the ups alternate with more level areas, and beautifully wooded forests of Sitka Spruce, Douglas Fir, and Cedar. Note that when you complete the steepest part of your climb (moderately difficult - there is one area with a cable), you will go left. Generally you know from looking at the map that you will be heading north, parallel to Howe Sound and the cliffs. You'll have some great views back to Howe Sound, and across to Anvil Island and Gambier.  As you keep climbing, now more gently, you will eventually get to a major fork in the trail, where to continue left takes you up along the Bluffs, and to go right (and down initially) takes you to Deek's Lake, which is another hour and a half at least. Whichever way you go, keep following the little orange markers.  This trail is well marked, so get accustomed to looking for those.\r\nOn the attached map (GPS waypoints), you'll see that we mapped enough of the trail in either directions to show you where to go. Waypoint #11 is close to the fork.\r\nThe trail is very well maintained, and you will have little problem following the Bluffs route, as there are red trail markers, some with writing on them to guide you. \r\nIf you have a GPS unit, you can use the attached waypoints as a general reference, but coverage varied from 7m accuracy (most taken in clearings) to a dismal 22m accuracy.  If you follow the markers, you should be fine.\r\n\nAn ideal trail on a sunny day to look out on Howe Sound and the surrounding mountains.  Lots of great rest areas with views, one wonders why more people don't do this trail.  We left Vancouver at 12:30 pm, we were back by 5:30 pm (mind you we did not do the full 7 km return route - but enough to feel refreshed and exercised)\r",
    "directions": "See description and / or GPS",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/430/long_DeekMap.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/430/reg_aIMGP0491.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/430/reg_aIMGP0500.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/deeks-creek-bluffs-near-vancouver-bc-430",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "0 hrs",
        "Total Distance": "7 km",
        "Town": "Vancouver, BC",
        "Type": "out-and-back"
    },
    "title": "Deek's Creek Bluffs",
    "trail_id": "430"
}