{
    "description": "NTS Map: 92I5. What can be said about the Stein Valley River Trail? Well for one, the trip usually starts with a 4 sailing wait across the Fraser River, but don't worry, this is where your Lower Stein Valley adventure starts. The ferry is powered only by the power of the river, and takes two cars at the time. The ride over takes about 3 minutes or so. The ferry starts operating at 6:30 am and stops running at 10:15 pm with minor breaks every 4 hours.To get to the ferry you drive 108  km NW on Highway 1 from Hope. Make a left off the highway when you reach Lytton, and drive through the town heading for highway 12 to Lillooet. Cross the bridge over the Thompson River and make left 700 meters after the bridge. You are now at the ferry crossing. After crossing the river, follow the main road for 4.8 km and then turn left onto a dirt road. This road is rough, but a 4x4 is not called for, and your normal car should have no problem reaching the trailhead just 2 minutes after making the left turn onto this road.Before Leaving Lytton, make sure you fill up on water. The Lytton area is dry and warm. Especially warm. Hiking here after mid June is not for persons who don't like using a sauna because this is what you are walking into. This hike is best done early in the season, and can be done as early as March or after mid September to November. It is perfect for new hikers who would like to try out overnight backpacking as the trail is hard to miss, water is easily accessible at any time and the camp sites are plenty. The total elevation gain to Ponderosa Shelter is around 1300 feet, which makes the hike rather easy compared to most others in the coastal mountains. You will not find the spectacular mountain views on this hike, but the river itself and the fact that it is easily accessible early in the season makes this a great destination for the first hike of the year. Also the many changing climates from dry desert-like interior climate at the trailhead to the lush green swamp-like area around the Ponderosa shelter campground (013) makes this hike different from many others. The two pictures of the river gives a good view on the changing climates as one is taken close to Ponderosa Shelter and the other from close to the Devils Staircase. Once you get your car parked (see 002 on the map below) continue down to the river loosing 120 feet. From this point you will follow the river all the way until the lower cable car crossing (008). The next 4 km or 1 hour of hiking, you will find many great viewpoints of the river, and the climate is dry. You will find 2 possible campsites along this part of the trail, with only the second one being an official one with a bear cache and a pit toilet. (003 and 004). Remember that even though each site has a fire ring, the lower Stein River section is very dry, and campfires are prohibited. Leaving the campsite (004) the trail starts to go a little bit more up and down, and you soon realize you have reach the Devils Staircase (005). Don't let the name fool you, as you will only gain 400 feet or so, and cross two rather short talus slopes. The trail will lose some altitude just to make you believe you have completed this section of the trail, only to gain altitude right after. You will descend 3 switchbacks at the end of this section (006), and once down you will enter a green forest very different from the climate you just left at the last campground 1 hour earlier. Continue for another 30 minutes or so until you reach the next campground. This campground is named the Wigwam campground after a tipi erected here. This one is now burned down, and no longer there. This would have been a good place to camp had it not been for the million others having the same thought. Continue another 45 minutes to Earls Creek Campground, and you get a bit more solitude. The trail between the Wigwam Campground (008) and Earls Creek Campground (009) is gentle and easy to follow. You slowly gain some altitude, but it is hardly recognizable, and you will follow the river all the time. Earls Creek is named after a prospector from the early 1900s who apparently found gold in these creeks. Legends say that his gold cache is still hidden somewhere around his now worn-down cabin, but no one has been able to locate it.  Mr. Earl himself died during the First World War, so it seems like this will remain a legend. Someone came up with the not so bright idea to light a campfire in one of the corners of Earls Cabin. Please don't follow this idea, as chances are you will light the whole cabin on fire. Follow the river trail for another 45 minutes across another 2 talus slopes and you reach the Cable Car Crossing Campground (011) at 4 hours and 13.5 km after leaving your car. This is a perfect spot to camp, as there are fewer hikers here, and the river is close by to get water for cooking. Though the name is now misleading as the cable car is replaced by a suspension bridge at what I personally find being a great loss to the hike.Continuing past the Cable Car Crossing Campground, follow the red markers and cairns to the new bridge. OK it is a nice bridge, but it is no fun to cross it. Just on the other side of the bridge, the trail continues along the river, and soon you will see that the water slows down, and the river itself changes. Just 5 minutes past the river crossing you will find tons of great camp spots just by the riverbank. Also when the water is not too high, you will find that you can access some sand banks just beside river, which make for exotic and lonely campsites. If you don't mind not having a bear cache and a pit toilet, I would recommend you use these spots as your overnight destination.  Continuing further up the river you get to another unofficial campsite 20 minutes after the bridge. This spot has a table and chairs cut out of logs, and also an easy spot for gathering water. It is an ideal spot, but when I came along, it was already taken. Leaving this great spot, the next little bit is not too interesting as you will leave the river at times, and head for dense forest.  Another 40 minutes later you reach Waterfall Creek Campground (not marked), and don't be fooled by the name; the only waterfall is way up on the mountains on the north side of the river 15 minutes before you reach the campground. This campground is almost not worth mentioning, but if you are worn out, it is a place with a bear cache and a pit toilet.Passing this campground you soon rejoin the river, and now it runs really slowly, and there are spots to take a swim without being flushed back to your car. A hidden path is marked with a UTM coordinate (Beach), and this leads you to some great sand banks at which you can swim or soak up some sunshine. Continuing further up the trail you get to Ponderosa Shelter (P-Shell) and the Ponderosa Shelter campground (013). The campground isn't much of a site, but the shelter is much better, and you even have some sort of shelter from the elements should they misbehave. Continuing further up the valley doesn't yield much of a site, and the trail is overgrown and filled with deadfall until you reached the upper Stein and the alpine terrain.Some few last notes; this hike is really fast, and if you would like to get to Ponderosa Shelter the first day you could do so. The only drawback is that pushing beyond is not much use early in the season. There is GPS data attached to this trail (see \"download GPS\"), which if loaded into your GPS can help you find route points.",
    "directions": "See description and / or GPS",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/436/long_stein1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/436/long_stein2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/436/reg_Beach.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/436/reg_CableCrossingCamp2Packs.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/436/reg_CrashsiteStoyoma-58608.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/436/reg_EarlsCabin.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/436/reg_Ferry.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/436/reg_IMG-2227-22121.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/436/reg_IMG-2243-22121.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/436/reg_IMG-2265-22121.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/436/reg_LogBridge.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/436/reg_RiverUpperStein.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/436/reg_Trail.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/436/reg_devilsStairCase.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/436/narrow_LowerRiver.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/lower-stein-valley-trail-near-lytton-bc-436",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall",
        "Stars": 4,
        "Time": "18 hrs",
        "Total Distance": "44 km",
        "Town": "Lytton, BC",
        "Type": "out-and-back"
    },
    "title": "Lower Stein Valley Trail",
    "trail_id": "436"
}