{
    "description": "\"Smoooooth ride = smooooth track (GPS) I guess\". That's what member Erland Kirste, who collected this trail had to say about GPS'ing this trail for us.\nThe start, as I rode it, would be at the red road at the apex of the first switchback at 220 metres elevation. There's limited parking there. The true test of yourcardiovascular system starts at the 340 meter mark. The trail meets the road again at 600 meters elevation, which can be either the end or the start, as there is parking just south at the day use area. (same parking lot for \"Sex Boy and Sex Girl\").\nThe northerly point where the track (red GPS track on the topo map) ends is where I was stopped by snow (late May).\nThe upper parts of the trail are actually part of the Trans Canada Trail network.\nThere is GPS data attached to this trail (see \"download GPS\"), which if loaded into your GPS can help you find route points.\nTrail Descriptions for Cypresss Mountain trails for moutain biking can be found here.",
    "directions": "Take the Trans Canada to the Cypress Bowl Park exit and drive to the first switch back, opposite the West Vancouver Public Works Yard and park. From here you can shuttle to the top, but if you want a good leg workout, park and start the ride. The trail access is past the barrier/gate. Follow the paved section up and past the sub-station. Just to the right will be a gated road; start your ascent in the dirt here, following the hydro lines until the road splits to the right, into the woods.\nFollow this old road up and through puddles and over \"baby head boulders\". In about one hour you will be opposite the Quarry Lookout or the third switchback.\nIf you go through the gate to the left before the switchback, you can continue further up and eventually end up at the ski area.\nAllow two hours to get up for you cardio types. The descent is fast and bumpy Old School ride, with access to Skyline and Sex Boy.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/438/topo_BLT_topo.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/cypress-mtn-blt-near-north-vancouver-bc-438",
    "stats": {
        "Activities": "mtn-bike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "3 km",
        "Town": "North Vancouver, BC",
        "Type": "out-and-back"
    },
    "title": "Cypress Mtn - BLT",
    "trail_id": "438"
}