{
    "description": "Mt. Logan, Gaspesie National Park, Chic ChocsThe final duffel of luggage came back last week, and that, to me, marks the official end of any trip; when you get all your gear back. This was the case on our recent backcountry ski trip into Mount Logan in Quebec's Chic Choc Range. Planning the trip involves very early booking with Quebec's SEPAQ to reserve huts, and in this instance, booking the one and only route. They don't allow much variation on your hut stays unless it's a last minute plan. The main theme for this hut route is getting to ski the exquisite powder up around Mt. Logan itself. We've been to this region a couple of times before, but always around Christmas. It turns out that the snow is far more prime time in March, with more livable temperatures.The five day trip gives you two days to get in, a full day either crash at the hut, or better, play up around Logan, and finally, an easy two day exit scenario. The hut order goes something like this: 12.5K from the start to La Huard. 22 K max to La Chouette or La Nyctale near Mt. Logan, a day's romp in the area (minimum 6K), 10K to La Courage, and then finally, 20K home. With the distances you make up at Logan, your overall trip distance will be around 70-80Km.We reached the national park and spent our first night in the Gite du Mont Albert. The food there is awesome, and the rooms, minimalist but tasteful. The next morning, I went to deliver our duffle bag to the info center for skidoo shuttling, only to find out that the location for dropping off bags was over at our trail?s starting point. an hour's drive away. At least my wife got to eat breakfast. I ended up scarfing dry bagels en route while they waited for us to arrive. How did I miss that bit of info? Never the less, they were accommodating.Unlike other routes in the park, this one starts outside the park about an hour away from the gite. You have to drive up to St. Ann de Monts, and then head toward Matane in order to reach St. Octave. There, sits a small charming hotel and cottage complex (Relais Chic Choc) in an even smaller community. Upon looking South, in our direction of travel, you see a rolling plane and an abrupt wall of mountains; the Chic Chocs proper. Welcome to day one. Here, we go up.Day 1's trip includes an easy rolling approach toward the mountain. There are intermediate climbs worthy of skins, especially if you're bearing a full pack. The crux of the route is of course the climb into the mountains which takes you around the bend to Lac Thibault following a wide roadway. From the junction, a well snow-drifted path takes you to La Huard hut. All told, it's between a three and four hour journey lasting 12.5K.Noteworthy memories of the day include looking back over the expanse you climbed and seeing the St. Lawerance to the North, seeing a wide curtain of climbable ice along the mountain side to the left, while to the right, seeing a very steep cliff wall. These will be your Kodak moments until the end of your next day when you approach Logan. La Huard hut is beautifully set along the edge of Lac Thibault. Rising to the challenge of the steep ascent into the mountains proves to be both the physical and metaphorical right of passage for the adventure.La Huard sleeps 16, and the 8 upstairs cots offer no sense of privacy what so ever. The scene around the hut when we arrived was festive, and very relaxed. By then the sun was shinning and the winds were being blocked by the trees. People were out sun tanning or playing in the abundant snow. Some women even brought along Krazy Carpets to pass the time. The hut was packed to capacity, though the various groups had different destinations. La Huard sits at the crossroads of a couple of different routes.We had the misfortune to loose our stove fuel bottle on our way to the hut, (probably when I was retrieving my skins from the pack pocket) so we were forced to get creative with the wood stove. Luckily, we found a grate to cook our steaks, and the stove top was hot enough to steam our vegetables and rice. To our even greater good fortune, Eric the skidoo driver delivered our lost fuel bottle to us the next morning. Someone had picked it up on their way out.Day 2 is our long day that would take us to La Chouette, the hut near Mt. Logan. Distance estimates put the journey at a maximum of 22K or as short a distance as 12 depending on which route you took. La Lacs trail was shorter but harder as it ran in the woods and by recent weather, could require breaking trail. Noroit trail was longer but generally easier in terrain. With a lot of fresh snow down, we opted for the longer but easier route. It also turned out to be the same route the snowmobile takes to shuttle gear, so we had a track already made. Another party decided to take the shorter route and had to break their own trail. We caught up to them where the two trails met. That 17K route prior to the junction seemed to take forever. Every time I looked at the GPS, it seemed as if we hardly moved.Not being so deep in the trees can offer you more chances at panoramic scenery, but the scenery you'll see, at least until you reach the top of your very last climb, gets to be \"same-old, same-old\" with miles of snow covered evergreens. Nice at first but redundant soon after. The weather that day was gorgeous. We had warm sunshine at -1 degrees C. I got a fantastic suntan on my face from all the reflected sunlight.The final climb toward La Chouette was a long slog. It paid off visually with over the shoulder views of the McGerrigle range in the distance and more or the St. Lawerance River. It was cool to see the difference in the trees both in terms of their size and their snow cover when we got to this point. The trees were much smaller here, and the snow was packed  ice, and thicker. If you've ever researched pictures of the area in winter, you?ll see the classic shot of wind packed snow weighing down the stunted trees. It?s no wonder the trees are so small.Topping out, you get your first sight of Mt Logan, and Mt. Dodge before it. Down below, you see La Chouette and Nyctale huts. The physical reward is that you get a sweet descent toward your hut as pay back for all that climbing you just did. Here would be home for the next two nights, and the weather continued to be stellar.Leading into Day 3The sun set just at Mt. Logan's right edge and the skies that night were crystal clear. The moon lit up the snow on the steep face of Logan. The next morning I woke early to capture a bit of alpin-glow. I was not let down, when after 6:30 Logan's snowy face was bathed in magic-hour warm light. The indications were (as well as rumors) that snowstorms were headed our way. Not just for tomorrow, but for the days after. You know what they say about red sky at morning? We began to think about the implications of the news and how it might affect our bigger plans of getting out of the area without delays. Day 3 had more warm weather and partly sunny skies as we did Logan later in the morning. You could tell however that conditions were deteriorating.A trip to the warming hut on Logan isn't much more than 3K each way. In our hut there is a map to show permitted ski zones. (remember the key reason people come here is to tele ski) Unfortunately, the wind had packed the near week-old snow to almost icy conditions. If we had arrived a day or two later, we'd get a powder fest of a life time, as two or three snowstorms were to come rolling in on our departure. I took along my G3 Barons, and had shuttled my tele boots for the one reason of trying some tele skiing on Logan's famous powder. I got some turns in, but the conditions were not all that ideal, and nor were my skills!Day 4All that evening, I watched my barometer drop with the storm's approach. The original plan would be for a very short day today. It would only be 10K to La Carouge hut, leaving a 20K grand descent for our final day. The storm had arrived that night, and had continued that morning. With visibility at about 100 meters, we knew we could easily make it to our final night's stay, but we still discussed possibilities of making our final day shorter by rerouting to La Huard. Unfortunately, we told the skidoo driver that we'd be sticking to our original plan, but when we would arrive at La Carouge, decided to get the minimum gear for an overnight stay, and went for La Huard anyway. After all, he had mentioned that there would be room there that night.Arriving at La Carouge, we unexpectedly met one of the Montreal women from our previous huts, already there. Turned out that she was one of a few injuries from the deep morning powder, giving Eric, the skidoo driver, the added delicate task of shuttling people as well as gear. We quickly packed up and left our half-empty duffel for the shuttle.On the way to the junction to La Huard, we looked at some variables that would decide ultimately where we'd go for the rest of the day. Eric mentioned that La Huard wasn't full, but we had no guarantee. Given the time of day, and the distance covered so far, and the ease at which we covered it, made actually skiing out to the trailhead a conceivable though epic option. So far we had skied around 13-14K. Left at around 9AM, and were at the junction to La Huard, by 2:30. With the sun setting at around 6, and darkness setting in by 6:30, we made a safe gamble that we'd either be at the jeep by then, or at least on the last few easy K's approaching the end by headset lamp. We made the choice and were at the jeep by 6:30 amid the brunt of the storm.The roads were not fit to travel, but the little resort there was open under a one man operation. Because there were no guests registered, the cook left early on account of the storm. The concierge could only offer us BLTs, soup and snack foods. Between that and the ice cold beers, things never tasted better!We dug out the jeep the next day and headed back to the Gite. We didn't want to wait around to retrieve our duffel that afternoon because the storm continued. We had hoped to return to get it on our way home, all be it with two hours of backtracking, but gave up when upon departure on our final day, heard that the road up there was closed with blowing snow. We arranged with the resort to have the bag sent by Currier, and made for home.Now we can say that between doing the McGerrigle route and the Mount Logan route, we've done the main sections of the Gaspesie. It's a beautiful place in the winter. Hut to hut travel is nice, and planed right, you can eat like royalty. For us Maritimers, it's so close for an out-of-this-world sort of terrain. Our plan next will be to return in the Summer months for a different flavour of the Chic Chocs.Shannon BurtEast Coast Editor",
    "directions": "Traveling from NB, take route 132, and turn left at the 299 into the national park. From the Gite, it takes an hour to get to Relais Chic Choc, approaching Matane. The trailhead is at St. Octave.",
    "geohash": "f88w",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/QC/4398/long_IMG-4183-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/4398/long_panoramicsml-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/4398/reg_IMG-4074-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/4398/reg_IMG-4098-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/4398/reg_IMG-4104-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/4398/reg_IMG-4110-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/4398/reg_IMG-4113-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/4398/reg_IMG-4133-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/4398/reg_IMG-4136crop-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/4398/reg_IMG-4137-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/4398/reg_IMG-4142-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/4398/reg_IMG-4147-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/4398/reg_IMG-4169-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/4398/reg_IMG-4189-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/4398/IMG_4190.JPG",
        "https://trailpeak.com/storage//content/trails/Canada/QC/4398/narrow_IMG-4083-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/4398/narrow_IMG-4095-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/4398/narrow_IMG-4097-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/4398/narrow_IMG-4099-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/4398/narrow_IMG-4193-6702.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mount-logan-chic-choc-range-gaspesie-national-park-near-cap-chat-pq-4398",
    "stats": {
        "Activities": "ski-bc ski-xc",
        "From": "",
        "Seasons": "winter",
        "Stars": 5,
        "Time": "35 hrs",
        "Total Distance": "80 km",
        "Town": "Cap-Chat, PQ",
        "Type": "out-and-back"
    },
    "title": "Mount Logan, Chic Choc range Gaspesie National park",
    "trail_id": "4398"
}