{
    "description": "A beautiful 20km trail that follows mountain pass between Mt Rundle and Sulphur Mountain from Canmore to Banff.  The views along this trail are breathtaking.  If you start at the Canmore side, the less challenging route, the trailhead  begins at Spray Lake Road parking area. The trail meanders along side Goat Creek and majestic peaks loom above you one both sides of the trail..  The trail is moderately steep in parts with sharp curves and foot bridges sometimes suddenly before you.   There are signpost markers all along the trail.  Follow the signs to Spray River Trail.  Around the 14km mark is a picnic area and a trail junction at Spray River.  If you have packed a lunch, this is a great area to stop and enjoy it as the river babbles behind you in the background.  Stay to the left of the river and continue to the Spray River Trail head located behind the Banff Springs Hotel. This trail works well if you are able to leave one vehicle at each end of the trailhead.  The trail can be done in either direction although it is less difficult beginning on the Canmore end.  Allow 4-5 hours depending on your level of skill and if you plan on stopping along the way to take in the views and have a picnic lunch.  For us, this was our first go at Cross Country Skiing (although we are avid hikers and snowshoers) and we finished in just under 5 hours with plenty of Photo Ops and a lunch break at Spray River.\nSkis can be rented at Canmore Nordic Centre.  Trail may or may not be groomed.",
    "directions": "From Canmore, the trailhead is 9km.  Follow the Spray Lakes Rd south-west past the Canmore Nordic Centre.   Follow the steep gravel road, after passing the lake, the road descends, watch for Goat Creek / Spray Lakes parking lot on your right hand side.",
    "geohash": "c3j",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/4437/reg_IMG-1077-7279.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/4437/reg_IMG-1838-55357.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/4437/reg_IMG-1859-55357.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/4437/reg_can-banff-22842.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/4437/reg_canmore-banff-10--22842.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/4437/reg_canmore-banff-18--22842.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/4437/narrow_IMG-1836-55357.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/goat-creek-spray-river-trail-near-banff-ab-4437",
    "stats": {
        "Activities": "hike ski-xc mtn-bike",
        "From": "",
        "Seasons": "winter summer",
        "Stars": 5,
        "Time": "5 hrs",
        "Total Distance": "19 km",
        "Town": "Banff, AB",
        "Type": "out-and-back"
    },
    "title": "Goat Creek / Spray River Trail",
    "trail_id": "4437"
}