{
    "description": "You don't have to worry about backtracking or arranging for a shuttle if you chose to paddle this scenic loop. Simply launch your watercraft of choice into the Schuylkill River from the convenient boat ramp at Lock 60, paddle downstream for 2.5 miles, then make the short portage to the Schuylkill Canal and paddle 2.5 miles back to Lock 60. \r\rFollow the given directions to arrive at the ample parking area at Lock 60. The entrance road runs parallel with the Canal on your right. The River boat launch ramp will be on your left, just before the actual canal lock on your right. The paddle downstream can be taken at a leisurely pace, as the current tends to be generally calm. Along the way, there are a few islands that can be explored, as well as a small stream that flows into the river. \r\rThe landing at the portage is easy to spot, on river left where the high tension wires lay low between the east and west side of the river, right at the end of an island. A \"Portage to Canal\" sign is usually visible, but is not guaranteed after a storm or flood.  The first time I paddled ths loop, I overshot the landing. It took a bit of effort to paddle upstream back to the landing, but I eventually made it. Note: if you get to the platform and pipes along the bank of the river on the left side, you've gone too far. That's where I had to turn around. \r\rThe portage to the canal is rather short, probably less than 1000'. Once there, it's a beautiful, relaxing paddle in the canal. In the springtime the area is full of families of ducks and geese, as well as plenty of turtles. (Don't worry too much if you accidentally hit a swimming turtle with your paddle. That's why they have hard shells.) A ruin of a grain storage house used during the operation of the canal is situated on the edge of the towpath along the canal in Port Providence. Immediately after the ruin, you'll pass under a very small bridge. Getting hungry? A restaurant is located directly along the canal, just a few hundred yards upstream from the ruin. \r\rEnjoy the paddle! This trip could take as short as two hours, but could easily be stretched into four hours or more if you chose to stop and explore what lies along the route. As always, be safe.",
    "directions": "The entrance to Lock 60 of the Schuylkill Canal is on Route 29 in Mont Clare, PA. From Route 422, take the Phoenixville/Collegeville exit and head south on Route 29 towards Phoenixville. Follow Route 29 South for approximately 3 miles to Mont Clare and the traffic light at Produce Junction. Proceed through the traffic light and start over the bridge to Phoenixville.  Just as you go over the canal, look to the right for the towpath road leading to Lock 60, a large green directional sign will indicate Lock 60 to the right. Make the right (off the bridge) and follow it to the end, about one mile, to Lock 60. The entrance road is rather easy to overlook, so don't feel too bad if you drive right past it. \r\rFor general directions from several different routes in the area, please visit the Schuylkill Canal Association's website at:\r\rhttp://www.schuylkillcanal.com/about/directions.html\r\rThe website is also a great source of historical information of the canal and surrounding area. There is an event calendar and information on how to volunteer and become a member of the Schuylkill Canal Association.",
    "geohash": "dr4k",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/PA/4439/long_20150614-104713[1]-51941.jpg",
        "https://trailpeak.com/storage//content/trails/US/PA/4439/long_20150614-113533[1]-51941.jpg",
        "https://trailpeak.com/storage//content/trails/US/PA/4439/long_20150614-113539[1]-51941.jpg",
        "https://trailpeak.com/storage//content/trails/US/PA/4439/reg_P5041705-14062.jpg",
        "https://trailpeak.com/storage//content/trails/US/PA/4439/reg_P5041717-14062.jpg",
        "https://trailpeak.com/storage//content/trails/US/PA/4439/reg_P5041718-14062.jpg",
        "https://trailpeak.com/storage//content/trails/US/PA/4439/narrow_P5041678-14062.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/schuylkill-rivercanal-loop-near-mont-clare-pa-4439",
    "stats": {
        "Activities": "river-canoe river-kayak",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 5,
        "Time": "3 hrs",
        "Total Distance": "8 km",
        "Town": "Mont Clare, PA",
        "Type": "out-and-back"
    },
    "title": "Schuylkill River/Canal Loop",
    "trail_id": "4439"
}