{
    "description": "Get travel information on Whistler from HelloBC.com\r\n\r\n\r\nWhistler! Best thing since anodized bar-ends! OK, it appears the shuttle ride is here to stay. And if you're looking for the easy way to get your 40+ lbs of mountain bike repeatedly up a mountain, then the Whistler Bike Park is a great way to go! More and more downhill resorts in B.C. are opening up their slopes in the summer for free-riding.  \r\n\r\nWhistler Village is like Disney Land for outdoor enthusiasts - a perfectly designed, outdoor environment that manages to blend nicely with the rugged surroundings. The village feels like it has been plucked from some Swiss mountain valley (well, OK, it's not 800 years old, but the closest Canada might come to a Swiss Mountain Village). And when they build a ski hill, they build one of the world's best. Voted #1 in North America consistently. And they apply that same commitment to the skateboard park, the BMX stunt park, and to the downhill terrain park. \r\n\r\nTerrain park creator Dave Kelly has crafted a fantastic blend of speed, air and technical sections, spread over 4800 ft of vertical descent. All skill levels are accommodated too, and beginners can start with B-Line, or Fanatic, while more advanced riders can push themselves as hard as they want on the A-Line, or test their technical riding skills on the \"Shore-like\" Joyride. \r\n\r\nWe spent nearly all of our time on A-line.  The type of riding offered on this run just can't be found anywhere on the local North Shore trails, so we couldn't resist riding this one over and over and over. \r\n\r\nA-line starts with a fast descent, a flowing berm, then a beautiful tabletop. Then it continues like this for the whole run, sometimes offering 5 or 6 six jumps in a row. This is the place to practice jumping. You can approach all of these jumps at your own speed, and as you get comfortable, start letting go of the brakes. By the end of my first day I was getting 3 feet of air. \r\n\r\nAt different elevations along the runs, you will find skills development areas, that are much fun.  Something for everyone!\r\n\n\nWhistler Bike Park - Whistler, B.C., Canada\nDevil's Club\n\n\n\n\nFatcrobat\n\n\n\n\nBikercross\n\n\n\n\nCrank It Up\n\n\n\n\nHeart of Darkness\n\n\r\nmore mountain biking videos can be found here",
    "directions": "See description and / or GPS",
    "geohash": "c2b",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/444/reg_DCP_0003.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/444/topo_rogman.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/whistler-bike-park-near-whistler-bc-444",
    "stats": {
        "Activities": "mtn-bike",
        "From": "",
        "Seasons": "summer",
        "Stars": 5,
        "Time": "7 hrs",
        "Total Distance": "2 km",
        "Town": "Whistler, BC",
        "Type": "out-and-back"
    },
    "title": "Whistler Bike Park",
    "trail_id": "444"
}