{
    "description": "NTS Map:92B5.  East Sooke's Coast Trail is considered one of the premier day hikes in Canada, a west coast wilderness experience within easy reach of the city. The 10 kilometre trail is rough and winding, a challenging 6 hour trip even for experienced hikers. One moment you travel across a bluff of windswept pines, the ocean crashing at your feet. Next you enter a dark rainforest at the end of a ravine. Turn a corner and you're back in sunlight, at the edge of the sea.\nBegin your hike at Pike Road, and take the trail to Iron Mine Bay. The forest is thick with Douglas fir, Western Hemlock, and closer to shore, Sitka Spruce. The route to the small, horseshoe-shaped bay is lush with mosses, ferns, and shrubs like fruit bearing Salmonberry. Heading east along the Coast Trail, you pass sharp cliffs where Pelagic Cormorants roost. Watch them swoop and dive for food, then fly back to their rocky homes. Later, stop at Cabin Point where a small trap shack is testimony to a fishing post.\nAs you travel the trail look for plants as old as time - Kinnikinnik, Oregon Grape, and Salal--surviving despite the hard wind and salt spray. Continue east to Beechy Head. Here the wild and beautiful coastline is marked by jagged bluffs, a reminder of the ageless struggle between land and sea.\nFeel the presence of the Coast Salish people at Alldridge Point, designated as a Provincial Heritage Site in 1927. Here you'll see petroglyphs bruised into the rock, a style particular to the Strait of Juan de Fuca. Near the end of the Coast Trail is Creyke Point, a rocky headland of unusual shapes against emerald green water.\nYour hike ends at Aylard Farm. A heritage apple orchard is all that remains of the last settlement. Where livestock once grazed, meadows are now sweet with Clover, Wild Rose, and Blue-eyed Grass. At dusk, Columbian Black-tailed Deer wander in from the surrounding forest to feed.",
    "directions": "East Sooke Regional Park is located on the East Sooke Peninsula, 35 kilometres west of Victoria.\nTo reach the park, take the Old Island Highway (#1A) to Sooke Road. Follow Sooke Road (#7) to Happy Valley Road, turn left and continue down Happy Valley. Turn right on Rocky Point Road, which becomes East Sooke Road, and leads to park entrances at Aylard Farm, Anderson Cove, and Pike Road.\nAllow approximately 60 minutes driving time from downtown Victoria.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/445/long_ESP2016-14-54256.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/445/reg_ESP2016-2-54256.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/445/reg_PA270446-9970.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/445/reg_PA270460-9970.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/445/reg_image-43396.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/445/reg_topo_map.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/445/narrow_PA270462-9970.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/coast-trail-east-sooke-park-near-victoria-bc-445",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 3,
        "Time": "6 hrs",
        "Total Distance": "10 km",
        "Town": "Victoria, BC",
        "Type": "out-and-back"
    },
    "title": "Coast Trail - East Sooke Park",
    "trail_id": "445"
}