{
    "description": "This is a walk along the upper portion of the Coquitlam River to a scenic waterfall on Pritchett creek commonly referred to as Crystal Falls. It's an easy 3 km hike or bike along a well-defined trail that can be muddy even in the midst of dry weather. At about the 2 km mark there is an old settlement that is becoming quite overgrown.  Across the Coquitlam River from this old homestead is Upper Coquitlam River Park.  In low water you may be able to wade across the river but remember the flow of this river is controlled by the GVWD dam on the river. The trail follows close to the river and provides many opportunities to dip your feet in the cooling waters of the river.  At a point about 2.2 km from the trail head you will notice another well-defined trail on your right.  You can save yourself some muddy sections by returning on this trail.At the 3 km mark you will approach the Falls and Pritchett creek.  This makes a good turnaround for those only wanting a little exercise.  Provided the creek isn't flowing too high, as it was the last time I visited, you can continue another couple of kilometres until you come to the watershed fence.  You can also follow a branch on your right up to the trail network on Burke Ridge and then return to your start.Unless you have two cars this would be about 20 km of hiking.  It's feasible on bike but you will be pushing your bike for 30 minutes until you reach the trails on the ridge.",
    "directions": "Drive up to the top of Shaughnessey Street in Port Coquitlam until you get to its end at David.  You should see a sign that states \"Caution - unmaintained trail - use at your own risk\".  This the start of your loop.An alternate start would be to drive up Oxford St. in POCO until you are near the end at Lancaster St.  Here you will see another unmaintained trail sign.  Follow it for a 1 km until you reach the main trail.  The disadvantage of this is that if you want to complete the loop you will have a steep uphill climb back to the start.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/446/reg_181-Crystallized-Reflection-42721.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/446/reg_183-Crystal-Falls-42721.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/446/reg_CoquitlamRiverRideJune16_2002002.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/446/reg_CoquitlamRiverRideJune16_2002008.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/446/reg_CoquitlamRiverRideJune16_2002019.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/446/reg_CoquitlamRiverRideJune16_2002020.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/upper-coquitlam-river-trail-near-coquitlam-bc-446",
    "stats": {
        "Activities": "hike mtn-bike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 3,
        "Time": "3 hrs",
        "Total Distance": "0 km",
        "Town": "Coquitlam, BC",
        "Type": "out-and-back"
    },
    "title": "Upper Coquitlam River trail",
    "trail_id": "446"
}