{
    "description": "National Topographic Series Maps 82F/11 (Kokanee Peak) and 82F/14 (Slocan), at a scale of 1:50,000, cover the Kokanee Glacier Park area.\nLocated north of Nelson, beautiful Kokanee Glacier Provincial Park offers an excellent backcountry adventure for the whole family. Sitting mostly above 1,800 metres in elevation, the park has three glaciers - Kokanee, Caribou, and Woodbury - which feed over 30 lakes and are the headwaters of many creeks.\nThe new Kokanee Glacier Cabin is on the shores of Kaslo lake, and is ideally situated for summertime hiking and scrambling adventures. In the winter, Kokanee Glacier Provincial Park is a ski touring paradise, and the Kokanee Glacier Cabin is situated to best take advantage of the endless skiing terrain, and to provide you with an unforgettable experience.\nExcellent hiking, fishing and backcountry skiing hut. Summer access is by a 2 to 4 hour hike via Gibson Lake. Winter access is helicopter access only. Class A, sleeps 20 (12 in winter).\nPark Hazards\nIt must be emphasized that Kokanee Glacier Park is wilderness and any visitors must be entirely self-sufficient. All visitors should wear strong, waterproofed lug-soled boots and carry a daypack with rain gear, extra warm clothing and food. Weather conditions can change suddenly in this area and lightning storms with hail and snow are common in summer.\nOnly experienced mountaineers practised in crevasse rescue and properly roped, should venture onto snowfields and glaciers.\nThe 8 Kaslo Lake campsites are available for walk-ins on a \"first come - first serve\" basis.\nAn on-site ACC employee will collect fees for the campgrounds and cabin (for those who did not reserve through the ACC office in Canmore) from early June to late October. Tent sites and hut bedding must be cleared by 11:00am if you are not planning on staying that night. \nFor detailed information please visit the ACC hut webpage.  \nMore info on trails in the area, see our descriptions at  Kokanee-and-Kaslo-Lakes  and  Kokanee-Glacier-Park",
    "directions": "Summertime access to the Kokanee Glacier Cabin starts at the Gibson Lake trailhead. To get there follow Highway 3A from Nelson for 19 km to Kokanee Creek road which leads to Gibson Lake. From Gibson Lake hike past Kokanee Lake over Kokanee Pass and down to Kaslo Lake. The cabin is at the north end of the Kaslo lake, past the campground. Hiking distance is 7 kilometres with 485 metres elevation gain and 100 metres loss. Note that all roads in the park may not be suitable for low-clearance vehicles. Park visitors are recommended to protect their vehicle with chicken wire to deter porcupines from chewing on rubber hoses and tires.\nWintertime access is by helicopter only.\n Alpine Club  of Canada\n Information and copyrighted photos used with permission.",
    "geohash": "c2u",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/4478/reg_best1_kglacier-5-8779.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/4478/reg_kglacier-2-8779.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/4478/reg_kglacier-4-8779.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/4478/narrow_kgcview2-8779.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/acc-kokanee-glacier-cabin-near-nelson-bc-4478",
    "stats": {
        "Activities": "hike ski-bc",
        "From": "",
        "Seasons": "winter summer",
        "Stars": 5,
        "Time": "8 hrs",
        "Total Distance": "14 km",
        "Town": "Nelson, BC",
        "Type": "out-and-back"
    },
    "title": "ACC- Kokanee Glacier Cabin",
    "trail_id": "4478"
}