{
    "description": "The trailhead is relatively easy to find at 16 km. There are a few pullouts where you can park and organize your gear. The trail ascends steadily through a forested area for about 5 km before coming out into the U shaped Barkley Valley. Just past the old cabin site, there is a new hut built by the Cayoosh Recreation Club. It's in nice shape with a wood stove and room to sleep about 4. \r\n\r\nAfter the hut, the trail then starts heading up again, following the creek, switching back 10 times (on a nice, wide trail).  Two can walk abreast most of the way up to a couple of alpine lakes (Twin Lakes). \r\n\r\nThe nice wide trail ends just before you reach the lakes. The trail (such that it is at this point) goes around the west side of the first lake. Then you're pretty much on your own as you scramble over some rocks up to the next lake.  Both times I have been here, in June and August, it has been pretty chilly by the time we got up to this point so bring appropriate clothing. Coming over the last ridge you see the most beautiful valley below, with a river winding through it, surrounded by many peaks and ridges.  There is a sapphire blue lake hidden below the peaks to the east. Just hike down a little further to see it. This is a great spot to camp, as from here you can explore the surrounding area. There is a small stream coming down from the ridge so water is available. \r\nThere is plenty of opportunity for exploration in the surrounding peaks and ridges from here. The western ridge is significantly easier to access than the eastern one. Both offer spectacular views. The eastern one looks down into the Melvin Creek Valley. You can see forever. It's really something!",
    "directions": "From Vancouver, take Hwy 99 up through Pemberton to Mount Currie. Then take the Pemberton D'Arcy Road towards Birkenhead Park. About 2/3 of the way between Birken and D'Arcy there's a turn off to \"Devine\". Take this right, then your second right onto the Haylmore Creek Forest Service Road. Follow this road 16 km to the trailhead which will be on your left. The road is in good shape and a car can manage it although the last hill is a little steep and you may have to lighten the load a little to make it up.",
    "geohash": "c2",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/448/reg_56_flowers.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/448/reg_03_hut.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/448/long_panorama.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/448/reg_34_juliamarian1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/448/reg_14_marianhike1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/448/reg_09_barkleyvalley.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/448/reg_16_julialake1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/448/topo_reg_11_fstlake.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/448/narrow_05_flowerstream2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/448/narrow_13_campsite2.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/twin-lakes-melvin-divide-near-pemberton-bc-448",
    "stats": {
        "Activities": "hike mtn-bike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 5,
        "Time": "8 hrs",
        "Total Distance": "20 km",
        "Town": "Pemberton, BC",
        "Type": "out-and-back"
    },
    "title": "Twin Lakes - Melvin Divide",
    "trail_id": "448"
}