{
    "description": "This well marked and maintained trail ascends mostly through forest to the lake. There are plenty of scenic spots (creek, waterfalls, and views) along the way. Elevation gain is 850m. We were all ready to jump into the lake when we got there but dipping a toe in quickly changed our minds. Very pretty spot but unfortunately the bugs were so bad we didn't stay long. Apparently there is camping on the other side of the lake which makes a good base to explore the surrounding area from. There is also a new 9 km trail extending beyond the Lake and descending to Madely Lake. And there's more camping at Hanging Lake which is 3 km beyond Rainbow.",
    "directions": "From Vancouver, take Hwy 99 towards Whistler. Go through Function Junction to Alta Lake Road. Turn left here and follow the road around the lake for about 7 km.  You'll see the sign for the trailhead on the left.\n ... another user's entry that we merged into this description.\nThis trail is very unique. Starts with about a half hour climb up a dirt/gravel road that seems to go on forever. The first half hour of the hike once you reach the actual trailhead seems to have little to offer, until you enter the old growth forest. The first wooden bridge with water/waterfall is where the hike really begins. From there, it is a combination of flatlands (including amazing wooden platforms through bog/marsh areas) and uphill grinds that last about 5 minutes each. We did this hike June 24th and had to stop just after the viewpoint. There was snow from about 1/2 an hour in, but it was manageable until the viewpoint. Other hikers coming down said that the lake was mostly frozen, and the hike (40 min) from viewpoint to lake was almost impassable. The views all along this trail are stunning. Rocky mountains seeming just inches away, and the blooming life all around make this a great day hike, just be prepared for about an hour initially that might make you want to turn back.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/449/reg_IMG_6339.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/449/reg_SV402577-16522.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/449/reg_SV402592-16522.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/449/reg_SV402593-16522.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/449/reg_SV402599-16522.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/449/reg_SV402604-16522.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/449/reg_lillooet-camping-0110-6103.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/449/topo_narrow_rbl_cj.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/449/narrow_IMG-6302-22121.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/449/narrow_IMG_6299.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/449/narrow_SV402580-16522.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/449/narrow_SV402583-16522.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/449/narrow_SV402601-16522.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/449/narrow_rbl_aj.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/449/narrow_rbl_ca.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/rainbow-lake-trail-near-whistler-bc-449",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 3,
        "Time": "6 hrs",
        "Total Distance": "16 km",
        "Town": "Whistler, BC",
        "Type": "out-and-back"
    },
    "title": "Rainbow Lake Trail",
    "trail_id": "449"
}