{
    "description": "A beautifully finished and comfortable shelter for hikers or mountaineers. Summer access is by a 4 to 6 hour hike via Woodbury and Silver Spray Creeks. Winter bookings are not available due to avalanche hazard. Capacity is 10.\r\t \rLocated north of Nelson, beautiful Kokanee Glacier Provincial Park offers an excellent backcountry adventure for the whole family. Sitting mostly above 1,800 metres in elevation, the park has three glaciers - Kokanee, Caribou, and Woodbury - which feed over 30 lakes and are the headwaters of many creeks.\r\rThe Silver Spray Cabin was built in 1994 and is a great destination for strong hikers and mountaineers looking to explore this rugged and scenic corner of the park. Propane cooking, lighting and heating with propane supplied. Cookware or dishware is NOT provided. Sleeping is in the loft area on foam pads.\r\rFor detailed information please visit the ACC hut webpage.  \r\r\r",
    "directions": "Kokanee Glacier Provincial Park is located in southeastern British Columbia's Selkirk Mountains, a short distance north of Nelson.\r \r Summertime access to the Silver Spray Cabin starts at the Woodbury trailhead. To get there follow Highway 3A from Nelson to the marked turnoff 23 km north of Balfour. Follow the logging road for 13 kilometres. Note that the last 2 kilometres requires a high-clearance vehicle.\r \r The trail follows Woodbury creek for 1 km then turns right (North) up Silver Spray Creek, where many switchbacks will be encountered. Silver Spray Cabin hiking distance is 7 kilometres with 1016 (!) metres of elevation gain and will take most parties 4 to 6 hours.\r \r Note that all roads in the park may not be suitable for low-clearance vehicles. Park visitors are recommended to protect their vehicle with chicken wire to deter porcupines from chewing on rubber hoses and tires.\r \r The Silver Spray Cabin is officially closed in winter due to avalanche hazard and is unavailable for booking.\r  \r Alpine Club of Canada\r \r Information and copyrighted photos used with permission.",
    "geohash": "c2u",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/4490/reg_DSCN3803-30938.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/4490/reg_DSCN4145-30938.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/4490/reg_silverspray-1-8779.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/4490/narrow_silverspray-2-8779.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/acc-silver-spray-cabin-near-nelson-bc-4490",
    "stats": {
        "Activities": "hike climb",
        "From": "",
        "Seasons": "summer",
        "Stars": 4,
        "Time": "12 hrs",
        "Total Distance": "24 km",
        "Town": "Nelson, BC",
        "Type": "out-and-back"
    },
    "title": "ACC- Silver Spray Cabin",
    "trail_id": "4490"
}