{
    "description": "After lulling you into a false sense of security in the first 10 minutes or so, the trail starts climbing (gaining almost 3000 ft in elevation in only 3 km, in fact.)  After about 15 minutes you come to the first bridge, and a magnificent waterfall. Eaton Creek positively roars almost the entire way down from its inception at Eaton Lake and you get several views of it along the way which can be used as a good excuse to stop and catch your breath.  After the first bridge you move away from the thundering creek and into the quiet and clam of the forest. After the cool fresh air coming off the creek it can feel downright muggy. The trail continues to climb, switching back and forth. At about the half way mark (about 2600 elevation) is a bench beside a smaller tributary, which makes a nice place for a break.Shortly after the rest stop, you meet back up with Eaton Creek and the real work begins. The grade is considerably steeper for the next 1.5 km, gaining about 1000 ft. The last 1.5 km to the lake is an easy hike crossing a boulder field and two more bridges before reaching the lake at 6.5 km. When you finally do make it up to the lake you are rewarded for your efforts. The lake is beautiful and you will likely have the whole place to yourself. The fishing is absolutely phenomenal. We fished mostly in the river and could have literally scooped up dozens of the most beautiful trout I have ever seen. It was simply a matter or throwing your hook in front of the one you wanted to catch. The river was really shallow so you could see the fish perfectly. There is a nice spot to camp and plenty of peaks around to explore should you feel so inclined. Please note that the photo of the lake is in fact Eaton Lake. The photo was taken from above on a climbing trip. You will not in fact get this view on the trip described. Just thought it was a good shot to include.",
    "directions": "Considering the ruggedness of the trail, getting there is surprisingly easy. Take Highway 1 to Exit 168. Just before the bridge that crosses Silverhope Creek turn right and take Silver Skagit Road 16.7 km. Just past the 16km sign post on your right, there's a signpost for the Eaton Creek Forest Recreation Site on your left, turn there. There are a few places you can  park about 200m up. The trailhead starts a few meters past the parking area (about 200 meters from the turnoff).",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/450/long_IMG0493jpg_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/450/long_eatonlakegejpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/450/reg_06.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/450/reg_08.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/450/reg_26.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/450/reg_IMG0386jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/450/reg_IMG0414jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/450/reg_eaton-11545.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/450/reg_eaton2-11545.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/450/reg_eatonlaketopojpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/450/narrow_01.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/450/narrow_02.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/450/narrow_07-16-2008-008-16237.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/450/narrow_IMG0382jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/450/narrow_IMG0383jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/450/narrow_IMG0393jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/450/narrow_IMG0408jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/450/narrow_IMG0410jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/450/narrow_eaton-2-11545.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/eaton-lake-near-hope-bc-450",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 4,
        "Time": "5 hrs",
        "Total Distance": "82 km",
        "Town": "Hope, BC",
        "Type": "out-and-back"
    },
    "title": "Eaton Lake",
    "trail_id": "450"
}