{
    "description": "YNTS Map: 92G7. ou can rent a canoe at the park or bring your own.  I heard that they don't take reservations for parties of less than 10.  Put in, and paddle across Pitt River to the mouth of Widgeon Creek.   There are a zillion powerboats, or there were when we were there, so be careful.   Once you get across the river you're safe though. \r\n\r\nIt had been really dry here all summer the year we did this trip, so the creek was about 3 feet lower than usual judging from the waterline on the shore.   Navigation was a little tricky as you have to dodge sandbars and weeds but it really wasn't a big deal.  We spent plenty of time up to our ankles in the water pulling our canoe behind us but the bottom of the creek is sandy and the water is beautiful, clear, and warm.  Often we waded along when we could have easily been paddling.\r\n\r\nThere are lots of great little white sand beaches along the way where you can stop for a picnic or a swim.\r\n\r\nWidgeon creek is actually a wildlife reserve so there are lots of birds. Bring your binoculars if you're into that kind of thing.  We saw some really neat ones.  No idea what they were but they had cool tail feathers.\r\n\r\nThere was a lot of traffic on the creek the weekend we were there but there was room for everyone to manoeuvre.\r\n   \r\n After about an hour and a half of easy paddling, we reached the Forestry campsite.  I counted 48 canoes pulled up on the shore and that was enough to scare us off.  There is room for 10 tents.  We kept going up the creek a little ways and found a wonderful spot which we had all to ourselves.   When we headed back the next day there were only 6 canoes on the shore so I guess most people were just up for the day.  There's a short hike to a waterfall from the campsite.  We didn't do it but we will next time. \r\nOur campsite had a nice sandy spot for our tent and a fire ring.  We \"hiked\" up the creek for about half an hour, which was really interesting.  It was so low that we never got in any deeper than waist deep and it was neat to see the riverbed with little or no water in it in spots.   We went back with our fishing gear after a little later and caught a few really ugly little catfish.  Not much else in there.   \r\n\r\nAfter hiking and eating dehydrated food and power bars, it was a nice treat to make sandwiches for lunch, pasta and sausages for dinner, and bacon, eggs, and toast for breakfast in the morning.  It felt positively decadent! We headed out around 10:00 the next morning.  The creek was pretty quiet until almost all the way back.  We fished a bit on Pitt River with no luck.  I'm not surprised though.  The powerboats were making SO much noise.  We did have 2 seals pop up beside us and play for a few minutes on the surface before disappearing.   That was a surprise since Pitt River is fresh water and not really anywhere near the ocean. \r\n\r\n There is GPS data attached to this trail (see \"download GPS\"), which if loaded into your GPS can help you find route points.",
    "directions": "From Vancouver, take Hastings which turns into Barnet Highway.  Stay on the Barnet Highway until you reach the Dewdney Trunk Road.   Turn left on Neaves Rd. and follow it all the way up to Grant Narrows Park.\r\nFrom Hwy 7 in Coquitlam, turn onto Dewdney Trunk Road 6 km east of the Pitt River Bridge. Stay on Dewdney Trunk Road and turn left on Neaves Road (208th Street). Travel north to Grant Narrows at the south end of Pitt Lake in 18 kms. Kayak or canoe southwest to the north end of Siwash Island and cruise the channels of the Widgeon Estuary. It is quite well marked. \r\n\r\nReach this area also via Hwy 1 (Trans-Canada) by taking Exit 44 on the west side of the Port Mann Bridge. Follow Hwy 7 north toward \r\nCoquitlam and the Pitt River Bridge.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/451/reg_mark_canoe.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/451/narrow_stern.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/451/narrow_wigeon_camp.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/widgeon-creek-spidergirl-near-vancouver-bc-451",
    "stats": {
        "Activities": "river-canoe hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 3,
        "Time": "7 hrs",
        "Total Distance": "8 km",
        "Town": "Vancouver, BC",
        "Type": "out-and-back"
    },
    "title": "Widgeon Creek (Spidergirl)",
    "trail_id": "451"
}