{
    "description": "The Village of Cumberland has an amazing hikingbiking trail system.  The trail described here is only a fraction of the many possibilities.  Consult the map for additional ones or contact the riding fools hostel in Cumberland.  Also, I believe that all the trails support mountain biking so hikerstrail runners and bikers beware of each other.  Also this area is known for their black bears so it is not a bad idea to wear a bear bell.  One last thing to be aware of is due to the higher elevation of this area, in the winter months there may be snow in this area while the Comox Valley is snow free.  So be prepared for all possibilities.\nThis trail takes about 3 hours to do and takes you through the woods and up to a view point where you can see the Village of Cumberland and beyond.  This hike is a combination of a loop as well as going back on yourself.  \nFrom the parking lot turn left down Sutton and when the road bends right head straight through the gated gravel road.  At the T junction make a right and in a few minutes you will see the sign on the right for the Mama bears trail of tears.  Follow this trail ten minutes and when you come out to a logging road make a right.  In a little while the road veers right, head straight onto Buggered Pig.  Follow the trail as it veers right, follow this for another 10 minutes at which point you will come onto a technical mountain biking section, make a right here.  In about 20 minutes you will head past Bronco Perseverance and come out to a road. Make a right and go over the bridge.  Your elevation gain begins.  After 40 minutes of following this road you will see an opening on the right.  This is your lookout point.  Have a break here before you head back.  \nYou follow the exact way back until you get over the first major bridge that you crossed, here make a left and take the Bronco Perseverance trail back.  The view here of the rushing stream bellow is nice, just stay away from the edge, it's a long way down!!  Follow this trail for the next 30 minutes at which point you will be in familiar territory.  Make a left on a logging road and then another left onto Mama Bears Trail of tears.  Follow this all the way home.  \nThis short trail will give you a good idea of what the trails are like in this section of Cumberland.",
    "directions": "Head to Cumberland and head down the main road, Dunsmuir, to the Cumberland Recreation Institute.  You will see it on the left and park in the parking lot at the corner of Dunsmuir and Sutton.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/4521/reg_IMG-4788-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/4521/reg_IMG-4789-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/4521/reg_IMG-4795-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/4521/reg_IMG-4796-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/4521/reg_IMG-4799-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/4521/reg_IMG-4801-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/4521/reg_IMG-4803-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/4521/reg_IMG-4804-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/4521/reg_IMG-4809-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/4521/reg_best1_IMG-4798-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/4521/reg_cumberland-4612.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/cumberland-forest-near-cumberland-bc-4521",
    "stats": {
        "Activities": "hike mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "3 hrs",
        "Total Distance": "10 km",
        "Town": "Cumberland, BC",
        "Type": "out-and-back"
    },
    "title": "Cumberland Forest",
    "trail_id": "4521"
}