{
    "description": "The Lynn Lake trail, in the Lynn Headwaters Regional Park in Vancouver's North Shore mountains,The trail is flagged, though probably not recently. Expect windfall and slides to make route finding still an issue at times. It's a pretty treacherous, steep, rooty, slippery, buggy trail, with few views.\nFrom the park entrance at the end of Lynn Valley road, Cross the bridge at Lynn Creek.  Take the Lynn Loop Trail upstream, and continue along the creek on the Cedars Mill Trail (i.e. don't follow the Lynn Loop trail up the hill).  After two km, the Cedars Mill Trail will hook up with the Headwaters Trail.  Follow this to Norvan Creek, where the Coliseum Mountain trail heads up the hill to your right, and closer to Norvan Creek, a short trail climbs the south bank of the creek to the picturesque Norvan Falls.  Stay left at both these trails (though a short return detour to Norvan is worth the effort) and cross Norvan Creek by the well engineered bridge.\nAbout 1km on you come to the trail intersection for the Hanes Valley Route (left) and the Lynn Lake Trail (right).  The Hanes Valley Route continues left up Hanes Creek to Crown, Goat and Grouse Mountains.  Take the Lynn Lake Route right, up Lynn Creek.  Cross over Coliseum Creek about 1km on, then cross to the left side of Lynn Creek after another 1km.  The trail passes Lynn Lake on the west to end at the NW end of Lynn Lake at the head of the valley.\nThe return trail is via the same route.\nNote:  this trail can be particularly treacherous during and winter and spring months.  The trail navigates up and across numerous avalanche slide paths, weather can be unpredictable, and you will need to be trained and equipped for mountainous backcountry snow travel, avalanche danger assessment and avalanche rescue.\nMap: NTS 92G06\nTrail Conditions: GVRD Parks website",
    "directions": "By public transport: Take the 228 bus from Lonsdale Quay and get off at the terminus at the top of Lynn Valley road. Follow the road into the park. \nBy car: To get to the trail-head, take the Lynn Canyon exit just off the Upper levels Highway in North Vancouver. Then you take Lynn Valley Road north past the turn-off to Lynn Canyon Park (you have to go past it). Follow the GVRD signs into Lynn Headwaters Regional Park.  Park at the park entrance at the end of Lynn Valley Road.\nCross the bridge over Lynn Creek.  You'll see the Lynn Loop Trail heading upstream on your left.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/4580/reg_P8260009-23165.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/4580/reg_P8260014-23165.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/4580/reg_P8260016-23165.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/4580/reg_P8260018-23165.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/4580/reg_P8260019-23165.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/4580/narrow_LynnHeadmap-lynnlake-6103.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/lynn-lake-trail-lynn-headwaters-regional-park-near-vancouver-bc-4580",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 3,
        "Time": "8 hrs",
        "Total Distance": "22 km",
        "Town": "Vancouver, BC",
        "Type": "out-and-back"
    },
    "title": "Lynn Lake Trail - Lynn Headwaters Regional Park",
    "trail_id": "4580"
}