{
    "description": "NTS Map: 092G06According to Peg Moir, our senior contributor of walks/hikes, this trail has some flat and steep sections, and a couple of hours should be allowed.  \r\n\r\nGetting to Bowen Island is easy, and it does have that island feel,a nice day-trip.  From Horseshoe Bay, take the ferry to Snug Cove (check for ferry times), and if driving, follow Government Road to Grafton Road, to Mt. Gardner Road, until you reach Crippen Regional Park.  You may also walk, it will only take you 45min from Snug Cove, which is more cost effective as it does not involve paying taking your vehicle on the ferry.  In town, while waiting for the return ferry you can have lunch at the pub, and, do a little research for your next visit. \r\n\r\nKayaks are rented right in Snug Cove, if you want to plan a full day or weekend excursion.\n\r\nFor a more rigorous option, check out the 'Mt. Gardner' hike, to a heli-pad on Bowen's peak, a favourite early season hike for Vancouverites.\nOPTION\n\r\nThe Dorman Point Trail is not far from the ferry, about a half hour uphill.  Ask in town, when you get off the ferry, it's  near the Snug Harbour picnic area.  Allow an hour to return.\r\n\r\nFor those looking for a somewhat more involved hike, check out  Mount Gardner",
    "directions": "See description and / or GPS",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/46/reg_Crippen.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/46/reg_killarneylake-9858.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/46/reg_killarneylake2-9858.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/46/reg_killarneylake3-9858.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/46/topo_Bowen.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/killarney-lake-bowen-island-near-vancouver-bc-46",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "5 km",
        "Town": "Vancouver, BC",
        "Type": "out-and-back"
    },
    "title": "Killarney Lake Bowen Island",
    "trail_id": "46"
}