{
    "description": "Kayak/Canoe Widgeon Creek EstuaryThere is nothing better than to cruise flat water with rippling reflections of big snowy mountains cascading off your bow. The estuary of Widgeon Creek at the south end of Pitt Lake at Grant Narrows is the perfect place to enjoy this sensation. If you like quiet peaceful waterways teaming with bird life this is the place to go for the whole estuary is a protected bird sanctuary.  After making the 300m crossing of Grant Narrows, expect to see tons of waterfowl and other species from herons to harlequins that make this area their habitat. You might even see a fleeting glimpse of muskrat or beaver if you are lucky.If Widgeon Creek is high in the spring or early summer you can paddle quite a distance up under lazy overhanging branches draped in moss and lichen. Huge lush ferns and skunk cabbage line the shoreline in the marshy areas and neat little gravel bars are gathered in the bends of the creek. When you are there you will be amazed that you can be so close to the city yet so far away.A campsite is located near the west end of the estuary if you want to stay longer. This is probably best to do in the shoulder season when it isn't so busy. If the water is high more secluded sites are located up the river.If you want to venture out on late spring and summer weekends, go early. We were on the water on a mid?June Sunday at 730 am. The launch site at Grant Narrows can be quite crowded. There is a separate area for canoes and kayaks but the area is busy with lemming-like activity  that warm weekends can produce. It's great the estuary is off limits to anything with a motor. In the fall and winter hardly anybody will be around and the snow will be low on the surrounding peaks. This is a perfect trip for either a few hours or a whole day.Contacts:Ayla Canoe Rentals  Grant Narrows  604-941-2822  Rentals April to October.Approach\tFrom Hwy 7 in Coquitlam, turn onto Dewdney Trunk Road  6 km east of the Pitt River Bridge. Stay on Dewdney Trunk Road and turn left on Neaves Road (208th Street). Travel north to Grant Narrows at the south end of Pitt Lake in  18 kms.  Kayak or canoe southwest to the north end of  Siwash Island and cruise the channels of the Widgeon Estuary. It is quite well marked.  Reach this area also via Hwy 1 (Trans-Canada) by taking Exit 44 on the west side of the Port Mann Bridge. Follow Hwy 7 north toward Coquitlam and the Pitt River Bridge.",
    "directions": "See description and / or GPS",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/460/reg_great-blue-heron-2971.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/460/reg_widgeon2trailpeakmaurer_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/460/reg_widgeonfalls-47918.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/460/reg_widgeonreflectiontrailpeakMaurer.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/460/widgeon_4_trailpeak_maurer.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/460/widgeon_trees_trailpeak_maurer.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/widgeon-creek-near-vancouver-bc-460",
    "stats": {
        "Activities": "river-canoe sea-kayak",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "5 hrs",
        "Total Distance": "5 km",
        "Town": "Vancouver, BC",
        "Type": "out-and-back"
    },
    "title": "Widgeon Creek",
    "trail_id": "460"
}