{
    "description": "This is a short section of the Kettle Valley Railway trail. It's an in and out on basically the same trail although you can make a loop around the marsh area of North Vaseux Lake. The reason you have to return to the start is there is no bridge at the south end of Vaseux lake over the Okanagan River. \nThis trail isn't as well used at other portions of the KVR hence it is more overgrown in places. Plus near the south end there are a couple sections with loose gravel.\nIt's a scenic trip plus you go through the marsh area where on occasion a number of birds can be sited.\nGPS data attached uses both marsh trails and KVR for return. \nIt's a park and nature preserve area along the west side of Vaseux lake so you are required to stay on the trail",
    "directions": "Start in Okanagan falls. There are multiple ways but the objective is to follow the Okanagan river channel south. You have to be on the west side by the time you encounter the fourth dam crossing.\nOne place off Cedar street there is parking opposite Thomas place you can see the trail from there.\nAnother is start with Green Lake road, just south of the camp ground there is access to the channel pathway trial which leads to the KVR.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/4611/reg_eagle-6-7279.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/4611/reg_from-vaseux-kvr-7279.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/4611/reg_kvr-vaseux-3-7279.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/4611/reg_ok-falls-channel-1-7279.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/kettle-valley-railway-okanagan-falls-to-south-vaseux-near-oliver-bc-4611",
    "stats": {
        "Activities": "hike mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "3 hrs",
        "Total Distance": "20 km",
        "Town": "Oliver, BC",
        "Type": "out-and-back"
    },
    "title": "Kettle Valley Railway - Okanagan Falls to South Vaseux",
    "trail_id": "4611"
}