{
    "description": "Closest Town: Harrison Hot SpringsSeason: late May to OctoberDifficulty: Moderate - some minimal route finding needed, and there is a lot of deadfall the last 3 Km.Hiking time: 4 to 6 hours depending on your average ascent speed.Elevation gain: 3200 feet.There is nothing special about this trail, except that it has some great views, which are accessible early in the season. At the beginning of the hike (trailhead), there is a gate and two signs, one giving you the distance to the top, and another one indicating that you are in fact on the Bear Mountain forest service road. Go past the gate and you start gaining altitude immediately.  You will soon pass a rusty old boiler of sorts, and after the first turn, something that looks like an old storage building. In the beginning the trail is more like a gravel road, but after about 30 minutes hiking the road deteriorates and walking on it becomes more pleasant.  After 45 minutes, or around 920 feet of elevation gain, you arrive at a lovely little waterfall and the first chance (and the only one unless you go to Bear lake) of getting cooled off. Keep in mind that this is also the water source for the community at the trailhead. Pushing on, you continue to hike the switchbacks steadily gaining elevation. The next little resting spot is after 1 hr 15 minutes at 1600 vertical feet from the parking lot. This is a good snack spot for a job half done, but save your camera for later. You do get some views from this spot, but there are far greater opportunities for great pictures further up. Between 2200 and 2600 feet or 2 hours of hiking as you pass two talus slopes, you get some wicked views of Harrison Lake and mountains to the north and northwest of the lake. Some great views of the Harrison River are also right in front of you. This river is finally joining the Fraser further downstream. This is the time to get your camera from your backpack and take some pictures.Passing the viewpoints and talus slopes, you soon arrive at the intersection for Bear Lake to your right, and the trail to the Bear Mountain Lookout to the left. Continuing towards the lookout, you will find that the trail soon gets overgrown with deadfall and trees. The trail also becomes single track at points. Due to all the deadfall it is advisable to use hiking pants regardless of the temperature. The trail continues for another 2.5 km before you reach a not too obvious trail on your left side, the best sign being that the Service Road/Trail is going no further. To this point you have only gained another 450 feet from the two talus slopes. Making the left turn, the trail becomes faint, and you have to rely on your sense of direction at points. Look for the red squares, and a distance marker saying 9 km. At the beginning the trail gains some altitude, and keeps to the right of a little ridge. You will slowly go left and cross some small ponds, being on the left side of a little valley. Follow the ridge as far as it goes, trying not to stride too much left. The ridge narrows as you reach your destination, the Bear Mountain lookout. It is like turning on the light inside your tent at night.  Coming out of the forest, and all of a sudden you see the whole Fraser Valley in front of you. The Cheam Mountain range straight ahead, Hope to your left, Mount Baker in the distance and on a very clear day without too much smog, Vancouver on the right. Total hiking time to the lookout should not be more than 2 hrs 30 minutes for an intermediate hiker and 3 hrs 30 minutes for a slower pack. Going down is fast once you pass the Bear Lake intersection, and total hiking time should not exceed 5 hours. The views being enormous at the lookout, you might want to add another hour or so for lunch at the peak.Being back at the trailhead, make sure you have some time to spare in Harrison for a swim in the lake or a dinner in one of the local eateries.",
    "directions": "To get to the trailhead you have to take the Number 1 Trans-Canadian Highway or Highway 7 towards Harrison Hotsprings. Once in the township of Harrison Hotsprings make a right turn at Lillooet Avenue, and continue 5 km until you reach a small hill.  Just before the top of the hill make a right turn onto a gravel road, and this is the trailhead just 50 meters off the road.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/462/reg_HarrisonLake2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/462/reg_IMG-8460-26159.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/462/reg_IMG-8517-26159.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/462/reg_IMG-8536-26159_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/462/reg_IMG-8607-26159.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/462/narrow_BearMtnPrettyFall.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/bear-mountain-near-harrison-hot-springs-bc-462",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 3,
        "Time": "5 hrs",
        "Total Distance": "19 km",
        "Town": "Harrison Hot Springs, BC",
        "Type": "out-and-back"
    },
    "title": "Bear Mountain",
    "trail_id": "462"
}