{
    "description": "While staying at a local hotel in Bedford, a community near Halifax, I discovered a trail that follows a creek all the way back to the main highway. Looking at Google Maps, I discovered that the area of protected forest is called Hemlock Ravine Park. I am not aware of how many trails are in the park, but from hiking the trail, it has suffered major blowdown damage from a hurricane a few years back. I rated it difficult due to crossing over all those trees.The trail basically follows along the creek from behind the Comfort Inn hotel right to the 102 highway. When you get far enough away from the residential perimeters, it almost feels like a rainforest in there. Huge trees, some 300 year old hemlocks, create a canopy, with the gurgling water to punctuate the ambiance.Nearing half way into the trail, your path begins to get more difficult because of the huge trees that have fallen from a while ago. It seems that no one has gone in there to do trail maintenance since then. It was quite a challenge to get in, around or under all the downfall, but a fun exercise never the less. The dog had the better time than I did.For an urban trail, I think this one is a gem, all be it short. In no time, you can feel like you're back in the wilderness, with only a growing sound of highway traffic as you approach the end. The terrain is rocky and rooty, with a very low grade climb to match the waterway. If it weren't for all the downed trees, it would be a great commute shortcut, xc ski or trail run exercise. It must be beautiful in the winter.Shannon BurtEast coast editorHello.  New local resident here.  I've known of this trail for some time and now that I live in the area I've decided to apply some of that missing maintenance.  Those fallen trees will no longer be a problem, eventually.  :)  Wookie",
    "directions": "following the Bedford Highway toward Halifax, look for the Comfort Inn on the right. Beyond the picnic table in the parking lot, beside the hotel is the trailhead.Alternatively, along the Bedford highway, drive past a distinct white round house along the rail tracks (driving away from Halifax) Turn left at Kent Avenue. Parking lot and trailhead is located at the end of the road.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/4668/IMG_0227.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/4668/narrow_IMG-0187-27111.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/4668/narrow_IMG-0223-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/4668/narrow_IMG-0225-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/4668/narrow_IMG-0227-27111.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/4668/narrow_IMG-0227-6702.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/hemlock-ravine-park-near-halifax-ns-4668",
    "stats": {
        "Activities": "snowshoe hike ski-bc ski-xc mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "2 km",
        "Town": "Halifax, NS",
        "Type": "out-and-back"
    },
    "title": "Hemlock Ravine Park",
    "trail_id": "4668"
}