{
    "description": "UBC Pacific Spirit Park is a popular network of trails for hikers, walkers, runners, and mountain bikers alike. Only certain trails allow mountain bikers, and generally the mountain biking crowd has long since departed UBC for more favoured, challenging trails on the North Shore.  However, for it's proximity to Vancouver, getting out to UBC is still an enjoyable quick fix for those who like to ride cross-country.  \r\n\r\nThere are a few notable routes for mountain bikers.  For one, start down at Spanish Banks beach and see if you can ride up the fairly steep ravine (\"Spanish\") to the upper trails on the other side of 4th.  Sword Fern - the part that is open to bikes - also has some nice twists and turns.  Also note, if you get to the very corner of the endowment lands and 16th, you are close to the concrete platform pictured here (and labelled as resevoir on the map) which is an excellent place to practice wheelie drops and manual lifts!  the closest trail here is called Sasamat. Just watch out for the glass on the platform. The campus itself has some excellent urban riding options.\r\n\r\nYou can take some of the trails down to the beach, and back, giving you some elevation change that is otherwise hard to find. To get there, take 10th Ave W all the way into the campus, or, park down by Jericho beach or Spanish Banks and walk/bike in. Another option, is follow 16th into the park and park anywhere along the side of the road, you'll generally see other cars parked there.\r\n\nMap of UBC Pacific Spirit Park: NTS 092G06",
    "directions": "See description and / or GPS",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/47/reg_JasonUBC.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/47/reg_best1_cache3pic.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/47/reg_kurtUBC.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/47/reg_map.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/47/topo_UBC.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/ubc-pacific-spirit-park-near-vancouver-bc-47",
    "stats": {
        "Activities": "hike mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "15 km",
        "Town": "Vancouver, BC",
        "Type": "out-and-back"
    },
    "title": "UBC Pacific Spirit Park",
    "trail_id": "47"
}