{
    "description": "June 1st/'08. Pincher ridge (Castle Crown Wilderness Area).\nHere are a few pix from a rainy day June hike on Pincher ridge in the Castle Crown.\nThe day started with us knowing there were possibilities of rain... and rain it did! We were reasonably dry until noon but cut the day short, just as we made it to a high point on Pincher ridge.\nThere are multiple routes up Pincher Ridge (see Nugara's book, More Scrambles in the Canadian Rockies for alternate route). \nOur route followed the road towards Victoria ridge for a few minutes, then cutting left (south) following a rough ATV trail for a few minutes - there were some odd low lying electrical wires at this point, and a stream crossing. Some bushwhacking was involved to gain the ridge, but once on the ridge the trees clear up and the views get a lot more impressive. There was a small amount of hands on class III scrambling to get past a rocky outcropping. We never made it to the summit as it started to rain at that point.",
    "directions": "Take Hwy. 6 south from Pincher creek towards Waterton National Park and take the first right after the CPR train bridge. This road leads west towards the Shell plant. Continue past the Shell plant where there are huge yellow blocks of sulfur and enter the forestry reserve. Stay right at the first fork in the road and continue until the storage complex where the West road is gated. The road turns North here but if you continue to the gate you will see a sign describing the Castle special management area and hiking for Victoria ridge. Find a place to park your car for the day near here.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/4719/long_approachsml-7490.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/4719/long_going-down-mergedsml-7490.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/4719/long_on-ridgesml-7490.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/4719/reg_IMG-3295-7490.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/4719/reg_shooting-stars-in-front-of-Victoria-Peak-7490.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/4719/narrow_IMG-3280-7490.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/4719/narrow_IMG-3281-7490.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/4719/narrow_IMG-3284-7490.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/4719/narrow_IMG-3287-7490.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/pincher-ridge-near-pincher-creek-ab-4719",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 4,
        "Time": "8 hrs",
        "Total Distance": "10 km",
        "Town": "Pincher Creek, AB",
        "Type": "out-and-back"
    },
    "title": "Pincher Ridge",
    "trail_id": "4719"
}