{
    "description": "This trail has a tremendous variety of terrain for the beginner to the seasoned hiker. It rises from sea level to 700m. At that point there's an excellent viewpoint - supposedly a helipad clearing - with an spectacular view of Harrison Lake to the north. Picnic here or continue for another few Km's to Campbell Lake.\nA few minutes from parking at the trail head brings you to a water reservoir and lookout. Continue around the right side and follow the trail for about an hour up to Hydro Tower 92. Rounding the tower, continue up through the forest. The trail is quite well marked but has changed over time in some sections. When in doubt, check upward until you locate markers again. Check your footing before crossing bridges, wooden stairs or large rocks. You may find it easier to walk along side some of them.",
    "directions": "Take Hwy 1 east of Vancouver past Chilliwack to the Agassiz exit, just before Bridal Falls. Drive north over the Fraser River bridge, west through Agassiz, and continue on Hwy 7/9 west to the 3-way stop. Turn right onto Hwy 9 north for about 4.5 Km until you reach Balsam Ave. on your right. Park at the turnout to your left - the west side of Hwy 9. There are 2 warning signs at the gate. There's also a 3rd welcoming sign for hikers to Campbell Lake.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/4743/reg_IMG-6977-35773.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/4743/reg_IMG-6990-35773.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/4743/reg_IMG-7499-35773.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/4743/reg_IMG-7522-35773.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/4743/narrow_IMG-6985-35773.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/4743/narrow_IMG-7483-35773.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/4743/narrow_IMG-7490-35773.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/harrison-lake-south-campbell-lake-trail-near-harrison-hot-springs-bc-4743",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "5 hrs",
        "Total Distance": "7 km",
        "Town": "Harrison Hot Springs, BC",
        "Type": "out-and-back"
    },
    "title": "Harrison Lake South - Campbell Lake Trail",
    "trail_id": "4743"
}