{
    "description": "12 Mile Coulee is a Mountain Bike ride or hike that nearly makes you forget it is in the middle of town, err city, (of 1 Million).  Lots of free local parking.  In the spring after the big rains of the last week there were some serious rapids and stream ridin' to be done.  It makes a fun evening ride and/or that can be combined with any number of other city pathway rides to make it any length you want.  There is about 110m of elevation gain from Bowness to the top of 12 Mile.If you are a total shuttle rider, get dropped off on Tuscany Boulevard NW just west of Stoney Trail.  We voted for the cardio version and parked at Bowness Park, rode across the footbridge hanging under Stoney Trail bridge, along the bridge over the tracks, and take a sharp right u-turn and cross under your path along Bearspaw Dam Road, then a right (North) up the trails besides the water plant facilities to the large culvert / pedestrian bridge under Nose Hill Drive NW and start following the trail(s) up the coulee.We took a higher path going up the coulee as we thought the extremely wet conditions would make riding up the stream itself very tough.  Coming down the coulee we opted for the wet path and we well rewarded with technical, twisty singletrack with multiple creek crossing, 1/2 of which were rideable, the other 1/2 dump you on your head as the murky, muddy water obscure underwater boulders and scoured deeper pools.I've also ridden it in late fall after a freeze.  Equally cool.This is a fairly rocky trail and when frozen or wet can be dangerous.",
    "directions": "NW Calgary, Start at Nose Hill and Stoney Trail or Bearspaw Dam Road or at Bowness Park or anywhere along the river trails to this area.",
    "photos": [],
    "source_url": "https://trailpeak.com/trails/12-mile-coulee-near-calgary-ab-4746",
    "stats": {
        "Activities": "hike mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "11 km",
        "Town": "Calgary, AB",
        "Type": "out-and-back"
    },
    "title": "12 Mile Coulee",
    "trail_id": "4746"
}