{
    "description": "Some very kind locals gave us a detailed map on how to get to this secluded trail. Supposedly the sweetest, smoothest, ?Kamloopiest? ride around. The way to get there is a bit complicated, taking dirt/rock roads up into the mountains for about 30 minutes up, up, up. Then once you park it's more up, up, up, as you push your bike through herds of cattle (if they happen to be near the double track). Once you get to the top, the view is astounding. The terrain on the way down changes dramatically several times and there is a cool section (the locals call it the ?Return of the Jedi?) where the single track weaves and bobs closely between trees. All in all it was a smooth trail, steep in some places, very dusty, tight switchbacks where you must lower your speed. Other times it's traversing. Personally, though it's much shorter.  Rose Hill is still the sweetest ride in Kamloops. Dew Drop was fun, but Rose hill is better :) I would recommend Dew Drop, but also recommend confirming with locals on how to get to it or use attached GPS data. There is GPS data attached to this trail (see \"download GPS\"), which if loaded into your GPS can help you find route points.\r",
    "directions": "Take Tranquille Road past the Kamloops airport and golf course. Enter the Lac Du Bois Grasslands Provincial Park to Criss Creek Road, and then go left on to Frederick Road. This road is approximately 8 km long and ends at Kamloops Lake, but you are instead looking for a parking area just 300m in on Frederick Road and to the right.  The GPS data above includes the start to Dew Drop, as well as other local Kamloops rides for reference.\r",
    "geohash": "c",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/475/reg_ddtrail.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/475/reg_dewStart.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/475/reg_rider.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/475/topo_range.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/dew-drop-near-kamloops-bc-475",
    "stats": {
        "Activities": "mtn-bike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "10 km",
        "Town": "Kamloops, BC",
        "Type": "out-and-back"
    },
    "title": "Dew Drop",
    "trail_id": "475"
}