{
    "description": "A brief description from the Municipality of Whistler website:\n\"The Whistler Interpretive Forest is a joint project of the B.C. Ministry of Forests, the RMOW and Western Forest Products Ltd. Within, its approximately 3000 hectares you will discover a wide variety of landscapes, forest types, geological formations, fish and wildlife habitats - all accessible via an extensive road and trail network.\n\"The trails extend throughout the forest, allowing visitors to experience the various forest conditions. The major trails are the Ridge and Riverside Trails which are connected to the Farside and Highline Trails by a new suspension bridge. Access for kayakers, anglers, snowshoers, cross-country skiers, cyclists and hikers has been carefully planned, with most trails designated multi-use and a few walking only trial.\n\"The changing landscape of this valley reflects nature's role through floods and forest fires, and more recently, forest harvesting activities and recreational  pursuits, The earliest logging began here in 1958 and continues to the present. Today's landscape consists of old growth stands plus a variety of plantations. Click here for the Whistler Interpretive Forest Trail Map. \n\"Reminder: all sites within the Whistler Interpretive Forest are day use sites only. No overnight camping please.\"\nThe area covers 3000 hectares at the south end of Whistler, with numerous trails of great variety, some along the Cheakamus River, some around a crater rim, with flora varying from your typical west coast heavily forested to much more open pine forest in the higher areas. \nDepending on where you park, this hike can be as short as 5-6 km, to as long as 10-12. On the day we hiked it on June 14, 2008, we parked near Hwy 99 at Function Junction, walked west on the road across the 1 lane bridge and then along the river. Other options are to drive across the  one lane bridge, keep left and park in one of the parking areas along the river. Others can drive up the West Side Road (gravel, a bit rough in areas, but drivable with a regular car) all the way to Loggers Lake (2 km or so) and did basically a walk around the lake.\nAnother option is to walk along the trails on the east side of the river (between the river and Cheakamus Lake Road) all the way to the suspension bridge (approx 2 km), cross over the bridge and continue along the west side.\nSee the GPS data for the hike around the crater. Photos to follow soon.\nFurther info and photos on these trails can be found on these trails:\nCheakamus River Walk\nCrater Rim\nThe area along the river is sometimes referred to by Whistler mountain bikers and hikers as River Side.",
    "directions": "At the Function Junction lights upon arriving in Whistler, turn right. Go approx 500 m., turn left onto the Cheakamus Lake Road, and then immediately right across the one lane bridge. Park nearby. The trail starts on the left just across the bridge.\nThe Olympic Village is being built just across the bridge, with a new bridge being built, such that these access directions could change again by 2009-2010.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/4754/reg_WIFCraterRim6023-7359.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/river-side-to-crater-rim-whistler-interpretive-forest-near-whistler-bc-4754",
    "stats": {
        "Activities": "snowshoe river-kayak hike ski-xc mtn-bike",
        "From": "",
        "Seasons": "winter summer",
        "Stars": 4,
        "Time": "4 hrs",
        "Total Distance": "10 km",
        "Town": "Whistler, BC",
        "Type": "out-and-back"
    },
    "title": "River Side to Crater Rim - Whistler Interpretive Forest",
    "trail_id": "4754"
}