{
    "description": "The trail to Unneccessary mountain is very steep and bushy.  When it starts off it is steep.The trail is very steep as you climb a hug rockl face. I then levels out but then steepens right back up again. As you climb the trail for about an hour an a half you have a rope to help you climb up a steep rockface. THough, like many trails, the farther up you go the views get better and better. You can see all of Howe Sound  but not the summit of the mountain itself. After another half an hour you climb a pretty, not steep meadow. It clears out and have the best of ans can see all the summits of the lions, brunswick, and mount harvey. After this great viewpoint and maybe a bute for lunch, climb the last steep rock face for about half an hour to the summit. You can then continue east or west on the howe sound crest trail. East  is to Cypress Bowl, or west to the lions.The average grade to the top if unneccessary is about 25 percent grade.",
    "directions": "Take highway 99 on the sea to sky highway for about nine kilometers. Then, pass calvin grove and  and turning right onmto oceanview road. Keep right onto oceanview road. follow  oceanview road all the way to the top. Then park at the roundaout\r If the gate to the gravel road is open do not drive up! Continue up the grvel road left up a corner. When you reach a white sign right before the secont water tower turn right onto the trail.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/4769/reg_2101-unnecessthmb-0.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/4769/reg_un-mountain-0.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/4769/narrow_unneccessaru-mountain-0.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/unneccessary-mountain-trail-near-vancouver-bc-4769",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 2,
        "Time": "8 hrs",
        "Total Distance": "12 km",
        "Town": "Vancouver, BC",
        "Type": "out-and-back"
    },
    "title": "Unneccessary Mountain Trail",
    "trail_id": "4769"
}