{
    "description": "Length of the ride depends on whether shuttling or doing it as a loop.  If using a shuttle then the trail is approx. 13 kilometres (1 hour +) .  As a loop - 45 kilometres (2.5 - 3 hours).  \rAs a loop: approximately 18 kilometers of dirt road - 13 kilometres of mostly single track (non technical mostly flat to downhill) - then 14 kilometres of paved road back to the car.\r\rSingle track - mostly in the woods.  Starts on the right off of McQueen Lake road across from a tree with a large white faded sign (ST waypoint).  Mostly smooth single track up to the gate (Gate waypoint).  Close the gate (cattle) and head straight across to dirt road (trail isn't as clear).  \r\rYou can go right at the road to head back to the dirt road that brought you up (or possible there is a trail that goes right at the gate - I've never bailed so I'm not sure). Otherwise...\r\rHead left on the road, this will shortly take you to some more single track (ST2 waypoint).\r\rThis single track is rockier than the first.   Keep your eye out for the trail that will head off on your right after a steep descent (RT waypoint).  This will take you on a fast and fun single track all the way down to Dairy Creek.\r\rAfter a climb and some flat, you'll have another fence to cross (hop) before continuing on more single track.  The trail to get you to the fence isn't as distinct.  If you miss it you'll climb back up to some double track where you'll have to make a right and come back down to rejoin the trail.\r\rOnce you come out on a dirt road, look for another section of single track on your left (ST3 waypoint) to get you down to Westsyde road by a quarry (this is where you'd leave your car if you're shuttling).\r\r",
    "directions": "Head up Bachelor Drive on the North Shore.  Once this turns to dirt, you're on Lac Du Bois road.  This is a good spot to leave the car if you're riding it as a loop.  Turn right to McQueen Lake just after (I believe) the 16 km sign (kilometres are marked on the way up).  There are a few places along this road you can leave your car if you're doing a shuttle run.  \r\rThe road will split after a couple of kilometres.  Keep right.  Just after the split you will see a large tree with a white faded sign.  The trail starts on the right across from it (it will also be marked on your right).",
    "photos": [],
    "source_url": "https://trailpeak.com/trails/screaming-mosquito-near-kamloops-bc-4781",
    "stats": {
        "Activities": "mtn-bike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "45 km",
        "Town": "Kamloops, BC",
        "Type": "out-and-back"
    },
    "title": "Screaming Mosquito",
    "trail_id": "4781"
}