{
    "description": "The Lower Loop of Romero Canyon Trail takes you on a challenging ride both on the way up and down. Heading up, you'll probably be too distracted by the stellar views to feel the hurt, including the Santa Barbara cityscape, Pacific Ocean, and distant Channel Islands. Heck, if you look close enough, you can probably spot Oprah's house! The descent through the canyon has plenty of rocky sections to keep you entertained, with smooth single-track thrown in to prevent you from getting too discouraged. This trail has seen everything from beefy DH bikes to fully rigid single speeds, and padded free-riders to spandex clad XCers. All in all, if you want a quick ride that gives you both a climb to get the heart rate up and a descent to get the adrenaline pumping, this is it. (Please be sure to read the Disclaimer for Santa Barbara Trails at the bottom of this description!)   \nThe majority of your miles for this ride will be spent on the climb, gaining 1,450' in about 4 miles. After you pass through the gate at the trail-head (the entrance is off to the left), hop on your bike and start pedalling. You'll be on a fairly wide fire road for most of the climb. The climb starts steep, so feel good knowing that you're getting the most lung-busting part over with early. At about 0.5 miles, you'll hit a small creek crossing. After the crossing and as you veer to the right on the fire road, notice the small trail heading off to the left. That's where you'll be coming down on your descent. Keep on heading up and get ready for the scenery to start to fall into place. You'll be climbing along the side of the hill, and views for days will be off to your right. Take the time to stop and soak it in. At mile 2.3, you'll come up to the large electric tower. In the past, this point would mark the start of the single-track climb. Unfortunately, this section of trail had to be bulldozed during the Zaca Fire, turning the much-loved single-track into a fire access road. This happened back in September of 2008, so the trail has been reverting back to narrow goodness, with some new challenges thrown in the mix. Keep your cadence up and ride right over the rock slides you'll encounter, and you'll eventually make it to the end of the climb at mile 4. You'll know you're at the top when you see a trail veering off to the left and a sign reading \"trail\" with an arrow pointing to the--you guessed it--trail off to the left. That trail is where you're about to head. You can also keep climbing on the fire road (taking you on the Upper Loop), and you'll see a trail heading off the right, but you don't want that. \nAt this point, do whatever it is that you have to do: drop your seat, strap on your pads, or just get stoked for the fun that awaits. When you're geared up, head down the trail off to the left (yes, we've covered this, but we don't need you taking the wrong trail!). The descent starts fast and smooth with a couple of sneaky switchbacks, so keep your eyes out. Once you're through the switchbacks, the trail will throw pretty much everything at you: technical rock gardens, creek crossings, grippy/fast/smooth sections, and even some hike-a-bikes to keep you modest. Enjoy this stuff, because it will fly by. At mile 5.5, you'll find yourself coming out of the canyon from the trail you saw on the climb and joining back up with the fire road. From here, take a right and head back down to where you started. Now wasn't that fun? \n***Disclaimer for Santa Barbara Trails***\nAll of the trails in Santa Barbara are multi-use, and are used extensively by hikers, equestrians, and mountain bikers alike. When controversy arises (and it frequently does in this area), mountain bikers are the first ones on the chopping block. To ensure that we all get to coexist on the trails, please yield to all other users and be respectful to everybody that you encounter. Most importantly, use a bike bell! A bell box with free bells is provided at the trailhead, but these are often empty, so grab one of your own at a bike shop or craft store. The use of these bells helps to keep mountain bikers on the trails we all use and love so much!",
    "directions": "From US-101, \n\ntake exit 92 toward Sheffield Drive (turn left if coming from the north and right if from the south)\nTurn right on N Jameson Ln\nTurn left at Sheffield Dr\nTurn left at E Valley Rd\nTurn right at Romero Canyon Rd (veer right whenever the road splits)\nAfter about 1.8 miles on Romero Canyon Rd, the trailhead will be on the left.\nPark anywhere that you can find a spot on the side of the road.",
    "geohash": "9q4",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/CA/4788/reg_BikeTrailSign-14825.jpg",
        "https://trailpeak.com/storage//content/trails/US/CA/4788/reg_BlurryBiker-14825.jpg",
        "https://trailpeak.com/storage//content/trails/US/CA/4788/reg_best1_SmoothSection-14825.jpg",
        "https://trailpeak.com/storage//content/trails/US/CA/4788/narrow_CreekCrossing-14825.jpg",
        "https://trailpeak.com/storage//content/trails/US/CA/4788/narrow_HikeABike-14825.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/romero-canyon-trail-lower-loop-near-santa-barbara-ca-4788",
    "stats": {
        "Activities": "hike mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "10 km",
        "Town": "Santa Barbara, CA",
        "Type": "out-and-back"
    },
    "title": "Romero Canyon Trail (Lower Loop)",
    "trail_id": "4788"
}