{
    "description": "This trail starts off as an easy hike alongside Lynn Creek, before a challenging creek crossing (could be impossible in higher water) leads to a fairly well marked route through the Hanes Valley. Watch out for bears in this lush valley before scrambling up the steep scree/snow covered approach to Crown Pass. Even in July there was a lot of snow on the pass and on the traverse past Goat Mt., Little Goat Mt, and then over Dam Mt, so the trail was at times hard to follow. After taking in the spectacular 360 degree views, finish up by hiking down Dam Mt. to Grouse Mt. resort, and then down the Grouse Grind. Flat spots for camping on this trail are few and far between, so if you find a good spot, stick with it. Could be done as a challenging day hike. Once you get to the trail to Little Goat Mtn it's downhill to the Grouse Sky Ride. $5 to get down to the bottom - it's worth it - you'll be tired!Directions from Vancouver:From Highway 1, take the Lynn Valley Road exit in North Vancouver. Good carparking at the park headquarters. The #228 bus (from Lonsdale Quay)stops at the entrance to the Lynn Headwaters Park (end of Lynn Valley Road). It's about a 1km walk to the start of the trails. At the other end the #236 goes back down to the Quay, or take the #232 to Phibbs Exchange.",
    "directions": "Start anywhere along Lynn Creek in North Vancouver, and walk upstream along the creek , eventually following the Lynn Loop trail towards Hanes Valley, passing Norvan Falls.Since the trail is not a loop, bussing or shuttling is necessary. Busses leave from Lonsdale Quay to Lynn Canyon and Grouse Mt regularly.OR, an alternate description  ...Here is another posting of Hanes from trailpeak user \"hikingRookie\" that makes sense as an addition to this description:Some have described this hike by starting out with a Grouse Mountain Skyride and coming out via the Cedar Mill Trail. It can be done both ways, but we chose a reward that held \"the carrot before our noses\" to keep us excited. We parked in the lot and started from the the Cedar Mill Trail. The gravelly trail is pleasant and easy enough. At the debris chute we went left and follow the Lynn Valley Trail till you arrive at the Norvan Creek bridge. You've traveled about 7km on a pretty basic and leisurely trail. 20 minutes longer and you will arrive at the Lynn Valley / Hanes Valley trail junction, and another half hour will get you closer to log walks and boulder jumps enabling you to cross Lynn Creek. Another 2km, you'll arrive at a clearing with a signpost and a map. Go left of this post to a \"sweet spot\" to snack a lunch, take in the scenery, and re-fuel yourself for the rock-field (follow the orange trail markers) that will take you up around 500 m through Crown Pass. Nearing the top, you'll reach some greenery, and travel about 0.5 km to a trail north of the fall-line. Climb up over Little Goat Mountain and go left on the main trail on the north side of Dam Mountain. Traverse around its east side hiking south and keeping left at forks. Yellow trail markers will keep you on track. You've gone somewhere around 18 - 20 km once you've followed the signposts leading you up steep rockfaces (some with chains anchored into rock to help you ascend), and we took the Skyride down. But first, we celebrated with a beer and nachos, after we changed into other clothes (we got drenched with showers, but arrived with grins, nonetheless).It took us 8.5 hours (including the \"sweet spot picnic\", but excluding the celebration before the Skyride).Bring lots of water, a light lunch, and a good attitudeÂ?rise to the challenge, it's a fun one!",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/479/long_Hanes-Valley-35518.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/479/reg_DSCF0016.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/479/reg_Hanes-Valley-4-35518.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/479/reg_hanes-valley-october-2006-015-24752.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/479/reg_hanes-valley-october-2006-023-24752.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/479/reg_hanes-valley-october-2006-027-24752.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/479/reg_hanes-valley-october-2006-032-24752.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/479/reg_hanes-valley-october-2006-047-24752.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/479/topo_DSCF0014.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/479/narrow_hanes-valley-october-2006-005-24752.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/479/narrow_hanes-valley-october-2006-010-24752.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/hanes-valley-near-vancouver-bc-479",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 4,
        "Time": "8 hrs",
        "Total Distance": "18 km",
        "Town": "Vancouver, BC",
        "Type": "out-and-back"
    },
    "title": "Hanes Valley",
    "trail_id": "479"
}