{
    "description": "NTS Map: 092G07The Trails up at Burnaby Mountain are a gentler but well-worn version of the North Shore trails.  Good for working on skills, and ideal if you haven't been riding for a while. They can be a little muddy and washed out at times. If it's really wet, consider choosing another location. We've mapped out one of the major trails, featuring Mel's trail to start, then, Nicole's log towards the bottom. Explore the network of trails that crisscross the mountain.  The jeep trail (under the powerline) we parked near gets you up the mountain where Simon Fraser University is located. With it's monolithic cement architecture dating from the 60's - you wonder if Stanley Kubrick and Arthur Erickson didn't share a few beers and maybe mix up their notes.  While riding up, don't forget to turn left off the main power line trail onto a somewhat steeper trail (Joe's) at marker 001 on our map.  When we were at this intersection, there was a large board without a map at the turnoff.  Turn left at marker 001, and ride up to marker 002 where you reach the campus, unfortunately, on the wrong side of the campus, so, cross the road, turn left, then a quick right as you pass under some buildings and cross the university heading in the direction of the Gym and track.  You will have ridden past the gym on the road with the track on your right, and, you will turn left on the paved road that fronts the forest.  Follow left for a short while, and you will know you are close when you observe a ramshackle area that looks like community garden plots, or perhaps some biology experiment gone bad.  You are only on this road for a few meters when you see the entrance to the trail. If all that sounds a bit confusing, simply download our GPS waypoints and tracklog and dump that into your handheld GPS and use that to find the trail and stay on it. Looking at the tracklog you are building as you go versus  the one you downloaded, you'll get a rough idea of where you should be.The upper part of the trail is rather flat, but it winds its way down getting steeper, with plenty of switchbacks.  One log ride (Nicole's) towards the bottom gives you something to work on.  If you can handle that, go directly to the North Shore.  The ride is nice because you end up just above where you parked, a nice out and back loop, no shuttling needed.",
    "directions": "See description and / or GPS",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/48/3D_FinalSFU.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/48/regP5060092-6103.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/48/reg_FlowRider-43568.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/48/reg_P5060091-6103.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/48/reg_TopoFinalSFU.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/48/reg_sfu-east2-6103.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/48/reg_topgun-43568_best1_.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/burnaby-mtn-mels-nicoles-loop-1-near-burnaby-bc-48",
    "stats": {
        "Activities": "mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 2,
        "Time": "2 hrs",
        "Total Distance": "10 km",
        "Town": "Burnaby, BC",
        "Type": "out-and-back"
    },
    "title": "Burnaby Mtn - Mels & Nicoles Loop 1",
    "trail_id": "48"
}