{
    "description": "This fun-filled XC loop is located at the Stump Grinder Dirt Club (SGDC) in Los Olivos, CA. People who have been part of the XC race circuit in CA might also know this course as Firestone or Chamberlin Ranch, both of which were the names at one point or another. No matter what the name, this course (and the entire SGDH) exists thanks to Mike Hecker, a face you?ll surely see if you spend some time at the SGDC. A quick history: The SGDC XC loop used to roll over both the Firestone Vineyard property and the adjacent Chamberlin Ranch. For whatever reason, Firestone decided that mountain biking didn?t jive on his property, so the course was rerouted to be fully within Chamberlin Ranch. In June 2008, Mike decided to kick things up a notch and open the area?s only private mountain bike park, designed and built by riders. SGDC was born! \rIt offers lots to choose from, including downhill, dual slalom, super D, and XC courses. You can check out www.ridesb.com for more info, including access fees (yes, this is a private park, and there are access fees). But let?s get to what you?re here for: the XC loop. \r\rThe SGDC XC loop has seen its fair share of fancy bikes and sponsored spandex lately as host of the NMBS event, the Santa Ynez Valley National. In fact, in September 2008, the CA State Championships will be held on this course. Now would be a good time to head to the SGDC and get the course dialed if you want that jersey! It also plays host to the 24-Hours of Chamberlin Ranch around Halloween (awesome grassroots event) and a number of other regional races. The course is mainly singletrack winding over rolling foothill terrain. Along the way, you?ll encounter mellow gradual climbs, steep climbs with some tricky switchbacks, smooth fast descents, amazing views of the surrounding valley, and cows (the course is on a working cattle ranch, after all). At the end of the day, pedal to a vineyard or two (there are dozens to choose from) and sample some of the local vino. \r \r**Stay tuned for more trail details- coming soon!**\r",
    "directions": "From US 101:\rTake exit 146 for CA-154 \r\tIf coming from the south, turn right on CA-154\r\tIf coming from the north, turn left on CA-154\rTurn left on Zaca Station Road\rTravel along Zaca Station Road for about a mile, and then turn right through the gate into the entrance of the SGDC.\rAt this point you?ll be on a dirt road. Head to the end of the dirt road, and park in the adjacent grassy field.\r",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/CA/4813/reg_SCDC-XC-7-14825.jpg",
        "https://trailpeak.com/storage//content/trails/US/CA/4813/reg_SGDC-XC-1-14825.jpg",
        "https://trailpeak.com/storage//content/trails/US/CA/4813/reg_SGDC-XC-10-14825.jpg",
        "https://trailpeak.com/storage//content/trails/US/CA/4813/reg_SGDC-XC-2-14825.jpg",
        "https://trailpeak.com/storage//content/trails/US/CA/4813/reg_SGDC-XC-3-14825.jpg",
        "https://trailpeak.com/storage//content/trails/US/CA/4813/reg_SGDC-XC-4-14825.jpg",
        "https://trailpeak.com/storage//content/trails/US/CA/4813/reg_SGDC-XC-5-14825.jpg",
        "https://trailpeak.com/storage//content/trails/US/CA/4813/reg_SGDC-XC-6-14825.jpg",
        "https://trailpeak.com/storage//content/trails/US/CA/4813/reg_SGDC-XC-8-14825.jpg",
        "https://trailpeak.com/storage//content/trails/US/CA/4813/reg_SGDC-XC-9-14825.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/stump-grinder-dirt-club-xc-loop-near-los-olivos-ca-4813",
    "stats": {
        "Activities": "mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "18 km",
        "Town": "Los Olivos, CA",
        "Type": "out-and-back"
    },
    "title": "Stump Grinder Dirt Club XC Loop",
    "trail_id": "4813"
}