{
    "description": "This can be a fairly arduous trail. It is not marked in any way, but is quite easy to follow. The trail is actually a makeshift road used by the folks that have cottages on George Lake. It is usually travelled by ATV. Trail surface varies wildly from pure muck to bog to sandy gravel to bare Canadian Shield.\r\rThe day we trekked in it was raining and the trail was extremely challenging. It took us a full seven hours (including a few \"energy breaks\"). The return trip was only 5 (also including stops), but this was after a full day or so of dry weather.\r\rThe trail crosses several streams, marshes and at least one wetland by a Beaver Dam. Bridges are usually just logs, and most are fairly questionable. Not hard to cross on foot, but I can't imagine riding an ATV over one. We saw several deer on the forested sections of the trail. Based on the number of tracks in the mud, I'm guessing there is no shortage of them in the area.\r\rBefore you cross the last bridge (by the Beaver Dam) be sure to take a peek under the boards. There were a lot of Red-Sided Garter Snakes hiding out there (and a good many more that had been squished by the ATVs).\r\rThere is supposedly a campsite on the lake at the end of this trail, but we couldn't find it. We just set up our tent in the forest by the lake.\r\rThis is an excellent 3-day trip. We hiked out on day-1, spent day-2 exploring the area around George Lake (including a really pictureseque rapids just West of where the trail meets the lake). The lake itself is gorgeous with cool clear water, misty mornings, loons, etc.",
    "directions": "From the North-West gat of Whiteshell Provincial Park follow PR307 past Betula, Dorothy. Nutamik, etc. lakes. The trailhead is on a small dirt road (signed as ER 31) which is between the Bannock Point Petroforms and the Pine Point Rapids. These two landmarks are on the park map and are well signed. NOTE: neither George Lake, nor the trail are on the standard park map. When you see a gate that looks like Picture #1, park your vehicle, or bid farewell to your ride. You are at the trailhead.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/MB/4816/reg_DSC-0007.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/MB/4816/reg_DSC-0018.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/MB/4816/reg_DSC-0035.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/MB/4816/reg_DSC-0099.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/MB/4816/narrow_DSC-0029-0.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/george-lake-trail-near-beausejour-mb-4816",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 4,
        "Time": "14 hrs",
        "Total Distance": "23 km",
        "Town": "Beausejour, MB",
        "Type": "out-and-back"
    },
    "title": "George Lake Trail",
    "trail_id": "4816"
}