{
    "description": "Pasque Mountain area is beautiful!  Parking off the road you head onto some old trails into forest.  The trail makes its way slowly in a progression of logging roads, cutblocks, and exploration roads and makes its way up into the circque of Pasque Mountain which is in the shape of a horseshoe.  At one point the trail opens up into a beautiful alpine meadow, called the East Fork meadow, under the north ridge which is a perfect place to camp!  Many alpine wildflowers around in July, including Shooting Stars and Forget-Me-Nots.  From the meadow the trail heads up onto scree which follows to the top of the horeshoe ridgeline of Pasque mountain.  After some easy scrambling and some false peaks heading west on the ridgeline, the actual peak of Pasque mountain is reached. Great 360 degree views all around!  Highly recommended to make a 3 day backpack trip- but is doable in one day.",
    "directions": "From Longview turn West onto Hwy 541 until the Highwood House is reached.  Turn south onto Hwy 940/Forestry Trunk Road.  Once you reach the Cataract Creek bridge drive 10 km more (and 1.2 km west of Wilkinson Summit) and pull into a small parking area on the southwest side of the highway at GR733630  From there start up a grassy hillside opposite the parking area. Keep right of the bluffs as you climb into the south end of the ridge. (no signs).",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/4821/reg_2007-719-15511.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/4821/reg_2007-780-15511.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/4821/narrow_2007-800-15511.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/pasque-peak-near-longview-ab-4821",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 4,
        "Time": "8 hrs",
        "Total Distance": "8 km",
        "Town": "Longview, AB",
        "Type": "out-and-back"
    },
    "title": "Pasque Peak",
    "trail_id": "4821"
}