{
    "description": "NTS Map:92E10.  This is the trail everyone is raving about. We have some GPS points for you (see GPS Download), which you can use, however the donor (Lorenzo) claims that in very few places will you need GPS.  However, there are a few tricky sections where one can get somewhat disoriented and most people find their way back onto the trail without much difficulty.  If you look at the cut-out (below) from topo map 92E/10, you will see in the small overlay (overview) 4 other \"dots\" that represent this hiker's daily stopping point, marked on his GPS.  The trail takes roughly 5 to 6 days and is tide dependent.Pal Horvah also recently contacted trailpeak and offered his book to us in a greater effort to have this trail protected.  The more people that visit and write letters of support in expanding the protected shoreline area the better, and trailpeak is glad to be a part of it.  What follows literally is Pal's book.  Pal has hiked and organized trail maintenance trips to this trail dozens of times, we hope you enjoy.  Pal wants nothing in return other than your voice in protecting this trail.  Enjoy!The Nootka Trail; A Backpackers' ParadiseBy Pal Horvath; Editor: J. Jyrkkanen17 July  2004The SettingRemote wilderness, spectacular beaches, wildlife like wolves and whales can be found on the 35 km Nootka Trail, located on Nootka Island off the West Coast of Vancouver Island.  {Editors note: Nootka Island is located at 49 degrees, 45 minutes North latitude by 126 deg 45 min. West longitude}HistoryOccupied by natives for at least 4300 years. Spaniards were the first to see this place. Captain James Cook visited here in 1778 with two ships, the Discovery and the Resolution. Soon after, Friendly Cove became a hub for the sea otter fur trade.  Captain Vancouver and Captain Quadra averted a war here between England and Spain (Hence Quadra Island?). In 1803 Nootka natives attacked the sailing ship Boston and all on beard were killed except the sailmaker and the blacksmith, John Hewit. They lived with natives for 2 years and Hewit wrote down their experiences. The book \"White Slaves of the Nootka\" published by heritage House is still available and is a first hand description of native life at the time.AccessTake the Ferry from Horseshoe Bay to Nanaimo, drive north from Nanaimo to Campbell River and then take the island highway west to Gold River. This is your jumping off point. You then need to fly, boat, sail or kayak from Gold River to Nootka Island.Your late May to early September trip can be done in three days but can also be enjoyed for as long as eight days. Access is by float plane, or boat. The best access is by float plane (Air Nootka, 250-283-2255) from Gold River and for interest, you may want to return via the Motor Vessel UCHUCK III (250-283-2325) back to Gold River. If you fly,  have the pilot cruise the route so that you know where you are going.You can also take a Water Taxi from Gold River to Friendly Cove. Pal says that the ideal is to fly there and sail back. From the 4th of July to the 12th of Sept the MV UCHUCK sails round trips on Wednesdays and Saturdays.MapNootka 92E10 topographical map covers the area. The trail is not shown on this map and is marked by hikers. Degree of DifficultyModerate but due to remoteness and weather, it should be regarded as difficult. There is a community there called Friendly Cove.Remote areas are fine until something goes wrong and then especially problematical if you need medivac or medicines or emergency treatment so keeping that in mind, there are things that you can do to be prepared. Marine Channel VHF radios would be best tuned to channel 16 or ship to ship channel 6. Cell phones do not work there.  Its best to have some training in wilderness first AID and bring basic and any specialty medicines you need.  The Natives charge a fee to cross their land and also to see their historic materials in the local church (1-800-238-2933). HazardsYou can be wept away by a wave, or drowned in a rushing tide or eaten by a black bear or wolves, or poisoned by shellfish but these are very remote possibilities and you can be prepared for all of them by prevention and planning and care and hygiene and by good information.  Take Tide Tables and keep a clean camp and eat foods with little aroma and store foods high in a tree and have respect for wildlife and find out when it is safe to eat shellfish (DFO-1-604-666-2828; Nootka Island is Area 25). If you are allergic to bee and wasp stings or anything else, take appropriate meds along. Do not feed the bears. Wet rocks and slippery logs can lead to falls, which can cause injuries. Be especially careful because evacuation is a difficult, time consuming activity and is very costly.The TripPreparationIn addition to the usual hiking paraphrenalia, take along lightweight plastic tarps, garbage bags, sandals or water socks for crossing creeks, rope for hanging food, a good wilderness first aid kit, repair kit, flares or VHF marine radio, water filter or purifier tablets, compass, topographical map ( 604-666-0271), tide book (Canadian Tide and Current Tables, Vol 6, Tofino Tide Tables) and zip lock plastic baggies. [It appears from Pal's book that parts of the trail require beach access dependent upon tide levels.]Day 1 (45 Minutes walk)The flight from Gold River to Louie Bay by float plane gives a preview of the trail and an opportunity to see whales and wildlife. You will be offloading in Louie Bay in knee-deep water so wear sandals and shorts. The hike starts on a well-used rough trail through old growth forest with tree diameters from 8 to 12 feet. A 45 minute walk gets you to Third Beach and it's a good place to camp for several nights if one wants to enjoy sandy shores.Day 2 (2 choices)One can laze around on the beach or make a 4 -6 hour hike to Tongue Point and a shipwreck. An option once there is to bushwack up North West Cone to visit the remains of an World War II radar station. A large antenna and some buildings are still standing and are accessible via an overgrown road and a 2 hour round trip hike.On the West End of Third Beach is a marked trail, which in one hour takes you north-west to a narrow channel, which is passable at 6 foot or lower tides. Be there on a dropping tide! Walking on the West Side of the mud flats gets you in 1 hour to Tongue Point and the scattered remains of a 16000 ton Greek Freighter TREIS IERARCHI. All on board survived!Get back to the narrows before the tide reaches 6 feet!Day 3 (4-5 hours walk to Calvin creek)Always plan to walk on a dropping tide! There are a few places where the tide could trap you against steep rock walls. At the East End of third Beach in the trees close to the creek is a rope marking the beginning of a trail around the rocky headland. With a very low tide it is possible to walk on the beach. From here on where the beach is not passable, look for floats and other markers hanging from trees and bushes marking the beginning of trails around the headlands.In 4-5 hours one reaches Calvin creek. There is a well marked shelter on the North side of the creek that is handy if it rains. If a lot of water is coming down the creek, cross it close to the breakers where the flow spreads out. On the south side of the creek there is an entrance to campsites in the bush, but camping on the beach is preferable. This is the highlight of the trip, a 1.5 km long sandy beach and beautiful waterfalls.Day 4 (Relax)Hang around the beach, swim under the waterfalls or take a grueling hike via bushwacking to Crawfish Lake.Day 5 (3-4 hours walk to Beano creek)A beach walk on sorted sizes of gravels and rocks and deep carpets of seaweed.Bajo Point is an Indian Reservation. Under the trees, middens and depressions are visible where the long houses once stood. This is private property and it is against the law to disturb or remove anything from middens and archaeological sites. This is not a good campsite and there is no drinking water. There is good camping at Beano creek. Plan to cross Beano creek at low tide.Day 6 (3-4 hours walk)About 1 km east from Beano creek, the beach ends in a dark canyon, where floats and rope mark the beginning of the trail. From here on, hiking is mostly on forested trails interrupted  by interesting little beaches. One hour takes you to Callicum creek. In dry weather, this is the last source of fresh water until you are close to Friendly Cove. To be safe, take a 3-4 liter supply here.About 200 m S.E. of Callicum Creek is a rock wall where a 6.5 foot tide blocks the beach. There is a trail around it but the beach route is easier. Fifteen minutes walk east of the rock wall will bring you to some large Cedar trees, one of which had planks removed by natives for their Longhouses.Two possible campsites here, both of them on the beach. The first is more likely to have water. 1.9 km S.E. of Callicum creek is a creek coming out of a small lake with an island in it. Chances are that the creek will be dry at the beach. But a depression in the pebble beach washed out by the rains is visible. About 50 m past the depression, floats mark a short trail hopefully to some tea-colored water.The other possible campsite is on the beach 30 minutes walk past the headland to the South. At the East end of the beach, just before the beginning of the next trail, look for the telltale depression of a seasonal creek, which is not on the map. Scramble over the driftwood where the bush has been cleared to expose water.Day 7 & 8 (4-5 hours walk to Friendly Cove)Two hours hike along a rough well marked trail takes you to Maquinna Point. Without packs it is only 10 minutes but the view is worth it. From Maquinna Point 700 m East is another side trail marked with floats going to a beach with 3 sea caves. Some are big enough to camp in. There is no drinking water but in a storm, these could keep you dry. One has two entrances so it is safe at any tide.From Maquinna Point 2 km N.W. a saltwater river flows from a lagoon at a 4.5 foot tide. It is usually ankle deep. Storms may change the bottom, so plan to cross at low tide. At high tide, this is a great place to swim. If time allows, it is definitely worth the effort to walk up to the lagoon.The next water source is a very small creek about 1.5 km east of the saltwater river. It never dries but is not on the map. It is marked by a solitary rock below high tide mark, standing 15 m high. There is also good camping on a clean pebble beach. Friendly Cove is only 1.2 km where a visit to the church is a must, to see the displays explaining the history of the area. After boarding the M.V. UCHUCK go straight to the food counter for a bowl of chili. The trip back to Gold River is a beautiful ending to a great adventure.ParkingPark on the road close to the waterfront where Air Nootka and UCHUCK III are located.Registration/FeesThere is no registration or fee for using the trail (please check to see if this is still the case). First Nation people do charge for crossing their land and for visiting the historic displays in the church. The amount is under revision. For information, call 1-800-238-2933.Trail AdviceBearsBlack bears do occur there and they like to dig through decomposing seaweed piles, catch salmon and pick salal berries. Let them know of your presence in a non-aggressive way. Make noise as you walk the trails and keep your group together. They usually disappear into the bushes. When in doubt, chicken out. Always hang food in a high place away from camp. If a black bear stalks you for food, fight em with everything you have. Pepper spray works great but may be hard to get on the plane. Dogs are a bad idea on these trips since they may anger or elicit attacks from predators.Toilets and GarbageThere are no toilets so bury your waste at least 10 inches under ground away from trails, campsites and water supplies.  Pack your garbage out and burn cans to eliminate food odors. No trace camping please.FiresLight fires only on beaches away from driftwood and forests. If the forest is dry, do not use open fires at all. Safety and TrailmarkersNever travel alone. Take a buddy and share the fun and cut the risks. About 75% of walking will be on beaches and the rest is on well-worn and marked forest trails. Look for floats and other markers to mark the trails where the beach ends. Careful not to get diverted on game trails. Hikers maintain this trail system so please replace missing markers and do some small improvements if time permits.What's nice about this trail, other than the spectacular scenery, is that the entire hikes consumes almost all of one 1:50,000 topo map, and you only have to buy one.A general overview of the hike is also provided by the Federation of Mountain Clubs of Canada, on paper (604-878-7007), and we hope more people submit pictures and trip planning information here.  We'll grow the Trailpeak resource into a trip guide, but we'll start with this humble beginning and a request to all of you out there to write in your comments, for any particular day on the hike.  We'll piece it together and post the latest, so that you don't duplicate what someone else sends in.There is GPS data attached to this trail (see \"download GPS\"), which if loaded into your GPS can help you find route points.",
    "directions": "Nootka Island is located due West of Campbell River, and goes from Louie bay to Friendly Cove on the West Coast of Vancouver Island. Getting there involves either seaplane (from Tofino or Gold River), or passage on the MV Uchuck III, sailing from Gold River.  See above directions from Pal Horvath and phone numbers.",
    "geohash": null,
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/484/long_NootkaMap.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/484/reg_203FE990-BDE0-4800-A841-DA12703287C7.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/484/reg_DSCN3466-33723.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/484/reg_E4AAB8A9-214B-4918-8FA6-29559D2FDC13.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/484/reg_IMG-0126-33723_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/484/reg_IMG-0204-33723.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/484/reg_IMG-0334-33723.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/484/reg_IMG-0336-33723.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/484/reg_IMG-0367-33723.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/484/reg_IMG-0374-33723.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/484/reg_tim_surfinglge.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/nootka-island-trail-near-tofino-bc-484",
    "stats": {
        "Activities": "sea-kayak hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 5,
        "Time": "1 hrs",
        "Total Distance": "30 km",
        "Town": "Tofino, BC",
        "Type": "out-and-back"
    },
    "title": "Nootka Island Trail",
    "trail_id": "484"
}