{
    "description": "After wanting to do this trail for 2 years, finally found some hikers wanting to do it with us. Yeah to Bob Garlick and Vincent Perry.\r\rDid this trail on Sunday July 6, 2008. Did it from north to south, ie, from Shannon Falls to Petgill Lake and down to Murrin Lake Provincial Park. 2 cars are required, one at each end.\r\rFound this to be a difficult hike for 2 reasons: \r1) total ascent of 1050 m, mostly over the first 7.5 kms; and \r2) a very lightly travelled trail, greatly overgrown, requiring lots of bushwacking.\r\rHike was 18.5 kms from car to car, ie, from parking lot at Stawamus Chief Prov Park to 2nd car at Murrin Lake Prov Park. El at SCPP is only 50 m, with climb of 800 m over the first 7.5 kms. Beyond the summit (or view point) 15 mins above Upper Shannon Falls, this trail becomes quite overgrown, with some sections requiring crouching to travel. The trail is mostly well marked (thanks to Bob Garlick with his marking tape), but some sections are a challenge. Many sections are old logging roads, but overgrown with alder, some sections are narrow and winding typical west coast trails, complete with roots, rocks and mud. Expect a bit of everything, including swamps, log fields, thick forest, at least one creek to ford barefoot, etc...\r\rMurrin Lake is at 150 m el, so not much difference in elevation gain. High point on the trail, approx 1/2 way, is 870 m. Total ascent of 1050 m results from the numerous ups and downs.\r\rFound the 2 km section just east of Petgill Lake to be a particular challenge. Considerable sections were alder overgrown logging road, and one winding, very dense section of 600-700 m was barely there. Thanks to Bob and Vincent for leading us through. Petgill Lake was a relief to see, but with still approx 5.5 kms from Petgill Lake down to the highway and Murrin Lake.\r\rOverall, I would rate this difficult because it is very overgrown, making it a difficult hike. It also doesn't have lots of views (a few). I think that if this trail were cleared between Shannon Falls and Petgill Lake, it could be increased to a rating of 4. It needs lots of work. Where is the BC Mountaneeting Association?\r\rThis is bear country, beware, make noise, carry bear spray. A long hike, so make sure you have plenty of food and water.\r\rThere are at least 5 geocaches along this trail.",
    "directions": "Either start at Murrin Lake PP (pay parking), take the Petgill Lake trail, and continue east beyond Petgill Lake. We started at the north end, at Stawamus Chief Prov Park (free parking), went up the Chief trail, after 2 kms or so, turned right for the Upper Shannon Falls trail, and from the view point 15 mins above the Upper Shannon Falls, followed the markers east. Both are off Hway 99, between Britannia Bay and Squamish, 1 hour north of Vancouver.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/4858/long_Elevation-48278.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/4858/reg_GPSTrack-48278.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/4858/reg_JunctionAtPetgill-48278.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/4858/reg_PetgillLakeMarker-48278.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/4858/reg_PissCan-48278.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/4858/reg_RiverCrossing-48278.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/4858/reg_junction-48278.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/4858/reg_map-48278.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/4858/narrow_Bush-48278.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/4858/narrow_SeaToSummitTrailMarker-48278.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/shannon-falls-to-petgill-lake-or-vice-versa-near-squamish-bc-4858",
    "stats": {
        "Activities": "hike snowshoe",
        "From": "",
        "Seasons": "summer winter",
        "Stars": 3,
        "Time": "6 hrs",
        "Total Distance": "18 km",
        "Town": "Squamish, BC",
        "Type": "out-and-back"
    },
    "title": "Shannon Falls to Petgill Lake (or vice versa)",
    "trail_id": "4858"
}