{
    "description": "Paddling from town to the West River has been on my to do list for quite some time now. With a fairly nice day weather wise, I decided that this would be the day to do just that. I had hoped to paddle all the way up the river to a camp spot, and then paddle home.\r\rWell, I let in to the water at around 10AM and had an easy chop to paddle through. The winds were  mild, but the forcast would say they were to grow to 40K gusts, but as a tail wind by then. The tide was pretty much going out or near slack by then, so what I was fighting on my way up to the west River was mild tide, and winds.\r\rFor most of the paddle, the route was wide, like I was in the harbour for most of the time. It's mostly an urban paddle with the exception of farm fields as you get further out. The route takes you under a couple of bridges, each an hour a part, with the last being a notable trestle bridge at Dunedin. After passing the second bridge, I noticed a small cliff, which is rare here on PEI. It was 12:30 by then and I stopped for a bite to eat. I had a deadline to meet, so moving forward up the river (7 more K) would put getting home in time in jeapordy.\r\rTurning around for home, had the fun getting started. The gusts that were forecast actually never happened, but wow, with the tide coming in, what a force to contend with! I was battling it out under the earlier bridge, paddling for all my worth both to move foreward and keeping the nose from slipping in toward the center pier.  Mission accomplished!\r\rPaddling the rest of the way home was uneventful, though tiring. I had my FINDMESPOT device tracking all the way, with an occasional OK check in to tell others that I was doing fine.\r\rIt was getting really hot, and I was getting desperate to cool off with a roll, but I didn't want to draw any undue attention, with people seeing a kayak upturned out in the harbour, so I waited until I was almost back to shore before I went for it. Success again. It's nice to know that despite being tired, and being in a bit of chop, the roll came up with little effort. A great day. 5 hours and 28K.\r\rshannon Burt\reast coast editor\r",
    "directions": "I left from york lane in Charlottetown where there is a lighthouse. It makes a great land mark when returning. The West River is (as you guessed) headed roughly west of my launching point.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/PE/4859/reg_IMG-0045-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/4859/reg_IMG-0046-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/4859/reg_IMG-0048-6702.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/charlottetown-to-the-west-river-near-charlottetown-pe-4859",
    "stats": {
        "Activities": "sea-kayak",
        "From": "",
        "Seasons": "summer",
        "Stars": 3,
        "Time": "5 hrs",
        "Total Distance": "28 km",
        "Town": "Charlottetown, PE",
        "Type": "out-and-back"
    },
    "title": "Charlottetown to the West River",
    "trail_id": "4859"
}