{
    "description": "You can look at trail-maps all you want, but most don't tell you the great trail combos or how to ride them.  Some people take a map with them and end up walking up the downhill, riding too tough a trail, or riding a crappy trail. This is not fun.\nThis \"tour of Seymour\" takes you on four trails that are in their prime, and takes you past several others that you may wish to try out.  Most of these trails are complete with ramps, ladders, and overall, a great combo for intermediate to advanced riders.  \nWe've marked the turn off to a number of other popular trails (like Pangor, Severed Dick, Dales, and Boogyman).  Boogyman is double-black, so avoid it unless you are an expert. Ned's is an all-time classic that is still popular - and it's a nice long ride.  Great to learn on.  \nOur tour starts with Corkscrew (interestingly, right near Ned's). Corkscrew is the first trail to the right after entering the trails on the other side of the concrete barrier at the hair-pin opposite the old mushroom parking lot. (If you were to go right, you'd quickly find the entrance to Ned's, without doing Corkscrew or Pangor.) Once you get to the power lines at the end of your Corkscrew ride, turn left and look for your 2nd trail entrance on the right (about 2-300 meters down the powerlines); this is Pingu and we've shown you the trail entrance in one of the pics above.  You won't see the sign until you actually enter the trail.\nThis combination is ideal for the intermediate rider looking for some steeps, some modest ramps and gap jumps on Corkscrew and Pingu; then head over to Pangor, Boogyman, or Severed.  In our case, it was back up to Ned's (Atomic Dustbin), where you can take your time or speed along the rooty trail to get to some of the stunts, like a large A-frame, and further down, a ramp to a 3-footer (of course someone is building some bigger options - but, it's all there).  \nSpeaking of the stunt area with log rides, this is marked as waypoint #12 on the map above, and this is the point that those parked at lower Seymour Parking lot would turn left to.  That is, to the power lines, and then left again at the power lines, and then a quick right after crossing the stream a short distance away.  Follow this out to Hyannis Drive, or make your way back on Bridle Path.\nIn this combo however, we made our way to Ridgerunner and Bottletop, two awesome intermediate trails that most people miss.  We took Bottletop all the way out, and then turned left once we \"splashed down\" on the gravel path by the river, taking us out to Riverside Drive.  This is marked as point #15 on our map. If you had shuttle parked from Riverside Drive, perfect.  If not, you have a bit of a road-bike back to Seymour Parking lots.  \nLeave one car at Riverside Drive; the other you use to shuttle up to the parking lot (upper Seymour) that everyone uses to access Ned's & Corkscrew, described above.  Have a look for the hairpin turn on the map. Just on the inside of this curve is the parking lot.  Of course, if you own a cheap GPS, you can load these waypoints in and find these trails really easy.  Just click on download GPS for this trail. Coverage is good on Seymour.  Have fun, and look for complete driving directions in some of the other Seymour trails - this was simply a \"Trailpeak special\".\nAnother classic ride involves CBC first, and then any of these trails.  Imagine CBC, Corkscrew, Pingu, then Boogyman.   All downhill, one heck of a workout.  You'd be bagged and ready for a cold one at the Raven afterwards! Have a look for CBC here on Trailpeak.  \nSend in your trails and favourite trail combos as well as pictures and directions--we rely on you for trails.  It's sort of like \"trail mtc\" day, if you've used Trailpeak, but haven't sent in a trail or comments, perhaps it's time.  It's free because members like you drive the content.",
    "directions": "See other trail descriptions for Seymour.  This one is a shuttle, one car at Riverside, the other up top at the Old Mushroom Parking lot (Ned's access).\nLocal Conditions:\n                  \t\nSome cool footage of  CBC, Corkscrew, Pingu, Pangor ...\n \nmore mountain biking videos can be found here",
    "geohash": "c2b89",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/488/reg_Dales1f.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/488/reg_KurtPingu.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/488/reg_Ridge1f.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/488/reg_Severed1f.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/488/reg_SharonTour.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/488/topo_Pingu1f.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mt-seymour-corkscrew-pingu-neds-bottletop-near-north-vancouver-bc-488",
    "stats": {
        "Activities": "mtn-bike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "5 km",
        "Town": "North Vancouver, BC",
        "Type": "out-and-back"
    },
    "title": "Mt. Seymour - Corkscrew, Pingu, Neds, Bottletop",
    "trail_id": "488"
}