{
    "description": "This whole area near Alice Lake has some really sweet singletrack ideal for the cross-country rider or trail-runner. You can do the 4 lakes trail, or climb a little higher on the road (in Alice Lake Provincial Park) to Rob's Trail, and find a vast network of trails waiting for you here off the Hydro Cut. The rest of this description is for a 1/3 loop of the test of metal that includes most of what the Alice lake area has to offer.\nAlice Lake - Test of Metal\nIf you are up for a series of epic rides, and sampling part of the famed Test of Metal,  with a first rate Provincial Camp Ground as digs to start your ride, then check out Alice Lake in Squamish.  It's a great base camp for the weekend, and, you can access nearby Rob's trail and a flowy circuit from the top of the nearby Hydro Cut all the way back to town (Squamish) and some great views over Garibaldi Highlands.\nThe route profiled here is about 18km (so the GPS told me) and although I was riding my DH bike, I took my time and enjoyed the excellent circuit leading up and out of Alice Lake Provincial Campground, onto some sweet XC trails and even some steep stuff and some North Shore ladders and logs to break up your ride.\nThis ride is best described in three stages.  Riding through the camp ground or day use area onto the Bob McIntosh Memorial trail (there is an actual memorial). Continue along this trail until you get to a major trail intersection, looking up and right is hike-a-bike to the top of the Hydro cut, you'll be doing this but not yet.  Instead, go straight and complete 'Dead-End Loop' for some a fun little single track loop, which leads you back to the intersection, and the hike-a-bike to the top of the Hydro Cut that ends your first stage.  Take a break.  You've only done 3 or 4 km, but mostly up.  You are ready for the second stage, some very cool flowy trail that curves back and forth along open single track in the Hydro Clearing.  But before you descend, just after you reach the top of the Hydro cut hike-a-bike, you'll see some trails going up the hill to the left.  There are some advanced trails up here, like Ed's bypass (which I marched up) and \"made in the shade\" which is steep switchback back down to Dead End loop again.  Yes, those who wish for pain get to hike-a-bike right back up to the Hydro Cut.  While the slackers are snacking and waiting (I would be in this group), tire your hardcore friends out a bit by sending them up Ed's Bypass and down Made in the Shade, to climb back up to you where you are all ready to begin Stage 2.  That'll take 'em 15 minutes or so. Now let's move on.\nIt's a gentle slope down for 4 km or so, but don't just ride down the Hydro gravel road, the zig-zag trail to Rob's Corners is on the right, it's about 100m down.  Look for tire tracks!  There is a SORCA shelter about a kilometer down the trail, at a major intersection, with an excellent posted contour map (see pics below).  While the zig-zag trail is a beginner to intermediate level, look to the right in the trees, some great trails parallel the open trail but take you on low ladders, bridges, and rooty corners.  You can identify Rob's Corners that you passed, on the Sorca shelter map, and, Cliff's corners. Just enjoy the easy flow down. \"Don't tell Jude\" is one such North Shore trail on the right in the trees. it spits you back out on the Hydro Cut. Eventually you will come to the end of your southerly down slope and you'll turn right, least you hit the Hydro Fence which is gated.  So, now you are on some gravel path, taking you over a bridge with rock on your right, and very little on your left.  The directions are a bit vague here, as there are many trail branches,  but if you generally stay to the main trail and keep right at major trail intersections, you'll be following ??lumberjacks' trail as it gradually turns you back facing north and up for your return along Jack's trail, which we'll call stage 3.\nYes, if you make it to Jack's trail, which is the  major route back to Alice Lake, you've got a few kilometers of gentle up, but just enough to get you very tired and feeling good about a dip in Alice Lake, or that refreshing drink waiting for you at the camp ground.Jack's trail is gorgeous single track, and, cross-country cyclists will be happy.Once at Alice Lake, continue along park roads back to the day use area, or, your camp spot.  Congrats, good ride!   \nA nice option might be to load the GPS data in this trail write-up into your own GPS and use it as a background map, since the tracklog and GPS reception was very good and will give you a very good trail map and your GPS will show you your  position on it.  It's a handy reference, as the trail intersections are not well marked in places.",
    "directions": "To get to Alice Lake Camp ground, drive to Squamish from Vancouver along Hwy 99.  Once in Squamish, stop for any water or supplies.  Continue past the town of Squamish along 99 another 3 or 4 km keeping an eye out on the right for Alice Lake Provincial Camp ground.  Drive into the park, going past the campers entrance if using the day use area.  Once on the bikes, keep riding up the road (you can only go so far before reaching the maintenance yards, in which case you've gone too far).  Instead, keep your eye out on the right for a yellow gate.  It's maybe 500m or  1 km up the park  road.  Once on this gravel logging road (long deactivated) continue climbing on your bike as it switchbacks two or three times, until you get to the first  major trail intersection that is well signed.  It's on your left.  Here, follow Rob's Memorial Trail to Dead End loop, and follow the rest of the trail described above.  \nThis route is about 1/3 of the test of metal, in fact, if you go in late may or early June, you'll get the benefit of following signs put up for practice riders.  I followed the signs the whole way (except for my little detour up at Made in the Shade).\nWinners do test of metal in about 3 hours, and this part of the route is not the toughest, so, hopefully you'll get this loop done in two or three hours!\nSee the attached map (a photo on the Hydro Cut near Rob's Corners), it.  Once you climb up the Hydro Cut, you've got a fast flowy fun XC ride, with some North Shore intermediate ladders off in the woods on the right.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/489/reg_Robs.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/489/reg_map.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/489/reg_play.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/489/reg_shade.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/489/reg_view.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/489/reg_views.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/489/narrow_bigmap.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/robs-trail-alice-lake-trails-near-squamish-bc-489",
    "stats": {
        "Activities": "mtn-bike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 4,
        "Time": "4 hrs",
        "Total Distance": "25 km",
        "Town": "Squamish, BC",
        "Type": "out-and-back"
    },
    "title": "Robs Trail & Alice Lake Trails",
    "trail_id": "489"
}