{
    "description": "I planned this trip for a group of boys and a few adults in my troop. It's easy on the mileage and great on the views. We had a great time and only paid for one of the huts. If you prefer the huts then you could easily change a few things to fit your needs. \nDay 1 - 2.7 MI \nIt starts off at the Crawford center on Rt. 302. From there you take the Crawford path to the mizpah cutoff, which will take you to the hut and Nauman Campsite. \nDay 2 - 4.9 MI \nStarting from Mizpah hut taking the AT/Crawford path up and over Mt. Pierce, Mt. Eisenhower and Mt. Monroe ending at Lake of the Clouds Hut. If you wake up on the morning of the second day and it is very cloudy and misty, wait a few hours and it will clear up beautifully. \nDay 3 - 6.7 MI \nStarting from Lake of the Clouds Hut and ending at the perch. This day will take you up and over Mt. Washington, Mt Clay, and Mt. Jefferson. I highly suggest making it to the top of all peaks, although the AT goes around most of them I would say it's worth the hike to the top. The perch is a nice site, unique and awesome. \nDay 4 - 4.2 MI \nFrom here you can go down to Rt. 2 if you want, taking Randolph Path to Lowe's path to Rt. 2. In between is a cabin if you want to stay there. Some of us did that, while others went up back to the AT and summited Mt. Adams and Mt. Madison. It's all up to you.",
    "directions": "Directions to the Trail head are easy you can find them from anywhere on the AMC website. www.Outdoors.com. The trail starts right across the street from the crawford center. By the way don't forget to buy the overnight parking passes. \nThe ending point comes out on Rt. 2. There is a small parking area that is somewhat hard to find. I will put it in with the GPS info but if you don't have a gps look for Lowe's old general store.",
    "geohash": "drv",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/NH/4890/reg_DSCF0532-16250.jpg",
        "https://trailpeak.com/storage//content/trails/US/NH/4890/reg_DSCF0541-16250.jpg",
        "https://trailpeak.com/storage//content/trails/US/NH/4890/reg_DSCF0555-16250.jpg",
        "https://trailpeak.com/storage//content/trails/US/NH/4890/reg_DSCF0593-16250.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mizpah-madison-hut-near-jefferson-nh-4890",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring summer",
        "Stars": 4,
        "Time": "28 hrs",
        "Total Distance": "31 km",
        "Town": "Jefferson, NH",
        "Type": "out-and-back"
    },
    "title": "Mizpah - Madison Hut",
    "trail_id": "4890"
}