{
    "description": "NTS Map: 092G11According to Peggy Moire, our senior contributor, the Squamish River Dykes are a very nice outing, very popular, and flat. The only drawback is the drive from Vancouver, an hour and a half.  Most of Peg and Ken's suggestions (members of the North Shore hikers since 1960) now focus on flat easy hikes, with lunch and facilities nearby.  Park opposite the rail yeards, in the treed area, and, begin your walk down to the jetty where windurfer's speed across the waters.  The area has become known as the \"Gorge\" of the North, very popular with windsurfers due to the hitgh-winds funneling out of the mountains into the bay. There is a toilet in the area.  Peggy and Ken have seen a few whales and seals over while walking in this area.  There are many nice places for lunch in Squamish, and, if you find a nice patio, bring your binoculars so you can watch the climbers (little speckles) on the sheer rock-face of the Chief.  Shannon Falls and the Chief are both closeby.  For those who are looking for a real vertical challenge near Squamish, with a couple of thousand feet of elevation gain, and spectacular alpine views, check out Lake Lovely Water, which we mapped in 3D for you.  It might sound serene and gentle but while this hike/climb and camp area is one of the most beautiful you can find in B.C., it is rugged, and popular with climbers who set up camp on the lake. Access is just up the road from the dykes.",
    "directions": "See description and / or GPS",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/49/reg_SquamDyke.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/49/reg_map.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/squamish-river-dykes-near-squamish-bc-49",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "6 km",
        "Town": "Squamish, BC",
        "Type": "out-and-back"
    },
    "title": "Squamish River Dykes",
    "trail_id": "49"
}