{
    "description": "Triple Divide Pass (Cut Bank area of Glacier National Park). \nFrom the Cut Bank campground parking lot, the well-signed trail ascends gradually, gaining about 2,200 feet (670 m) over 8 miles (13 km). The bear grass was resplendent at lower elevations as we passed through grassy meadows filled with blooming Indian Paintbrushes and other alpine wildflowers. \nFor the last couple of miles, the narrow trail clings to cliff walls of Mt. James in classic Glacier Park style, producing a very thrilling feeling from the exposure. Beautiful waterfalls pour down from the walls of Razoredge Mountain filling Medicine Grizzly Lake below. \nFrom the pass, we scrambled the most direct route to the summit of Triple Divide Peak, basically straight up the 600 ft (180 m) of loose, crumbly, class III ledges to the top.  For peakbaggers, an easier (albeit longer) alternative exists from Triple Divide pass - Mt. James would be an easy walk-up.",
    "directions": "From St. Mary, follow highway 89 south for about 20 minutes. At the Cut Bank campground turnoff, follow the dirt road 4 miles (6.75 km) to the end and enter Glacier Park. Park at the Cut Bank camping area.",
    "geohash": null,
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/MT/4908/long_Triple-Divide-Pass-7064.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/4908/long_view-of-triple-divide-peak-from-pass-7064.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/4908/reg_razoredge-mountain-frm-triple-divide-pass-7064.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/4908/reg_trail-with-triple-divide-peak-in-background-7064.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/4908/Triple Divide Pass.png"
    ],
    "source_url": "https://trailpeak.com/trails/triple-divide-pass-near-babb-mt-4908",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "8 hrs",
        "Total Distance": "26 km",
        "Town": "Babb, MT",
        "Type": "out-and-back"
    },
    "title": "Triple Divide Pass",
    "trail_id": "4908"
}