{
    "description": "Jesusita is probably the most fun you'll have going down on anything in Santa Barbara (at least in the \nopinion of this non-DHer). But be warned: you have to earn that fun. The climb can be pretty taxing, \nalthough you'll need to burn those extra calories to earn the celebratory beers you'll want after flying \ndown the nearly 1900' you climbed. There isn't much that Jesusita doesn't offer. On the way up you'll \nhave to deal with some paved road and then a lot of steep, technical singletrack, and on the way down \nyou'll encounter everything from tricky rock gardens to fast, swoopy switchbacks. This ride will get you \nhot, sweaty, and dirty, but who really enjoys good, clean fun anyway? (Please be sure to read the \nDisclaimer for Santa Barbara Trails at the bottom of this description!)\nThere's more to come, so stayed tuned. Those 1900' have me too beat to finish the description, but at \nleast you have the photos and gps to hold you over. \n***Disclaimer for Santa Barbara Trails***\nAll of the trails in Santa Barbara are multi-use, and are used extensively by hikers, equestrians, and \nmountain bikers alike. When controversy arises (and it frequently does in this area), mountain bikers \nare the first ones on the chopping block. To ensure that we all get to coexist on the trails, please yield to \nall other users and be respectful to everybody that you encounter. Most importantly, use a bike bell! A \nbell box with free bells is provided at the trailhead, but these are often empty, so grab one of your own \nat a bike shop or craft store. The use of these bells helps to keep mountain bikers on the trails we all use \nand love so much!",
    "directions": "From US 101:\n-Los Positas Rd (turn left if coming from the north; turn right if coming from the south)\n-Travel along Los Positas and cross over State Street. At this point the road will become San Roque Rd.  \n-Continue straight on San Roque Rd.\n-Turn left on Calle Fresno.\n-Turn right into Stevens Park, and park anywhere you can.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/CA/4909/reg_Jesusita1-14825.jpg",
        "https://trailpeak.com/storage//content/trails/US/CA/4909/reg_Jesusita10-14825.jpg",
        "https://trailpeak.com/storage//content/trails/US/CA/4909/reg_Jesusita11-14825.jpg",
        "https://trailpeak.com/storage//content/trails/US/CA/4909/reg_Jesusita4-14825.jpg",
        "https://trailpeak.com/storage//content/trails/US/CA/4909/reg_Jesusita8-14825.jpg",
        "https://trailpeak.com/storage//content/trails/US/CA/4909/narrow_Jesusita2-14825.jpg",
        "https://trailpeak.com/storage//content/trails/US/CA/4909/narrow_Jesusita3-14825.jpg",
        "https://trailpeak.com/storage//content/trails/US/CA/4909/narrow_Jesusita5-14825.jpg",
        "https://trailpeak.com/storage//content/trails/US/CA/4909/narrow_Jesusita6-14825.jpg",
        "https://trailpeak.com/storage//content/trails/US/CA/4909/narrow_Jesusita7-14825.jpg",
        "https://trailpeak.com/storage//content/trails/US/CA/4909/narrow_Jesusita9-14825.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/jesusita-loop-near-santa-barbara-ca-4909",
    "stats": {
        "Activities": "mtn-bike hike",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "16 km",
        "Town": "Santa Barbara, CA",
        "Type": "out-and-back"
    },
    "title": "Jesusita Loop",
    "trail_id": "4909"
}