{
    "description": "The Monkman Pass Memorial Trail is BC's newest hiking trail (July 2008), and brings together the Peace Regions of Alberta and BC.  The Monkman Pass trail goes through some of the most untouched wilderness in the world, passing through the Monkman Provincial Park and ending with a river boat trip down the Herrick river.  This trail is now amongst the toughest trails in Canada, and will leave you begging for more. \nThe trail starts with Kinuseo falls (210 ft), then goes by a series of 10 waterfalls (The Cascades), and on to Monkman Lake.  It then continues up onto a sub-alpine plateau know as the Monkman Tarns region.  Here there are several peaks that can be scrambled and wide open alpine hiking.  This area will blow your mind!  \nFrom there, follow down Fontoniko creek past Hobi's Cabin on the Herrick River.  The trail passes by Puddle Lakes and a gorge.  Several small waterfalls are along this section.  The trail then goes back down the other side of the divide. The vegetation starts to change.  There are large douglas fir, balsam poplar, devil's club and huge ferns and skunk cabbage.  The trail follows a plan that was marked for highway back in 1937/38 and slashes are still visible on the trees.\nMore information about Monkan Provincial Park can be found here.",
    "directions": "Travel to Tumbler Ridge.  Follow the signs out to Kinuseo Falls and Monkman provincial camp ground. It's about 57 km from town.  The drive alone is a trip through history, with over thirty points of interest along the way, including dinosaur sites, short hiking and mountain biking trails, and many historic sites associated with Alex Monkman and his heroic band of pioneers. \nThe trail head starts at the camp ground and proceeds along the Murray River.",
    "geohash": "c39",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/4917/reg_01270010-0.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/4917/reg_Monkman-Trail-South-end-McGreger-June-08-037-0.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/4917/reg_P1000071-24-q001-0.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/4917/reg_P1000078-17-q001-0.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/4917/reg_P1000089-6-q001-0.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/4917/reg_P7200497-0.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/4917/reg_P8230657-0.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/4917/reg_P9230186-0.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/4917/reg_P9240887-0.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/4917/reg_best1_P9240876-0.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/4917/narrow_P9050852-0.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/4917/narrow_monkman-pass-memorial-trail-map-6103.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/monkman-pass-memorial-trail-near-tumbler-ridge-bc-4917",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 5,
        "Time": "42 hrs",
        "Total Distance": "63 km",
        "Town": "Tumbler Ridge, BC",
        "Type": "out-and-back"
    },
    "title": "Monkman Pass Memorial Trail",
    "trail_id": "4917"
}