{
    "description": "Liumchen Lake is a beautiful Ecological Preserve only a 2-hour drive from Vancouver, and is a great destination for those who want a pristine back country experience replete with bears, eagles and other wildlife and epic views of Mt. Baker and the Cheam range. This trail has a little bit of everything; spectacular views, alpine meadows, lush forest, mountain streams, and a healthy resident population of Cessna sized horse flies.  Liumchen Lake is an Ecological Preserve since 1998 and as such please respect the rules associated with an ecological preserve (no camping, no fires, no fishing, no picking flowers, please leave it as you found it) http://www.env.gov.bc.ca/bcparks/eco_reserve/liumchen_er.htmlWe did this trail in late July but there was still plenty of snow. Most of the meadows ranged from swampy to completely submerged. We've had such a late melt this year that August probably would have been a better time to visit. Blueberry bushes abound and the alpine flowers were blooming at the peak. It will be a few more weeks before the meadows have dried out enough for the flowers to bloom but when they do, it will be spectacular. You will need a 4x4 to make it to the trailhead. Most cars can make it the first 13 km along the logging road (there was a Volkswagen Bug parked at this point when we did it although their license plate had taken a bit of a beating). If you don't have a 4x4, you will have to hike up (and I mean up!) the last 2 km to the trailhead. There is a large parking area and a well-marked trailhead. The first 1.5 km of this trail climbs pretty steeply but the best views are at the top so keep that in mind as you trudge up the first 250 or so meters. There are some beautiful views of the Chilliwack mountains just before you head into the forest. The trail then heads into the trees and switches back up to the top of the ridge, depositing you at the peak with a breathtaking view of Mount Baker and the surrounding ranges which is more than enough reward for your efforts. The trail then loses elevation all the way down to the lake. For the next 3 km, the descent is gentle with the scenery changing from forest to meadows every 10 minutes or so, often with more beautiful views. There is a branch trail on your left, which will take you to Church Mountain. Even if you don't do the Church Mountain trail, it's worth your while to take it for about 10m to the top of the ridge for another viewpoint. At about 4 km, there is another branch to Liumchen Mountain. Continue on the main trail to the right which now starts to descend more quickly down to the lake, passing a huge alpine meadow at the old cabin site before making its final decent along side a creek.",
    "directions": "From Chilliwack, drive towards Cultus Lake. Drive through the town, and then hang a left on Sleepy Hollow Road. Set your odometer to 0 here. Sleepy Hollow Road turns into Vance Road and then into the Chilliwack-Liumchen West forest service road at .9 km.Keep left at 4.4 km when the Chilliwack-Liumchen West FSR peels off to the right. AT 5.8 km, keep right and climb for 7.5 km. You'll have to leave your car here, or if you have a 4x4, take the right branch here and climb the last 1.9 km to an elevation of 1440 meters at the trailhead.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/492/long_20170729-102710-51173.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/492/long_20170729-113905-51173.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/492/reg_Pictures004.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/492/reg_Pictures018.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/492/reg_Pictures026.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/492/narrow_Pictures030_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/492/narrow_Pictures034.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/liumchen-lake-trail-near-chilliwack-bc-492",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 4,
        "Time": "6 hrs",
        "Total Distance": "10 km",
        "Town": "Chilliwack, BC",
        "Type": "out-and-back"
    },
    "title": "Liumchen Lake Trail",
    "trail_id": "492"
}