{
    "description": "An OK little trail, it starts out on a rocky ex-road now closed to vehicles then switches to some single-horse-track (only if you get lost and/or lucky)  then ends up at Barrier Lake.  All the while gaining elevation that you don't really notice until you get to rip back down the way you came.\r\rStrictly speaking, it is an out-n-back of about 22km.  But there are some options involving Prairie View trail, Jewell Pass, and even the Quaite Valley (perhaps requiring a shuttle).  Or you can keep going South all of the way to Ribbon Creek.  Climbing is moderate, but at the end of the day, we accumulated over 400m of total cumulative climbing.  Not bad.\r\rThe South end of the trail ends up at the edge of Barrier Lake just West of the Dam.  You can go for a dip but be forewarned, shrinkage will likely occur.\r\rAn interesting side note is you get to ride past some interesting artifacts of the original Aboriginal inhabitants.  At least 2 sacred cerimonial Lodges are beside the first couple km of the trail.\r\rAnd on the way back we got to chat with a couple Conservation Officers.  They were out \"to check out a couple things\" and since they had two Corillian Bear Dogs with them, I can guess what at least one of the things was.\r\rBottom Line ---------------------\rNot bad, I'd do it again if I needed a ride that wouldn't punish my riding partner(s) too much.",
    "directions": "Drive west of Calgary out #1 to the Seebe exit ramp (just ~3km West of Hiway 40 exit).  Take exit & go to South.  Travel down road under 1km to the first (only?) stop sign.  Drive STRAIGHT (after stopping) and park in the parking lot 50m to the right.  You're there.  Start your ride by heading South between the boulders down the rocky road to Barrier.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/4927/reg_StonyProfile-6828.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/stony-trail-near-canmore-ab-4927",
    "stats": {
        "Activities": "mtn-bike ski-xc snowshoe",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 3,
        "Time": "4 hrs",
        "Total Distance": "22 km",
        "Town": "Canmore, AB",
        "Type": "out-and-back"
    },
    "title": "Stony Trail",
    "trail_id": "4927"
}