{
    "description": "The Trans Canada Trail from Kelowna to Penticton follows the old Kettle Valley Railway.  The trestles are now rebuilt after a big fire in 2003.  The first 15 km are mostly in Myra Canyon, famous for the trestle bridges that span the canyon.  After 35 km, you reach Chute Lake Lodge.  There is road access here if you need it.  Chute Lake is very picturesque.  From here to Penticton is a gentle downhill grade, so your sore butt and legs should be ok for the final 45 km.  The trail switches back twice just before Naramata.  From Naramata to Penticton it is not as isolated as around Myra and Chute Lake, and the trail finishes on the waterfront in Penticton.  Do the trail from Kelowna to Penticton to take advantage of the gentle downhill.Bike shop / rentals: Freedom Bike Shop Accomodations: Summerland Resort",
    "directions": "Take Pandosy south off Highway 96 (Harvey) in Kelowna and turn left on to KLO. Turn right on McCulloch Road past June Springs Road, down a sketchy narrow canyon and look for a sign pointing right yp a gravel road.  Turn right and follow the gravel road as it switches back a few times and crosses a few cattle guards.  At the top, turn right and you will see the old Myra Station location.  There are washrooms here.  Park here (or get dropped off for Penticton pick-up) and let er rip.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/4928/reg_051-42313.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/4928/reg_053-42313.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/4928/reg_IMGP5480-6465.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/4928/reg_IMGP5485-6465.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/4928/narrow_044-42313.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/4928/narrow_046-42313.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/4928/narrow_056-42313.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/4928/narrow_IMGP5491-6465.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/kettle-valley-railway-kelowna-to-penticton-near-kelowna-bc-4928",
    "stats": {
        "Activities": "snowshoe hike ski-xc mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "8 hrs",
        "Total Distance": "80 km",
        "Town": "Kelowna, BC",
        "Type": "out-and-back"
    },
    "title": "Kettle Valley Railway- Kelowna to Penticton",
    "trail_id": "4928"
}