{
    "description": "A ride that can be long or short; an in and out or a shuttle or a marathon; wet or dry, easy or hard depending on distance.  A good intro to MTB, easy to get to, an EMPTY trail, very good scenery across the lake (Spray that is) but a lot a gravel road and not much skinny track.\nStart down the familiar Goat Creek trail.  At about 800m you will see a T to the left (South) for this trail.  There is a couple fun little rips down some overgrown single track.  When you get to the pumphouse?  reclamation area? whatever, stay to the right, make one crossing of the creek (your feet.  they'll be wet) and look for a trail going uphill exactly to the SW of you.\nIn the area of the pumphouse, look around for the ariel nest of a large raptor of some sort.  (I say Bald Eagle, wife says Hawk.  Too big for a hawk I think).  She (the eagle) was a little pissed at us riding by, musta had chicks in there.  Or maybe it was a he and he had some Chica there.\nIf you stop at the levee across the N end of Goat Pond (about 6.5km) and look west you will see some really interesting features or formation in the mountains above.  I don't know the name of the area, it is North of the Three Sisters and South of Mt. Lawrence Grassi (possibly considered part of Grassi though?)\nAbout 9km in you'll get to THE BOG.  Nothing serious, your feet are already wet.  (oh, the girls half of the ride?  Ewww, it's wet.  And slimy.  Let's turn around now, have lunch back at Goat Pont then go into the Rose & Crown in Canmore then come back for the guys in 3 hours (luckily for them just as we were getting back from our 54km epic)).\nAfter a total about 12km you will get to the West Spray road.  From here South it is all gravel.  The first 5km is vehicle access for the campsite there.  After that it is closed to traffic but still gravel.  \nBy the way, where the road is closed, there is a public parking area here and you can drive to here and ride South from this point as well.  Also from 5km N of here at the West Spray road access.\n9km past the South end of the vehicle road you get to Canyon Damn (I mean Dam).  It was very scenic!! (2 exclamations).  A couple fellows that were out of water walked down with the purifier pump & refilled.  The trail down the W side of the dam will get you to Vermillion Lakes & Banff in about 35km BUT the trail is not open to bikes.\nYou can continue to travel South and will end up at Watridge Lake, Mount Shark et al.  Unless you're training for the Tour de Jour, you'll want a ride waiting there for you.\nBear country.  We didn't see any, just a Moose.  JUST a Moose?  Yes, but a great looking one.   None of that torn fabric crap hanging off his antlers.  No mangy looking coat.  This guy was a Wikipedia entry coverboy for MOOSE (n.)  Great dark brown shiny coat, very healthy looking.  (A Chocolate Moose as T deemed it {not that she saw it from her barstool perch at the Rose & Crown}.)  Back to bears.  You're in prime bear country AND habitat.  Be aware (the world needs more wares).\nIt can be a long ride as my knee and 4 Advil gels will attest.  Other than bears, reasonably safe.  Anybody that needs to drop out?  Other than the bears, you can leave them there & pick 'em up on the way out (assuming the In and Out option is chosen).",
    "directions": "Calgary take #1 West to Canmore.  Then up past the Nordic Center (follow the signs).  Then 5km more South down the Spray Lake Road (Smith Dorien Trail).  Into the Goat Creek (Ha-Ling) parking area.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/4937/reg_DSC01722-Medium--6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/4937/reg_DSC01732-Medium--6828.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/goat-west-spray-lake-mt-shark-near-canmore-ab-4937",
    "stats": {
        "Activities": "snowshoe hike ski-xc mtn-bike",
        "From": "",
        "Seasons": "winter fall summer spring",
        "Stars": 2,
        "Time": "4 hrs",
        "Total Distance": "40 km",
        "Town": "Canmore, AB",
        "Type": "out-and-back"
    },
    "title": "Goat - West Spray Lake - Mt. Shark",
    "trail_id": "4937"
}