{
    "description": "We parked at the Douglas Fir Loop Access trailhead and hiked the bottom part of the Douglas Fir Loop down to Lava Camp. We took our time admiring the huge trees and got there just before noon. There are several nice campsites but no water nearby. We then proceeded up the main trail. While there is an elevation Gain/Loss of only 110m between Lava and the next camp (Rocky), be prepared to gain and lose that same 110m over and over again. It's not a hard trail, but it is not a walk on the sea wall. You're mostly in the trees although there are two or three viewpoints along the way, looking down into the spectacular canyon below. Watch for neat lava rocks all along the trail. There are a lot of logs (some of them big!) across the trail and just before you get to Cessna Creek it traverses quite a steep section which is quite slippery in parts. Cessna Creek is about 2/3 of the way from Lava Camp to Rocky Camp. After crossing the creek, you can either continue on the main trail, or dump your pack and take a side trip up to Eagle Bluffs. We completely missed the turn off on the way in. It's much easier to see on the way back but it's just past the creek on your right. You pass through the Research Camp on your way. We pressed on to Rocky Camp. The best view yet is about 10-15 minutes past Cessna Creek. The trail continues to gain and lose elevation passing through a dry creek bed and forest. About 10 minutes before Rocky Camp you pass a VERY cool little stream, which is coming down an old lava flow. It's very shallow and looks and sounds just like a Chinese water garden. I've never seen anything like it. Fill up here. This is your closest water source if you're staying at Rocky Camp. Trail heads uphill again and you soon come to Rocky Camp. We camped here and headed back the next morning. Dropped our packs at the Research Camp and hiked up Eagle Bluffs. It was mostly a pleasant hike. Elevation gain is about 350m and it took us about 50 minutes. Near the top it does get ugly as you scramble up some scree and rock with some dicey footing but we managed to survive with minimal blood shed. The views at the top are fantastic. 360-degree panorama. By far the best view along this section of trail. Do not miss this. The mosquitoes soon sent us scurrying back down which was worse than coming up (on the rocks) but still totally manageable by any fairly proficient hiker. Picked up our packs and continued to head back. Took the Douglas Fir Loop turn off just before Lava Camp and hiked the top part of the loop, making our way back to the car. There were lots of HUGE trees over 1300 years old. Really awesome. The trial is a little rougher here but again, totally manageable. Just lots of climbing over fallen trees and it's more overgrown than the main trail. There is a branch trail that will take you up to Bear Bluffs Lookout, but since we'd already done Eagle Bluffs which was a lot higher we decided to save it for next time. We'd left the campsite at 8 am and were back at the car at 12:45. There is GPS data attached to this trail (see \"download GPS\"), which if loaded into your GPS can help you find route points.\r",
    "directions": "Set your odometer to '0' at the Squamish McDonalds. Continue up the highway and turn left onto Squamish Valley Rd (9.9 km). At 13.5 km keep left. At 33 km the road turns to gravel. Keep right at 34 km. Stop and talk to the Interfor guys if they're there. They were really helpful and showed us on the map where the trucks were coming from. We met up with another guy part way up (we were following him and he had pulled over to let a truck pass and came back to talk to us). He radioed ahead to tell the trucks we were on the road. At 61 km turn left and cross the bridge. At 71 km keep right (do NOT cross the bridge). At 76 keep right on E-main. At 96 keep left, staying on E-1000. There are 3 turn offs on the left to the trail. We took the third one. If you're not driving something with some ground clearance you might want to leave your car just before the parking lot as the last 100m is the roughest part of the road. I was dragging my trailer hitch on my 4x4.\r",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/494/reg_eagle_bluffs.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/494/reg_topoUllr.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/494/reg_trailhead.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/494/reg_treehugger.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/494/narrow_20070714023JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/494/narrow_view1.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/elaho-valley-to-rocky-camp-eagle-bluffs-near-squamish-bc-494",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 3,
        "Time": "9 hrs",
        "Total Distance": "0 km",
        "Town": "Squamish, BC",
        "Type": "out-and-back"
    },
    "title": "Elaho Valley (to Rocky Camp) & Eagle Bluffs",
    "trail_id": "494"
}