{
    "description": "The closest town is actually Ioco (and village of Anmore). \r\n\r\nCourse for the 10th NSMBA Twoonie Race Aug 22nd is a great trail for some good flowy up and down singletrack, particularly on the west side of Buntzen.  The east side features double-track as per the picture above, but once you get to the north end of the lake, cross the dam, and sweep up and around onto Lakeview Trail, you will find your heart going to max as you climb up, then ride down, a set of steep switchbacks.  Over and over.\r\n\r\nThis trail goes around Buntzen Lake and consists of technical climbs, switchbacks and ripping descents. \r\n\r\nYou can ride it counter clockwise or clockwise.  There is GPS data attached to this trail (see \"download GPS\"), which if loaded into your GPS can help you find route points.\r",
    "directions": "Buntzen Reservoir Recreation Area is located approximately 30 km from Vancouver in the village of Anmore. From Hwy 7A (Barnett Highway) take the Ioco exit and follow Ioco Road. Turn right onto 1st Avenue and again at Sunnyside Road. Sunnyside Road will lead you directly to the entrance gate. An alternative route from the Ioco Exit is to continue straight through on Heritage Mountain Boulevard. Follow the signs to the right on Parkside Drive, left onto Aspen Drive, and right onto East Road until the road ends at Sunnyside Road. Sunnyside Road will lead you to the entrance gate.  Parking lots and the main beach area are located about 2 km inside the main entrance gate. \r\n\r\nGPS coverage was great, and we found that in mapping this route, it was helpful to see just where we were relative to our starting point, one of the nice features of GPS, the onscreen breadcrumb trail showing you what you've done. A great ride, very fast, flows!\r",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/495/reg_GeneratingEast.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/495/topo_BuntzenNorth.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/495/narrow_LakeviewMap.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/buntzen-lake-lakeview-trail-near-vancouver-bc-495",
    "stats": {
        "Activities": "mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "5 km",
        "Town": "Vancouver, BC",
        "Type": "out-and-back"
    },
    "title": "Buntzen Lake - Lakeview Trail",
    "trail_id": "495"
}