{
    "description": "This was a paddle idea where I knew more about the launching attraction  than I did the actual paddling area!\nIn my early 20's, Blue Rocks was an area I was first attracted to, due in part to how photogenic the little spot was. It has fishing shacks, and all the characteristics of your typical Peggy's Cove locale, but with a sense of solitude.\nI noticed that not a whole lot had changed as I launched my kayak near one of the skids, and headed toward what appeared to be land and smashing waves on rocks, due sort of South. I marked a waypoint, and went at it.\nThe wave conditions were pretty good, and like true ocean conditions, there were these really big long swells that lifted and lowered you. You could see them coming and leave you remembering what suttle power the sea does have. I didn't know it at the time, but I was headed toward The Ovens, a provincial park / camping / trail destination. Another time to investigate I guess...\nI was actually crossing Lunnenberg Bay, and maybe it was due to the fog, but there was little eye candy to look at as I paddled. Along the shore, things would look nice, but the getting too close would be dangerous in the current conditions.\nA definite thing to note about paddling in these parts is that the water is truly Atlantic ocean water with all its coldness. When that hits the warm land and warm air, you get fog. I was never completely fogged out, but I did manage to lose sight of buoy once, and found that to set me ill-at-ease. The Fog did manage to block my view of the land at times, and it would get thick and then thin out. Never the less, I did manage to take a bearing, and I did have my GPS running at the time, so I knew I had a few fall backs.\nUpon returning, I explored up the coast a little bit, but found the surf a bit untrustworthy for being close to the rocky shore.\nshannon Burt\neast coast editor",
    "directions": "Leaving from Mahone Bay, follow the signs toward Blue Rocks.",
    "photos": [],
    "source_url": "https://trailpeak.com/trails/blue-rocks-lunnenberg-bay-near-mahone-bay-ns-4957",
    "stats": {
        "Activities": "sea-kayak",
        "From": "",
        "Seasons": "summer",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "8 km",
        "Town": "Mahone Bay, NS",
        "Type": "out-and-back"
    },
    "title": "Blue Rocks, Lunnenberg Bay",
    "trail_id": "4957"
}