{
    "description": "Park on either side of the bridge (waypoint 1 ? Br) and start riding.  If you want to shorten the ride, drive up 2.5 km and turn left on Frederick Road (wp2 ? Fr) and leave your car there.  That?s where you?ll end up at the end of the single track.\r\rOtherwise, stay on Criss Creek road and keep climbing.  About 3 km past Frederick road, you?ll see another road turning off on your left (wp3 ? TO).  Turn off here and follow it for another 4.5 km (there are distance markers).  Look for a set of double tracks on your left just past the 4.5 km mark (wp4 ? DT).  Follow this double track for 800 meters and look for a turn off on the right (wp5 ? RT).  This will take you down to another double track on which you will turn right again.  There will be another left hand turn (wp5 ? LT) about 900 after the last waypoint.  Follow this double track and keep your eyes open for the beginning of the single track (wp6 ? ST) on your left (500 meters after the last turn).  There will be a small (and easily missed) sign on the left.  If you keep going, you?ll end up at a look out but will have to climb back out to find the trail.  This single track (about 4 km) will lead you back down to Frederick road. \r",
    "directions": "Take Tranquille Road past the Kamloops airport and golf course. Turn off on Red Lake Road (also called Tranquille-Criss Creek Forest Service Road).  Park on either side of the small bridge that you will cross.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/4962/reg_DSC09235-15256.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/4962/reg_DSC09239-15256.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/4962/reg_DSC09241-15256.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/4962/reg_DSC09245-15256.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/dew-drop-as-a-loop-near-kamloops-bc-4962",
    "stats": {
        "Activities": "mtn-bike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "21 km",
        "Town": "Kamloops, BC",
        "Type": "out-and-back"
    },
    "title": "Dew Drop as a loop",
    "trail_id": "4962"
}