{
    "description": "July 19/2008\nStarting at Lunch Creek, we quickly ascended Piegan Mountain and were at the summit in a couple of hours (click here to see Piegan's description on Trailpeak). We dropped back to the shoulder between Piegan and Pollock and were greeted by huge wind gusts that caused us to don our shells. \nFrom the shoulder, we found a well worn hiker's trail in the scree that skirted along the base of Pollock's cliff walls. The trail disappeared just past the huge gendarme (as shown in photos). The great cleft route, as described in Gord Edward's book was obvious, but more intimidating than described. To attain the cleft required a bit of climbing over loose, crumbly ledges, and the start of the cleft required some tight crack climbing with some exposure (class IV). It was hard to get through with a backpack, and I had to take mine off a couple of times and push it in front of me, as it kept getting stuck.\nAbove the cleft, the views opened up and we quickly scrambled to the summit of Pollock and saw the long, interconnecting ridge to Bishop's Cap, and impressive Mount Gould off in the distance. Mount Siyeh dominates the views to the east. \nWe descended the way we came.",
    "directions": "Going to the sun highway. We parked at the Lunch Creek parking area, although alternatively, one could park at the Siyeh bend and take the Piegan Pass trail and hike to the shoulder between Pollock and Piegan. It is recommended to check the Glacier National Park website for conditions on the road before heading out in early summer as the road is often not fully open until late June or early July. Reference: Gordon Edward's 'A Climber's Guide to Glacier National Park'.",
    "geohash": null,
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/MT/4965/long_best1_bishop-s-cap-and-mt-gould-7490.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/4965/long_pollock-from-Piegan-7490.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/4965/reg_gendarme-near-great-cleft-on-pollock-7490.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/4965/reg_james-walking-accross-a-big-snowfield-7490.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/4965/reg_piegan-pollock-7064.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/4965/reg_view-from-summit-towards-logan-s-pass-7490.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/4965/narrow_James-emerges-from-the-great-cleft-7490.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/4965/narrow_going-down-the-cleft-7490.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/4965/narrow_james-on-summit-of-pollock-7490.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/4965/narrow_looking-back-at-pollock-7490.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/4965/narrow_the-great-cleft-7490.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/pollock-mountain-near-babb-mt-4965",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 5,
        "Time": "8 hrs",
        "Total Distance": "2 km",
        "Town": "Babb, MT",
        "Type": "out-and-back"
    },
    "title": "Pollock Mountain",
    "trail_id": "4965"
}