{
    "description": "I knew something was up when I was seeing both tight and wide-swirling eddies ahead of me as I was appraching the first island and basalt sea stacks. The tide was changing, but I didn't know which way.\nI had just left the glassy sheltered waters of the little cove at Five islands Provincial park. they had a nice gravel beach that was an easy walk from the day use parking area. Looking at the water conditions made the choice an easy one between a paddle or a hike. It turns out in the end that the paddle was the only option because the trails were closed due to upgrade work.\nFive Islands Provincial park is located on the shores of the Bay of Fundy, which is also the location of one of the highest tides in the world! When one goes for a paddle in these parts, it is of vital importance to know the tidal activity in the area. With it also being a full moon, the effects are amped even more. I on this occasion never even read the posted tide times in the park when I entered. Luckely I wasn't too affected. At complete low tide, the mud flats can run right out to at least to the first island.\nAs you probably gathered, the name of the area came from the literal five islands that are situated in the Minas basin like stepping stones. From Wikipedia, \"Native Mi'kmaq legend has it that the Five Islands were created when their god Glooscap threw the mud, sticks and stones at the giant beaver who dammed his medicene garden in Advocate. The mud, sticks and stones that formed the islands are said to have trapped the beaver and turned him into gold. Its said that he can still be found today.\" \nAfter a delicate fight through the eddies I was able to exit the little cove and paddle down the coast line to see the mix of basalt and sandstone cliff strata. Anyone driving by on highay two can't help but want a better look at those islands. So when I saw enough of coast line, (ie: took enough pictures) I turned and headed to the islands to get that closer look.\nMoose Island is the closest and I have read  that you can climb up the grassier side to camp in the fields. There is evidence of an old establishment and a well, but I'd still bring my own water given the remote situation.\nAfter Moose Island, I turned the bow of my kayak and continued away from shore, wanting to see more islands. What a reward that was. I saw sea caves and a large 40 foot rock arch that perhaps could be paddled through at high tide, though I'm not certain. The mix of basalt and sandstone made for a great contrast. The islands were like sirens beconing me away from shore. For me, that was appropo, because paddling in that direction made getting back to shore a potentially muddy walk with a heavy and dirty boat! The tide rises and falls 55 feet twice a day, so getting further away from shore could also have meant being taken by the growing currents. So after the third island, where the sea arch was, I rounded it and stroked double time in a rush for home. It turned out that where I landed, I only lost 30 feet of receeding coast; with gravel and sand to walk through. By the time I got the jeep loaded up, much of the little cove was now mud.\nSo a word to the unwise, the tides here are huge. The tide times are posted in the park, so heed them. It's best to time a paddle around high slack tide. Low tide means an ocean of muck, and any time in between means some dangerously strong currents ripping around those islands and sea stacks. I was experiencing the eddies tugging and pulling at my boat numerous times, and almost lost my balance on one ocasion. that was with a tide starting to turn. Just imagin the effects at full bore.",
    "directions": "From Truro, head on route 4 and turn to route 2 at Glenhome. Five islands provincial park is less than an hour's drive away. Heading from New Brunswick end, enter Nova Scotia and turn off the 104 at Springhill, also taking route 2. It's probably an hour and a half.",
    "geohash": "f846",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/4973/reg_IMG-0187-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/4973/reg_IMG-0188-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/4973/reg_IMG-0189-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/4973/reg_IMG-0192-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/4973/reg_IMG-0194-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/4973/reg_IMG-0196-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/4973/reg_IMG-0197-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/4973/reg_IMG-0198-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/4973/reg_IMG-0206-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/4973/reg_IMG-0208-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/4973/reg_IMG-0212a-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/4973/reg_IMG-0216-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/4973/reg_IMG-0217-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/4973/reg_moose-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/4973/narrow_IMG-0210-6702.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/five-islands-kayaking-near-parrsboro-ns-4973",
    "stats": {
        "Activities": "sea-kayak",
        "From": "",
        "Seasons": "summer",
        "Stars": 5,
        "Time": "3 hrs",
        "Total Distance": "11 km",
        "Town": "Parrsboro, NS",
        "Type": "out-and-back"
    },
    "title": "five islands kayaking",
    "trail_id": "4973"
}