{
    "description": "Short and steep, but very rewarding. The trail is divided into 2 parts.  You start off on a short paved path; here you will be accompanied by the tennis shoe hikers and their whining children. Oh well.  Past that it turns into a well-kept rocky trail.  There is a steady incline here and the scenery is pretty ho-hum, unless of course, you just can't get enough of trees.  There are a few occasional breaks and you get a great view of Sulpher Ridge to your right.  At 2.6 km the trail branches, straight on to Mystery Lake and right to the summit.  Go right and on up to the second leg of the journey.  NTS Map: 083f04Elevation Gain: 700 m (2,300 ft).Only 2 km to go but the trail gets a bit steeper here.  Still lots of trees, but when you get a break, you have a great view of the valley you just walked up, as ell as the parking lot in the distance.  Further up (will it never end? my burning legs ache!) you will come to an alpine meadow.  There is a peculiar white rock in the middle that was left ages ago by some glacier.  Follow the path through the meadow and on up to the summit.  This last bit is very steep and verging on difficult.  Upon reaching the rocky summit you are rewarded with a stunning view of the entire area.  To the east you can see Fiddle River Valley and Mount Drinnan in the distance.  West and south there is the Miette Range and Utopia Mountain. To the northwest you can see the Ashlar Ridge.Ahhh, weather.  Our favourite friend.  It was overcast on my trip. I got rain, hail, and sunshine on the way up.  The hail came on the way up to the summit. But the sun came out when I was on top.  You are totally exposed and the wind will howl up from the south side of the ridge you are standing on at the summit.  But step back a bit, sit down, and enjoy the view.  You will only feel the wind if you stand on the edge.  If you go on a sunny day, bring lots of water.  The sun will shine down on you all along the trail.Lastly, since you are at Miette Hot Springs, why not stop and soak in the heat of the natural mineral goodness.  Ahhh.  In winter, check avalanche conditions.",
    "directions": "From Edmonton, follow the Yellowhead to Jasper Park. Go into Jasper Park. Watch for the sign that says Miette Hot. (About 7 km)  Turn SOUTH (left) onto that road.  Follow it up to the springs.  Park in the place called 'Parking Lot'.  Get out of your vehicle and begin walking.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/498/long_DSCF1087-29357.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/498/reg_DSCF0279-52675.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/498/reg_DSCF1125-52675.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/498/reg_IMG-0696-46154.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/498/reg_IMG-0718-46154.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/498/reg_Image-1-46154_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/498/reg_Jasper-2012-033-42195.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/498/reg_Lookingbackonpath.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/498/reg_Meadowfromsummit.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/498/reg_MewithUtopia.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/498/reg_TheDestination.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/498/reg_image.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/498/topo_medowshot.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/498/narrow_Jasper-2012-041-42195.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/sulphur-skyline-near-jasper-ab-498",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "8 km",
        "Town": "Jasper, AB",
        "Type": "out-and-back"
    },
    "title": "Sulphur Skyline",
    "trail_id": "498"
}