{
    "description": "An unbelievably scenic trail that is almost all alpine meadows. Great in early August for flowers. It is  superb for both single track cross country mountain biking, and as a hiking and camping trail. The alpine meadows is set in a backdrop of glaciated peaks. THis is the most scenic bike ride I have ever taken.Note that its 11.3 one way, 22.6km return.The trail is out and back,  with no junctions. It climbs through light forest on a somewhat rough trail for ~1 km, then through meadows and occasional light forest patches for pretty well the rest of the way. The trail generally contours around the landscape, over a moderate ascending and descending trail. At its middle, it descends somewhat to Standard Basin, then climbs switchbacks to other side. For the last part, it descends somewhat to open forest and a cabin on the lake (available for overnight stays). From the cabin, turn around and come home the same way. For an end of the day treat, cycle down the logging road to Highway 23 - really fast long descent. Flip a coin with your partner!",
    "directions": "From Revelstoke, Turn right on Highway 23 N (set odometer). At ~49km there is a logging road on the right, but keep going for another kilometre. At ~50km there is another logging road, easy to miss, and it should be signed for Keystone Basin (signed? - I didn't see a sign) . Go up on this so so logging road (any car can do this slowly, an Explorer is better), following signs, for 16.2 km to end of road and a parking lot.  You will encounter 1 Y junction, stay to the right as you're going up.Trailhead is up the hill beside the sign and toilets.",
    "geohash": "c35u",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/4982/reg_DSC00064-16588.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/4982/reg_DSC00632-10441.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/4982/reg_IMG-3248-Small-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/4982/reg_IMG-3253-Small-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/4982/reg_IMG-3266-Small-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/4982/reg_IMG-3267-Small-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/4982/reg_IMG-3272-Small-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/4982/reg_IMG-3304-Small-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/4982/reg_P9050023-25536.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/4982/narrow_DSC00635-10441.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/4982/narrow_IMG-3285-Small-6828_best1_.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/keystone-standard-basin-near-revelstoke-bc-4982",
    "stats": {
        "Activities": "hike mtn-bike",
        "From": "",
        "Seasons": "summer",
        "Stars": 5,
        "Time": "6 hrs",
        "Total Distance": "23 km",
        "Town": "Revelstoke, BC",
        "Type": "out-and-back"
    },
    "title": "Keystone Standard Basin",
    "trail_id": "4982"
}