{
    "description": "Sunshine Meadows trail starts from Sunshine Village. Obtain a map or download the accompanying GPS from the right side of this page.The Sunshine Meadows are known by many as the most stunning alpine setting in the Canadian Rockies. Situated at an average elevation of 2220m (7,300'), the meadows straddle the Continental Divide and the boundary between Alberta and British Columbia. Surrounded by some of the Rockies' highest peaks, the unobstructed views are beyond compare. Wildlife abound in the meadows, and the brilliance of the summer flowers and autumn larches guarantees spectacular scenery on every visit.Spend your day on top of the world and away from the crowds at Sunshine Meadows. Mt. Assiniboine, \"the Matterhorn of the Canadian Rockies\" , and Banff National Park's highest peak, can be your backdrop! A network of gentle trails wind their way through the Meadows and offer a range of walking for all abilities; from easy one and two hour strolls, to challenging full day hikes to Quartz Ridge, Healy Pass, or beyond. You can choose to hike on your own.There scenery is fantastic with great wildflowers in season.",
    "directions": "Highway 1 west of Banff take road to Sunshine Parking lot. From there, the Gondola operates Friday -Monday ($42 adult) and the Alpine Shuttle ($35 adult) runs Tuesday - Thursday.   It's worth it to hike on the continental divide without the effort of getting up there. Banff to Sunshine Base Transportation also available ($12 return).",
    "geohash": "c3jd",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/4999/long_DSC-5518-29667.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/4999/reg_DSC00101-7279.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/4999/reg_DSC00114-7279.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/4999/reg_DSC00129-7279.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/4999/reg_DSC00149-7279.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/4999/reg_image-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/sunshine-meadows-near-banff-ab-4999",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 5,
        "Time": "6 hrs",
        "Total Distance": "13 km",
        "Town": "Banff, AB",
        "Type": "out-and-back"
    },
    "title": "Sunshine Meadows",
    "trail_id": "4999"
}