{
    "description": "Johnstone Strait is the place to go to see whales.  A large concentration of Orcas (Killer Whales) make their home there, and pods of transient whales also visit.  You may also see sea lions, Minke whales and dolphins, and black bear.  Johnstone Strait can be hazardous, and should be attempted by experienced paddlers only.  For inexperienced paddlers, tour operators offer a number of different styles of trips.Drive north about 350 km (5 hours) from Nanaimo on the island highway.  Visit the tiny funky settlement of Telegraph Cove, and take the ferry over to Alert Bay, where a new native longhouse has been erected to hold the treasures of the area. Camping is limited, and is usually found on small gravel or shell beaches, often the sites of ancient middens.  The Strait itself is often crowded in the summer, but if you paddle farther into the Broughton Archipelago you won't see many people.  Visit the abandoned village of Memqumlis on Village Island, the site of the last forbidden potlach (call Tom Sewid, the native caretaker, for a tour.  Tom is a great storyteller, and tells the history of the area vividly). Hazards:  frequent fog, frequently choppy, many large vessels in the strait (watch for boat wakes while on land as well.  Cruise ships speed up the Strait at night, and can swamp you and your camp with their large wakes on the small beaches!!)  They look huge from your small craft - it's an odd sensation hearing the loudspeaker calling people to the shuffleboard tournament on the Lido deck - two completely different ways to view an area!!There are also a number of areas that have strong currents, producing whirlpools, rip tides, overfalls etc.  Plan your paddling to take advantage of slack tide.A tip for being visible to ship radar, pile a garbage bag full of aluminum-foil wrap and place it on your fore or rear deck, giving it as high a profile as possible (height).  Your hatches will be full of gear/food anyway, and, the higher it is, the greater the chance it will show up on ship's radar.  A good trip to do with a guide unless you are a group of expert paddlers with self-rescue, marine radio, GPS, charts, tide/current table knowledge, expert skill level, etc. etc.Map of Johnstone Strait: NTS Map: 092L10",
    "directions": "See description and / or GPS",
    "geohash": null,
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/50/reg_IMG-5733-19616.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/50/reg_Johnst1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/50/reg_JohnstoneMap.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/50/reg_orca1-19616.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/50/topo_97_COVER[1]lge_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/50/narrow_Jonst5.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/johnstone-strait-near-port-hardy-bc-50",
    "stats": {
        "Activities": "sea-kayak",
        "From": "",
        "Seasons": "summer",
        "Stars": 5,
        "Time": "49 hrs",
        "Total Distance": "93 km",
        "Town": "Port Hardy, BC",
        "Type": "out-and-back"
    },
    "title": "Johnstone Strait",
    "trail_id": "50"
}