{
    "description": "NTS Map: 92J8\r\nThis phenomenal trail is a must do for anyone with a passion for alpine hiking. That being said, be aware that you are venturing into some fragile, unstable wilderness so keep your wits about you and place your feet carefully. I am almost reluctant to post this trip report, as I don't think the area could support a whole lot of traffic. Please note - the 14 km trail length is only to the hut. It does not include the side trip to Rohr Lake or any of the other poking about we did.\r\n\r\nMuch of the area consists of pristine alpine meadows surrounded by steep but seductive slopes, rambling ridges, and majestic peaks. Magical waterfalls cascade down to the valleys where crystal clear mountain streams wind lazily through alpine meadows. Colour abounds in the form of lupins, heather, arnica, valerian, and other delicate flowers. The trail is often boggy and only getting worse with each passing hiker. Just be careful :)\r\n\r\nThe trailhead is easily accessed by short gravel road. You'll need a 4x4 for the last kilometre, but you can park your car and walk in. The trail starts at an elevation of 1300 ft. After crossing the first creek, the trail ascends fairly quickly until the junction with the Rohr Lake trail. Take the \"Aspen\" fork to the left to continue on to the Marriott Basin. The trail soon levels out a bit but gets very muddy. \r\n\r\nYou and your muddy boots soon come to a beautiful valley complete with waterfalls, flowers, and a meandering stream. There is also a very healthy mosquito population so you won't be able to stop here long. Continue along the trail, over the rocks and you'll find a better place to stop and take in the view away from the worst of the mosquitoes. \r\n\r\nAfter travelling the length of the valley, you head back into the trees for the last steep stretch. It's a bit of a grunt but before you know it the trail leads you into another beautiful valley and a spectacular view of Nequattque and Marriott Mountains. It took longer than necessary to hike through the valley as I kept turning around and taking in the view. The trail turns and heads towards the lake now. \r\n\r\nThe lake is an emerald jewel nestled snugly at the base towering slopes. Follow the trail along its length to a picture perfect campsite, or continue up through the trees to the Wendy Thompson Hut. We set up camp at the lake and headed up to explore the surrounding area without the weight of our packs. \r\n\r\nThe trail to the hut is not obvious from here. Proceed along the end of the lake and then into the trees, following the creek most of the way up. The hut (it's really much too nice to call it a hut) is closer to the second lake than the first. The hut was built by the Alpine Club and looks very comfortable. \r\n\r\nWe scrambled up some big rocks to the next lake. It was pretty steep and there is no trail but it was worth every drop of sweat. There was no turning back now though :) I had to climb higher. There are any number of ridges and peaks you can explore in this area. There were some climbers just coming down from the highest peak as we headed up the ridge on the near side of the lake. Again, there are no trails and the scrambling is steep so do be careful. At the top of the ridge we found another little lake nestled in the snow. After the climb, this looked appealing so two of us went for a little swim. Brrr! The views from the ridge were unforgettable. We had to head back though as the sun was setting. We hiked along the ridge and then descended down to the hut. The decent was tricky as the snow was pretty soft and we all fell through at least once. The bottom part of the slope required scrambling over more big rocks.\r\n\r\nThe next morning, we got an early start as we were planning to drop our packs at the junction and do the Rohr Lake trail. We should have spent more time looking at the map but we headed merrily up the trail without much of a plan. The trail ascended steadily but not terribly steeply, and then broke through the trees into a beautiful meadow. We were surprised to see that the lake wasn't there. The trail then headed straight up the mountainside, mostly IN an extremely muddy streambed. When we weren't trudging through the streambed, we were scrambling up rocks. Either way, the going was treacherous. Not for the faint of heart. It was also making a terrible mess of the \"trail.\" We finally made it to the lake though and were rewarded for our efforts by yet another beautiful alpine lake. There are places to camp here too but not a lot of flat ground.\r\n\r\nThere was a trail going along the lake so we followed it in hopes of finding a better way down. Before the end of the lake, we headed up the slope to the top of the ridge and found ourselves in a marmot subdivision. What cute furry critters they are! We hiked over the top of the hill and began our decent down the steep rockslide we had seen from the other side of the meadow just before the steep trail began. It was steep and the rocks were big but it was much easier than the alternative. At the bottom, we stayed on the rocks as best we could to avoid stepping on the soft ground of the meadow, and then headed back down the marked trail.\r\n\r\nAfter picking up our packs at the junction, it was only another half hour or so back to the trailhead. What a great trip! I'm only sorry that we didn't have more time. You could do this as a day trip, but why would you? There is just too much to see and do to turn back when you get to the first lake.\r\n\r",
    "directions": "Take highway 99 to Pemberton. Set your odometer to '0' at the Petro Canada station and head east through Mt. Currie and on to the Duffy Lake Road. Drive past Joffre Lakes to 33 km. The turn off is on your left. The gravel road is 2 km long to the trailhead. You will probably need a 4x4 or something with good ground clearance if you want to drive all the way. Otherwise, park your car in the pull out on the left at about 1 km.\r",
    "geohash": "c2by",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/500/reg_IMGP0893.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/500/reg_IMGP0895.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/500/reg_IMGP0901.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/500/reg_IMGP0906.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/500/narrow_IMGP0890.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/500/narrow_IMGP0926.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/500/narrow_IMGP0944.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/500/narrow_wthuttopomap.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/marriott-basin-rohr-lake-near-pemberton-bc-500",
    "stats": {
        "Activities": "climb hike ski-bc",
        "From": "",
        "Seasons": "winter summer",
        "Stars": 5,
        "Time": "7 hrs",
        "Total Distance": "14 km",
        "Town": "Pemberton, BC",
        "Type": "out-and-back"
    },
    "title": "Marriott Basin - Rohr Lake",
    "trail_id": "500"
}