{
    "description": "NTS Map: 92G11. St. Mark's is a great interim destination for those on their way to the Lions from the Cypress Bowl Ski area. It makes for a nice destination for those who want a view of the Lions, as well as some great views back towards Howe Sound.  The Howe Sound Crest Trail is very well maintained, and apart from finding the start of it, it is almost self-guiding. Our GPS waypoints should get you set right, but also refer to our directions.The terrain is gradually up, with some steep and rolling sections, and follows a crest adjacent to Howe Sound, and deep valleys on the other side.  The GPS points attached get to you St. Mark's Summit, which would still leave you well short of the Lions, i.e. Mt. Unnecessary still to go. There is GPS data attached to this trail (see \"download GPS\"), which if loaded into your GPS can help you find route points.",
    "directions": "To get to the Howe Sound Crest Trail, take Hwy 99 in West Vancouver to the Cypress Bowl Exit, and drive all the way up to the Downhill Ski area, parking just in front of the ski purchase pass area (obviously closed for the summer).  You'll see in the GPS ramblings two ways to the start of the trail.  Either loop along the Yew Lake interpretive trail until you see signs for Howe Sound Crest Trail (black posts with signs), or for the easier way, do the following; walk in between the shacks where downhill ski passes are sold, and walk towards the 'Sunshine' Chair lift, and keep walking along this gravel road as it climbs along the side of the mountain, staying above the Yew Lake area.  Basically follow a straight line behind the ski lifts. If you have a GPS, use the waypoints attached, to hone in on the trailhead! Have fun.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/502/reg_DSC-0003-25237.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/502/reg_DSC-0006-25237.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/502/reg_DSC-0014-25237.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/502/reg_SM1-43941_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/502/reg_SM3-43941.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/502/reg_SM7-43941.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/502/reg_image-50663.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/502/reg_marks1-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/502/topo_map.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/502/narrow_P1030552-25237.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/502/narrow_SM6-43941.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/howe-sound-crest-older-2002-near-vancouver-bc-502",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 4,
        "Time": "4 hrs",
        "Total Distance": "8 km",
        "Town": "Vancouver, BC",
        "Type": "out-and-back"
    },
    "title": "Howe Sound Crest (Older 2002)",
    "trail_id": "502"
}