{
    "description": "Time and Distance are for a return trip. Elevation gain is about 1,000'.\r\rCracker Lake is considered to be one of the prettiest lakes in Glacier National Park. It sits at the bottom of Mount Siyeh, one of Glacier's 10,000 foot peaks. The north face of Mount Siyeh, at the head of Cracker Lake, boasts the highest vertical face in the continental U.S.\r\rThe trail begins at the large parking area above the Many Glacier Hotel and winds around the base of Allen Mountain, close to the shore of Sherburne Lake. The trail then swings around and follows Canyon Creek , first on the west side, then about 4 miles in, crosses to the east side for the remainder of the trip.\r\rThe trail is mostly in the trees, good for hot days, but this part is also very dusty because the horses have pulverized the soil into dust in the early part. This is also a horse trail, so the first mile or so can be quite 'fragrant'. \r\rAfter about 4.5 miles you will rise above the forest where your views will improve. Soon you will come over a rise and Cracker Lake will show itself in all its turquoise glory. The colour is due to glacial silt draining into the lake from the Siyeh Glacier. This is a good place for lunch or you can continue exploring. There is a trail around the lake (about 1 mile) but crossing the creek can be tricky early in the season. Watch for mountain goats and the odd moose.\r\rThere is also a popular campground  along the east shore past the 'big rock'. Book ahead to avoid conflicts.\r\r\r\r",
    "directions": "The trailhead is at the south end of the parking area above the Many Glacier Hotel in the Many Glacier area of Glacier National Park",
    "geohash": "c2xj",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/MT/5020/reg_Cracker-10--7064.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/5020/reg_Cracker-12--7064.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/5020/reg_Cracker-16--7064.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/5020/reg_Cracker-17--7064.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/5020/reg_Cracker-18--7064.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/5020/reg_Cracker-3--7064.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/5020/reg_Cracker-7064.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/5020/reg_Cracker-8--7064.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/5020/narrow_Cracker-2--7064.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/5020/narrow_Cracker-7--7064.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/cracker-lake-near-babb-mt-5020",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 4,
        "Time": "6 hrs",
        "Total Distance": "18 km",
        "Town": "Babb, MT",
        "Type": "out-and-back"
    },
    "title": "Cracker Lake",
    "trail_id": "5020"
}