{
    "description": "This trail is hard to rate because the drive up to a trail head is a very rough 10-12 km drive up 1000 m el gain. It is also impossible to drive right to the trail head because of obstacles, mainly downed trees and water-bars.\nA solid 4WD with as much high clearance as possible is mandatory from Brohm River FSR, just 1.3 km in from Hwy 99. See details below from Andrew Wong, our driver, in the \"Directions to Trail Head\". At the Cat Lake sign 1.3 km in from the highway, GO LEFT.\nWe drove to within 1.5 km of the trail head , the 2nd switchback on the Brohm  Ridge Branch (11.5 km from the Hwy), but if he had to do it again, Andrew would park at the 1st switchback, approx 1 km earlier. I would too, as this last km we drove was extremely rough and narrow, with sharp water-bars.\nThe walk up the rest of the road (basically west to east) afforded good views of the canyon to our south and even the snowmobilers' hut directly east on the ridge.\nWe eventually came to the end of the road, and found the trail going up to our left (north). The trail is not heavily travelled, so quite faint at times, but with a few markers and whatever trail was there, we made our way north east and eventually to the top of the ridge. At this point, we had an incredible view of Mt Garibaldi from the west side, Diamond Head on Alice Ridge to the south of Mt Garibaldi and the Tantalus Range and glacier behind us to the west.\nUse the attached GPS data to get you from the Hwy right up to the lookout. Probably accessible in the snow if you have a snowmobile for the 10-12 km drive up to the trail-head.\nI placed a geocache at this location.\nA very rewarding hike despite a rough ride up and back down.",
    "directions": "- Hwy 99 to Cheekye FSR is 13.3km from Cleveland & Hwy 99 junction in Squamish.\n- Cheekye FSR to Brohm River FSR is 1.3km from Cheekye & Hwy 99 junction.\n- Brohm Ridge Branch is 6.4km from Brohm River FSR & Cheekye FSR junction.\nBelow is the bulletin I posted on Bivouac about the Brohm Ridge Branch which is the preferred approach for travellers heading to Brohm Ridge (the historic approach is via the snow-mobilers' hut). I've included Bivouac's way-points for the road.\nGrid References are NAD27, Lat-Longs are WGS84. \n-Google 923-201   49°50' 09.9\"-123°06' 23.5\"=Km 0, Start of road on Brohm River Road 1005m (3297')\n-Google 935-205   49°50' 21.3\"-123°05' 23.3\"=First switchback, ignore spur on right 1195m (3921')\n-Google 927-207   49°50' 27.2\"-123°06' 02.1\"=Km 2.5 Second switchback 1320m (4331')\n-Google 936-211   49°50' 40.6\"-123°05' 19.7\"=Km 3.7 End of road 1460m (4790')\n \nBulletins Insert\n2008.07.19 Andrew Wong: Rough branch, easy approach to Brohm Ridge: The water-bars past the first switchback aren't deep but they're cut sharply (not worn down yet). Combined with a steep climb, lots of loose rock, and a narrow road, it was hard to angle in on the ascent. Ended up banging the frame (4dr Tracker) a few times. Much easier coming down but next time I'll just park at the first switchback and walk longer to save damage. Parked at the 2nd switchback when my nerves finally gave out. Deeper water-bars and large blow-downs across the road start after the 2nd switchback when the road levels out and turns north. Alder pin-striping factory at the start of the branch.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/5029/reg_BrohmRidge6063-7359.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/brohm-ridge-near-squamish-bc-5029",
    "stats": {
        "Activities": "hike ski-bc",
        "From": "",
        "Seasons": "summer",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "10 km",
        "Town": "Squamish, BC",
        "Type": "out-and-back"
    },
    "title": "Brohm Ridge",
    "trail_id": "5029"
}