{
    "description": "NTS Map: 92J2\nIf you want a perfect introduction to alpine hiking in the Whistler Village area, try Singing Pass in Garibaldi Provincial Park. \nFor much of the year this high mountain pass is under a deep snow cover. In June, warm temperatures accelerate the melt in earnest, turning Fitzsimmons Creek into a raging torrent. By July only a few remnant patches remain giving nourishment to a profuse spring bloom of alpine flora. Colourful purple lupines, orange avalanche lilies, and red Indian paintbrush carpet the rolling alpine topography.\nYour position is wild, for the high 1700 metre pass bridges two local prominent mountain ranges. Both the Fitzsimmons and Spearhead Ranges boast numerous picturesque alp-like peaks with snowfields and tumbling glaciers. Names like Tremor, Shudder and Quiver conjure rugged images. The views are excellent. Overlord Mountain, the highest in the area at 2621 metres stands sentinel over the summit of the pass mirroring its reflection in nearby cerulean, Russet Lake.\nSinging Pass was poetically named in the 1950's for the sound of the alp wind caressing the slopes. If you lay back in the meadow and close your eyes it's possible to hear the breeze funnelling down from the Musical Bumps: Piccolo, Flute Oboe summits of the Fitzsimmons Range.\nSinging Pass is undoubtedly the best and most rewarding, accessible hike close to Whistler Village. It is moderate in difficulty for intermediate hikers.  As with all hikes in high alpine areas weather can be changeable. Be prepared, bring adequate clothing, food and navigation aids.\nApproachTravel Highway 99 to Whistler Village. Trail starts near the Whistler Village Bus Loop; follow the signs. Parking is available in Whistler Village day lots. Designated parking is permitted in Lot 4 for those on overnight trips.\nWhistler Village to Singing Pass Total Length, 22 km; Time 3 to 4 hours one way (down), 7 hours up; Elevation Gain, 1000 metres. Beginning at the bus loop drop off area (just oppoiste the free parking lots - and not far from the summer bike chairlfits and Gondola), follow the Whistler Mountain access road for approximately 500 metres. Turn left on the old Singing Pass Road (by foot only - contrary to what some outdated books suggest), which continues along Fitzsimmons Creek to the Garibaldi Provincial Park boundary 6 kilometres from the Village. The trail then branches and follows Melody Creek to Singing Pass as the attached map shows. It's an easy trail to follow, not rooty and steep like most Northwest hikes, just a classic single-track trail with lush forest giving way to shrub and alpine meadows.  For those who wish, take the Gondola up (instead of down) and follow to Piccolo, Flute and Obo, then curve around and descend aling Melody Creek and finally, Fitzsimmons.  An easy trail to follow.\nResources:\nFederal Topographical map   92 - J/2 1:50,000\nBC Parks Squamish      1-604-898-3678",
    "directions": "See description and / or GPS",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/503/Singing_Pass_Hike_Maurer.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/503/reg_SING.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/503/reg_Whis.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/503/reg_best1_cheaklake.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/503/reg_blbrwh.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/503/reg_meadowMelody.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/503/reg_spsignage.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/503/topo_spassmeadow.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/singing-pass-summer-route-garibaldi-provincial-park-near-whistler-bc-503",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 4,
        "Time": "7 hrs",
        "Total Distance": "21 km",
        "Town": "Whistler, BC",
        "Type": "out-and-back"
    },
    "title": "Singing Pass - Summer Route (Garibaldi Provincial Park)",
    "trail_id": "503"
}