{
    "description": "This being my first trip to Yosemite, Half Dome was a must.  Everything I read said that this trail was very difficult, and that 10-12 hours should be taken to hike it.  Another option is obtain a backcountry permit ($5 I think) and camp out over night. You will need to get started at about 5am if you want to get it done in one day.  Bring plenty of water or a good purifier.  For about the first 3 miles you gain some pretty good elevation, for me it was the hardest part of the trail.  Be prepared for lots of steps and switchbacks.  Take your camera; you will be passing a few very beautiful waterfalls with some nice photo ops.  The trailhead is called the mist trail, so if you have no interest in getting wet in the wee hours of the morning bring a shirt change! After you get passed Nevada Falls, I think that?s the tallest on this trail, you will come to a relatively flat tail next to a river (stay out of the water, you can be dragged over the falls).  This a very sandy path, if you can walk on the edge you wont feel like you are walking on the beach, and will not use up as much energy. Into the woods you go for a few more miles, enjoy the beauty, and don?t run like I did.  When you come out about the tree line you will start to see the amazing views and get a site of half domes summit.  The switchbacks at the base are pretty steep, so take your time.  The stone has been cut into very primitive but functional steps.  The cables of half dome can be very sketchy, if you value your existence you will wear a good rubbery shoe that has a decent amount of grip (even with climbing shoes on, the granite was pretty slick). As far a safety goes, I wore my climbing harness with a sling going through it, on the other end of the sling I had a beaner that I clipped onto the cables with.  More then once I was told I had to have been the smartest person on the dome.  I was also nice because I could stop turn around and really look at what I had just climbed.  When you get to the top take it all in and enjoy.  Go to the edge and glance down, if I were into base jumping this would be the spot.  A few people that had hiked the dome before suggested when going down to hop on the John Muir trail to safe your knees from the pain of hiking down the mist trail.  There are also less people on the Muir trail, the only drawback is that it adds another 2 miles to the trip.  As I said in the beginning, everything I read said the 17 mile hike with its 4000+ elevation gain takes about 10-12 hours, can anyone out there beat MY time (5:50)?\nPictures are courtesy of the National Park Service.",
    "directions": "Go into Yosemite Valley and follow the road until it ends and look for signs for the Mist Trail.",
    "geohash": "9q",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/CA/5030/long_halfdome-close-sunset-13176.jpg",
        "https://trailpeak.com/storage//content/trails/US/CA/5030/long_snowyhalfdome-13176.jpg",
        "https://trailpeak.com/storage//content/trails/US/CA/5030/reg_YOSE-highlight-currentcndx2-13176.jpg",
        "https://trailpeak.com/storage//content/trails/US/CA/5030/P7200227-13438.JPG",
        "https://trailpeak.com/storage//content/trails/US/CA/5030/narrow_DSCN1547-25776.jpg",
        "https://trailpeak.com/storage//content/trails/US/CA/5030/narrow_best2_halfdomecables-close-13176.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/half-dome-near-yosemite-national-park-ca-5030",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 5,
        "Time": "10 hrs",
        "Total Distance": "27 km",
        "Town": "Yosemite National Park, CA",
        "Type": "out-and-back"
    },
    "title": "Half Dome",
    "trail_id": "5030"
}