{
    "description": "This trail is an easy hike from the Day use area of Lightning Lakes in Manning Park to the last lake in the chain called Thunder Lake.  You can do this hike in several hours, or do what we did, canoe it with a few portages, camp at the wilderness campground making the hike to the final lake the next morning.  The wilderness campground is about 600m past the end of Strike Lake and has several large fire pits, open and covered areas to pitch your tent.  There is  a outhouse and bear cache to stow your food stuff as well.  A fast moving stream along the camp provides drinking water, I am sure it is ok to drink but we filtered it anyhow.  The hike to the last lake, Thunder Lake is a scenic easy hike that took us about an hour with our 11 year old daughters.  We went as far as reasonably sane to go, I am sure you can go right down to the end of the lake, but the terrain gets a bit nasty.  If you are doing this with kids, allow 4 hours to make the canoe/portage/hike to the wilderness camp.  There are two portages, one about 600m and one about 1500m, just something to keep in mind.  Start, portage and campground are all located on the GPS track.",
    "directions": "Start at the Lightning Lakes day use area.  Middle of Manning Park, 60km East on Hiway #3 from the Coquihalla turnoff.",
    "geohash": "c2d",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/5045/reg_LL-3--13141.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5045/reg_LL-5--13141.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5045/narrow_LL-1--13141.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5045/narrow_LL-2--13141.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/lighting-lakes-manning-park-near-hope-bc-5045",
    "stats": {
        "Activities": "mtn-bike ski-xc ski-bc ski-downhill hike river-canoe snowshoe",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 4,
        "Time": "4 hrs",
        "Total Distance": "11 km",
        "Town": "Hope, BC",
        "Type": "out-and-back"
    },
    "title": "Lighting Lakes, Manning Park",
    "trail_id": "5045"
}