{
    "description": "Finally, the opportunity had come to hike the Fundy Foot Path along New Brunswick's Bay of Fundy coast. It's taken about seven years to get this done mainly because of the the fuss of travel, suitable companions, schedules and shuttling.\nI was slated to hike with a friend I had met through trailpeak who owns some prime land in Cape Breton highlands, but when an injury nixed the opportunity, I couldn't help but turn the loss around. A recently made friend from Moncton with an open schedule like my own came through. He had hiked the Footpath several times, so basically said, \"name the time, and we'll go!\". He welcomed the chance to hike the footpath yet again, so with some additional friends, we made a five-some. Three ultralight minded adventures, and us two expedition-packed hikers took to the trail starting in St. Martins and headed east to Fundy National Park.\nThe Fundy Footpath is a 42Km linear trail that runs the coastline of the Bay of Fundy. The trail is marked, AT style with white blazes for the maine route, yellow, blue or green for spurs, and double blazed for sharp turns. The bay is famous for having some of the world's highest tides, peaking at 55 feet twice a day. Combine that with dramatic terrain created by tectonic fault lines and waterways that have erroded out gorges, give the appearance from Google Earth of a wrent landscape. Steep cliffs give way to boxed beaches, full of cobble and boulders, capable of trapping an unexperienced wanderer, unaware of the tides.\nThese will be three sequential trail posts, each linking to the next, breaking the route down, and allowing more pictures to be seen, geosynced to the GPS track. enjoy!\nTo see day 2: Click here.\nTo see day 3: Click here.\nDay 1. St. Martins to Cradle Brook\nWe drove from Moncton to St Martins, which took us around two hours. We drove in the rain. Was this forshadowing? The weather forcast said that showers and thundershowers were in our future, would clear up during our two middle days, and come down heavy on our day out. Yey...\nMike's wife would shuttle the van back and pick up the five of us a few days later in Fundy national Park. Her email addy was added to the Find-Me-SPOT messenger so that she could gage our progress along the way as I checked in. There's a fee to enter the Fundy Park way. I suppose this could be avoided by means of entering one of the spur trail access points, but I am not very aware of road access to these spurs, let alone a mini van's ability to travel them.\nBy around 11:30, we had registered and put packs to our backs to begin our journey. A construction worker had to lead us out of the facility due to bridge work. They were building a new road system through the parkway, and rumour had it, it was endangering the solitude of the Foot Path trail. We last heard that a re-route was going to negate the issue all together. Score one for the protectors of the Footpath!\nWe bid our hard-hatted guide a thank-you, crossed the narrow cable foot bridge and headed out along the shores of the Big Salmon River. Minutes later, we got our first taste of what the Footpath is all about. We climbed a set of cable steps, and were off into the woods. there's no training curve when you get onto the path. Unlike meeting a new acquaintance, it's in its full personality from the get go. Lots of roots and rocks to trip you, and very few occasions to hike level ground. But just after 2K, we made a short cut. A bashed in set of stairs not worth walking on put us back onto shore. We hiked through Long Beach, past Tuft's point, and onto Seely Beach. We actually had the ambition of beach-walking it right to Cradle Brook, though I thought this was beyond cheating! As it is, Cradle Brook is a boxed beach, meaning no matter the tide, there's no approach in or out except by the trail. Suffice to say, we were forced to turn back at around a Km from Cradle Brook due to the terrain getting too difficult. At one point, to continue we'd have to climb a cliff and then bushwack to who knows where to either get back on the trail, or to simply get past the obstacle. We all agreed to make our way back to the trail entry point back at Seely beach. In all, we hiked 3.5K extra, and took us two hours. It did, however, change our intended destination from Little Salmon river, to Cradle Brook for our first night. The barnacle and rock weed covered rocks, managed to scratch up several in the party. First blood!\nBy 7Pm, we were setting up camp on the cobble beach where the sounds of the waves from the bay and from Cradle brook would guarantee great sleeping!\nWe were all fairly tired, but satisfied with the progress made that day. We never got any weather, but the sun was strong dueing the beach trek. The food was great, but my new Primus OMNI fuel stove suffered a clog in the stove unit. Persistance with the tool kit eventually got it going again, and I never had problems with it again that trip.\nTotal Distance that day including the extra beach hiking:14.4Km from 11:30 to 7PM.\nHere's a slide show of the captioned images:",
    "directions": "Off of Route 1 in NB heading toward Sussex, take the exit to route 111 to St. Martins. There's a fee for access to the interpretive center.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NB/5064/reg_IMG-0054-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/5064/reg_IMG-0061-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/5064/reg_IMG-0066-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/5064/reg_IMG-0069-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/5064/reg_IMG-0070-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/5064/reg_IMG-0072-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/5064/reg_IMG-0077-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/5064/reg_IMG-0078-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/5064/reg_IMG-0081-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/5064/reg_IMG-0082-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/5064/reg_IMG-0085-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/5064/reg_IMG-0087-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/5064/reg_IMG-0094-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/5064/narrow_IMG-0051-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/5064/narrow_IMG-0055-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/5064/narrow_IMG-0058-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/5064/narrow_IMG-0068-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/5064/narrow_IMG-0080-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/5064/narrow_IMG-0083-6702.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/fundy-foot-path-day1-st-martins-cradle-brk-near-st-martins-nb-5064",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "8 hrs",
        "Total Distance": "13 km",
        "Town": "St. Martins, NB",
        "Type": "out-and-back"
    },
    "title": "Fundy Foot Path. Day1: St. Martins-Cradle Brk.",
    "trail_id": "5064"
}