{
    "description": "Day 2. Cradle Brook to Goose Creek on the Fundy Foot Path. A linear hike along the Bay of Fundy coast on the New Brunswick side.\nToday, our objective was to \"up the anti\" in terms of cutting the trip from 4 days down to three. With timing of the tides always being a concern, we decided to push to get to Goose Creek for our next night's stay. There would be the site of our first major water crossing reserved for the next day, and timing it would be essential. Besides, it's pointless to hike only a few hours a day only to be hedged in by high tide.\nWe ate a great breakfast and set out for 9AM. We had shortcuts in mind, but not as desperate as yesterday's attempt. We set off following the white flashes upstream, passing the junction for the forested camp sites, and soon turned right, climbing steeply. Up we climbed, and on we went along the plateau until our descent to Little Salmon River. Had we the time and energy, we would have diverged upriver to find the \"Eye of the Needle;\" a hole in the rock formation near Walton Glen waterfall. But we didn't have the three and a half hours to spare from our objective, so we decided to press on. It was around this time, that we decided we could knock off a day from our adventure. This wasn't the first time we've done this sort of change...\nIn all, today would have us trudge through six or seven gullies, typically going from near sea level, to upwards of 600-700 feet. After Little Salmon, cable steps would be replaced with steep switchbacks. After Cradle Brook, we dipped through Little Salmon, Rapidy Brook, and Wolf brook. We descended to Telegraph Brook to walk the beach past Martin Head, only to rejoin the path just past Quiddy River with a steep bushwack climb. Our final gully appeared at Brandy Brook before our final decent into Goose Creek. \nATVs have a dominant presence at Martin Head and Goose Creek, mainly along the flat stretches of gravel beach.\nThe forest sections really are stunning. Red pines, tamarac stands and mixed forests keep the views interesting. The coastline has sandstone mixed among more durable rock such as basalt. We saw snakes and squirls, and scat from larger, more fierce creatures, that we were glad not to run into. Drinking water was never really a problem, as streams and creeks were plentyful. One could carry a Litre container, and never get very close to running out. We recommend treating any suspect water sources.\nGoose Creek was our camp for the night. Hey, there's even a pit privy! It began to sprinkle just as we were unpacking our gear, but it never amounted to anything. In fact, the whole trip was precip-free.\nTo see day 1: Click here.\nTo see day 3: Click here.\nHere is a slideshow of the images from the trip.",
    "directions": "Accessing St. Martins from Route 1 toward Sussex, and turn off to route 111 to St Martins. Or alternatively, head to fundy National Park and hike in along the Goose River Trail.",
    "geohash": "f81",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NB/5066/reg_IMG-0100-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/5066/reg_IMG-0102-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/5066/reg_IMG-0106-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/5066/reg_IMG-0112-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/5066/reg_IMG-0116-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/5066/reg_IMG-0121-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/5066/reg_IMG-0123-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/5066/reg_IMG-0125-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/5066/reg_IMG-0126-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/5066/reg_IMG-0127-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/5066/reg_IMG-0128-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/5066/reg_IMG-0130-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/5066/reg_IMG-0131-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/5066/reg_IMG-0133-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/5066/narrow_IMG-0104-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/5066/narrow_IMG-0110-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/5066/narrow_IMG-0111-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/5066/narrow_IMG-0113-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/5066/narrow_IMG-0117-6702.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/fundy-foot-path-day-2-cradle-brk-goose-crk-near-st-martins-nb-5066",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "7 hrs",
        "Total Distance": "18 km",
        "Town": "St. Martins, NB",
        "Type": "out-and-back"
    },
    "title": "Fundy foot Path. Day 2: Cradle Brk-Goose Crk",
    "trail_id": "5066"
}