{
    "description": "Fundy Footpath, Day 3. Goose Creek - Fundy NP\nTo see day 1: Click here.\nTo see day 2: Click here.\nThe Fundy Foot Path is a linear trek along the Bay of Fundy's coast on the New Brunswick side. It typically takes three to four days to cover the 50Km stretch.\nThis was our final day. Much of the tidal crossings would be reserved for today, and due to the low tide time, we awoke at 5AM for a 6AM crossing of Goose Creek, situated just beyond our camp site. The tide wouldn't be reaching our area of crossing for another 40 minutes or so, but we made our way, eating some form of breakfast later on in the morning. The water just from the estuary flow was typically half a foot deep, so given tall enough waterproof boots, you could cross it without taking your boots off. Because of the early start, it felt like we were ina different time zone for the rst of the day, everything felt offset by two or three hours.\nOn our way we took no more beach short cuts. The trail led us throgh Goose Creek, Fish Brook, Rose Brook, goose River and finally Rossiter Brook, basically five gullies to climb through. I think it's one of the prettier setions of the FFP because you'll find a regal tamarac stand, and an inland rock cravase, nice views of the beaches Martin Head, and even Isle haute, off in the distance.\nReaching Goose River, things once again were open to interpretation. We hiked across Goose River, and crossed Rossiter Brook. We followed the markings along the cliff face leading us toward the beach. By now, it was high tide, and the water laped at the base of the rock walls. What we chose to do was to climb the cliff and bushwhack toward the beach, just outside the boundary of the national park. It was the terminus of the Goose River trail, basically a cart path where mountain biking is permitted, and our route to getting picked up. Using my SPOT messenger, I signaled an OK, hoping that Mike's wife would get the message that we were getting close. On we went along Goose River trail with feet made weary from the past two days.\nThe actual Footpath trail ends at Goose River, at Km 42 (Km 0 going the other way), at the boundary of Fundy national Park. Beyond that, you have a choice of either hiking into the park along the 8 Km rugged cart path, into the park, or deviate to the White Car trail, a spur that takes you to a logging access road, accessable by any regular car.\nThe path runs in straight lines going up-up-up, and then-down-down-down as it reaches the odd bridged creek. Where upon it takes an odd angle and heads off again. Visually a flat-liner experience, but there was a highlight of seeing a bird's nest right in the middle of the road, outlined with white stones. A teen-mom?\nWe reached the trailhead by around a quarter after three, and having traveled a bit more than 17Km. Weary, but very happy to have completed the Fundy footpath from beginning to end.\nThe truth is, the views on the trail aren't that great. The forests are nice, but the views are hedged in. There's the occasional view of Martin head, boxed beaches and the cliffs during the beach walk, but otherwise it's forest central. Views, not withstanding, the Footpath is an essential hike for a maritime list of must dos, mainly in part to its difficulty.\nHere's a slideshow of the captioned shots from the trip:\nFundy foot path '08",
    "directions": "Accessable via the white car trail, or by means of the Goose River trail within fundy National Park, near Alma, New Brunswick when traveling East to West.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NB/5068/reg_IMG-0135-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/5068/reg_IMG-0137-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/5068/reg_IMG-0138-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/5068/reg_IMG-0139-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/5068/reg_IMG-0140-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/5068/reg_IMG-0143-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/5068/reg_IMG-0144-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/5068/reg_IMG-0147-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/5068/reg_IMG-0151-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/5068/reg_elevation-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/5068/narrow_IMG-0148-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/5068/narrow_IMG-0150-6702.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/fundy-foot-path-day-3-goose-crk-fundy-np-near-alma-nb-5068",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "8 hrs",
        "Total Distance": "17 km",
        "Town": "Alma, NB",
        "Type": "out-and-back"
    },
    "title": "Fundy foot Path. Day 3: Goose Crk-Fundy NP",
    "trail_id": "5068"
}