{
    "description": "North Maine Woods, Deboullie Mountain trail\nA few times a year, I get to visit New Brunswick, in a region that is close to the Northern Maine border. Recently I've been taking the opportunity each time to skip over into the Aroostook county, home of North Maine Woods.\nNorth Maine Woods is a huge 22,000 acre land preserve, co-managed by forestry, and recreational enterprises. There's a modest access fee, and offers opporunities for hiking, camping and paddle sports. This time around, I wanted to explore Deboullie Mountain because from what I read, getting there would be half the adventure.\nUpon reaching Portage, I turned off to a dirt road, and followed the directions. Named roads and mile markers made following written directions easier. The road, for the most part, was in really good shape, but occasionally, I was happy to be in a jeep where things got a little soft, or bouldery. The enterence fees are to help maintain these roads, but they caution that using said roads in the spring does cause major damage that land owners pay to re-grate.\nFinally, the ultimate in the \"getting there\" part of the adventure was the wide but shallow water crossing between Pushiner Pond and Fish Pond. Although I don't think the water level was much beyond 6 inches, it was  pretty exciting to manouver through. (keep left) I had recited this part of the trip to an acquaintance back home, and was given a reply stating that \"official water crossings\" would never be allowed back in NB.\nAfter parking the rig, I found a trail head marked by boulders, and got going. This trail turned out to be a nice little hike to Black Pond, easy enough for a novice to trail run, and a great spot for a back country camp and flat water paddle at the pond.\nI ran into a couple of guys on their return, who were looking for the same trail I was. I would catch up to them again later at the fire tower.\nUpon almost reaching the trailhead, I noticed a posted sign to Deboullie Mountain with blue blazes marking the way, and promptly took the correct route.\nFor two thirds of the way, the trail was pretty flat. From the map, it was suppose to be a lake. I didn't see anything for the first short while, but the path came around to its boulder strewn shore. From there, the trail hugged the perimeter. One noteworthy section was the traverse of a bounderfield from a rockslide. Eventually the trail came to a very soggy camp site. From there, stone stairs changed the entire nature of the trail from flat to UP.\nNow here is where the real adventure started. There was some mighty fine examples of trail structure, with shingled stones directing run-off away from the path. I even ran into a group of trail workers doing some switch back work.\nThe trail climbed steeply through the softwood forest, and eventually topped out at an inactive fire tower. Climbing it offers stunning views of the lakes and hills in the surrounding region, while a hut at the base, might allow for some shelter.\nAlthough I didn't hike further, back at the base, the trail does continue to loop around Deboullie Pond, as well as a spur to Denny Pond. Given the distance I traveled, it probably would have been worth the loop hike just to spend more time on the trail. I hiked back with the two guys and chatted along the way. We met up with the college-student trail crew on our way down, and got a picture.\nIn all, with cheap camping fees, and the water and land activities offered in the region, this is definately worth revisiting, but I would suggest trying to get away from the louder base camps. I'd go with a canoe and tent just to mix things up a bit. The longer the stay, the greater the value in terms of my own travel distance.\nThey don't allow bikes, so don't even bother carrying them. They'll make you leave them at the entry point. I hate how they equate mtn bikes with ATVs but the rationalle is that they aren't a mode of transport fast enough to flee from a forest fire. Mind you, how does that justify hiking? It's even slower.\nShannon Burt\neast coast editor\nNote: Some of the geosynces images do not sync with the trail! Not sure why.",
    "directions": "-From Portage's main road, turn onto West road and go for a mile. \n-From there, take a left  onto Fish Lake Road and continue to the gated check point.  \n-Continue along after registering, and after mile 6, turn right onto Hewes Brook Road.\n-Follow this until past mile marker 12 and turn left, following the signs for Red River Camp.\n-After six and a half miles, turn right at the T. \n-Under a mile, you'll enter Main Public reserve lands.\n-It's a bit more than half a mile to Pushiner Pond.\n-The river crossing is Red River, and that runs to a parking lot / boat launch at Deboullie Pond. I suggest GPSing it so that you can find your way out with ease.",
    "geohash": "f2r5",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/ME/5069/reg_IMG-0010-6702.jpg",
        "https://trailpeak.com/storage//content/trails/US/ME/5069/reg_IMG-0060-6702.jpg",
        "https://trailpeak.com/storage//content/trails/US/ME/5069/reg_deboulliepond-6702.jpg",
        "https://trailpeak.com/storage//content/trails/US/ME/5069/reg_firetower-6702.jpg",
        "https://trailpeak.com/storage//content/trails/US/ME/5069/reg_rockfall-6702.jpg",
        "https://trailpeak.com/storage//content/trails/US/ME/5069/reg_scenes-6702.jpg",
        "https://trailpeak.com/storage//content/trails/US/ME/5069/reg_soggysite-6702.jpg",
        "https://trailpeak.com/storage//content/trails/US/ME/5069/reg_trailworkers-6702.jpg",
        "https://trailpeak.com/storage//content/trails/US/ME/5069/narrow_baseofclimb-6702.jpg",
        "https://trailpeak.com/storage//content/trails/US/ME/5069/narrow_deboulliepath-6702.jpg",
        "https://trailpeak.com/storage//content/trails/US/ME/5069/narrow_trailjunction-6702.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/deboullie-mountain-trail-north-maine-woods-near-portage-me-5069",
    "stats": {
        "Activities": "snowshoe river-canoe hike",
        "From": "",
        "Seasons": "winter fall summer",
        "Stars": 5,
        "Time": "3 hrs",
        "Total Distance": "6 km",
        "Town": "Portage, ME",
        "Type": "out-and-back"
    },
    "title": "Deboullie Mountain trail, North Maine woods",
    "trail_id": "5069"
}