{
    "description": "Cape Broyle ? Inner Harbour\nIn order to do justice to the wonders of paddling in Cape Broyle, I?ve decided to break it down into two reports representing the inner and outer harbours. The inner harbour tour offers a great put-in at the public wharf in Cape Broyle if you are paddling on your own, or you could choose to explore the area withStan Cook Sea Kayaking Adventures who provide guided adventures of the area. From the slipway you can make your way along the north shore where you can peer 80-100 feet down into the clear water below.  In addition the extreme clarity, the east coast of Newfoundland boasts some of the most productive marine environments on earth and is a great place to explore the undersea world beneath the waves.\n \tAlong the north shore the trip begins by paddling past a few old fishing stages and a small hydro electric plant before arriving at Spout Cove where you can watch Sea Stars, Urchins, and Frilled Anemones along the vertical cliffs in the clear depths. The cliffs themselves have a story to tell here, and you can actually touch purple coloured rocks that were once part of a sandy beach in Morocco before the Avalon Peninsula broke off from the African plate on its long journey west. At the very end of the cove is a beautiful waterfall that offers some great photo opportunities, just be careful when water levels are high because the current can easily catch you off guard and send you for a swim in the icy water.\n\tFrom spout cove you can paddle past Smuggler?s Notch, where a local family ran a notorious rum smuggling operation during the early twentieth century. Legend has it that a schooner full of rum sank just a few hundred yards offshore here when the smugglers tried to unload their precious cargo too quickly and ended up capsizing the boat!\nJust after Smuggler?s notch is Sheep?s Head which marks the limit of the inner harbour and is also a site of a Bald Eagle?s nest. From Sheep?s head make your way across the ?narrows? and onto the south shore of Cape Broyle Harbour. Here, you can paddle around the ?rock of redemption? where local lore has it that if you make it all the way around without touching the rock, all of your sins will be washed away with the next tide.\nAfter redemption you can make your way west along the south shore and after a few minutes you will arrive at a pair of narrow sea caves that are known as the Devil?s Nostrils. These caves reach about 40-50 feet into the bedrock but are only a few feet wide and are too narrow to even paddle in forcing you to use your hands to make your way in and out. The caves are mainly very safe for exploring but if there is a swell caves are never a good idea.\nAfter the caves you can continue down the south shore and you will pass the site of the old whale factory as well as a private wharf. A little further along you will reach a small estuary with another nice waterfall that is worth a few minutes of exploring. After the estuary you can make your way back to the north shore and end your tour at the public wharf.\nThe inner harbour of Cape Broyle can easily be paddled in 2-3 hours, depending on how many pictures you take. It is a fairly easy paddle for the most part but there is always the possibility of high winds and big swells along any part of Newfoundland?s east coast. Stan Cook offers a great interpretive tour of the area and it is a great way to explore if you are unfamiliar with the area or not experienced in quickly changing sea conditions. This is a great paddle with tons of marine life including shellfish, birds, and whales! It also has plenty of interesting geological features and a rich history that goes back over 350 years. For more information on guided tours visit www.wildnfld.com\nRyan Young\nNewfoundland Editor",
    "directions": "From St. John's take Pitts Memorial Drive for aprox. 9km and turn onto Route 3 South (The Irish Loop Drive). Continue south for 57km (45-50mins) until you reach the town of Cape Broyle. Take a sharp left turn at \"Best Friends\" onto Harbour Drive. Follow for 1km to the public wharf.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NL/5074/reg_HPIM1380-8764.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/5074/reg_HPIM1381-8764.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/5074/reg_HPIM1388-8764.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/5074/reg_HPIM1457-8764.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/5074/reg_HPIM1489-8764.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/5074/reg_HPIM1520-8764.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/5074/reg_HPIM1532-8764.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/5074/reg_best1_july-08-022-8764.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/5074/reg_july-08-039-8764.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/cape-broyle-inner-harbour-near-cape-broyle-nf-5074",
    "stats": {
        "Activities": "sea-kayak",
        "From": "",
        "Seasons": "summer",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "6 km",
        "Town": "Cape Broyle, NF",
        "Type": "out-and-back"
    },
    "title": "Cape Broyle - Inner Harbour",
    "trail_id": "5074"
}