{
    "description": "I wanted to do that trail for the last two years. But I needed friends that were ready to share the risks related to the uncertainty of the information. From the 1:50 000 topo map (the area is not map at 1:20 000), the elevation drop is in the range of 70 feet over the first 60 km, 5 rapids are identified; hoping that we can paddle them. We know nobody that already did the trail. How do they look like? These rapids will dictate if we can do it in two days.  The weather forecast predict a windy Sunday (the day we plan to paddle the reservoir). \r\rWe are five: 2 couples (Bruno & Sylvie, Michel & Martine) and Marcel; 3 plastic and  2 fibreglass kayaks.\r\rWe have a four day weekend. The first day is mainly for preparation (Friday) and the last day is for back up (Monday, in case). \r\rOn Friday, we were ready to paddle at 16:00; we did only 9 km. We did 40 km on Saturday. We finished the ride with a 31 km distance on Sunday.  \r\rThe facts and the observations:\r\r?\tThe elevation drop is 90 feet\r\r?\tThere are 10 rapids in total; only the rapid #9 cannot be paddled with sea kayak.\r\r?\tVery few good locations for camping. You can have a long stretch without any acceptable location.\r \r?\tThe area is flat; it not easy to locate yourself; make sure you have the proper maps and navigation tools. \r\r?\tThe trail is a succession of lakes and river segments, keeping the kayakers at close range from the shore lines.\r\r?\tThe scenery and the fauna are fantastic.\r\r?\tWith a 20 km wind, we did not have to change our itinerary on the reservoir. But stronger wind could force you to do so.  \r\r?\tWe reached the exit point on the reservoir at 18:15 on Sunday; as planned.\r",
    "directions": "The location:\rThe River La petite Manicouagan feed the reservoir Le Réservoir Petit Manicouagan on which the Hart Jaune electric Central is located. This in turn, feed the mega Manic 5 reservoir 30 km downstream via the Hart Jaune River.\r\rYou start the ride at the bridge of the Peppler River, located at km 460 on the road 389 from Baie-Comeau to Fermont.\r\rThe exit point is located at HJ7 dam. The elevation of the top of the dam is about 20 feet above the water level.  \r\rYou will find precise info on the GPS tracks.  The time tags are included as well as exact location of the rapids.\r\rYou need two cars.\r\rThe Jacqui River and the Cassé River, are two rivers parallel to the Petite Manicouagan River. To be explore next year. \r",
    "geohash": "f3",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/QC/5081/reg_CIMG4213-8318.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/5081/reg_CIMG4247-8318.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/5081/reg_CIMG4249-8318.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/5081/reg_CIMG4270-8318.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/5081/reg_CIMG4278-8318.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/5081/reg_CIMG4285-8318.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/5081/reg_CIMG4286-8318.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/5081/reg_CIMG4294-8318.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/5081/reg_CIMG4310-8318.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/5081/reg_CIMG4314-8318.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/5081/reg_DSCN1254-8318.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/la-petite-manicouagan-near-fermont-pq-5081",
    "stats": {
        "Activities": "sea-kayak",
        "From": "",
        "Seasons": "summer",
        "Stars": 4,
        "Time": "21 hrs",
        "Total Distance": "80 km",
        "Town": "Fermont, PQ",
        "Type": "out-and-back"
    },
    "title": "La Petite Manicouagan",
    "trail_id": "5081"
}