{
    "description": "NTS Map: 092G06\nThis interpretive loop, provides an excellent introduction to the heavily forested (2nd Growth) mountainside and rugged terrain.  This hike is very popular with hikers who are not looking for a major Grind (as in Grouse Grind) and, who may even want to run it.  It is open all year round, as it is a lower elevation hike. The Lynn Headwaters park also provides good access to other backcountry hikes.  There are a number of trails that branch off the main loop trail including a a 20 min hike up to a viewpoint (there is a sign indicating this). It gives you an open view back to Vancouver.  There is also a much longer hike that takes you to Lynn Peak, however this is not open in the winter. You'll see the signs for various natural attractions, including a sign identifying the large \"boulders\" to the side of the trail (just in case you were mistake them !?). the trail itself is quite wide, although rocky and rooty in sections, you'll see plenty of evidence of giant trees that were logged out earlier this century.  The 2nd growth forest is impressive though. \nOur 3D map shows the short Lynn Loop trail only, where hikers take the switchbacks back down to Lynn Creek gravel path to complete the trail.  Good anytime of the year, the park entrance has washrooms, adequate parking, and, picnic areas.  One of the best local trails around for convenience, and, access to much more. There are over 20km of developed trails. It is wilderness area though, so keep this in mind.  Somewhere in the park (not on the Lynn Loop trail itself) is a memorial to an airline flight that went down one mountain back in 1947 or so.  The plane was found a only few years ago, that's how remote the terrain is just a few kilometers back.  \nTo get to Lynn Headwaters, take the Second Narrows bridge or Lion's Gate bridge, and get onto the Trans Canada Highway (Upper levels) heading West if approaching from Second Narrows, East from Lions Gate. Take the Lynn Valley Road exit off the Upper Levels Highway and follow Lynn Valley Road north, past the turnoff to Lynn Canyon Park, to the end. Cross the bridge over Lynn Creek staying right (instead of left on the gravel road), and proceed on foot to the yellow metal gate marking the boundary between Lynn Headwaters and the Seymour Demonstration Forest. Go left to the Lynn Loop trail, as it climbs fairly steeply initially. Once it levels off, you are hiking along the side of Lynn Canyon, and, this continues for another kilomter or so until you see a sign indicating your descent via a number of switchbacks. This is the shorter loop.\nIf you click on \"view/download GPS\" you will see a preview of the GPS track that you can download for use in your own unit, although this trail is quite easy to find and follow, sometimes using a GPS unit takes the guesswork out of finding the trailhead.",
    "directions": "See description and / or GPS",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/51/3D_LynnHike.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/51/reg_PIC1ChinChim.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/51/reg_hwymapLynn.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/51/topo_Lynn.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/lynn-loop-lynn-headwaters-regional-park-near-vancouver-bc-51",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "4 km",
        "Town": "Vancouver, BC",
        "Type": "out-and-back"
    },
    "title": "Lynn Loop - Lynn Headwaters Regional Park",
    "trail_id": "51"
}