{
    "description": "Possibly the best easy rock climb in southwestern BC. Approach-driving plus hiking time from Vancouver is about 5 hours. It's possible as a long day trip or best as a weekend out on the Settler--drive in, climb this route, camp, do another route the next day, and go home.\r\nFrom Daiphy Lake SW of the Old Settler, climb up the talus to the base of the route, a very obvious, prominent buttress. Then start climbing. The climbing is characterized by short walls, slabs and ledges and is true class 4, in that some will solo/scramble it, while others will find that it is easy 5th class. If you feel the need to rope up a few nuts and hexes, maybe a TCU or three or some small-medium Tri Cams for the omnipresent flared slot, will do for pro. The rock is wonderfully rough and grippy and rock shoes are probably unnecessary. Approach shoes might be better than big boots.\r\n\r\nThe route basically runs up the buttress crest diverting onto the slabs on the climber's left (the face of the west couloir) where necessary to outflank walls, and many variants are possible depending on one's desire for challenges. If you roped and belayed the whole thing it would be about 10-12 pitches long. Simulclimbing is probably a better technique. Many sunny afternoon ledges offer inviting spots for a faster climber to laze away an hour or two awaiting some slower companions. A curious golden eagle will often circle overhead on this route, wondering perhaps if you are a marmot or if you have one hidden in your pack.\r\n\r\nThe fastest way off is to descend the south ridge of the south peak as for the N-S traverse in reverse. Drop east off the summit down slabs to a terrace, and then follow a slanting ledge/gully system down, possibly rappelling a short chimney (pins in place). It will take about 2-3 hours from the south summit back down to the lake.\r\n\r\n(Description Courtesy  Drew Brayshaw)\r\n There is GPS data attached to this trail (see \"download GPS\"), which if loaded into your GPS can help you find route points.\r\n\r\n    \r\n        \r\n      \t\r\n\r",
    "directions": "Access: Old Settler is a high peak between Harrison Lake and the Fraser River. It's best approached from Harrison East FSR and Talc Creek logging road.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/510/reg_settler03.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/510/reg_settler13.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/510/reg_settler15.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/510/reg_settler19.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/510/reg_settler21.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/510/narrow_settler17.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/southwest-buttress-of-the-old-settler-south-peak-near-abbotsford-bc-510",
    "stats": {
        "Activities": "climb",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 4,
        "Time": "14 hrs",
        "Total Distance": "0 km",
        "Town": "Abbotsford, BC",
        "Type": "out-and-back"
    },
    "title": "Southwest Buttress of The Old Settler South peak",
    "trail_id": "510"
}