{
    "description": "Get travel information on Princeton from HelloBC.com\r\n\r\nCathedral Provincial Park is a 33,000 hectare mountain wilderness of azure lakes, alpine meadows and jagged peaks in the Okanagan Mountain Range about 30 km southwest of Keremeos.\r\nBounded on the south by the British Columbia -Washington border, on the east by Ewart Creek, on the west by Manning Park and on the north by the Ashnola River, a tributary of  the Similkameen, the park encompasses a variety of terrain and flora and fauna of the transition zone between the rain forest of the Cascade Mountains and the more arid Okanagan Valley. \r\n \r\nDouglas-fir predominates in the lower levels, interspersed with strands of cottonwood and aspen along the waterways.  Lodgepole pine and Engelmann spruce prefer higher ground, giving way to sub-alpine fir, balsam fir and Lyall's larch.  Heather and lupine are fairly common at higher levels.\r\n\r\nHikers may see larger mammals such as mule deer, mountain goat and California bighorn sheep.  You're apt to hear the whistle of a marmot as it suns itself on the rocks, or the chatter of tree and ground squirrels.  And the whiskey jacks will be closing in when you bring out the food.  The lakes and waterways are populated with rainbow and cutthroat trout. In other words, it's a bit of paradise.\r\n\r\nWeather conditions are varied.  Daytime temperatures in July and August often reach 25C with average summer temperature being  in the 9-10C range.  Winter usually sets in about the middle of October and lasts until late April or early May.\r\n\r\nIf you want to see heaven, this is the way to go without following the bright white light.  It is very easy to get there.  We left Surrey at 4:30 pm, and went through Princeton at around 7 pm.  By the time we were just this side of Keremeos the sun was setting.  The turn off is 3 km this side of Keremeos, and very easy to see.  There is a large log sign saying  CATHEDRAL LAKES LODGE.  The road eventually turns to gravel, and about 3 km along you come to a split in the road; stay right (there is a large sign) and after another 6 km you come to the lodge's bridge.  We booked our jeep ride from the lodge for 10 am the next morning, (You can book a ride up on the Lodges private road).  June, Sept. and Oct is $55 return.  July and Aug. is $75 return.  Go to www.cathedral-lakes-lodge.com,  and then reservations--they call you back to confirm it. \r\nWe drove along another 2 km, to the Lakeview Trails Recreation Site (the starting point for one of the trails up). This one is 16 km, about 7-8 hours with a 1300 meter elevation gain and nothing to see.   We camped there for the night. \r\n\r\nThe next morning we went back to the bridge to catch our ?LIFT?.  The lodge has their own bridge across the Ashnola River, a security hut, and a locked gate.  So when you park your vehicle there for a few days, you know it is safe!  The staffs are amazing!  Here we are all packed into these crazy sacks we plan on humping around on our backs with house, beds, and kitchen sink, and they tell you they will drive around to your vehicle to pick it up.  I don't even have to carry it across the parking lot!!!  Then off we go into an old German Mercedes army truck for an hour-long bumpy climb to a whole new world.  A cold one!  We met another couple on the truck, and started a new friendship.  Talking took our minds off the crazy ride.\r\n\r\nOnce you get to the core of the park, there are camping sites at three of the lakes. \r\n\r\nThe Quinicoe Lake Rec Site, closest to the lodge, is the only one allowing you to have a campfire.  At this altitude, you need something to bring the feeling back into your fingers and toes.  And the added bonus is I only have to carry my pack for 10 minutes!!  I could have brought more, like real food and my pillow!! As you go by, check out the rangers LOG cabin!!!  PURE LUXURY!   \r\n\r\nOur friends found a great site just a few feet from the lake (most sites are up on a little hill, away from the water).  And, oh yes, this is your drinking/washing water...so there are strong rules.  The water looks OK, but our friends brought purifying drops, and boy were we lucky they share.  We set things up, had some lunch and took off to scout out the area. \r\n\r\nWe took a hike up to Glacier Lake, then down around Pyramid Lake, and around Lake of the Woods.  We were all huffing and puffing already, looking up at the RIM thinking ?how the hell are we gonna do that; we can't breath!? The altitude change sure gets you.  \r\n\r\nI think we adjusted by the end of the hike, as it only took us a couple hours to circle the three lakes.  Dinner, hot chocolate in front of the fire, and early to bed.  \r\n\r\nUp early, breaking the ice off the picnic table, we filled our tummies with a hot breakfast and headed for the BIG HIKE.  Today we are doing the Cathedral Rim.  We went up to Glacier Lake, then up to the Rim trail (elevation gain approx. 750 meters).  Here we stopped for water and snacks (about 45 minutes).  Everywhere we went we saw mountain goat poop, but never saw one damn goat!! There are no bears up this high, too cold for them, but there are lots of small critters.  Continuing on, we went past the Devil's Woodpile, tall columns of basalt rock that looked like chopped firewood piled a few hundred feet high.  Then we stopped in Stone City for lunch, (about an hour) very strange to see stones rounded by the wind, bigger than your car, all piled up the size of a house.  \r\n\r\nOn to Smokey the Bear, a rock formation that resembles the silhouette of ole Smokey and The Cleft, softer basalt rock eroded and left a 1500 ft split in the granite face of the mountain.\r\n\r\nAfter the Cleft, we came back to the Ladyslipper Lake Trail and headed down.  Took us about 8-1/2 hours round trip, and that is with my bruised heal bone.... so not too bad.\r\n\r\nThe next day we went up to Scout Lake, and took the Diamond Trail up and around Scout mountain--elevation gain about 250 meters.  This gave us a great view of where we were the day before.  This was a nice small hike; it only took us a few hours, and was a good one for loosening the muscles from the day before. On the top we were pelted with hail for about 15 minutes.  When we got back to camp it started pouring rain, so we were locked in our tents for a couple hours.  Eventually the sky opened up, and we came out for a little fishing (Mark caught one, but lost it just as he was pulling it onto the rock) and then dinner.  Our plans for the next day were to do the Lakeview Mountain trail to the top, then over to the Boxcar, and down to Goat Lakes, and back. \r\n\r\nI was up all night worrying about it.  I ached from head to toe, and had a huge blister on my bruised heal. When we got up it was very cold and sunny, but it was starting to cloud over.  We all decided to call it a trip and booked the next jeep ride down.  Gotta save something for next year!!!   We have never gone back to the same place twice, but we have ALREADY decided to go back next year.  We might even get a night in the Lodge.  \r\n\r\nThe Cathedral Lakes Lodge has a wonderful set up.  They go up in April and start working on the road, cutting fallen trees ploughing snow.  It might take them two months to get the road open.  Meanwhile crews go up to the lodge on snowmobiles and start shovelling out the cabins and cleaning them up.  They are open June 15 - October 15.  I chatted with some of the guests, and got nothing but two thumbs up!  They all raved about the INCREDIBLE food.  In the morning they set out a grand assortment of breakfast foods, and on the side they set out a huge table of sandwiches, cookies, and lunch n? munches you can pack in you sack for lunch on the trail, in case you are not there at lunch time.  If you are there for lunch you can build your own sandwich from an assortment of stuff, and have a choice of two or three hot dishes.  Dinner is a feast!!  My mouth was watering when I heard the dinner bell from across the lake.  I was told the dinner buffet the night before was roast, salmon, chicken, a couple of vegetarian dishes, and all the vegetable side dishes.  Then there were the DESSERTS!!!  After dinner, you can have a hot shower, or even a soak in the hot tub!!!  That would sure beat crawling into my mummy bag, smelling of three days of dirt, and pulling the hood over my head. \r\n\r\nOne of my favourite trips ever!!!!   Cathedral Provincial Park is definitely hiker's heaven.  Too bad heaven had to be so cold. \r\n\r\nTopographic map: Ashnola River  92H/1  cover this area.\r\n\r",
    "directions": "From Vancouver, take the Hope-Princeton Highway. Continue on to Keremeos, and just 3 km before Keremeos is the turn off on the right.  There are lots of signs, and it's easy to follow.  We did it in the dark!!\r\n\r\nNOTE: To figure out what each picture is, if you right click on the full image, and click on \"properties\", the name of the image will identify the feature or lake.  Good luck.\r",
    "geohash": "c2d",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/511/reg_DevilsWoodpile.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/511/reg_LadySlipperlake.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/511/reg_QuiniscoeLake.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/511/reg_Somelake.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/511/reg_TopScout.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/511/reg_leRim.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/511/narrow_Cleft.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/511/narrow_Drop.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/511/narrow_GoingUp.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/511/narrow_donors.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/cathedral-provincial-park-near-princeton-bc-511",
    "stats": {
        "Activities": "climb river-canoe hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 5,
        "Time": "21 hrs",
        "Total Distance": "0 km",
        "Town": "Princeton, BC",
        "Type": "out-and-back"
    },
    "title": "Cathedral Provincial Park",
    "trail_id": "511"
}