{
    "description": "One of the premier ridge walks in Kananaskis and a rare trip that can be done as a one way jaunt that doesn't require you to retrace your steps. Best done with two vehicles though. Start from the Highwood Pass parking lot unless as you will finish nealy 300 m lower this way. Start at the north end of the parking lot and follow the gravelled interpretive trail across the foot bridge and immediately find the ridge trail branching on the left at a sign asking that hikers keep to the established trails to protect the environment. Walk single file to avoid trail braiding. The trail will soon turn to the left and begin a gentle ascent though the forest. A creek will often run down the trail making for a sloppy ascent. After a short descent you will eventually reach a small tairn. From here the trail is obvious. Stay to the right crossing a small creek the valley will open up and you'll be at the base ridge. Follow the trail to the summit. The first peak is the hardest. From the top you can see the next two peaks. The trail may not always be obivous but it's well established and shouldn't be difficult to find as you progress. You'll have great views of Highway 40 to the east and Elbow Lake to the north east.  After the third peak there will be a fork with a branch to the right leading down to Highway 40. Continue straight and up a short ascent to the fourth and final peak on the ridge. As you begin your final descent the Little Highwood Pass parking lot will be visible. The descent is steep and long. You have one last creek to cross before emerging onto the Highway. If you left a vehicle at the Little Highwood Pass parking lot your hike is done. Enjoy.",
    "directions": "From the TransCanada highway follow Highway 40 south. Highway 40 will be closed beyond the Kananaskis Lakes Road turnoff from December until June 15 each year as it is a critical wildlife corridor. From the Kananaskis Lakes Road turnoff continue along Highway 40 until you reach Little Highwood Pass parking lot. If you have two vehicles leave one here. If you only have one vehicle leave it here and try hitch hiking the last few kilometers to the Highwood Pass Parking lot.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/5123/long_Pocaterra-Ridge-S-N-Traverse-Highwood-Kananaskis-View-Elpoca-Rae-Aug-7-2017-1024x241--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5123/long_Pocaterra-Ridge-S-N-Traverse-Highwood-Kananaskis-View-Rae-Pocaterra-Traverse-Aug-7-2017-1024x298--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5123/reg_IMG-0792-15837.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5123/reg_IMG-1083-15837.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5123/reg_Little-Highwood-Ridge-023-14636.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5123/reg_Little-Highwood-Ridge-025-14636.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5123/reg_Pocaterra-Ridge-S-N-Traverse-Highwood-Kananaskis-Bighorn-Showing-us-the-Way-Aug-7-2017-1-865x1024--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5123/reg_Pocaterra-Ridge-S-N-Traverse-Highwood-Kananaskis-Grizzly-Aug-7-2017-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5123/reg_Pocaterra-Ridge-S-N-Traverse-Highwood-Kananaskis-Long-Ridge-Walk-Aug-7-2017-1-1024x768--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5123/reg_image.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5123/narrow_IMG-0803-15837_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5123/narrow_Pocatera-Ridge-028-14636.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/pocaterra-ridge-near-kananaskis-ab-5123",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 4,
        "Time": "7 hrs",
        "Total Distance": "11 km",
        "Town": "Kananaskis, AB",
        "Type": "out-and-back"
    },
    "title": "Pocaterra Ridge",
    "trail_id": "5123"
}