{
    "description": "This Is an excellent trail! It is definitely challenging, although I may be biased due to the fact that it was my first hike. There are a lot of switch backs and steep ascents. The pain from the hike though is most definitely worth the view. I saw several Deer, and many Marmots. This hike can be done in a day, for those of you that are masochists, or completed over several days. I recommend hiking the first 11 km to White horn, and setting up camp there, and the next day hiking the next 11 km to Berg Lake camp ground. The second 11 km is the toughest, and you will need the strength for the steady switch backs.On your way to Berg lake, I highly recommend setting your pack down and hiking the short distance down to Emperor Falls, it is quite the sight!I also recommend taking about 4  to 5 days to complete this hike, as there are many trails to explore from Berg Lake. You should definitely explore Snow Bird pass while you are up there. There is at the top of Snow Bird Pass, a gorgeous meadow! Totally unexpected while hiking the rocky cliffs above the Robson Glacier!",
    "directions": "From Edmonton, follow Yellowhead trail past Jasper National Park. It is about a 5 hour drive on the Yellowhead. The hike is in the shadow of Mt. Robson, the highest peak in the Canadian Rockies at 3954m. The trail starts off at the parking area 2km behind the visitor center (and cafe) at the top of Mt. Robson Pass off the Yellowhead highway. Gas, camping, and a cafe convenience store are located nearby.",
    "geohash": "c37",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/5150/reg_224444-2290567192110-5173574-n-30477.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5150/reg_281969-2290564992055-4433806-n-30477.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5150/reg_first-solo-027-17620.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5150/reg_first-solo-033-17620.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5150/reg_first-solo-044-17620.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5150/reg_first-solo-062-17620.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5150/reg_tricia-s-solo-hike-004-17620.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5150/reg_tricia-s-solo-hike-023-17620.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5150/reg_tricia-s-solo-hike-031-17620_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5150/narrow_tricia-s-solo-hike-029-17620.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/berg-lake-trail-near-valemount-bc-5150",
    "stats": {
        "Activities": "hike mtn-bike",
        "From": "",
        "Seasons": "summer",
        "Stars": 5,
        "Time": "14 hrs",
        "Total Distance": "22 km",
        "Town": "Valemount, BC",
        "Type": "out-and-back"
    },
    "title": "Berg Lake Trail",
    "trail_id": "5150"
}