{
    "description": "This trail is unmarked, unadvertised at the top of the Solar Coaster Express on Blackcomb Mountain. Hopefully with the new peak to peak gondola due to open in December 2008 linking Whistler Mtn to Balckcomb Mtn that these trails on Blackcomb will be advertised and made more available to the public.The hiking season here is extremely short if you count on the chairlifts for access. Until mid July, there is too much snow up here to properly hike, and the chair lift on Blackcomb closes for the season (at least until skiing starts again in November) on the last Sunday of July.You could walk up, but then, that's 1300 m up, and probably 10 kms long (the chairs are 4 kms, in STRAIGHT LINE, the road up is very zig-zaging). Drop $32 (2008 price) at the Blackcomb Wizard Express booth at Upper Village, ride the Wizard chair to mid-station and connect to the Solar Coaster. (TIP: Don't tell them you're going to hike up there, but that you're going \"sightseeing\".) At the Rendez-Vous, you get off the Solar Coaster and proceed literally straight ahead onto the Fitzsimmons Meadow Walk. You will eventually cross the 7th Heaven Express chair, where you can take the Upper Lakeside Trail, a loop north and up a bit which eventually reconnects with the main trail, or keep going straight ahead on the Lower Lakeside Trail. Eventually, you will come to a ridge, where you will climb northeastward on the Overlord Summit Trail to the Overlord Lookout.At this point, you will get a great view of Overlord Mtn and Fissile Peak as well as Overlord Glacier.  You then head down, eastward into Decker Tarn, and circle back, eventually back onto the Lower Lakeside Trail (or the Upper Trail if you wish). Heading west, we went down one of the ski slopes (Souther Comfort or Cloud Nine) down to the 7th Heaven Express. We hopped onto that chair (included in the $32 you paid to get onto Wizard Express a few hours ago) and went to the top of that chair, at 2200 m (approx 7600 ft), and rode the chair back down (although you can walk down).We then took the shuttle bus from bottom of 7th Heaven chair to Solar Coaster and rode that and Wizard back down.Pls make sure you don't miss the last chair down (3:45 pm?), or you're walking a long way down.This is apparently also available for cross-country skiing in winter, but I haven't done it, so can't personally tell.The GPS data includes the chairs up, the hike, the walk down Souther Comfort ski slope to 7th Heaven chair and the shuttle bus back from bottom of 7th Heaven chair to the top of Solar Coaster.",
    "directions": "Go to the Upper Village in Whistler and buy a ticket for BLACKCOMB (not for Whistler).",
    "geohash": "c2b",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/5152/reg_BlackCombMeadows6076-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5152/reg_BlackCombMeadows6089-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5152/reg_BlackCombMeadows6093-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5152/narrow_BlackCombMeadows6084-7359_best1_.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/blackcomb-meadows-dekker-tarn-near-whistler-bc-5152",
    "stats": {
        "Activities": "hike ski-xc",
        "From": "",
        "Seasons": "winter summer",
        "Stars": 4,
        "Time": "4 hrs",
        "Total Distance": "8 km",
        "Town": "Whistler, BC",
        "Type": "out-and-back"
    },
    "title": "Blackcomb Meadows - Dekker Tarn",
    "trail_id": "5152"
}