{
    "description": "During my stay at  Irwin Lakes chalets, I took some time to visit MacEmlon's Pond. It's located in the Debert Wildlife Management Area, and is a provincial park created as a nature reserve. I always thought of it as a bird sanctuary when I was growing up. With a bit of on-line research, I found out that it's near a paleo-indian site. My family had taken me to canoe and enjoy picnics there for years, and I never knew that!The forest along the pond (called a pond, but a bit larger than Irwin's Lake) has been artificially planted into neat rows of pines. Some stands even have blue markings indicating some sort of research or study going on. This park holds a couple of activities definitely worth doing. Hiking the trail is one of them. The trail takes you through some of the planted pine stands, and also along the edge of the pond, for some very nice views of the water and water fowl. Occasionally I saw some trail spurs likely made by ATVs but I didn't have time to investigate them. There are boardwalks protecting the boggier sections from treadwear damage, and signage indicating some of the forest features. It's a great way to spend an afternoon after a picnic. You can even fish from the pond, or trail run the relatively flat, rooty terrain.Shannon Burteast coast editor",
    "directions": "Off the 102 highway heading North, take exit 14A toward Onslow, (to the left) This is route 2. Take this until you reach a lit intersection with MacAlmons Road to the right. Follow the road for a minute or two until you reach the park on your left.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/5155/reg_IMG-0097-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/5155/narrow_IMG-0104-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/5155/narrow_IMG-0105-6702_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/5155/narrow_IMG-0106-6702.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/macelmons-pond-trail-near-truro-ns-5155",
    "stats": {
        "Activities": "snowshoe hike ski-xc mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "2 km",
        "Town": "Truro, NS",
        "Type": "out-and-back"
    },
    "title": "MacElmon's Pond trail",
    "trail_id": "5155"
}