{
    "description": "Irwin's Lake\" Lakeside trail\nJust as you reach the community of Old Barns, is the location of Irwin Lake chalets.The owner has done a lot of work in setting up some attrractions for outdoor enthusiasts and guests alike, for both summer and winter activities. I even heard that there's even a geocache up in there somewhere, so take along your GPS for some outdoor fun. It's all on private land, so you'll need to approach the Irwin Lake chalet office to let them know you're in there.\nI had lived in Truro for several years, and never knew the lake ever existed until just recently. (I guess that's what happens when you don't grow up with Google Earth!)\nSome of the attractions include man made ponds stocked with fish, interpretive signage, and a beautiful red covered bridge. The trail spans one side of Irwin's Lake and heads inland toward the ponds and bridge. It's a mowed path in places,and an abandoned cart trail through the woods in others, and in between, makes use of some of the existing main road. Given the variety of the terrain, and the eye candy along the way, it's worth the hour or so to hike it. If you set off early enough in the morning, you'll spy deer and rabbits along the way as I did several times. \nIf you start by the dock, the trail takes you past the covered bridge along the road, turns right into the woods, and comes back onto a road where there a number of cottage lots for sale. Eventually it turns back on to a portion of the trail you already hiked and returns ack to the dock.. You can continue on past the dock along the lake, and this takes you back to the Irwin Lake road, where you can either double back, or go on to do the Lockhead Demonstration woodlot trail.\nI suggest you have decent boots and a hiking stick of some sort due to the path being wet in spots, and the roots get really slippery on wetter days.\nHey while you're there, go for a paddle too to make a longer day of it. The lake is beautiful.",
    "directions": "Head out from Truro using the road (rt 236) along the salmon River under the 102 highway bridge by exit 14 heading West. Drive for 8 minutes, and you'll see a sign marking the Old Barns community. Soon after that, you'll see a sign indicating Irwin Lake Chalets along a road to the left. Turn there, and travel along the dirt road for 3km. It narrows somewhat, and you'll see a sign to slow down. Just beyond the right hand turn, you'll find the office for the chalets. Talk with the owner to indicate your reason for visiting. Parking there, backtrack to the chalet turn off, and you'll see signage to the warf. This is a great place to begin and finish the hike.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/5158/reg_IMG-0040-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/5158/reg_chaallets-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/5158/reg_covered-bridge-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/5158/reg_dock-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/5158/narrow_IMG-0041-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/5158/narrow_IMG-0042-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/5158/narrow_path-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/5158/narrow_path2-6702.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/irwins-lakeside-trail-near-truro-ns-5158",
    "stats": {
        "Activities": "snowshoe hike ski-xc mtn-bike",
        "From": "",
        "Seasons": "winter fall summer",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "4 km",
        "Town": "Truro, NS",
        "Type": "out-and-back"
    },
    "title": "Irwin's Lakeside Trail",
    "trail_id": "5158"
}