{
    "description": "This trail leads from the downhill parking lot at Cypress Provincial Park to the top of the Black Mountain chair and then winds itself through alpine forest for a kilometre or two until you reach Cabin Lake.  It is well marked and a good hike if you only have a couple of hours to spend.  A couple of smaller loops are possible; Cabin Lake is a popular swimming Lake and many people choose to do it au naturel, even in late September.\nThere are great views of Greater Vancouver, Howe Sound, the Sunshine Coast and of course the Lions.  There is no dependable drinking water so stock up in advance. The coffee shop at the parking area may not be opened in the fall, so don't expect to be able to eat, but the vending machines were working on our visit.\nThe climb up to the top of Black Mt is NTD and the plateau at the top has many small lakes and tarns to explore.  This is part of the Baden-Powell Trail and if you are really eager and have a second car you can hike all the way to Horseshoe Bay.\nThis trail will be snow covered from late November to May",
    "directions": "Exit the Upper Levels Highway at the Cypress Bowl Rd exit and follow the park road all the way to the downhill parking area, some 14 km from the highway. The trail starts by Cypress Sports building and is well-marked.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/516/reg_BlackMt.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/516/reg_IMGP7249-27133.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/516/reg_IMGP7260-27133.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/516/reg_cabinlake1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/516/reg_cabinlake2.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/black-mt-cabin-lake-loop-cypress-provincial-park-near-vancouver-bc-516",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "0 km",
        "Town": "Vancouver, BC",
        "Type": "out-and-back"
    },
    "title": "Black Mt - Cabin Lake Loop (Cypress Provincial Park)",
    "trail_id": "516"
}