{
    "description": "The Lions are a familiar Vancouver landmark that even the most urban city dweller can recognize. With some determination, you can get a closer look than most people will ever have the opportunity to enjoy.\r\n\r\nFrom the trailhead in Lions Bay, the trail plunges into your typical North Shore forest and climbs steadily along an old logging road. The trail is marked with flagging tape and with stone arrows on the ground. Keep right. The trail passes a waterfall on your left and offers some peek-a-boo views of Howe Sound on your right. The logging road narrows to a trail and after about an hour and a half to two hours you should reach the turn off to Harvey Creek. It is well signed. The trail descends steeply to the bridge crossing. (The old Harvey Creek crossing is closed now and this new bridge crossing replaces it) There are some nice views of Howe Sound from the bridge.\r\n\r\nThe trail gets trickier now. For the next two hours or so you switch back through thick forest, scrambling over fallen logs and clambering up the trail, which consists mainly of rocks and roots in many places. This is the steepest part of the trail except for the climb up to the summit of course. Finally, the trail deposits you out onto the Howe Sound Crest where you are rewarded for your efforts with views of the clear-cut slopes of Mt. Harvey to your left and in front, and the West Lion to your right. \r\n\r\nContinue along the well marked trail up towards the West Lion. The grade eases but its still not easy going as you hop from rock to rock along the heather covered slope. In half an hour or so you will reach the Howe Sound Crest. Most people stop here. It's a great place for lunch with views of Capilano Lake, the city, and many of the North Shore Mountains. \r\n\r\nWARNING: ONLY EXPERT CLIMBERS SHOULD CONSIDER CLIMBING THE LIONS SUMMIT, PEOPLE DO DIE HERE.\r\nIf you choose to continue to the summit, descend into the gap between the Lions using the fixed rope. The worst part of the ascent is the first part where you must traverse a dangerously exposed section. It's not terribly difficult except for the fact that falling is NOT an option. Keep right and look for the orange markers. The ?trail? is well marked with good handholds almost all the way up. That being said, this is NOT for inexperienced climbers. The climb is dangerously exposed in MANY places. Go slow and test your holds, many of which are roots and branches. Do not attempt the summit of the West Lion without proper footwear. \r\n\r\nThe views from the summit are phenomenal. We could see Black Tusk, Garibaldi, Cathedral, Coliseum, Needles, Crown and many more of the North Shore peaks. It took us 4.5 hours from the trailhead to the summit. Helicopters regularly circled the peak bringing tourists in close to watch the climbers. This was kind of fun the first time but after 4 times it was getting distracting and annoying.\r\n\r\nI expected the climb down from the summit to be worse than the climb up but was pleasantly surprised to find that it wasn't as bad as I expected. It was much more enjoyable than the rest of the descent. My knees took a hell of a beating on the long way down. The trail through the trees and then down the logging road seemed to go on forever.  We made it back to the car at 5:30. We'd spent an hour on the summit with two more short breaks on the way up and down so all told we hiked for about 7.5 hours. \r\n\r\nThis is not a hike for the inexperienced or unfit but is a rewarding challenge for experienced, fit, prepared hikers. \r\n\r\nOne word of warning, do not leave anything lying around. It's a sad reality that people are stinkers. Last week a friend of mine had his trekking poles swiped after he left them at the base while he climbed to the summit. I had someone pick up my camera when I had taken off my pack and was resting on the way down. \r",
    "directions": "Take Hwy 1 to Lions Bay. Take Oceanview Road, and go left on Cross Creek Road, and then right on Centre Road.  Go left on Bayview Road, left on Mountain Drive and left on Sunset Drive. There is parking at the trailhead but unless you get there early you'll have to park 1 km down the road at the school on Mountain Drive.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/517/long_Picture4.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/517/reg_Binkley-Lions-Trail-2011-10-08-064-38186.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/517/reg_Picture1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/517/reg_Picture2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/517/reg_Picture3.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/517/narrow_Binkley-Lions-Trail-2011-10-08-010-38186.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/517/narrow_Picture5.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/west-lion-summit-binkert-trail-near-vancouver-bc-517",
    "stats": {
        "Activities": "climb hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 4,
        "Time": "9 hrs",
        "Total Distance": "15 km",
        "Town": "Vancouver, BC",
        "Type": "out-and-back"
    },
    "title": "West Lion Summit (Binkert Trail)",
    "trail_id": "517"
}