{
    "description": "Super fun, and brand new, just opened in Spring 2008.  This scenic trail alternates through moderate and difficult sections.  It offers pristine wilderness, breathtaking views and secluded spaces.  Navigational aids include ropes and two cable cars, but a good hiking stick is recommended.  One day of walking goes in and out of small, rocky beaches with awesome tidal pools, where you are sure to see hundreds of cute little crabs, millions of seashells and pods of grey whales.  Also be on the look out for coyotes, bears and other small critteres.  Sometimes scaling walls, few sections of boardwalk over the bog areas, and skating on moving rock and stone on the beach areas.  Bring a water filter and pay attention to water access areas.  Some good beach camping, and some platforms, and pit washrooms, limited access to services.",
    "directions": "Trail starts at entrance to Cape Scott Trailhead, but branches off to the Eastside of the island.  Parking lot here where you can leave your car, but the return trip would double the length of your hike.  Shuttles to the trailhead and back again exist.  You have to hire a boat shuttle at the end, or start, depending on where you begin, for pick up or drop off.  They range from $80 per person.  But camping fees are small: $5 for one night.",
    "geohash": "c1",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/5174/reg_n606170929-1427637-1938-0.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5174/narrow_n606170929-1427630-9882-0.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5174/narrow_n606170929-1427633-801-0.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5174/narrow_n606170929-1427644-3992-0.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/north-coast-trail-near-port-hardy-bc-5174",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 5,
        "Time": "42 hrs",
        "Total Distance": "64 km",
        "Town": "Port Hardy, BC",
        "Type": "out-and-back"
    },
    "title": "North Coast Trail",
    "trail_id": "5174"
}