{
    "description": "Follow the boardwalk/well-graded trail to Lake Helen McKenzie (~ 3km). Stay to the right along west side of Lake Helen McKenzie and carry on past Ranger cabin (~ 6.3 km) to Circlet Lake turn-off (~10 km) along well-marked trail.  From Circlet Lake trail junction hike up to large cairn marking Mt. Albert-Edward/Mt. Jutland col.  Bear to the left and follow well marked smaller cairns leading the way to Alb-Ed summit.  At 1722 m elevation/13.1 km you will see a steep talus chute that drops off to the right - descend into gulley and bear to the left as you hike around to glacier along bottom of north face of Mt. Albert-Edward.  Follow glacier upward to Mt. Albert-Edward/Mt. Regan col (1830 m elevation/16 km).  Turn right and follow the ridge up to the summit of Mt. Regan (1977 m elevation/16.5 km).  Climb is mostly a scramble, but you can make it a wee bit harder depending on which chute you decide to ascend.  Once you've summited, descend via same route to col.  From the col you will see a vertical couloir lead directly to the summit of Mt. Albert-Edward which is fun or you can climb the snow band rising leftward across north face to gain ridge approximately 100 m below summit of Alb-Ed.  Once on Alb-Ed proper, follow the cairns west and downwards back to main col and then back to trailhead.\r\r**All distances are cummulative starting at km 0 @ trail head.",
    "directions": "Highway 19 north past Courtenay to Strathcona Parkway; turn left onto parkway and continue up to Mt. Washinton ski hill; turn left at Raven Lodge turn-off; drive to end of road and park at Strathcona Park trailhead/kiosk.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/5211/long_Mt-Regan-topo-8857.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5211/reg_Mt-Regan-Aug-15-16-2008-TrailPeak-8857.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5211/reg_Mt-Regan-Aug-15-16-2008-TrailPeak2-8857.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5211/Mt-Regan-Aug-15-16-2008-006-8857.JPG"
    ],
    "source_url": "https://trailpeak.com/trails/mt-regan-near-courtenay-bc-5211",
    "stats": {
        "Activities": "hike climb",
        "From": "",
        "Seasons": "summer",
        "Stars": 3,
        "Time": "14 hrs",
        "Total Distance": "32 km",
        "Town": "Courtenay, BC",
        "Type": "out-and-back"
    },
    "title": "Mt. Regan",
    "trail_id": "5211"
}