{
    "description": "Note - time and distance are for a 28km loop. Total elevation gain for this day is about 4,600', would be 5,200' if Mt Anderson is included.\nMounts Bauerman, Kootenai Brown, Lost and Anderson form a continuous chain of mountains in the Red Rock Canyon area of Waterton Lakes National Park. What differentiates this outing from just another ridge walk is the fact that these are all named peaks, the elevation gain and loss is more than normal ridge walks and they are all geographically individual in character.\nThere are two ways that this trip can be approached. It can be done east to west with Mount Anderson being the first or vice versa with Mount Bauerman being the first. The east to west option is discussed under \"Mount Anderson-Lost Mountain\" here on Trailpeak.\nOn this day we decided to approach from the west. Both options start at the Red Rock Canyon parking area. The Twin Lakes Trail is a 25km loop which actually circles these four mountains. So you could approach from the north or the south. We took the Blakiston Creek side of the loop and travelled in from the south side of the mountains (see map). This 11.5km trail in is mostly flat, rising in the last 2-3km to an obvious high point above Twin Lakes called the Bauerman Divide. Here you will also find a large cairn. There is no other reason for this cairn than to indicate that it is the high point and to turn up the ridge onto Mount Bauerman. Those who aren't climbers and wouldn't think to leave the established park trails are merely left to wonder why it's there.\nThe trail up to Mount Bauerman is about 2km, straight forward and not steep at all. It's the easiest part of the day. So if you just want a long day in the mountains with an easily attainable summit, this one is for you. Angle left when you head into the trees. You will eventually come a trail at the top of the cliff above the Bauerman Creek side of the range with nice views of Twin Lakes below. Follow this trail up until it opens onto open rocky slopes on a nice broad ridge. Follow this ridge to the summit. There is nothing there to mark the spot except a little pile of rocks. Summit #1 for the day.\nOur second peak of the day was Kootenai Brown Peak. This is not the official name at this time but hopefully soon will be. This peak is about 3.5km from Bauerman and involves about 600' of downclimbing and then about 1100' uphill. Although none of this trip is technical in nature some of the ridges we traversed could be a little daunting to those with vertigo problems. You don't really need to walk right along the cliff and you aren't right on the precipice anyway. That would be inviting disaster on a (typically) windy day. The lower part of the ridge is treed so can be a break if it's windy. Continue up this steepish slope out of the trees to a false summit. Turn left and continue on much gentler slopes to the true summit. We built a cairn and left a summit register here for future visitors. Summit #2 for the day.\nThe connecting ridge from Kootenai Brown to Lost Mountain is a straightforward down and up, but you have to divert to your right to get through some rock bands. Then angle left to get back to the ridge. from there it's a straight slog up through loose scree then bigger scree. finally, near the summit you will be on larger rocks/small boulders. Keep left for the most direct route to the summit. We took some photos, checked our time and decided we didn't have enough time to attempt Mt. Anderson and still walk out in the daylight. Summit #3 for the day.\nMount Anderson is straight ahead, probably 1.5 hours up and back if you have time. We dropped into the saddle between Lost and Anderson and then straight down the gully to the Twin Lakes Trail (same one we came in on). It takes us 3 hours to get down to the trail (we've done it twice now, that's how we knew we didn't have time for Anderson), then 1 hour back to Red Rock.\nNote - if you only plan to climb Lost and Anderson this descent route is the best, if not the most difficult way to do it. However, if you plan to do these 3 or all 4, this is the preferred route - west to east. We were unanimous about that.\nPhotos are not in order. Main (first) photo is looking back at Mt Bauerman en route to Kootenai Brown Peak. Second photo on top row is fianl approach to Kootenai Brown Peak.  Third on top row is Twin Lakes. Last photo top row is summit of Lost Mt, third of the day. First photo second row is point where you leave the Twin Lakes Trail to start up to Mt Bauerman. Fifth photo second row is dedication of Kootenai Brown Peak. Last photo second row is leaving Lost Mt toward saddle between Lost and Anderson. First photo third row is heading down the gully back to the Twin Lakes Trail, about 3,500'. Last photo is of Lost Mt from summit of Kootenai Brown Peak.\nEditor's Note: The track on the enclosed GPX file is more of a route, connecting the valid waypoints, it is not exactly the route walked.",
    "directions": "From Red Rock Canyon, cross the creek and take the left (south) trail to Blakiston Falls. Follow this trail for 11.5km to what's called (but not signed) Bauerman Divide. This is an obvious height of land above Blue Grouse Basin and Twin Lakes. There is a large cairn (photo) at the point where you will start up through the trees towards Mt Bauerman.",
    "geohash": "c2wz",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/5217/Bauerman-Lost.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5217/Galwey.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5217/reg_KB01-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5217/reg_KB02-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5217/reg_KB03-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5217/reg_KB04-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5217/reg_KB04a-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5217/reg_KB05-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5217/reg_KB06-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5217/reg_KB07-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5217/reg_KB08-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5217/reg_KB09-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5217/reg_KB11-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5217/reg_KB12-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5217/reg_best1_KB07a-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5217/narrow_KB10-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5217/narrow_KB13-7064.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/3-peaks-mount-bauerman-kootenai-brown-lost-and-anderson-near-waterton-park-gate-ab-5217",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 5,
        "Time": "14 hrs",
        "Total Distance": "28 km",
        "Town": "Waterton Park Gate, AB",
        "Type": "out-and-back"
    },
    "title": "3 Peaks - Mount Bauerman, Kootenai Brown, Lost and Anderson",
    "trail_id": "5217"
}