{
    "description": "Mt. Gould (West face approach):\nEl Gain: 3,600 ft; Dist.: apprx. 12 km roundtrip; Time: approx. 9-10 hrs.\nScrambling (Aug. 3, 2008) with the Glacier Mountaineering Society. \nFrom the Big Bend on the Going to the Sun Road, we followed the steep, slippery path alongside the stream that connects with the Highline Trail (took a good 45 minutes or so). From there, we followed the Highline Trail north until Haystack Butte. \nAt this point, it is a scramble up a series of class III and IV ledges up 3,000 ft to the summit cliffs. There is a climber's trail that skirts alongside the base of a short band of cliffs near the summit. We followed these south and took note of a series of rock cairns that lead us to a short pitch of class IV scrambling (these may or may not have been the best way to the top). Above this, it was a 5-10 minute slog on rubble to the summit. Awesome views of Bishop's Cap to the south, and aerial views of Grinell Glacier just to the east directly below. Grinell Glacier looks like it is melting and becoming another iceberg lake...\nWARNING: like many of the mountains in Waterton and Glacier, the ledges on Gould's West approach are covered with of loose rubble. We were a rather large group (11 people) and at various points, we had more than one near-miss rockfall incident. \nSee Gord Edward's \"A Climber's Guide to Glacier National Park\" for more on this route and other routes to the summit.",
    "directions": "Park at the Big Bend on the Going to the Sun Road, a few minutes down from Logan's Pass.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/MT/5219/long_IMG-4187-7490.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/5219/long_merged-shot-7064.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/5219/long_merged-shot2-just-below-summit-7064.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/5219/reg_IMG-4139-7490.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/5219/reg_IMG-4171-7490.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/5219/reg_IMG-4173-7490.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/5219/reg_mt-gould-from-grinell-glacier-7064.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mt-gould-near-babb-mt-5219",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 4,
        "Time": "9 hrs",
        "Total Distance": "12 km",
        "Town": "Babb, MT",
        "Type": "out-and-back"
    },
    "title": "Mt. Gould",
    "trail_id": "5219"
}