{
    "description": "If you want a climb, this is the ride for you. If you want views, this is the ride for you. If you want a really fast, rarely ridden descent, this is the ride for you (Trail submitted by Sharon Bader of NSMBA.bc.ca).\r\n\r\nA 7 hour ride including 3 to 3 1/2 hours of climbing, one hour of looking for the ridge trail (but now you have our GPS points), the remaining 3 hours or so riding along the ridge, then descending down Mt. Thurston and a road ride back to the cars.  \r\n\r\nIf you can't spend about 7 hours in the saddle, some pushing, some hike a bike with the threat of getting lost always present, this is not the ride for you. If you are faint of heart, stay away. \r\n\r\nWe started at the waypoint marked PARK, then rode up the Mt. Thurston FSR. Along the ridge line to Elk Mt.  It should be noted that the terrain is very technical past Elk mountain--this section does not support biking traffic but HIKING traffic for more than 200 vertical metres.  The trail is very steep and stairs sometimes exist along with scree, with potential unimpeded tumbles occurring if a fall is taken.  However, beyond this section about 2 km, it is possible to ride. Show trail savvy and get off your bike if you encounter other traffic--it will be appreciated.  Another alternative is to descend off of  Mt Thurston--consult Greg Maurer's Mountain Bike Adventures in SWBC which provides a great descent and less road riding back to your parking spot at Chipmunk Creek, and then back down to Chilliwack Bench FSR back to the car. The Mt. Thurston Forest Service Road (FSR) is where we climbed our 1200 meters elevation to a high point of 1570 meters. \r\nThe ride starts off with a lot of climbing, with no need for a helmet here except for the motor bikes that would come up to you really slow and then when they were right beside you they would accelerate. Non-skilled idiots.  \r\n\r\nThen when you thought it was over, the mountain opened up and you climbed some more.  So when we started looking, we could see the ridge but then it would disappear, so we would stop and look again.  We eventually found the ridge after a few wrong turns.  \r\nEventually we went back to the road and found the REAL hike a bike up. \r\nOnce on the ridge, we could enjoy ourselves and the view more since it was ALL DOWNHILL FROM HERE! Famous last words... It was mostly downhill, but it still took another three hours to get back to the car.\r\n\r\nTry not to be distracted by the views too much.  Views of Slesse Mountain and Cultus Lake, and Mt. Baker abound.  Of course we had to stop at the top for the group shot!  \r\nThere was one technical section that most of us walked since we were not in the 'zone' except of course for Lee and Ken who tried to ride the stairs of despair!\r\nFrom the road we could see where we were (the high knob on the ridge).  Are we good or WHAT!  Now you won?t have to suffer all of this as of course; you can simply follow the waypoints.\r\n\r\nAbout 7 hours and maybe 20 km later we got back to the car and had to find a place to eat in Chilliwack - the heart of truck stop redneck country - which is an adventure in itself.  But that has nothing to do with biking so we will leave that subject alone.\r\n There is GPS data attached to this trail (see \"download GPS\"), which if loaded into your GPS can help you find route points.",
    "directions": "Hwy 1 East to Chilliwack, find the Thurston FSR (as per map above), and park your car at the camp/tent sites near the Junction.  Climb.\r",
    "geohash": "c29r",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/522/long_group.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/522/long_topoThurston.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/522/reg_leeonridge.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/522/reg_ridegetop1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/522/reg_ridgetraildown.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/522/reg_technicalridgeriding.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/522/topo_ridgeviewdescentkn.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mt-thurston-near-chilliwack-bc-522",
    "stats": {
        "Activities": "mtn-bike",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 5,
        "Time": "7 hrs",
        "Total Distance": "20 km",
        "Town": "Chilliwack, BC",
        "Type": "out-and-back"
    },
    "title": "Mt. Thurston",
    "trail_id": "522"
}