{
    "description": "This is the central part of the trail that goes north-south along the mountains on the west side of Alta Lake Road, west side of Whistler.\r\rThis section from Alpine Meadows to Function Junction is an enjoyable 18 km \"walk\". It has total ascent of appox 800 m, but over 18 kms, that's not all that much. The ascent is concentrated in 3 areas, as you start out from Alpine Meadows, in the Rainbow Lake area, and, if you start from Function Junction, from that end.\r\rIt's probably easier to do from north to south (Alpine Meadows to Function Junction), as that direction has less uphill, more downhill, as it starts at 725 m, whereas Function Junction is down at 615 m. Top point between Alpine and Rainbow Creek is 1125 m, wheras top point from Rainbow Creek to Function Junction is 1020 m. the drop at Twentyone Mile Creek is to 765 m.\r\rAlpine Meadows TH is at the top of Alpine Way, at the north end of Whistler. You have 2 choices: 1) the \"2 car\" method\", with 1 car at each end, of 2) busses. Busses go from the bus loop in Whistler to both Alpine Meadows (a couple blocks away) and Function Junction (literally at the trail head).\r\rThe trail has a few excellent viewpoints and creek crossing, including Twentyone Mile Creek, approx 1/2 way. For the lazier types, start at the  Rainbow Lake TH along Alta Lake Road and either go north to Alpine Meadows, or south to Function Junction. Watch for bikes and bears, in season.",
    "directions": "Alpine Meadows TH is at the top of Alpine Way, at the north end of Whistler. You have 2 choices: 1) the \"2 car\" method\", with 1 car here, and one car at Function Junction, or 2) busses. Busses go from the bus loop in Whistler to both Alpine Meadows (a couple blocks away from the TH) and Function Junction (literally at the trail head). Function Junction TH is at the first corner on the left as you enter Function Junction (it is marked). If you start at Function Junction, go west at the junction for Alexander Falls/Alpine Meadows (ie, do NOT go to Alexander Falls, go the other way).",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/5220/reg_FlankTr6248-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5220/reg_IMG-4057-6103.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5220/reg_P9170091-20243.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5220/narrow_FlankTr6246-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5220/narrow_FlankTr6251-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5220/narrow_P9170098-20243.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/flank-trail-central-section-near-whistleralta-lake-bc-5220",
    "stats": {
        "Activities": "mtn-bike ski-xc hike snowshoe",
        "From": "",
        "Seasons": "summer winter",
        "Stars": 4,
        "Time": "5 hrs",
        "Total Distance": "18 km",
        "Town": "Whistler/Alta Lake, BC",
        "Type": "out-and-back"
    },
    "title": "Flank Trail, Central Section",
    "trail_id": "5220"
}