{
    "description": "An arduous trail with great rewards, fantastic views of Black Tusk and of Helm Glacier.\r\rIt's 1.5 of easy walk from Cheakamus Lake TH to the Helm Creek Junction, where you turn right (south), cross the Cheakamus River and start uphill for approx 2 kms and 400 m over some rooty and rocky track. The trail then levels off for another 5 kms of gentle uphill to Helm Meadows and campground (see photo). Expect some mud over the flatter parts of the trail. Another 1 km further along the trail and you arrive at the big rock by the trail (see photo). Make sure you take in the fantastic views of Black Tusk along the way.\r\rFrom here, you turn left and head east through the meadows (no marked trail, follow the GPS data), till you arrive at an east-west moraine. Climb up onto the ridge of the moraine (see photo) and head straight ahead towards the ridge up ahead. At the top of the ridge, you'll see what you came 11.5 kms for, the Helm Glacier (see photo). You can go down to and onto it, but BE CAREFUL. Pls do NOT venture onto any glacier unless you know what you're doing.\r\rTotal elevation gain is approx 1000 m. Be prepared for all weather conditions, from searing sun to freezing hail storms. The campground is wide open, so don't expect much shelter there (see photo).",
    "directions": "At the Function Junction lights at the south end of Whistler, go east for 500 m, turn left onto the Cheakamus Lake Road, and drive the quite rough 7 kms to the Cheakamus Lake TH (although the road is rough, it's regular car driveable). Parking fee required.\r\rHead east on the trail towards Cheakamus Lake for 1.5 kms, and turn right at the marked junction that says \"Helm Creek 7km\" and \"Garibaldi Lake 16km\". Cross the red metal bridge and away you go.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/5222/reg_Helm6256-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5222/reg_Helm6268-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5222/reg_Helm6272-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5222/reg_Helm6287-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5222/narrow_Helm6266-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5222/narrow_Helm6281-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5222/narrow_Helm6289-7359.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/helm-glacier-near-whistler-bc-5222",
    "stats": {
        "Activities": "ski-bc hike snowshoe",
        "From": "",
        "Seasons": "summer winter",
        "Stars": 4,
        "Time": "7 hrs",
        "Total Distance": "23 km",
        "Town": "Whistler, BC",
        "Type": "out-and-back"
    },
    "title": "Helm Glacier",
    "trail_id": "5222"
}