{
    "description": "Probably the best, closest, easiest to access all singletrack trail in the area if you want a short ride.  This is mostly a biking and walking trail (1 hr is for bike BTW), I'm not sure if there is often enough snow to snowshoe.  Close to Calgary (51km from COP intersection), and as of Summer '08, pavement right to it's front door, so perfect for after work rides in the fall.  It is a 10km loop with a shortcut roughly in the middle.  ~260m of cumulative climbing (Easy!) virtually all if it rideable by your average rider.\r\rYou can ride this in the early winter, it freezes but doesn't get snow till well into winter.  After the recreation areas are gated for the winter, you can park on the road between the short cuts and you are in the middle of a figure 8.  The great thing here is you are never more than about 2.2km from your car should you need to walk out.\r\rWith the sweet, new, pavement, I can see the interest in and use of this trail going WAY up.\r\rCurrent conditions:",
    "directions": "Drive West of Calgary on Hiway #1 and look for the Sibbald Trail - Hiway 68 exit (AFTER the Jumpingpound Road).  It is 21km West of the Calgary Olympic Park intersection.  Take the exit, go under the highway for about 30km to the pinetop Recreation Area.  If this is gated you can park on the road there or a further 2km West to get in the middle of the figure 8.",
    "geohash": "c3n6",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/5223/mountainbikingjumpingpoundloopkananaskismarryandmoosemntjun202021.JPG",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5223/mountainbikingjumpingpoundloopkananaskismarrydownnicepoplarsforestjun202021.JPG",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5223/mountainbikingjumpingpoundloopkananaskisopenviewshalfwayjun202021.JPG"
    ],
    "source_url": "https://trailpeak.com/trails/jumpingpound-loop-near-calgary-ab-5223",
    "stats": {
        "Activities": "snowshoe hike mtn-bike",
        "From": "",
        "Seasons": "winter fall summer",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "10 km",
        "Town": "Calgary, AB",
        "Type": "out-and-back"
    },
    "title": "Jumpingpound Loop",
    "trail_id": "5223"
}