{
    "description": "Mount Bailey Trail is a moderate hike, 7.5 km return. This trail travels through a forest of Sugar Maple, Yellow Birch and Beech trees to the mountain peak where the trees suddenly change to stunted White Birch, Pine, Cherry and Mountain Ash. Your climb to the peak at 563 meters is a 1.6 km side trail (round trip) that rewards you with a beautiful view of the surrounding mountains including Mount Carleton, and perhaps a glimpse of a moose or deer in the beaver ponds below. The trail should take about 3.0 hours to complete and loops back to the parking area.\nThis trip was an 80th birthday present for my mother, ?Wheet? Wilcox, from me and my sister, Karen (Trail name \"Twisted Sister No. 1\"). Mom's wanted to climb Mount Carleton, the highest mountain in the Maritimes, for a long time so this was finally supposed to her chance. But when we got there, the trails to Mounts Carleton, Head & Sagamook were all closed, and we had to settle on the fourth highest mountain in the Maritimes, Mount Bailey, instead.\nWe had a great day on the trail and thankfully, both the rain and heat held off. There?s a picnic table at the summit so we ate our lunch in comfort while enjoying the view of the surrounding mountains. There?s also a geocache on the summit and Karen was the ?First to Find? it. On the way back down, Karen, Gabe (my beagle) and I took a side trail straight up a rock scramble to a ridge that offered an incredible view of the Appalachian Mountain range and overlooked the valley below. You can walk along the ridge and join up with the main trail further along but we went back down the way we came and continued on with Mom.\nAltogether, we spent three days in the park. Karen and Mom are avid geocachers so Friday we hiked out to Pine Point in search of our first geocache. Karen found that one. On Saturday, we went to Nictau and dropped in on Bill Miller of Miller Canoes, who?s a fine friend and trail angel from my IAT thru-hike of 2002. He kindly lent us a canoe and we spent a leisurely afternoon canoeing down the famous Tobique River. Then, we hiked to the top of Trafton Mountain near Nictau and I had the tremendous honour of finding our second geocache. The views from up there were incredible even though dark clouds threatened rain. The next day (Sunday) we hiked to the top of Mount Bailey and as you know, Karen found our third geocache at the summit. And Sunday night, after climbing the fourth highest mountain in the Maritimes, we still had enough energy to go to William Falls and look for our fourth and final geocache. We didn?t find this one, though, simply because it rained earlier and we didn?t want to get our clothes wet.\nSo, it was a great trip and my mother never ceases to amaze me. Mount Bailey may be smaller than Mount Carleton but it?s reportedly more difficult and not surprisingly, she \"bagged\" it with ease. She really is an amazing woman who passed her love of the outdoors and nature on to her children. So, I guess we'll have to bag the \"big one\" next year for her 81st birthday, and there?s still that geocache at William Falls to find.",
    "directions": "From north or west: Route 17, in Saint-Quentin, exit onto Route 180, to Route 385.\nFrom east: (at Bathurst) Route 180, then Route 385.\nFrom south: (at Perth - Andover) Route 109, to Plaster Rock, west on Route 108, onto Route 385.",
    "geohash": "f82m",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NB/5225/reg_100-0929-26282.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/5225/reg_Long-Ways-Down-17579.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/5225/reg_Mt-Bailey-Summit-17579.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/5225/reg_Mt-Carleton-17579.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/5225/reg_P1020333-17579.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/5225/reg_View-fr-Bailey-1-17579.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/5225/reg_View-fr-Bailey-2-17579.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mount-bailey-mount-carleton-provincial-park-new-brunswick-near-saint-quentin-nb-5225",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "8 km",
        "Town": "Saint-Quentin, NB",
        "Type": "out-and-back"
    },
    "title": "Mount Bailey, Mount Carleton Provincial Park, New Brunswick",
    "trail_id": "5225"
}