{
    "description": "Across the valley from the Ski area of Whistler-Blackcomb are Rainbow and Sproatt Mountains. The North Flank of Rainbow Mt. lies about 6 km past the Village on Hwy 99. The South Flank of Sproatt ends at the Callaghan Valley (Proposed XC Ski area when Whistler gets the Olympics) about 15 km south of the Village. \nYou see this range whenever you ski, and whenever you ride. Now there is a trail that traverses the two peaks, delivering exceptional views back on Whistler and Blackcomb. The Rainbow-Sproatt Flank Trail is 45 km long, with lots of switchbacks up and down.  It has a 1500 meter high point at 16 mile Creek. You lose and gain 700m of elevation no less that three times on this ride. \nA cross-country epic that calls your name.  And so it begins?? We ride to the trail head, a nice 16 km warm up then we start to climb up the Cougar FSR.  When we went the first time, in spring, the creeks were raging (which is a good thing in spring). We could stop and rinse off our sweat for a reprieve from the mosquitoes that are attracted to your hot sweaty body.  Then we continued to climb! To the right of us is the Soo Valley. Through here you can ride to Pemberton. A logged out area with second growth throughout but a small stand of ancient cedars was left for people to see. We didn't go there since no bikes were allowed. Next time.\nThe snow wasn't quite all gone either.  Here we're at 1100m elevation. It can't be that bad higher up, can it? (If you notice the red blush on the snow, that's a red Algae that sporulates in spring during the melt). Alas the snow stopped us this ride, but we came back later in the summer to do more.\nThis trail can be divided into 4 sections. \nCougar -> Alpine Meadows(too much snow when we went)Alpine Meadows -> Rainbow Meadows\nRainbow Meadows -> Function Junction \nFunction Junction -> Alexander Falls (Callaghan Valley)\nThe trail is fairly well marked, but take topo maps, compass, and perhaps GPS, and sufficient warm clothing and food.  Flank is used as the access to a large number of downhill trails, and has a number of other access points from the valley, so it is easy to get confused and off track in many places along the trail.\nFrom the south, the following trails drop off Flank Trail:\n\nIndustrial Disease\nHigh Society\nCheap Thrills\nStonebridge Estates connector\nRainbow Lake Hiking trail (up)\nWhip me Snip me\nBinty's (access to Billy Epic and Bob's ReBob)\nRick's Roost\nCouger Mountain FSR\n\nNote: the gps file for this track is incomplete, containing only the northern section, and a section between Stonebridge Estates and Industrial Disease.",
    "directions": "Access to the Flank Trail can be found on Alta Lake Road (west side of Whistler Valley)  Look for Cougar FSR, ride up the double track.  The trail entrance is marked. \nNote: the Couger Mountain FSR is also the starting point for Thrill Me Kill Me which runs just north of here.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/523/reg_climbmore.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/523/reg_flank-cheap-thrills-trail-head-0120m-6103.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/523/reg_flank-high-society-trail-head-0123m-6103.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/523/reg_flank-industrial-disease-main-entrance-0148-m-6103.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/523/reg_flank-industrial-disease-northern-entrance-0145-m-6103.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/523/reg_flank-stonebridge-estates-connector-0119-m-6103.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/523/reg_flank-trail-pica-on-side-of-trail-0138m-6103.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/523/reg_flank-trail-view-of-black-tusk-0124-m-6103.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/523/reg_group16m.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/523/reg_llflankswitchback.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/523/topo_sbrainbow.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/rainbow-sproatt-flank-trail-near-whistler-bc-523",
    "stats": {
        "Activities": "mtn-bike hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 4,
        "Time": "5 hrs",
        "Total Distance": "45 km",
        "Town": "Whistler, BC",
        "Type": "out-and-back"
    },
    "title": "Rainbow-Sproatt Flank Trail",
    "trail_id": "523"
}