{
    "description": "NTS Map:92C14, NTS Map:92C11, NTS Map:92C10, NTS Map:92C9.  The West Coast Trail (WCT) is one of the holy grails for hikes in the Pacific Northwest.  The trail stretches 77 km between Port Renfrew and Bamfield.  The trail has a unique combination of qualities: the marine life of Pacific Ocean, Carmanah rainforest, beach camping, and last but not least the chance to interact with hikers from all over the world.The West Coast Trail is a unique experience for everyone.  Below I'll provide a narrative of my own experience, and then I'll have a list of some of the references we have used.Day 1 (Port Renfrew - Thrasher Cove)Our seven day trip began on the south end of the trail.  The day before we stayed in the hostel in Victoria, and then took the WCT Express private shuttle to the trailhead.  Once we got off the bus, a short 10m dash proved to be very worthwhile - we got the last four standby spots of the day.  I have to say sorry to the other two on the bus, but only the early birds get the worm!So with our 40 lb packs we started the long-anticipated hike.  The first day was relatively uneventful.  One highlight was the relic donkey engine.  We passed by the rusted beast and fiddled with some of the levers, then decided we didn't know what we were doing.  The rest of the day was mostly complaining about the heavy chocolate puddings we brought, and worrying about fellow hikers catching up to take all good campsites.  It turned out there were about 20 tents at Thrasher that night anyway.Day 2 (Thrasher Cove - Owen Point - Camper Bay)We had an early start in the morning to head for Owen Point, which turned out to be my personal high-point of the trip.  Around Owen Point was a land filled with strange sandstone formations, which someone named aptly as \"moonscape\".  Often, inside the holes were tidal pools that were the habitat to a zillion tiny life forms, including; sea urchin, crabs, fishes, sea weeds, etc.  And of course there were also the bigger sea stacks, caves, and surge channels.  Sights that drew 'woo' and 'waa' from me who spends most of my life on firm ground.Day 3 (Camper Bay - Logan Creek)Day three was our official ladder day.  Those scary pictures in the WCT reference books were coming to life in vivid detail - ladder after ladder of many steps.  Definitely not for the faint of heart, or else bring your son to carry your pack; that was one lady's solution.  At the end of the day, we camped at Logan Creek.  A quiet place with a splendid view of the ocean.Day 4 (Logan Creek - Carmanah - Cribs)The day after ladders was the day of boardwalks.  Lately the park office had done a marvellous job in upgrading these planks.  There were also plenty of beach walks to be had.  The sound of crashing waves and numerous treasures scattered on the sand could stray anyone off the main trail for hours.  Of course the day is not complete without a visit to the best-known secret on the trail - a hearty burger meal at Chez Monique's, a restaurant opened by a friendly woman (with good business sense too) in the Indian reserve area.Day 5 (Cribs - Cheewhat - Nitinat Narrows - Tsusiat Falls)Today we walked from Cribs through Cheewhat, which in native means \"urine\" and yes, I can assert that the river did taste odd, through to Nitinat Narrows.  The area is mostly reserve lands.  At the narrows, there is another local guy named Carl that took us to the other side with his motorboat.  Carl also sold dungeness crabs at $12 ($30 in Victoria), which was probably one of the most fresh and delicious seafood meals I've ever eaten - straight out of the sea!Day 6 (Tsusiat Falls - Tsucowis)We spent the morning lying around Tsusiat Falls, the most popular campsite along the trail.  Here we saw the wide curtain-style waterfall meeting the ocean, and best of all, we are camping right next to it.  Some of us took the opportunity to wash ourselves clean and others went to see the \"Hole-in-one\", a big stone arch carved out by the ocean.  Far away, there were also plenty of whales swimming and they often squirt water out of their breathing hole or flap their tails.  And don't forget to check out the classic outhouse at Tsusiat!Day 7 (Tsucowis Creek - Bamfield trailhead)The seventh and last day of the trip and it was still sunny like all the other days.  The last day was a race-against-time trail speed walking race to try to catch the shuttle back to civilization.  The difficult task is made worse by the fact that we tried to solve our hunger problem by eating all the freeze-dried food left--not good for the stomach.  But we did make the bus and then made the ferry, and caught the second bus to downtown Vancouver.  Nothing now seemed impossible to us who had just completed this awesome trail. There is GPS data attached to this trail (see \"download GPS\"), which if loaded into your GPS can help you find route points.",
    "directions": "To get to and from the trail, it seemed most sensible to use private shuttle.  They are expensive, but shuttling by yourself is difficult because of the long distance involved.  Hitchhiking is also an option, but there wasn't much traffic on these roads.Reservations are recommended for the trail.  However, my personal experience of standby is fine too, especially if you are unsure of the dates.  You have to be flexible and be able to wait a few days, but at the end, you will get a spot.  This being said, there were still stories on the trail where people have waited for a week with no luck.Finally, I'll provide a breakdown of the costs and a few of the reference books we have used.$ 2.50 Bus fare to Twassawan$ 10.00 BC-Ferry From Twassawan to Swartz Bay$  2.50 Bus fare From Swartz Bay to Downtown Victoria$ 20.00 Youth Hostel in Victoria$  5.00 Breakfast in Downtown Victoria$ 35.00 Shuttle from Victoria to Port Renfrew$ 70.00 Admission Fee for WCT$ 10.00 Nitinat Narrows Indian Reserve ferry crossing?$ 15.00 Restaurant food at end of trail$ 55.00 Shuttle from Bamfield to Civilization$ 10.00 BC-Ferry from Vancouver Island to Mainland$ 2.50 Bus fare from Twassawan back home. Hiking On the EdgeIan Gill and David Nunuk, 3rd editionThe West Coast TrailTim Leadem, 8th editionBlisters and Bliss A Trekker's Guide To the West Coast TrailDavid Foster and Wayne Aitken",
    "geohash": null,
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/524/reg_West-Coast-Trail-2007-089-13979.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/524/reg_West-Coast-Trail-2007-174-13979.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/524/reg_wct7.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/524/topo_WestCoastTrail_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/524/narrow_West-Coast-Trail-2007-030-13979.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/524/narrow_West-Coast-Trail-2007-076-13979.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/524/narrow_West-Coast-Trail-2007-254-13979.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/524/narrow_wct2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/524/narrow_wct3.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/west-coast-trail-near-victoria-bc-524",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 5,
        "Time": "49 hrs",
        "Total Distance": "77 km",
        "Town": "Victoria, BC",
        "Type": "out-and-back"
    },
    "title": "West Coast Trail",
    "trail_id": "524"
}