{
    "description": "Trail 100 is actually a network of trails extending off of the main trail that runs through the Phoenix North Mountains Preserve in Arizona. This area is popular for local hikers and might be considered similar to the \"North Shore\" for local Vancouver hikers.  Exploring the area is great fun.  More maps and information here  North Mountain. The geology of this area is varied. North Mountain itself is composed mostly of ancient metamorphic rock dating to the Pre-Cambrian Period. Gneiss (alternating light and dark bands) and schist (highly compressed and layered) predominate. Shaw Butte is similar, but has a bilayered cap of much younger quaternary or tertiary volcanic ash and basaltic lava. The huge time gap between the layers, as well as the isolation of the lava flow, give stark testimony to the power of erosion operating over 100's of millions of years.  North of Mountain View Park there is a large earthen dam that helps reduce flooding for nearby homes. A thick layer of fine soil has collected behind it and this traps a lot of moisture beneath that plants with long root systems can tap. There are Mesquites, Blue Palo Verdes and Salt Bushes growing behind the dam. There is GPS data attached to this trail (see \"download GPS\"), which if loaded into your GPS can help you find route points.For bike rentals: We rented in Scottsdale (near Phoenix) at AOA-adventures for great weekly rates on GIANT and Specialized, allowing you to ride nearby McDowell Preserve or South Mountain.",
    "directions": ".You may enter at the end of 40th St. south of Shea Blvd.  A small parking lot is also located of Tatum south of Shea.Alternatively, the North Mountain Recreation Area, with access just north of Peoria Avenue off of 7th Street, has plenty of picnic ramadas and a trail that is very popular, especially for people seeking a good workout hike. This trail is much easier and also less heavily visited than either Camelback Mountain or Squaw Peak. About 2/3 of the trail follows a blacktopped road to the towers at the summit. Parking is rarely a problem even on a pleasant Sunday in springtime!     Alternately, access to this area can be made from the south via Mountain View Park about 2 miles north of Dunlop on 7th Avenue. Yet another trailhead is provided on 7th Street just south of Thunderbird.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/AZ/526/topo_wwdove.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/trail-100-arizona-near-phoenix-az-526",
    "stats": {
        "Activities": "hike mtn-bike",
        "From": "",
        "Seasons": "spring winter fall",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "15 km",
        "Town": "Phoenix, AZ",
        "Type": "out-and-back"
    },
    "title": "Trail 100 (Arizona)",
    "trail_id": "526"
}