{
    "description": "NTS Map: 92J3The trail climbs steeply up through large timber.  It is muddy and there is a fair bit of deadfall on the trail.  After about 1.3 km, you enter into the meadows and the trail levels out.  Once out in the open you get views of Brandywine behind a couple of smaller peaks and a glacier.  Follow the creek to near the headwaters.  You can cut up the vegetated slope to the west or carry on to the talus slopes further north.  Head up the talus slopes to circumnavigate a small peak around the west side.  Watch for cairns once you reach the pass.  Gain the ridge that runs roughly north.  Follow this around to the summit.Once on the talus, the trail gets increasingly rougher.  The rocks you walk on get larger and as you near the top, they get sharper.At the top you will have excellent views of Mount Fee, Rainbow Mountain, Whistler, Black Tusk, and many others.  You can also look down into the valley you ascended and truly appreciate the elevation gain you achieved. There is GPS data attached to this trail (see \"download GPS\"), which if loaded into your GPS can help you find route points.",
    "directions": "Updated October 2010From the south, drive Hwy 99 to Brandywine Fall Provincial Park and continue past.  Approximately 2.7km past Brandywine Falls Provincial Park is an exit for Callahan Valley Road and Whistler Olympic Park. Take this exit and reset your odometer.800m turn left on Brandywine Mountain Forest Service Road.Continue to 1.4km where there is a hut / parking gate on the left side. The road forks at this point. Stay to the left just past this parking gate as the road opens up to a large open gravel parking lot. Drive through this gravel area to the far side.2.1km there will be a snowmobile club on the left hand side, continue driving along the road.2.3km the road narrows from 2 lanes to 1.3.2km the road opens up a bit with deactivated roads on either side of the main road, continue along BMFSR.4.8km there is a fork in the road, stay right.Just before a fork at 6.4km there is a sign on the left hand side indicating you are leaving the Whistler Community Area. Stay left at the fork. (The right hand option is marked as BR 2100.)6.5km there is another fork, stay right.7.2km you will pass a chain link gate on the right with a \"6.0km\" marker on it. Continue past this gate and drive up a steep hill.8.5km you arrive at the Brandywine Mountain Trail Head.Previous",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/527/long_Brandywinewpt.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/527/reg_104-0470_IMG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/527/reg_P1020344-23966.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/527/reg_P1020451-23966.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/527/reg_Picture-or-Video-030-23966.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/527/reg_Resizeof104-0463_IMG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/527/reg_Resizeof104-0467_IMG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/527/reg_brand3_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/527/reg_mead2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/527/topo_intomead.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/brandywine-mountain-near-whistler-bc-527",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 4,
        "Time": "6 hrs",
        "Total Distance": "12 km",
        "Town": "Whistler, BC",
        "Type": "out-and-back"
    },
    "title": "Brandywine Mountain",
    "trail_id": "527"
}