{
    "description": "Cape Broyle ? Outer Harbour\r\rIn order to do justice to the wonders of paddling in Cape Broyle, I?ve decided to break it down into two reports representing the inner and outer harbours. Both routes offer a great put-in at the public wharf in Cape Broyle if you are paddling on your own. You can also choose to explore with Stan Cook Sea Kayaking Adventures who provide guided adventures of the area.\rFrom the public wharf you can either begin by first touring the inner harbour or by paddling straight out through the narrows and along the south shore of the bay. Along the shore on the way out are several picturesque rocky coves such as Emerald Cove where legend has it that the pirate Peter Easton once lost a treasure of precious stones and Gallows Cove where many criminals of olde met their untimely ends when Cape Broyle was a bustling fishing settlement. Just past Gallows Cove lies a group of small grottos known as the Seven Sister?s. Local fisherman gave it this name because when the big swells roll into these future sea caves it sounds like seven sisters arguing amongst themselves.\rJust past the sisters lies Gentleman?s Cove where dramatic 260 foot cliffs rise up from the sea. Bald Eagles can often be sighted in this area, roosting just above the cliffs. At the far end of the cove lies a beautiful sea arch that you can paddle through in calm conditions. It can be very tricky in certain conditions and at low tide you may have to enter it from the other side in order to do some further exploring. \rAfter paddling past (or through) Gentleman?s Cove you will come to the gem of Cape Broyle Harbour, Freshwater Cove. Here a wide rocky beach with a stunningly beautiful 110 foot waterfall sits adjacent to several large sea caves. In this authors opinion Freshwater Cove is the best place to camp in Cape Broyle and makes a great base for further exploration of the area. The caves are particularly interesting. There are four in all but only two of them can be safely paddled, and then only in calm weather. The two bigger caves are known as Capelin Cave and Dragon?s Throat. Capelin Cave is closest to the waterfall and has a small gravel beach at the back that Capelin (a small fish) use to spawn. In July you can often spot dozens of the tiny fish hanging out at the bottom of the cave. A little further out the Dragon?s Throat starts out nice and wide but about fifty feet back it gets pretty narrow and can become quite dangerous so I advise staying in the main section of the cave. The cave walls are alive with marine life including mussels, anemones, and sponges. After adjusting to the light you can often see fish swimming beneath you as well. Exploring sea caves is an amazing experience but it should not be tried by amateur paddlers without a professional guide. A friend recently gave me a good proverb that sums it up: ?A wave in a cave is a certain grave.? This is a good one to live by for sure.\rIf you continue from Freshwater Cove you will pass by a nice keyhole arch before coming upon Lance Cove and Little Lance Cove and a large sea stack known as Long Will. The British Navy once used Will for cannon practice but still he stands-a monument to the ruggedness of this coastline. Lance cove itself is a wide sandy beach that connects with a section of the East Coast Trail. It is also a great place to see whales! In July, Humpback and Minke whales can often be sighted herding the Capelin in these waters. Watching these giant beasts from a kayak can be quite unnerving at first but I have never experienced anything as magical as seeing a curious fifty tonne leviathan surface for a quick peek just a few short feet away.  There are plenty of whales around in the summer and it is important not to harass them but if you keep your distance they will often succumb to their own curiosity and come quite close to investigate. \rAfter Lance Cove you paddle past a rugged area of sunkered rocks and needles (worn down sea stacks) known as Shipwreck Point. There can often be strong rebounding waves in this area so you may want to stay wide of the point on rougher days. On the other side of Shipwreck Point lies Church Cove, where fishing schooners used to congregate on Sundays for mass. This is another great place for whales and when the Capelin are in it is alive with sea birds of all sorts. Puffins, Kittiwakes, & Murres are the most abundant but there are dozens of migratory species that pass by eastern Newfoundland throughout the year.\rAt the eastern edge of Church Cove near the very tip of Cape Broyle lies the biggest cave in the harbour. Buried in the solid rock is a huge vaulted 20-30 foot cave called the Cathedral. The walls of this cave are lined with the fossilized remains of a sandy beach and you can easily see the ripples that were formed by the washing of the waves millions of years ago. At the back of the cave lies a small hidden entrance known as the Confessional that can be paddled in calm conditions, bringing you back into Church Cove.\rAfter exploring the Cathedral you come to the very end of the harbour and into the wild Atlantic. Here the swell grows considerably and nobody but expert kayakers should be paddling this far out. It always amazes me to look out there and know that if I pointed my bow into those waves my next stop would be Ireland! \rFor less experienced paddlers you may want to turn back here and paddle straight back into the inner harbour. The more adventurous soul might want to make the 2.5km crossing of the outer harbour and paddle back along the north shore. At the far end lies Brigus Head, another good whale-watching area. From here you paddle past Island Cove and Admirals Cove where civilization begins to take hold again. The coastline is very rocky along the north shore but it does not have the geologic diversity that the south shore has. It does however have more historical significance as there were people fishing in Admirals Cove as early as 1630. At the end of Admirals Cove you pass by Sheep?s Head and back into the inner harbour. \rThe whole trip will be about 18km if you stay on the south shore or about 22km if you decide to cross to the north. I would allow 5-6 hours to complete the trip and maybe a bit more if you really enjoy exploring. It is a very scenic paddle with a wide variety of wildlife and geology and it is quite sheltered compared to other harbours in this area. It is very rugged with unpredictable weather and sea conditions, and should not be attempted by inexperienced paddlers without a guide. For more information on guided tours with Stan Cook Sea Kayak Adventures call (709)579-NFLD or visit www.wildnfld.ca.\r\rRyan Young\rNewfoundland Editor\r\r",
    "directions": "From St. John's take Pitts Memorial Drive for aprox. 9km and turn onto Route 3 South (The Irish Loop Drive). Continue south for 57km (45-50mins) until you reach the town of Cape Broyle. Take a sharp left turn at \"Best Friends\" onto Harbour Drive. Follow for 1km to the public wharf.",
    "geohash": "fb67",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NL/5282/reg_HPIM1393-8764.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/5282/reg_HPIM1399-8764.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/5282/reg_HPIM1498-8764.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/5282/reg_HPIM1511-8764.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/5282/reg_HPIM1516-8764.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/5282/reg_HPIM1520-8764.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/5282/reg_HPIM1731-8764.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/5282/reg_HPIM1766-8764.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/5282/reg_HPIM1807-8764.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/5282/reg_HPIM1827-8764.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/5282/reg_HPIM1860-8764.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/5282/reg_HPIM1972-8764.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/5282/reg_HPIM1975-8764.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/5282/reg_best1_HPIM1407-8764.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/5282/reg_july-08-009-8764.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/5282/reg_july-08-020-8764.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/5282/reg_july-08-024-8764.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/5282/reg_july-08-026-8764.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/cape-broyle-outer-harbour-near-cape-broyle-nf-5282",
    "stats": {
        "Activities": "sea-kayak",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 5,
        "Time": "6 hrs",
        "Total Distance": "22 km",
        "Town": "Cape Broyle, NF",
        "Type": "out-and-back"
    },
    "title": "Cape Broyle - Outer Harbour",
    "trail_id": "5282"
}