{
    "description": "Mt. Washington, up near the 'Forbidden Plateau' has some of B.C.'s best XC skiing, owing to the elevation, relatively flat skiing, and amazing views.\r\n\r\nNot fully discovered by the hordes, those who have XC skied here rave about it, and vow to return.  Although up in the Alpine, with some fast and flowy slopes, there are also large flat and rolling areas that allow you to get into the 'zone' and lose your worldly troubles.  Check out paradise meadows, and the Battleship lakes in the topo map above.  \r\n\r\nLots of variety, you won't be looping in circles trying to create variety out of the same 5 trails many do at Cypress.  Get out of the city, go find some of B.C.'s great XC ski areas; this is one of them.  Comox is a friendly town with some great restaurants and coastal charm.\r\n\r\nI skied 8 km of the area (a small fraction) during the snow-to-surf race, and the attached GPS data is for the XC ski portion.  Go practice for one of the most fun events in B.C.,held annually, for many years, and will be held for many many more.\r\n\r\nGreat day lodge for skiers, and with the increasing popularity, there will no doubt be many more kilometres being added to the XC ski trails there.\r\nThere is GPS data attached to this trail (see \"download GPS\"), which if loaded into your GPS can help you find route points.\r\n\r\nMount Washington Alpine Resort Web Site\r\n\r",
    "directions": "Get yourself to Comox/Courtenay on Vancouver Island, follow the signs to the Downhill ski area up on Mt. Washington.  Take the ferry from Horseshoe Bay to Nanaimo, and drive North a couple of hours to Comox.  Many B&B options, lodges, and hotels owing to the downhill skiing, and nearby towns.",
    "geohash": "c0y",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/529/reg_kurtski.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/529/topo_MtWashXC.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mount-washington-alpine-resort-near-comox-bc-529",
    "stats": {
        "Activities": "snowshoe ski-downhill ski-xc",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 5,
        "Time": "5 hrs",
        "Total Distance": "35 km",
        "Town": "Comox, BC",
        "Type": "out-and-back"
    },
    "title": "Mount Washington Alpine Resort",
    "trail_id": "529"
}