{
    "description": "If you were given infinite concrete, rocks, dirt, juniper bushes, cute Bunny Rabbits, little lizards, and landscape architects, you couldn't build a trail this good.  Bliss, pure, unadulterated bliss.  My only wish would be for it to be  longer.Horsethief is a 6.1km loop (with maybe 100m of total cumulative climbing) at the end of a 3.3km ride (about 160m cumu climb to get there & back) from Kokopelli's Trailhead parking lot.  AMAZING views and a hike a bike that no one can ride (can they? - yes it's been done) to get you down into the bench.From Kokopelli's trailhead, take the zig zag (two zigs, one zag) up over a little ridge to get to most of the trails.  You can drive up & down this road, however, no self-respecting MTBer that I saw did (however there were always a few vehicles back there - musta been the dog walkers).  35m of climbing gets you up and over this.  Now head West on Mary's Loop about 3km until you see the Texas Gate into Horsethief Bench.Horsethief Bench itself starts out with a serious hike-a-bike down a boulder field / pathway that looks like it was built by only knocking a few mega-Lego blocks loose from the cliff.  Once you get down, take a left at the Y (sign suggests that) and you're immediately into super flowey riding at the base of 60+ meter high cliffs looming over you.  Soon after that you open up to an amazing vista of the Colorado river 75m below you.  You can ride right to the edge (make sure your brakes work and you have no depth perception deficiencies before attempting this).  Continue along the edge for a couple km until you have to head inland up and around a coulee, then back, then back in and follow the cliffs back to the hike a bike back up.With kinda similar names, Rustlers & Horsethief, I wondered if they were the same trail with different names as a few trail reports I looked at lumped them together.  They aren't.  Both do start at Kokopelli's trailhead, but Rustlers Loop is an easier, warm-up ride slightly to the East of Horsethief.",
    "directions": "Take I-70 just a couple km west of Fruita .  Take the Loma exit (15) from the I-70 and turn to the South.  Just past the Interstate, there is a frontage road going to the right to the truck weigh scales.  Follow that road to just before the \"stay-to-the-left' sign and turn a hard left (South) into the gravel road.  If you only veer to the left you'll have to look like a dork & drive through the weigh scales in your VW Jetta (like I did).  Follow that road up to the first big parking lot (about 850m), the fabled Kokopelli's trailhead.",
    "geohash": "9wfw",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/CO/5309/reg_IMG-0028-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/CO/5309/reg_IMG-0029-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/CO/5309/reg_IMG-0030-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/CO/5309/reg_IMG-0031-5_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/US/CO/5309/reg_IMG-0032-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/CO/5309/reg_IMG-0033-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/CO/5309/reg_IMG-0034-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/CO/5309/reg_IMG-0035-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/CO/5309/reg_img246-6828.jpg",
        "https://trailpeak.com/storage//content/trails/US/CO/5309/reg_img247-6828.jpg",
        "https://trailpeak.com/storage//content/trails/US/CO/5309/reg_img249-6828.jpg",
        "https://trailpeak.com/storage//content/trails/US/CO/5309/reg_img252-6828.jpg",
        "https://trailpeak.com/storage//content/trails/US/CO/5309/reg_lizzie-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/CO/5309/reg_startofHorsethief-5.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/horsethief-bench-near-fruita-co-5309",
    "stats": {
        "Activities": "hike mtn-bike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 5,
        "Time": "1 hrs",
        "Total Distance": "12 km",
        "Town": "Fruita, CO",
        "Type": "out-and-back"
    },
    "title": "Horsethief Bench",
    "trail_id": "5309"
}