{
    "description": "Head up the Opabin West trail to marked intersection with All Souls trail. Continue over heavy scree (boulders) to the edge of the Hanging Gardens of Babylon. From here to the Prospect, mainly light scree, but the path is no more than twelve inches in width, and closer to eight in many places. \nThe Hanging Gardens of Babylon were not pointed on this journey, but apparently a must-see. Couldn't tell ya, sorry. Many waterfalls on the upper bluffs were frozen over and made for nice photos. Be sure to anchor yourself if you are taking pictures, as there is nothing on either side of the trail to stop you from over-balancing. \nThe Prospect allows 360 degree vistas of the valley and a lovely view down onto Lake Schaffer. \nThe trek down to Lake Schaffer was a bit hairy due to some snow and freezing rain the night before, but we threw on the Yaks and it was a decent hike down. Average maybe one foot horizontal to five vertical. (guess)\nFrom Lake Schaffer, there are two choices back to Lake O'Hara. We took the left trail past the Elizabeth Parker Hut - but Big Larches is apparently quite nice. Heavier hiking that route.\nElevation gain: overall 415m (1360 ft) - to All Souls Prospect. We made this in 4.5 hours, with half an hour for lunch at the Prospect. More seasoned hikers can power through this in as little as three hours, I am told.",
    "directions": "From Lake O'Hara Lodge:\nHead around lake to the right, follow markers to Opabin West.\nFrom Highway 1:\nTake Lake O'Hara exit (shortly after Lake Louise, heading west, shortly before Lake Louise, heading east). Buses available from parking to Lake O'Hara Lodge for day hikers. Not sure, but this might be by reservation - there is definitely a fee involved. Or you can hike in (11 km to Lodge). No vehicles other than Lake O'Hara Lodge bus and school buses for day hikers are allowed on the road to Lake O'Hara. In winter, cross-country skiing is the way in.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/5330/reg_All-Souls---At-the-Prospect-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5330/reg_All-Souls---View-of-Lake-Schaffer-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5330/reg_best1_View-from-Yukness-Ledges---All-Souls-Prospect-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5330/narrow_All-Souls---100-m-from-Prospect-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5330/narrow_All-Souls---View-from-Prospect-7064.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/all-souls-alpine-route-near-banff-ab-5330",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 3,
        "Time": "5 hrs",
        "Total Distance": "5 km",
        "Town": "Banff, AB",
        "Type": "out-and-back"
    },
    "title": "All Souls Alpine Route",
    "trail_id": "5330"
}