{
    "description": "This is the northern section of the Elaho to Meager Hiking Trail built by the Wilderness Committee.  This trip description includes the trail up to and just over the beautiful sub-alpine meadows of the Hundred Lakes Plateau, although the trail continues south through old growth Douglas Fir forests for another 10km.Since the bridge at Cesna Creek is out and there are no plans to replace it, the whole North-South traverse is no longer possible, although following Cesna Creek significantly upstream might bring you above the canyon and to a possible crossing location.  The trail can still be accessed from the north end, though, providing a great hike-in hike-out route.Original maps from when the trail was created can still be obtained from the Wilderness Committee.Directions to the trail head:** Update July 2014 ** In 2010 the road access via the Meager Creek Forest Service Road was washed out by a major debris flow on Capricorn Creek.  No plans are currently in the works that I know of to rebuild the road, although there are rumours of new trail access being built along the south side of the valley to bypass future landslides.  In the meantime, an account of some intrepid travelers' experience accessing the hotsprings can be found here: http://www.proudfoott.com/blog/2012/7/22/meager-creek.html.  From that point on the description below should still be accurate.  Definitely not easy to get to, but very rewarding if you do.  Happy hiking.** End of update **Check you odometer at the Petro-Canada Station on Hwy. 99 just before Pemberton.  Don't forget to gas up!  Drive into Pemberton (left at the Petro-Can off the Hwy).  About half a km in, there is a round-about that you will take towards the left.  At 1 km, turn right at the T-junction in town.  At 3 km turn left at the T-Junction onto Pemberton Meadows Road.  At 25 km, turn right onto the Upper Lillooet River Road.  At 34 km, keep left on the Upper Lillooet River Road and follow the signs for Meager Creek Hot Springs.  At 63 km, turn off the Upper Lillooet River Road onto Meager Creek Road.  The gate at the Lillooet River is closed indefinitely, so you will have to park and hike the last 15 km of road from here.",
    "directions": "See description and / or GPS",
    "geohash": "c2bp",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/5331/reg_Meager-Creek-013-8700.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5331/reg_Meager-Creek-015-8700.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5331/reg_Meager-Creek-042-8700.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5331/reg_Meager-Creek-045-8700.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5331/reg_Meager-Creek-059-8700.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5331/narrow_Meager-Creek-046-8700.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/hundred-lakes-plateau-near-pemberton-bc-5331",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 5,
        "Time": "28 hrs",
        "Total Distance": "54 km",
        "Town": "Pemberton, BC",
        "Type": "out-and-back"
    },
    "title": "Hundred Lakes Plateau",
    "trail_id": "5331"
}