{
    "description": "The Skyline trail series offers you a wonderful combination of choices. When you look at the maps you can decide on the type of hike you would like to do.  On this trail we will be hiking from Strawberry Flats to Lone Goat Mountain. This hike is commonly referred to as Skyline-2 or Skyline East. You may also want to hike from Strawberry Flats around to Spruce Bay, also known as Skyline-1, and then take the South Gibson trail back to Strawberry Flats.  This is a very popular route.If you are a die-hard you can also hike from Spruce Bay at Lightning Lake Campground, through Manning Park and into the Skagit River Valley ending up near Ross Lake.  This is an extremely long day hike or a great over-nighter. This trail is also referred to as Skyline West. Skyline-1 starts at Strawberry Flats until intersecting with Skyline-2 just above Despair Pass.Shortly after starting your hike you come to the first waypoint which branches taking you to either Shadow Falls or to Lone Goat Mt.  Stay left here and proceed to Lone Goat Mt. At the five km mark you are treated to beautiful views of your goal, Loan Goat Mt. and Snow Camp Mt. as well as Mt. Hozomeen and Red Mt.Carry on from here to about the six km marker where you intersect the Sky-1 and Sky-2 trails. Here you would keep to the right taking you through Despair Pass and ascending to Snow Camp Mt. (If you like you can go left here and follow the Skyline-1 trail a short distance,  where there are incredible views and sheer cliffs dropping approximately 300 meters to Thunder Lake.  Be VERY VERY careful here as the ledge is narrow and the drop severe!)    This is a great place for a quick break until continuing towards your destination of Lone Goat Mt. You may also want to plan for another short break on the top of Snow Camp Mt. where again you have beautiful views. As you approach Lone Goat Mt. you may use our point or pick whichever route appeals to you most to get to the top. Once you arrive at Loan Goat Mt. you are treated to spectacular views in all directions giving you an awesome place to take lunch before returning to Strawberry Flats.WAYPOINT NORTHING EASTING PHOTO# ELEVATION 001 5436827 0654597 1 4472 Ft 002 5436868 0654158 2 4462 Ft 003 5433635 0652139 3 5973 Ft 004 5432783 0650740 4 6160 Ft 005 5432952 0650446 5 6497 Ft 006 5432894 0650114 6 5880 Ft 007 5433045 0648658 7 6575 Ft Note if you click on the images, the name of the image corresponds to the PHOTO# written above (e.g. reg_4 is 4 above).  STAY OFF DA COUCH !",
    "directions": "Take highway # 1 until you get to Hope.                               From Hope follow Highway #5 to exit #177, which is Highway #3. Follow highway #3 east for approximately 67 km bringing you to Manning Park Lodge. Here you will take a right onto Gibson Pass Rd. Follow Gibson Pass Rd. for 8 km to Strawberry Flats parking lot. Here you will find the beginning of the trail which is waypoint #1 on the www.bchikes.com map",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/534/reg_1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/534/reg_3.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/534/reg_4.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/534/reg_5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/534/topo_7.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/534/narrow_6.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/skyline-2-near-hope-airport-bc-534",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 3,
        "Time": "8 hrs",
        "Total Distance": "21 km",
        "Town": "Hope Airport, BC",
        "Type": "out-and-back"
    },
    "title": "Skyline-2",
    "trail_id": "534"
}