{
    "description": "A famous ride in Moab area that starts from an easy-to-access lot on the highway and follows a jeep trail up to where you can ride or walk over to a pair of arches (one arch that eroded through at the middle I think) suspended over a 80m deep chasm.  Very scenic like much of Moab and an enjoyable, fairly easy ride with a bit of slickrock up near the top.\nThere is about 300m of climbing over the 12.6km trip to the bridges but it generally follows a 4x4 trail, so if you're looking for singletrack or remoteness, look elsewhere.\nIt gets dark pretty fast there & I was caught out and for the last 30 minutes, it was pitch black, very hard to ride as the lights from the highway made seeing the trail under me nearly impossible.  I followed the tracklog on my GPS for the bottom part of the trip back.\nThis trail is right beside:",
    "directions": "Drive North of Moab about 11km from the Hiway 128 intersection.  The Gemini trailhead is on the West side of the road right beside a RR crossing.  Park there (Donation or fee or something involved), ride across the tracks and turn to the South and follow the jeep road.\nAccommodations:\nA lot of people hiking and biking in the MOAB area stay at condos managed by www.moabutahlodging.com, speak with Andrea. They offer a range of in town homes and condos.",
    "geohash": "9w",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/UT/5342/reg_img220-6828.jpg",
        "https://trailpeak.com/storage//content/trails/US/UT/5342/reg_img221-6828.jpg",
        "https://trailpeak.com/storage//content/trails/US/UT/5342/reg_img223-6828.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/gemini-bridges-near-moab-ut-5342",
    "stats": {
        "Activities": "hike mtn-bike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "13 km",
        "Town": "Moab, UT",
        "Type": "out-and-back"
    },
    "title": "Gemini Bridges",
    "trail_id": "5342"
}