{
    "description": "This is the most northerly part of the East Coast Trail, from Pouch Cove north to Cape St Francis (the north point of the Avalon Peninsula) and then west to Cripple Cove.\nIt runs at times through forest, often in open area, occasionally over bare rocks, very often with great views of the Atlantic Ocean on the East and North sides, and Conception Bay to the East along the extension to Cripple Cove.\nIt's approx 6 kms from Pouch Cove to the road just south of Cape St Francis, and approx 500 m on the gravel road to the Cape, which you can climb. There is no longer a lighthouse on the Cape. Then walk south along the gravel road approx 1 km to the TH to Cripple Cove. Keep your eyes open for the TH on your right, you might walk right by it. The extension to Cripple Cove is approx 2.5 kms each way (5 kms return), but once again well worth it.\nYou will then have to walk 3.5 kms along the road back to Pouch Cove, unless you can arrange to either have someone pick you up (no cell phone service at this point), hitch hike when the occasional vehicle drives by or have parked a car at this point (Total distance if you walk back to the TH in Pouch Cove will be 16 kms). Make sure you stop for coffee and scones at the tea house on your left as you re-enter Pouch Cove.\nThere are a few geocaches along this trail.  This trail (leading out of Pouch Cove) is an example of world class trail construction by the crew at the ECT Association, and, they have found the perfect balance of leaving the trail as a trail, while ensuring it's safe, protected against erosion, and natural.  As an example, in some boggy areas, stepping stones are placed rather than boardwalk.  Where warranted, a form of stair has been constructed but again it's not boardwalk, it's log dug into the ground, with the blue tinged crush rock as the step, allowing for both drainage and longevity.  To the crew at ECT, well done!",
    "directions": "The TH is at the corner of Main Rd and Baldhead Rd in Pouch Cove, on your right near the north end of town. There is also a plaque at this point commemorating the loss of the schooner Waterwitch on Nov 29, 1875.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NL/5343/reg_DSC-1513-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/5343/reg_DSC-1514-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/5343/reg_DSC-1518-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/5343/reg_DSC-1524-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/5343/reg_DSC-1542-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/5343/reg_DSC-1547-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/5343/reg_DSC-1551-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/5343/reg_DSC-1558-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/5343/reg_DSC-1561-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/5343/reg_DSC-1564-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/5343/reg_DSC-1568-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/5343/reg_DSC-1582-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/5343/reg_DSC-1587-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/5343/reg_DSC-1591-5.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/east-coast-trail-pouch-cove-to-cape-st-francis-to-cripple-cove-near-pouch-cove-nf-5343",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 4,
        "Time": "5 hrs",
        "Total Distance": "13 km",
        "Town": "Pouch Cove, NF",
        "Type": "out-and-back"
    },
    "title": "East Coast Trail - Pouch Cove to Cape St Francis to Cripple Cove",
    "trail_id": "5343"
}