{
    "description": "The Moab Slickrock Trail is a relatively popular trail (to put it mildly).  A 15.8km loop, in a state recreation area, through an area shared with very nice 4x4ers, great views and interesting topography.  I keep expecting to see Wile E. splatter down beside me.\nIt may well be the best known MTB trail in the universe.  It is good, great even, but I'm not sure it totally deserves the 'rep to the point of overshadowing more than a dozen other equally great trails in the area.\nSlickrock, the sedimentary building block not the trail, is interesting to ride on.  As far as rock goes it may be the perfect riding surface.  For a prairie boy, it is really great to try this stuff out.  It's name came from what it is to horses hooves, especially when wet.  For Specialized Captains though, it don't get any better.\n101m  from lowest to highest but that doesn't tell the story.  It is pretty continuously up and down.  Great for riders who don't want to grunt endlessly up a hill and/or use up all that potential energy in one shot down.  It can be a little technical, many reviews call it difficult, advanced, etc. but I don't find it that tough.  If you are comfy doing little hops to get up onto ledges & over obstacles you will have to get off the bike less, but there is nothing out and out scary here that I could see.  I got a very nice round of applause from a group of 4x4ers who saw me grunt up a short (75m or so?) but steep little pitch (thanks guys).\nThe town (city?) of Moab is totally in tune with biking.  There are rental shops, gear stores, repair places on every corner.  The people are the nicest, the food is great and the beer...., well the beer.... - Did I mention you're in Utah?  3.2% is it, but a number of microbreweries make fresh, tasty beers to quench your thirst (and you can't drink enough to get stupid).\nThis trail is right beside:",
    "directions": "Basically right in the middle of Moab.  From any of the downtown streets, head East one block, go more South and look for the signs up to Slickrock and/or Sand Flats Recreation Area (and the recycling center).  Drive or ride up.  Pay your fee (U$5 as of Oct'08) and go about 1km further to the well marked Slickrock trailhead.\nAccommodations:\n\n A lot of people in the MOAB area stay at condos managed by www.moabutahlodging.com, speak with Andrea. They offer a range of in town homes to budget and upscale condos.",
    "geohash": "9wf5",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/UT/5344/reg_DSC06637-Medium--6828.jpg",
        "https://trailpeak.com/storage//content/trails/US/UT/5344/reg_IMG-1167-Medium--6828.jpg",
        "https://trailpeak.com/storage//content/trails/US/UT/5344/reg_img229-6828.jpg",
        "https://trailpeak.com/storage//content/trails/US/UT/5344/reg_img236-6828.jpg",
        "https://trailpeak.com/storage//content/trails/US/UT/5344/reg_img241-6828.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/slickrock-main-trail-near-moab-ut-5344",
    "stats": {
        "Activities": "hike mtn-bike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "16 km",
        "Town": "Moab, UT",
        "Type": "out-and-back"
    },
    "title": "Slickrock Main Trail",
    "trail_id": "5344"
}