{
    "description": "This is the 2nd most northerly part of the East Coast Trail, from Stiles Cove to Pouch Cove. It runs at times through forest, often in open area, occasionally over bare rocks, very often with great views of the Atlantic Ocean on the east side. There are great views of cliffs up to 100 m. above the ocean. You will occasionally walk right along the edge of some of these cliffs, as close as 1-2 m away, so be very careful. At one point, you will descend to Shoe Cove, a great place for lunch. On the way back up (heading north from Shoe Cove), after the 2nd switchback, be very alert for the right hand turn into the forest. Coming up from Shoe Cove beach, you will be walking on a road, and you could easily miss the hidden right hand turn into the forest.This is down Satellite Road, approx 5-6 kms south of Pouch Cove, maybe 10 kms north of Torbay. Satellite Rd runs east from the highway, and there is approx 600 m of trail from the TH to the sea, or the actual ECT. In Pouch Cove, the TH is right next to the post office. At the north end, for 500-600 m. from the post office, you will walk through private property along the ocean. ECTA has been given permission to allow hikers through this area. Pls respect the private properties to ensure access for future users.The trail, incl the 600 kms from Satellite Road to Stiles Cove is approx 10.5 kms, with total ascent of 600 m.As this is a 1-way trail, either have 1 car at each end, or arrange for someone to either drive you to the TH (having left your car in Pouch Cove) or to pick you up in Pouch Cove after the hike. I had no cell phone reception in Pouch Cove, so don't count on cell phones, but you might find a public phone or a very friendly Newfoundlander who will let you into his/her house to use their phone (we did this at Bay Bull, at the south end of the Spout Trail).We found this trail to be more beautiful than the Pouch Cove to Cape St Francis portion.For accommodation along the ECT, contact Elke Dettmer at Points East B&B in Pouch Cove, or via the website: www.pointseast.ca",
    "directions": "From St John's, drive north on Torbay Rd (Hway 20), approx 10 kms north of Torbay. The TH is on Satellite Road, which is approx 5-6 kms south of Pouch Cove and about 10 kms north of Torbay. Satellite Rd runs east from the highway and the TH right on the road, just after a nursery. There is approx 600 m of trail from the TH to the sea, or the actual ECT. In Pouch Cove, the TH is right next to the post office.  Or just get yourself to the pointseast B&B they will be your source of local hiking information.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NL/5347/long_ECTPC6375-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/5347/reg_DSC-1606-5_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/5347/reg_DSC-1611-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/5347/reg_DSC-1613-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/5347/reg_DSC-1630-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/5347/reg_DSC-1636-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/5347/reg_DSC-1639-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/5347/reg_DSC-1644-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/5347/reg_DSC-1668-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/5347/reg_DSC-1682-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/5347/reg_DSC-1689-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/5347/reg_DSC-1694-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/5347/reg_DSC-1704-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/5347/reg_DSC-1729-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/5347/reg_ECTSC6362-7359.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/east-coast-trail-stiles-cove-to-pouch-cove-near-pouch-cove-nf-5347",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 4,
        "Time": "4 hrs",
        "Total Distance": "11 km",
        "Town": "Pouch Cove, NF",
        "Type": "out-and-back"
    },
    "title": "East Coast Trail - Stiles Cove to Pouch Cove",
    "trail_id": "5347"
}