{
    "description": "This part of the East Coast Trail starts just northeast of St John's and brings you to Quidi Vidi Village, literally spitting distance from downtown. It is also one of the most recently finished sections of the trail. \r\rIt runs at times through forest, often in open area, occasionally over bare rocks, very often with great views of the Atlantic Ocean on the east side. There are great views of cliffs up to 165 m. above the ocean. You will occasionally walk right along the edge of some of these cliffs, as close as 1-2 m away, so be very careful. \r\rAt one point, you will descend to water level, a good place for lunch, although there are several excellent places for breaks, both at high elevations and closer to the sea.\r\rThe TH is at the Ocean Sciences Centre at Logy Bay, at water level. The initial 1.5 kms will see you rise 165 m. to Sugar Loaf Head then back down to water level over the next 4 kms, then back up to 150 m. over the next 2 kms, before the descent back down to water level at Quidi Vidi Village over the final 2 kms. Total ascent over the 9.5 km length of the hike was 450 m.\r\rUnfortunately, you will go by the edge of the municipal dump over a distance of approx 1.5 kms. The ECTA has done a fantastic job of cleaning the area, with a decent buffer of trees over most of the distance of the dump. \r\rAs this is a 1-way trail, either have 1 car at each end, or arrange for someone to either drive you to the TH (having left your car at Quidi Vidi Village) or to pick you up in Quidi Vidi after the hike.\r\rThere is a pub in Quidi Vidi where you might look for refreshments after your hike, an incentive to go from north (Logy Bay) to south (Quidi Vidi)\r\rThere are also a few geocaches along this trail.\r\rFor accommodation along the ECT, contact Elke Dettmer at Points East B&B in Pouch Cove, or via the website: trailconnections.ca \r",
    "directions": "The Logy Bay TH is in NE St John's. Go along either Middle Cove Rd or Logy Bay Rd to Marine Drive, then Marine Lab Rd to the Ocean Sciences Centre, where you'll see the TH at the NE end of the parking area.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NL/5348/reg_ECTQV6450-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/5348/reg_ECTQV6455-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/5348/reg_ECTQV6459-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/5348/narrow_ECTQV6439-7359.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/east-coast-trail-logy-bay-to-quidi-vidi-near-st-johns-nf-5348",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 4,
        "Time": "4 hrs",
        "Total Distance": "10 km",
        "Town": "St. John's, NF",
        "Type": "out-and-back"
    },
    "title": "East Coast Trail - Logy Bay to Quidi Vidi",
    "trail_id": "5348"
}