{
    "description": "Brewster Creek to Allenby Pass is one of the few trails open to mountain biking in Banff.  It is an old fire road and a passable MTB trail.  If you're looking for a rideable in-and-out on cobbly double-track in Banff, this is it.  No great views, but it's a mountainy, foresty, valleyy kinda place, pleasant enough.\n14.1km each way from Cave & Basin (10.6 from Healy Creek parking) and about 350m of total cumulative ascent (little less from Healy).  Rideable by most people at one pace or another.\nAfter ~5.5km of Cave & Basin/Sundance/Brewster, the next 8 km will get you to the Sundance Lodge, a beautiful 2 story log guest lodge.  It only has services for guests, but you can usually find a pick-i-nick table to rest your saddle-sore be hind while you have lunch.  Also, very nice outhouses!\nPast Sundance, the trail reportedly goes (I've not done it and the GPS data stops here) another ~20km to Allenby Pass and the end of the allowed biking area.  Parks Canada suggests it is tough, narrow riding best done by advanced riders with suitable skills (first-aid and repair skills come to mind).\nWatch for horses (and horse shiate) on the trail.  Slow Well down, and possibly even stop until you get the attention of the wranglers and instructions.  They may pull off or at least move well to the side while you pass.  Horses seem to have a thing against fast contraptions and can spook, likely hurting the rider and the biker.\nYou can start from the Healy Creek parking lot on the Sunshine Village road just off the TC Hiway #1 or from the Cave and Basin parking lot in Banff.\nThis trail is right beside:",
    "directions": "Cave and Basin parking lot in Banff.  Into Banff, go South on Banff Avenue, cross the bridge at the end and turn right onto Cave Avenue.  Follow road to Cave & Basin.  From the parking lot, ride due West past the Hot Springs buildings and down the paved path.  Go 2.7km from parking area and look for the Map sign on the branch to Healy Creek, turn right (West), ride another 2.7km to the Brewster Creek / Allenby Pass sign, turn Left (South-West).\nHealy Creek parking lot on Sunshine Village road.  Go West of Banff on Hiway #1 to the Sunshine Village turnoff.  Take the exit, cross over the hiway towards Sunshine and within 500m look for the Healy Creek parking sign.  From the parking lot, ride ENE across the little bridge and for another 1.9km to the Allenby Pass sign.  Turn right (South).",
    "photos": [],
    "source_url": "https://trailpeak.com/trails/brewster-creek-to-allenby-pass-near-banff-ab-5349",
    "stats": {
        "Activities": "mtn-bike ski-xc ski-bc hike snowshoe",
        "From": "",
        "Seasons": "summer fall winter",
        "Stars": 3,
        "Time": "4 hrs",
        "Total Distance": "30 km",
        "Town": "Banff, AB",
        "Type": "out-and-back"
    },
    "title": "Brewster Creek to Allenby Pass",
    "trail_id": "5349"
}