{
    "description": "Healy Creek is one of the few trails open to mountain biking in Banff.  It is an old fire road and a passable MTB trail.  If you're looking for an easy MTB ride or XC ski in Banff, this is it.  No great views, but it's a mountainy, foresty, valleyy kinda place, pleasant enough.\r\rAbout 8km each way from Cave & Basin to the Healy Creek parking lot and under 100m of total cumulative ascent.  Rideable by even the most infirm.  You can start from either end as an in-and-out or make a loop if you do some highway down the Trans-Canada (Note:  Highway, idiots & speeders abound, many with screaming kids or other attention deficit inducing  distractions in the car with them.  BE AWARE you don't get yer @$$ run over.)\r\rWatch for horses (and horse shiate) on the trail.  Slow Well down, and possibly even stop until you get the attention of the wranglers and instructions.  They may pull off or at least move well to the side while you pass.  Horses seem to have a thing against fast contraptions and can spook, likely hurting the rider and the biker.\r\rThis trail is right beside:",
    "directions": "Cave and Basin parking lot in Banff.  Into Banff, go South on Banff Avenue, cross the bridge at the end and turn right onto Cave Avenue.  Follow road to Cave & Basin.  From the parking lot, ride due West past the Hot Springs buildings and down the paved path.  Go 2.7km from parking area and look for the Map sign on the branch to Healy Creek, turn right (West), ride another 2.7km to the Brewster Creek / Allenby Pass sign, turn Left (South-West).\r\rHealy Creek parking lot on Sunshine Village road.  Go West of Banff on Hiway #1 to the Sunshine Village turnoff.  Take the exit, cross over the hiway towards Sunshine and within 500m look for the Healy Creek parking sign.  From the parking lot, ride ENE across the little bridge and for another 1.9km to the Allenby Pass sign.  Turn right (South).\r",
    "photos": [],
    "source_url": "https://trailpeak.com/trails/healy-creek-near-banff-ab-5350",
    "stats": {
        "Activities": "mtn-bike ski-xc hike snowshoe",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "8 km",
        "Town": "Banff, AB",
        "Type": "out-and-back"
    },
    "title": "Healy Creek",
    "trail_id": "5350"
}