{
    "description": "NTS Map:92F10.  This is a regional park accessible from Bates road in Comox that is in two sections, one on each side of the road.  Across the road from the main parking lot on Bates Road you will see two trailheads; for mountain bikers and horses and one for hikers.  As I did this trip on bike that is the description that I am posting here.  Once you have found the trailhead you will be proceeding in a counter-clockwise direction.  There is a maze of trails within the park--most are closed to bikes.  Bikers are expected to follow the yellow squares at all trail junctions.  There are some maps at the junctions.  I took the longer outside route over forested trails with only a few short inclines and descents.  It was 9.4 km by my odometer when I came out on Bates road about .5 km from my start point. \nThe terrain is mixed--forest, swamps, areas with lots of ferns etc.\nThe trail is anything from a nice forested carpet, to wide double track old roads, to a short section of rooty single track.\nYou will need either a hybrid or mountain bike for this ride.\nThere are trails on the other side of the road that are for hikers only that I didn't have time to check out before catching a ferry to Powell River.",
    "directions": "I am no expert on the roads in this area, however if you head for Bates Beach you should come across the trailhead and sign post.\nIt is near the Comox--Powell River Ferry dock.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/536/reg_VancouverIslandOctober2002053.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/536/reg_VancouverIslandOctober2002054.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/seal-bay-park-and-forest-near-comox-bc-536",
    "stats": {
        "Activities": "hike mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "0 km",
        "Town": "Comox, BC",
        "Type": "out-and-back"
    },
    "title": "Seal Bay Park and Forest",
    "trail_id": "536"
}