{
    "description": "Jasper National Park. 1600 meters of elevation gain over the first half of the ride, Then screaming downhill finish. Believe me it is worth the long climb. Trail starts with switchback climbs out of Jasper town site, then climb to the bench where Cabin Lake empties.  Continue along the shore of Cabin Lake on sweet single track. Trail continues gradual ascent through forest, a few sections of bog but all can be ridden. Some creek crossings to keep it interesting, all are minor and can be ridden or crossed easily. Rest point at long log bridge at the bottom of a beautiful waterfall. Then pick your way through roots and rocks until the first descent starts, then hang on.  With a wicked fast downhill descent through rock gardens as well as smooth and banked corners, you will have an ear to ear smile.",
    "directions": "Jasper town site to Cabin Lake road, then take uphill right onto gravel road.  At gate park car, and take trail on right side of gravel road (Trail map marker is at trail head and all junctions). Best done as a counter-clockwise ride, but either way works.This trail is well marked at crucial trail intersections.",
    "geohash": "c3",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/5364/reg_DSCN3910-30310.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5364/reg_Group-at-Lake-7705.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5364/reg_Jasper-2-2006-edited-7705_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5364/reg_image.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5364/narrow_image.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/20-mile-loop-saturday-night-lake-loop-near-jasper-ab-5364",
    "stats": {
        "Activities": "snowshoe hike mtn-bike",
        "From": "",
        "Seasons": "summer",
        "Stars": 5,
        "Time": "4 hrs",
        "Total Distance": "24 km",
        "Town": "Jasper, AB",
        "Type": "out-and-back"
    },
    "title": "20 mile loop (Saturday Night Lake Loop)",
    "trail_id": "5364"
}