{
    "description": "This moderate hike takes you on a 2.6km loop through some of the hiking trails in the Capilano River Regional Park in North Vancouver.\nThe hiking trail takes you over the Cleveland Dam wall to the north, with spectacular views of the Capilano Canyon and boulder strewn Capilano River upstream from the salmon hatchery.  After following small trails in the forest downstream from the dam, you can cross the Capilano River on a small foot bridge, then head back up the hill through steep forest to the parking lot.\nThis trail is only one loop through a network of trails in the Capilano River Regional Park.  Trails along the river can be linked through a series of parks in Vancouver's North Shore, passing from Ambleside Park along West Vancouver's \"Town Trail\" down on the water front, through Klahnie Park, then Hugo Ray Park before hooking up with the Capilano River Regional Park's \"Capilano-Pacific Trail\" and extensive river side trail network.\nMore information on these trails can be found here.",
    "directions": "Drive North on Capilano Road and pull into the car park near the dam wall on the left before you reach the Grouse Mountain ski area parking lot, or earlier on veer left off Capilano Rd down Capilano Park Rd, and park before or after the fish hatchery.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/5374/reg_CapRiverWalk-0001-6103.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5374/reg_IMG-20110717-00392885-45804.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5374/reg_IMG-20110717-00403-45804.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5374/narrow_CapRiverWalk-0017-6103.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5374/narrow_map-of-capilano-river-trails-6103.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/capilano-dam-loop-near-north-vancouver-bc-5374",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "3 km",
        "Town": "North Vancouver, BC",
        "Type": "out-and-back"
    },
    "title": "Capilano Dam Loop",
    "trail_id": "5374"
}