{
    "description": "This is a short little ditty with amazing views. It's the kind of trail that only the locals know about, and sits hidden, not too far off dirt roads and back woods. The mountain you climb sits between Carr's Mountain and Oakland Mountain. On the topo map, it's called Pinnacle.\nWho even made the trail never knew about the benefits of switchbacks, either for our benefit and for the good of the terrain. I'm guessing that people simply took the route made by storm water, and created what is now a pretty direct approach. Up you go!\nThe trail starts off the Curtis Road where there's small logging road on the left. Quickly it turns off the road to the right where there are some small logs crossing the path. Once on the path, it's not too hard to make out the trail despite the fallen leaves. There's one little boggy spot where you can stay dry by crossing over stones.\nAlong the way, there are plenty of loose rocks, so be careful how close you follow others on both the ascent and descent. It's steep enough to send boot sized rocks or larger tumbling down the slope.\nWithin ten to fifteen minutes, you will see a greater rocky mass which is the summit. I found a suitable camping spot around the right side of the top, sheltered in the woods. Interesting to note is that there is a gravestone at the top for Garry Warden Cullens; 1944-1989.\nThe views from the top are truly panoramic. Off to the West is the village of Florenceville and beyond is the St. John River, and Mars Hill and Mt. Katahdin in the US. This is a hike best done in autumn when the leaves are rich with color.\nShannon Burt\nEast coast editor",
    "directions": "Off the old route 2 highway, just South of the turn off to Florenceville, look for the Burnham Road to the East just South of the exit. The trailhead is along the old Glassville road, also named Curtis Road from the other end. Follow GPS track on the google maps to the trailhead.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NB/5384/reg_IMG-0145-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/5384/reg_IMG-0131-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/5384/reg_IMG-0139-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/5384/reg_IMG-0163-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/5384/reg_IMG-0167-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/5384/narrow_IMG-0168-6702.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/pinnacle-trail-near-florenceville-nb-5384",
    "stats": {
        "Activities": "snowshoe hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "1 km",
        "Town": "Florenceville, NB",
        "Type": "out-and-back"
    },
    "title": "Pinnacle trail",
    "trail_id": "5384"
}