{
    "description": "Mount Carleton Provincial Park is a wilderness recreation area that offers both paddling and hiking adventures.  It stays open between the May and October long weekends, though there are XC trails in the winter, they are not groomed, and access to the park is blocked by a gate. You'll have to trek the long roadway in to whereever you want to get to.\nThere are 11 trails and two lake systems. (Nectau and Nepisiguit lakes) The lakes form the head waters to two major river systems. The Nectau drains into the Tobic River, and the Nepisiguit lakes (Batherst and Tenneriffe collectively) drain in the river of the same name.\nFor my recent Thanksgiving weekend trip, I took the opportunity to visit the region after a six year hiatus. Hiking was my mode of travel, and I had a plan to complete a major trail circuit consisting of the Mt. Carleton trail (through Headwater and over the mtn, connecting to Mt. Head and the short side of Segamook trail, and returning via Caribou Brook Trail and Dry Brook, back to the remaining Mt. Head trail and Mt Carleton trail by the fire road. With a near 11AM, and a 6PM window to work in, this ended up being a plan too risky to pull off in such rocky terrain. I changed my plan as I passed Sagamook Mtn, and decided to backtrack much of the way I came, with a total distance covered of 24K in 5 hours and 20 minutes. The trails I hiked were Mt. Carleton loop, Mt Head trail and a bit of Mt Sagamook loop.\nThe trails really are nice. They either take you to great views, or connect you to trails with great views.\nMt Carleton Trail\nThis is a loop that has an easy side and a more technical side, but with the objective of climbing Mt. Carleton, the Maritime's highest summit point.  Going clockwise, you enter the forest and travel over lush foliage, and after dropping over a ledge, it follows a stream toward Headwaters, which is  unfortunately the only designated backcountry camping site in the park. Speaking to one guy, he told me that a bear was sniffing around his tent, just the night before. Makes me think twice about ultralighting it there in the fall!\nThis section is very beautiful with little waterfalls providing an audible backdrop of tranquility. Continuing Northeast, you will pass a junction giving you  the option of avoiding Mt Carleton on your way to the Mt. Head Trail. I chose to continue toward my first objective, summiting the region's highest point. \nFollowing blue flashes on the rocks, you climb your way up. After passing a false peak, you continue along the rocky ledges toward the fire tower building, which by the way has been recently rebuilt and repainted. It looks great! \nYou feel almost obliged, on the descent, to climb a little rock spire to take in more of the view. I believe it's the same spot where someone stood for the classic Mt. Carleton photo found in the brochure.\nDescending Mt Carleton, takes you to the Mt. Head trailhead, which is a trail that connects Mt. Head (2600 ft) to Mt. Sagamook(2550 ft) due North. Choosing to complete the Mt. Carleton loop will take you down a boring fire road, which is rocky and hard on the joints. It's debatable whether or not it's easier  than doing the mountain again, but certainly lacks the view. It's a 4K return to the parking lot this way. \nMt Head Trail\nThis is a connecting trail that starts at the Northeast foot of Mt. Carleton and heads North, connecting Mt. Head to Mt. Sagamook. It's a linear path that is 4.25K in length, and connects to Dry Brook Trail, Bald Mountain Brook trail and the Sagamook trail loop. \nWith the two objectives en route, this is a nice trail that is rather technical with a lot of grown over boulders that make up much of the higher elevations of the Mt. Carleton area.  You'll find this even in the forest parts of the trail. Step carefully, and use a hiking pole or two. The rocks are slippery in places. I found no real place to refill water, so the safest strategy is to carry what you need.\nMt Head has a spur trail taking you to its summit. The approach ends in a talus scramble. It's worth the side trip with panoramic views of the Nepisiguit Lakes to the south and Mt. Sagamook to the north. I paused to eat my lunch there.\nI find it worth noting that at this point, the map is a bit confusing about where the trail junction is in relation to Mt Sagamook. The junction of the Mt. Head trail and the Mt Sagamook loop is on the southern end of the Mountain. It confused me and a few others for a little bit.\nThe Mount Head Trail terminates at the foot of Mt. Sagamook where a 6.2K loop trail of the same name forks. Going right takes you along a talus scramble over the summit, then along a steep descent along a ridge. Going left takes you clockwise along the loop where within ten\nminutes there is a look-off spur well worth the effort of getting there. Check out the rock spire further down the slope to the right. It's marked with blue flashing on the rocks. The view takes in the Nictau Lakes and surrounding mountains to the North.\nMt Sagamook summit has way more interesting features than Mt. Head had, with a fluted rock face feature on the approach. I noticed a small keyhole feature where a pie-piece shaped chunk was missing from the rock. It made a nice little rock climb to see it up close. \nI chose to turn around at this point due to perceived time restrictions, but if I had more time, my plan would have been to continue on the clockwise end of the Mt. Saganook trail loop, connecting onto the Caribou brook trail. From there, I would have turned right to the Dry Brook trail as it held promises of waterfalls.\nFrom there, I would have returned home via the remaining Mt. Head trail and if I felt ambitious enough at that point, would have resummitted Mt. Carleton to take in the really cool ledgy terrain around Headwaters back to the parking lot. Instead, I chose to backtrack along the Mt. Head segment, and took the Fire road portion of the Mt. Carleton loop back to the parking lot. I made it back with an hour to spare. It started raining just as I packed my things into the jeep!\nSee the article  Getting high in the Maritimes. for more trail descriptions and regional details.",
    "directions": "Leaving from Perth Andover or Plaster rock, follow the signs to Mount Carleton Provincial Park. Watch out during early morning or evening driving due to the abundant deer and moose population.",
    "geohash": "f82m",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NB/5385/IMG_0105 copy.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/5385/reg_IMG-0064-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/5385/reg_IMG-0069mtcarleton-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/5385/reg_IMG-0078viewfrom-mt-head-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/5385/reg_IMG-0086-mt-head-boulderfield-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/5385/reg_IMG-0095-Nictau-lakes-from-sagamook-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/5385/reg_IMG-0103-sag-lookoff-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/5385/reg_IMG-0105-copy-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/5385/reg_IMG-0120-Done-in-after-24K-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/5385/reg_saganook-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/5385/narrow_IMG-0073-dog-rest-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/5385/narrow_IMG-0111-saganook-trail-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/5385/narrow_IMG-0114-fireroad-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/5385/narrow_IMG-firetower-pov-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/5385/narrow_IMG-mtheadtrail-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/5385/narrow_IMG-other-lakes-from-sag-lookoff-6702.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mount-carleton-provincial-park-epic-hike-near-saint-quentin-nb-5385",
    "stats": {
        "Activities": "snowshoe hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 5,
        "Time": "7 hrs",
        "Total Distance": "24 km",
        "Town": "Saint-Quentin, NB",
        "Type": "out-and-back"
    },
    "title": "Mount Carleton Provincial park Epic hike",
    "trail_id": "5385"
}