{
    "description": "Mount Erickson is just accross the border from Alberta and not far from the towns of Sparwood (B.C.) or Coleman (AB) on highway 3.\nFrom the summit there are interesting views to the east of the mountains in the Crowsnest Pass; to the west there is the odd view of the Sparwood open-pit coal mine. \nI've rated this trail as difficult- mainly to warn hikers that they might not find this a straightforward outing... it is not really a difficult scramble for most peakbaggers (I think that this would be rated as easy or moderate if it were in Alan Kane's Scrambles book). The most difficult part of the day for us was starting out. There is no trail and the bottom part of the ridge is forested, but the bushwhacking was pretty easy. Gaining the ridge from the highway is a bit of a struggle as the slopes above the highway are pretty steep. \nContinuing through the forest, we kept to the right of the cliffs and were able to bypass any real scrambling. Clearing the trees, the first view we got of the summit was a bit disheartening, as we had to lose elevation when we dropped down to the saddle just beneath the summit. The route from this vantage point looked difficult, but we pressed on and discovered that there was no real scrambling and the way up was in fact, not as steep as it looked. \nGaining the top of this gigantic mound of rock, there is an interesting ridge walk with two distinct summits that are worth exploring. At the first summit, there is some sort of instrumentation that is housed in a very odd alien looking structure (it looks like a green rocket ship). There is a helicopter pad nearby, similar to the one on top of Mt. Crandell in Waterton Park (AB). Perhaps it is a weather station or some sort of communications antenna? There is a nice ridgewalk from this first summit to a slightly higher summit just a few minutes to the north. \nMt. Erickson (June 22nd, 2008)\nElevation Gain: 1,200 m (4,000 ft)\nDistance: 11km",
    "directions": "Follow Highway 3 West 6.3 km past the AB/B.C. border and park at the side of the highway. The route to Mt. Erickson begins up the steep, slippery gravel slopes on the north side of the highway. Be sure to examine this route on a map beforehand, and it is not a bad idea to have a GPS along to make sure you don't get sucked into some dicy terrain on the way down - my hiking partners were following their GPS tracks through the forest which made the descent route quite clear.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/5395/long_map1-7490.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5395/long_map2-7490.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5395/reg_IMG-3377first-view-of-mysterious-giant-rocket-james-is-a-tiny-speck-7490.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5395/reg_IMG-3384-crowsnest-and-co-7490.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5395/reg_IMG-3425-mitch-dsnding-summit-ridge-7490.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5395/reg_IMG-3427-mitch-ridge-7490.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5395/reg_IMG-3432-fossils-bunch-7490.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5395/reg_IMG-3434-crystals-sml-7490.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5395/narrow_IMG-3401-sparwood-mine-i-think-7490.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5395/narrow_IMG-3426-james-and-the-giant-dildo-7490.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mt-erickson-near-sparwood-bc-5395",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 3,
        "Time": "8 hrs",
        "Total Distance": "11 km",
        "Town": "Sparwood, BC",
        "Type": "out-and-back"
    },
    "title": "Mt. Erickson",
    "trail_id": "5395"
}