{
    "description": "Admittedly, I do not do much mountain biking and only explored Racehorse Pass with a bike in order to save time hiking up the un-named mountain to the north of Racehorse pass (unofficially  called ?Racehorse Peak?) .\nThe biking route to Racehorse Pass is described in Rocky Mountain Book's 'Back country biking in the Canadian Rockies'\nAfter turning off highway3, we followed the odometer quite closely as per the guidebook. We discovered that the odometer reading listed in the book was a bit off (on the way up, we initially followed a couple of fainter trails that were definitely as not fun biking as the correct route, which we followed down - see attached screen shot from Google earth).\nThere are a lot of ATV trails in the back country in the Crowsnest Pass. We inadvertently started following a couple of greasy and steep ATV paths, instead of the road to Racehorse Pass, which is quite hardppacked and more fun to bike on, in comparison. Even with all the extra screwing around we did, we still made it to Racehorse Pass in about an hour and a half to two hours, and were able to continue on to summit the peak on foot after stashing our bikes.\nThe ride back to the cars was a blast and only took 10 minutes, give or take.\nIf biking is your goal, the road continues on and on. By my map, it intersects with another forestry trunk road to the west. One could do a big loop of about 50 or so km, if so desired... you would have to loop back by highway 3 and make your way back up the Crowsnest lake road to the car.\nElevation Gain: ~400 m\nDistance: 12.5 km round trip",
    "directions": "Follow Highway 3 past Coleman and turn North for approximately 18 km on the forestry road, following past Crowsnest Lake. Park at the left side of the road. NOTE: BE SURE TO CHECK OUT THIS ROUTE ON A MAP OR THE GPS DATA provided. There are a lot of ATV trails in the Pass... the road is relatively nicely hardpacked, so if you are on something pretty soft you might be on something else (see trail desription above - we did this on the way up). The dirt road we followed was NOT shown on my GPS (Garmin basemap) but was shown on my friend's Magellan unit.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/5396/reg_5biking-out-7490.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5396/reg_7sbj-1-7490.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5396/reg_racehorse-peak-GE-view-1-7064.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/racehorse-pass-near-blairmore-ab-5396",
    "stats": {
        "Activities": "hike mtn-bike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "13 km",
        "Town": "Blairmore, AB",
        "Type": "out-and-back"
    },
    "title": "Racehorse Pass",
    "trail_id": "5396"
}