{
    "description": "Mt. Baldy is a landmark of Shawnigan Lake, north west of Victoria, BC,  and has been hiked by its residents for decades. Although the route is only 1.5km with an elevation gain of 350m, most people will find this a challenging hike due to the steepness of the climb.\nThis will be a tough hike in hot weather or if the glaciated rocks are icy. Bring plenty of water! Basically the hike resembles and upside-down parabola. It starts out hard and steep and levels out the closer you get to the top. The start will be tough as the first 25 mins of the hike are on exposed rock bluffs, which reflect the heat greatly. Wear really good footwear because the rock surface can be slippery in places.\nReaching the top will be a rewarding experience as you can see Mill Bay, Sooke Lake and Mt. Prevost.",
    "directions": "Go down East Shawnigan Lake Road until you get to the Easter Seals camp. You will see playground zone signs as your warning. The trail head is up through the gravel parking lot by a metal roofed shelter. Follow the trail up to the train tracks and walk 20m north. There will be a small cliff on your right with a blue arrow spray painted on it. Walk to the end of the cliff where you will see another small trail leading up. Go up this trail until you reach a rocky area. Turn left, walk 10m and go up the trail to your right. The rest of the route is obvious from here.",
    "geohash": "c28hd",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/5411/long_wedding-photography-portraits-1-6-50561.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5411/reg_Baldy-18988.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5411/reg_wedding-photography-portraits-1-7-50561.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mt-baldy-near-langford-bc-5411",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 5,
        "Time": "1 hrs",
        "Total Distance": "2 km",
        "Town": "Langford, BC",
        "Type": "out-and-back"
    },
    "title": "Mt. Baldy",
    "trail_id": "5411"
}