{
    "description": "Many people wonder what the appeal is in hiking an abandoned railway line.  It?s too flat, they say!  It?s too boring, they say!  And I was no different before I hiked the Trans Canada Trail (TCT) from Inverness to Port Hastings in Cape Breton.  Yep, this 92 km multipurpose trail is certainly flat but like everything else in Cape Breton, it certainly isn?t boring!   As you walk along this trail, you see remnants of an era gone by and learn about the prosperous days of the railroad in Cape Breton.  You see evidence of the Scottish settlers who lived and worked along the route, and you learn about the history and culture of the tiny villages as you hike.  The scenery ranges from great to spectacular, and the local people you meet along the way will always stop to chat, lend an ear or maybe even the shirt of their back. The TCT from Inverness to Port Hastings begins at the former railway station in Inverness which is now the Inverness Miners? Museum and ends at the TCT Pavilion beside the Canso Causeway in Port Hastings.  Most of the trail follows the abandoned railway bed except for the last 2 km where it crosses a strip of land between Long Pond and the Strait of Canso called Ghost Beach.  From Inverness to Port Hood, the trail travels inland through farmland, forests, and wetlands, and offers plenty of spectacular trestles along the way.  From Port Hood, it keeps to the coast, going south along St Georges Bay all the way to Port Hastings.  Be sure to watch for pilot whales, bald eagles and a vast array of coastal birds as you stroll along the bay. The first day we hiked 26 km from Inverness to Mabou through the tiny communities of Kenloch, Glendyer and Glendyer Station.  Before we took our very first steps, a small fox came right up and bid us happy trails!  The hike began with terrific views of the Gulf of St Lawrence before we went inland for most of the day.  Just outside Inverness, we crossed our first trestle bridge -- a spectacular long, high one over Cove River ? and we took a break on the shores of Lake Ainslie near Kenloch.  We went through a protected wetland called Black River Bog and strolled through a valley with high rolling hills on both sides.  Everywhere we looked, the trees were ablaze with the famous reds, yellows and oranges of autumn in Cape Breton; the forest was on fire! Coming into the village of Mabou, the Mabou River meanders through marshy wetlands.  There are five trestles in this section, one of them a regal and rusty steel bridge that crosses the river.  As we walked around Mabou Harbour, the church was silhouetted on the water with the full moon and the high rolling hills of the Cape Mabou Highlands as a backdrop in the dusk.  It was a magical time of day. On Saturday, we hiked 31 km from Mabou to Judique North and once again, the fall colours and the scenery were spectacular!  We walked beside the dark waters of the Southwest Mabou River as it wound its way south and we crossed over another stately old trestle bridge where the bluffs exposed sedimentary layers that angled upwards.  Near Glencoe Station, we stopped for lunch in a field and sunbathed in the tall grass while a dog barked in the distance, and we stopped for an ice cream in Port Hood before beginning the coastal walk along St Georges Bay.  A heron took flight as we crossed the causeway in Little Judique Harbour while the moon and boats shimmered on the still water.  We made camp near Judique North in the dark on a very brisk but starry night. We had a pretty easy day on Sunday ? 17 km from Judique North to Craigmore ? and the walk along the coast was breathtaking!  We walked past the salt marsh shores of Michael?s Landing at Judique Pond; took a side trip up the Celtic Trail to the Celtic Music Interpretive Centre and the General Store in Judique; and watched the waves roll in at Baxters Cove.  At Walkers Cove, we explored the tombstones of Scottish settlers in St Michael?s Cemetery and in Craigmore, we stopped at Christie?s Look Off to watch for pilot whales in St Georges Bay.  From Walkers Cove to Craigmore, the trail hugs the ridgeline of rugged cliffs and offers never ending views of rocky beaches and crashing waves down below.  All along the trail, there are shrubs in dazzling shades of purple, burgundy, green and white with bright red berries.   Our final day on the trail, we got up before dawn and hiked the last 18 km from Craigmore to Port Hastings.  Once again, we walked by the light of the full moon and watched the twinkling house lights on the other side of the Strait of Canso fade away as the sun rose to a fuchsia and purple sky and gray clouds.  Soon after day break, it started to rain and the air was saturated with a salty mist.  The white caps got bigger, the waves crashed louder and the coastline was shrouded in fog.  It was magnificent! Just before Port Hastings, we crossed the 2 km strip of land called Ghost Beach which is a boulder-lined, rocky natural beach that separates Long Pond from the Strait of Canso.  For us, it was the last challenge before arriving victorious at the TCT Pavilion in Port Hastings and heading on to the Cape Mabou Highlands for a day hike before going home. The Trans Canada Trail from Inverness to Port Hastings is an easy multipurpose trail that?s ideal for hikers, cyclists, snow shoers, cross country skiers and others who want to enjoy one or more days on the trail with the option of sleeping in a tent or in a motel, B & B or cabin.  For me and my friend, who came home from Ontario to hike with me, it gave us a chance just to stroll along at a leisurely pace, catch up on each other?s news, enjoy some great scenery, and share lots of laughs and fond memories.",
    "directions": "From Route 19 in Inverness, turn west on to Lower Railway Street (just past the firehall) and go 200 metres to the former railway station which is now the Inverness Miner's Museum.",
    "geohash": "f8h",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/5420/long_10-Celic-Music-Interpretive-Centre-17579.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/5420/long_12-Baxters-Cove-17579.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/5420/long_8-Little-Judique-Harbour-17579.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/5420/long_9-Micheals-Landing-17579.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/5420/reg_1-Fox-17579.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/5420/reg_11-Red-Marshes-near-Judique-17579.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/5420/reg_14-St-Michaels-Cemetery-17579.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/5420/reg_15-Along-the-Coastline-17579.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/5420/reg_2-Julianne-Ellen-17579.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/5420/reg_3-Trestle-in-Inverness-17579.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/5420/reg_4-Mabou-Harbour-17579.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/5420/reg_5-Southwest-Mabou-River-17579.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/5420/reg_6-Trestle-Bridge-Southwest-Mabou-River-3-17579.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/5420/reg_7-Julianne-Taking-a-Break-17579.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/5420/reg_8a-Cross-at-Judique-North-17579.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/5420/reg_TCT-Map-46-Inverness-17579.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/5420/narrow_13-Walkers-Cove-17579.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/5420/narrow_17-Long-Point-17579.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/5420/narrow_TCT-Map-42-Port-Hastings-17579.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/trans-canada-trail-inverness-to-port-hastings-near-port-hawkesbury-ns-5420",
    "stats": {
        "Activities": "snowshoe sea-kayak hike ski-xc mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 5,
        "Time": "28 hrs",
        "Total Distance": "93 km",
        "Town": "Port Hawkesbury, NS",
        "Type": "out-and-back"
    },
    "title": "Trans Canada Trail, Inverness to Port Hastings",
    "trail_id": "5420"
}