{
    "description": "Mount Gordon \nStarting from the ACC's Bow Hut, it is a short day trip accross the Bow Glacier to the summit of Mt. Gordon. This is more of an an alpine climb than a hike, as the entire trip is on the snow and ice of the glacier, with only a bit of solid rock at the summit. Knowledge of glacier travel (whiteout navigation, crevasse rescue, roped glacier travel techniques etc.) are all highly reccommended.  I did this outing as part of a Yamnuska-guided  'Intro to Mountaineering' course and was roped up for the entire trip except for lunch at the summit. \nWe stopped at various times to discuss navigation accross the glacierfield and spent some time probing snow bridges, trying to assess if they were safe, etc. There were a few cracks (crevasses) that showed here and there but nothing dramatic that we had to cross (mostly the crevasses were bridged by snow). \nSimply amazing views from the summit! You can just make out Balfour Hut and to the north, you can not quite make out the Peyto Hut but you can see the route that crosses the glacier field. Far off in the distance you can even make out the Bugaboos.\nThe rate of elevation gain is pretty modest for most of the way and a lot of people do this on skis. There is a bit of a steep pitch near the summit at the end that was intimidating... but quite fun to ascend. \nThere is an interesting glacial feature called a  'moat' that we had to navigate around near the summit... basically a separation between the rock of the mountain and the glacier (see captioned photo.) It is not quite true to the word 'moat', as it does not actually surround the top but there is quite a dramatic drop off the edge of this feature. I never actually walked right up to the edge to see how far down it went (although our guide walked right up to the edge, secure in the fact we were roped up).\nOn the way back to the hut we stopped on a section of the glacier that had no snow cover to practice crampon techniques on icy slopes. (At no point did we ever require crampons for this ascent, although conditions can always be different depending on the weather... on this day, conditions for the entire trip were suitable for just wearing mountaineering boots, as there was still a layer of soft snow over the ice of the glacier for basically the entire route except for areas near the very bottom. Conditions for hiking were actually pretty much perfect, as there was a snow cover was not hard enough to ever require crampons and our boots were generally not sinking in more than a few inches). \nDistance: 8.5 km round trip from Bow Hut (done on July 28th, 2008).\n[Note: can also be done as a long day trip from Num Ti-Jah Lodge].\nElevation Gain: 2,500 ft (762 m) from Bow Hut\nElevation at summit: 3,200 m (10,510 ft)",
    "directions": "See Trailpeak description for",
    "geohash": "c3jj",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/5421/long_Mt-Gordon-Summit-another-view-to-the-westsml-7490.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5421/long_Mt-Gordon-Summit-view-to-the-south-7490.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5421/reg_Gordon-7490.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5421/reg_IMG-4031-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5421/reg_Mt-Gordon-Summit-view-to-the-northeast-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5421/reg_best1_IMG-4034-7490.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5421/reg_gordon-2-7490.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mount-gordon-near-banff-ab-5421",
    "stats": {
        "Activities": "hike ski-bc",
        "From": "",
        "Seasons": "winter summer",
        "Stars": 4,
        "Time": "7 hrs",
        "Total Distance": "9 km",
        "Town": "Banff, AB",
        "Type": "out-and-back"
    },
    "title": "Mount Gordon",
    "trail_id": "5421"
}