{
    "description": "Mount Olive  is a classic ascent that can be done as a short day trip from the Bow Hut. \nThere were bitter winds blasting us from the West as we approached from the Bow Hut, crossing in front of Mount St. Nicolas on its eastern slopes. In the winter there would probably be some avvy concerns about passing here below St. Nic, and a more stable ascent route would be to go west of Mt. St. Nicolas and ascend to the col between Olive's first peak and St. Nic.\nThe views were not great, but it was a good experience to navigate in poor conditions. \nI did this ascent as part of a Yamnuska guided \"Intro to Mountaineering course\" at the end of July 2008. We practiced short rope techniques higher up on the spiny rock of Olive's ridge. Note: this is an alpine climb, not really a hike as it involves crossing the Bow glacier for a couple of kilometers before reaching the ridge. \nOn the descent, we briefly dropped on to the glacier via the aforementioned col between Olive and St. Nic, as we considered doing a loop back in front of St. Nic. The bitter winds and blowing snow made for a good whiteout, so after checking out the non existent views we returned back to the hut the way we came, shielded by the winds by Mt. St. Nic.\nNote: GPS track data has a gap when I turned my unit off. We passed below Mt. St. Nicholas, but in the winter when there is avvy danger, the general route is to ascend behind St. Nicholas to the col between Olive and St. Nick. \nElevation Gain from Bow Hut: 700 m (2,300 ft)\nElevation: 3110 m (10,206 ft).\n[Note: can also be done as a long day trip from Num Ti-Jah Lodge].\nReferences: See Murray Toft's 'Touring the Wapta Icefields Map' (note: map is in old nad 83 reference.)",
    "directions": "See Trailpeak description for",
    "geohash": "c3jj",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/5422/long_best1_a-photo-near-the-Onion-Mt-St-Nicolas-7490.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5422/reg_Scrn-shot-Mt-Olive-7490.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5422/reg_Scrn-shot-Mt-Olive2-7490.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5422/reg_best2_IMG-4052-7490.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5422/reg_descending-7490.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5422/reg_mt-olive-7490.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5422/reg_mt-olive-looking-back-7490.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mount-olive-near-banff-ab-5422",
    "stats": {
        "Activities": "hike ski-bc",
        "From": "",
        "Seasons": "winter summer",
        "Stars": 4,
        "Time": "7 hrs",
        "Total Distance": "8 km",
        "Town": "Banff, AB",
        "Type": "out-and-back"
    },
    "title": "Mount Olive",
    "trail_id": "5422"
}