{
    "description": "The trail into Cougar Canyon, near Vernon, begins as a hiking trail in Kalamalka Lake Provincial Park.  We hiked our bikes (i.e.: pushed) up the rocky trail and finally left them in the bush.  The trail has a little dead fall.  We were not prepared to climb the crazy cliffs without gear, so we just chilled out on a huge cliff overlooking the canyon.  If you want to get into the canyon, take the left fork instead of the right about 2 km up.  We saw some people climbing and also saw chains and hooks bolted into the rock.  \nIt was a sweet descent on our bikes, back towards Cosens bay.  The view is of Kalamalka Lake, looking south towards Kelowna, and of the Cosens Bay beach area.  \nWe saw a black bear on our trip, and it is also a rattlesnake area, so be careful.",
    "directions": "Kalamalka Lake Park is just south of Vernon.  You can reach it by exiting Hwy. 97 east by Okanagan College and driving through Coldstream.  Enter Kalamalka Lake Provincial Park at the east side at Cosens bay gate.  Take your car along the road, or bike. The road crosses under the power lines a few times before reaching a parking lot on the right side (south).  Be sure you don't stop at the first parking lot unless you want to go an a trail I don't know anything about.  I think this road is closed in the winter.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/5430/reg_DSCN2108-6465.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5430/reg_DSCN2112-6465.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5430/narrow_DSCN2111-6465.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/cougar-canyon-near-vernon-bc-5430",
    "stats": {
        "Activities": "climb hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "3 km",
        "Town": "Vernon, BC",
        "Type": "out-and-back"
    },
    "title": "Cougar Canyon",
    "trail_id": "5430"
}