{
    "description": "Algonquin park is known more for its canoe routes than its hiking trails.  That said, there are a number of marked trails in specific areas of the park.  We decided to try the Western Uplands trail system starting at Rain Lake because it would likely be the most remote, and I believe we were right.  The trailhead at Rain Lake has a large parking area for hikers, canoeists and day-trippers.  \r\n\r\nThe initial trek follows the abandoned O A & PS railway line for about 8 km.  This is an easy walk giving an opportunity to stretch your legs, and enjoy frequent views of Rain Lake.  The trail leaves the rail bed after crossing the tip of Islet Lake entering the hilly Canadian Shield terrain found in most of the western end of the park.  While the elevation gain is insignificant, the trail undulates over numerous small hills and small creeks.  Water can be hard to find on this part of the trail, and even the flowing creeks quickly clogged my filter.  \r\nAfter passing over a large hill with little undergrowth, Brown Lake comes into view.  Most of this lake is only accessible by canoe, but ironically, the only way to get a canoe in is over a series of long portages leaving it mainly to the hikers crossing the south end.  Keeping to the northern route beyond Brown Lake you once again start to climb along the side of a hill past East End Lake to Loft Lake.  Here you are a bit more likely to spot canoes traveling to or from Brule Lake.  South of Loft Lake, the trail meets the \"second loop\" of the system heading east toward West Otterpaw Lake.  This section of trail has the most pronounced elevation changes, giving glimpses of the trail through the trees across ravines.  Just beyond West Otterpaw Lake is Lady Slipper Lake where we found a beautiful campsite with trees overhanging the lake.  From here the trail continues north to where it meets the third loop just south of Brown Lake and the trek out. There is GPS data attached to this trail (see \"download GPS\"), which if loaded into your GPS can help you find route points.",
    "directions": "From Huntsville, drive north on Highway 11 to Emsdale.  Turn right on Highway 518 to Kearny where you pick up your trail permit before continuing on to the Rain Lake trailhead.\r",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/ON/547/reg_1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/547/reg_2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/547/reg_4.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/547/reg_5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/547/topo_3.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/western-uplands-trail-algonquin-near-huntsville-on-547",
    "stats": {
        "Activities": "river-canoe hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 3,
        "Time": "28 hrs",
        "Total Distance": "0 km",
        "Town": "Huntsville, ON",
        "Type": "out-and-back"
    },
    "title": "Western Uplands Trail (Algonquin)",
    "trail_id": "547"
}