{
    "description": "A long ridge in Kananaskis Country dividing Wasootch Creek and Porcupine Creek. Most people hike to the cairn instead of hiking the ridge in its entirety. Start of the trail is fairly steep but soon levels out with beautiful views of the Kananaskis Valley.",
    "directions": "Wasootch Creek parking lot on Hwy 40 (Kananaskis Trail. A few kilometers south of Barrier Lake Information Centre.Another User provided this much more detailed description:There is no actual sign for this Trail and the trailhead is a bit confusing :(. From the Wasootch Creek parking lot there are four little trails starting on the East side of the lot. The furthest to the right (actually signed) is for Wasootch Creek. The two middle trails for sure head up to Wasootch Ridge (because we went up one and came down the other). There is an additional fourth trail on the left that seems to veer North... I'm assuming this is the trail that connects to the Baldy Pass Trail, although I didn't test that theory. After taking one of these two middle trails, the trail braids a lot throughout the hike, so don't stress to much every time you reach a small fork... its all ending up in the same place.This is a gorgeous hike, but not one for inexperienced hikers, or anyone terrified of a bit of exposure. It would be a good choice for anyone starting to make the transition into scrambling, as there is a few slightly exposed ledges, plus the option to do a bit of scrambling past the official trail end. There are some steeper slippery sections closer to the beginning so take your time, and bring your hiking poles if you have them.The trail starts out fairly steep (for about the first few km) then flattens out a bit. After this point Once you are on the ridge), the trail basically undulates up and down with a few flat stretches in between. It's around 6.5 km one way to the official trail end cairn, but you can keep going quite some ways after this if you do a bit of scrambling. I've seen many varied reports of the elevation gain for this hike (750-1100m) I'm going to say its about 900m to the Cairn, then up to an additional 200m depending how far you scramble past that Cairn. A little ways past that Cairn, on your right, there is a nice somewhat sheltered spot to stop for lunch or for some non-scramblers to wait while the scramblers carry on. Quite nice views from here. Including some scrambling past the Cairn, it took my group 6 hours, I'd say give yourself 5-7 hours for this hike, depending on your fitness levels and how many pictures you want to take. Make sure you take sunscreen/hat and lots of water.... you're gonna work on this hike, but will be rewarded with amazing views, starting quite early into the hike.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/5494/reg_DSC05600-32625.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5494/reg_DSC05600-32625_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5494/reg_DSC05601-32625.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5494/reg_DSC05606-32625.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5494/reg_tn-IMG-0213-20217.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5494/reg_tn-IMG-0222-20217.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5494/reg_tn-IMG-0239-20217.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5494/reg_tn-IMG-0243-20217.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5494/narrow_photo-2-32625.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/wasootch-ridge-near-canmore-ab-5494",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 3,
        "Time": "4 hrs",
        "Total Distance": "10 km",
        "Town": "Canmore, AB",
        "Type": "out-and-back"
    },
    "title": "Wasootch Ridge",
    "trail_id": "5494"
}