{
    "description": "This is a fantastic route that takes you up to the top of Mt. Arrowsmith (1817 meters) via the snow nose and back down via Brugger?s Variation.  This route is not for the faint of heart as it involves some 4th class exposed scrambling on the nose for about 50 metres.  We climbed this section without any ropes but feel free to use them if it makes you more comfortable.  The rappel bolts are in excellent shape if you want to use them.  Total distance is about 7 kilometers and it took us about 7 hours including lunch and breaks.  Now we were fortunately enough to have two vehicles so that we could leave one vehicle at the last switch back (4th) on the road, this allow us to do it as a loop.  In order to go up the snow gullys, this route should be completed before June (depending on the snow pack).  Crampons, helmets and ice axes will be needed for the gully up to the bumps and also for Brugger?s variation. \r\r      From the parking area the trail begins just in front of the concrete blocks. Follow this trail and in a little while you will cross a creek bed, you will make a quick right. Follow this trail all the way until you reach the forest and look for flagging on your right. Once you are here you will begin the climb up to the saddle. Some parts may be steep but just keep heading up to the saddle.  Once you clear the forest, look back and enjoy the views. In about an hour you will be at the saddle, to your left you will see a radio tower on top of a mountain, this Mt Cokely.  However to the right is where we are heading, Mt. Arrowsmith.  Head along this way for about 10 minutes until you can make a left and safely leave the bumps.  The trail then goes just below all the gullies coming down from Mt. Arrowsmith and you will be going up the 4th gully or so (take a look at the pictures to get a good idea of where you need to go).  At this section depending on the snow conditions it will be time to put on your crampons and get your ice axe ready.  Once you make it up the snow field you will see the steeper snow gully to your right.  Head up this way and soon you will be on top.  Have a break here and enjoy the views, the next section is where the real fun starts!  From the pictures you can see that the route heads just leftish of the nose.  Take your time and look for the hand holds, there are plenty of them and the rock is of good quality.  The entire scramble on the nose takes about 40 minutes or so.  Once you finish the nose section head straight for the summit of Arrowsmith and write yourself into the log book.  Now you can either head down the way you came or if you parked another vehicle at the last bend of the switch backs or you just feel like, you can head down Brugger?s Variation.  Head down the way you came up towards the other radio tower and before you get to the tower head left (this is the Judges route).  Follow this route for about 5 minutes and then you will head right.  The terrain gets steep here and you should be able to see a couple of gullys.  You are heading towards the first gully (check the pictures for what you are looking for).  You will know you are at the right spot because on the right wall there are a couple of pitons hammered in.  Depending on the conditions you may want to use the pitons to belay yourself down or pound in a snow stake.  Once you make you way down the gully, head down towards the woods and you should see some flagging.  You want to stay on the left of the creekriver on your descent.  The trail downwards will spit you out by the creek, at this point you will cross the creek and head upwards to road.  Hope you had fun.\r",
    "directions": "Follow highway 4 out to Port Alberni, at the top of the bump before Port Alberni as you start heading down into Port Alberni you will see a left turning lane, make a left here. In about 30 minutes you will be at the trail head, watch for logging trucks. Drive about 3 km and then turn left on Cameron River Main. Drive about 8 km to the Pass Main turn left. You will drive about 7km up the mountain and then park on the side of the road on a large bend with large concrete blocks, the first concrete block has a toilet paper dispenser! Remember on the way back, you will come to a fork in the road, you want to make a right here. The road condition at the time was a bit rough but nothing most cars couldn't handle (assuming you don't mind roughing your car a bit) and all car based SUVs.  In winter it all depends on snow conditions even with chains be prepared to turn around.",
    "geohash": "c0z2h",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/5516/reg_IMG-4950-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5516/reg_IMG-4951-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5516/reg_IMG-4957-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5516/reg_IMG-4973-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5516/reg_IMG-4999-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5516/reg_IMG-5004-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5516/reg_IMG-5019-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5516/reg_IMG-5024-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5516/reg_IMG-5036-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5516/reg_IMG-5041-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5516/narrow_IMG-4981-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5516/narrow_IMG-4987-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5516/narrow_IMG-4993-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5516/narrow_IMG-4995-Large--4612.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mt-arrowsmith-snow-nose-near-port-alberni-bc-5516",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring",
        "Stars": 5,
        "Time": "7 hrs",
        "Total Distance": "7 km",
        "Town": "Port Alberni, BC",
        "Type": "out-and-back"
    },
    "title": "Mt. Arrowsmith - Snow Nose",
    "trail_id": "5516"
}