{
    "description": "The trail to McNair cabin starts at the parking lot and ends at the foot of Panthers Peak and just in front of McNair Lake. The trail is fairly well marked with orange markers. Along the way you will come across Edwards Lake and then about a kilometre after Edwards Lake you will come across Edwards Lake cabin about 4.5 km into the trail. The trail after Edwards Lake cabin wanders down to Chapman creek, and then onto Chapman Lake which is surrounded by Mt Steele, Tetrahedron peak, and Panthers Peak. Summertime users should have good hiking boots because of mud and rock and in the wintertime watch for avalanches! This area is the Sunshine Coasts watershed and is also a provincial park so checking with B.C Parks before coming would be a good idea. The surrounding mountains are beautiful and the sunset can be just breathtaking so remember to bring a camera. There is GPS data attached to this trail (see \"download GPS\"), which if loaded into your GPS can help you find route points.",
    "directions": "Catch the ferry from Horseshoe Bay (Vancouver) to Langdale (Sunshine Coast)--it is a 45 minute ride. Drive from Langdale to Sechelt--roughly a 1 hour drive. Sechelt is a small town, but should have a few last minute purchases if needed. From Sechelt drive 30 minutes northeast towards Tuwanek.  You will go past Porpoise Bay Park, but keep following main road. You will drive over a bridge, Grey Creek, and about 300 hundred yards after you will come to a logging road on your right. This is Jackson Bros. Main logging road.  There is usually not much logging, but just take your time and drive with lights on. From the pavement to the parking lot you will drive for 30-45 minutes. This is a 2-wheel drive road but in the winter I suggest a 4-wheel drive (maybe chains). Once you arrive at the trailhead, park the vehicle and begin a great adventure into the coastal beauty.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/552/reg_EdwardsLakecabin.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/552/reg_McNairSunset.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/552/reg_MtSteelefromMcNairCabin.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/552/reg_P2080142-11571.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/552/reg_P2230006-11571.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/552/reg_P2260048-11571.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/552/topo_McNairlakecabin_best1_.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mcnair-cabin-tetrahedron-park-near-sechelt-bc-552",
    "stats": {
        "Activities": "snowshoe hike ski-bc ski-xc",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "7 hrs",
        "Total Distance": "10 km",
        "Town": "Sechelt, BC",
        "Type": "out-and-back"
    },
    "title": "McNair Cabin (Tetrahedron Park)",
    "trail_id": "552"
}