{
    "description": "There are a tremendous amount of options available around the Comox Lake Dam area, consult the map for more options.  The route described here is for the Tomato Creek route.  This route takes approximately 2 hours and is 6 kms long.  Views from the top are of the Comox Glacier and overlooking Comox Lake.  The trail is easy to follow and is in very good shape.  This is a great trail for trail running and be careful of the mountain bikers that also use this trail.\r\r     From the parking area head back up the road and head across the logging road to a deactivated logging road.  Climb over the debris and follow this almost all the way to the lake.  Just before you get to the end you will see the trail veer right around a deep pit.  You will now be heading beside a clear cut.  Follow this trail.  The trail eventually heads into the woods, you will see a sign for the ecological reserve.  You will also pass over a number of small bridges.  Follow the main trail and eventually it starts to gain elevation.  It takes about 30 minutes to hike to the top.  From here you can see the Comox Glacier and over the Comox Lake.\r",
    "directions": "In Courtenay follow Lake Trail road towards Comox Lake.  When you get to the Comox Main Logging Road intersection make a left.  This road can be rough in spots, big pot holes, so watch where you go.  Follow this road past the Courtenay Fish and Game club, stay right, at this point the road becomes gravel.  If you care about your vehicle you may slow down at this point.  In 5 minutes you will be going over the dam and you can see to the right where you will be parking.  Make a right just past the dam and go down the dirt road and park in the parking lot.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/5520/reg_COmoxDam-4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5520/reg_IMG-5209-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5520/reg_IMG-5210-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5520/reg_IMG-5211-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5520/reg_IMG-5212-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5520/reg_IMG-5213-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5520/reg_IMG-5214-Large--4612.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/tomato-creek-near-courtenay-bc-5520",
    "stats": {
        "Activities": "mtn-bike hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "6 km",
        "Town": "Courtenay, BC",
        "Type": "out-and-back"
    },
    "title": "Tomato Creek",
    "trail_id": "5520"
}