{
    "description": "Mt. Kitchener, 1457 meters, provides a great view of the coast mountains across the Johnstone straight, Mt. Victoria and surrounding mountains.  The trail is an easy trail with one rock bluff to negotiate, it is well flagged and takes about 1.5 hours to get to the top, you will spend more time in the car then on the trail! But it is worth it.  Total distance is about 5 kms.  The GPS has the tracks from the highway up to the top so that you can navigate the logging road easier incase things change.\r\r     From the parking area you will see some flagging flapping just beyond where you parked up hill from you.  Follow this flagging and in a short time you will be in the trees.  Keep going on this trail, watching out for flagging.  The trail is very well marked and there is nothing really to report about it.  In an hour you will come to a rock bluff, take your time and slowly make your way up.  As you get to the top you will notice to your right a peak, this is Mt. Kitchener.  Head straight ahead and once you get in a bit of a saddle make your way right and head to the top where there is a rock cairn waiting for you.  You made it to the top!!\r\r     A US navy Neptune bomber crashed in the 1950s??  The wreckage is still visible on the north slopes of Mt. Kitchener.  To find the bomber, from the top of Mt. Kitchener head down along the ridge.  Go over the first bump and back up.  Now, start looking down on your right.  It is hard to see but if I told you exactly where it is then it wouldn?t be as great of an accomplishment. Good luck!\r",
    "directions": "Head towards Sayward.  Before you get to Sayward you will see Big Tree Main on the right.  Head up this road for the next 6 kms.  Avoid all side roads, stick to the main road.  After 6 kms you will see a road sign for BT 1720, make a left here and avoid BT 1720.    After about 1 km, hang a left at the rock pile.  Follow this road for about 2 kms.  Beware of the cross ditches in this section, all can be easily crossed by going slow enough.  Keep going on this road right to the very end you will see a large area suitable for 6-7 cars to park.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/5521/reg_IMG-0964-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5521/reg_IMG-0966-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5521/reg_IMG-0980-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5521/reg_IMG-5275-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5521/reg_IMG-5282-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5521/reg_IMG-5283-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5521/reg_IMG-5284-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5521/reg_IMG-5293-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5521/reg_IMG-5295-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5521/reg_IMG-5296-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5521/reg_IMG-5297-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5521/reg_IMG-5304-Large--4612.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mt-kitchener-near-campbell-river-bc-5521",
    "stats": {
        "Activities": "ski-bc hike snowshoe",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "5 km",
        "Town": "Campbell River, BC",
        "Type": "out-and-back"
    },
    "title": "Mt. Kitchener",
    "trail_id": "5521"
}