{
    "description": "Rambler Peak is a great destination.  It is the fifth highest peak on the island at 2105 meters.  The views of Elkhorn and the Golden Hinde are fantastic from up here and the many other peaks.  There are many interesting routes up Rambler, the one described here takes you up the Spiral Staircase.  This trip could be done in 2 days, but most will do it in three, half a day in, a summit day and a half day out, it is 36 kilometers round trip.  The summit day may take somewhere around 8-12 hours depending on the group and conditions.  We made camp in a non-managed area, about an hour and a half from the BC parks backcountry camp area.  So you could stay at the BC parks area if you want a shorter hike in but longer summit day.\r\r     Follow the Elk River Trail until you get to the bridge that crosses the Elk River, this should take you about 3 hours to get here.  Go across the bridge and head up beside the Elk River.  In about a 100 hundred feet, look for flagging, rock cairns and a trail on your left.  If you get to a sign pointing you a head to Landslide lake, you have gone too far.  Follow the flagging and the beaten trail until you get to the dry creek bed.  You will see massive avalanche debris along the creek bed.  When you can?t walk on the creek anymore, head back into the woods and you should come across some nice flat areas, this is the area to setup camp.  It should take you about 45 minutes to get here.\r\r      The next day, head up the valley.  For the next hour you will be heading through some thick bush.  Follow the sparse flagging and push your way through.  The next 30 minutes the bush thins out and then you will be in the clear.  Stay to the left of the creek and keep going up the valley.  After a little while you will see ahead of you the Elk Pass.  You have the option of going up to the pass and following the ridge to your left or as you get close to Elk Pass, you will see on your left a steep slope, there may be snow here.  Head up this slope.  Once you get to the top, you will be able to see the East Gully on your left in the distance.  Make you way over there by heading along the base of rock.  Make your way up the steep Gulley, be careful there may be some loose rock here.  At the top here, make your way around on the left of the snow (depending on the year) and in a little while you will see a narrow gulley on your left.  If there is snow climb your way to the top of Rambler.  If there is not snow (as was the case when I climbed it) make you way up slowly and carefully.  The amount of loose rock here is a real safety hazard.  Once you get to the top of the couloirs, you will have to scramble up a small rock wall and you are on top.  Enjoy the views.\r\r     If you are attempting Rambler, you will need to bring along crampons, a mountaineering axe and a helmet.  Depending on your climbing level you may a rope to help you down with in which case bring some slings for the rock anchors.  \r",
    "directions": "Make your way to Campbell River and then take highway 28 towards Gold River.  Park at the Elk River Trail head.  It should take about 1 hour from Campbell River.",
    "geohash": "c0y",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/5522/reg_IMG-5422-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5522/reg_IMG-5431-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5522/reg_IMG-5432-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5522/reg_IMG-5445-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5522/reg_IMG-5468-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5522/reg_IMG-5471-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5522/reg_IMG-5474-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5522/reg_IMG-5484-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5522/reg_IMG-5501-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5522/reg_IMG-5506-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5522/reg_best1_IMG-5463-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5522/narrow_IMG-5454-Large--4612.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/rambler-peak-near-campbell-river-bc-5522",
    "stats": {
        "Activities": "hike climb",
        "From": "",
        "Seasons": "summer spring",
        "Stars": 5,
        "Time": "21 hrs",
        "Total Distance": "36 km",
        "Town": "Campbell River, BC",
        "Type": "out-and-back"
    },
    "title": "Rambler Peak",
    "trail_id": "5522"
}