{
    "description": "Mt. Horne is the mountain right behind Cathedra Grove Provincial Park.  It is a very steep ascentdescent but views from the top are of the Port Alberni valley, Mt . Arrowsmith and the Johnstone Straight.  Depending on how good you are with steep trails and coming down them, this hike can take somewhere between 4-5 hours or even shorter or longer.  This is a linear hike but a circular route does exist but I lost it in the clear cut, so I recommend you head down the same way you came up.  I highly recommend hiking poles for this hike to help your knees out.     Park on the North side of Cathedral Grove Provincial Park.  Take the trail on the left of the out houses and in minute look for a trail on your left.  It is just past the root note sign on the right.  If you go past a fallen log on the trail that has been chained sawed, you have gone too far.  This trail will take you to a gravel road, once at the gravel road, make a right.  After about 5 minutes you will see some cabins on the lake.  At the 2nd cabin you will see some flagging tape on your left, follow this trail.  This short but steep trail will get you warmed up for the real work about to come.  At the end of this trail you will come to the old railroad tracks, make a right and follow the tracks.  Just past a rock fall on the tracks you will see a trail on the left with a rope to help you up.  Follow this trail.  Keep following this steep trail until you get to the saddle between Mt. Horne and Mt. Wesley.  You will see some flagging on the left, follow this for the next little while.  In about 5 minutes you will come to a point where the trail veers left but also goes straight (blue flagging), either one will get you where you need to go.  I went left because it involved less bush whacking (5 minutes tops).  At the end of the trail is a logging road, make a left and follow the logging road.  Keep following the logging road (approx. 20 minutes) until you see lots of flagging on the right and the road here is wide enough to turn around in.  Once again follow the flagging tape, at some points the flagging tape seems to vanish, just look around a bit and you should be able to pick up the trail or the flagging.  In no time you will be on top of Mt. Horne.  Sign into the registry that is located in the rock cairn.  If you feel brave and want to make it a circular hike, the trail is located facing Port Alberni.  It starts off good but once you hit the clear cut you are on your own.  Good Luck!",
    "directions": "Cathedral Grove Provincial Park is located between Qualicum Beach and Port Alberni on Hwy #4, which runs right through the park. From Hwy #19 and Hwy #19a take the exit to head west on Hwy #4 toward Port Alberni.  Then park on the north side of the park, on the right if you are coming from Qualicum Beach.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/5523/regIMG-6374-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5523/reg_100-3012-8783_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5523/reg_IMG-6369-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5523/reg_IMG-6372-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5523/reg_IMG-6373-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5523/reg_IMG-6375-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5523/reg_image.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mt-horne-near-port-alberni-bc-5523",
    "stats": {
        "Activities": "snowshoe hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 2,
        "Time": "4 hrs",
        "Total Distance": "5 km",
        "Town": "Port Alberni, BC",
        "Type": "out-and-back"
    },
    "title": "Mt. Horne",
    "trail_id": "5523"
}