{
    "description": "Acadia Beach is located between Spanish Banks and Wreck Beach on the northwest tip of the University of British Columbia. \r\n\r\nFrom the parking lot there is an easy trail leading down to the beach. This beach ranges from sandy to rocky with lots of logs. There are a few places where you have to scramble over the logs. This terrain makes Acadia Beach less popular with sun bathers and perfect for walking along. There are quite a few nice spots to explore tidal pools and take photos. \r\n\r\nThere is no official trail on the beach, however by wandering west you will reach Tower Beach which is marked by two WWII Watch Towers built to look for Japanese submarines. Beyond Tower Beach lies Wreck Beach, Vancouver's only official nude beach. \r\n\r\nThere are several paths leading up from the beach to the top of the bluffs. Trail #4 actually comes out behind the UBC Museum of Anthropology. Walking back to the parking lot along the bluffs has some great views of Georgia Strait and the opening of Burrard Inlet. There is GPS data attached to this trail (see \"download GPS\"), which if loaded into your GPS can help you find route points.",
    "directions": "The parking lot is just off of NW Marine Drive on the north side of the road. There is a sign there that says the parking lot gates are closed between 5 pm and 8 am.\r",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/553/reg_heron.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/553/reg_pointweb.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/553/reg_redlogsweb.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/553/topo_Acadiacropweb.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/acadia-beach-walk-near-vancouver-bc-553",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "5 km",
        "Town": "Vancouver, BC",
        "Type": "out-and-back"
    },
    "title": "Acadia Beach Walk",
    "trail_id": "553"
}