{
    "description": "The Crater Rim trail is situated in the Whistler Interpretive Forest. Basically, this is a second growth forest that has a bunch of trails and informative signs/points where you can learn as you explore. \nThe trails are easy to follow during the warm months, however, you can loose the trail at several points when covered with snow during the winter (we lost it and travelled on the closed snow covered Westside Main Rd and picked up the trail further up). We didn't make it all the way to Crater Rim because we started snow shoeing in the late afternoon. However, we marked off trail waypoints to Logger's Lake and Crater Lake in the GPS data.\n There is GPS data attached to this trail (see \"download GPS\"), which if loaded into your GPS can help you find route points.\nThere is a cable car crossing and a suspension bridge that lead off to other trails as well. You can follow the river, go off to a lake, and see an extinct crater rim. With good weather you can see Black Tusk as well.",
    "directions": "Access to the Crater Rim trail is just south of Whistler. Follow the signs for the Whistler Interpretive Forest and turn east at Function Junction and there are several areas to park. For a longer hike you can park in the first parking area just off to the left about 50 meters down the road. We parked further up the road and joined in on the trails at Waypoint 1. During the summer months this road connects to an unpaved road (Eastside Main) that goes to Chekamus Lake (another hike).",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/564/reg_DSCN6022.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/564/reg_DSCN6025.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/564/reg_river.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/564/topo_CraterRim.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/crater-rim-whistler-interpretive-forest-near-whistler-bc-564",
    "stats": {
        "Activities": "snowshoe hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "4 hrs",
        "Total Distance": "7 km",
        "Town": "Whistler, BC",
        "Type": "out-and-back"
    },
    "title": "Crater Rim - Whistler Interpretive Forest",
    "trail_id": "564"
}