{
    "description": "A moderately difficult ( at times ) trail that makes for a great day- hike, without really pushing it- and the time to relax for a while at the peak.  First section is all uphill through older- growth forest with some enormous stands of douglas fir- then follows a service road for about 1 1/2 km. until reaching Mosquito Creek spring ( really ) - here, Fromme is to the right- Grouse Mtn. to the left. Take Fromme trail ( well- marked ) and prepare for some rigorous climbing. terrain becomes markedly ' alpine- ish ' ( to say it resembles Jasper or Banff is not a stretch ) with superb stands of conifers and stately rock croppings. there is a small lake at one point. in summer, a wealth of blueberries. also many beautiful wild flowers. the north peak is a bony ridge with absolutely stunning views to the west and south. a short hike to the south ridge offers an escarpment with the advantage of horizontal sitting and- again- fabulous vistas to enjoy. Gray jays WILL pester you- be forewarned ! HINT: take ' Bob's Trail ( well- marked ) for your return. Bob's trail BEGINS at the south peak. After a good 1 hr 1/2- 2 hrs. hiking- including the crossing of many streams ( path is reasonably well- maintained ) you will exit at the service road mentioned earlier. Just walk downhill to trail leading to St. George's St.",
    "directions": "Car: Head north on Lonsdale Ave ( North Vancouver ) to Osborne Rd. Turn right. Go one long block to St. George's St. Turn left. Head north on St. George's St.  about 6 blocks- until you reach a cul- de- sac. You should be able to park your vehicle here Ok. If not- take a right on Woodlands ( last St. before cul- de- sac ) and go one block to St. Mary's. Turn left and drive uphill. should have no difficulty parking- safe, as well. From either parking location- head north on trail / road towards radio transmission tower ( you will see it- just head up trail / road and tower will become visible. As well- there are signs ( sporadic ) referring to various hiking trails. Trail you want is St. George's / Fromme Peak Trail. St. George's Trail BEGINS ' behind ' the radio tower. Approx. halfway up this trail ( between tower and service road ) you will cross the Baden Powell Trail- DO NOT confuse trails !\nBy bus: From Vancouver: Take the Seabus Ferry from Waterfront Station to Lonsdale Quay. At bus loop take Upper Lonsdale bus and get off at Osborne & Lonsdale. Walk north through Carisbrooke Park to Carisbrooke Road. Head east one block to St. George's St. Head north on St. George's until the street itself ends and forest begins. There is but one trail- take it uphill until radio transmission tower appears. St. George's / Fromme Peak Trail begins BEHIND tower.\nHINT: at the intersection of Queen's Rd. and Lonsdale ( 3 blocks before Osborne Rd. ) is a small ' village '. There is an excellent grocery store with great options for stocking up on supplies. A Starbucks and a pub as well.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/5690/reg_DSC02613-11896.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5690/reg_DSC02620-11896.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5690/reg_DSC02627-11896.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5690/reg_DSC02648-11896.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5690/reg_DSC02669-11896.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5690/reg_DSC02671-11896.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5690/reg_DSC02674-11896.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/fromme-mtn-near-north-vancouver-bc-5690",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "6 hrs",
        "Total Distance": "5 km",
        "Town": "North Vancouver, BC",
        "Type": "out-and-back"
    },
    "title": "Fromme Mtn.",
    "trail_id": "5690"
}