{
    "description": "British Columbia is widely recognized as the #1 dive destination in North America. This is a dive entry, but you can easily kayak around the Island, enjoying it's rich sea life from the surface.  Tribute Bay is an awesome sandy beach with warm water and you are just a 500m walk to the campsite and local funky grocery store.  Mountain biking is not too shabby on Hornby either, with trails like \"4 dead aliens\" and others.\r\n\r\nThe waters around Hornby Island are full of a rich variety of marine life. In any season, you can encounter Giant Pacific octopus, wolf eels, harbour seals, large lingcod and rockfish, colourful anemones and nudibranchs.\r\nHornby is also well known for its excellent 'big animal' dives.\r\n\r\nSixgill sharks are probably the best-known reason to dive Hornby. Swimming beside a sixgill is an experience of a lifetime! \r\n\r\nDuring winter, Stellar's and California sea lions congregate near Hornby to feed on migrating herring. They are curious and love to interact with divers.\r\n\r\nFor more information check out www.hornbyislanddiving.com",
    "directions": "HOW TO GET TO HORNBY ISLAND\r\n\r\nHornby Island is situated between the British Columbia mainland and Vancouver Island approximately 80 miles north-west of Vancouver. Most visitors arrive by car using the BC Ferry system. It can also be reached by floatplane from the South Terminal at Vancouver International Airport or by a scheduled flight from Vancouver to Comox.\r\n\r\nBy Public Transport\r\nTake the bus from Vancouver or Victoria to Buckley Bay (about 1 hour north of Nanaimo). Then walk on to the ferry to Denman Island. There is NO public transport on Denman Island so you need to ask someone on the ferry for a ride across Denman to the Hornby Island ferry. (This is a common activity and generally supported by all but the most selfish drivers). \r\n\r\nBy Car From Vancouver\r\nYou can find all ferry schedules, here at the BC Ferries site.\r\n\r\n\r\nTake the ferry from Horseshoe Bay to Nanaimo.  Upon reaching Vancouver Island you drive north on the new Island highway for about 50 minutes. Watch for the Hornby Island/Denman Island Ferry exit. The whole trip from Horseshoe Bay to Hornby Island can be done in about 5 hours. (Much longer on busy days.....up to 9 hours)\r\n\r\nAn alternate route is to take the ferry from Tswwassen to Duke Point (South of Nanaimo). The schedule is here. Upon arriving at Duke Point you should drive north on the new Island Highway (toward Campbell River) for about 1 hour and 10 minutes. Then you take the ferry to Denman and the next ferry on to Hornby Island. This trip would take about 5.5 hours\r\n\r\nBy Car From Victoria\r\nDrive north on the Island Highway until you see the Hornby Island/Denman Island Ferry signs. It takes about 4 hours from downtown Victoria to Hornby Island. \r\n\r\nBy Floatplane \r\nThis is the fastest and most expensive way to get here. You can call Harbour Air Seaplanes to charter a plane from the South Terminal to Hornby Island. They can be reached at 604-278-3478.  The rates start at $605 for up to 3 passengers and go to $1767 for a plane capable of carrying 18 passengers. This would take about 35 minutes from Vancouver to Hornby and is dependent on the weather.\r\n\r\nBy Scheduled Flight To Comox\r\nThis way continues to be a popular alternative to the time-consuming ferry rides. You would take a regular flight from Vancouver to Comox with Air Canada or Pacific Coastal. Before your flight you would make arrangements with the Water Taxi for a pick up at the Comox Marina.\r\nThe Water Taxi can be reached at 250-335-2321. You would get to the Comox Marina from the Comox Airport by local taxi. This trip would take about an hour and a half from Vancouver airport to the dock on Hornby Island.\r\nThere is now a direct flight from Calgary, Alberta to Comox.  And with the water taxi to Hornby you're a total trip time (Calgary airport to Ford Cove on Hornby Island) of about two hours.\r\nwww.hornbyisland.com\r\nSpecific Dive Areas\r\nFlora Islet\r\n\r\nThis is where we dive to see the sixgill sharks.  Very close to shore, a sheer wall of conglomerate rock drops off in steps to depths of hundreds of feet. This is a continuation of the famous Helliwell Bluffs underwater. You can pick a shelf at the right depth for you and follow it along. \r\n\r\nThe life on this wall is varied and colourful. Large lingcod, schools of quillback rockfish, juvenile herring and clusters of ghostly white cloud sponges are plentiful on this dive. \r\n\r\nToby Islet\r\n\r\nAnother great wall dive, this one is very close to home (only about a two-minute boat ride away).\r\n\r\nThis is a great site for consistent sightings of octopus and wolf eels, also well-known for its enormous crimson anemones and clown shrimp.\r\n\r\nNorris Rocks\r\n\r\nThis is a very popular winter dive. A huge herd of Stellar's and California sea lions haul out here as they wait for the herring spawn in early March. In the summer the rock is covered with a flock of nesting glaucous-winged gulls, and year round it is a popular haulout for shy harbour seals.\r\n\r\nThis rolling sandstone reef is also home to wolf eels, carpets of hydroid colonies, colourful tubeworms and large Puget Sound king crabs.\r\n\r\nChrome Island Light Station\r\n\r\nChrome Island has been in operation as a lighthouse since 1891. In December of 1900, the SS Alpha was wrecked by striking the island during a storm. \r\n\r\nLarge sections of hull plating are still intact. Machinery such as winches are also present. \r\n\r\nThis is a shallow dive (12 m/40' max), a good spot to see heart crabs, juvenile Puget Sound king crabs and wolf eels while exploring an historic shipwreck. \r\n\r\nFord Reef\r\n\r\nThis shore dive is practically in our front yard. An eelgrass meadow slopes to a rock drop off, broken boulders, and then flattens into sand flats.\r\n\r\nGreat both by day and by night, this dive is loved by open water students and professional photographers alike.\r\n\r\nHeart crabs, baby ratfish and sailfin sculpins are all found here, along with northern sunstars, sea peaches and a variety of nudibranchs. \r\n\r\nA new addition is the wreck of the fishing vessel \r\nCarloda N.\r\n\r\n\r",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/571/reg_bignose.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/571/reg_hook.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/571/reg_hornby.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/571/reg_lioneagl.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/571/reg_snowlion.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/571/reg_sunlions.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/571/narrow_Photos-2006-1204-38293.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/hornby-island-near-comox-bc-571",
    "stats": {
        "Activities": "sea-kayak",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "72 hrs",
        "Total Distance": "0 km",
        "Town": "Comox, BC",
        "Type": "out-and-back"
    },
    "title": "Hornby Island",
    "trail_id": "571"
}