{
    "description": "Note: Please also see the other posting in called \" Frosty Mountain Larch Meadows\" on trailpeak, with pictures, comments, an alternate description and GPS data.\r\nFirst you start from Lightning Lake and you go up through forests with pine, hemlock and cedar. There are a few viewpoints along the way. Below the Larch Plateau there are wildflowers and when you are on the Larch Plateau there are larch trees that are over 2000 years old. They are not that big but they lose their needles during the winter. In the fall their leaves turn a pretty orange colour. After the Larch Plateau you head up a very rocky trail and then you are at the top. At the top there are beautiful views of the surrounding mountains. This mountain is the highest mountain in Manning Park and will not disappoint. The trail continues down the mountain to Windy Joe Mountain and finishes near the Similkameen Canyon Nature Trail. Make sure to purchase topo maps for the area, and be able to determine position and gauge distance.  For an overview map of the Manning Trails, some of which (such as  Heather Trail\r\n) are also on Trailpeak, see the Manning Trail Map which is given out at the visitor centre in Manning Park.",
    "directions": "In Manning Park, you start on the south eastern end of Lightning Lake or start by the Similkameen river. \r\n\r\nTo get to Manning Park, simply drive East from Vancouver on Highway 1 through Hope, and then along Hwy 3 towards Princeton.  It will only take 2 to 3 hours.\r\n\r",
    "geohash": "c2d",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/578/long_Lwf10s.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/578/long_frosty3.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/578/reg_Lwf7s.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/578/topo_Lwf3map.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mount-frosty-near-princeton-bc-578",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 5,
        "Time": "4 hrs",
        "Total Distance": "18 km",
        "Town": "Princeton, BC",
        "Type": "out-and-back"
    },
    "title": "Mount Frosty",
    "trail_id": "578"
}