{
    "description": "Bootski Lake is a small alpine lake on the north flank of Mount Wapitik, about 80 km. southeast of Tumbler Ridge, BC.  The first  3.8 km. of the  trail is an old logging road through a clearcut and can be traveled with an ATV.  This section starts at the Wapiti Forest Service Road at an elevation of 4100 feet and continues up through switchbacks to an elevation of 4700 feet.  The remaining 2 km. of the trail is hiking only, and takes you to a ridge above the tree line where the lake is located at an elevation of 5900 feet.  The trail can be done as a day hike or you can camp on the ridge and explore the mountain.  Total return distance is 11.6km.\nThis trail starts 60km South and 400m higher than:",
    "directions": "From the intersection of Highways 29 and 52 on the south side of the town of Tumbler Ridge, BC follow highway 52 (Heritage Highway)  southeast for 46 km. to the junction of the Wapiti Forest Service Road.  \nTravel south on this road for 29 km. until you reach the bridge over the  Wapiti River. There is a Forest Service campground near the bridge.  To get to the Bootski Lake trailhead, continue south from the bridge for 6.7 km. to a dirt ATV trail on the southwest side of the road.  This is the trailhead.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/5780/reg_Bootski-Lake-trail-2-20157.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5780/reg_Bootski-Lake-trail-3-20157.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5780/reg_Bootski-Lake-trail-4-20157.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5780/reg_best1_Bootski-Lake-trail-1-20157.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/bootski-lake-near-tumbler-ridge-bc-5780",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 3,
        "Time": "12 hrs",
        "Total Distance": "12 km",
        "Town": "Tumbler Ridge, BC",
        "Type": "out-and-back"
    },
    "title": "Bootski Lake",
    "trail_id": "5780"
}