{
    "description": "This is a part of a third backcountry ski circuit option for skiing in theGaspesie National park in Quebec. It's in the Cascapedia sector, and includes La Pluvier, La Paruline, La Messange and La Huard huts. Onour three day trip, we kept to a small portion of the circuit, staying twonights at La Pluvier, and using the middle day to trip up to Pic du Brulefor some stunning views and a cold lunch.In the area, the posted backcountry ski trails include (starting at theBoussole trail head) Le Noroit route to Lac Cascapedia, Les Lacs route,and Les Chablis. Collectively, they make up an over 60K circuit, or twosmaller separate loops. We started with a baggage drop off at the trailhead for 8:30, where askidoo shuttle would deliver much of our bulky fresh food and winesupplies ahead of us at La Pluvier hut. Off we went, crossing a bridgeover Ste. Anne river. We were actually following a summer road; route11, headed South that would take us (and summer drivers) to Lac Cascapedia where a couple of huts and a campground sit on the banksof the lake. I'm not one to seek adventure by skiing a road, but at least as yougained elevation, skinning up, the views begin to open up. Behind us,the McGerrigle range of endless forest and hills shows itself, and to ourleft, small peaks begin to emerge above and beyond the foreground trees. From looking at the map, what you see to your left are Mont Ellis andMont du Milleu. This is a 10K trip to the hut, and for around 6-7K, you climb. After rounding a corner, things begin to top out, and for the remaining 2K, it's a smooth gradual descent to Lac Cascapedia. You've earned the right to take those skins off, and enjoy gravity's pull. Your day of work is almost over. Four hours including a lunch break gets you there, and when traveling in December, this is important info because it starts to get dark by 3:30pm. You want to get to your hut, organize your things and sort out your dinner before it gets totally dark. this getting to the hut can be a bit of a competition, because it's first-come-first-choice in picking the ideal and most private of the communal bunks in the hut. La Pluvier has a bed arrangement where one room holds two sets of stacked bunk beds, and two other rooms hold a pair of bunks each. If you go as a couple, you can see why. Now enjoying hut life in the chic chocs is done right with three elements. Good food, a good number of friends, and of course, good drink. Since the hut sleeps eight, and the park is in a french speaking region, having friends with you in a number that populates half or more of the space is good. We brought great food too. On our first night, we ate a cheese fondue appetizer which would have been enough for dinner itself, so we shared it with our fellow hut-mates. The food and the gas lantern we brought along were enough to make fast friends with the french speaking other half of the hut. It was a great evening. A beautiful sunset held promise of a nice day to come, and it didn't disappoint. Though cold, we all departed for a look off view called Pic du Brule, 5K North-West of the hut. No longer skiing along a road, theroute held densely snow covered trees, and a far cosier path to follow. We crossed Lac Cascapedia, and skinned upward once again along Les Lacs route. At one spot, we stopped to take in a magical experience of feeding grey jays peanuts right out of our hand. It's pretty cool to experience a wild bird fly up to you, land almost weightlessly on your bare finger, and remove a peanut from your palm. There's something to be said about mutual trust. At Lac Gouache, we branched right (left takes you to La Messange hut) to finish off the last section to a stunning view of the cliffs, and in the distance, the St.  Lawrence River. Heading back to Pluvier was a much faster experience, and upon passing Lac Gouache, I saw an icebow around the sun behind what I believe to have been Mont Ernest-Menard. These can be a landmark for weather to come, though I know not of what sort. We returned to Pluvier at nearly 3pm and started getting the chili ready for supper. Met our new hut-mates, and arranged things for theevening. One elderly french couple, were spending 20 days here in the backcountry, doing the hut circuits. Some days they would go for 20K from one hut to another, and they were in their seventies. There's something to live up to.On our last day, our friends left a bit earlier than we did, as they had new year's eve plans to attend to back in New Brunswick, but we caught up to them on the trail homeward. It was just as icy returning, as it was the day we left, with less ice in higher elevations. I ventured to go skinless, and rather enjoyed my rudimentary pack ladened tele turns when there was enough powder. My wife had to laugh when Imanaged my one and only face plant into said powder. No harm done. Lower down, I stuck to the track made by the snowmobile to stay in control. It was far less effort than it would have been to descend with the skins on.In all, this hut trip was high on fun and low on technical difficulty. Wenow can say we've been to most of the backcountry ski regions that the park has to offer for hut trips. Next time I might be persuaded to maintain a home base, and do day trips to places like champs de Mars, Mont Blanches-Lamontagne, and Mont Olivine. Shannon Burteast coast editor",
    "directions": "Entering Quebec from New Brunswick, take the 132 toward New Richmond, turning onto route 199 toward the National Parc de la Gaspesie. Twenty minutes past the Gite de la Mont Albert, lies the parking lot to the trailhead. (Boussole)",
    "geohash": "f88y",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/QC/5783/reg_IMG-5679-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/5783/reg_IMG-5680-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/5783/reg_IMG-5682-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/5783/reg_IMG-5684-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/5783/reg_IMG-5688-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/5783/reg_IMG-5707-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/5783/reg_IMG-5710-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/5783/reg_IMG-5722-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/5783/reg_IMG-5739-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/5783/reg_IMG-5761-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/5783/reg_IMG-5764-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/5783/reg_IMG-5770-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/5783/reg_IMG-5802-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/5783/reg_backlit-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/5783/reg_fondue-party-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/5783/reg_new-icebow-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/5783/IMG_5764.JPG",
        "https://trailpeak.com/storage//content/trails/Canada/QC/5783/narrow_IMG-5705-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/5783/narrow_IMG-5733-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/5783/narrow_IMG-5776-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/5783/narrow_IMG-5782-6702.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/pic-de-brule-bc-ski-gaspesie-national-park-near-cap-chat-pq-5783",
    "stats": {
        "Activities": "hike ski-bc",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "21 hrs",
        "Total Distance": "30 km",
        "Town": "Cap Chat, PQ",
        "Type": "out-and-back"
    },
    "title": "Pic de Brule -BC ski Gaspesie National Park",
    "trail_id": "5783"
}