{
    "description": "The trails of P3 of Corkstown (same area as the municipal campsite visible from the Queensway/417 heading to Kanata from downtown Ottawa) give you an hour of two of skiing in a spectacular forest with Canadian shield poking out of the slopes, and, on trail #11 you will get a few fun slopes breaking up the otherwise flat ski.You start out from P3, following a ski trail that takes you initially through a very pretty pine stand, especially if it's just snowed. Soon after, you are running alongside the Horse Farm heading due north and keeping your elevation. At the back of the park, you will get some twisty downhills and then you'll make your way along the back-side, looking up to the plateau above you. Then it's all up for a few minutes (nothing is big scale here), and, you continue on the plateau until you reach trail #12. You take #12 and it will bring you back north, turning you around in a loop, and return you south to your starting point of the loop  (intersection with trail #11 & #12).At this point, you can return the way you came, and enjoy the down and uphill again (the forest really is spectacular back there, with birch, giant white pine, and other species) i.e. the preferred route is just retracing your steps once you complete the loop at trail #12, making for a nice hour long loop.You can also make one giant loop back to the parking lot, if you get to the #11/#12 intersection (the inner loop now complete) and again take #12 for a bit (as if doing the inner loop again) you'll come to an old \"Nepean\" road barrier sign which you may have seen earlier. This signals a continuation south (towards Corkstown) and provides access to the old municipal campground area. The Nepean barriers are in fact great markers for where \"unofficial\" trails are located. So continue past the small barrier and likely you'll have other people's tracks to follow. Just ski along until the tracks take you left through the campground area, you'll go by public washrooms, and, the maintenance area, eventually picking up a skinny bush-trail reconnecting with another barrier (with Nepean on it) you saw early on in your ski out of the parking lot on trail #11. Check the geotagged pictures on the google map, you'll see what I mean by the Nepean barriers.You now just follow along #11 back to your car at the parking area. A few nice views back to Ottawa and over to the Gatineaus from the high points. A really pleasant area, with some diversity in the forest. A glimpse perhaps into what this entire area originally looked like.",
    "directions": "Corkstown Road off the Moodie exit on the #417 in Ottawa, Moodie is essentially Bells Corners. If coming from the east, exit at Moodie, and, go right until you connect with your first left. That is Corkstown road continuation, and you follow that back parallel to the #417 heading up over the hill to Kanata. But before you rise over the hill, keep your eyes peeled for P3 on the right.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/ON/5793/reg_DSC-0386-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/5793/reg_DSC-0387-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/5793/reg_DSC-0388-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/5793/reg_DSC-0390-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/5793/reg_DSC-0392-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/5793/reg_DSC-0393-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/5793/reg_DSC-0394-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/5793/reg_DSC-0395-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/5793/reg_DSC-0396-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/5793/reg_DSC-0397-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/5793/reg_DSC-0398-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/5793/reg_DSC-0399-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/5793/reg_DSC-0400-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/5793/reg_DSC-0401-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/5793/reg_DSC-0402-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/5793/reg_DSC-0403-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/5793/reg_DSC-0404-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/5793/reg_DSC-0412-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/5793/reg_DSC-0413-5.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/p3-greenbelt-xc-ski-near-ottawa-on-5793",
    "stats": {
        "Activities": "ski-xc",
        "From": "",
        "Seasons": "winter",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "5 km",
        "Town": "Ottawa, ON",
        "Type": "out-and-back"
    },
    "title": "P3 Greenbelt XC Ski",
    "trail_id": "5793"
}