{
    "description": "Phelps Mountain is 1 of the 46 high peaks in the Adirondacks.  The trail itself is relatively easy.  This is a great trail for beginners that offers a fantastic view of Marcy, Algonquin and Colden among other high peaks.  The summit is small but rather unspoiled unlike many other peaks.  \r\rThe first 2.3 miles of the hike (blue trail markers) from the Adirondak Loj takes you to the always remarkable Marcy Damn.  Straight beyond the bridge over the damn, take a sharp right toward Marcy/Phelps for a little over 1 mile.  The incline begins to get a little steeper, but nothing strenuous.  Pass the High falls bridge until you see the turn off for Phelps.  At this point, there is only 1 mile remaining.  The ascent (red trail markers) is much more arduous than the previous 3 miles, however the short distance makes up for it. \r\rPrimarily spring but also including fall and wet summer trail conditions are typically muddy, especially beyond Marcy Damn.  Winter conditions (with broken trail) is easier yet and offers an amazing view.  I personally recommend, and prefer, a winter hike.",
    "directions": "FROM THE SOUTH: Take the Adirondack Northway (I-87) to Exit 30. Turn left on Route 73 toward Keene and Lake Placid, continue on Route 73 for 26.5 miles. Turn left on Adirondak Loj Road (High Peaks Trailhead sign). It is five miles to the Loj.\r\rFROM THE NORTH: Take the Adirondack Northway (I-87) to Exit 34, Keeseville. Follow Route 9N to Jay and Route 86 to Lake Placid. Turn left on Route 73 before going through Lake Placid. In three miles look for the High Peaks Trailhead sign and turn right on Adirondak Loj Road. It is five miles to the Loj.\r\rFROM THE WEST: Take Route 3 or Route 86 into Saranac Lake. Continue on Route 86 through Lake Placid. At the third traffic light, turn right on to Route 73 towards Keene. In three miles look for the High Peaks Trailhead sign and turn right onto the Adirondak Loj Road. It is five miles to the Loj.\r\r-Source: http://www.adk.org/ad_loj/",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/NY/5797/reg_Winter08-001-20318.jpg",
        "https://trailpeak.com/storage//content/trails/US/NY/5797/reg_Winter08-004-20318.jpg",
        "https://trailpeak.com/storage//content/trails/US/NY/5797/reg_Winter08-005-20318.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/phelps-mountain-near-lake-placid-ny-5797",
    "stats": {
        "Activities": "hike snowshoe",
        "From": "",
        "Seasons": "summer fall winter",
        "Stars": 4,
        "Time": "5 hrs",
        "Total Distance": "14 km",
        "Town": "Lake Placid, NY",
        "Type": "out-and-back"
    },
    "title": "Phelps Mountain",
    "trail_id": "5797"
}