{
    "description": "Ask anyone in Rossland the way to Deer Park Mountain and you'll get a scrunch-face of confusion in response. The locals know it almost exclusively as A-hole summit because the hill resembles a symmetrical rounded buttocks when viewed from town.\rWhatever you call it, it's a nice outing and a multi-use trail and, best of all,  it's not on the maps so you'd be really unlucky to come across another human being. The trail is nice because it features a gentle ascent through a sparse cedar forest brazen, a quick summit to a lovely panorama, and an easy descent along a dirt road  (or reverse that). \rThe trail begins in the trailer park and up Drake's road. In the summer there's a parking pull-out about 200m up the dirt road, but this isn't plowed in the winter so you need to park on the main road a little lower down. Ignore a spur to the left (signed Drake's trail - a whole other loop) and after the first bend keep your eyes peeled for the wide swath cleared for a pipeline (orange posts mark the line - hard to miss, really) and look west (rt). You will see a track going uphill into the woods mere meters from where you stand. There are no posts or markers, but the trail is an obvious one (except after a fresh snowfall).\rFollow this through the forest and in about 1 hour (add 15mins more on skis or snowshoes) the trail levels out and opens up into treed meadow. The trail then meanders through willow brush and takes a sharp left turn that will eventually double you back around the peak on your left. The land opens up considerably then, and it is obvious you are at height. The trail will then descend somewhat, along the edge of a low hill, until it meets up with the main road.\rAt the road turn left (moderately uphill); you should now be heading back toward where you parked (northish) though it won't feel like it. About 5 minutes along the road you will note you've reached a high point. Scan right for a boot-beaten path (one of several) that offers a steep but short (less than 5 minutes) ascent to the summit, where you will find sweeping views of Red mountain, Rossland, and the valleys and hills leading to Washington and Idaho. There is also a hack-job bench and an old survey post from the mining era. \rOnce you have had your fill of loveliness, return to the road along the path of your choice and continue the descent. In 20 minutes (much, much less on skis or a bike) you will find yourself at the pipeline junction, continue down along the main road and in 10 minutes you will be reunited with your vehicle. \rOn skis it is recommended to go in the direction stated above as the forest trail is far too narrow in places to adequately snowplow. Bikers and walkers may want to go in reverse as the ascent is simpler along the road.",
    "directions": "From the mining museum (junction of hwy 3B and 22) go south perhaps 500m. The old cascade highway will pass on your right, then take the first turn on your left into the trailer park (black bear drive). After passing 3 or 4 driveways the road will curve left into the final driveway, or become dirt track straight ahead (or in winter will end with probable snowmobile tracks continuing on). In summer, park anywhere the dirt road is wide enough, or continue 2oo m uphill to an obvious plateau and pull-out. In winter, park along the main road anywhere, just leave room for local traffic to pass.\rNote - there will be no signs - if you use the rossland-trail hiking map it is trailhead G \"Drakes\" even though this hike is not listed on it.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/5798/long_valley-cloud-pan-1287.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5798/reg_perfect-winter-1287.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5798/reg_winter-path-1287.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5798/narrow_kat-on-drakes-1287.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/deer-park-ahole-summit-near-rossland-bc-5798",
    "stats": {
        "Activities": "mtn-bike ski-bc snowshoe",
        "From": "",
        "Seasons": "summer fall winter",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "6 km",
        "Town": "Rossland, BC",
        "Type": "out-and-back"
    },
    "title": "Deer Park (A**hole) Summit",
    "trail_id": "5798"
}