{
    "description": "A number of winter trails that follow the basic routing of the mountain bike (and hike) trails of Kanata Lakes and South March Highlands in kanata make for a great day of nature at it's best.  This area features Canadian shield with lots of small ups and downs, the opportunity to bushwack and meet up with other trails in the network, and, some pristine forest preserved and complete with large eastern white pine, beaver ponds, lakes, and, a few high points for views.\nYou can be out here all day, but our loop would be typical of starting out on known trails, and, then doing a bit of exploring and weaving, climbing and bushwhacking, in one big loop eventually re-connecting with our way in.  It involves getting onto the largest lake in the region for some wide open views and easy  snowshoeing.\nGenerally the route we followed is from K2 and 2nd line where all the mountain bikers park in summer, and, where considerable new housing development is now in progress.  Go see these trails, they are fabulous, and, with lots of small peaks, this is ideal snowshoe terrain and very pretty.",
    "directions": "Take the 417 to Kanata, Hazeldean Rd, making your way South of the Queensway and following past all the high tech buildings towards March Rd.  As you go past all the tech (newbridge/alcatel) and so on, you'll see a blinking traffic light at \"Klondike\" road, turn left there and proceed through the new developments to where it corners and turns into 2nd line.  At that point, park, and go explore.  You can head east and explore established trails, or, go Straight South into the area we travelled on.  There will be many trampled trails to follow, but if you go in fairly far, consider a GPS and just follow the map that your GPS draws for you, and reconnect later as we did with our entry trail.\nYou may also consult the trails maps on Trailpeak for Kanata lakes for mountain biking, as several well known trails are described for this area from Inner thigh outer thigh to outback and Pete's wicked.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/ON/5800/reg_IMG-1011-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/5800/reg_IMG-1012-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/5800/reg_IMG-1013-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/5800/reg_IMG-1015-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/5800/reg_IMG-1016-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/5800/reg_IMG-1017-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/5800/reg_IMG-1019-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/5800/reg_IMG-1020-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/5800/reg_IMG-1021-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/5800/reg_IMG-1022-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/5800/reg_best1_IMG-1018-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/5800/reg_best2_IMG-1014-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/5800/narrow_IMG-3986-58183.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/south-march-highlands-snowshoe-kanata-lakes-near-ottawa-on-5800",
    "stats": {
        "Activities": "snowshoe ski-xc",
        "From": "",
        "Seasons": "winter",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "5 km",
        "Town": "Ottawa, ON",
        "Type": "out-and-back"
    },
    "title": "South March Highlands Snowshoe (Kanata Lakes)",
    "trail_id": "5800"
}