{
    "description": "This is a fantastic and little gem tucked behind Stittsville where the Trans-Canada trail cuts through wilderness on a beeline to Ashton. This particular loop features a side-trip through a cedar grove that is best visited in winter due to the wetness in Spring/Fall and bugs in summer.  The TC trail itself however is well used in all seasons.\nIf you take the loop through the forest first, you pass under and within a magical cedar grove, it's primordial, natural, and, you'd think you were in B.C.  As you finish the Cedar Grove loop (for lack of a better name) you exit right onto the Trans-Canada trail and you can then walk to Ashton if you so desire, but most just walk a few kilometers, past the deck/viewing area at the swamp (bird watching) and up to about the snowmobile trail crossing which is where we turned around.  It's really quite beautiful,as this the old railbed cuts through some pristine forest.  But my favourite part has to be the old cedar grove and you'll know the spot when you reach it.  The sun was beginning to set, and I was very happy with the pictures and shadows the sun cast.\nBecause it's close to the suburbs and a well enough trodden trail, you should have no trouble finding it.  Have a look at the map below.  Basically you start at the TC trail entry point off Abbott and Bell Streets and you may see other cars parked there.  There is a bridge (small creek crosser) where it all starts and there and clearly two trail options.  One is the TC trail (that you will return on) the other parallels the TC trail (a continuation of old Abbott Street which is now just a gravel path in simmer) with a stream/wetlands separating it from the TC trail.  Take the latter, which takes you up about 300m before turning at an exact right angle.  You follow that for 100m or less, then look for the trail entrance on the left in a clearing. It's not that hard to find as others will have trodden down the snow.  If you go too far, you are heading back to civilization.\nAt this point you are traversing a small field with mixed pine, cedar and other bush along with some open field.  Before long however you are in the thick of it, and, generally you bear left so that you hit the wonderful Cedar Grove.  If trial and error doesn't work, consider getting a GPS and downloading the track from this trail listing,following the track and wayopints (in particular the one marked \"goleft\"), or try to have a general sense of where you are going, westerly then northerly initially, then looping to the South a bit and along the swamp's edge until you connect with the TC trail itself.  If you make a wrong turn or two, not a big deal, retrace your steps in the snow, and, this is part of the adventure, as I said, there will be well-packed down tracks to follow and in the summer, a trail to follow.  You don't even need snowshoes unless it's just recently dumped.\nNote: It looks like it would be very wet in Spring in this area.  Avoid then, however, the trans-Canada trail (a bee-line to Ashton) is up on an old railway bed so this alternative will be available any time of the year.\nNo elevation gain to speak of, this trail is ideal for all abilities, and has appeal to those living in Stittsville/Kanata.",
    "directions": "Drive to Stittsville Ontario, taking main street to Abbott Take it to the end (Bell I believe or whatever the end is) and turn right, parking on the street just past the trans-Canada trail market about 100 feet up the road.  You will see other cars there likely.  The trans-Canada trail is well marked and a beeline as it follows a converted railway line.  It cuts through some very beautiful terrain, complete with mixed forests and stands of Eastern White Pine.  The loop we did involved us taking a parallel trail to the TC, then looping through a cedar grove along the swamps edge before rejoining the TC trail.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/ON/5801/reg_DSC-0187-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/5801/reg_DSC-0188-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/5801/reg_DSC-0189-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/5801/reg_DSC-0190-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/5801/reg_DSC-0191-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/5801/reg_DSC-0192-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/5801/reg_DSC-0193-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/5801/reg_DSC-0194-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/5801/reg_DSC-0196-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/5801/reg_DSC-0198-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/5801/reg_DSC-0199-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/5801/reg_DSC-0200-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/5801/reg_DSC-0201-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/5801/reg_DSC-0202-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/5801/reg_DSC-0203-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/5801/reg_DSC-0205-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/5801/reg_DSC-0206-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/5801/reg_DSC-0207-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/5801/reg_DSC-0210-5.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/stittsville-cedar-grove-and-tc-trail-near-ottawa-on-5801",
    "stats": {
        "Activities": "hike snowshoe",
        "From": "",
        "Seasons": "summer winter",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "5 km",
        "Town": "Ottawa, ON",
        "Type": "out-and-back"
    },
    "title": "Stittsville Cedar Grove and TC trail",
    "trail_id": "5801"
}