{
    "description": "The Boulder Gardens trail isn't terribly long, but it covers some very interesting and unique terrain. Through the course of this hike you will come across rock spires, small caves and crevasses and even a small tarn. The trail is maintained by \"The Wolverine Nordic  Mountain Society\" of Tumbler Ridge. There are orange trail markers and cautionary signs along the way. The trail basically follows up a open valley between sharp cliffs with the final destination being the open alpine. \r\rTrail maps and brochures can be found at \r\rhttp://www.pris.bc.ca/wnms/\r\rI hiked this trail back in 2006, and I had the place all to myself.... well except for the Grizzly that I managed to stubble into. Luckily for me he/she was more interested in berries than a two legged meal and I was able to sit at a safer distance than when we first met(30-35 ft.away) and watch as it leisurely wandered about eatting berries and grass.\r\rPlease forgive the quality of the photo's I've included, as it was a new camera to me at that time.",
    "directions": "Drive southwest from Tumbler Ridge on the Boundry Rd. for 21kms. Turn right onto the \"Core Lodge Road\". This road is radio controlled for the mining trucks that use it. Continue on this road for 13.3 kms. and turn right. Go another 1km., up two switch backs in the road and park at the trail head to your right.",
    "geohash": "c3cbr",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/5834/reg_Tumbler-camping-06-006-19947.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5834/reg_Tumbler-camping-06-008-19947.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5834/reg_Tumbler-camping-06-010-19947.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5834/reg_Tumbler-camping-06-017-19947.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5834/reg_Tumbler-camping-06-023-19947.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5834/reg_tumbler-bear-pics-009-19947.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/boulder-gardens-near-tumbler-ridge-bc-5834",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 4,
        "Time": "4 hrs",
        "Total Distance": "4 km",
        "Town": "Tumbler Ridge, BC",
        "Type": "out-and-back"
    },
    "title": "Boulder Gardens",
    "trail_id": "5834"
}