{
    "description": "This isn't actually a single trip but a composite of many day hikes that myself and others have taken.  I took the GPS tracks from all of these hikes and put them together to represent most of the known trails on the central portion of Mt Benson.  There may be a few other trails out there but I think this represents most of them.  If you know of others and have GPS tracks for them I'd love to get a copy of the gpx file and I'll add them to this summary.  Most of the trails in this summary are moderate to hard difficulty.  Many of the trails on this section of Mt Benson are quite steep.  In Spring, Summer and Fall, the trails are great for hiking and some mountain biking.  In winter there is some excellent snowshoeing to be had.  Note that although I've listed the trail at 40k you can hike smaller portions of the trails.",
    "directions": "There are 2 main ways to access these trails.  To get to the Witchcraft Lake trailhead, take Jinglepot road to Kilpatrick. Hang a right onto Bensonview Road. Follow this road right to the end and park along the side of the road.  The other trail begins near the north end of Westwood lake.  Take Jingle Pot Road West from Nanaimo, cross Hwy 19, Left on Westwood Road to end (don't go down Arbot road).  From the parking lot hike around the lake counter-clockwise and at the north end head up over the power lines.",
    "geohash": "c0xz",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/5838/reg_witchcraft-1-20572.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5838/reg_witchcraft-2-20572.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5838/reg_witchcraft-4-20572.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5838/reg_witchcraft-5-20572.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5838/reg_witchcraft-6-20572.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5838/reg_witchcraft-7-20572.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5838/narrow_witchcraft-3-20572.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mt-benson-central-portion-near-nanaimo-bc-5838",
    "stats": {
        "Activities": "snowshoe hike mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "6 hrs",
        "Total Distance": "40 km",
        "Town": "Nanaimo, BC",
        "Type": "out-and-back"
    },
    "title": "Mt. Benson - Central Portion",
    "trail_id": "5838"
}