{
    "description": "The old water main which once carried water from Sooke Lake to Victoria became inadequate and was retired yet the 1.5m diameter pipe still remains to this day. It is still intact more or less 40km all the way to Sooke. There is no reason why you have to walk the whole way.***UPDATE***Sooke Potholes to Harbourview RoadThe best way to get to the pipe from the Sooke Potholes is to drive all the way to parking lot #2. Note that there is a parking fee in the summer of $3. At the parking lot you will see a red hut which is also an old train station for the Galloping Goose. Behind it across the trail is a hiking trail that can be followed to reach the pipeline shortly.The pipeline through this section is beautiful an totally clear of plants, debris and slippery moss. You could probably follow it all the way to the Sooke Lake reservoir but the watershed is closed to the public and you could get in trouble. Until fall 2009, this pipe will still be active and carries water for the town of Sooke so don't be messing with the pipe. Anyway, as I have said, the whole section through the Sooke River valley is just perfect until you reach Charters Creek to the south. At this point, there is a HUGE wooden trestle and I mean this thing is intense as it dips down steeply into the ravine. You can take a service road down if approaching from the north but if you want to head south from it, there is a very steep and slippery slope to get up. Since many people don't go past this point, the pipe is really overgrown and hard to pass through except for the last 3km before the Harbourview Road access. I would recommend approaching from Harbourview Road though because there are some REALLY big concrete trestles to see.Harbourview Road to Glinz LakeThis section is completely clear and you feel like you're in the middle of nowhere. There are three trestles along this route; two of which are wooden so don't walk on them. A nice easy flat walk otherwise.Glinz Lake to Impala RoadThis section is probably the most visually stunning with the forests, the mossy rock bluffs and the three concrete and one wooden trestles. I highly recommend this section but it has debris you will have to climb over. We went through with saws and loppers and got much of the big stuff out of the way though. The one wooden trestle will require a bushwhack through deep salal. Another word of note is that Impala Road is steep and unpaved. Going up it, I started to loose traction as if I was on snow. There is a sign saying end of public road. Please do not go beyond this.The level moss covered pipe can be walked upon with ease. There are also manholes spaced every so often that you can hop into. Make noise inside and you can hear the sound waves travel to the end and bounce back and forth!The pipe crosses some ravines where the pipe is made of wood to reduce weight. I would not recommend crossing these since the wood could be rotten. There are deer trails bypassing the trestles.Viewing the attached route, you can see that it twins this road in some places or goes out in the middle of nowhere. I don't recommend going alone due to wildlife hazards or possibly slipping on the moss, even though it is not a long fall.Mt. Wells/Humpback RoadWe attempted to walk the pipe along this section but it passed very close to a person's backyard and a dog started barking. The woman came out and started yelling at us and saying it was private property. I can assure you it is not because I talked to the CRD water manager on the phone and he said they still own the corridor. Anyway, she probably had a grow-op and it was a very unpleasant experience from then on. If you want to hike this, by all means do because you are within your rights to.See this link to prove that the CRD does own the corridorNatural Area AtlasI should add that you may see some No Trespassing signs put up the the Greater Victoria Water District. For one thing, the GVWD doesn't exist anymore and secondly, they're from the era when the pipe was still used. I have talked to the CRD water manager on the phone and he said that it's okay to hike on the pipe but to understand that it is AT YOUR OWN RISK! Leave the dogs at home too since they could slip off and not be able to get back on.Use good judgement and risk assessment as terrain surrounding the pipe can change suddenly, testing your skills. Some areas require serious climbing, while other areas are an easy, level walk.",
    "directions": "Proceed along Highway 1 towards Nanaimo and turn left onto Westshore Parkway. Turn right after entering the traffic circle on Amy Rd and enter onto Humpback Road following the signs to Mt. Wells Regional Park. You can then park in the gravel parking lot where you will see the concrete pipe going into the lake to the south of you.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/5843/reg_PICT4463-18988.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5843/reg_PICT4464-18988.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5843/reg_PICT4466-18988.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5843/reg_PICT4467-18988.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5843/reg_PICT4468-18988.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5843/reg_PICT4469-18988.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5843/reg_PICT4470-18988.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5843/reg_PICT4471-18988.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5843/reg_PICT4473-18988.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5843/reg_PIPE1-18988.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5843/reg_n514527297-369118-3840-18988.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5843/reg_n514527297-369125-409-18988.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5843/reg_n514527297-369126-1231-18988.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5843/reg_n604325274-1298165-3444-18988.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5843/reg_pipe.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5843/narrow_n514527297-369116-1643-18988.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5843/narrow_n514527297-369117-2911-18988.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5843/narrow_n716295437-4814577-1825-18988.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5843/narrow_n716295437-4814578-2109-18988.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/sooke-watermain-flow-line-near-victoria-bc-5843",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "12 hrs",
        "Total Distance": "44 km",
        "Town": "Victoria, BC",
        "Type": "out-and-back"
    },
    "title": "Sooke Watermain (Flow line)",
    "trail_id": "5843"
}