{
    "description": "This is rated as moderate for hikers, and, difficult (black) for cross-country skiers.  Trail #8 branches off  the main ski trail out of the Kingsmere Parking lot to some of the highest points in the Gatineaus, with incredible views looking over to King Mountain and Ottawa in behind that.  You eventually get to a ridge top on trail #8 where your trail skirts the very lip of the ridge giving you unparalleled views.  After some period of time up top (and after considerable climbing to get to this ridge) you have some white knuckle downhills and curves you complete your loop on trail #17.  No downhills too long, so you can manage your speed, or, take your skis off if you are unsure.  Regardless, taking this back-country (ungroomed) route is completely worth it and one of my favourite loops in the Gatineaus.The initial ski out of Kingsmere has you take the main groomed ski corridor (trail #1) out of the Parking lot.  It's groomed with a set of ski tracks in each direction (see pictures), a veritable highway.  You have one climb that is significant, a small downhill, then you climb again.  As you are climbing the mountain, you will see a sign for trail #8 (about 800m into your ski) to the right.  At that point it's just one set of ungroomed tracks making it's way up the side of the hill.  CAUTION:  There are a few downhills here that cross creeks, and in Spring or even February, these can become ditches that would bring you to a sudden stop.  Look ahead.  Once you are done with those, you do some significant climbing and reach the ridge discussed above.  This is the payoff.As you descend off the ridge, you will come close to the parkway and see other skiers on the groomed trail. This is about your half-way mark and just stay on trail #17 for your return.  You are back-country skiing, and, so you will be treated to some gorgeous scenery as you wind your way around the back half of your loop.  Stay on Trail #17 (you've been on this for quite a while now), as trail 17 takes you back to your parking lot, once it reconvenes with the main groomed trail that takes you back to the parking area.  You'll know you are at this interssectin because you barrel down a hill onto the groomed section of trail #1, it will be a natural stopping (or falling) point.  Trail 17 does continue on the other side of the trail, however, for those content with the loop so far, turn right and follow (all down) until you retrace your initial steps back to the parking lot.  Superb loop.",
    "directions": "Kingsmere Parking lot is accessed by taking Old Chelsea main intersection (after the pub/restaurants) to the left on Ch Kingsmere (at the giant speedbump and intersection just past town if going thru Old Chelsea from Hwy #5 from Ottawa).   You follow the signs to Kingsmere a few kilometers, park at the P6 lot on the right.  Many skate and classic skiers using the groomed ski trails will use this parking lot, it could be full. There is overflow parking across the street.  This is the same parking lot used to access the skyline hiking trail (which is also a decent back-country route with great views).  Old Chelsea is the small town and major access point to the Gatineau park for adventure.  You get there by taking Howy #5 North from Ottawa, after crossing Champlain bridge, just stay on the Hwy you are on, it's #5 and follow some 15 minutes or so until you see signs for Old Chelsea.",
    "geohash": "f244",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/QC/5855/long_KingsmereMap-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/5855/regDSC-0444-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/5855/reg_DSC-0441-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/5855/reg_DSC-0442-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/5855/reg_DSC-0443-5.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/kingsmere-p7-8-17-loop-gatineau-park-near-gatineau-pq-5855",
    "stats": {
        "Activities": "hike ski-xc",
        "From": "",
        "Seasons": "winter fall summer",
        "Stars": 5,
        "Time": "2 hrs",
        "Total Distance": "7 km",
        "Town": "Gatineau, PQ",
        "Type": "out-and-back"
    },
    "title": "Kingsmere P7 -#8-#17 Loop - Gatineau Park",
    "trail_id": "5855"
}