{
    "description": "Sterling pass gives you a contrast to the open slick-rock hikes in the Sedona area.  You initially hike through a very pretty cool forest, with large trees (recovering from a fire/burn) and lots of wildflowers.  It's steep most of the way, much like a \"grouse grind in Vancouver\", and once you hit the open sun about 1/2 way up, watch out -- you'll bake.  There are trees and bush along the exposed areas to grab shade in -- I found myself taking at least 10 breaths in each thinly shaded area when I could -- these were my breaks.As you approach the top -- switch backing as you go -- you'll enjoy great views to the cliffs above you and beside you -- and the swallows will entertain you with their aerial maneuvers.  Finally you crest the pass. In April, I found snow at the top.  From here, you can return, or continue to Vultee Arch Trail.  But this was already my second hike of the day, and one more to go -- so after throwing a few ceremonial snowballs, and, taking a few pictures, it was back down.  I saw no one on the trail until the very end, a group of 5 guys was asking \"how hard it was\" after just a few feet from the start, and they already had their shirts off. \"You'll sweat!\" I answered.  For guided hiking and biking trips in Arizona, check out aoa-adventures.com.",
    "directions": "There is a metal sign marking the trail head, you will have to park on the side of the road also - or a few hundred metres back down the road at a camp-site pull off with road-side parking.  To get there head north on 89A towards Flagstaff out of Sedona for 6.2 miles of 9.9km.  Look to the steep side, and, an trailhead and sign if you can spot it.  More than likely, you'll see the Oak Creek USFS Camping area on the right a few hundred metres before the trail-head. Park on the side of the road where you can or at the camp area.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/AZ/5856/reg_DCIM235[N3493446W11175391T3E99B2ECH0644B8]-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/5856/reg_sterling-0002-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/5856/reg_sterling-0003-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/5856/reg_sterling-0004-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/5856/reg_sterling-0005-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/5856/reg_sterling-0006-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/5856/reg_sterling-0007-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/5856/reg_sterling-0008-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/5856/reg_sterling-0011-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/5856/reg_sterling-0012-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/5856/narrow_DCIM229[N3493377W11175729T3E99B04FH06866B]-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/5856/narrow_DCIM245[N3493479W11175184T3E99B3EEH063F99]-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/5856/narrow_best1_sterling-0001-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/5856/narrow_sterling-0009-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/5856/narrow_sterling-0010-5.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/sterling-pass-sedona-near-sedona-az-5856",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "6 km",
        "Town": "Sedona, AZ",
        "Type": "out-and-back"
    },
    "title": "Sterling Pass - Sedona",
    "trail_id": "5856"
}