{
    "description": "Wilson's North is 17km (10.6 mi) return, a moderate to at times steep climb taking you to the rim/plateau high above.  As you climb you get great views to the canyon walls behind you, and on the other side of the road from which you ascended.  Initially a small steep section levels off to an open area for views to the cliffs above you (you will climb up there) and behind.  Then you re-enter forested woods which are cool and like Sterling pass, full of wildflowers and large pine. Inside the forest canopy, you don't have long before it gets steep, and you'll find the cardio a feature of this hike, with switchbacks and gradually steeper terrain.  As you ascend the hanging valley, it will start to get really steep, and you'll climb over 1,000 feet in .5 mi.  I didn't get to the highest ridge on this trail, I ran out of time, being hike #3 for the day -- but I was before long talking myself into just a few more switchbacks.  Alas, I turned before the summit, and, resolved to come back another day.An easy trail to follow, well worn, a good deal of shade, and, a grunt at times.For Guided hiking trips in Arizona: See AOA-adventures>.",
    "directions": "This parking lot is easy to find, no need to park on the side of the road like Sterling Pass.  Just look for the Enciniso parking area, and park closest to the trail sign/markers.  It's about 8.5km (5.25 miles) out of Sedona up Hwy 89A.  There is a picnic area and likely other cars.",
    "geohash": "9w0w9",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/AZ/5857/reg_best1_wilsonn-0004-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/5857/reg_wilsonn-0002-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/5857/reg_wilsonn-0003-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/5857/reg_wilsonn-0005-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/5857/reg_wilsonn-0006-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/5857/reg_wilsonn-0007-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/5857/reg_wilsonn-0008-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/5857/reg_wilsonn-0009-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/5857/narrow_wilsonn-0001-5.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/wilson-north-sedona-near-sedona-az-5857",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "4 hrs",
        "Total Distance": "17 km",
        "Town": "Sedona, AZ",
        "Type": "out-and-back"
    },
    "title": "Wilson North - Sedona",
    "trail_id": "5857"
}