{
    "description": "Marg's Draw is a hemmed in area off Schnebly Hill Road between Sedona's Hotel/Restaurants on 179 and the Peaks in behind (like Snoopy's Rock) of Munds wilderness.\nThere are several access points, and since I was staying at the Days Inn, I literally walked out of the Hotel and up to the parking area (see the pictures of the trail maps and trail kiosk area) and trailhead.  You exit the parking lot and climb up the access path/gate and onto the bench-land area that is Marg's Draw.  There is one North-South Trail that runs you up and down the bench-lands and if you are a trail runner or just out to sample some Cactus and typical Sedona scenery, this is a convenient choice.  There are lots of unofficial trails, some that start out as trails and end up in Washes (like Marg's Draw itself).  Generally, locals want you to stay on official trails so as not to compromise the crytobiotic soil, which is living.  Please respect local signage.  The back-drop to this trail is the more remote \"Munds Mountain Wilderness\" only those with back-country experience and trail maps should venture into this area. Great views to Snoopy's Rock, to the Northeast.\nAll in all, you'll have a pleasant stroll with little elevation gain or loss, do as much as you like, then return to the trailhead you started on.",
    "directions": "Although you can start further up Schnebly Rd. (2.1 km up the road to the parking lot there, at higher elevation), those staying near Sombart Lane off 179 (before the Y) at one of the local Hotel/Motels like Days Inn, can simply walk out and up to the end of Sombart to the Trailhead.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/AZ/5858/reg_best1_margs-0010-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/5858/reg_margs-0001-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/5858/reg_margs-0002-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/5858/reg_margs-0003-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/5858/reg_margs-0004-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/5858/reg_margs-0005-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/5858/reg_margs-0008-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/5858/reg_margs-0011-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/5858/reg_margs-0013-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/5858/reg_margs-0014-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/5858/reg_margs-0015-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/5858/reg_margs-0016-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/5858/narrow_margs-0009-5.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/margs-draw-sedona-near-sedona-az-5858",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "5 km",
        "Town": "Sedona, AZ",
        "Type": "out-and-back"
    },
    "title": "Margs Draw - Sedona",
    "trail_id": "5858"
}