{
    "description": "Huckaby was my first \"warm up\" hike in Sedona.  Anxious to be in the canyons, red-rock trails, and cactus, this trail did not dissapoint.  It dips and crests like a rollercoaster, a real treat for the trail runner or casual hiker looking for some views.  Lots of wild-flowers in April, an easy trail to follow, at times it feels natural (when views of town are blocked), and at times it doesn't.  You do get views into Sedona though, and, eventually you end up along Oak Creek where you will likely see local teens hanging out and swimming. If you want to hike to a swimming hole -- do this trail (but possibly from the other end, ie. the bridge just north of town).  Your return is mostly up, so save some energy it's not a loop, which I had hoped for.The starting area out of the Parking lot is a fantastic hub for many trails, so if looking for more, I'd do a bit of Huckaby, then go on to do Munds, and after that follow an unofficial trail  up to Snoopy's Rock area on the cliffs in behind (steep and only for advanced hikers).  Regardless, there are lots of great rock formations, views, trees and flowers on Huckaby with lots of cactus and some great views.  Perfect family hike. You'll likely pass a few locals out for a stroll, maybe a dogwalker or two. There is some decent elevation gain and loss, so don't get me wrong, you will work some on this hike.But for a hike which starts out with great views and topography, it ends on a sandy creek-bed with (depending on the day) crowds of teens, this hike may be disapointing for some, or pure cool bliss for others.  So cut it short if you want to keep it natural, or, go with the flow and bring swim trunks and beach towel.  Convenient for those staying near Schnebly Hill Road and part of a network of trails that start from the same parking lot. Sedona traffic can really jam up at the choke points, so knowing where the nearby trails are is key.",
    "directions": "Go up about a mile on Schenbly Hill Road and park in the main trail parking lot and picnic area.  Note a lot of the Jeep tours will go past this  parking lot and past the paved road and onto rocky Jeep road which would be very rough on a regular car.  Hence, the popularity of this parking lot and the set of trails you can reach if you are in this part of town.  There is a picnic area and washrooms, and, a choice of more trails like Munds Wagon Trail and even an ascent on the other side of the road past Snoopy's Rock.  You can also reach the famed \"Hangover\" trail from here.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/AZ/5859/reg_huckaby-0001-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/5859/reg_huckaby-0002-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/5859/reg_huckaby-0003-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/5859/reg_huckaby-0004-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/5859/reg_huckaby-0005-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/5859/reg_huckaby-0006-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/5859/reg_huckaby-0007-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/5859/reg_huckaby-0008-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/5859/reg_huckaby-0010-5_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/5859/reg_huckaby-0011-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/5859/reg_huckaby-0012-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/5859/reg_huckaby-0014-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/5859/reg_huckaby-0015-5.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/huckaby-sedona-near-sedona-az-5859",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 2,
        "Time": "2 hrs",
        "Total Distance": "5 km",
        "Town": "Sedona, AZ",
        "Type": "out-and-back"
    },
    "title": "Huckaby - Sedona",
    "trail_id": "5859"
}