{
    "description": "I call this trail Snoopy's Rock, because it gets close to it, although goes past it and hikes up the saddle between two adjacent peaks.  The scenery is dramatic, with views back on Damfino Canyon as you climb. This trail is \"unofficial\" and may not be in the guide books, however, it was appealing to me because I found it was a well traveled trail that was relatively easy to follow, and the vertical pitch steep enough to appeal to fit/advanced hikers.  It's one of the few more challenging hikes off the Schnebly hill Rd. parking lot area, but make sure you do Hangover, it's great.  I first did Huckaby (heading down and back towards town) first, but was drawn to the peaks behind me leading up the mountain to what I later learned was Snoopy's rock. Following my nose for trails (after doing Huckaby) I followed Munds trail out of the parking lot until it intersected the Jeep road at it's first major elbow as the GPS map shows (you'll see JEEP tours on this road).  On the opposite side of the JEEP road, I noticed a Forestry service \"road closed\" yellow marker (no doubt mechanized vehicles had probably used these trails in the past) and followed what was obviously a well trodden trail up.  Marked by trail cairns and a cleared path across the boulder strewn slick-rock bench, it traversed the Snoopy side of Damfino Canyon, on a steady up before getting really steep.  It ascends a forested slope and I often needed to grab tree branches for a hold.  I heard other voices, and knew then that this area is fairly well used.Some rock cairns will help in route-finding, however, it's all up and the rock peaks above you are your general guide as you aim for the wide saddle past Snoopy's rock as per the Google Map.My heart was pounding but the views were great, and eventually I reached the saddle between two rocks for what was unbelievable views in both directions of the bench lands below (looking down on Marg's Draw area) and back to Munds Wilderness and Canyon walls behind me where I had come from.  I noted a steep trail descending the other side of the saddle, figuring this would connect with trails down below near Marg's Draw, but I was done for the day.Returning was slightly more difficult and I found it relatively easy to miss a switch-back turn on my original path up.  If you look at the GPS map, you'll see a small error loop near the top. There are steep drop offs in this area, so make sure you can follow your route in reverse. Note that few trails look the same when returning in the opposite direction, so be prepared to route-find on the way back.It's not a long hike, it is steep though offering great views from the top.  Tourist helicopters fly a path right over the same saddle you are perched in, no doubt Snoopy is popular not just with hikers.  This was one of the first hikes added to trailpeak.com for Sedona hikes, however, there are now about 30, just use the search engine and enter hiking and Sedona, AZ.  Some persoal favourites that are official USFS trails;  Bear, Wilson South, Sterling Pass, Cathedral (Templeton loop), Hangover via Munds, Brins, and others say Fay Canyon is worth it.For guided hiking and biking trips in Arizona, check out aoa-adventures.com.",
    "directions": "Follow the attached GPS breadcrumb trail, you'd continue past the 1 mi parking lot on Schebly hill, looking for obvious trails ascending the peaks just above you.  This one is marked with a yellow stake at road's edge.",
    "geohash": "9w0w3",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/AZ/5860/reg_best1_snoopy-0009-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/5860/reg_snoopy-0001-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/5860/reg_snoopy-0002-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/5860/reg_snoopy-0003-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/5860/reg_snoopy-0004-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/5860/reg_snoopy-0005-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/5860/reg_snoopy-0006-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/5860/reg_snoopy-0007-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/5860/reg_snoopy-0008-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/5860/reg_snoopy-0010-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/5860/reg_snoopy-0011-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/5860/reg_snoopy-0012-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/5860/reg_snoopy-0013-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/5860/reg_snoopy-0014-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/5860/reg_snoopy-0015-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/5860/reg_snoopy-0016-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/5860/reg_snoopy-0017-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/5860/reg_snoopy-0018-5.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/snoopys-rock-with-damfino-canyon-sedona-near-sedona-az-5860",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "5 km",
        "Town": "Sedona, AZ",
        "Type": "out-and-back"
    },
    "title": "Snoopys Rock with Damfino Canyon  - Sedona",
    "trail_id": "5860"
}