{
    "description": "The Kokopelli trail network has to be one of the premiere riding destinations in North America.  It features slick-rock, single-track over benchlands and grasslands. The single track here is unmatched.\nYou've got a range of riding levels -- from Rustlers (beginner) to Moore Fun, Mack, and Lions (difficult).  Moore Fun is close to the main parking lot and is technical riding up to a ridge line that gives the best views in the area.  You also get to scope out the trails below. If you continue on th high ridge-line, you get to do Mack, as I did, returning on Lions to do Mary's.\nFrom up top you can see the all-time favorite trails for most riders, being Mary's and Horesthief. Don't miss Horsethief.\nThe Fruita Fat tire festival is a great way to sample the trails (late April), or if you are an intermediate to advanced rider, you may consider visiting when it's less busy.\nSome of the trails in the attached GPS map here include; Moore Fun, Macks, Lions, Mary's, Horsethief, and Rustlers.  If you do all this, you'll have done the essentials. There are more, and, you can ride the further reaches of this networksuch as the Lions ridge line, followed by Troy Built. Marys is one of the main connector trails that gives you access to most of the trailheads, and is the direct route to Horsethief, my all time favourite trail for this area (did I mention that yet).\nRiding Horsethief will make you giddy, as it loops and roller coasters in a loop.  At one point, you are looking straight down to the Colorado river, but on your return, you ride under the red-rock cliffs above which the Mary's trail riders will have a glimpse of you.  \nThis is single-track at it's best.  My own loop was Moore Fun, back along Mary's, and, then Horsethief, for day 1, and Mack, Lions, Mary's, Horsethief (again) and Rustler's, on day 2 (after taking the back-side road Hawkeye to the short-cut Lions/Mack trailhead on the I-70 side).",
    "directions": "Fruita - Ask at \"Over the Edge\" bike shop in Fruita. for Kokopellis (these trails), keep going on the interstate 70 towards Utah, out of Fruita, about 3 exits to Loma exit 13 Rd.  Follow right onto Hawkeye Rd. (see Google Map) to large parking area with washrooms, park there, and ride up your starter hill, then down and into the trailheads; keep riding to the bottom for Rustlers, an immediate right for Moore Fun (difficult, but oh the views), or, close to the bottom for Mary's, your access to Horsethief and an alternate corridor to all the good stuff.  \nAlso consider riding along Hawkeye road to the Lions / Mack Trailheads (another starter hill over the ridge, except it's more like a pass / saddle so you can get straight to the hub from which you can take Marys, Lions, Steves, Handcuffs (had no time), Mack.  This was my day 2 connector, once I had ridden Mary's / Horsethief once.\nNote: This area is called Kokopelli (a vast network of many trails) however, there is also the Kokopelli trail itself, which is one trail from Fruita to Moab by name but in fact incorporates many trails known by other names.  There is an excellent topographical map for Fruita area trails that can be purchased in the bike shops.  It even has co-ordinates on it, if you are the type to carry a GPS.  If you do have a GPS, download the GPS data from this trail by clicking \"download GPS\".  You must have GPS credits, i.e. have donated some GPS data previously.",
    "geohash": "9wf",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/CO/5861/long_mackverytop-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/CO/5861/long_topMooreFun-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/CO/5861/reg_IMG-0001-1-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/CO/5861/reg_IMG-0001-2-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/CO/5861/reg_IMG-0001-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/CO/5861/reg_IMG-0004-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/CO/5861/reg_IMG-0010-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/CO/5861/reg_IMG-0015-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/CO/5861/reg_IMG-0017-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/CO/5861/reg_IMG-0019-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/CO/5861/reg_IMG-0021-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/CO/5861/reg_IMG-0023-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/CO/5861/reg_IMG-0024-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/CO/5861/reg_IMG-0026-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/CO/5861/reg_IMG-0027-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/CO/5861/reg_IMG-0028-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/CO/5861/reg_best2_IMG-0007-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/CO/5861/reg_startofHorsethief-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/CO/5861/narrow_IMG-0003-5.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/kokopelli-fruita-overview-near-fruita-co-5861",
    "stats": {
        "Activities": "mtn-bike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 5,
        "Time": "8 hrs",
        "Total Distance": "100 km",
        "Town": "Fruita, CO",
        "Type": "out-and-back"
    },
    "title": "Kokopelli - Fruita - Overview",
    "trail_id": "5861"
}