{
    "description": "Rabbit Valley is a great option once you've done the mandatory Kokopelli & Bookcliffs riding areas.  I had intended to do a larger loop than time permitted, so when I got to my turnaround point off Western Rim, fully intending to climb to Overlook (other side of the valley I was in) for a return loop via Kokopellis and Bitter Creek area -- I had run out of time -- this was already an extended ride.  You'll see this in the furthest reaches of my google (GPS) map, a small loop at as I made my way back.  I actually think this is a great loop in itself, as you get to take in Western Rim, showing off some more great Colorado red rock and bench lands, canyons, and the Colorado river itself in the distance.  \nYou may see dirt bikers out here, they probably created these trails, so keep an eye out and let them pass, be courteous.  My goal was to ride along Kokopellis (this trail actually goes all the way to MOAB) and trail #2 (no ATV) then drop down onto Western Rim.\nIt's a nice XC ride from Rabbit Valley Trailhead on Trail #2 (intersects with Kokpelli at a few points) at about McDonald Campground (and Castle Rock). Pass Castle Rocks (and the campground there) and find the intersection of Kokopelli and Trail #2 at the 2.5 mile mark (past McDonald Creek Trailhead).\nAccording to the trail book in town, \"Cross Kokopelli Road, and descend a trail and join a road staying left.  This sandy ATV track descends, keep left until it really drops. Then turn right on singletrack at 3 miles (from where you zero'd your odometer at McDonald Creek Trailhead) by a tree. before getting half-way down. Once you've made a right out of the sand, you are on Western Rim.\"\nConfused? I sure was.  I found my own way onto Western Rim, having gone too far on Kokopelli past #2.  I ended up luckily spotting Western Rim below me.  I found other tracks (hike-a-bike) down, and, voila.  Not pretty, but I was on.  Great views, and, after some great rim riding on slick-rock I went looking for Overlook Trail.  But like I said, when I got there, I realized the climb up was a lot higher than the map made it look, and so the remaining loop would have added too much time.\nI was happy, I had some roller-coaster single-track coming down off Western Rim into the Valley (my turn-around) and made my way back up to Kokopelli trail for my return.  Great outing.\nAlthough this area does get mountain biker traffic, you are likely to see dirt bikers.  A father and son passed me, the father falling off his bike and really bruising himself, almost unable to continue riding. At this point we were on Western Rim.  They had no map, and little water.  I showed them the map. They were hoping to meet-up with others, who they would now be late for.  They continued, however the lesson is clear.  This is remote terrain, it could be a while before someone else comes along.  Take lots of water, navigation gear, topo maps, and, either ride with others or let someone know where you are.  A SPOT device wouldn't be a bad idea either.",
    "directions": "Exit I-70 at exit #2, 17 miles West of Fruita, left over the overpass, and left again to the 2nd parking lot.  Washrooms are there, you may see dirt-bikers in this area -- so keep your eyes and ears open.  Make sure you have a topo map with co-ordinates, and not a bad idea if going for a longer route to Overlook or beyond to carry GPS with you.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/CO/5864/long_rabbitview-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/CO/5864/reg_IMG-0001-1-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/CO/5864/reg_IMG-0001-2-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/CO/5864/reg_IMG-0001-3-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/CO/5864/reg_IMG-0001-4-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/CO/5864/reg_IMG-0001-5-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/CO/5864/reg_IMG-0001-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/CO/5864/reg_IMG-0001-6-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/CO/5864/reg_IMG-0001-7-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/CO/5864/reg_IMG-0002-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/CO/5864/reg_IMG-0003-5.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/rabbit-valley-western-rim-fruita-area-near-fruita-co-5864",
    "stats": {
        "Activities": "mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "5 hrs",
        "Total Distance": "40 km",
        "Town": "Fruita, CO",
        "Type": "out-and-back"
    },
    "title": "Rabbit Valley - Western Rim - Fruita Area",
    "trail_id": "5864"
}