{
    "description": "The trail starts at McAlpine Bridge on the Okanagan River and climbs 300 meters to the top of McIntyre Bluff. There are several short steep sections but it is mostly a moderate grade. In the spring wild flowers abound and the vista from the bluff is awesome. You can see up and down the valley or look 1000 feet straight down into the Okanagan River. \nThe bottom part of the trail is not well marked. Start at the McAlpine Bridge, walk northeast on the west side of the river until you come to a paved road (1.0km), turn right down the gravel road (NE), the old rail grade is on the right, follow the rail grade until you come to the piers of an abandoned rail bridge and an old pump house (2.2km). You can see the profile of the chief straight ahead. From here you climb up a smooth single track which switches back away from the chief. At 2.8km you will pass a driveway off to the left, 50 meters farther a road turning left downhill and directly opposite an abandoned single track heading uphill back toward the chief. Head for the chief until you come to the power line (3.3km). Follow the power line west past the big corner pylon and you will come to the east corner of the fence surrounding Covert Farms. Walk northwest along the fence for 750 meters. You will come to a road heading uphill to the north (4.4km). From here on the trail is well marked thanks to the South Okanagan Bike Club. The road leads to Rattlesnake Lake (6.1km). Just past the lake there is a trail intersection, straight ahead (NW) takes you to Willowbrook to the right (NE) takes you to the bluff, the trail is clearly visible. Your destination is the southeast corner of the bluff (9.0km).",
    "directions": "Park in the parking lot just north of McAlpine Bridge 6 kilometers north of Oliver on Highway 97.\nThe trail head is north of the highway on the west bank of the Okanagan River, directly across from the north end of the Oliver hike and bike trail.\nYou can drive to Covert Farms and start your hike at the halfway mark. Check in at Pancho's Market.\nIn the summer pack lots of water and bring a hat.",
    "geohash": "c2fbp",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/5868/long_IMG-20171008-100502-60722.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5868/long_IMG-20171008-104040-60722.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5868/long_image-51254.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5868/reg_Chief-from-rail-grade-13641.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5868/reg_Covert-Farms-from-Bluff-Trail-13641.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5868/reg_IMG-20171008-095444-60722.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5868/reg_IMG-20171008-104318-60722.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5868/reg_Vaseaux-Lake-from-the-bluff-13641.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5868/narrow_IMG-20171008-092140-60722.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mcintyre-bluff-near-oliver-bc-5868",
    "stats": {
        "Activities": "hike mtn-bike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 5,
        "Time": "5 hrs",
        "Total Distance": "18 km",
        "Town": "Oliver, BC",
        "Type": "out-and-back"
    },
    "title": "McIntyre Bluff",
    "trail_id": "5868"
}