{
    "description": "Cross country skiing in Papineau-Labelle is incredible.  You've got a first rate hut system ranging from simple shacks to rather luxurious chalets  set in the mountainous Laurentian region and only 1.5 hour drive from Ottawa, and similar from Montreal.\nThrow in a vast trail network of ungroomed trails that range from moderate / easy to adrenaline filled downhills in tight woods, and you've got a recipe for a weeekend that appeals to everyone in your group.  A typical weekend involves skiing in Friday afternoon, having Saturday for the loop of your choice, and, a ski out on a different route on Sunday.\nOn this particular weekend visit, our group was based at the old log cabin called De L'Hote, on the (frozen) shores of Lac Du Sourd.  Booked about a year in advance, and, at the end of February, the conditions are near ideal -- except on this particular weekend.\nWe arrived at Centre Acceuil Gagnon (information centre and park staff / ranger main station) to park, change, and begin the ski.  From Gagnon, one can ski to several cabins on Lake Ernest, or perhaps the far reaches of the park to the smaller huts like Fascinat or De L'avers.  But we were headed for the double wood stoved deluxe chalet called de L'Hote, about a 12km ski from Gagnon. It sleeps 15 and we filled it.\nAs we arrived at Gagnon on Friday about 3 p.m., the +7 rainy conditions turned to snow during our ski.  We took the trail Enestine first (out of Gagnon -- other side of the road at the entrance way) then, as we crossed rd #3 we took La Ouest which is a very pretty wooded ski filled with some roller-coaster hills that are intermediate / advanced.  Each of us had a few spills on the downhills, you will get an adrenaline rush.   By the time we were 2/3 to our cabin, the mush was turning to ice, and, the ski became more difficult.  Once we finished the singletrack of La Ouest on day one we were on the main (easier) trail of La Ouest for the final 3.4 km ski (along the main road / snowmobile corridor that connects to the choo choo easy route to Gagnon).  Now we coasted, it was getting dark, and, we knew that others in our group were already at the cabin, warming it up.  I was happy to have my wide touring skis with metal edges.  Especially for day two -- the ski from our cabin to the base of Mt. Devlin.\nOn day two, some in the group opted for a loop over the lake (de L'Hote is on Lac di Sourd) following the Savita trail, while others opted for the back-country ski (advanced) on trail La Vasiere to the base of Devlin, for a 5.0 km return snowshoe / hike up to the views of the area.  If one was to continue past the base of Devlin (marked with signs), you'd get to Gagnon -- a full 9.9 km from where you started La Vasiere.  The view from Mt. Devlin at 454m elevation gives you an unsurpassed view, as most other peaks in the park are in the 300 to 350m range.\nMaps are available at the centre, and every skier should carry one.  GPS is not a bad idea either, it's easy to take a new trail when feeling like a kid in a candy store, only to find yourself somewhat lost, especially if a recent snowfall obscures the trail. Signage is decent at the main intersections, but be prepared to route find and take ample snacks, an extra layer, water and first aid.\nDay three was our return, and, we opted to take the easier \"train tracks\" (choo choo) route back to Gagnon paralleling rd #3, on account of the icy conditions.  This route back is not marked in the accompanying GPS, it's very straightforward, start skiing from de L'Hote and stay on the main route, following the choo choo signs (old rail grade) and a river to your left for a good deal of the way. It's a gentle grade, suitable for families.\nAs it approached noon, we found it warming up as we approached Gagnon, and decided to continue on route 3 SUD to do an extra loop on Bellevue rather than take l'Ernestine trail back to Gagnon.  This is where the GPS was turned on again, and you'll see the route on google maps taking us from the intersection close to L'Ernestine (of our day one) up and away from Gagnon (South) and in behind onto the hills in the direction of the Diable cabin and mountains near Lac Gagnon.  It's the route in the google maps without the image icons (the Southern loop close to lac Gagnon).  This loop is fully described with geotagged images here.\nWow. What a trail.  We climbed steadily and at first I thought it was a relaxing but unchallenging ski in the sun, as #3 SUD is a main road / snowmobile corridor, and, certainly staff do use #3 to service Du Diable cabin (sleeps 6).\nHowever, before long, we found the actual single track for \"Bellevue\" to our left, thanks to other ski tracks we noticed on a downhill section of rd #3.  The trail is aptly named and noticeably more challenging.  We found ourselves in near perfect conditions enjoying an incredible back-country ski. We climbed continuously, and without doubt the reward was the ridge top ski giving us fantastic views and a pretty ski through a thinned out (selective logging) forest.  Beautiful, sunny, and, with hearts pumping, we began an adrenaline filled descent back to Gagnon (info centre and parking lot, the end for us) -- with one portion of the trail resembling a luge run.  The trail has high snow banks, and you will either be scared silly, or, if you are lucky and focused, ski this hairpin at incredible speed without a fall.  Be careful, the trees are never far away -- and leave ample time for the skiers in front of you to descend. Again, I was thankful for wide skis and metal edges, but I managed a classic head-first face plant anyway. The Bellevue loop added another 7km to the 10km or so return from De L'Hote cabin.  \nFinally, we found ourselves thrown out onto the main road, with a small half-loop on the other side of the road to continue on trail to Gagnon.  What a day 3 -- Bellveue really made our day, even if it was a haul.\nPaineau Labelle as hundreds of kilometres of ski trails, and veterans of this area are drawn for years with something new to discover each visit. A great map of the Sourd Section of the park can be found by clicking here",
    "directions": "From Montreal or Ottawa, go past (north) the town of Duhamel into the Acceuil Gagnon, park, and go talk to the staff in the info center.  You should book a cabin in advance, and, you may also opt to have your packs snowmobiled in for a mere $25 round-trip.  From Ottawa, take new Hwy 50 to the end (above Thurso), follow 317 to Ripon, and continue to Cheneyville taking 317 to Duhamel and past Duhamel on Du Lac Gagnon, you can't miss Gagnon info centre. Check out the Google Maps Rd. View.",
    "geohash": "f24",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/QC/5874/reg_IMG-0001-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/5874/reg_IMG-0002-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/5874/reg_IMG-0004-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/5874/reg_IMG-0005-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/5874/reg_IMG-0006-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/5874/reg_IMG-0008-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/5874/reg_IMG-0009-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/5874/reg_IMG-0010-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/5874/reg_IMG-0011-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/5874/reg_IMG-0012-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/5874/reg_IMG-0013-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/5874/reg_IMG-0015-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/5874/reg_IMG-0017-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/5874/reg_IMG-0018-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/5874/reg_IMG-0019-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/5874/reg_IMG-0022-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/5874/reg_IMG-0025-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/5874/reg_IMG-0027-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/5874/reg_IMG-0030-5.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/papineau-labelle-gagnon-to-de-l-hote-near-duhamel-pq-5874",
    "stats": {
        "Activities": "ski-xc",
        "From": "",
        "Seasons": "winter",
        "Stars": 5,
        "Time": "4 hrs",
        "Total Distance": "15 km",
        "Town": "Duhamel, PQ",
        "Type": "out-and-back"
    },
    "title": "Papineau-Labelle - Gagnon to De L Hote",
    "trail_id": "5874"
}