{
    "description": "On your return from De L'Hote or the cabins from Lac Ernest, consider taking #3 SUD to connect to Bellevue trail for an extended return to the Gagnon Information Centre and office.\nWhere rd #3 meets the choo choo trail, and l\"ernestine, and, not far from the connector to La Ouest (in other words, a major hub only a few km from Gagnon Acceuil) you can take rd #3 south which is a pleasant generally rising slope and main corridor heading almost directly to Du Diable cabin.  One could also take La Devlin trail and connect to La Diable trail, skiing past Diable Hut (sleeps 6) to cross #3 (our shortcut).  Since we were already returning from De L'Hote on our last day, we didn't want to add too much more to our day.  So we took #3 South and managed to find the trail entrance to Bellevue.  At this point it became a single-track climb through a thinned out forest.  It was sunny, and, without the wind, it felt warm.  We climbed and reached incredible views at an elevation of 300m roughly (Mt. Devlin is 450m in comparison) with great views east and we could see a downhill ski area in the east -- we thought Tremblant perhaps?\nWhat a day, what a great ridgeline ski with lots of rollercoaster terrain going up and down!  Finally, the trail turned into a luge run down, steep and fast so be cautious and be prepared to bail, or, be safe and just walk.  You'll see the large hairpin in the google map - the downhills start there and get progressively harder.  Crossing Chemin du Lac Gagnon at the end, you have a final .4km ski to the Acceuil Gagnon, just south of the bridge (about 50m) and the Acceuil Gagnon itself.  \nLa Bellevue has other trail options nearby, such as La Diable loop, and La Nation, making these trails a good day ski option if starting from Acceuil Gagnon.  You can connect with La Cote and even La Moby Dick for another ascent with a view.  However, for us, we were happy to take in Bellevue as the finale to our weekend visit.  If starting from Gagnon, a nice loop would be either La Diable first, or, follow L'Ernestine (2.2km) to the main\"hub\" then connect with #3 rd over to Bellevue (our loop), or extend by doing La Devlin (2.0km) then La Diable (4.8km) past the Diable cabin to the start of La Bellevue.  If you take #3 rd (as we did) you cut off 3km or 4km of trail.\nNOTE: The GPS data attached also includes our day 1 and day 2 route to de L'Hote cabin, only the GPS data with the geotagged images applies to Bellevue and our access via #3 Rd.\nA great map of the Sourd Section of the park can be found by clicking here",
    "directions": "Go past Duhamel to Gagnon.",
    "geohash": "f24",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/QC/5875/reg_IMG-0037-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/5875/reg_IMG-0039-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/5875/reg_IMG-0040-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/5875/reg_IMG-0043-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/5875/reg_IMG-0044-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/5875/reg_IMG-0045-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/5875/reg_IMG-0046-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/5875/reg_IMG-0047-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/5875/reg_IMG-0048-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/5875/reg_IMG-0049-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/5875/reg_IMG-0050-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/5875/narrow_IMG-0042-5.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/papineau-labelle-3-to-bellevue-to-gagnon-near-duhamel-pq-5875",
    "stats": {
        "Activities": "ski-xc",
        "From": "",
        "Seasons": "winter",
        "Stars": 5,
        "Time": "2 hrs",
        "Total Distance": "8 km",
        "Town": "Duhamel, PQ",
        "Type": "out-and-back"
    },
    "title": "Papineau Labelle - #3 to Bellevue to Gagnon",
    "trail_id": "5875"
}