{
    "description": "The trail itself is an access road. In the summer you should park at the first set of telephone poles at the bottom of the hill the walk up is about 13km in distance. This makes an easy to moderate hike.In the winter you should bring snow shoes or x country skis. The road is covered with anywhere from 1-3 feet of snow, and if the radio tower maintainer has traveled up with the ski-doo, then there is a packed area. Weather here changes quickly so year round you should have water and windproof gear.On the way up you can follow the power lines and take a direct route to the top. In the winter this can be a bit of an effort unless you have good snow shoes. This takes you through an almost tree free bowl that makes for good powder surfing with minimal to no avalanche risk. Cutting through the bowl turns the 13 km one way to a 5.3km one way.The road/trail itself is a relatively green circle/easy grade so if you pack up a board or skis, it makes for a fun easy cruise down, so on your return you only need to walk a km or 2 to your car/truck.At the top there are two radio towers and a large open space  that was once occupied by a canadian forces radar tower. (which now resides in a park in kamloops). In the summer you can drive up with a car, but in the spring/fall when it is muddy you would need a 4x4.",
    "directions": "Drive north east  from kamloops on Paul Lake Road, towards paul lake and harper mountain ski hill. Turn left off paul lake road onto cold creek road, then later turn right to stay on mnt lolo road. (the right hand turn is a hair pin turn going up the mountain.In winter the trail Head starts at Approx: 50°47'44.76\"N120° 9'20.42\"WIn summer you can start pretty much anywhere you can park. Good mountain bike ride down.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/5876/long_2011-09-05-16-14-58-171-28593_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5876/long_Lolo-14696.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5876/reg_S6002513-14696.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5876/reg_S6002527-14696.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5876/reg_S6002533-14696.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mount-lolo-near-kamloops-bc-5876",
    "stats": {
        "Activities": "snowshoe hike ski-downhill ski-bc ski-xc mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "6 hrs",
        "Total Distance": "26 km",
        "Town": "Kamloops, BC",
        "Type": "out-and-back"
    },
    "title": "Mount Lolo",
    "trail_id": "5876"
}