{
    "description": "The beginning of the trip is super easy, but the end of it may be challenging for the first timer since there is a bit of swimming and stream crossing required. The area is a mix of parks, water dams, old mining sites, and calm pools of water. \r\rThe trail leads north from the parking lot up the creek/river valley via the gravel road. After about 1 km there is a park on the left hand side. Great area for picnics and kids. Further on by about 1/2 km there is a water intake/dam. Please be aware that crossing here is possible, but there are no tress passing signs. You can cross farther down through the water. \rThe road ends at the dam, and the adhoc, cow trail starts on the left hand side. it is possible to continue on the right hand side of the stream but you will miss the chinese mining boulders.\rAbout a half km from the  dam is a boulder field. The miners here use to pressure wash the dirt from the side of the canyon in an effort to collect the gold. To this day there are still a few people who gold pan in the river/creek.\rWatch your ankles on the boulders it can be a bit of a minefield. Also there are rattlers in the area, so be cautious where you step.\rThe boulders themselves are arranged in pits in some places. You will notice old rusted piles of cans and antique junk. A bit of kamloops history.\rTo the north east of the boulder field (still on the west side of the river) there once was a picnic bench. It may still be there. \rAt this point this is a great place for those who want to stay dry to stop.\rFor those who want to continue, follow the boulder field north to where it stops, and cross the river/stream carefully (In early spring it can be very powerful with snowmelt, it is easier in late mid summer when water levels are much lower).\rOn the other side you should be able to continue north to the pools. Feel free to walk up the creek bed or shore. Some years there is more rocky shore than others.\rYou will at some point get to a large boulder on the west side of the river/creek. This is where your swimming skills come in handy. The right hand side of the creek/river is deep but fast flowing. there is a small space between the boulder and the wall. Avoid going through this water levels might rise, and if you get stuck it wont be funny. It is a bit of a swim around the boulder.\rContinue up the stream bed crossing where you may.\rAt some point you  will get to a very close 'hallway' in the rocks, again some swimming skill is required. However, some years, this hallway is jammed with floatsam and dead heads. If so, do not try to swim through, as once you get to the other side, the water can pull you right back into the snag. \rIf there is a jam, you can get around to the pools, by going back a bit and then going up and over to the right on a goat trail. Be careful.\rAt the end of your journey the river turns from canyon back to forest and boulders again. This is a good place to stop, but the more adventerous can go even further.\rThe bonus with this trip is that during the hot summer, you can float down the river on the way back and cool off.",
    "directions": "From the kamloops airport, head west along Tranquille Rd towards padova city. but about a 1/2 km before padova city, turn right and head across the train tracks, onto a dirt road. You will pass a gravel pit, and then right after a right handed turn in the road, there will be an access road to the parking lot. total distance from the airport is about 7 km. \rYou can drive up further when the gate is open but it is not advised since there is a park which is only open during the day, and you may get locked in if the superintendant decides to close the gate behind him.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/5879/long_Tranquille-14696.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5879/reg_IMG-1378-22689.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5879/narrow_IMG-1391-22689.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5879/narrow_IMG-1395-22689.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5879/narrow_IMG-1400-22689.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5879/narrow_IMG-1431-22689.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5879/narrow_IMG-1437-22689.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5879/narrow_IMG-1440-22689.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/tranquille-river-near-kamloops-bc-5879",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 3,
        "Time": "3 hrs",
        "Total Distance": "5 km",
        "Town": "Kamloops, BC",
        "Type": "out-and-back"
    },
    "title": "Tranquille River",
    "trail_id": "5879"
}