{
    "description": "Wapta Traverse (part one)\nNote: This trip is not one to be taken lightly. Proper training, experience, and equipment is essential for worst case scenarios like avalanches, crevasse falls, getting lost or injured. A guide is highly recommended unless you have similarly equipped team mates.\n\noverview | next leg\n\nThis trip was one for my bucket list. You see, I'm from the east coast, and getting constant access to the Rockies is not really going to happen unless I move. Maybe people in Banff do the Wapta every weekend, but for me, it would be an epic trip of a life time.\nThe plan was hatched more than three years ago while at a friend's birthday party. Someone was telling us about leading a group of kayak friends up onto the Wapta Traverse. It's a classic hut to hut ski touring trip. I was keenly interested, but certainly needed some skills and experience. I would certainly gain much of that experience of ski touring over several trips to Quebec's Chic Choc mountains.\nA year before the proposed TTG (time to go) I started putting together a group who would be both interested and capable. Of the five, three of us committed to the tour, and in mid March of '09, we left the parking lot of Peyto Lake and started our 5 day trek along the continental divide and the Wapta Icefield. I almost had to pinch myself that this was really happening. Let the adventures begin!\nDay1\nWe geared ourselves up, after not much sleep at the HI hostel in Banff. We had a brief chance to meet each other the night before. I had just landed in Calgary that night. Things ran perfectly to plan. Trevor, who drove from Lethbridge, was there to pick me up. All my luggage had arrived with me in perfect shape. When we got to the hostel that night, Chris was there, waiting for us. The weather looked promising, and the snow conditions looked favourable for out first day.\nOn the trail.\nLeaving the parking lot, we paralleled the Icefields Parkway for a  minute or less before turning left along a logging road / path. There were old ski tracks there already, so all we had to do was follow.\nThe tracks entered into the woods, and with that, I felt right at home skiing in the forest just like home, or in the Gapesie! After an hour, we were at the edge of Peyto lake, and saw a great look of our first day's objective; gaining lots of altitude to access the glacier. The weather was hit and miss with winds blowing snow. Sometimes it would be clear weather, and other times, it would be snowed in. At least the temps were comfortable for the level of activity, but man, the pack was heavy! From here, there would be no more trails to follow until our last day.\nCrossing the lake took another hour, as we were battling high winds. The trail was wind scoured as well, so we had to look for a raised frozen route to find the best packed snow. We briefly lunched at the end of the lake in a small shelter of trees, and then continued to the next portion of the trek. After crossing the meadow or lake head, we just missed the ski trail that lead to the right, up behind some trees. We ended up delicately climbing snow covered rocks in a switch-back manner to regain the trail up the right bank. From there, things progressed well until we approached the beginnings of the crux of the day. We were at the foot of the terrain traps, and had to plot the best way up without putting ourselves in danger.\nMixed terrain contained exposed slopes and avalanche hazards, so our best route was to take a thin ribbon of packed snow along a morainal ridge. This meandered us up. To our right, was a steep adjacent avalanche slope, and to our left, was an exposed ridge. Thin snow cover allowed skinning  to a point, until at a gravel plateau, we had to lash the skis to the pack and boot pack it up two more gravel sections. When it got steep, we broke out the mountaineering axes for the final climb onto the toe of Peyto Glacier. It was border line sketchy, but we managed without any problems.\nOnce topped out, as could look out over the valley of the Peyto glacier. Thin snow pack exposed  moraine piles. Near the bottom of the valley we could see the glaciology research hut (station) and used that as our next objective. Picking a line was easy as we skied toward the structure, with the occasional need to gingerly step over a few rock piles.\nOnce past all of that, the snow became far more consistent,and in a switch back fashion, upwards we skinned following glacier movement markers like they were trail markers. It made navigation easy, and no crevasses were to be found.\nI recall seeing the elevation profile for the first day's slog from a gps track we had. It was composed of two separate climbs. One gaining access to the glacier, and the second, being the dip down to the avi hut, and the subsequent climb up to Peyto hut. Between the two climbs, we had high winds, and snow marring much of the visibility for minutes at a time. I took charge of carrying the rope for a spell, and kept following Chris, with Trevor at the tail. I began counting paces. 50 at a time. Paces were counted and then rest stops like an Everest climber in the death zone. I attributed it to the 50+ pound pack on my back, and the steepness of the climb we had tackled. Trevor would take the rope, and I would relieve Chris of breaking trail. I now limited my efforts to 30 paces per go as my energy waned.\nIt was the outhouse that I saw first. It belonged to the Peyto hut, but I confused it with a jutting rock. I needed to appreciate the relative scale of things in the vast whiteness of this new territory. Chris confirmed that it was indeed Peyto, and the end of today's journey was nigh!\nAgain, we had wind and blowing snow to contend with, as we started to spread out along the glacier. In the middle, and never keeping my party members out of site, we progressed upward. Chris was the first to arrive, and as he approached, he waved excitedly. Those in the hut were thinking he was simply being enthusiastically friendly after an epic day, but in fact, Chris had just witnessed a class 3 avalanche release from the side of Mount Thompson, in behind the hut.\nI was on the last back approaching the hut when I turned to find Trevor, on track, crossing the Peyto glacier. below He was almost a dot with an arching vanishing trail in a fast icefield, with mountains looming around him. It's the sort of thing, given the conditions, you can't appreciate when you're in the soup of it.\nIn all, today was around 12 km and almost 2000 feet elevation gain. That along with the heavy packs pretty much did me in for the day. I was spent, but happy.\nFrom here, we planned to continue on as scheduled, but if you were interested in an alternative exit, skiing toward the Bow hut and Bow valley drainage would put you back on to the highway. We kept this route as an exit scenario if weather turned for us.\nThe Peyto hut was fairly small, and packed with fellow ski mountaineers who packed in beer and tunes to enjoy the evening.\nThere are our team's fellow accounts of the trip, and they can be found here:\nOutdoorchris.com\nPostcards from Alberta \nPart 2 of our Wapta Traverse can be found  here.",
    "directions": "Drive past Lake Louise, on the ice fields parkway. Peyto Lake is the trailhead, and Wapta Lake is the final exit point.\n\noverview | next leg",
    "geohash": "c3j",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/5883/reg_274-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5883/reg_IMG-0829-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5883/reg_IMG-0830-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5883/reg_IMG-0833-route-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5883/reg_IMG-0834-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5883/reg_IMG-0835-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5883/reg_IMG-0836-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5883/reg_IMG-0839-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5883/reg_IMG-0843-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5883/reg_IMG-0845-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5883/reg_IMG-0846-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5883/reg_IMG-0847-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5883/reg_IMG-5169[1]-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5883/reg_IMG-5172-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5883/IMG_0834.JPG",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5883/narrow_IMG-0825-6103.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5883/narrow_IMG-0826-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5883/narrow_IMG-0837-2--6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5883/narrow_IMG-0837-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5883/narrow_IMG-0844-6702.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/wapta-traverse-part-1-peyto-lake-to-peyto-hut-near-banff-ab-5883",
    "stats": {
        "Activities": "climb hike ski-bc",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 5,
        "Time": "7 hrs",
        "Total Distance": "12 km",
        "Town": "Banff, AB",
        "Type": "out-and-back"
    },
    "title": "Wapta Traverse - Part 1 Peyto Lake to Peyto Hut",
    "trail_id": "5883"
}