{
    "description": "A reasonable back country experience with good access and good scenery (allegedly - it's been cloudy every time I've been there).  Can be a busy trail and gets used winter & summer.  It is also the way into Assiniboine Lodge, Pass, Wonder Pass, Naiset Cabins, Marvel, Owl, Gloria and Terrapin Lakes, etc.\nStarting from Mt. Shark XC / biathalon area, 'shoe/ski/hike along the closed road following the signs to Watridge Lake.  Right at the trail / T above Watridge Lake, continue travelling NW.  In winter the official grooming stops here but there is typically adequate tracks to follow.  \nIn Winter, all those skiers before you have packed down the trail reasonably well, so movement on the trails is easy 'nuff.  The same can't be said about walking a few steps off the trail, be careful.\nThere are a couple decent hills up and down along the way, many people choose to walk these, especially when laden with packs\nMuch of the trail is in the trees, so you get a woodsy feel, not a ton of views but it has it's moments.\nDay / side trips can be made to the aforementioned lakes, we skied down to Marvel Lake and to the far end.  NOTE open water near the creek coming in from Terrapin/Gloria.  Many avalanche slopes along this lake so be prepared.\nBryant Creek Shelter is rated to sleep 12 (more can be crammed in but remember the people you're sharing it with, especially if strangers, may not agree - you must book through Parks Canada in Banff - they only allow 12).  It is a basic shelter, wooden sleeping platforms (6 of them), wood stove and well stocked with wood.  It's cute, in a basic, back woodsy way.  No lights, no pots, no nuthin'  NO TOILET PAPER either, add that to your check list.",
    "directions": "From Banff, drive east to Canmore, then south on Spray Lakes Road. At 34.7 km past the Canmore Nordic Center turn, turn right (West) up the Mt. Shark Road. There are parking areas both beside the HeliPad and the main parking lot. \nIf coming from the south, it is 27 km north of the junction of Smith Dorrien/Spray Lakes Rd and Kananaskis Lakes Trail (ie Road). \nSpray Lakes Rd. is a gravel road, generally decent conditions but can be unpredictable. Stay away from the extreme edges, the snowplows plow the snow flat even though the road bed has dropped off and you can get stuck off the side of the road .",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/5895/reg_IMG-1458-Small-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5895/reg_IMG-1467-Small-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5895/reg_IMG-1477-Small-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5895/reg_IMG-1479-Small-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5895/reg_IMG-1507-Small-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5895/reg_IMG-1509-Small-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5895/reg_IMG-1561-Small-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5895/reg_IMG-1578-Small-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5895/reg_IMG-1583-Small-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5895/reg_IMG-1598-Small-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5895/narrow_IMG-1523-Small-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5895/narrow_IMG-1530-Small-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5895/narrow_IMG-1628-Small-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5895/narrow_IMG-1636-Small-6828.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mount-shark-to-bryant-creek-shelter-near-kananaskis-ab-5895",
    "stats": {
        "Activities": "snowshoe hike ski-bc ski-xc",
        "From": "",
        "Seasons": "winter fall summer",
        "Stars": 4,
        "Time": "4 hrs",
        "Total Distance": "14 km",
        "Town": "Kananaskis, AB",
        "Type": "out-and-back"
    },
    "title": "Mount Shark to Bryant Creek Shelter",
    "trail_id": "5895"
}