{
    "description": "Bear Canyon to 7 Falls is a very popular hike in the Sabino Canyon area of the Santa Catalina Mountains, Tucson. The trail follows Bear Creek most of the way. It crosses the creek 7 times (one way).  After the last creek crossing trail switchbacks up a hill and eventually comes to a open view of the 7 falls.It is possible to continue beyond the 7 Falls however most people make the falls their turnaround, and, after 4.2 miles or so to get there, it's a reasonable distance for most.  A very good map for $10 can be had in the visitor center, which has all the local trails including those of Mt. Lemmon, which is an extensive set of trailheads along the 36 mile drive up.  The whole area is fantastic, with several trails right out of the visitor center, which is where Bear Canyon trail starts.It's possible to swim in some of the pools, although in mid-Feb 2011, they were only a foot or so deep.  The water quality would be doubtful, most water in this area depends on snow runoff.This is one of the most popular hikes in the area, we did it on a Sunday and there were hundreds of people along the trail.  (Other hiker: We did it on a Wednesday in February and it was also very popular but not 100s just a few dozens).Overall the hike is a fairly gentle grade that crosses the stream several times, with some simple rock-hopping.  Make no mistake however, the trail is rising, as you follow the canyon up the mountains.  The closer you get to the pools, the steeper it gets but you'll see all age ranges on this hike, it's moderate to easy.  It can be hot, even in winter, so take lots of water.For kayak, bike, SUP rentals, and guided hiking options check out Arizona Outback Adventures.",
    "directions": "The official Trail head is reached from Sabino Canyon visitor center. From I-10 take the Ina Road in Tucson. Turn east onto Ina Road and follow it as it becomes Skyline Drive and then Sunset Drive. When you reach the end of Sunset Drive and a stop sign, turn left. The Sabino Canyon Visitors Center and parking lot are immediately on your right. (Lat:32.32548 Lon:-110.83725). From there either walk 1.7 miles to the trail head or take the shuttle.There is an alternate trailhead at the North end of Bear Canyon Rd, in dirt parking lot. The is approach we used.",
    "geohash": "9t9p",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/AZ/5896/reg_DSC-0778-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/5896/reg_DSC-0786-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/5896/reg_DSC-0799-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/5896/reg_DSC-0806-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/5896/reg_DSC-0808-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/5896/reg_DSC00825-7279.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/5896/reg_DSC00832-7279.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/5896/narrow_DSC-0811-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/5896/narrow_DSC00836-7279.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/5896/narrow_DSC00841-7279.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/bear-canyon-near-tucson-az-5896",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall",
        "Stars": 4,
        "Time": "4 hrs",
        "Total Distance": "12 km",
        "Town": "Tucson, AZ",
        "Type": "out-and-back"
    },
    "title": "Bear Canyon",
    "trail_id": "5896"
}