{
    "description": "McDowell Mountain Regional Park offers over 40 miles of hiking, mountain biking, and horseback riding trails. Park Trails range in length from 0.5 miles to 15.3 miles and range in difficulty from easy to strenuous. Those looking for an easy hike should try the North Trail at 3.1 milesThe ranger suggest the scenic loop as relatively easy trail with good scenery. Turned out to be an excellent suggestion.Trails are wide and easy to follow. You may have to share with the equestrians too. Desert vegetation is different from around Tucson, no prickley pears any way more grass areas.For bike rentals (and guided hiking): We rented in Scottsdale (near Phoenix) at AOA-adventures for great weekly rates on GIANT and Specialized, allowing you to ride McDowell Preserve or South Mountain.",
    "directions": "From central Phoenix, take Loop 202 east to Beeline Highway (SR 87). Continue northeast on SR 87 to Shea Blvd. Travel west on Shea Blvd. to Saguaro Blvd.; turn north. Continue through Town of Fountain Hills to Fountain Hills Blvd; turn right and travel four miles to the McDowell Mountain Regional Park entrance.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/AZ/5898/reg_IMG-0018-7279.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/5898/reg_IMG-0022-7279.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/5898/reg_IMG-0039-7279.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/5898/reg_IMG-0042-7279.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/5898/reg_IMG-0045-7279.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mcdowell-mountain-park-near-fountain-hills-az-5898",
    "stats": {
        "Activities": "hike mtn-bike",
        "From": "",
        "Seasons": "spring winter fall",
        "Stars": 3,
        "Time": "3 hrs",
        "Total Distance": "7 km",
        "Town": "Fountain Hills, AZ",
        "Type": "out-and-back"
    },
    "title": "McDowell Mountain Park",
    "trail_id": "5898"
}