{
    "description": "A very nice but basic and easy MTB trail in Northern Georgia (the Georgia in Eastern USA not Eastern Europe).  Iron Hill makes a nice ride in the area, especially if you have kids or are a beginner MTBer.  It runs from the main road out and around a peninsula in Allatoona Lake.  Also virtually all on gravel so it does drain well and can likely be ridden in all conditions.\nPrimarily double-track, it runs along an interesting old iron mining area for a while, then for another while it runs through an abandoned tent camping area (probably abandoned when people decided they couldn't 'camp' in less than 28' of press-board).  The nearby Lakeside trail  circumscribes a period cottage with an equally period basic iron smelter.\nThere is talk of expanding the track and to be honest, the area could use a few more trails open to bikes.  There are some old trails and roads in the area that don't say if they are open or not, you may wish to ask at the visitor center.\nAlso, Iron Hill is one of 11 trails that make up the  \"Muddy Spokes Club\", buy a membership card at any visitor center in the 11 parks, ride all 11 of the trails & get yer card stamped at each, and y'all get a cool little t-shirt marking the completion of the entire 68 miles of trails.  You can't buy this shirt (believe me, I tried).  A great idea from Georgia's State Parks people.  (seriously!  It gets people to travel, check out other parks.  If I lived within 3000 miles of Georgia I'd have me one.)  \n  \nRed Top has a number of camping sites along with a lodge (hotel) and 18 cottages.  We spent the night in a 2 bedroom cottage with *tons* of room they go for $125 or so and are a pretty good deal, (especially compared to hotels in Atlanta $$$) and if you have a couple couples and/or kids, they have a full kitchen and big living room. http://gastateparks.org/info/redtop/ .  Oh yes, there is also one Yurt for rent.  I always think one of these will smell like a Yak, but I'm quite sure these are up to the high standards of the rest of the accomodations.",
    "directions": "About 55 or 60km North of Atlanta on I-75, towards those Appalachians, look for Cartersville.  Get onto Hiway 41 and look for Red Top Mountain Road.  Go East into the park.  This trail is near the South end of the park about 1.7km South of the Visitor Center.  Turn West on Iron Hill Cove Road.",
    "photos": [],
    "source_url": "https://trailpeak.com/trails/iron-hill-trail-red-top-georgia-near-cartersville-ga-5906",
    "stats": {
        "Activities": "hike mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 2,
        "Time": "1 hrs",
        "Total Distance": "6 km",
        "Town": "Cartersville, GA",
        "Type": "out-and-back"
    },
    "title": "Iron Hill Trail - Red Top Georgia",
    "trail_id": "5906"
}