{
    "description": "A short, easy to find, and occasionally BUSY trail in Northern Georgia.  It is a steady uphill out of the parking lot, gaining 132m in it's 1.1km length.  The footing is decent, even when a little muddy with lots of rocks helping out the drainage and climbs. At it's upper end, it intesects the Appalacian Trail and continues on as the Freeman Trail.  Well marked with Blue Blazes on the trees along it's route.  It is rumoured that the term \"What in the blue blazes is going on here?\" was coined here by the local trail maintenance group.\nByron Who?  Well, it turns out our boy Byron was a well respected local poet back in the day.  Like many artists he must have been a little tortured and decided to end it all with the help of Messrs. Smith & Wesson in 1957.\nThe BHRAT (A.K.A. the Blood Mountain Spur Trail) is a short little connector from civilization up to the Appalacian Trail in the vicinity of Neels Gas, Stonepile Gap, Frog Hollow and the great little town of Dahlonega, GA.  All of these well worth exploring names are located in Northern Georgia, USA.  From here you can walk roughly to Maine if you so desire (and have a couple spare months in your calender).  Dahlonega is really cool.  Great coffee shops, real home town feel that makes Moab feel like Disneyland.  This is the real deal.  Bluegrass Central I'm told but not limited to that, there are many live music venues in town and on the March weekend I was there, a Celtic festival complete with a roaming bagpiper.  Mid April is \"Bear on the Square\", an authentic Appalachian Festival.",
    "directions": "Head North from Atlanta about 100km up Hiway US-19 to Dahlonega.  Once through town, continue on US-19 for another 30km to Neels Gap and the trailhead.  It's a great, fun, twisty highway, bring your Ferrari.",
    "photos": [],
    "source_url": "https://trailpeak.com/trails/byron-herbert-reece-access-trail-appalachian-near-dahlonega-ga-5907",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "1 km",
        "Town": "Dahlonega, GA",
        "Type": "out-and-back"
    },
    "title": "Byron Herbert Reece Access Trail Appalachian",
    "trail_id": "5907"
}