{
    "description": "This was my first hike into this well developed area next door to Golden Ears Park.  As a working demonstration forest of UBC, it has a well developed series of roads and trails leading to a number of lookouts and lakes.  On this particular day I followed the Blue Trail west from the parking area through a nice forest with info signs etc., down over a bridge and a roaring Spring Creek and some great views over Pitt Meadows and back towards Burnaby Mt.  Then I basically followed Blue trail till it met G Road and then took the Yellow Trail back to the parking lot.  This was a couple of hours of hiking and some good views.  There are lots of trails intersecting each other; pick up a map or just follow the colour coded trails.  All trails end up back at the parking area.NO DOGS OR BIKES ALLOWED IN THE FOREST, and if walking on the main roads, be careful of some motorized traffic as this is a working research forest. This particular loop was about 6 km of hiking and 2 - 3 hours of fresh air. There is GPS data attached to this trail (see \"download GPS\"), which if loaded into your GPS can help you find route points.",
    "directions": "Follow 232 past Maple Ridge Park and the turnoff for Golden Ears Park.  Watch for the right-turn sign onto Silver Valley Rd and then into the parking lot.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/591/long_UBCResearchforestMar22_2003011.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/591/reg_Hike-Path-13701_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/591/reg_UBCResearchforestMar22_2003001.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/591/reg_UBCResearchforestMar22_2003030.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/591/reg_UBCResearchforestMar22_2003034.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/591/reg_UBCResearchforestMar22_2003044.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/591/narrow_Hike-Broken-Bridge-13701.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/malcolm-knapp-ubc-research-forest-near-vancouver-bc-591",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "10 hrs",
        "Total Distance": "0 km",
        "Town": "Vancouver, BC",
        "Type": "out-and-back"
    },
    "title": "Malcolm Knapp - UBC Research forest",
    "trail_id": "591"
}