{
    "description": "Part 2 Payto to Bow 7.3K\n\nprevious leg | overview | next leg\n\nDefinitely meant to serve as a recovery day along the Wapta Traverse, this portion was to be fairly straight forward. Elevation data says it`s a steady climb, and then skins off for the descent. Despite  continued low visibility, we struck out at nearly noon. I neglected to eat a lunch this day. The Wind and snow did its best to test my strength once more. I wasn`t all that impressed with my GPS reading this day, as it was flipping the map display around to my frustration.\nLeaving Peyto hut, we climbed along the Wapta glacier and could barely make out the shapes of Mt. Rhondda and Mount Thompson. Navigation was pretty straight forward, as we made our way through a sea of snow.\nOur destination was the Bow hut; the Alpine Club of Canada's signature structure along the Wapta. The Bow hut is a huge facility, as it serves several mountaineering objectives, beyond the Wapta proper. It sleeps 30 people, dorm style, and has separate rooms for sleeping and dining. A breezeway connects them, and also houses two indoor pit toilets. Wood also serves as a heat source for drying gear. The age range of the people there was quite impressive. Notable were the 70 year olds who had just as much power as guys younger than me.\nBehind the bow, visible from the porch, is Crowfoot mountain, with its hanging glacier. St. Nick itself marks the border between Alberta and BC, and soon, we'd be crossing over to BC territory.\nA couple of guys were planning to skip the Bow hut and head straight for Balfour. We would eventually meet up with them the next day, but in opposite directions. More on that in part 3.\nAs we approached Bow, the flat light made it difficult to judge depth. Sometimes it was difficult to tell if one was even moving! It was nice to have the skins off, because our speed and efficiency increased. We weren't able to see the hut until we made it to the classic landmark of Mount Saint Nicholas. From there, there is a steep descent. It would be a skier`s dream if we weren't pack burdened. It was survival skiing, and with that, I fell a few times. I even managed to crack the brim of my helmet in one fall. I had it secured to my shoulder strap on my pack, so it wasn't exactly a header fall.\nI took some nice shots this day. We saw the first signs of Mt. Saint Nicholas just over the horizon. St. Nicholas was high on my hopes for a photo, and it didn't disappoint. We were also being followed by a train of other skiers who were later than us. It's neat to see the `trains`working their way along.\nI felt a bit better after today`s trek, and regained an appetite. I was still tired after a relatively easy day with eventually improved visibility.\nAn alternative route is described in this post for access to the Bow hut.",
    "directions": "Accessed via Bow Valley drainage or via  Peyto Lake entrance.\n\nprevious leg | overview | next leg",
    "geohash": "c3jj",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/5918/reg_278-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5918/reg_IMG-0860-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5918/reg_IMG-0864-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5918/reg_IMG-0865-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5918/reg_IMG-0867-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5918/reg_IMG-0880-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5918/reg_IMG-0881-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5918/narrow_288-6702.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/wapta-traverse-part-2-peyto-to-bow-hut-near-banff-ab-5918",
    "stats": {
        "Activities": "hike ski-bc",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 5,
        "Time": "6 hrs",
        "Total Distance": "7 km",
        "Town": "Banff, AB",
        "Type": "out-and-back"
    },
    "title": "Wapta Traverse - Part 2 Peyto to Bow Hut",
    "trail_id": "5918"
}