{
    "description": "Part 3: Bow to Balfour hut 12.7K\n\nprevious leg | overview | next leg\n\n(Right clicking on photos, you'll see the captions.)\nThis ended up being a fun day that ended in beautiful sunshine.\nWe started by climbing back up the slope from yesterday. St. Nick rose to our left to counter balance our team's skin tracks, but soon after, we were in white outs once more. We had the visibility a the time to take some fine shots of St. Nicholas, and the Onion (Portal Peak) looking back toward the hut. The white outs came and went, giving us glimpses of ridge lines and summits. As we climbed, we rounded St. Nicholas and attacked a col just between it and Mt. Olive. Finding the keyhole behind a bulge of rock, we boot packed a short section due to windblown moraine. \nOther groups with day packs passed us en route to bagging Mt. Gordon, one of the skiable summits along the Wapta. Oh what I'd have given to have a day pack at that moment...\nWinds were very strong, and we longed to take a break on the other side. This route gained us the Vulture Glacier, which permitted us to take our skins off and find the reward of descent to our hut.\nI can see why they nick named Olive Twisted Sister. It has distinctive wavy striations on its cliff face. Niles shares a bit of it as well from the more clear photos I've seen.\nAn alternative, though more difficult route option to Balfour would have been to omit the keyhole, and continue south on the other side of Mt. Olive. (Keeping Mt. Godon to the right) From there, a steep drop, north east, gets you down to the Balfour hut.\nFor us, the Vulture Glacier route was an easy choice. To add to the comedy, we met up with the pair of wayward wanderers while we lunched below Mt. Olive. I had photographed them as they split from our route. Their figures silhouetted against Mount St. Nicholas the day before. They had set out with us from Peyto, on a B-line to Balfour, and had gotten lost on the wrong side of Mt. Rhondda. They finally hit Balfour at 11pm that night, and today, were retreating back to Bow on an exit route. To our benefit, their tracks made the rest of our day easy. The route took us though a morainal bench right to the hut. Behind the hut to the south, looms the mountain of the same name.\nSix people welcomed us to Balfour in two separate groups. Two guys in one group were ski patrols the others were work colleagues. I believe they had their own misadventures both before and after our encounter with them.\nThis was one of my favorite days of the trip with beautiful sunshine finishing off the day.  Trevor and I were exploring the drifted over lake in front of the hut, after the fun descent down Vulture Glacier. Behind us, you could see Mt. Gordon with its huge summit cavity, and the main attraction, Mount Balfour.\nThat afternoon and evening, we spent analysing route options up the the Balfour col as it sat in clear visibility, as well as discussing techniques for glacier travel, especially over snow bridges and around cravasses by roping up. Chris certainly was in guide mode as he shared his vast knowledge and experience. I for one felt glad to have him on the team. Tomorrow would be our most technical day of the whole traverse.",
    "directions": "Access via Peyto Lake entrance, or Bow Valley drainage entrance, or conversely, via the Sherbrooke lake entrance. All three access points share avalanche hazards, so enter with care and preparation.\n\nprevious leg | overview | next leg",
    "geohash": "c3jj",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/5919/reg_Mt-Gordon-Mt-Olive-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5919/reg_Mt-balfour-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5919/reg_Nick-olive-col-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5919/reg_balfour-hut-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5919/reg_chillaxin-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5919/reg_chris-ready-to-go-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5919/reg_foot-st-nick-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5919/reg_hoisting-a-heavy-load-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5919/reg_iconic-shot-St.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5919/reg_leaving-bow-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5919/reg_mt-st.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5919/reg_olive-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5919/reg_onion-portal-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5919/reg_vulture-whiteout-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5919/reg_wanderers-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5919/iconic shot St. Nicholas.JPG",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5919/narrow_balfour-hut-int-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5919/narrow_shannon-Z-pully-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5919/narrow_vulture-glacier-to-hut-6702.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/wapta-traverse-part-3-bow-hut-to-balfour-hut-near-banff-ab-5919",
    "stats": {
        "Activities": "climb hike ski-bc",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 5,
        "Time": "6 hrs",
        "Total Distance": "13 km",
        "Town": "Banff, AB",
        "Type": "out-and-back"
    },
    "title": "Wapta Traverse - Part 3 Bow Hut to Balfour Hut",
    "trail_id": "5919"
}