{
    "description": "Day 4 Balfour to Scott Duncan Hut (11K)\nWapta Traverse\n\nprevious leg | overview | next leg\n\nThis was a harrowing day, that started off as very promising, but near the end, was touch and go. Our Balour hut was home to 3 parties of three, with a wide range of experience and skill. We were at the foot of one of the major technical cruxes of the Traverse, gaining the high col around Mount Balfour. That evening, we were going over knots and rope skills for glacier travel and crevasse rescue. Crossing a snow bridge was the biggest concern. I think the  other parties were challenged by the risks involved because come morning, we were the only group putting our best foot forward. Conditions seemed good, as we had great visibility, and cool temperatures. What concerned us most was the width of the bench that ran up the side of Balfour. From the hut, there was no way of knowing the width.\nOff we set at 10 am for the 11K trip, and headed down the ice field toward the right of Mt. Balfour. We were eyeing the high ramp, and noticed that there was an access line between a set of thee moraine ridges. Once we reached that path, we saw just how wide the ramp off of Balfour really was. The path showed avalanche hazards due to high seracs. Also at the end where we would round Balfour to gain the pass, lies a huge crevasse.\nWeighing the risks, the conditions proved stable enough for us to move through at a quick pace. The bench was wide enough to absorb all but a huge release on the slope without reaching us, although we did cross one section of released debris. Much of the crevasse risk had filled in by the falling and blowing snow. Still, we roped up as we crossed to the right of the huge void just to be safe. As we neared the top, conditions worsened with dark clouds and strong winds. Visibility dropped, and we entered a wind driven, face-stinging white out that would beat down on us for the remainder of the day.\nWinds increased, and snow began pelting us, as we rounded flatter more exposed terrain. Navigation proved troubling for me, and it was time to verify the GPS and a compass bearings. Despite a minor error with a morainal ridge, we gained the right route and struggled to set a pace along a long and flat section designated in the Yoho National park region. Interesting to note, that one of our waypoints was a bench mark, with a note to veer right for safety sake. A couple of accidents had occurred at that point with skiers going over a cliff in poor visibility. Oddly enough, our track went left, and confusion arouse. We went over no ridges, but had to use a compass to get back on track. Not sure exactly how close we came to said edge, but we managed to get back on track. Perhaps the morainal ridge we saw was the start of something more serious. It was good that we had the limited visibility we had.\nWe had hopes that we were running the remaining section without skins, but inclines made that too difficult. With skins going on and off repeatedly,  Trevor and I started having problems with skins sticking to the skis. Snow build-up had wetted them out. On the approach to Mt. Daly, I had my skins off, with the hopes that I was done with them for the day, but such would not be the case.\nRunning South-West, Chris was barely visible in the white out. Trevor stayed as close as possible too. Chris, during one small break in the storm, noticed something up on a ridge that he identified as the hut. I thought he was going for a rock, high up on Mt. Daly.\nWhen I got close enough to see the actual hut, I was getting pretty tired. We were battling cold, strong winds, no visibility, and frost nip on our faces. To make things go from bad to worse, we had a 100m climb up a steep hill, where what I thought contained avalanche potential higher up. We had to climb this because the hut was perched way up on the ridge. The kick in the teeth was that my skins had failed. I was less than a quarter up the hill, and couldn't ski any more. I Tried to boot pack it, but knew I would trash my feet in the process. My spirits were pretty low at that point. In the end, I managed to duct tape one skin, and tightened the tail clip on the other. By then, Trevor had met up with me, pretty much in the same situation. Together. we managed to improvise our skins, and continued on up as a team. \nMeanwhile, Chris had gained access to the Scott Duncan hut, but had to dig out the doorway. Even the door handle posed problems with it freezing and sticking, both inside and outside the hut. He managed to get inside, and get some tea on, knowing we'd be bagged in when we arrived. (well over an hour later)\nBack outside, Trevor and I aimed high on the ridge, and ended up over shooting the hut. Peering down over the roof, we safely skied down and found our way inside. Two or three cups of chai later, and much appreciated chocolate, we were able to get our strength and warmth back to prepare some food. It was victory at the end of an epic day! We were pretty proud of ourselves because of all the groups vying for the hut, we were the only ones to commit and make it. It was our smarts and determination that got the little hut to ourselves. Holding nine in Scott Duncan would have been a squeeze!",
    "directions": "Access via Peyto Lake, or Bow Valley drainage as described during part one of this set of trail posts.\n\nprevious leg | overview | next leg",
    "geohash": "c3jj",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/5920/reg_arriving-at-sd-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5920/reg_balfour-ramp-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5920/reg_cravasse-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5920/reg_cravasse-ahead-2--6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5920/reg_cravasse-ahead-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5920/reg_leaving-balfour-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5920/reg_looking-back-to-bal-hut-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5920/reg_mt-gordon-olive-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5920/reg_scott-duncan-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5920/reg_serracks-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5920/reg_ski-track-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5920/reg_up-belfour-bench-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5920/reg_waputic-mtns-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5920/reg_white-out-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5920/narrow_chris-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5920/narrow_int-sd-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5920/narrow_roped-up-6702.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/wapta-traverse-part-4-balfour-to-scott-duncan-hut-near-banff-ab-5920",
    "stats": {
        "Activities": "climb hike ski-bc",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 5,
        "Time": "6 hrs",
        "Total Distance": "11 km",
        "Town": "Banff, AB",
        "Type": "out-and-back"
    },
    "title": "Wapta Traverse - Part 4 Balfour to Scott Duncan Hut",
    "trail_id": "5920"
}