{
    "description": "previous leg | overview\n\nScott Duncan Hut to Sherbrooke creek drainage exit, route 1 (15.6 km)\nIt's been over a month now that the trip finished, and writing up the last day has taken some time. A mind game is probably at work, in by not putting the final day to word, it keeps the trip memory going on in one's head, and putting it to the end, really makes it so. But at least in doing these trip write ups, I've come to the reality that I want to do it again! Here is how our last day went...\nSo this was to be our final day up on the Wapta. So far, it has been right on schedule for every hut. Our packs were now going to be the weight we dreamed about back on day one. We put a lot of mileage on our skis (and Trevor's were still holding it together!) At least I was of the mind set that I didn't care how long today would take, we'd be arriving to a car, and soon after, a real meal, beer and a shower! After the trek we endured the day before, we were granted a nice day that would keep it together right to the end.\nThe route from Scott Duncan hut is pretty straight forward until you reach Niles Creek drainage. From there, you can get somewhat creative in your descent, but once in the trees, one needs to be wary of elevation in reference to your position because it's easy to lose track. We stuck roughly to our pre-loaded GPS track and soon found the double ruts of an old skin track heading the way we were going.\nLeaving the Scott Duncan hut, we descended the slope to the foot of Mt. Daly and then skirted it left toward Mount Niles. We tried to maintain our floor elevation as we kept to the right of a small  pyramid shaped mountain nicknamed the nipple. It seemed odd not to have an official name, but once you see it on Google earth next to Niles and Daly, well, it's not really worth even mentioning! It was a relatively easy ski up to this point, and we even had a reprieve from the strong winds of the previous days. It was, by all accounts, finally turning to decent weather.\nStaying right, we spread out and quickly skinned across the slopes below the peak of Mt Niles, moving left as a bench opened out. A ridge runs off Mt Niles, and we followed below this, keeping a comfortable distance from its heavily cornice topped slopes.  In a small enclave of rocks, near a drainage point, we took a break for lunch and some photos. I began to realize that this was nearing the end of our trip. After today, it would be pretty much all over. I don't even think we had a group photo up to this point. Beyond that, it was the other reality stuff of getting back to work and such that I was thinking would be greeting me in a matter of days. Here, it was a totally different world governed by way different rules. I kind of liked this world, if not for a reality, then for at least a change of pace.\nAfter we lunched, we discussed the route that lay ahead of us. We were in a transition point, it was midday, the weather was getting warm, and there were a lot of south and SW facing slopes to cross. The long extended ridge of Mt. Niles that bench-lined our route was continuing to provide us with unexpected avalanche hazards, and given the warming trend, we were getting concerned.\nWe decided that it was best to ski in a sling shot manner, with one member skiing to a safety point, and the the following member would proceed to ski past to a new safe point. This was a good strategy, except for the fact that Trevor and I kept falling in flat light of the shallow undulating gulley. \nSome of the slopes already had small releases. I tried to ski near one, but found it to be really tough stuff. (reality check again!) As we passed the end of the Niles ridge line, Trevor and I passed by the bottom, and as Chris skied a higher line, the hill released in a slow wet slab. Like deer staring into headlights, we watched the snow coming toward us. It was a whole new experience for me. It turned out that we were never in harm's way, but it was an experience for sure.\nNot quite out of danger, we entered the trees, looking for a route that didn't dump us into a creek or put us off track. Heavy sloughing kept us ever mindful of potential slides that could enter into our top fringes of the woods and wither pin us or sweep us over ridges. It was a whole new landscape of deep and steep powder anchored by tall old growth trees.\nEventually, we stumbled upon an old set of skin tracks that led along the right (west) side of a creek, and followed them down through pretty little meadows to Sherbrooke Lake. Some spots were rather exposed along gully edges, but we made it through with no deviation from the existing ski tracks. Even with packs lacking all the food weight from the past five days, it was still a trial at times to get through the narrow traverses in the glades. Ski tips would catch in the deeper off-track snow, and falling meant dumping your pack and skis to right your self again. It took some time to get the hang of it, but I caught on!\nSherbrooke Lake was a pleasure to see, and by that time it was sunny with temps over freezing. We were glad to be past the avalanche risks at least. As we crossed the snow covered ice of the lake, we heard loud cracking on two occasions, with the last one giving me the sensation of dropping a foot as snow collapsed beneath me. No harm done, but we soon made our way to the edge of the lake and finished the crossing. Mount Daly with its long ridge line paralleled us left above the lake, and later on Mount Paget would terminate the peaks until the highway. Still, there was a lot of elevation to lose before then.\nLeaving the lake, we had an undulating trip, and never wanting to put skins on again, though we still had to herring-bone or side step up lots of little hills. Eventually the topography trended downward, and we were at a set of trail signs. One led back to the lake, one to Paget lookout, and the obvious route remaining took us downward!\nThe trail must be a fun hike during the rest of the year, but on skis, it was wildly fun roller coaster descent. Constantly trending left, we descended until at one point we could see through a little clearing, the highway, and hear traffic. It's bitter sweet, the feeling when you experience that. One side says the slogging and toil is over, while the other says this trip is too.\nWith hoots and hollers, after the final drop, one by one we landed in the parking lot. High fives among us, and thanksgivings offered to Trevor's ?still in one piece?skis, we ditched our packs and started feeding gear into the Mazda rental. After sending out SPOT checks, and stowing gear, I thought I lost my SPOT messenger device. How funny to have misplaced a device used to help keep you found! I managed to find it in a pocket later on.\nThe beer and greasy food back at the hostel soothed the aches and pains from the trip, and sleep came easy. The Hostel was back at Lake Louise, with a beautiful room to ourselves. We lingered in the restaurant past check out time, looking at photos, analyzing data, and checking Avi reports. It turned out our trip out was on a day rated as high for Avi hazards. We got by based on our own judgement calls out in the back country, but slopes were definitely ready for human triggering.\nWe all bid adieu, and with that, Chris headed back to BC, while Trevor and I headed back to Calgary and Lethbridge. The time had come to leave the surreal Rocky Mountain setting and make my way for home back on the east coast.",
    "directions": "The Wapta Traverse is traditionally accessed by either the Peyto or Bow Lake drainages, but alternatively, if you wanted to do this final day by itself, look along Route 1 near Kicking Horse Pass, and Wapta Lake, along with West Louise Lodge. There is a trail to the Paget Mountain lookoff. We took this trail from Sherbrook Lake to exit off the Wapta Traverse.\n\nprevious leg | overview",
    "geohash": "c3j",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/5921/reg_334-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5921/reg_343-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5921/reg_347-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5921/reg_IMG-0948-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5921/reg_IMG-0951-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5921/reg_IMG-0953-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5921/reg_IMG-0954-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5921/reg_IMG-0965-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5921/reg_IMG-0967-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5921/reg_IMG-0968-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5921/reg_IMG-5270-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5921/reg_Slide1-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5921/reg_Slide2-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5921/reg_Slide3-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5921/narrow_338-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5921/narrow_355-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5921/narrow_356-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5921/narrow_IMG-0956-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5921/narrow_IMG-0963-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5921/narrow_IMG-0970-6702.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/wapta-traverse-part-5-scott-duncan-to-hwy-1-near-field-bc-5921",
    "stats": {
        "Activities": "climb hike ski-bc",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 5,
        "Time": "7 hrs",
        "Total Distance": "16 km",
        "Town": "Field, BC",
        "Type": "out-and-back"
    },
    "title": "Wapta Traverse - Part 5 Scott Duncan to Hwy 1",
    "trail_id": "5921"
}