{
    "description": "The Wapta Traverse is one of Western Canada's classic alpine traverses, and showcases the stunning scenery of the Canadian Rockies.  The Wapta Icefields, in the Waputik Range of the Southern Canadian Rockies, is a destination for winter ski touring, ski mountaineering, and summer hiking, climbing and mountaineering.  \nNote: This trip is not one to be taken lightly. Proper training, experience, and equipment is essential for worst case scenarios like avalanches, crevasse falls, getting lost or injured. A guide is highly recommended unless you have well equipped team mates.\nThe complete traverse starts at Peyto Lake, just north of Bow Pass on the Icefields Parkway and travels via four ACC Class B Alpine Huts to Hwy 1 just North East of Field, BC, trending along a south-east route.  Many people skip the more technical northern Peyto section, and start the traverse at Bow Lake, climbing up to Bow Hut. Although the Bow Lake approach makes the entire traverse a day shorter (and also makes for a shorter first day), there is no less avalanche potential than the Peyto approach. \nThe images posted are the associated ACC huts (Peyto, Balfour, Scott Duncan and Bow; not in order), and the iconic Mount Saint Nicholas just beyond the Bow hut.\nSome resources include Chic Scott's \"Ski trails in the Canadian Rockies\" and of course, Freedom of the hills has a fine section on glacier travel, route finding, avalanche safety and ski touring.\nExploration of the Wapta Icefields began in the late 1800's  through to the 1930's. Huts were financed and constructed in the 1950s and taken over by the Apline Club of Canada who currently rent out and maintain them.\nAlthough there is the occasional group that does the traverse in a single day, mere mortals tend to take the full four or five days.  Variable conditions make it difficult to determine how long each leg will take.  Deep, heavy snow, high avalanche danger, whiteout conditions, strong winds, extreme temperature ranges and other conditions typical of these mountain areas canl double or triple a day's work.  It is common for people to keep a few extra days up their sleeve for times when conditions leave you with no alternative but to stay in the hut until conditions improve.  \nEspecially in winter, it is important to constantly re-evaluate conditions, and your group's acceptance of the associated risks.  Many a group has wisely turned back the way they came, leaving the traverse for safer day.\nAlternate Routes:\n\nshorter route - come in at Bow Lake, head south and go out at Hwy 1\ncome in from the south at Hwy 1 - and head north, either as a return trip, or exiting at Bow or Peyto Lakes\ncome in at Bow Lake and go out at Peyto Lake\ncome in from Bow Lake, stay a night at Balfour, and return out the way you came via Bow Lake\ncome in at Peyto Lake, go out at Hwy 1, but avoid Bow Hut\n\nStandard Route Trip Itinerary:\n1st Leg - Peyto Lake to Peyto Hut\n2nd Leg - Peyto Hut to Bow Hut\n3rd Leg - Bow Hut to Balfour Hut\n4th Leg - Balfour Hut to Scott Duncan Hut\n5th Leg - Scott Duncan Hut to Hwy 1 near the Alberta / BC border.\nBook your hut stays through the \"Alpine Club of Canada\" a good season or two in advance, depending on how large your group. There are several sites on the web that indicate mapped routes, photos, and packing lists.",
    "directions": "Wapta Lake Trailhead - Car Drop on Hwy 1:\nIf you're planning on skiing the whole traverse, you'll need to drop a car at the southern end.  The southern trailhead is about 20km west of Lake Louise, on Hwy 1, halfway between Field and Lake Louise, at a place officially known as Hector on the map.  There's some lodging on the north side of the road that is closed in winter, but has a large car park that is cleared regularly of snow.  This is also the trailhead to Paget Peak.\nPeyto Lake Trailhead:\nOn the left (west) side of road, just down the hill north of Bow Pass a two star pickets, one on either side,  mark a slightly hidden entrance to the Peyto Lake car park entrance.  This is not the large car park for the hike at the pass that takes you to a high lookout above Peyto Lake.\nThe easiest way to access Peyto Lake is to ski north along the side of the road for about 100m.  You'll see an opening in the trees below.  Ski down this to an old road bed.  Take the road to the left (south) for a short way until you see some flagging on a branch.  This will take you down through steep tight trees to the NE end of Peyto Lake.\nBow Lake Trailhead:\nAt the north end of Bow Lake, the historic Num-Ti-Jah Lodge can be found looking across at the Bow Icefall, and the easiest of the northern access points to the Wapta Icefields.",
    "geohash": "c3j",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/5922/reg_BALFOUR-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5922/reg_bow-hut-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5922/reg_mt-st-nick-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5922/reg_peyto-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5922/reg_scott-duncan-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5922/mt st nick.JPG"
    ],
    "source_url": "https://trailpeak.com/trails/wapta-traverse-an-overview-near-banff-ab-5922",
    "stats": {
        "Activities": "hike ski-bc",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 5,
        "Time": "40 hrs",
        "Total Distance": "50 km",
        "Town": "Banff, AB",
        "Type": "out-and-back"
    },
    "title": "Wapta Traverse - An Overview",
    "trail_id": "5922"
}