{
    "description": "August Ceek trail is a great cross-country ski trail at Marias Pass (el. 5,213'), Montana. A striking monument in the form of a tall obelisk demarcates the highpoint of the pass on the west side of the highway. The August Creek trailhead is just across the highway from this parking area. \nWe hiked with our skis from the car and put on our gear after crossing the rail tracks. Lucky for us, someone had already broken trail through the forest and we had an easy day with no problems route finding along the six-mile (10 km) trail.  I'm not sure how easy it would have been to have found our way without the aforementioned tracks... There is a trail marker sign but it's not 'right there' after crossing the rail tracks (and signage along this trail could very well be buried by snow on some winters). There might be orange markers on the trees but I do not recall for sure! It might not be a bad idea to upload the GPS route, which you can get here or map yourself (it shows up quite well in GE when you turn on the places of interest option.) \nIdeally,  park a shuttle at the bottom exit point, or alternatively you could ski to the half-way point to get some views and turn around before the trail starts to drop in elevation. Skiing towards Little Dog Mountain, we stopped for lunch once we reached the open areas accross Blacktail Hills. We enjoyed views of Elk Mountain and viewed a number of small avalanches coming down the ridges off in the distance, with the sound amplified by the valley walls. The trail continues southwards from the open area and skirts along a pretty large avalanche chute under Elk mountain. It is possible to avoid the avalanche chutes by skiing towards Blacktail Hills, but it might require a bit of bushwhacking. After skirting the edge of the chute, the trail start to lose elevation in a hurry and it's a fun but tight and steep luge-run back to the highway.\nWe attempted to complete a loop by skiing on the snow alongside the highway to get back up to the Pass. It's do-able... but not reccommended, as it gets a bit steep just before the pass. We were offered a lift after we'd skied about half of the way back and we gladly accepted.",
    "directions": "Marias Pass is located about 10 minutes west of East Glacier on the route 2. There is a parking area right at the 'summit'. The start of the Autumn Creek trail is on the other side of the highway, accross the train tracks. The exit point is a few miles south down the road and there is space for parking on the northbound side of the highway.",
    "geohash": "c2x6",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/MT/5929/long_blacktail-hills-7490.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/5929/long_merged-shot-from-start-7490.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/5929/reg_IMG-5542-7490.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/5929/reg_IMG-5543-7490.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/5929/reg_IMG-5547-7490.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/5929/reg_actual-tracks-7490.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/autumn-creek-marias-pass-montana-near-east-glacier-park-mt-5929",
    "stats": {
        "Activities": "ski-bc ski-xc",
        "From": "",
        "Seasons": "winter",
        "Stars": 4,
        "Time": "6 hrs",
        "Total Distance": "10 km",
        "Town": "East Glacier Park, MT",
        "Type": "out-and-back"
    },
    "title": "Autumn Creek (Marias Pass, Montana)",
    "trail_id": "5929"
}