{
    "description": "We walked 3.5km on the CPR railway right-of-way from Sherman Rd., Duncan, BC to Lake Cowichan Road. The eastern trailhead is located at Sherman & Lane Roads in Duncan, British Columbia. We walked westbound for 1.6km until we arrived at Bing Creek and found the footbridge washed-out.\nWe didn't even know the old E&N spur-line -- original owned and surveyed by Canadian Pacific Railway [CPR] -- from Duncan to Lake Cowichan, crossed any creeks. We do now. Had we known there was a small creek to forded, we would have included extra footwear to walk through the 50mm-deep water; thus, we decided to turn around and go back to Sherman Road. From there, we drove west on Sherman to Cowichan Lake Road where the right-of-way crosses and there is adequate parking.\nFrom Cowichan Lake Road we walked the 1.9km eastbound back to Bing Creek. Initially, this section of the trail was so muddy (they had snow here as recently as two-weeks' ago) we searched for an alternated route but found none; however, on the return trip, we discovered the trail is paralleled on the southside by Cleave Road. We did not miss walking in the mud for the last 400m back to our car. It was due to this mud that the 7km we walked took us two-hours in total.",
    "directions": "Drive to Sherman Rd, Duncan, BC, where Lane Rd. intersects. Parking is in the residential area to the east.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/5930/reg_duncan-cpr-800-009-trailwest2-19432.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5930/reg_duncan-cpr-800-012-crikwest-19432.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5930/reg_duncan-cpr-800-017-th-2paldi-19432.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/5930/narrow_duncan-cpr-800-014-bypass-19432.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/cpr-railtrail-duncan-bc-near-duncan-bc-5930",
    "stats": {
        "Activities": "mtn-bike hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 2,
        "Time": "1 hrs",
        "Total Distance": "4 km",
        "Town": "Duncan, BC",
        "Type": "out-and-back"
    },
    "title": "CPR Railtrail Duncan BC",
    "trail_id": "5930"
}