{
    "description": "Calico tanks is a special place. A short hike listed as moderate, experienced hikers may be tempted to pass it by. There are several reasons why you shouldn't. This may be the best hike along the scenic 13 mile along Red Rock canyon drive that drops you off at various hikes (such as Icebox canyon). Firstly, the red rock and unique sandstone that has been carved by nature over millions of years make this hike a visual and tactile feast. Cactus, flowers, smooth rock walls on your left and right as you ascend gradually. My hiking partner thought it had a special energy, despite the proximity of the parking lot and crowds. Once you start hiking, you should lose most of the crowds, though, you will likely meet several groups on your hike -- it's that popular. Regardless, you will love this hike. It actually has some technical aspects, making it fun for fast hikers who like to hop from one rock or hold to the next. The 1.1 mile one way distance is a gradual up with some steep sections at the end, and a few more technical options for those looking for it. For those who want it safe, the park staff have placed several sections of rock steps, making it that much easier for all ages. If it wasn't for the absolutely spectacular scenery along the way, this hike would rate as just another quick-fix workout, similar to the grouse grind in Vancouver or Camelback in Phoenix.\nBut there's just something about this gem in red-rock canyon, and I don't doubt for a minute we are tramping on a place kept sacred by first nations for thousands of years. You will see a sign near the start of the hike marking an agave roasting pit, and, it's clear these red rocks and this site was a place for feasting, celebrating, and harvesting for centuries. In that regard, enjoy the hike, but stay on the trail so as not to disturb the ecology or the cultural heritage of the site.In terms of the hike itself, you initially walk along a sandy wash, as you make your way up a narrow canyon to the Calico tank which in April, still had water in it. You may have beige sandstone on one side, red on another, and, lots of rock ledges to gain affording you views. When you reach the tank (the pond fed by the rock bowl), keep going, a sharp eye will pick out the trail continuing until the the peak of the trail. You now have an impressive view of Las Vegas. From this vantage point, you will feel like a zen master contemplating the busy goings on in Las Vegas while you sit in solitude. Las Vegas seems so small and quiet from this lookout and happily it seems, nature still rules.Your return is much the same path, although it will look very different in places on your return, and, it's not hard to miss a set of steps on the way down through a narrow point of the canyon.If you are looking for a more challenging hike, you can climb Turtlehead Mountain lookout, which has the same starting point as calico tanks. It's 2.5 miles oneway with a fairly involved 2,000 foot elevation gain. Locals we met on the hike mentioned however that Calico was their favourite with Icebox Canyon coming second.",
    "directions": "Red Rock canyon can be easily reached by driving out Charleston Street off the strip. Find your way to the Stratosphere Hotel (not a bad place to stay) and head towards downtown Las Vegas (away from the strip). Turn left on Charleston, and drive quite a ways towards the red rocks, youll see them in front of you as you apprroach. Once you lose the suburbs, youll see signs for Red Rock Canyon, only open from 7 to 7, and a $5 car entrance fee.",
    "geohash": "9qmv",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/NV/5939/reg_ct-0001-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/NV/5939/reg_The-Ledge-34557.jpg",
        "https://trailpeak.com/storage//content/trails/US/NV/5939/reg_ct-0002-1-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/NV/5939/reg_ct-0003-1-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/NV/5939/reg_ct-0006-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/NV/5939/reg_ct-0008-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/NV/5939/reg_ct-0009-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/NV/5939/reg_ct-0010-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/NV/5939/reg_ct-0012-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/NV/5939/reg_ct-0014-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/NV/5939/reg_ct-0015-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/NV/5939/reg_ct-0016-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/NV/5939/narrow_ct-0003-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/NV/5939/narrow_ct-0004-5.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/red-rock-canyon-calico-tanks-near-las-vegas-nv-5939",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "4 km",
        "Town": "Las Vegas, NV",
        "Type": "out-and-back"
    },
    "title": "Red Rock Canyon - Calico Tanks",
    "trail_id": "5939"
}