{
    "description": "This small slow river, that is more like a creek, provides a frequent get-away for me and my family. Water levels may be too low during the summer for canoes with a keel, and at times, even those that are keel-less. Level 1 paddling. The current is slow enough that you can paddle upstream to the put-in (except at the fish counting station where a portage is necessary). \nThe length of the trip is 10km one way, 5 km if you put in just before Fort Langley (recommended). Plan on at least 3-4 hours.\nRefer to Trail Head directions below for different put-ins. \nThe river has heron, eagles, and a variety of ducks. Beaver have slapped their tails at us a number of times. We have also fished the river (I believe it is catch-and-release only) for trout, and more commonly squawfish. \nThere is a pumping station where the Salmon River meets the Fraser River. You will need to pull off to shore and portage your canoe down to the Fraser (Bedford Channel). We normally turn around at the 96Street bridge where there is a small patch of grass (on the northwest side of the bridge) for eating a quick bite of lunch before heading back to the put-in.",
    "directions": "If you put in at MacMillan Park, you may run into a lot of brush before Fort Langley. Take a portable tree saw or pruners. The park is just south of the Trinity Western University Entrance on Glover Road. There is a large culvert that goes under Highway 1. If the water level is high, you may not be able to get through the culvert. When my children were younger, they didn't really enjoy the length and darkness of this tunnel. There is a fish counting station close to Rawlison Crescent. You will need to do a 10-step portage here. \nMore frequently, I put in at the bridge just south of Fort Langley on Glover Road. Pull over to the east side of the road on the south side of the bridge. There is a blackberry ridden path down to the river. I sometimes go through the short path with a machete or pruners to remove blackberry branches that are going to get in the way of moving the canoe down to the water but most of the time, the trail is clear enough. The advantage of putting in here, is that you can easily paddle back.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/5943/reg_IMG-1923-21631.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/salmon-river-langley-bc-near-langley-bc-5943",
    "stats": {
        "Activities": "river-canoe",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "6 hrs",
        "Total Distance": "10 km",
        "Town": "Langley, BC",
        "Type": "out-and-back"
    },
    "title": "Salmon River Langley BC",
    "trail_id": "5943"
}