{
    "description": "Dead horse loop is a fantastic ride despite it's unassuming start in an open plain.  Don't let the early stages of this trail deceive you.  You may have to cover sections of double-track and loose gravel, but before long you will end up on rolling single track where sky meets mountain and an expansive plateau just below the peaks filled with Joshua trees.  This ride is part of an extensive ride network called the Cottonwood/Blue Diamond trails near Las Vegas Nevada. \nThe start of the ride is just out of the parking lot by the pit toilet. Leave the parking area on the road you drove in on and ride back towards the highway and look to the left for the trail paralleling the highway going up Spring Mountain.  Follow this under the wooden utility towers until you get to an intersection heading left a few hundred meters up the trail.  Take it, and, continue a gentle climb until you hit another  T intersection, go in the direction of up (right - towards the mountains above you).  It's a long climb, with some loose gravel and a few gully's to cross, helping break up the climb.  You may wonder what the big deal is about this ride.  But as you gain elevation, the trail becomes a roller coaster, and, levels you off to enjoy some technical single track with the cliffs above you on the right.\nAt various sections of the trail (about a dozen or more trail markers) you'll see metal posts saying \"trail\" and in white chalk or paint sometimes you'll see written on the same post \"deadhorse\" or \"DH\".  These help (if you don't have GPS) so try to follow these markers when possible, there is a convenient arrow on most signs, at least for the early and latter parts of the trail. \nYou descend, gain, descend gain, and, pass through Joshua tree forests as you continue, finally working your way into the bowl of the peaks, with a final steep set of switchbacks to climb to get to the upper plateau.  I had to get off and walk for part of it, at this point, you've done a lot of climbing and this will be obvious as you look back down the plain to your parking area.\nNow at the upper plateau, you hit your first flow of downhill section, not steep at all, and really fun, you'll gain speed and before you know it and this short stretch is just before your turn around so enjoy it.  If you really enjoy it you may go too far on the loop, as I did.  Be careful, you could end up going down the other side of the mountain.   \nThe exact turnaround point I never found, since there are jeep roads splitting off in a few places including one which takes you into a hunting area.  Avoid this route.  Instead as you get to a road intersection point,  hairpin it i.e. look back to get a visual fix on the high peaks that were part of your initial ride.  You can head back in this direction along the main jeep road (that would take you back to your car). Do this, and if you look close just on your right, on the other side of this road you will see the Dead horse loop trail. It closely follows the jeep road for a while, so don't worry if you can't initially find it, you will.    You'll see this in the GPS/Google  map, how your route turns back on itself.  Keep an eye out for a a few more \"trail\" signs and you may now even see a few \"DH\" or deadhorse loop scribblings to confirm it.\nYou are still on the high plateau, but you just know you are going to start descending soon. You will come across a big trail sign with a map, a trail kiosk of sorts with a faded trail map on it.  It's a natural point to stop and get ready for what the locals call the three mile smile on single track.  You descend on the other side of a small bluff (Red Valley) that is packed red dirt and super fun - no loose gravel here.  It's all downhill all the way back to the start, what a great ride! I felt it was more technical getting to the top and turnaround, than the 3 mile smile itself.  This ride is several types of riding in one, making it a moderately difficult trail.\nI had the local map and it helped in terms of placing the trail I wanted to be on with other jeep roads or trails.  You can get the map at the Las Vegas Cyclery on Charleston Street, not all that far from red-rock canyon which was my first stop for a hike. If you have a GPS, consider downloading the attached GPS data.  I also rented my bike from there, a Santa Cruz Blur.",
    "directions": "The parking area is exactly 6 miles up Route 160 from the gas station at the Junction of Route 159 and 160.  You can get to this intersection from Blue Diamond Road (coming from Red Rock Canyon as I did), or,  from Las Vegas along 160.  It will be the last parking lot on your left (look for the pit toilet) before the highway climbs up Spring Mountain (and the small housing community at the pass).  If you drive up the mountain, you've gone too far.   You can get to this intersection from Blue Diamond Road (coming from Red Rock Canyon as I did), or,  from Las Vegas along 160.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/NV/5954/reg_dh-0001-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/NV/5954/reg_dh-0002-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/NV/5954/reg_dh-0003-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/NV/5954/reg_dh-0004-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/NV/5954/reg_dh-0005-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/NV/5954/reg_dh-0006-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/NV/5954/reg_dh-0007-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/NV/5954/reg_dh-0008-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/NV/5954/reg_dh-0009-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/NV/5954/reg_dh-0010-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/NV/5954/reg_dh-0011-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/NV/5954/reg_dh-0012-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/NV/5954/reg_dh-0013-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/NV/5954/reg_dh-0014-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/NV/5954/reg_dh-0015-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/NV/5954/reg_dh-0016-5.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/dead-horse-loop-near-las-vegas-nv-5954",
    "stats": {
        "Activities": "mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "24 km",
        "Town": "Las Vegas, NV",
        "Type": "out-and-back"
    },
    "title": "Dead Horse Loop",
    "trail_id": "5954"
}