{
    "description": "If you are doing Gemini Bridges, a well known bike/ATV route just a few miles out of Moab, consider riding the other side of the road on Bar M, Rockin A, and, Circle O.  Killer B is an advanced section I didn't have time for. While waiting to meet friends at Gemini Bridges, I asked in town about another good trail nearby.  I asked for \"moderate\" and this is what I got with Rockin A and Circle O. Once you get on the slick-rock sections, you'll find yourself challenged to take all the dips and hits as you roll from one rock crest (not sure what else to call them) to the next.  In between you get some small tire traps to practice on -- a very good thing if you are headed to Slickrock.  Compared to Slickrock, this route is flat. It can be a bumpy ride, but you get the bonus  of being able to ride very close to Arches National Park.  If you ride here at Sunset, you'll get great pics as I did on a second sunset ride a few days later.At first, you are riding on the old Hwy (out of the parking lot marked by the cowboy on the horse off the hwy) heading back towards town. There are signs once you reach the trail head, and even posted maps at key intersections, no real fear of getting lost except that the painted red line on the slick rock (bumpy rock) was faded and a hard to follow at times. Once you start to climb and get into more technical terrain you come to the sign for Killer B.  Take it.  At this point you are on slickrock and rock tops (rock bunions?).  The route winds and winds, perfect for the intermediate rider, a challenge for beginners as they may find the slope on technical rock a bit challenging.  More advanced riders can really whip this trail, loading and unloading the front bars are you roll the terrain.Follow the painted red line and stay on it as much as possible so as not to damage the ecology which includes cryptobiotic soil and cactus.  After Killer B, you are naturally guided to Rockin A and Circle O, which will have you weaving and looping until finally Circle O straightens out and takes you to the bar M (an easy jeep road) trail to close your loop.  Take a left on Bar M, then a few hundred feet later, a right and this is the cutoff back to the parking lot, a nice little downhill.  All in -- a few hours.",
    "directions": "Drive out of Moab about 10km and directly opposite Gemini Bridges parking lot you'll see a Cowboy statue and parking lot on the other side of the road.  There's a tourist dinner/cowboy show building here -- but it was empty when we visited in April.  Lots of free parking compared to the Gemini Bridges fee box.  If you do park at Gemini bridges, you can get to this trail via a tunnel under the road. However, being cheap, I opted to park here in the first place.  Can't miss it, look for the cowboy on horse and chuck wagon as you drive out of Moab, right opposite Gemini Bridges parking lot.Accommodations: A lot of people in the MOAB area stay at condos managed by www.moabutahlodging.com, speak with Andrea. They offer a range of in town homes to budget and upscale condos.",
    "geohash": "9wf5",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/UT/5957/reg_A-0001-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/UT/5957/reg_A-0002-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/UT/5957/reg_A-0003-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/UT/5957/reg_A-0004-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/UT/5957/reg_A-0005-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/UT/5957/reg_A-0006-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/UT/5957/reg_A-0007-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/UT/5957/reg_A-0008-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/UT/5957/reg_A-0009-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/UT/5957/reg_A-0010-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/UT/5957/reg_A-0011-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/UT/5957/reg_IMG-0001-5_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/US/UT/5957/reg_IMG-0002-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/UT/5957/reg_IMG-0003-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/UT/5957/reg_IMG-0008-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/UT/5957/reg_IMG-0011-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/UT/5957/reg_IMG-0012-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/UT/5957/reg_IMG-0014-5.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/circleo-rockina-barm-near-moab-ut-5957",
    "stats": {
        "Activities": "mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "12 km",
        "Town": "Moab, UT",
        "Type": "out-and-back"
    },
    "title": "CircleO-RockinA-BarM",
    "trail_id": "5957"
}