{
    "description": "This trail can be reached from the \"Lower Loop\" of the Romero Canyon trail system, or it can be done from the top (East Camino Cielo). The Lower Loop has already been posted on this site, so I'll not include that part of the whole experience. I hiked the trail, but I encountered several mountain bikers (most were going downhill). The next time I'm in this neck of the woods I'll be on my mountain bike for sure! Starting at Romero Saddle (where you park at the top), there is a choice to make. Do you want to do the gnarly stuff first, or last? Standing at the top looking south (towards the ocean here in Santa Barbara), you will see a fire road that heads off behind the water collection tank (big cylindrical cement rain collector) towards the west. That is the nice wide relatively smooth route down to the trail intersection (about 3.3 miles). The scenic views are astounding! Then comes the hard part,, the trail back to the top. \rIf you choose to get the hard part out of the way first, then from the top look off to the east and note the trail that goes up the side of the hill where the paved road turns to dirt. That little trail will gain about 300~400 feet in elevation before it plunges down the east side of the Romero Canyon to the previously mentioned trail intersection (about 1.9 miles). This is mostly single track and goat trail type terrain. Not too many rocks, but if you are on a bicycle it will require all your attention! It is very narrow and quite steep. \rOk, now that you are at the trail intersection (regardless of how you got there), you will need to get your bearings. If you stand next to the trail sign (the one held up by a rock pile), and face South (towards the ocean) you will see 3 trail choices in front of you. The one that drops off down hill to the left is the single track part of the lower loop (don't go that way if you are headed back to the top). The two trails that are headed South, are the two trails that head up to the top. The one that goes up to the right is the steep single track back to the top (not a good choice for going up on a bicycle). The trail (dirt road) that heads towards the ocean is the nice wide fire road that skirts the perimeter of the hillside all the way back up to the top. The only trail not yet mentioned is the one that heads north (behind you if you were facing south and standing next to the trail sign). That is the old road that comes up from the lower loop. It is a great route, but if you are headed back to the top, don't go that way either!)",
    "directions": "Highway 154 (the Chumash Highway) to East camino Cielo. Park at the end of the road (10 miles?) where the road turns to dirt. If you are a local, you can take a short cut up Painted Cave road to East Camino Cielo (turn right on East Camino Cielo). Or You can also take Gibraltar road to East Camino Cielo (turn right on East Camino Cielo), maybe 5 miles to the end.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/CA/5958/reg_RC-Retrospect-East-20008.jpg",
        "https://trailpeak.com/storage//content/trails/US/CA/5958/reg_RC-Retrospect-North-20008.jpg",
        "https://trailpeak.com/storage//content/trails/US/CA/5958/reg_RC-Retrospect-SE-20008.jpg",
        "https://trailpeak.com/storage//content/trails/US/CA/5958/narrow_RC-Panorama-East-2-20008.jpg",
        "https://trailpeak.com/storage//content/trails/US/CA/5958/narrow_RC-Panorama-South-20008.jpg",
        "https://trailpeak.com/storage//content/trails/US/CA/5958/narrow_RC-Panorama-WNW-20008.jpg",
        "https://trailpeak.com/storage//content/trails/US/CA/5958/narrow_RC-Panorama-West-20008.jpg",
        "https://trailpeak.com/storage//content/trails/US/CA/5958/narrow_RC-Valley-View-up-the-trail-20008.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/upper-romero-canyon-near-santa-barbara-ca-5958",
    "stats": {
        "Activities": "mtn-bike hike",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "8 km",
        "Town": "Santa Barbara, CA",
        "Type": "out-and-back"
    },
    "title": "Upper Romero Canyon",
    "trail_id": "5958"
}