{
    "description": "An all season walking/hiking trail loop along the north side of the North Saskatchewan River (NSR) from Sir Wilfred Laurier Park to Riverside Drive.  Enter the loop at any location, ideally at the top of the river valley along Valley View Drive near one of the vista locations.  The trail may be undertaken in either direction.\rStarting at Valley View Drive and 91st Avenue head south along the top of the river valley and follow Valley View Crescent as it turns West.  At the first opportunity turn South again and travel approximately 55 meters to enter an alley heading east that will quickly turn into a well treed path toward the river.  The path is a moderately gentle downward grade.\rFollow the GPS track to the base of the pedestrian bridge that crosses the NSR (but do not cross).  Turn north and follow a well travelled moderately undulating path to the north until reaching stairs that begin the start of the climb out of the river valley toward the west at the north end of the loop.  This is a moderate uphill climb.  At the top turn south and follow Riverside Drive along the top of the river valley to complete the loop back to the start at 91st Avenue and Valley View Drive.  This part of the loop is flat with many good vistas of downtown Edmonton where houses are not built along the river valley.\r",
    "directions": "From downtown Edmonton head west along Jasper Avenue to 124 street and then continue west along 102nd that turns into Stony Plain Road.  At 142nd street turn left and travel south until reaching 91st Avenue.  Turn left to head east to Valley View Drive.  The trail can start anywhere along this portion of the Drive.",
    "photos": [],
    "source_url": "https://trailpeak.com/trails/north-saskatchewan-1-near-edmonton-ab-5975",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "5 km",
        "Town": "Edmonton, AB",
        "Type": "out-and-back"
    },
    "title": "North Saskatchewan 1",
    "trail_id": "5975"
}