{
    "description": "There is a rough network of trails in the hillside on the immediate South side of Drumheller stretching from Hiway 9 then West to the Jesus.  You can also do some exploratory rides to the East as well.  The trails can be used by quads, dirt bikes, 4x4s, yokels or mountainbikers so watch out if you're riding around here, broken beer bottles, old couchs, and a couple dead cars can all trip you up.  I wouldn't pass up a trip to Moab to go here, but it was a nice change from Kananaskis.\nThere was a bit of a difference of opinion on this trip.  Some people thought the ground texture was much like Goose shit while others felt it was more like Loon shit.\nDrumheller has interesting geology, that is for sure.  A very high clay or Bentonite or similar soil that when damp or heaven forbid wet, gets to be simultaneously both the greasyest and stickyest stuff to ride.  It was so bad it stopped my tire when I was in 1/1.  I could not pedal.  I had to find a stick, force the wheel backwards, poke out all the crap.  It was nasty.  A few people got sideways in the slippery clay and ended up with bruises but nothing too dangerous.\nThe trails in the attached GPS file should be considered a guide, but go free style.  But if it is, or has recently rained DO NOT GO RIDING.  Or even hiking.  It is too slippery to be safe.\nDrumheller itself is an interesting little berg.  Cute downtown, enough hotels & basic restaurants if you want to spend a night or two there.  The world class Royal Tyrell Museum of Paleontology (dinosaurs & other cool stuff) is well worth a trip.  Dinosaur Provincial Park and Dry Island Buffalo Buffalo Jump and other attractions are all nearby.  A couple Ghost towns, small towns, Last Chance Saloon, coal mine, and an opera house all round out your visit to the area.\nAnd for you roadies, there is a well known loop along the road to the free Bleriot Ferry, and back down the other side.  Riders desiring a (not-so)free ride to the top, can pay for the lifts at the ski hill (check web or phone for hours to make sure they're operating).",
    "directions": "From Calgary, drive North up Hiway 2.  A few km past Airdrie you will see Hiway 9, take that to the East for about 95km to the trailhead.\nThe trailhead is approximately 1.8km South of the Hiway 9 / Hiway 10 intersection so if you hit those lights, turn around and look on the right (west) side of road for a turn into a flat clearing.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/5980/reg_IMG-2600-Small-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5980/reg_IMG-2602-Small-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5980/reg_IMG-2603-Small-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5980/reg_IMG-2606-Small-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5980/reg_IMG-2614-Small-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5980/reg_IMG-2615-Small-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5980/reg_IMG-2616-Small-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5980/reg_IMG-2625-Small-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5980/reg_Rene-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5980/reg_drum1-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5980/reg_drum2-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5980/reg_drum3-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5980/narrow_IMG-2620-Small-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/5980/narrow_IMG-2622-Small-6828.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/drumheller-mtb-intown-rides-near-drumheller-ab-5980",
    "stats": {
        "Activities": "hike mtn-bike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 2,
        "Time": "3 hrs",
        "Total Distance": "20 km",
        "Town": "Drumheller, AB",
        "Type": "out-and-back"
    },
    "title": "Drumheller MTB intown rides",
    "trail_id": "5980"
}