{
    "description": "A multi-use trail (ATV, Horse, Mtn Bike) that runs above the Clearwater River Road.  Lower section has a moderate grade with some short steep pitches (approx 100m of vertical).  It can be run in either direction depending on the desired workout.  There are is a couple deep puddles, a crude bridge over Gates Creek and one small creek fording.  Road access is excellent.\nThere is an upper portion to the trail that is extremely steep and is largely used by ATVs for hill-climbing.  This upper portion is not included here but joins with Road 1 at approx 13.5km.\nNote: Road 1 and its tributaries may be active logging roads for portions of the summer and fall logging seasons.",
    "directions": "Turn onto Camp 2 Rd just after the Clearwater bridge as you are driving into the business centre of Clearwater (where the banks, grocery and liquor stores are).  You will likely see kayak and other paddler's vehicles parked here.\nFollow Camp 2 Rd for 740m and turn right onto the Clearwater River Road.  Travel on the Clearwater River Road 1.2km to just past the rough airport strip and take the first left (or park here).  The trail connects to this road on the right about 300m up.  The trailhead is currently not sign posted.\nThe upper trailhead is reached by going past the lower trail head, keeping right on the road (becoming FSR 1A at 0.5km).  2.5km from the lower trailhead, turn right onto an old spur road and follow this road to its end (approx 2.0km).  The trail joins this road just before the landing at the end.  The upper portion of the trail continues from here but becomes extremely steep and rough.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/5983/narrow_Lower-Gates-Cr-Trail-21577.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/gates-creek-near-clearwater-bc-5983",
    "stats": {
        "Activities": "hike mtn-bike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "8 km",
        "Town": "Clearwater, BC",
        "Type": "out-and-back"
    },
    "title": "Gates Creek",
    "trail_id": "5983"
}