{
    "description": "This trail can be done in one of two options.  \r\nThe first bit of the trail is all hike/bike as you portage your bike onto the top of Moab rim.  That is where the riding starts.  I think you have to gain about 600 or so feet of elevation  (20min +-).\r\nOnce on the top, the trail is self explanatory.  Its abit of single track, double and rock all combined into the entire ride.  Once at the end, you descend towards the Columbia River.  \r\nThere are petroglyphs on the way.  Check out the GPS data.  Zoom into the trail and where it goes off to the right is where the petroglyphs are.  Just hike up towards that trailhead for about 5min and you'll see it on the rocks.\r\nThe ride can be done in either direction, but the portaging cannot be avoided unless you do the out and back option!\r",
    "directions": "\r\nSouth of Town to North.  It generally is done as a loop from the Town of Moab.  Start on Hwy 191 heading south and ride from town approx 6.5 km to Angel Rock Road.  Go West on Angel Rock road until it T's to Rimrock Rd.  Go N. on this road until it ends which will basically take you to the start of the trail.  \r\nAccommodations:\r\n\r\n A lot of people in the MOAB area stay at condos managed by www.moabutahlodging.com, speak with Andrea. They offer a range of in town homes to budget and upscale condos.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/UT/5996/reg_DSC-8464-1-2928.jpg",
        "https://trailpeak.com/storage//content/trails/US/UT/5996/reg_moab-rim-2-2928.jpg",
        "https://trailpeak.com/storage//content/trails/US/UT/5996/reg_moab-rim-2928.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/moab-rim-near-moab-ut-5996",
    "stats": {
        "Activities": "mtn-bike",
        "From": "",
        "Seasons": "spring",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "30 km",
        "Town": "Moab, UT",
        "Type": "out-and-back"
    },
    "title": "Moab Rim",
    "trail_id": "5996"
}