{
    "description": "NTS Map: 092G02\nHave you seen the shed lately? The Delta Watershed is a great area for Vancouver area mountain bikers to build skills but it also has some great log and ladder ride areas in it's own right, and an awesome chute down to the main trail-way full of lifts and berms.  Fairly flat, but, lots of nuggets in there, a great place to work on skills.  With places like the Gravity Bowl, and, some new giant ladders and drops onto trannies, you should have a new look at the Watershed.  In one area, a triple teeter-totter followed by a long ladder ride.  Gap jumps here and there.\nWhile you are out there, fill your water bottles at the Artesian well, with water as pure as that stuff from the French Alps.\nThe Delta Watershed area is self-contained; you are not likely to get lost.  In one of the pics here you see a Scouts camp which is ideal to practice manuals and drops.  From there, head up and around to some almost hidden nuggets of logs and ladders.  One of the photos here are of local trail-builders Mike and Dave. While they are not yet as formal as NSMBA, they are a dedicated group, and, if you ride there often, you will meet them, ask what you can do to help.  While much of the watershed has been gravelled over, these are just the main trails, you need to look for the good log rides, of which there are many.\nTo get to the area from Vancouver, take Highway 99 South to Highway 10, following for a short distance until you cross 91 and start climbing a small hill, park anywhere around there, and take the main long and narrow trail (gravel road) in, then climb up to the trails.  You'll find a meadow area with a map to look at, we'll post that next. Lots to explore.",
    "directions": "See description and / or GPS",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/6/reg_Kurt.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6/reg_MikeDave.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6/reg_map.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6/reg_topoDelta1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6/topo_ramp.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/delta-watershed-near-delta-bc-6",
    "stats": {
        "Activities": "mtn-bike hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "13 km",
        "Town": "Delta, BC",
        "Type": "out-and-back"
    },
    "title": "Delta Watershed",
    "trail_id": "6"
}