{
    "description": "This is a long haul for a 2 day hike, 3 days would be more enjoyable. Start at the Parking lot on the North end of the park, The trailhead is just north of the lot. The loops is comprised of several trails, you start first couple of km on the Wild Horse Canyon trail, then you come to your first intersection, take a left onto the Old CN Trail, this will connect to the Divide Lake Trail which is a steady 3 or 4 hour hike up to approx 5000f where you will find Divide lake. (Contrary to BC Parks website the cabin at the top is in great shape and there is a outhouse available as well. Just past divide lake on the trail is the trailhead for Baker Lake Trail. Take this trail West until you reach the Marker for Baker Lake and the next segment, the Frederick Creek Trail. This segment doesn't decent very quick but is very rough, since the fire it has been remarked but the actual trail is basically non existant, watch your footing their is a ton of loose rock. \r\rAbout half way down this trail you will reach the turnoff for the Wild Horse Canyon Trail, follow this west towards Goods Creek. This is a great place to camp for the night as you should be about 8-10 hours into your hike by now. It's a left off the main trail and down to the lakeside campsite. \r\rTo return to the North parking lot you simply retrace your steps up the hill again to the Wild Horse Canyon Trail and continue on, this trail is much easier and is a great way to finish this big hike. If you follow the \"atv\" wide trail right to the end it will get you to a park gate about 1km down the road from the parking lot, from there simply walk on the shoulder back to your car/ride. If you choose you can follow the Good's Basin Trail and it will connect back up to the Wild Horse Canyon Trail and bring you back to the very first split you came to (The CN trail).\r\r",
    "directions": "Coming East from Westbank: Take hwy 97 over the bridge, turn right (South) onto Pandosy Street, and continue till you get to Lakeshore dr, take a right. Follow lakeshore past Rimrock until you get to a small gravel parking lot on the right side.",
    "geohash": "c2f",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/6000/long_IMG-3424-21791.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6000/reg_DSCN3115-6465.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6000/reg_DSCN3128-6465.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6000/reg_DSCN3133-6465.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6000/reg_IMG-3365-21791.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6000/reg_IMG-3378-21791.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6000/reg_IMG-3393-21791.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6000/reg_IMG-3419-21791.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6000/narrow_IMG-3377-21791.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6000/narrow_IMG-3410-21791.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6000/narrow_IMG-3431-21791.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6000/narrow_IMG-3437-21791.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/okanagan-mountain-loop-near-kelowna-bc-6000",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer spring",
        "Stars": 4,
        "Time": "14 hrs",
        "Total Distance": "44 km",
        "Town": "Kelowna, BC",
        "Type": "out-and-back"
    },
    "title": "Okanagan Mountain Loop",
    "trail_id": "6000"
}