{
    "description": "The trailhead is at 1130m and climbs 725m over 5.5km to the summit at 1855m (11km is return length).  This is a bronze peak in the \"Passport to the Peaks\" program.\nFrom the trailhead, follow a wide trail for about 300m to the creek between Victor Lake and Grande Cache Lake.  Turn right and follow the creek to the Southwest.  About 500m further there is a bridge across the creek.  After another short section, the trail forks.  The main Cowlick Creek trail stays to the right, and the trail to the Mt. Louie summit goes to the left.  Both this junction and the bridge are clearly marked by blue signs.\nFrom this point the trail begins to gain elevation.  It stays in the forest for most of the way, but opens up on ridges several times for nice views of Grande Cache, Victor Lake, Lightning Ridge and the upper Smoky River valley.  The trail is obvious most of the way to the summit, and a combination of red plastic squares and flagging tape is used as markers.  After enjoying the view from the summit, return following the same trail.",
    "directions": "From the town of Grande Cache, take Hwy 40 South for 3.5km.  Turn into the Cowlick Creek staging area on the right (South) side of the highway, just before reaching the DFI yard on the opposite side.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/6002/reg_IMG-2849-11604.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6002/reg_IMG-2850-11604.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6002/reg_IMG-2855-11604.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6002/reg_IMG-2859-11604.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6002/reg_Louie-Elevation-11604.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mt-louie-near-grande-cache-ab-6002",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 4,
        "Time": "5 hrs",
        "Total Distance": "11 km",
        "Town": "Grande Cache, AB",
        "Type": "out-and-back"
    },
    "title": "Mt. Louie",
    "trail_id": "6002"
}