{
    "description": "The Old Annapolis Hiking Trail has got to be one of my all-time favourites. Well, ok, perhaps I?m somewhat biased because it is very close to home but  it?s still a great place to explore if you are limited for time or you have little ones to tote along. The Island Lake Loop isn?t the most challenging of hikes but for its variety of sights and well-cared for trail system, it?s worth a visit.\n \nThere is a parking lot at the beginning of the trail system and here you will also find a kiosk with a trail map and possibly a guest book to sign. There is also a pit toilet and garbage bin nearby. Forestry giant, Bowater Abitibi, owns and maintains the trail - presumably as a piece offering for all the logging they do in the area ? albeit controlled logging. In any event, from the parking lot, follow the trail signs to start your hike.\n \nThe Island Lake Loop trail skirts around Reese Lake while brushing the edges of Island Lake and travels through a mixed forest of white birch, fir, spruce, pine, juniper and maple trees. You get lots of lake views especially when crossing the variety of boardwalks. Besides a variety of wildlife in the area (we?ve seen deer, a variety of birds, raccoons, porcupine and traces of coyote as well as frogs and snakes) the trail also offers some interesting history. Near the beginning of the Island Lake loop trail you will cross a small river that empties into Reese Lake. It is here you can see remnants of an old dam from years gone by when the lakes and rivers in the area were used extensively to transport logs. There is also a clearing mid-way around the trail which marks the spot of an old logging camp. If you look hard enough, you can find pieces of the old woodstove scattered in the field.  There is one area where some trees were recently cut down so I?m not sure what the plan is for that area. If you are interested in Geocaching at all, there is one cache that can be found on this loop as well (placed by yours truly).\n \nBesides the Island Lake loop there is also another looped trail across the road from the parking lot. This trail leads you down to Rafter Lake but personally, I don?t find that one as interesting. If time is on your side, however, I would do the Island Lake loop first and then carry on to the Rafter Lake loop. Each loop is about 4 kms in length and each has a few branch off trails.\n \nSo if you happen to be in the Halifax area and are looking for an easy but refreshing hike, check out The Old Annapolis Hiking Trail.",
    "directions": "From Halifax, take Hwy 103 towards Yarmouth. Just past Exit #5 in Tantallon, you will take a right onto a gravel road (the road is just after the water towers and the locals call it the Mersey Road). The coordinates for the beginning of the gravel road are N44 42.66, W063 54.01. You will drive about 10 minutes (stay to the left) before coming to the beginning of the trail (Old Annapolis Hiking Trail). The coordinates for the trail parking lot are N44 45.14, W063 56.02. \nNOTE: The road into the Old Annapolis Hiking Trail is closed for much of winter and during times of a high forest fire index or periods of high logging activity.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/6012/reg_reeselake-22378.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6012/reg_untitled-22378.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6012/narrow_boardwalk-22378.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6012/narrow_geocache-22378.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6012/narrow_islandlake-22378.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6012/narrow_river-22378.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/old-annapolis-hiking-trail-island-lake-loop-near-halifax-ns-6012",
    "stats": {
        "Activities": "snowshoe hike mtn-bike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "4 km",
        "Town": "Halifax, NS",
        "Type": "out-and-back"
    },
    "title": "Old Annapolis Hiking Trail - Island Lake Loop",
    "trail_id": "6012"
}