{
    "description": "Kejimkujik National Park is one of my regular hiking destinations. The Channel Lake Loop makes a challenging day hike or a moderate over-night backpacking trip. There are several backcountry sites to choose from (complete with at least two tent pads, picnic table, fire pit and wood) but it is recommended you make reservations in advance. You probably don?t want to attempt the whole loop in early spring because you have one water crossing which is Still Brook. Still Brook isn?t so still this time of year and becomes quite flooded due to spring runoff. We learned this firsthand in April/09 when the brook turned into a raging river and was several feet higher than it was when we hiked it last October. You can, of course, opt to hike to Campsite #5 (which happens to be our favourite site) and is located just before Still Brook ? then hike back out.\nThe Channel Lake Loop begins at the Big Dam Parking Lot (usually open from mid-April to mid-October ? otherwise you will have to add another 6kms round-trip to your hike from the main road). Heading counter-clockwise, the first quarter of the trail takes you through a mature pine forest and skirts the edge of Big Dam Lake. It then crosses over the Thomas Meadow Brook bridge (my favourite rest stop) before heading away from the lake and further into the forest. This stretch takes you through a mixed forest with only three or four boardwalk stream crossings but the path is nice and wide. You finally emerge from the woods to the end of Frozen Ocean Lake. It is here you come to an intersection and will turn left (going straight will take you around the much longer Liberty Lake Loop which is a multi-day 60km trail). After turning left, another 2km hike will take you over a marshy area on a long boardwalk and another mature pine forest before you finally arrive at Campsite #5 (the approx. half way mark). It?s the perfect place to set up camp. Just past Campsite #5 is the one and only stream crossing to fiord (Still Brook as mentioned above) and is easiest to do in mid-summer to mid-fall when water levels are low. However, crossing the brook is tricky at the best of times so be prepared to get your feet wet just in case. If you do make the crossing, Campsite #6 is also very nice to stay the night.\nThe second half of the Channel Lake Loop is not as interesting as the first half. After Campsite #6, the trail gets much narrower and if its fall time, you may find your feet in a constantly fight with the dying fern plants that seem to wrap around your ankles and trip up your step. For me, this was very frustrating and tiring. I felt for a trail of this calibre (ie, in a National Park) it should have a better cleared and maintained pathway... but whose complaining? Finally, you find yourself at the last intersection (taking a right will bring you to Site #17 at Channel Lake which is also a nice campsite). Take a left here to bring you back to Big Dam Parking Lot. Again, the sights are not too interesting as you have limited views and no waterways ? but at least the finish line is close at hand and there are songbirds to urge you along.\nWhat I like best about Keji is the remoteness you feel when you are in the backcountry. Literally, you are in the centre of the province with no civilization for miles. My most favourite backpacking memory comes from Keji as well. If you can imagine the most calm and clear night in fall where billions of stars were reflecting off the dark, still lake. We sat at the water?s edge admiring the view and could hear the hooting of owls and the cry of loons in the distance ? it was the most amazing thing. I always keep my guard up however, because Keji is also bear country and you must be conscious of the risks, especially when it comes to keeping your food safe. There are now pulley systems installed at each of the backcountry sites so you can hang your pack high into the trees and away from your campsite.\nFor the most part, all trails in Kejimkujik National Park are well maintained and not difficult to hike as there are no steep hills to climb and in most places you can hike side-by-side with your partner. Several boardwalks are located along the trails to keep you from getting wet but they can get slippery ? so proceed with caution. For me, Keji?s trademark is the ancient pine trees that are scattered throughout the park and the Channel Lake Loop is no exception. Of course, numerous lakes and waterways are also what makes Keji special along with its cultural significance in Mi?kmag history (you can see petroglyphs here). Of course, keep your camera ready for elusive wildlife as you never know if you?ll be the one capture evidence of the Eastern Cougar... even though it?s more likely to be a squirrel you hear in the bushes.\nAll in all, the Channel Lake Loop makes a relaxing but moderate weekend adventure where you will be impressed with its centuries old pine trees, variety of lakes, history and remote wilderness setting.\nNOTE: Be sure to check in at the Information Centre in Keji before heading to the backcountry. Also bring lots of fly repellent as the flies and ticks can be vicious certain times of the year. While checking in, be sure to purchase the very informative and detailed Backcountry Guide of the park. More info can be found at http://www.pc.gc.ca/pn-np/ns/kejimkujik/index_e.asp.",
    "directions": "Kejimkujik National Park is located in the centre of Mainland Nova Scotia. From Halifax, take Hwy. 103 South to Exit 13. Turn right at top of ramp. This is Rte. 325. Take Rte. 325 to Rte. 208. Turn left at Rte. 208. Take Rte. 208 until you come to Hwy 8. Turn right onto Hwy. 8. Drive about 20kms and the entrance to Keji will be on your left.",
    "geohash": "dxcs",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/6015/reg_IMG-1616-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6015/reg_bridge-22378.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6015/reg_brook2-22378.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6015/reg_deer-22378.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6015/reg_frozen3-22378.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6015/reg_karen-22378.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6015/reg_site46-22378.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6015/IMG_1616.JPG",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6015/narrow_brook-22378.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6015/narrow_frozen1untitled-22378.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6015/narrow_frozen2-22378.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6015/narrow_tent-22378.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/channel-lake-loop-kejimkujik-national-park-near-bridgewater-ns-6015",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 4,
        "Time": "8 hrs",
        "Total Distance": "24 km",
        "Town": "Bridgewater, NS",
        "Type": "out-and-back"
    },
    "title": "Channel Lake Loop - Kejimkujik National Park",
    "trail_id": "6015"
}