{
    "description": "If you are into caves at all, this is a must-see. Etched into the side of a steep cliff that is pounded incessantly by the Atlantic Ocean, the Fairy Hole starts out as a wide cavern then funnels down to nothing but tiny crawl spaces. I?ve been going to the Fairy Hole in Cape Dauphin since I was a little girl. We had a cottage nearby and it was a place we took all our visiting friends and family ? if they dared to explore it.\r\rYou might have guessed that the Fairy Hole comes shrouded with many historical and mythical stories. The one I was told as a kid from locals is about a dog that entered the cave then disappeared. It is said that the dog was found sometime later on the other side of the mountain near Englishtown with no fur on its body. Another story which I learned later in life comes from Mi?kmaq legend where it is said that Glooscap (a Mi?kmaq hero) used to live in this area and the cave was his domain. One day while out in his canoe, he was teased by two woman on shore and became very mad at them. Glooscap jumped in his canoe breaking it instantly into two pieces. These two pieces are said to be the bird islands which you can see off to the right from the shore (the famous puffins reside there). In his rage, Glooscap then turned the women to stone and they are said to be two stone pillars that now guard the cave. Also, in the 1700?s, the French considered Cape Dauphin as their fortress site but instead choose Louisburg. This is how Cape ?Dauphin? derived its name.\r\rBut if those stories don?t hook you, the allure of the Fairy Hole itself surely will. But beware; entering the cave should not be attempted by the faint of heart. In fact, I?m surprised there have been no casualties as of yet because getting in and out of the cave can be quite treacherous. I?m amazed that as a kid I was so daring and did it anyway. If my parents only knew!\r\rThe trail into the Fairy Hole is located at the end of a long dirt road. It is a well-marked wooded trail that is not regularly maintained so you may have to get around some fallen trees. The pathway has some mild ups and downs until you get near the end. You can also get some ocean views as you hike along if you take a few of the branch off paths. In total, the trail is a mere 6km return trip. But don?t let the short distance fool you. Even though much of the hiking is easy, once you get to the gorge near the end things become a little (ok, a lot) more difficult. \r\rThere are a few ways to get down into the gorge. If you?re a good rock climber, you might take the fast way down and scale over the steep bank. If not, there is a path (albeit a steep path) that will take you to the bottom where you will reach a brook. Once at the brook, you hang a right and follow it down to the ocean. There is no set trail here - just a lot of manoeuvring over the slippery boulders and a good chance of getting wet. Finally, you have one last steep climb over a bank and on the other side you will be rewarded with quite a view - a cobble stone beach surrounded by huge cliffs with the Atlantic Ocean directly in front of you and Cape Smokey off in the distance. The Fairy Hole is just around the corner from here... but you might want to take a breather and plan your entrance with some strategy.\r\rFirst of all, there are usually some ropes that are haphazardly tied to various trees and roots on the cliffs which many people use to get into the cave. Personally, I opt to swim around (yes, this is as cold as the Atlantic Ocean can get in Nova Scotia) but come on, you can do it. Besides it?s much safer to do it that way than relying on goodness-knows-how-old-ropes tied to goodness-knows-how-sturdy-trees. But even if you swim it?s tricky to get yourself up on the rocks. A lot depends on the tide too. Obviously with a low tide, it is easier and you can almost walk around. Once you swim around the corner and get up on the rocks (or dare to use the ropes), you?ll see the cave. But wait, there?s more! In order to get into the cave, you are likely going to have to swim again because there is a huge lagoon-like pool of water in front of it. But the pool of water is actually pretty cool because it is protected from the ocean and you can do some mean cannon-balls in there. Once you get yourself across that pool of water and scramble up the edge, you?ll be in the mouth of the cave.\r\rThe last time I was there, I did not venture too far in but I did allow my kids to go in a short distance (with the help of their experienced uncle). Several years ago, however, when I was probably too young to do so, I went inside ? deep inside. In fact, I got so far in that I was pulling myself along with my elbows where the cave narrows down so far it becomes impassable ? but still continues on. Honestly, I think I went in as far as one could go but I distinctly remember wondering if that dog-with-no-hair-story were actually true. Just because I couldn?t go any further didn?t mean a dog couldn?t, right? That?s the beauty of local folklore ? sometimes you are just kept wondering. I know that some geologists were in the cave some years back and did some measurements. I also know that geologists are particularly interested in this area because the rocks are said to be some of the oldest in the world if you can imagine that!\r\rI should apologize somewhat for the quality of the photos here. The last time I was in, I did not take my camera so these were taken a few years ago with my small 35mm and were scanned in. I intend on getting back there very soon to get some better shots.\r \rThe Fairy Hole is definitely off the beaten path but if you?re up for some tricky cave exploring, I don?t think you?ll be disappointed.\r\rNOTE: As noted above, the Fairy Hole is a risky endeavour but it hasn?t stopped people from exploring it for years ? nor has it stopped me. I just want to make it clear that this is not the safest thing to try and I?m in no way encouraging you to do it ? I just know that many of you will do it anyway. And if you do plan on going into the cave, don?t forget your headlamp and tell someone where you are headed!\r",
    "directions": "From Sydney, take Route 125 to the Trans-Canada Highway (Hwy. 104). Continue until you cross the Seal Island Bridge. Once you cross the bridge you will be at the base of Kelly?s Mountain. Mid-way up the mountain, there is a sharp hair-pin curve with a gravel road that turns right in the middle of it. This is Newcampbellton Rd. You will drive on Newcampbellton Rd. to the end which is approximately 18km (this is Cape Dauphin). Park on the side of the road and the trail entrance is clearly visible to the lef.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/6019/reg_IMG-0001-22378.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6019/reg_IMG-0002-22378.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6019/reg_IMG-0003-22378.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6019/reg_IMG-0004-22378.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/fairy-hole-hiking-trail-cape-dauphin-near-baddeck-ns-6019",
    "stats": {
        "Activities": "hike snowshoe climb",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "6 km",
        "Town": "Baddeck, NS",
        "Type": "out-and-back"
    },
    "title": "Fairy Hole Hiking Trail - Cape Dauphin",
    "trail_id": "6019"
}