{
    "description": "DO NOT DO THIS TRAIL if you do not know EXACTLY what you are doing on a *DOWN HILL* MTB.  It is full of death-defying, aerial stunts, very hard trees, rocks and bears.  Probably bears with fricking laser beams on their heads.  You want armor, inches and inches of travel (on both the front and back) oversize hydraulic discs, wide sticky tires.  There are paths around virtually every stunt, but that just means you will probably get landed upon by some guy doing Mach .9 who does know what he is doing.\nSo, Race Of Spades is a serious downhill course with very technical stunts and terrain.  Even the non-stunt areas can kill you as there are several areas of loose, cobbley rock.  Many people will shuttle it, especially if they have a 48 pound DH special, but you can get to it by riding or driving up Moose Mountain Road, or riding from Station Flats parking lot and ride Pneuma, Pneuma/Sulphur Springs, etc.\nVery steep but rideable.  The path is real singletrack for the whole length, very tight & twisty.  Great technical riding.  You will bleed.",
    "directions": "To ride to it, drive to Station Flats parking lot.  11km West of the Hiway 22/66 Tee intersection just South of Bragg Creek.  Follow the lower 1/2 of Sulphur Springs to the Pneuma (see other trailpeak entry) connection and go North up Pneuma.  Pneuma will eventually kick you out onto Moose Mountain road and you have to ride 500m up the road.  Watch for the trail on the right (East) side of road where it will parallel the road for 10m before diving down into the trees.\nTo shuttle it, drive 13.9km West of the Hiway 22/66 Tee intersection just South of Bragg Creek and turn North on Moose Mountain Road.  Drive 6.0km North on the road",
    "geohash": "c3n3",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/6026/reg_CAROL-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6026/reg_CAROL1-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6026/reg_CAROL2-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6026/reg_CAROL3-6828.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/race-of-spades-ros-near-calgary-ab-6026",
    "stats": {
        "Activities": "mtn-bike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "5 km",
        "Town": "Calgary, AB",
        "Type": "out-and-back"
    },
    "title": "Race Of Spades ( ROS )",
    "trail_id": "6026"
}