{
    "description": "Hey, exclusively to trailpeak.com readers, a new trail outta Station Flats (Bragg Creek).  The oddly named Pneuma is a great alternative to grinding up Moose Mountain Road if you are doing the Race Of Spades or Moose Packers for example.  Newly routed through the Alberta wilderness, a great line was choosen and hand laid by the hard working people of the Moose Mountain Bike Trail Society[www.MMBTS.com].\nYou will gain 216m in just over 4km and what a great ride it is.  Everything is very rideable, switchbacks are all nicely radiused.  Make no mistake, it's a bit of a grunt, it took nearly an  hour to ride up it.  About 1/2 way up as you enter a clearing below a small oil facility and fantastic vista opens up across the Elbow Valley.  Occasionally you will see the stunts of Race Of Spades down the hill to your right (East).\nFrom the beginning *of Pneuma* you ride up a trail and intersect with a pipeline right-of-way. HERE's the TRICKY part.  Turn right-ish and ride across and down the ROW and look for the trail to continue off to your left (North side) in about 75 meters.  Other than this, it's pretty self explanatory.\nAs you ride, consider the Karma points you will earn spending a couple weekends helping out MMBTS or CMBA (www.cmbalink.net) build some new trails.",
    "directions": "To ride to it, drive to Station Flats parking lot.  11km West of the Hiway 22/66 Tee intersection just South of Bragg Creek.  \nThe trail itself isn't signed right now so to get to it, ride Sulphur Springs lower path from Station Flats about 5.5km.  Just after a large pipeline Right-Of-Way you pass through, you will see a path going up to the right.  Take it.  Love it.  If you get to MM road, you've gone too far, turn around and go back 200m.",
    "photos": [],
    "source_url": "https://trailpeak.com/trails/pneuma-near-calgary-ab-6027",
    "stats": {
        "Activities": "mtn-bike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "4 km",
        "Town": "Calgary, AB",
        "Type": "out-and-back"
    },
    "title": "Pneuma",
    "trail_id": "6027"
}