{
    "description": "A loop over Mt. Horne behind Cathedral Grove, using the less-travelled ACC route up the South side and the traditional route down the Southeast.  (Clockwise recommended as the ACC is hard to find from the summit).  Steep ascents and descents, broken up by short bits on the tracks and logging roads, with rewarding views of Arrowsmith / Cokely, Cameron Lake and Alberni Valley.Park at end of Chalet road West of main Cathedral Grove parking area, and follow the road as far as the second lake cabin.  The trail is currently marked by a \"to Horne Lake\" sign and some flagging.  Head straight up to tracks and turn left.  Go West about 1.5 km. looking for orange flagging about 25 metres before a railroad signal (two black dots).  Trail is fairly well flagged and straightforward, going up through nice open forest.  You'll eventually arrive at a power line cut; GPS route follows old trail on other side as far as a clear-cut.   Follow the upper section of logging road about .5 km to the right-angle corner closest to the summit and go straight ahead (pink flag amongst the orange \"falling boundary\" flags.)  Flagging starts out OK but eventually seems to peter out near a pond a bit short of the summit - from here its a matter of bushwacking and heading up 'til there's no more \"up\" available.Sign the register, take some pics and head down the well-flagged (mostly) route on the Arrowsmith side.  Once on the logging road head down about 1.5 km, watching for flagging just before clear-cut where the road continues toward Horne Lake.  Follow the trail down to the saddle between Mt. Wesley and Mt. Horne, then pretty much straight down to the tracks.  Turn right and follow tracks about 300 metres to the trail down to Cameron Lake.",
    "directions": "From highway 19 or 19A, follow highway 4 towards Port Alberni.  Cathedral Grove Provincial Park is beyond West end of Cameron Lake.  Park on North side of highway at gated entrance to Chalet Road, just West of main Cathedral Grove parking.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/6031/reg_100-3596-0.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6031/reg_100-3604-0.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6031/reg_100-3608-0.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6031/reg_100-3609-0_best1_.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mt-horne-loop-near-port-alberni-bc-6031",
    "stats": {
        "Activities": "snowshoe hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "5 hrs",
        "Total Distance": "8 km",
        "Town": "Port Alberni, BC",
        "Type": "out-and-back"
    },
    "title": "Mt. Horne Loop",
    "trail_id": "6031"
}