{
    "description": "Tom Snow - North section is a fairly serious trail as it is a 17km each way in-n-out.  It is mostly all single-track, prone to be boggy in the middle 1/3, but is not highly used and provides a true back-country experience.  You see barely nothing man made for the whole trail\nTSN as I am affectionately calling it runs between the SpruceWood parking lot / picnic area (just off the South demonstration forest loop on Hiway 68 / Sibbald Trail and West Bragg Trailhead (though Bragg Creek, cross the bridge, and go West till the end).  If you're coordinated you could set up a shuttle if needed and/or tie it in with Sibbald Flats Trail to Dawson Recreation area or other West Bragg Trails such as Tom Snow South to Station Flats.\nThere are a number of Tees and turns that can trip you up, I'd suggest printing off a copy of the map or loading it into your GPS would be a good idea.\nFrom West Bragg you start out down the closed road, through the gate, across the bridge but as you just start climbing up the road to get to the Tom Snow SOUTH access, watch for the Moose Loop sign on your right (North).  Take Moose Loop around to roughly it's most NorthWesterly point and look for a trail to start going straight North.  From here on it is pretty straightforward.  When you get to SpruceWoods area there are a number of twists & turns that you can explore.  Just remember you have to enter/leave by the narrow and short little 3 plank bridge and straight up the hill to the South of it\nIt was a fun ride, real quiet, technical but with many wet spots, creek crossings, and a couple bogs.  After a late spring rain / snow fall, the middle section was seriously getting on my nerves, but the N and S ends and the sweet, zippy singletrack made up for it.  Do it on a warm, ideally dry day and the crossings, virtually all of which can be easily ridden, will be welcomed.\nNorth Trailhead:  Head west of Calgary on Hiway 1 to the well marked Hiway 68 (Sibbald Creek Trail) exit (about 17.5km past hiway 22 overpass) and AFTER the Jumpingpound Road. It is 21km West of the Calgary Olympic Park intersection. Take the exit, go under the highway for about 18km to the South Demonstration Forest Loop.  Follow this road to SpruceWoods Recreation Area.\nSouth Trailhead:  Take Hiway 22 (or hiway 8 from Calgary west) to Bragg Creek. Cross the only bridge and turn left at the T. Follow that all the way out (9km) to the Provincial Recreation area (road turns into gravel at rec area gates). Follow the gravel to the parking lot at the end. Trail starts by going down the road past the gates at the trailhead.",
    "directions": "See description and / or GPS",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/6032/reg_IMG-2902-[800x600]-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6032/reg_IMG-2915Org-[800x600]-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6032/reg_IMG-2918-[800x600]-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6032/reg_IMG-2923-[800x600]-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6032/reg_IMG-2934-[800x600]-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6032/reg_IMG-2935-[800x600]-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6032/reg_IMG-2941-[800x600]-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6032/reg_IMG-2980-[800x600]-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6032/reg_IMG-2985-[800x600]-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6032/narrow_IMG-2914-[800x600]-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6032/narrow_IMG-2978-[800x600]-6828.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/tom-snow-north-12-near-calgary-ab-6032",
    "stats": {
        "Activities": "snowshoe hike ski-xc mtn-bike",
        "From": "",
        "Seasons": "winter fall summer",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "17 km",
        "Town": "Calgary, AB",
        "Type": "out-and-back"
    },
    "title": "Tom Snow - North 1/2",
    "trail_id": "6032"
}