{
    "description": "A blue diamond single track involving climbs and descents, with several possible loop or shuttle options. Bears are a probability - make noise.\rThe path begins on an old mining road (locals call it Mining School, the trail is signed Kootenay Columbia... heretofore referred to as KC) where a confusing map can be found at the trailhead. Almost immediately, the road splits, one heads left and down (where Greendoor loop option will spit you out) the other is the one to stay on. The road climbs gently for about 10 minutes, then splits again. Straight on is KC road, where a short loop option may bring you out, but continue uphill to the left along 'Back of KC'. \rIn a few minutes you'll pass a gate covering an old mine entrance, then the road becomes less steep and you're almost at the plateau. Once you level off into an opening, the trail splits again, cutting back up and away into the slope, or meandering to the right toward the forest. A signpost will tell you that Milky Way is to the right. \rFrom here, you drop. A forested single track switchbacks its way down packed dirt and a few roots, but is a very easy blue. Near the end of the forest there is a decrepit cabin on the right, and a few optional tricks. One is a ramp up onto a down skinny, the other is a looooong skinny formed out of an old log - just try to stay on the whole way! After this is a fast and flowy blast through open meadows (watch for mud in the spring) which will pop you out onto KC road. \rHad enough? Turn your wheel to the right and head back to the parking lot, or continue to lower Milky Way by heading left. Less than 100m along, just after a watering hole on the left, the trail (signed) continues its drop, back in forest again. \rThis section is a solid blue with some steep rock faces, tight switchbacks and jumps (with ride-arounds). After a particularly steep rock face, keep an eye out for a trail split. The upper spur leads to an interesting rock spine that makes for a unique challenge. \rAfter that, the trail mellows into a faster, smoother single track, again through partial meadows, until it joins with another trail, Green Door. \rThis is the last place to loop back to Rossland without crossing the highway -the Green Door trail can be ridden back uphill (right) to the original junction - it's a steady climb, but not technical.\rOR, for more downhill action, stay left and ride out the remains of Green Door to the highway. A shuttle vehicle could be parked here, or, better, down in the village of Warfield. \rTo continue, cross the highway and head back onto the trail affectionately known as 'meadows'. This is green track that follows a curvy, rolling rut through open grasslands, for a fast, 'yippee!' kind of ride. \rThis ends far too quickly at a rocky dirt path called the Wagon Road. If you've left a car in Warfield, head left for a gentle downhill roll back into town (watch for strolling families). If not, enjoy the long, unexciting, but at least partially-shaded grunt 7km back up to Rossland.",
    "directions": "From Columbia Avenue (Main Street) take St. Paul uphill to 4th avenue, hang a left. Follow 4th to its end at a y intersection, hang a left. Immediately take the next two rights, keeping Happy Valley just at the edge of your passenger side tires (feel free to envy the bastards who live in its rolling expanse).\rOnce the road straightens out, keep an eye on your left for a pull-out where vehicles are expected to park (a tiny, tiny sign reads: gate ahead, park here). It's about 100m to the gate, and another 50 to the trail map beyond. \rMaps and directions available at Revolution Cycle on Main St.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/6035/long_mway-ramp-1287.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6035/reg_DSC-0002-1287.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6035/reg_mway-cabin-1287.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6035/reg_mway-meadows-1287.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6035/narrow_DSCN3205-6465.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6035/narrow_mway-skinny-1287.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/milky-way-near-rossland-bc-6035",
    "stats": {
        "Activities": "mtn-bike",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "6 km",
        "Town": "Rossland, BC",
        "Type": "out-and-back"
    },
    "title": "Milky Way",
    "trail_id": "6035"
}