{
    "description": "Designated a 'green run', this trail has enough tricky segments to warrant a 'blue on the easy side' rating. Taking you from the heights of Rossland, to the village of Warfield, the trail mixes packed dirt single track, forest, meadows and chunky rock-roads through scenic country.\r\rFrom the trail map, take the first fork to the right and slightly down. On your left you will see a large foundation that was once the mining school for LeRoi mine - just passed this you can access other trails such as Cemetery and Spring Cleaning. Now, however, you stay straight on the road and follow its gentle slope downward.\rSoon you will arrive at a signed junction, Green Door is to the right. The trail begins to drop immediately through sparse meadows, switching back the to the direction you'd just come from. It then follows a wide, long switchback heading north again - here the single track is fairly smooth, winding amongst skinny alders and cottonwoods. Between the grass, moss, leaves and bushes - the zillion shades of green leave little doubt as to the naming of the trail.\rEventually you'll pop out into a proper meadow, where the grade plateaus somewhat. Enjoy the open air while you can, because you immediately plunge back into forest, where there is a creek and the route can be mucky. There is a wide, solid bridge to cross over the river, and then the trail meets up with the bottom of Milky Way (don't climb this, it's nice at the start, but the upper portion will be a long push n' walk).\rAfter a touch more meadow magic, the track turns into a bit of a loose rock path that might be tricky to navigate, until you are spit onto a road just above the highway.\rA possible shuttle could have been left here, or you can continue on to Warfield or back to Rossland via the Wagon Road. To do this, cross the highway and enjoy a brief, but immensely entertaining zinger through open grasslands, before meeting up with the well-travelled Wagon Road. The route heads all the way back up to Rossland (right) - a steady but managable 7km slog, or down (left) to Warfield via the old Rail Grade. Warfield is a perfect place to leave a shuttle, or you can ride the extra 3 km (all down) to Trail.",
    "directions": "See Milky Way or KC ridge.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/6036/reg_green-door-rock-1287.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6036/narrow_grn-door-field-1287.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6036/narrow_grn-door-woods-1287.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6036/narrow_scenic-singletrack-1287.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/green-door-near-rossland-bc-6036",
    "stats": {
        "Activities": "mtn-bike",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "6 km",
        "Town": "Rossland, BC",
        "Type": "out-and-back"
    },
    "title": "Green Door",
    "trail_id": "6036"
}