{
    "description": "While circling Silent Lake, you pass through different types of forest, see colourful rock cuts and panoramic views. You can also access this trail by canoe at several points.Varied terrain good workout, several scenic rocky outcrops and points with views of Silent lake. Also cross country ski trails and mountain bike trails at park.Park at north end of Silent lake at the day use beach. Trail maps are available at park office.  Trail is well marked we went in a clockwise direction. First half of trail follows the lake shore closely, good scenery and lots of lake views. A boardwalk crosses a low marshy area at the end of the lake there is a fork here, the left will take you to a lookout over Quiet lake a nice place for a break. To the right is slightly shorter stays near the lake. This half of the trail is more hardwood forest with some hills. There is another good spot for a break at about the 12k mark. Here you will find a wooden bench overlooking the lake beside a small stream. This is also a good place to stop when canoeing. Silent lake is also a good place for canoeing and fishing, no motorized boats allowed.  There is a very steep hill at 14k where a stream exits the lake can be very slippery.",
    "directions": "Park parking lot at Silent Lake Provincial Park, Ontario.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/ON/6039/long_DSCF0993-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/6039/long_DSCF0994-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/6039/long_DSCF1002-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/6039/long_DSCF1007-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/6039/reg_20090531-16-22355.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/lakeshore-trail-at-silent-lake-park-near-peterborough-on-6039",
    "stats": {
        "Activities": "snowshoe hike ski-xc mtn-bike",
        "From": "",
        "Seasons": "winter fall summer",
        "Stars": 3,
        "Time": "6 hrs",
        "Total Distance": "15 km",
        "Town": "Peterborough, ON",
        "Type": "out-and-back"
    },
    "title": "Lakeshore Trail at Silent Lake Park",
    "trail_id": "6039"
}