{
    "description": "The trail starts off pretty easily with a two kilometre walk staying fairly close to the Similkameen river. A two kilometres you will will reach a fork in the trail, the junction is clearly marked with a sign that says Windy Joe and points to the trail you want to go on. If you miss the sign just stay straight and take the steep trail. After the juntion the trail switchbacks up and old fire acess for six kilometres to the top of the mountain with a elevation gain of about 620 metres. About half way up there is a junction to go to frosty mountain or the pacific crest trail, don't go that way if you want to hike windy joe. Although the trail is a little monotonus the trees are nice and the view from the top is definitely worth the climb up. There is a picnic bench at the top as well as an old fire look-out giving you an even better vantage point of all of the northern cascades. If you do this hike do it on a clear day, if it isn't clear then I recommend doing a lower elevation hike.",
    "directions": "From Vancouver take Hwy 1 to Hope then take Hwy 3 to Manning park lodge. Turn in and take the road lightning lake. Before lightning at the brigde over the similkameen and turn on the left side and you will see a sign for windy joe, that is the trailhead",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/6043/reg_2008-07-29-0023-edit-22809.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6043/reg_Quebec-Trip-June-2010-114-22809.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6043/reg_Quebec-Trip-June-2010-124-22809_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6043/reg_Quebec-Trip-June-2010-165-22809.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6043/reg_Quebec-Trip-June-2010-168-22809.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6043/reg_Quebec-Trip-June-2010-221-22809.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/windy-joe-near-hope-bc-6043",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "6 hrs",
        "Total Distance": "16 km",
        "Town": "Hope, BC",
        "Type": "out-and-back"
    },
    "title": "Windy Joe",
    "trail_id": "6043"
}