{
    "description": "This trail skirts the shoreline of Kootenay Lake, with multiple pebble beaches for chillaxing. You'd be hard-pressed to find a more pleasant trail in its entirety... there are few points along the way where you aren't utterly beguiled by your surroundings. The trail's ease makes it a great jaunt for families, or an excellent jogging route, or, as most people use it, an extensive path to a lakeside picnic.\r\rThere is barely any elevation gain or loss along this trail, which is packed woodland track, wide enough for two people to walk abreast. You'll bag no peaks and conquer no summits, but it is a fine slice of BC wilderness nonetheless. \rAbout 20 minutes from the car park you'll see Sawmill Bay through the trees. While its pirate-ballad cove looks idyllic from a distance, the 'beach' is comprised of sawdust and mulch, and you'll sink to your shins in the black muck, while beating back insects. Shortly after spotting the bay you'll cross two bridges over small, moss-fringed creeks and arrive at a spur down to Sawmill (which you don't want to take). On the cleaner side of the bay there is a walk-in provincial campground.\rAbout 10 minutes later you'll come across another spur to the right which is simply signed 'beach'. You won't need a break... but it's still worth a pause. In less than 100 m the trail pops you onto large, flat stones at the edge of the lake, with views of the almost-mountains of the Kootenays. \rThe trail then continues to alternate between impossibly vibrant moss, and rocky crags with wildflowers, to tall stands of aspen... one shade of green after another the entire way. If fairies had real-estate agents, they'd stake a claim to this trail.\rOnly 30 minutes from the second beach you'll come to another junction at Boomer's Cove. This is where most people take their picnic and head home. Another option is to take the left spur uphill where the trail takes on a wilder character. It's 3.5km from parking to Boomer's, and an additional 3km to the tip of the penninsula via this upper trail. The official provincial park boundary ends about 1km along this trail, the maintenance beyond this point is up to the hikers. \rBoomer's Cove is a large-pebble beach with classic BC views up and down the lakeshore. The ease of the hike makes the beaches somewhat crowded on weekends, but the location keeps numbers down... on May long weekend we ran into 2 families, a hiking group  of 7and, 4 backpackers. Not bad, considering.",
    "directions": "From Nelson and all points on the west side of Kootenay Lake, a free ferry crossing will be necessary (check inland ferry website for schedules). Balfour ferry landing is 35 km east of Nelson on Hwy 3A, and features a handful of restaurants and an AWESOME european bakery for your wait to get on the boat. The crossing is a pleasant 45 mins. From Creston, drive 70km west along 3A to Kootenay Bay.\rImmediately after (or before if coming from East) the ferry terminal a paved 'Pilot Bay' road curves along the water. Follow this road until the clear signs for Pilot Bay Provincial Park ushering you left. Park and enjoy. Dogs welcome, but are supposed to be leashed.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/6047/reg_kootenay-lake-storm-3-1287.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6047/reg_pbay-boomers-peanut-1287.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6047/narrow_p-bay-second-beach-1287.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/pilot-bay-peninsula-near-nelson-bc-6047",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "6 km",
        "Town": "Nelson, BC",
        "Type": "out-and-back"
    },
    "title": "Pilot Bay Peninsula",
    "trail_id": "6047"
}