{
    "description": "Lion's Head is along the Vimy Peak trail (see Vimy Peak for more details). Choose to hike or bike the first 6.5 km along the Wishbone trail with only 25 m of elevation. The first 2.5 km is an easily identifiable wagon track which later fades to less maintained single track. Be prepared to get your feet wet in one of two creek beds if you are making this hike earlier in the season. The distance covers birch and aspen forests along with wetlands filled with migratory birds and grasslands dotted with vegetation and wildflowers. At the Vimy Peak trailhead, where bikes need to be stashed, the hike becomes more strenuous. \nDouglas Fir begin to take over the vista as the climb continues. Approximately 2.5 km along this section, a creek can be heard on the North side of the trail. At a spot which resembles a back country tenting area just south of the main trail, a trail drops down into the trees towards this creek in a northerly direction. It can be easy to miss... if at any point you look over your shoulder and see a large rock outcropping on the ridge, you've gone too far. The trail forks just below the Lion's Head. \nTake this trail across the creek, and continue ascending to above the tree line, onto the ridge's spine where the trail fades. Scramble West up the ridge to the top of Lion's Head for a great view of Middle and Lower Waterton Lake. (see pic with scramble detail). Careful on the scramble down. It's a lot steeper than it seemed on the way up.",
    "directions": "Wishbone trailhead is on Chief Mountain Parkway (Highway 6) at the snow closure gates just off Highway 5. A large turn off for parking is located on the East side of the road. Park entrance fee is not necessary as trailhead access is outside of Park fee area.\nDardanelles trailhead (requiring a swim or short boat distance) is found near Marquis Hole betweeMiddle and Lower Waterton Lake. From outside the park, travel South along Park Entrance Road (off of Highway 5) to intersection for Alpine Stables. This will be your first left turn after pasing Redrock road. Turn East staying to the left until accessing picnic area beside the water. Technically, you could cross the dardanelles at any location and walk East until you reach a trail at which point you  would hike South. There is a routed trail that makes it's way to the Wishbone trail. Head North along the shoreline to find it. This option could take up to 12 km total hiking time off of the trip.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/6057/reg_IMGP3799-22962.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6057/reg_IMGP3811-22962.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6057/reg_IMGP3813-22962.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6057/reg_IMGP3815-22962.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6057/reg_IMGP3818-22962.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6057/reg_IMGP3819-22962.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6057/narrow_IMGP3800-22962.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6057/narrow_Lion-s-Head-Scramble-22962.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/lions-head-near-waterton-park-gate-ab-6057",
    "stats": {
        "Activities": "hike mtn-bike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 4,
        "Time": "6 hrs",
        "Total Distance": "19 km",
        "Town": "Waterton Park Gate, AB",
        "Type": "out-and-back"
    },
    "title": "Lion's Head",
    "trail_id": "6057"
}