{
    "description": "A varied trail that mixes sandy chutes, drops and breezy singletrack with skinnies, jumps and... some climbing. A shuttle is required to skip a 35min slog of a climb up a logging road, but some moderate uphill is still a pre-requisite for this one. You can loop back to town, or shoot down to Warfield.\r\rStarting at the gate at Birch Main, follow the road for approx 20 minutes, weaving a little up, little down, but no artery-busting grunts by any means. You'll pass the hilariously named \"Cherry Poppins\" trail, which, for now, you'll have to ignore. The next downhill track is the one you want - it will connect you with the logging road Crn Pt proper begins on.\rThis stretch is a black diamond, with steep, loosey-goosey chutes riddled with roots and large rocks, and a few holy-hannah drops, but is less than 300m to the road. \rFollow the road right (east) and it will, after short minutes, dwindle into a bushy path. Scant meters along the trail, single track through grass, will appear on your left. This is the official start of Crown Point. This section is a tough blue with black moments. There are several low, long skinnies formed out of the natural debris, and a moderate jump, but all stunts have ride-arounds. There are some chunky outcroppings of rock to negotiate, as well as a continuation of roots and drops.\rYou'll pop out onto another logging road in a bit of a T intersection. Continue right (east) for a few meters, and a sign will guide you down the continuation of the trail (left). This portion drops immediately and leads over a huge fallen trunk with an up/down ramp over it. The lower portion is predominantly blue, with some chunky monkey loose rock moments. It is also cooler here as a creek winds alongside the trail for a while. There is a super-skinny skinny over the creek, as well as a jump - both with ride-arounds. \rEventually you'll pop out into nuclear fall-out - a recent clearcut with picturesque deadfall - ride this out to yet another logging road. Follow the road right (east), it will curve west shortly, continue to follow this to a 3-way junction. Right will take you (signed) to Warfield, straight ahead is a cross-country style ziperoo that will spit you out at a switchback in the Railgrade. \rAgain, down will eventually lead to Warfield, while a steady but easy-to-peddle-in-middle-gear uphill will lead back to Rossland's Malde Creek Rd (25 min) or all the way to lower Rossland (45min).",
    "directions": "From Rossland Main St, turn downhill at Spokane (City Hall) and follow until the road winds into Davis. Take Davis through the 4-way at Thompson, and hang a left at the next intersection. The road then winds again into a crazy intersection where you stay right along the right-of-way going sort of up and left. The road (Spokane) will curve right (south) - follow this until it's clear you've left most of residential Rossland behind.\rStay left at the first spur (Ross), left at the second (Drakes) and right at the third. You are now on Malde Creek Rd. \rIf you have not arranged a shuttle, keep an eye on the left for a turn-off and large potential parking area. There are signs pointing out the Railgrade, as well as a gate heading onto private property. You will eventually return here via bicycle.\rContinuing on (hopefully in a truck) after a few minutes paved Malde ends and Malde FSR begins. A short ways along there will be a gated spur to the left (Tiger Main), continue climbing and climbing. The next gated road to the left will be Birch Main - there is ample space to park near (not blocking) the gate.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/6060/long_P1000312-1287.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6060/long_P1000317-1287.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6060/reg_P1000310-1287.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6060/reg_P1000315-1287.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/crown-point-near-rossland-bc-6060",
    "stats": {
        "Activities": "mtn-bike",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "8 km",
        "Town": "Rossland, BC",
        "Type": "out-and-back"
    },
    "title": "Crown Point",
    "trail_id": "6060"
}