{
    "description": "Kostal Volcanic Cone lies on the east shore of Kostal Lake within Wells Gray Provincial Park.  This remote lake is accessed by a route that passes through both seral mature and climax mature forest stands.  The route has not been maintained for several years and is currently littered with fallen timber, some of which is greater than 1m in diameter.  This trail is not for the inexperienced or casual hiker, good orienteering and backcountry skills are required.  It took two seasoned forestry workers, carrying 40lb packs, 12 hrs to reach the lake, and 8 hrs to return.  Bug repellent and leather gloves (for the prolific devil's club) are highly recommended.  Many sections of the trail are indistinct, but there are various colors of ribbon to reference along the way.  There are many muddy/soft trail sections, and a couple of difficult creek crossings; make sure your footwear and protective clothing are in good condition.  There is no defined trail from the lake campsite to the volcanic cone (or it has since grown in).  A great hike for those wishing to test their skills and stamina.",
    "directions": "The trail head starts just after the Falls Creek bridge at the head of Clearwater Lake (approx 70km from the Hwy 5 junction).  The start of the trail is shared with the Osprey Falls lookout trail, Chain Meadows trail and the Dragon's Tongue trail.  When the junction of the Dragon's Tongue trail loop is reached, choose the left loop.  The start of the Kostal Route is obvious - it is signposted with a large, use-at-own-risk, yellow caution sign.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/6064/reg_Kostal-Lake-022-21577.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6064/reg_Kostal-Lake-030-21577.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6064/reg_Kostal-Lake-Route-21577.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/kostal-lake-route-near-clearwater-bc-6064",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 4,
        "Time": "12 hrs",
        "Total Distance": "22 km",
        "Town": "Clearwater, BC",
        "Type": "out-and-back"
    },
    "title": "Kostal Lake Route",
    "trail_id": "6064"
}