{
    "description": "Just over an hour's drive from the town of Houston (which is located on Highway #16) you can enjoy the start of a wilderness canoe/camping trip in the Nanika-Kidprice Lakes Basin.  This basin lies on the eastern slope of the Coastal Mountain Range and forms the upper watershed of the Morice-Bulkley Rivers. The basin area is 920 meters above sea level and is surrounded by glaciated and snow-capped peaks that rise as high as 2400 meters.\r\nThe canoe trip goes from the road-accessible Lamprey Lake to Kidprice Lake. The 30 kilometre round trip can be made in 3 days, but 5 to 6 days allows the adventurer the opportunity to explore the lush alpine meadows of Tableland and the Sibola Range. View moose, black bear, mountain goats, bear and other small animals, and watch eagles and osprey fight over freshly caught fish, or the numerous other birds, and photograph the mountain and lake scenery with the ever changing lighting effects. Then there is the Nanika Falls that drop 18 meters from Kidprice Lake into Nanika River, and alone is just about worth the trip.\r\nThe canoe/camping adventure starts on the north shore of Lamprey Lake, where there is a large camping area and vehicle parking site. A short paddle across Lamprey Lake to the south shore, brings the adventurer to the first portage (1.5 kilometres)   Canoe resting supports are located along the trail, and planked-over wet areas make the trail easy to travel. \r\n\r\nThe next remote Lake is Anzac Lake, with its many water lily filled bays and an island with a good camping site. An excellent area to watch moose feeding along the lake in the early mornings and evenings. A short portage trail (.5 kilometres) from Anzac lake leads to the east end of Stepp Lake. This lake has many nice sandy beaches and areas to camp and enjoy the surrounding area. There's good Cutthroat fishing in this lake. At the west end of Stepp Lake, the longest portage trail to Kidprice Lake begins (2 kilometres).  Once Kidprice Lake is reached there is a great camping area on the end of the lake with a view of the snow-capped peaks. \r\n\r\nFour kilometres up the lake on the north shore, the lower Nanika River begins and a short distance down stream the river drops over the Nanika Falls. Great fishing for rainbow trout and bull trout in the numerous pools down the river.  A true wilderness area for groups of all ages to enjoy. \r\n\r",
    "directions": "\r\nFrom the Yellowhead Highway, approximately 2 kilometres west the town of Houston, turn south on the Morice River Forest Service Road. This Forest Service Road (FSR) is marked in kilometres starting at the Canfor Mill site near the Yellowhead Highway. \r\n\r\nDriving 27 kilometers will bring you to the junction of the Francois Lake and Morice Lake Roads. Turn right onto the Morice Lake Road and continue southwest approximately 38 kilometres. This brings you to the 65-kilometre marker on the road. Turn left and continue on to Lamprey Lake and the start of the canoe/camping trip.\r",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/607/reg_Canoecampingkidprice.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/607/reg_Canoechad2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/607/reg_Canoenomijane.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/607/reg_Canoeroutemap.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/607/reg_canoeloading.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/607/reg_canoeready.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/607/reg_nanikafalls.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/607/topo_canoeevening.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/nanika-kidprice-canoe-route-near-burns-lake-bc-607",
    "stats": {
        "Activities": "river-canoe",
        "From": "",
        "Seasons": "summer",
        "Stars": 4,
        "Time": "35 hrs",
        "Total Distance": "30 km",
        "Town": "Burns Lake, BC",
        "Type": "out-and-back"
    },
    "title": "Nanika-Kidprice Canoe Route",
    "trail_id": "607"
}