{
    "description": "The Cape Scott Trail is located in the Cape Scott Provincial Park; it is a rugged, remote area where hurricane-force winds and rains can occur at any time of the year. Trails are often muddy. Hikers should be properly equipped and familiar with wilderness travel; be prepared for extreme conditions. You need at least 5 - 7 days to experience all that the Cape Scott trail has to offer. Most trails run along old settlers' roads and can be quite slippery when wet. Although most of the trail is flat, it is a long hike into the main camping areas so be prepared for a long first day if hiking to the ocean side camping sites (Nissen Bight - 5.5 hours in, Nels Bight - 6 hours in, Experiment Bight - 6.5 hours in, Guise Bay - 7 hours in). In case of a late start, Eric Lake is only 1 hour into the trail and offers camping sites. There is a Ranger's Station at Nissen Bight where they will collect pay stubs from the trail payment required at the beginning of the trail ($20 per person, per night). The day hike out to the Cape requires an early start; dress in layers as the weather changes constantly. The lighthouse keepers offer refreshments and snacks (if they have received their supply shipment recently) and enjoy having visitors. Be aware of bears and cougars during your time in the Cape Scott.",
    "directions": "From Highway 19, approx 2KM south of Port Hardy, take Holberg Road and travel 45.5KM to Holberg. Continue on San Josef Main and follow the Cape Scott Provincial Park signposts. The Cape Scott/San Josef Bay trailhead is at the end of San Josef Main, about 18.5KM from Holberg (65KM from Highway 19). There is parking space at the trailhead. When parking remember not to block other cars and logging trucks have the right-of-way so drive with your lights on, and make way for them.",
    "geohash": "c1h",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/6071/long_20180730-163616-43396.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6071/reg_040-27019.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6071/reg_113-27019.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6071/reg_136-27019.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6071/reg_151-27019.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6071/reg_HPIM0101-23069.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6071/reg_HPIM0149-23069.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6071/reg_HPIM0163-23069.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6071/reg_HPIM0178-23069.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6071/reg_HPIM0201-23069.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6071/narrow_168-27019.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6071/narrow_HPIM0063-23069.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6071/narrow_HPIM0067-23069.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/cape-scott-trail-near-port-hardy-bc-6071",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 5,
        "Time": "35 hrs",
        "Total Distance": "24 km",
        "Town": "Port Hardy, BC",
        "Type": "out-and-back"
    },
    "title": "Cape Scott Trail",
    "trail_id": "6071"
}