{
    "description": "A short loop trail along the base of Red Mountain, great for a quick bike ride or jog. No stunning views or technical challenges, but good opp to work on riding uphill switchbacks.\r\rFrom Centennial parking lot, take the first intersection left and follow the road through the pedestrian tunnel. This time stay right and you'll see the water treatment plant. Take the trail heading up into the woods on your left (Moe's), within a few meters the trail splits, take the high road (Curly's). \rAfter 10 minutes of woodsy switchbacks you will pop out at a T intersection with a bridge over a tiny creeklet (Larry's). At this point the loop can  be done in either direction, but as written here the climb is up the road and descent is via trail.\rTurn left and follow the old gravel road (signed Redhead) up and around a few gentle bends (note the DO NOT ENTER signs along the edge - the land beyond belongs to LeRoi mine). On a bike, the climb is a workout, but a short one. Ignore the first unsigned spur, the next spur on your right (signed Miner's) is the one you want. \rFollow gently ungulated singletrack through the woods for several minutes, then you will pop out into a slightly open space and a 3-way junction. Stay right and within meters you'll find yourself on Larry's again. Turn right and you'll immediately be at the small bridge again. You can return down Curly's but it's frowned upon - since it's generally an up track.\rPreferably, descend down Larry's to the left. Ignore all spurs and follow the neon green diamond markers, eventually the trail will curl right and meet up with the reservoir trail (Moe's). Hang a right and follow the lakeshore until at the underpass once more. (For more detailed loop continuation, see Larry Moe Curly trail description).",
    "directions": "From downtown Rossland, take Washington uphill and follow it until just before the junction with Hwy 3A. On the right will be a large parking area with trail signs. This is centennial parking area - the beginning of many,  many trails.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/6073/narrow_DSC-0001-1287.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/miners-near-rossland-bc-6073",
    "stats": {
        "Activities": "mtn-bike hike snowshoe",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 2,
        "Time": "1 hrs",
        "Total Distance": "2 km",
        "Town": "Rossland, BC",
        "Type": "out-and-back"
    },
    "title": "Miner's",
    "trail_id": "6073"
}