{
    "description": "A popular dog-walk route with locals, this loop has several modification options, allowing you to extend or shorten the route as you please. The relatively high traffic is nice for anyone with a bear phobia. It can also loop around the reservoir, which is a nice change of scenery.\r\rFrom Centenial parking area, take the first intersection left, follow the road through the pedestrian underpass, and stay right. You can begin with the trail into the woods on the left, or the gravel road on the right (if choosing the resevoir extension). \rKeep in mind, there are many, many trails and spurs and unmarked roads in this area - sort of a 'choose your own adventure', the following loops are just my personal faves. \rIf you chose left, turn to page 107. You are now on Moe's, but only for a few meters. The trail splits and if you just want an easy, level stroll, stay lakeside to the end of the reservoir and return via the gravel road. If you'd like a longer walk (or more vertical ride) take Curly's uphill and enjoy the tight, rooted switchbacks that'll be a core workout for any cyclist. \rAfter 10 minutes of climbing, you reach a T junction with a small bridge to the right - this is Larry's. \rTake the track right - it is a smooth double track that you can really fire along (just watch for other users). There will be a spur trail on the right that will lead back to Moe's about 1/2 way along the reservoir, or continue straight on. In another few moments the trail will curve to the right and meet with Moe's about 3/4 of the way along the reservoir. If you prefer to stay in the woods, return via Moe's to the right.\rIf you'd like to extend your walk by a 10 minutes, stay left to the end of the reservoir. Here you meet the gravel road that will take you back to the pedestrian tunnel. No vehicle traffic is allowed, so dogs can run worry free (just don't let them into the water - Rosslander's have to drink the stuff.)",
    "directions": "From downtown Rossland, take Washington St uphill. Follow it to just before its terminus at HWY 3a, on your right will be a large parking area. This is Centennial trail head - note the trail map.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/6075/long_reservoir-1287.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6075/narrow_DSCN3206-6465.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6075/narrow_DSCN3207-6465.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6075/narrow_winter-cooridoor-1287.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/three-stooges-loop-near-rossland-bc-6075",
    "stats": {
        "Activities": "mtn-bike hike snowshoe",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "2 km",
        "Town": "Rossland, BC",
        "Type": "out-and-back"
    },
    "title": "Three Stooges Loop",
    "trail_id": "6075"
}