{
    "description": "An easy, woodsy walk/bike to Kootenay Columbia summit, overlooking Rossland and the Columbia Valley. It's really 1.5 hours at most, but I had to round up. Perfect intro to cross-country biking - just enough routes, rocks and uphills to make you think, but nothing that'll have you hurling your bike into the bushes.\r\rFrom Centennial Parking area, take the first intersection right and follow the gravel road (Monte Cristo) uphill. Within a few minutes, KC trail will be signed on your right, take this and enjoy some wide, easy double track until you reach the water tower. \rAfter this the trail narrows to rooty singletrack, with some small ups and downs to keep you awake. You will soon find yourself at a 4-way junction, the uphill trail is unsigned, the lower leads to McLeod subdivision, and ahead will continue toward KC summit. In 10 minutes (on foot) the trail will switchback to the left but also look like it continues forward. Keep an eye out for signs and stay climbing. A short while on, the trail levels out and you arrive at a 3-way junction. \rThe trail up and to the right (signed KC) is the one you want. From here it is fairly straight-forward. In a few meters the trail splits, but both end up at the exact same place. The lower right hand spur is a gradual climb on smoothish terrain, the left is a difficult blue with rock faces, chunky shale and a steeper grunt. Take one up and the other down to change things up.\rSoon you are spit onto the summit, where you can enjoy the lillies, lupines and paintbrush, or the views over town and into Washington to the south. \rFor a longer outing you can combine this with the KC Ridge loop trail and add about 30 minutes to the trip. \r\r",
    "directions": "From downtown Rossland, take Washington St uphill. Follow it to just before its terminus at HWY 3a, on your right will be a large parking area. This is Centennial trail head - note the trail map.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/6077/long_top-of-KC-cloud-1287.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6077/reg_kc-ultrawide-1287.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6077/narrow_light-speed-1287.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/kc-summit-centennial-near-rossland-bc-6077",
    "stats": {
        "Activities": "mtn-bike hike snowshoe",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "4 km",
        "Town": "Rossland, BC",
        "Type": "out-and-back"
    },
    "title": "KC Summit (Centennial)",
    "trail_id": "6077"
}