{
    "description": "Gaff Point is a 7 kilometre looped trail which begins at Hirtles Beach located just outside of Lunenburg on the South Shore of Nova Scotia. In 2002, the 124 acre property was designated as a protected coastline and wilderness area with the Nature Conservancy of Canada. A local organization now maintains and monitors the trail to ensure its environment remains preserved.  The trail is certainly off the beaten path but offers up some great scenery with a mixture of beach, estuary, forest and rugged coastline complete with some unique geology and a variety of wildlife. Please note that there is no overnight camping or fires permitted on the Gaff Point trail - this includes Sandy Cove (aka Secret Beach). Unfortunately, the day we hiked Gaff Point it was very blustery, damp and foggy so it was hard to get some nice photographs or watch for birds and animals. However, even under the blanket of thick mist, it wasn?t hard to see why Gaff Point is a special place. The beach itself is worth a visit seeing as though its crescent-shaped sand and cobble stone shoreline stretches for over 3 kilometres and would be the ideal place to spend a hot summer afternoon.  After parking your car at the public parking lot, you begin your hike along Hirtles Beach until you come to the Southwest end after about 1.5 kms. You will then see an interpretive sign at the edge of the woods. Here is where the trail begins to take you out to Gaff Point.  We found the first V-in the trail a little misleading because we thought this was where the main trail branched off to do the loop around the point but it was actually a detour trail that took you to ?Sand Cove? and is not shown on the map. Sand Cove is a neat little beach area tucked away between some very steep cliffs and is accessible by way of scaling down a bank with the aid of some frayed rope tied to the trees above. Obviously, you should attempt this at your own risk. Once on the beach, you get an up close view of the multi-coloured rocks which form the cliffs. It is worth the extra half-hour or so to take this detour and we eventually made our way back to the main trail despite some confusion and continued on.As you meander through the predominately spruce tree woodland (complete with lots of Old Man?s Beard), the trail branches off to the loop and zigzags around the tip of Gaff Point giving way to some awesome views of the seascape. You can get down to the water?s edge in some places but there are other areas which can be a little dicey if you are not watching your step. The day we were there, the waves were spectacular to look at yet dangerous to be near. Once completely around the tip of the point, you end up back in the woods to finish off the loop and head back to the trail head.  The Gaff Point Hiking Trail is not widely known but this does not diminish its calibre. It?s an excellent place to experience some unique and rugged Nova Scotia coastline - and with any luck, the sun will be shining the next time we visit.",
    "directions": "From Halifax, take Hwy. 103 to Exit 11. At Exit 11, head South on Rte. 324 toward Lunenburg. Once at town limits, take Rte. 332 towards the Ovens Natural Park. Pass the entrance to the Ovens and continue to Rose Bay. Take a left towards Rose Bay/Kingsburg. Once in Rose Bay, watch for signs for Kingsburg and Hirtle Beach. The road to Hirtle Beach is marked and is on the right. It will take you directly to the entrance of the beach parking lot.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/6080/long_Gaff-Point-Hidden-Beach-Wid-37129.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6080/reg_GP1-22378.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6080/reg_GP10-22378.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6080/reg_GP2-22378.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6080/reg_GP4-22378.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6080/reg_GP5-22378.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6080/reg_GP6-22378.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6080/reg_GP9-22378.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6080/reg_Gaff-Point-Caves-37129.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6080/reg_Gaff-Point-Cliffs-37129.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6080/reg_Gaff-Point-Fog-After-37129.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6080/reg_Gaff-Point-Rope-Down-37129.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6080/reg_Gaff-Point-Sign-37129.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6080/reg_Gaff-Point-Trail-37129.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6080/reg_PICT0095-40688.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6080/reg_Porcupine-40688.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6080/narrow_GP3-22378.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6080/narrow_GP7-22378.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6080/narrow_GP8-22378.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/gaff-point-near-lunenburg-ns-6080",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "7 km",
        "Town": "Lunenburg, NS",
        "Type": "out-and-back"
    },
    "title": "Gaff Point",
    "trail_id": "6080"
}