{
    "description": "A lovely outing from upper Rossland to the Summit of Red Mountain ski area. The the upper portion of the trail was only built last year, so it's a new experience for everyone. It can be a dog-friendly hike, snowshoe or bike ride - note that by bike the route would only take 1.5 hours, and the moderate rating applies only due to the amount of sweat required to make it to the top, there are no real technical sections whatsoever. Note also, it would be a 4 for this region, but the southern Kootenays are crippled by lack of soaring peaks, and I just can't go higher.\r\rBeginning at Centennial parking lot, take the first intersection left and follow the gravel path through the pedestrian underpass. Stay right, and then head left, following a trail up and into the forest (signed Moe's). Within a few meters, stay left again and begin to ascend (Curly's). After ten minutes of switchbacking through cedar forest, you arrive at a T intersection with a small watering hole and bridge. \rYou CAN go left here, and follow the gravel road upward, but the route I will describe is more pleasant (especially after rain) and less steep, though slightly more complicated to follow. Take a right, and in a few meters follow a spur left (Miner's). It will switchback shortly, ignore all other spurs and old trails - following the green diamond tags on the trees for about 10 minutes, along gently climbing, smooth singletrack.\rYou will eventually pop out onto aforementioned gravel road, go right and continue to climb. This part is rather steep and can be chunky after a washout, and muddy most of the time. Soon you pass through some concrete barriers, continue on the main track and pass through another set.\rSigns for 'Miner's' will guide you along the way. Ignore the first unsigned spur to the left, and continue to climb. The path will flatten out a pinch and the old trail continues forward, but watch for a sign that says \"New and improved Redhead trail 150m this way\", and turn left onto a steep uphill. This is the last of the ugly climbs - at least it's short.\rWhen you reach the signed junction reading \"redhead' right and 'red summit' left, take the left track and immediately find yourself on a ski run. Hang a left and follow it about 300m until it peters away into singletrack - this is where the trail continues. \rThe rest of the way is straightforward - about 40 minutes of climbing gentle switchbacks. The trail is expertly built, and the climbs come in short bursts moderated by breath-catching flats. As the switchbacks tighten you'll know you're reaching the top. Anyone fairly fit can do this on a bike - but it will be a workout.\rAbout 200m shy of the summit, you'll come across a privately owned, but open for gentle use, cabin. From here you can continue along the trail (recommended with bikes) or shoot up to the top directly along the no-nonsense ski runs. There is an emergency shelter, a viewing bench and a picnic table at the top. You can look straight down Red Chair at the resort, or out over Rossland.",
    "directions": "From downtown Rossland, turn uphill on Washington and follow it until just before it meets hwy 3A. On your right you'll see a large parking area with a trail map - this is Centennial trailhead.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/6084/long_red-view-1287.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6084/reg_red-cabin-1287.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6084/narrow_red-switch-1287.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/red-summit-near-rossland-bc-6084",
    "stats": {
        "Activities": "mtn-bike hike snowshoe",
        "From": "",
        "Seasons": "summer fall winter",
        "Stars": 3,
        "Time": "3 hrs",
        "Total Distance": "6 km",
        "Town": "Rossland, BC",
        "Type": "out-and-back"
    },
    "title": "Red Summit",
    "trail_id": "6084"
}