{
    "description": "The Coppermine Trail is a looped trail located within Fundy National Park which takes you to an old copper mine site. \nStarting from the parking lot, you begin your hike on a path through a field and then into the predominantly spruce woodland. The trail then comes to a \"V\" which begins the loop. \nYou stay to the right and gradually climb uphill deeper into the woods. You will cross several streams on wooden bridges.  At the tip of the loop you will find remnants of the old copper mine along with interpretative signs explaining how the mining was carried out here. One final push up a steep bank and you can rummage through the tailings. \nOnce you finish exploring the old mine site, you continue around the loop to the other side where you will begin making your way back down the hill. This side of the loop takes you along the Bay of Fundy where a few branch-off trails lead to cliff edges and offer up some great views of the Bay.",
    "directions": "From Moncton, take Hwy. 114 Southwest until you reach the town of Alma. The entrance to Fundy National Park is just outside the town of Alma. The Coppermine trail can be found at the end of Point Wolfe Rd. located in the Southwest end of the park.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NB/6085/reg_CM3-22378.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/6085/reg_CM6-22378.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/6085/narrow_CM1-22378.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/6085/narrow_CM2-22378.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/6085/narrow_CM4-22378.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/6085/narrow_CM5-22378.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/6085/narrow_CM7-22378.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/6085/narrow_Fundy-22378.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/coppermine-near-alma-nb-6085",
    "stats": {
        "Activities": "snowshoe hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "4 km",
        "Town": "Alma, NB",
        "Type": "out-and-back"
    },
    "title": "Coppermine",
    "trail_id": "6085"
}