{
    "description": "Ferryland Lighthouse\r\r\tFerryland, located on the southern shore of Newfoundland?s Avalon Peninsula, is one of the oldest settlements in North America.  Used as a migratory fishing station throughout the 15th century it was officially founded as the Colony of Avalon in the year 1621 by George Calvert who was later to be known as Lord Baltimore, founder of Maryland in the United States. Calvert?s Colony of Avalon is an ongoing archaeological dig that has unearthed many clues about life in the early 17th century.\r\tFrom the dig site a small dirt road brings you halfway out Ferryland Head, where the lighthouse has stood as a beacon for passing ships since 1870. From the parking lot the remaining 10-15 minute walk brings you past a small archipelago of islands as well as an old cannon that stands as a reminder of less peaceful times along these shores. Icebergs are a common sight here in the spring and during the summer months humpback whales come by the hundreds to put on a show for the tourists as they playfully feed from the rich Atlantic waters.\r\tAround the lighthouse the view is spectacular. You can see as far as the Great Island in the Witless Bay Ecological Reserve to the north and the giant windmills at Fermeuse dominate the skyline to the south. Don?t be surprised, however, if the head is socked in with fog limiting visibility to a few feet.\r\tAnother great thing about the lighthouse is the opportunity to enjoy a beautiful picnic lunch courtesy of Ferryland Lighthouse Picnics. They provide a picnic blanket and wonderful fare to enjoy the fantastic ocean view while you eat. It is truly a great idea and a great lunch!\r\tThis short hike is a great way to kill half a day if you are traveling along the Irish Loop on the Avalon?s south shore. The views are fantastic and the rich history of the area makes you feel as if you have stepped back in time. If you are in the area, I highly recommend that you drop by this great location for a picnic and some whale watching.\r\rRyan Young\rNewfoundland Editor\r",
    "directions": "At the town of Ferryland turn left at the Colony of Avalon and follow the dirt road until you reach a small parking lot marked by a sign indicating the end of the road.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NL/6087/long_FL-9-8764.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6087/reg_FL-1-8764.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6087/reg_FL-10-8764.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6087/reg_FL-11-8764.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6087/reg_FL-12-8764.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6087/reg_FL-13-8764.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6087/reg_FL-14-8764.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6087/reg_FL-15-8764.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6087/reg_FL-16-8764.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6087/reg_FL-17-8764.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6087/reg_FL-18-8764.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6087/reg_FL-2-8764.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6087/reg_FL-3-8764.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6087/reg_FL-4-8764.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6087/reg_FL-5-8764.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6087/reg_FL-6-8764.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6087/reg_FL-7-8764.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6087/reg_FL-8-8764.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/ferryland-lighthouse-near-ferryland-nf-6087",
    "stats": {
        "Activities": "mtn-bike hike climb",
        "From": "",
        "Seasons": "summer spring",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "2 km",
        "Town": "Ferryland, NF",
        "Type": "out-and-back"
    },
    "title": "Ferryland Lighthouse",
    "trail_id": "6087"
}