{
    "description": "This hike can be done as a loop (yay!) to the top of the highest peak in the Rossland Ranges. The majority of the hike is spent on open ridgetop with sweeping views and plentiful wildflowers. If doing just loop w/o summit: 11.5km, 700m gain, 4 hours. With summit: 17km, 1000m gain, 6 hours. Even without the summit bid, the loop trail is wonderful.\r\rMere moments beyond the parking lot you will be met with a fork and a sign, warning travellers to stay left on the Plewman Trail as it is officially maintained. The Old Glory trail is just as often travelled, and I found it to be in better condition than Plewman, plus a heckuva lot nicer. If you want to shorten your trip by 2 or 3km, then Plewman is your man, otherwise, sign be damned!\rThe first 20 mins follows a rather wide, gently sloping path that has you thinking, \"Hmmm, I could ride my bike up this...\" but then you hit the choppy, chunky rocks on the following 15min ascent and realize you're better off on foot. \rIn less than an hour you'll reach a major junction with all sorts of information. You have arrived at a portion of the famous 7 summits trail. Stay right toward \"Old Glory Junction\" - another 3km and change beyond. After a brief stint through forest you'll be catapaulted onto the tip of the ridge. There is some minor switchbacking amongst flowers and piney goodness, and then you are on the ridge proper, where you'll stay for the next hour. The rise is gentle and the trail is easy to follow if you respect the downed trees over old trail spurs. \rA little ways along the ridge you'll get your first views of Old Glory. As OG continues to loom, you will round a corner and find yourself face to face with the junction for the summit. Are you up for it? If so, the trail dips and you lose about 75m before starting the ascent. The trail curls around to the back of Old Glory where the grade is not as sheer, and switchbacks along in somewhat shaley conditions. There is an old lookout hut at the top, and you can see all the way to the Valhalla peaks in the north.\rIf not, a mere 100m beyond is the junction with the Plewman trail, which is a smidge under 5km back to the parking lot. This is a no-nonsense trail that drops away from the alpine in a hurry and secludes you in a narrow valley, and then shady forest. There are several small creek crossings in early summer (great for dogs!) with sturdy bridges over anything serious. \rYou might be tempted to stop at the first large bridge about 1.5km from the car, with it's gushing streamery... but carry on to the next one only a few meters farther, it has a fantastic foot-dipping pool and some charming cascades. \rAt this point you're 15 minutes from the car, so what's the rush? you will soon hear the highway as you wind above it for 500m before reaching the original 'go this way!' junction.",
    "directions": "From jct of Hwy 22 and Hwy 3B in Rossland, travel about 10km north. On your left will be a small 2-car pull-in with a vertical (old school) wooden sign reading \"Old Glory\". There is also parking directly across the highway in an equally small pull-out.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/6098/long_plewman-creek-1287.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6098/reg_DSCN3245-30938.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6098/reg_old-glory-1287.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6098/narrow_DSCN0911b-48266.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6098/narrow_DSCN3233-30938.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6098/narrow_og-trail-1287.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/old-glory-near-rossland-bc-6098",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 4,
        "Time": "6 hrs",
        "Total Distance": "17 km",
        "Town": "Rossland, BC",
        "Type": "out-and-back"
    },
    "title": "Old Glory",
    "trail_id": "6098"
}