{
    "description": "The Poland Lake trail starts off pretty easily for the first 200 to 300 metres then it starts to climb, if you are on your bike you will definitely have to dismount. The trail remains steep for the next 4 kilometers which brings you under the Orange chair lift and then switch backs up to the top of the Manning Park ski mountain and the end of the Orange chair (by now you have gained 430 meters of elevation). The views are spectacular, some people would be fine with turning around here.\nFrom the top of the ski mountain take the horseshoe ski trail to the sign displaying Poland Lake Trail (strong riders could possibly bike from here on in but some people would probably have to dismount several times before reaching the lake). The trail proceeds to go up and down several times before reaching Poland Lake. Leave your bikes (if you brought them) at the hitching post and proceed to the camp at the far side of the lake. At this point you have finished the hike.\nThe lake is chalk full of small rainbow trout, I saw at least 50-60 fish although sadly enough I didn't bring my fishing rod so I couldn't try and catch any.\nThe trail back to the Ski Mountain is fairly slow on bikes because of all the up and down but once you get past the mountain's summit it is all down hill and extremely fast and very fun.",
    "directions": "From Vancouver take Hwy 1 to the junction of Hwy 3 and Hwy 5 at Hope, take Hwy 3 to Manning Park Resort and follow the signs to Strawberry flats. You will find the Poland Lake trailhead on the opposite side to where you park.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/6103/reg_Poland-Lk-85-22809.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6103/reg_Poland-Lk-86-22809.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6103/reg_Poland-Lk-trail69-22809.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6103/reg_Poland-Lk-trail71-22809.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6103/reg_Poland-Lk-trail77-22809.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6103/reg_Poland-Lk-trail78-22809.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/poland-lake-near-hope-bc-6103",
    "stats": {
        "Activities": "hike ski-bc mtn-bike",
        "From": "",
        "Seasons": "winter summer",
        "Stars": 4,
        "Time": "5 hrs",
        "Total Distance": "16 km",
        "Town": "Hope, BC",
        "Type": "out-and-back"
    },
    "title": "Poland Lake",
    "trail_id": "6103"
}