{
    "description": "This trail gets a 4 only because of its combination of ease of access and suprisingly lovely lake at the end. It is a foray into the backcountry around Salmo, and the trail was lovingly crafted at some point, but has now fallen into general disuse (which upped the adventure factor for us). The lake is an unexpected gem with clear waters, rocky shores and fairly intimidating peaks in the background.\r\rOne can no longer drive all the way to the proper trailhead, so the first km of your journey (depending on where you parked) will be along old logging road. There are a few small creek crossings, the first one is the largest; the bridge has collapsed and is generally useless. The crossing is chilly, but short, shallow and relatively safe. \rAfter this the old road has been beaten back into narrow singletrack by some aggressive plants, including patches of stinging nettle- long pants  recommended. This only lasts about 200m before the route enters cool forest and the trail is much easier to follow. It is a few minutes along that the official trailhead is marked by a disintegrating registry box. From here the trail ascends gently along forested switchbacks. \rExpect some deadfall along the route, since the trail reeks of 'user maintained' status. As of early July 2009, a storm seems to have downed a large swath of trees near the top of the switchbacks - perhaps 70m or so of trail is utterly lost under the decimation. Continue in the general direction the trail was heading and you should stumble upon it again (hopefully I'll have had time to go flag it by the time you arrive up there).\rShortly after this inconvenience, the trail crosses a lovely, mossy brook, then continues to climb gently through huckleberry bushes and other such bear-friendly greenery. Make lots of noise, as it's difficult to see far off the trail.\rIn 15 mins or less from this point, you reach the culvert at the top of your trail, and with it, the glittering shores of this small but appealing lake. A narrow trail continues around the northern edge of the lake, with the possibilities of ridge-top scrambling in the hills beyond.",
    "directions": "From Salmo, turn east onto Fourth St (marked on some maps as Airport road) and follow it for about 6km, until you see Sheep Creek FSR on your left. The road is suitable for 2wd right up to the junction with Curtis Crk. Keep Sheep Creek on your right at all times - in other words, avoid any spurs that take you left away from the creek, or onto bridges that cross the creek.\rAbout 12km in there is a major spur on your right (with a bridge across Waldie Creek) featuring a wilderness campsite and the way to Waldie Lake trail.\rThe next main spur occurs at Curtis Ck, where some may want to park their vehicles, but those who bought trucks for a reason can carry on up Sheep Crk FSR to the left. \rIt's about 2km from here to the spur road to Panther, so prepare to add an hour each way to your trip time if walking. In about 1km you'll reach a bridge across the creek - we parked here b/c a sign said the bridge is closed, but after walking across it it SEEMS fine, but we weren't taking any chances. Whether driving or walking, the main road will take a sharp turn left in a little less than a km and the first, slightly overgrown spur will appear leading up along the creek. This is the unofficial trail beginning.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/6109/reg_DSCN6434-48266.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6109/reg_pan-andr-1287.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6109/reg_panther-lake-1287.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6109/reg_panther-lk2-1287.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6109/narrow_DSCN6422-48266.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6109/narrow_DSCN6432-48266.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6109/narrow_pan-trail-loki-1287.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/panther-lake-near-salmo-bc-6109",
    "stats": {
        "Activities": "mtn-bike hike",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 4,
        "Time": "4 hrs",
        "Total Distance": "6 km",
        "Town": "Salmo, BC",
        "Type": "out-and-back"
    },
    "title": "Panther Lake",
    "trail_id": "6109"
}