{
    "description": "NTS Map: 83E14\rThis trail makes a steady climb from the floor of the Smoky River valley through two different forest zones to the summit, climbing just over 1000m elevation over the 8km to the summit (16km is return distance).\r\rFrom the trailhead, the trail kicks up with some early steep sections.  Do not be discouraged as the trail does become more reasonable, although several steeper sections remain.  Horses also make use of the trail, so care is sometimes needed to avoid mud holes and droppings.  The first 5km is within dense forest.  After that point, the trail enters alpine meadows and begins to offer some nice views of the surrounding terrain.\r\rOnce at the pass on the North side of Mount Stearn, the main trail bends right to continue up towards Lightning Ridge.  To the left, another small trail starts up the side of Mount Stearn (Junction at 5970700N, 353087E, UTM Zone 11, NAD83).  Look for small bits of orange flagging, and follow this trail up to the top of the ridge.  The actual summit is a rocky knob about a kilometre further South along the ridge and is marked by a cairnbox (5969325N, 353552E, UTM Zone 11, NAD83).  Nice views of Grande Cache, Lightning Ridge, and the Smoky River valley leading into Willmore Park are available from the summit.\r\rAn easy scramble is required to gain the summit knob.  When approaching the knob, aim for the left side of the rock band and a path will become apparent.\r\rNote that trail information claims the one-way distance is 6.5km.  I believe that this distance is to the head of the valley before making the final climb up to the summit.",
    "directions": "From the town of Grande Cache, take Hwy 40 North for several kilometres.  After crossing the bridge over the Smoky River, turn left on the Sulphur Gates Road.  Travel West for 3.5km to the trailhead, located on the North side of the road just after a gravel pit.  A small parking area is on the opposite side of the road.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/6112/reg_IMG-0078-11604.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6112/reg_IMG-0079-11604.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6112/reg_IMG-0082-11604.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6112/reg_IMG-0084-edit-11604.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6112/reg_IMG-0097-edit-11604.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6112/reg_MtStearnMap-11604.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6112/reg_MtStearnProfile-11604.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6112/narrow_IMG-0077-edit-11604.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mount-stearn-near-grande-cache-ab-6112",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 4,
        "Time": "6 hrs",
        "Total Distance": "16 km",
        "Town": "Grande Cache, AB",
        "Type": "out-and-back"
    },
    "title": "Mount Stearn",
    "trail_id": "6112"
}