{
    "description": "Includes a short wilderness hiking trail leading up to a peak offering far reaching views of the valley below. The mountain recreation trail is tucked away in the backcountry forests located north of Fernie, BC in the East Kootenay region of British Columbia, Canada.\nMount Hosmer Hiking Trail is split into two sections. The first section of the hiking trail follows a narrow path up hill for about 3 kilometres (1.9 mi.). The trail is mostly dirt and earth, with exposed roots and rocks. The first 3 kilometres ends at the base of Ghostrider Peak on Mount Hosmer [editor's note: official trail ends at saddle below Ghostrider Peak but a fairly open trail continues to just below the summit of Ghostrider peak].\nThe first section of the Mount Hosmer Hiking Trail takes about 2- 4 hours to complete - based on your fitness levels. The trail is considered moderately difficult as it includes some switchbacks and steep hills. In total the elevation gain on this hike is over 700 metres. The peak is measured at 2,340 metres (7676 ft.) [Editor's note- what is described is in fact Ghostrider Peak, not the summit of Hosmer. Attaining Ghostrider Peak, the total elevation gain is 900 metres or 3000 feet].\nThe second section of the trail leads to the summit of Hosmer Mountain [edit: Ghostrider Peak]. It starts off relatively easy and then near the peak it becomes steep. This section of the trail is approximately 2 kilometres. Towards the upper section, the trail navigates along a ridge leading to the towards the summit. The trail is unmarked and is unmaintained.\nIt is important to prepare for this hike. All hikers should have good hiking boots, a hat and pack in plenty of water. It can get hot on the mountain. There is very little cover from the elements when accessing the peak. There is no water source on this hike.\nAll hikers in the wilderness backcountry should be well prepared for wildlife. Keep an eye out for the mountain goats who roam the area. And be aware this is also bear country. \n[Editor's note: to attain the summit of Ghostrider peak requires ascending a class IV cliffband (maybe 5.3) We found a single bolt for belaying at the base of the cliff bands and ascended the crack a couple of metres over. To get to the true summit of Hosmer will require another 2-3 hours of following the ridge from Ghostrider Peak.]",
    "directions": "Travel to the community of Fernie, BC in the East Kootenays. Continue traveling north on Highway #3 through Fernie. Cross the Elk River and on your left is Dickens Road. Turn here. Continue on Dickens to the Hartley Lake FSR (Forest Service Road). Turn onto the gravel road and continue driving for 7 kilometres to the Hosmer Mountain Hiking Trail. The trailhead is not well marked. It is located on a hairpin turn with a small gravel pull out parking area opposite the trailhead.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/6113/reg_0726091057-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6113/reg_0726091058-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6113/reg_0726091138-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6113/reg_0726091146-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6113/reg_0726091159-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6113/reg_0726091202-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6113/reg_GE-scrnshot-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6113/narrow_14416846-21447.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/hosmer-mountain-hiking-trail-near-fernie-bc-6113",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 4,
        "Time": "8 hrs",
        "Total Distance": "10 km",
        "Town": "Fernie, BC",
        "Type": "out-and-back"
    },
    "title": "Hosmer Mountain Hiking Trail",
    "trail_id": "6113"
}