{
    "description": "**The trailhead is only accessible by vehicle in July/August. The rest of the year, the road to  Island Lake Lodge is closed due to heavy snow and poor road conditions, and the trailhead can only be reached by hiking up the road. The difficulty rating of this hike takes this into consideration.**\nThe trail is 5km (2-4 hours) one way. It starts from the southeast corner of the Island Lake Lodge's Cedar Lodge, nestled in the heart of the Lizard Range. It is marked by signs. The trail leads up the southwest slopes of Mt. Fernie. Begin by making your way through an old-growth cedar forest, and follow the open grassy slopes and rocky crags to the end of the trail, near the summit of Mt. Fernie. The net elevation change on this hike is 655m. The minimum elevation is 1385m, and the maximum elevation is 2040m.\nIt is wisest to do this hike in the peak of summer, when conditions are favorable. There are a couple of staff who stay at the lodge year-round, but it is only open to the public in July/August. In most other months, the Lizard Range is packed with heavy snow.",
    "directions": "Enter Mount Fernie Provincial Park, 3km south of Fernie on Hwy 3. Continue up the road, past the campsite, until you reach a gated road. The gate has signs that indicate the distance to Island Lake Lodge. If I remember correctly, the distance from the gate to the lodge is 7km. In the off-season, when the gates are closed, one must park their car at the gate and hike the rest of the way. You will find the trailhead near the southeast corner of the Cedar Lodge, one of the lodges at Island Lake Lodge. The way to the trailhead is clearly marked by signs.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/6124/reg_tamarack-trail-21447.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/tamarack-trail-near-fernie-bc-6124",
    "stats": {
        "Activities": "snowshoe hike ski-xc mtn-bike",
        "From": "",
        "Seasons": "summer",
        "Stars": 4,
        "Time": "6 hrs",
        "Total Distance": "10 km",
        "Town": "Fernie, BC",
        "Type": "out-and-back"
    },
    "title": "Tamarack Trail",
    "trail_id": "6124"
}