{
    "description": "The Caribou Plain Trail is located within the boundaries of Fundy National Park. It is an easy and relatively flat looped trail perfect for young families. You will be guided along with interpretative signage through a mixed forest, bog and beaver pond. \r\rMuch of the trail is a boardwalk ? especially over the wet boggy areas. Through the wooded areas, you will walk over some gravel and rooty foot paths. Bird and plant reference books might be a great idea to bring along since there are a large variety of both to see and identify. We expected a moose might even come crashing through the woods as it felt like moose territory too but that (disappointingly) didn?t happen. \r\rAlthough a short hike, the Caribou Plain Trail is still enjoyable with lots to see and gives a view into some of the interesting habitats existing within Fundy. There is even a separate shorter loop close to the parking lot which is wheelchair accessible.",
    "directions": "From Moncton, take Hwy. 114 Southwest until you reach the town of Alma. The entrance to Fundy National Park is just outside the town of Alma. Continue through the park on Hwy 114. The trail entrance is located mid-way through the park just south of Bennett Lake.",
    "geohash": "f81ex",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NB/6125/reg_CP1-22378.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/6125/reg_CP3-22378.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/6125/narrow_CP2-22378.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/6125/narrow_Fundy-22378.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/caribou-plain-trail-near-alma-nb-6125",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "4 km",
        "Town": "Alma, NB",
        "Type": "out-and-back"
    },
    "title": "Caribou Plain Trail",
    "trail_id": "6125"
}