{
    "description": "The Juan de Fuca trail runs along the south-western coast of Vancouver Island, with trailheads between Jordan River and Port Renfrew. The hike to Mystic Beach is 2km through and a beautiful forest filled with ancient trees and on a well maintained trail. There are markers all along the way and also a suspension bridge to cross that looks down onto McIvar Creek below. \r Its a decent trail and we passed more than a few families on their way back up with smaller kids so its active child friendly. \r You'll hear the ocean before you see it, and when you do its beautiful! The trail follows along a ledge making its way down. Once you reach the bottom, there are plenty of places to set up camp with lots of driftwood to use for benches, shelter, ect. There are small caves on the western side of the beach that you can reach and explore during low tide. On the eastern side it gets more sandy someone has set up a swing that is a LOT of fun to play on over the water, there is also a small waterfall.\r *Make sure your tent is set up far enough away from the water line that you don't wake up to the ocean splashing you in the face*, there are tidal charts posted at the entrance to the beach, as well as food caches and public washrooms (no plumbing). There are no garbage cans set up so plan accordingly.",
    "directions": "Follow the west coast road past Sooke, past Jordan River and then you will start to see signs. Look for China Beach day use trailhead marker.",
    "geohash": "c0x",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/6127/long_pano-23743.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6127/reg_mystic-beach-011-23743.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6127/reg_mystic-beach-028-23743.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6127/narrow_mystic-beach-005-23743.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/juan-de-fuca-marine-trail-mystic-beach-near-sooke-bc-6127",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "2 km",
        "Town": "Sooke, BC",
        "Type": "out-and-back"
    },
    "title": "Juan de Fuca Marine Trail - Mystic Beach",
    "trail_id": "6127"
}