{
    "description": "This is one of the great options leaving from the Elbow Lake trailhead off Highway 40 including Tombstone Lakes and Piper's Pass. There are little trails criss-crossing the main valley so you can customize your route, the path we took to Rae lake and past the little Sheep lake on the way back was 19.5 km and just 400 m elevation gain. Taking a more direct route, it would be just 17.2 km and 366 m elevation gain. The best description I've seen is from the 'Where the Locals Hike' book by Kathy and Craig Copeland.\nThere is a steep initial climb from the trailhead to Elbow lake and then a mostly flat to rolling trail until you start the climb through light forest up to Rae Lake. The route down takes a horse trail and then a fire road to get back to the original trail. It's perfect hike for a day when you're not too certain of good weather (a storm hit us on the way back and the trail was still in great condition in the rain).\nThis is 12km past he winter gate closure at Peter Lougheed if you're doing this in winter.",
    "directions": "From Calgary, take the Trans-Canada west to Highway 40 and head south. The trailhead is along Highway 40, 12 km past the Kananaskis Lakes turnoff on a section of road that is only open from June 15th to November 30th. The parking lot is on the east side of the road.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/6128/reg_2009-07-Rae-Lake-013-15400.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6128/reg_2009-07-Rae-Lake-053-15400.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6128/reg_2009-07-Rae-Lake-097-15400.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/rae-lake-sheep-lakes-near-calgary-ab-6128",
    "stats": {
        "Activities": "ski-xc ski-bc hike snowshoe",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 3,
        "Time": "6 hrs",
        "Total Distance": "20 km",
        "Town": "Calgary, AB",
        "Type": "out-and-back"
    },
    "title": "Rae Lake & Sheep Lakes",
    "trail_id": "6128"
}