{
    "description": "Like having nature all to yourself? You'll love this place. Don't like crossing creeks on slippery logs? Maybe you'll learn to... at the very least you'll get plenty of practice on the dozen or so streamlets. But it's worth it - the short trail reaches a lovely subalpine basin in no time, and from that point on it's up to you; wander the flowering meadows, attack Haystack peak, circumnavigate the small lakes... whatever floats your boat. Just bring waterproof boots. I mean it.\nImmediately at the trailhead you must rock-hop a narrow, shallow creek (all water crossings should be smaller and easier late July onward), and bushwack a few meters. Don't let this put you off, the rest of the trail may get a little crowded by shrub, but is cleary defined from here on. \nYou climb gently through forest, tight-roping or rock-hopping over creeklet after creeklet. Only 2 were troublesome, ie fast enough to worry about more than soaking a shoe. A proper bridge spans Sanca creek, so don't worry about that one. Because of the constant presence of water, the trail is muckety muck in places - but no worse than your average coastal trail in springtime.\nAn hour in, you'll reach the Kianuko Prov Park boundary and sign. Maybe 15 minutes more climbing and you'll arrive at the basin and edge of the marsh (3km from parking area). At this point things might get confusing, but only if you're committed to trails. Tracks begin to go in all sorts of directions, and there is occassional evidence of humanity - chopped logs, a bear cache - but the official trail pretty much ends (though the fun has only just begun). \nYou can go right, around the marsh and along the edge of a shallow lake - a hint of a trail continues NE and descends a little past a few more little lakes, but the basin is the best part, so why leave it?\nIf you stay left around the edge of the marsh (but remain in basin bottom) you will encounter snippets of trail here and again - but the landscape is open enough that anyone with a compass and decent memory will be hard-pressed to get lost.\nThe reedy grass and fanning creeks make the basin unique in terms of sub-alpine experiences. Continuing on this left path, you will emerge from the sparse forest and enter a huge meadow just at the base of Haystack mtn - there is a multi-fingered stream that is very easy to pick your way across, and the lake to your right. My dogs have never been happier in their lives than in this meadow.\nNow, if you want to keep going, see the lowest point on the ridge to the left of Haystack peak? You can scramble up the grass chute, or immediately left of that there is a rocky face... this actually has a faint switchback up it, though it leaves you on your own shy of the crest. The 4 hour roundtrip total for this outing is to the ridge, allow more time if you plan to scramble to the peak. The view from the ridge is generally reward enough, revealing all the lakes and ponds on either side, and some surprisingly rugged peaks in the vicinity.",
    "directions": "30 km south of Gray Creek or 36 km north of hwy jct 3 and 3a in north Creston, find Sanca Creek FSR heading east away from the lake. At 9.3km reach a fork, stay left. Remain on the main road to km14, left goes to Sherman Lake (I couldn't cross the creek to the trailhead in early July, so no idea about this trail... sounds nice, though) stay right across the bridge. There is another bridge a little ways along and then a multi-car pull in at the end of the road and a trailhead sign with register.\nThe road is great for an FSR - I would do it in a 2wd without fear. There are a few water bars, but they are expertly cut with easy drive-arounds.",
    "geohash": "c2v1",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/6132/reg_hay-horz-1287.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6132/reg_hay-loi-1287.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6132/reg_haystack-refl-1287.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6132/narrow_spark-vert-sm-1287.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/haystack-alpine-near-creston-bc-6132",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 5,
        "Time": "4 hrs",
        "Total Distance": "8 km",
        "Town": "Creston, BC",
        "Type": "out-and-back"
    },
    "title": "Haystack Alpine",
    "trail_id": "6132"
}