{
    "description": "An interesting trail that shoots you up onto a ridge, and then descends gently through larched-out meadows to a large sub-alpine lake. Finding the trailhead, though, was a bit tricky (see below).\nFrom the signed trailhead, the path shoots immediately upward, first through forest, and then more abruptly upward along some tighter switchbacks at the toe of a ridge. In about 30 mins you'll reach the ridge proper, where the climb continues, but more gradually, and with a nice view of some steep basins and Kootenay lake way below.\nThe ridge gets very narrow and steep at its high point (2.4km from start), I leashed my dogs for fear they'd plummet after a squirrel or something equally stupid. Minutes later the trail descends a little to an obvious saddle visible from the beginning of the ridge. Some shaly switchbacks run down the other side into extensive, rolling meadow. Most hikers will reach the meadow within an hour of starting out. \nIt's all downhill from here! The trail picks its way along the high side of the slope, heading NE. Soon you see the edge of the lake below - which is, disappointingly, not plaid at all, but rather blue. \nThe trail fades and re-appears intermittently - watch for rock cairns signalling the general direction. It's pretty obvious going until you hit the berry bushes lower down- remain on the west side of the inlet creek as you approach the lake.\nThere was still 3+ feet of snow all throughout the basin, right to the lake as of July 9 - which made the trail both invisible and unneccessary - though waiting until later in the season is probably a good idea. You should be lakeside within an hour of hitting the meadow (4.5km from start).",
    "directions": "Okay - the way I went was obviously not the right way, but I followed Forest Service directions and did make it somehow. Here are the directions I was given (I will add where I might have gone wrong): From Creston head north, from Nelson, head east and take the Balfour ferry across to Crawford Bay. In the village of Crawford Bay, watch for Wadds road heading away from the lake and turn onto it. Go left at the T intersection (about 2km along) onto Crawford Creek Rd. Continue past the dump onto Crawford Crk FSR.\nAt about 5km of the FSR there is a fork with Crawford-Hooker FSR, curve left. Stay on this road for 6km - then a 4wd road goes up and right, follow it 1.3km to trailhead. NOW- since the directions were written, logging operations have resumed. The 'main road' now is actually a new road - about 1km after turning at the fork the new road switches back, while a grassy old road continues forward. I can only assume this is the one they meant, b/c the one I took to the right was for sure not.\nWhat I do know, is that 1km stretch features some of the uggliest water bars I've ever seen. It's as though someone got drunk and took a dare to try using a digger for the first time. Only those who enjoy the sheer challenge of navigating ditches in their lifted monster trucks will like this road. \nAlso, if you continue on this new road, it gets uglier - the last km sign is at 10, another 1.5 along the road simply ends in a wide space. Park here and apologize to your car. You'll see a mound, which has a very old road running beyond it, walk this for about 10 minutes and come across a lovely, steepish but smooth road that must be the one they spoke of in the book, but comes from a place that makes no navigational sense. Anyway, follow this to the left for 20 minutes, you'll enter the blessed shade of a forest and moments later reach the trailhead.\nI would strongly advise trying the other way, though, especially if you don't want to swear and cringe your way along a ditch-infested mess running through active logging zones. Or try calling the Kootenay Lake forest district at 250-825-1100.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/6135/reg_plaid-lake-1287.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6135/reg_plaid-ridge-1287.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6135/reg_plaid-rocks-1287.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6135/reg_plaid-swbacj-1287.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/plaid-lake-near-nelson-bc-6135",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 4,
        "Time": "5 hrs",
        "Total Distance": "9 km",
        "Town": "Nelson, BC",
        "Type": "out-and-back"
    },
    "title": "Plaid Lake",
    "trail_id": "6135"
}