{
    "description": "Trail is quite scenic and surrounded by numerous wetlands and lakes. There are lots of different trails at this park as well. The trails are very bike friendly. It is easy to get lost on these trails though, so be sure to bring an extra bottle of water should you be feeling like doing the whole thing.The terrain consists of lots of rock, dirt and tall grass at the lower elevations. In the winter time, the trails are groomed for snowshoeing and skiing, and there is a trail fee in the winter. The park also hosts lots of winter events. There are a number of trails on trailpeak that detail the network of trails in the conservation area, some of these entries follow:Here are the 5 trails I added as seperate trails for the Lake Laurentioan Conservation Area. Moonlight Beach Trail TrailBeaver Pond TrailRamsey TrailPerch Lake TrailPoint TrailThis last trail is the longest and the main trail for the Conservation area.  It has been submitted  before but the starting point in that submission is from outside the conservation area on that trail and the trail is not the proper full circle trail. The correct trail when started at the main parking area of the conservation area is here;Point Trail (Official)",
    "directions": "Once you are in Sudbury, the park can be accessed by:1. Head west on Elm St toward Notre Dame Ave 7 km2. Turn left at Paris St 4.9 km3. Turn left at Regent St 3.3 km4. Take the ON-17 ramp to N Bay 0.6 km5. Merge onto King's Hwy 17 E3.8 km",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/ON/6138/reg_0918001836-32555.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/6138/reg_0918001900-32555.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/6138/reg_0918001906-32555.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/6138/reg_SANY0049-23087.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/6138/reg_SANY0056-23087.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/6138/reg_SANY0059-23087.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/6138/reg_SANY0060-23087.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/6138/narrow_SANY0064-23087.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/lake-laurentian-conservation-area-near-sudbury-on-6138",
    "stats": {
        "Activities": "snowshoe hike ski-xc mtn-bike",
        "From": "",
        "Seasons": "winter fall summer",
        "Stars": 1,
        "Time": "3 hrs",
        "Total Distance": "23 km",
        "Town": "Sudbury, ON",
        "Type": "out-and-back"
    },
    "title": "Lake Laurentian Conservation Area",
    "trail_id": "6138"
}