{
    "description": "Hike = Difficult due to no switch backs. Hiking boots required.Mount Roche Bonnehomme (Old Man Mountain), Jasper Alberta4.5 - 7 HoursAbout 2 km into the the hike on the right side you will see nice rock formations with a trickling stream. Make sure you take time to stop and look at this (you'll need the rest by this point) The grade is sharp the whole trail,  there are no switchbacks. The first 3 km you'll gain nearly a thousand metres of elevation. Even when the trail passes the treeline and continues up scree, the grade holds steep and straight.You will continue to follow this stream until you reach an old burn area on the mountain (about 1/2 way). After the burn area, the path continues to gain degree of climb as you climb near the \"feather\" of the head band of the Chiefs head. You will find that you enter in to small think groves of fir trees around this point. Make sure you make plenty of noise, since we saw a Black Bear and her cub at the base. There are areas as you start to reach the treeline that have signs of black bear activity, and would be very easy to spook a bear. Again make lots of noise.Once you have made it to tree line you will see some of the most amazing sites of Jasper Town site and Pyramid Mountain. Plus you're only about 30 minutes to the top. At the top prepare yourself for some of the most amazing views in the world. After being to the Alps and New Zealand, I can say that Alberta still has some of the world most amazing views and scenery.Stay at the top for a while, enjoy the flowers and views of Maligne lake. Seriously, enjoy the view, the hike down only takes about 1.5 hours max, compared to the 4.0 hike to the top.This is one of the hardest trails I have completed for hiking purposes, due to the harsh grade of the trail. . . but worth every single grunt.",
    "directions": "This hike starts across the road from the Maligne Canyon Hostels. There is a sign to Maligne Lake, and directly across the road from that you will see a small unmarked path by the drainage ditch.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/6143/reg_RocheBonhomme-6978-23923.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6143/reg_RocheBonhomme-7059-23923.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6143/reg_jasper-town-23923.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6143/reg_roche-bonhomme-2-48195_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6143/reg_roche-bonhomme-3-48195.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6143/narrow_BonhommeMap-23923.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6143/narrow_creek-23923.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6143/narrow_roche-bonhomme-1-48195.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/roche-bonhomme-near-jasper-ab-6143",
    "stats": {
        "Activities": "snowshoe hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 4,
        "Time": "6 hrs",
        "Total Distance": "11 km",
        "Town": "Jasper, AB",
        "Type": "out-and-back"
    },
    "title": "Roche Bonhomme",
    "trail_id": "6143"
}