{
    "description": "Paddling in the Bay of Fundy is always a hit and miss exercise. (rated as moderate) There are several variables to factor in. Tide (some of the highest in the world) and weather come to mind primarily. My recent trip to New Brunswick had my mind set on paddling among \"the Pots\" at Hopewell Rocks. On this day, we had the tides in our favour, but it was a bit windy, with choppy seas. For sea kayaking, it was typical conditions, so we knew this was going to be a go for our three boat crew.\nWe let in, just South of the park along an access road that takes you to the shore. Alternatively, you can find a guided outfitter (Baymount Outdoor Adventures) in the park itself. They also let you launch your own kayak in their space in the park. We crossed routes with a pod of about 15 boats, so it's a popular guided tour.\n \nOur plan was to launch an hour or two before peak tide. (varies by 53 feet)This made launching our boats very easy, because once you rest your boat at the shore's edge, and get it, the water was lapping at the hull for an easy launch. High tide gives you access to the pots, and some fine rock garden paddling. \n \nWith sea chop ranging between 2-5 feet, it was challenging both to take pictures, and to weave among some of the sandstone formations. For the Bay of Fundy, I was surprised at how warm the water was. Never the less, these conditions were not for the inexperienced. Having three of us together, made for even safer paddling, providing a leader and a sweep.\n \nSeeing the Hopewell Rocks (\"The Pots\") is an even cooler experience by kayak. (It's worth doing both.) You can explore shallow sea caves, and meander between small and huge outcroppings. The higher the tide, the easier it was. Given the direction of the winds and getting past the cape, we were able to access some protected waters and take pictures. Some of the sea stacks were getting pretty thin at their bases, and are due to topple in the next few years. Let's hope no one is around when that happens.\n \nThe tides in the region vary enough that you can walk around the base of the pots when it's low, or paddle around them when it's high. The park does a good job showing the dangers of being trapped in the boxed beach before tides creeping in. Lots of warning signs and chained off areas are visible when the tide recedes. At high tide, all those yellow signs are hidden under water, and the area is closed off.\nThis certainly was a highlight to my summer adventures.\nShannon Burt\nEast Coast editor",
    "directions": "Hopewell Rocks Provincial Park is about 30 minutes from Moncton, along Route 114. We accessed our let in by passing the park, and taking an access road at the church. Follow it to the dykes to get 50 feet from the water.",
    "geohash": "f84hd",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NB/6151/reg_DaleHopewellrAug08-0175-23830.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/6151/reg_DaleHopewellrAug08-0184-23830.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/6151/reg_DaleHopewellrAug08-0187-23830.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/6151/reg_DaleHopewellrAug08-0188-23830.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/6151/reg_DaleHopewellrAug08-0191-23830.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/6151/reg_mikes-trip-101-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/6151/reg_mikes-trip-104-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/6151/reg_mikes-trip-106-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/6151/reg_mikes-trip-112-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/6151/reg_mikes-trip-114-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/6151/reg_mikes-trip-118-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/6151/reg_mikes-trip-119-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/6151/reg_mikes-trip-120-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/6151/reg_mikes-trip-124-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/6151/reg_mikes-trip-127-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/6151/narrow_DaleHopewellrAug08-0198-23830.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/6151/narrow_HopeWellRocks08-0002-23830.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/6151/narrow_HopewellKayakAug080033-23830.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/hopewell-rocks-by-sea-kayak-near-hillsborough-nb-6151",
    "stats": {
        "Activities": "sea-kayak",
        "From": "",
        "Seasons": "summer",
        "Stars": 5,
        "Time": "3 hrs",
        "Total Distance": "6 km",
        "Town": "Hillsborough, NB",
        "Type": "out-and-back"
    },
    "title": "Hopewell Rocks by sea Kayak",
    "trail_id": "6151"
}