{
    "description": "Pingu is very similar to Team Pangor with all its woodwork and drops (optional). However Pingu is much shorter then Team Pangor so you may want to consider linking it up with some of the other trails such as; CBC, Corkscrew, Salvation, and Team Pangor for a longer downhill.",
    "directions": "Once you have arrived at the base of Mt. Seymour (see Mt. Seymour A mountain biking overview for directions) Continue up Mt. Seymour Road until you reach Ann MacDonald way, turn left here and in just a few seconds you should see the Old Buck parking lot on your right. You can park here and then bike up the Old Buck trail until you reach the power line trail. Turn left at the power line trail and continue on it for a few minutes until you see the trail on your left with the sign labeled Pingu. Turn left and enjoy.\nIf shuttling is an option for you, you will want to continue up Mt. Seymour Road  until you reach the Vancouver picnic area ( just before the second switchback) turn right and stop in the parking lot. Once unloaded, go out the way you came in and cross the road and go onto the other side of the barriers ( be careful crossing the street as the cars may not be able to stop). Continue right on the gravel path until you reach the trail head for Incline. You can either continue down Incline (easier) or turn left and go down Corkscrew/ Salvation (harder). \nIf you chose Incline, it will take you to the power line trail where you will need to turn left and go along it for about a minute until you reach the trail head for Pingu.\nIf you went down Corkscrew/ Salvation it will take you directly to the trail head for Pingu.",
    "geohash": "c2b89",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/6152/reg_pingu1-thumb-23388.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6152/reg_topo-Pingu1f-23388.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6152/narrow_SRLMKioskoverallsummary-23388.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mt-seymour-pingu-near-north-vancouver-bc-6152",
    "stats": {
        "Activities": "mtn-bike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "1 km",
        "Town": "North Vancouver, BC",
        "Type": "out-and-back"
    },
    "title": "Mt. Seymour - Pingu",
    "trail_id": "6152"
}