{
    "description": "This trail is available in 3, 5 or 10 km flavours.  We took the 5 and it was perfect.  We got incredible views of Lake Bennet and unique perspective on the Yukon's desert.  Don't expect a Sahara, but this area is very interesting.  Lots of distinct plants and animals.  I would do the 10 km trail on a bike for sure.  The trails are actually xc ski trails, but are perfect for hikers and bikers in the summer.  Bring suncreen and bugspray.  Or some product that is a combination of the two, if such a thing exists.  Don't forget your camera either.  The Whit Pass Railway finishes on the other end of the lake.  I highly recommend this trip if you are in Skagway.",
    "directions": "Carcross is a very small town the the \"T\" intersection of the Klondike Highway and Tagish Road.  You could easily bike across town in under 5 minutes, with a flat tire.  The map sign is about 500m behind the school, which is next to the Lake Bennet waterfront park/public beach.  We did this hike in summer, so we parked in front of the school, made our way around the playground fence, and up into the dunes immediately behind the school.  We came to a sign we weren't expecting, and from then on the trails were basically well marked.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/YT/6153/reg_00470007-6465.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/YT/6153/reg_DSCN2865-6465.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/YT/6153/reg_DSCN2874-6465.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/YT/6153/reg_DSCN2880-6465.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/YT/6153/reg_DSCN2881-6465.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/carcross-desert-near-carcross-yt-6153",
    "stats": {
        "Activities": "mtn-bike ski-xc hike",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "5 km",
        "Town": "Carcross, YT",
        "Type": "out-and-back"
    },
    "title": "Carcross Desert",
    "trail_id": "6153"
}