{
    "description": "A glorious valley-edged romp through grizzly wilderness into top notch alpine scenery. The trail is fairly long, but the gentle grade and constant distractions make it easy to plod along. Don't let the presence of bears scare you off - like with any other trail, stay vigilant and avoid stealth.  \r\rThe first 45 minutes is a gentle ascent through shady forest, on foot-pleasing packed earth. Along the way you'll cross a few small rivulets which will be the last of the water until the basin. \rNext, you emerge into more open foilage, with the greener side of the canyon across the valley, where you can cast your eyes in an attempt to spot bears, or at least see the line of the old trail on the hillside. The ground underfoot becomes more rocky, and the trail features the occasional short, no-nonsense switchbacks to improve your height, and view. Up-valley you can glimpse one of the several granite peaks you'll be lounging in the shadow of at trail's end.\r5.5km from the trailhead, you cross a run-off creek and soon thereafter reach a campground (marked only by a barely-standing outhouse and fire ring).\rHere's where things get tricky, only because of some preceeding idiots. The trail proper continues along northward, then suddenly ends at some boulders which feature a series of cairns, lord only knows why. The route the cairns lead through is just as awkward, dangerous and time-wasting as any other you could hope to pick, so to avoid the rock fall altogether, back track 20-30 meters and keep an eye to the west for a faint trail leading to the sound of the creek. It is easy to get over the creek without even seeing the water under the massive rocks, and pick up the still-faint trail on the other side.\rIf you look northwest you'll see a high point of land with a crazy rectangular rock at the top that looks like it should have Wile E Coyote jumping up and down on it, baffled that it won't topple over. There is a faint trail switchbacking up to that ridge, but if you lose it, worry not, it reappears in full strength at the top. \rContinue climbing along the ridge until you reach the trail's high point at about the 7km mark. You are now surrounded by serious mountains. This is a rewarding destination in itself, but if you must press on, here's where you can go (add an hour and 2km to your roundtrip):\rSee the natural scree dam beneath Whitewater mountain? It's the only logical place to hold a lake, and that's what it does. You can eyeball your route up the scree from here. The trail continues a slight descent along the ridge NW and ends at a mining road. From here the scramble to the lake will take roughly 15 minutes.",
    "directions": "East of New Denver or West of Kaslo along Hwy 31A, go to Retallack mining site. There is a dirt road on the north side between old buildings that comes to a wide clearing with an 'all roads lead here' feel. The one you want is at the end and far left of the open space. Stay on the main road from here, there are signs where the way may not be obvious. In a short 4km, arrive at the trailhead.\r",
    "geohash": "c2us",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/6155/reg_DSC05211-20830.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6155/reg_DSC05265-20830.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6155/reg_ww-expanse-1287.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6155/reg_ww-spark-ollie-sm-1287.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6155/narrow_caro-and-peak-1287.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/whitewater-canyon-near-kaslo-bc-6155",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 5,
        "Time": "8 hrs",
        "Total Distance": "15 km",
        "Town": "Kaslo, BC",
        "Type": "out-and-back"
    },
    "title": "Whitewater Canyon",
    "trail_id": "6155"
}