{
    "description": "This trail gets interesting fast, and carries you through varied terrain. Mid July still saw troublesome snowy spots on the steeps, as well as an iced-over lake, I wouldn't venture out here next time until August. The drive to the trail is rather epic, but worthwhile.The first 30 mins of this trail is somewhat cruddy - you follow old mining road, first through cutblock, and then through shadier forest, and it is steep. At the point where you sidle along a streamlet, look ahead and think 'how did anyone ever whip a cart-donkey up THAT??' you will find a short go-round trail on your right.Moments after emerging from this trail, the road is abandoned for a proper boot-beaten path (to the left over a small log bridge). The trail now begins to climb through moist meadows, parallelling a nice cascade for a few minutes. Up and ahead you can see the saddle that is your logical destination - you should arrive there about an hour from abandoning your car.From the saddle, note a low pass beyond the meadow, sandwiched between a steep mountainside and a dark, pyramid-shaped hill (can't miss it). The trail is barely defined, or might be under snow - so feel free to take any route to reach the pass, the trail is distinct again beyond that point.The path, which grows narrow, now climbs steadily at the edge of a steep hillside. If snow remains across the slope, be very, very careful picking your way across. Thirty minutes along this goat route should see you at the high point above a deep pool. Five minutes more has you standing high above a small lake, which I'm sure would be gorgeous once the snow melts - this is trail's end.",
    "directions": "I'll never understand why forest services will sign some forks but not others - and usually the obvious ones. In this case, you get strung along for a while, then utterly abandoned. The road is generally in good shape, but skirts along some sketchy rockslide terrain that has you thinking \"if that goes while I'm hiking, it's a long walk back to civilization' - and there's 28km of it.From New Denver, head north a little over 5km to the East Wilson Creek FSR. 2.8km along (signed) turn onto Hicks Creek Rd. Stay on the main road. At about 12km there is a sign for Dennis Basin but no arrow - they mean for you to go left. The next intersection has a sign for Dennis Basin to the right -stay left again. The road will offer some stunning views of the Valhalla peaks across the lake - which will have you wondering why you aren't hiking there, and why your eyes aren't on the narrow road with the steep drop off. At 22km there is a fork. Counter-intuitively, you go left and descend for a few km. At the next major junction go left across the waterway and begin a slight ascent. Find another junction a few hundred meters later, stay left and ascend. At 28km is a cozy parking area.",
    "geohash": "c2ut",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/6158/reg_IMG-1531-60131.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6158/reg_IMG-1568-60131.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6158/reg_IMG-1615-60131.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6158/reg_alps-lae-1287.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6158/narrow_aa-ollie-beams-sm-1287.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6158/narrow_alps-berg-1287_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6158/narrow_alps-meadow-1287.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/alps-alturas-near-new-denver-bc-6158",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 5,
        "Time": "5 hrs",
        "Total Distance": "10 km",
        "Town": "New Denver, BC",
        "Type": "out-and-back"
    },
    "title": "Alps Alturas",
    "trail_id": "6158"
}