{
    "description": "Le sentier pédestre Chute Neigette / Mont-Comi est une section du sentier National de 15 km. Ce tronçon débute à la chute Neigette (municipalité de Saint-Anaclet) et rejoint le Mont-Comi (municipalité de Saint-Donat)). Ultérieurement, le sentier continuera vers Saint-Gabriel, la Montagne Saint-Pierre (La Rédemption) pour finalement atteindre Amqui, dans la Matapédia, et se connecter au SIA (Sentier International des Appalaches).Le trajet donatien débute au Parc du Mont-Comi (dans la piste Panoramique), rejoint le rang des Écorchis puis se dirige vers la chute Neigette où les randonneurs peuvent profiter d?une vue exceptionnelle sur le fleuve en sillonnant les crêtes (faille Neigette). Il se poursuit dans la MRC Rimouski-Neigette en enjambant la rivière Neigette au niveau de la magnifique chute Neigette. références: http://www.saintdonat.ca/index.php?option=com_content&task=view&id=43&Itemid=30",
    "directions": "Sortie 621 sur la 20 Est. Tourner à droite sur la rue de la Gare à St-Anaclet. Tourner à droite sur la rue principale (en face de l'église). Tourner à gauche sur la route Neigette et continuer jusqu'au bout. Tourner à gauche sur le 1er rang de Neigette E. Tourner à droite sur la route du Fourneau-À-Chaud et le stationnement sera à gauche.Pour plus d'informations, cliquer sur le lien des références suivant: http://www.saintdonat.ca/index.php?option=com_content&task=view&id=43&Itemid=30",
    "geohash": "f2x",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/QC/6161/reg_DSCF0002-23902.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/6161/reg_DSCF0015-23902.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/6161/reg_DSCF0017-23902.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/6161/reg_DSCF0021-23902.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/6161/narrow_DSCF0010-23902.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/sentier-national-portion-chute-neigette-mont-comi-near-saint-donat-pq-6161",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "winter summer",
        "Stars": 4,
        "Time": "6 hrs",
        "Total Distance": "13 km",
        "Town": "Saint-Donat, PQ",
        "Type": "out-and-back"
    },
    "title": "Sentier National portion Chute Neigette / Mont-Comi",
    "trail_id": "6161"
}