{
    "description": "Moraine Lake Trail basically runs parallel to the Moraine Lake Road from the Lake down to nearly Lake Louise Road.  I'd never heard of it but did it today and It. Is. Great!  21 km of up and 10 km of totally doable downhill.  Actually great, flowey, sublime downward heading trail.  You could hear the Whoops of delight for miles.\nSeveral crossings (all on big safe bridges) of cascading, mountain streams and rivers.  Very good for pictures.\nParks Canada says: \"The most demanding of the Lake Louise area trails, this single-track trail climbs onto the shoulder of Mount Temple and then descends to Moraine Lake. Combine with Moraine Lake Road (#9) to make a loop. When buffaloberries, an important bear food, ripen in mid to late summer, the upper section of this trail is closed to all users. This allows grizzly bears to forage undisturbed and keeps people safer. Be prepared to turn around at the closure. Check with Lake Louise Information Centre staff and trailhead signs for closure dates and important information.\"\nTo get up to it I suppose you could shuttle it but the Karma Gods would prefer you ride up anything you ride down.  Or at least ride up to anything you ride down.  (And the Karma Gods likely include Parks Canada.  I would guess if this gets a buncha shuttlers doing the *&@#* out of it, it will join the many other trails closed to bikes)\nWe did the latter.  We rode up Tramline trail starting at the lower parking lots just across the tracks from Lake Louise townsite (across the street from the train themed restaurant).  So up Tramline, cross Lake Louise road, stay on Tram until you cross Moraine Lake Road.  Turn left and follow the Morain Lake road to, oddly enough, Moraine Lake.  Stop.  Smell the flowers.  Have lunch.\nJust to the parking lot side of the day lodge/store/thingee you will see the trailhead crossing a little wooden bridge and heading off up the hill.  Start riding.  You will have another 5.9km of \"The downhill starts just around the next corner\" from your buddy / tour guide.  Finally you might see a little rust coloured lake off to the left through the trees, this is THE top.\nStart riding down.  A great assortment of roots, rocks, dirt, turns, berms, you name it.  Easy to follow, all other trails in the area have the usual NO BIKES signs.  You'll come back out on Moraine Lake road.  Turn Left for 1km and back down Tramline to the parking lot.  \nDO THIS TRAIL!",
    "directions": "CPR Train Station in Lake Louise. Get to Lake Louise (you know, the one 150km West of Cowgary), take the main street across the highway overpass, past the village, through the 4way stop sign (after stopping)  under the train tracks, and take your first right. We're talking maybe 500m from the highway. Follow this road 500m until you see 2 parking lots on the left side just before the old train station/restaurant. Take the 2nd one if possible, trail head is at the far end.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/6163/reg_IMG-3054-Small-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6163/reg_IMG-3058-Small-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6163/reg_IMG-3059-Small-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6163/reg_IMG-3062-Small-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6163/reg_IMG-3066-Small-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6163/reg_IMG-3068-Small-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6163/reg_IMG-3088-Small-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6163/reg_IMG-3109-Small-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6163/reg_IMG-3122-Small-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6163/reg_moraineProfile-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6163/narrow_IMG-3076-Small-6828.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/moraine-lake-highline-trail-singletrack-near-banff-ab-6163",
    "stats": {
        "Activities": "mtn-bike ski-xc ski-bc hike snowshoe",
        "From": "",
        "Seasons": "summer fall winter",
        "Stars": 4,
        "Time": "4 hrs",
        "Total Distance": "32 km",
        "Town": "Banff, AB",
        "Type": "out-and-back"
    },
    "title": "Moraine Lake Highline Trail - (Singletrack)",
    "trail_id": "6163"
}