{
    "description": "One of the dedicated MTB trails at the Canmore Nordic Center, the orange loop is also part of the 2009 24 Hours of Adrenaline course.  It is somewhat demanding especially depending on the pace.  There are some long climbs, some medium descents, rocks, and roots that are waiting for you.  Generally a decent dirt surface and if it's been wet, you want some good traction.  \r\rOne particular root had my name on it and knocked my tire bottom sideways while I kept moving in the original direction.  I still have dirt embedded in both elbows.\r\rI can't call this flowey.  I'd go so far as to say choppy.  So you don't get to cruise over much of it, you're working the whole thing.\r\rI'm glad I did it and would probably do it once or twice a year if some friends were Jonesin' for it, but it's not my favorite.\r\rThis trail starts at:\r",
    "directions": "All trails leave from the Canmore Nordic Center which is 3 km from down town Canmore. \r\rFrom Calgary:  Go West till you see many big signs saying CANMORE.  Go through town and follow the very ample signage to get there.  For those in the know, take the 3 Sisters exit/parkway to save some traffic woe.\r\rThe Canmore Nordic Centre Provincial Park is within a 90-minute drive of Calgary's International Airport and just five minutes from the amenities of the Town of Canmore. The Canmore Nordic Centre provides exceptional winter cross-country skiing and summer mountain biking experiences. \r\rA Day Lodge offers a relaxing atmosphere, enhanced by the large stone fireplace, comfortable seating, and picture window views of soaring Mount Rundle. Other services include a cafeteria, meeting rooms, maps and information, day lockers, showers, washrooms, equipment rentals, and lessons. \rMiette Pass \rTonquin Valley \rKakwa Lake Trail \rWalking directions are in beta.\rUse caution ? This route may be missing sidewalks or pedestrian paths.\r\r Rocky View No. 44, AB, Canada \r\r89.8 km (about 1 hour 11 mins)\r1. Head south on Symons Valley Rd toward Twp Rd 264 5.0 km \r2. Turn right at Twp Rd 261A 3.6 km \r3. Turn left at 85 St NW 6.2 km \r4. Turn left at Country Hills Blvd NW 0.9 km \r5. Turn right at Stoney Trail NW S 6.9 km \r6. Take the TC-1/16 Ave N ramp to Banff 0.6 km \r7. Merge onto HWY-1 W 62.5 km \r8. Exit onto 1X Hwy 4.2 km \r\r Kananaskis, AB, Canada \r",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/6164/reg_IMG-3016-Medium--6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6164/reg_IMG-3024-Medium--6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6164/reg_IMG-3041-Medium--6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6164/narrow_IMG-3018-Medium--6828.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/canmore-nordic-center-orange-loop-near-canmore-ab-6164",
    "stats": {
        "Activities": "mtn-bike",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "9 km",
        "Town": "Canmore, AB",
        "Type": "out-and-back"
    },
    "title": "Canmore Nordic Center - Orange Loop",
    "trail_id": "6164"
}