{
    "description": "Cape Scott is a hike-in park, located at the northwestern tip of Vancouver Island. A parking lot at the Cape Scott and San Josef Bay trailhead near the southeast corner of the park is on Western Forest Products land and is provided by the company for the convenience of park users. The lot, which is located 64 kilometers west of Port Hardy, can be reached by driving on a combination of public highways and private, active logging roads.\r\rLength 23.6 km from the trailhead. Average one-way hiking time: 8.5 hours. The public may visit the lighthouse, which is outside the provincial park and federally operated. The Federal Government has removed the suspension bridges and closed all public access between the lighthouse and foghorn at the Cape itself.  The trail itself is not overly difficult and after the first few hours it's almost completely flat, but can be extremely muddy and slippery.  Be prepared for wet weather and in spring puddles up to the knees.  Water sources and availability are very limited. Ensure you carry an adequate supply of water.\r\rLots of history on the trail.  Three native peoples; the Tlatlasikwala, Nakumgilisala and Yutlinuk shared the Cape Scott area prior to European settlement.  In the early 1900s Danish settlers tried twice to establish a self governing, culturally distinct farming and fishing community.  During War II a small radar station was built here.",
    "directions": "To get to the Cape Scott parking lot and trailhead, you head towards Port Hardy on Northern Vancouver Island, highway 19 north. Just before you actually enter Port Hardy, follow the signs and turn left towards Holberg. It is recommended that you have a full tank of fuel at this point, because the Holberg gas station is often closed or out of fuel. Once you turn left off of the highway, there will be signs leading the rest of the way. The road turns to gravel shortly off of the highway, and you must watch out for logging trucks. Obey all posted signs.  Keep you eyes open for the \"shoe tree\" or \"sole tree\" on your right near a lake about 15 minutes down the road. Holberg is the only town you will see. Once you reach the trailhead, you park where you can and head off.  If you are going for an extended hike, it may be worth while to park your car at the boat launch. There was a man living there who would watch your car and belongs for a donation, which is a good idea since car break-ins have been known to happen at night.",
    "photos": [],
    "source_url": "https://trailpeak.com/trails/cape-scott-provincial-park-near-port-hardy-bc-6169",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 4,
        "Time": "14 hrs",
        "Total Distance": "48 km",
        "Town": "Port Hardy, BC",
        "Type": "out-and-back"
    },
    "title": "Cape Scott Provincial Park",
    "trail_id": "6169"
}