{
    "description": "Driftwood Provincial Park is a beach front park on the Ontario side  directly opposite the mouth of the famous Dumoine River.  The Dumoine, with over 100km of mostly runnable river, is world famous and a treasure for Ontario paddlers and visitors.\nOn this trip, we simply explored the mouth of the Dumoine and parts of the Ottawa river by sea kayak, making for a nice 3-4 hour paddle and a taste of the terrain.  The water is clean, the river banks steep, rising up to cliffs and peaks 500 to 600 feet above you, it's a very pretty paddle.\nFor us, it's all flatwater, in sea kayaks, to the first falls on the Dumoine, some 5km up the river.  It's a really easy paddle, possibly the biggest waves are out on the open Ottawa river, but that's maybe a 1-2km paddle max.\nWhat makes this paddling trip really easy is that you have pretty ideal car camping right on the beach at Driftwood Provincial park.  In other words, just camp on the beach, unload the boats, hang out on the beach.\nLots of families and those who like to fish with small powerboats also abound, but once you get up the Dumoine a bit you really don't come across a lot of traffic.",
    "directions": "Take Hwy #17 past Pembroke, Petawawa, Chalk River, Deep River, and finally, before the small village of Stonecliffe, on the right is Driftwood Provincial Park, a rather large bay on the Ottawa.  Reserve early if you want beach front camping, else, suffer the mosquitoes hanging out in the bushes on the other side of the road.  About 2.5 hours drive from Ottawa.",
    "geohash": "f20",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/ON/6172/reg_IMG-0001-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/6172/reg_IMG-0002-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/6172/reg_IMG-0003-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/6172/reg_IMG-0005-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/6172/reg_IMG-0006-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/6172/reg_IMG-0007-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/6172/reg_IMG-0008-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/6172/reg_IMG-0009-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/6172/reg_IMG-0010-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/6172/reg_IMG-0011-5.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/driftwood-to-dumoine-river-falls-near-deep-river-on-6172",
    "stats": {
        "Activities": "river-kayak river-canoe sea-kayak",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 4,
        "Time": "4 hrs",
        "Total Distance": "12 km",
        "Town": "Deep River, ON",
        "Type": "out-and-back"
    },
    "title": "Driftwood to Dumoine River Falls",
    "trail_id": "6172"
}