{
    "description": "Cedar Lake and the outfitter at Brent make for a perfect start to an Algonquin Park adventure.  We entered Algonquin from the quieter northern entrance / gate, remarking the whole drive into Brent about the large forest and trees.  You know you are entering wilderness, everything seems to get bigger and wilder.\nAs you make your way on the gravel road off Hwy #17 a some  20 minute drive past Stonecliffe (we camped at Driftwood Provincial Park the night before), you turn left at Deux Rivieres and then drive another 45 minutes or so some 41km to the Brent encampment on the shore of Cedar Lake.  It's a historical camp, where 1930's style ranger (forest fire rangers and lumbermen) cabins still exist, in fact, they've been refurbished and the general store / outfitter is itself a museum, with supplies and canoe rentals all mixed together with antiques, old tools, and various other area memoirs. If you want a glimpse into remote bush life in the early days of Algonquin, this is a great stop, and, many use it to access the more remote lakes of the park.  The Brent Crater, a giant meteorite with a hiking trail through part of it is also nearby, so hiking opportunities (not just portages) abound.\nThere is lakeside car camping at Brent, cottages, and plenty of space to leave your car as you pack up and head out on Cedar lake possibly up the Petawawa river or half a dozen other routes that cross this area.\nOn this trip, a simple over nighter, we really only had time to explore the lake and find a camp-spot on the lake itself.    Pure water, rolling hills in the distance, and, a large body of water with Islands make for a great paddle.  If you have the park map, you'll see a dozen camp sites on the shoreline, and, we passed up one such idyllic camp site with it's own beach in favour of a windier (less bugs) Island camp spot nearby, also ideal.\nWith a breeze coming over the tip of the Island where we were camped, there were no deer flies and the mosquitoes stayed quiet.  Until about 9:30 p.m. that is, then all hell broke loose, and we scrambled for our tents. I must admit, I did buy \"the Executioner\"at the Brent Store, a tennis raquet sized bug zapper which provided endless entertainment for some time until the mosquitoes overpowered us.  But take heart, they are really bad only for about an hour so if you escape to your tent, you can re-emerge for more campfire fun or just call it an early nite.  If someone in the group has a mesh tent, this is a good idea for post 9 p.m. dinners.\nAll in all, a great lake with a full day of paddling around it's perimeter, exploring the shoreline, and the river inlets.  With more time, we would have gone up the Petawawa some distance, but were content with our quiet camp site and the tall pines of our own Island for the evening.\nYou will have to purchase an Algonuin park pass and back-country camp permit and you'll see the park office as you drive along the dirt road.",
    "directions": "From the east, take Hwy #17 past Stonecliffe, then left at Deux Riveres and drive 41km on superbly graded road to the Brent outfitter to rent canoes/kayaks.  Note: There perimeter of the park still has active logging, watch out for logging trucks. Many start their Algonquin paddle journeys here.\nFrom Mattawa: The Brent turnoff is 37km east of Mattawa on the Trans Canada (Highway 17) just before Deux Rivieres. Look for the sign. Proceed 41km south into Algonquin Park to beautiful Cedar Lake and when you come to the campgrounds proceed east to the store for directions.\nIf you turn right at the campgrounds you can see the lumbermen's cemetery. It is a memorial to 9 lumbermen who drowned while going to a lumber camp. They went through the sluiceway in a log dam by mistake, expecting it to be closed. There is a host at the campsite who can answer questions. There is a boat launch and the fishing is great. \nCanoes and other equipment are available at the store if you are so inclined or are stopping longer than 1 day. For further information on the store check their Brent website Algonquin Outfitters Brent Store, where there are details on the history of the store and on Jake Pigeau the manager. Copies of our book \"My Childhood in the Bush\" are available at the store. The Rangers' Cabin holds 12 and was $75 per day in 2000 ($500 a week). Call 1-888-668-7275 for reservations. It is not available on the Heritage Day Weekend.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/ON/6174/reg_IMG-0012-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/6174/reg_IMG-0013-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/6174/reg_IMG-0014-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/6174/reg_IMG-0015-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/6174/reg_IMG-0016-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/6174/reg_IMG-0017-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/6174/reg_IMG-0018-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/6174/reg_IMG-0021-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/6174/reg_brentIsland-5.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/cedar-lake-brent-algonquin-park-near-mattawa-on-6174",
    "stats": {
        "Activities": "river-canoe sea-kayak",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 3,
        "Time": "4 hrs",
        "Total Distance": "9 km",
        "Town": "Mattawa, ON",
        "Type": "out-and-back"
    },
    "title": "Cedar Lake (Brent) - Algonquin Park",
    "trail_id": "6174"
}