{
    "description": "A great double-track eventually getting onto Single-track ride that gets you well into the front ranges of the Rockies with GREAT views of surrounding peaks and Flat Creek, little waterfalls and all the trapping you would have on your 'To See' list.  About 350m of climbing over the first 14km (one way) where we stopped.  There is reportedly much more to see so keep going another 5km until the headwall created by the Highwood Range including Pyriform and Junction Mountains.\nEasy to find trailhead, but there is a BIG 'NO TRESPASSING' sign there, if you stay on the road allowance, you can use the ROAD.  At 8.0km you will pass a cattle guard whereupon you will be in Kananaskis Country and can (responsibly) use the rest of the land as well.\nThe trail is very easy to follow, the only catch (that we all fell into) is at 10.0km you will see the 'main' trail head off down a steep gravel hill and cross a little bridge.  Don't go there (unless you want an additional 60m of climbing / cardio), all you will find is 2 abandoned oil wells and a dead cow.  (Honest, just on the other side of the fence on the far side across from where you enter the lease.  And there was another eviscerated cow head on the side of the trail back aways.  It.  Smelled.  Pretty Crappy.\nSo take the grassy route up the hill to the right, keep pedaling.  You'll follow the creek for a while, see some small water falls, etc.  Stop and smell the water.  Flowers too.\nAt 14.4km you'll get your toes wet.  There is an obvious path to the creek but before that you see a less obvious path that makes you think you're riding up a small tributary creek.  Go that way and there is a rideable ford of the creek.  Keep going.  That's were we stopped but I expect better from you.\nEditor's note:  Well we did it again to the (locked - don't expect to spend the night there) Spruce Bluff cabin at 17km.  New GPS data attached.  And on the way out, we did the Wileman Creek / Grass Pass option to Sentinel Day Use area (GPS data for this leg in separate trailpeak entry).\nEditor's note Part 2:  Well we did it again again to the (locked - don't expect to spend the night there) Spruce Bluff cabin and then up and around Sullivan Pass and High Rock Ridge.",
    "directions": "Drive to Longview (75km SW of Calgary on Hiway 22).  At North end of Longview there is Secondary hiway 541 going West.  Follow it 21.0 km.  You're there.  It is just a gated road, not a big parking lot.  Park on the allowance or possibly in the ditch",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/6177/reg_IMG-3130-Small-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6177/reg_IMG-3136-Small-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6177/reg_IMG-3139-Small-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6177/reg_IMG-3144-Small-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6177/reg_IMG-3148-Small-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6177/reg_IMG-3150-Small-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6177/reg_IMG-3162-Small-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6177/reg_IMG-3166-Small-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6177/reg_IMG-3179-Small-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6177/reg_IMG-3457-Small-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6177/narrow_IMG-3132-Small-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6177/narrow_IMG-3172-Small-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6177/narrow_IMG-3451-Small-6828.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/flat-creek-near-longview-ab-6177",
    "stats": {
        "Activities": "hike ski-xc mtn-bike",
        "From": "",
        "Seasons": "winter fall summer",
        "Stars": 3,
        "Time": "4 hrs",
        "Total Distance": "38 km",
        "Town": "Longview, AB",
        "Type": "out-and-back"
    },
    "title": "Flat Creek",
    "trail_id": "6177"
}