{
    "description": "As the name suggests, Wiessner Woods is almost entirely forested.  There is a small portion of meadow visitors must pass through to get from the parking area to the trail head.  The forest is a mature stand of hardwood and softwood trees including hemlock, spruce, white pine, maple, beech and birch.  Several small streams traverse the property created periods of standing water during spring run-off.  The property contains an extensive network of trails including a portion of the Catamount Trail which connects to trails on the adjacent Gameroff and Edson Hill properties.\r\rWiessner Woods is open to the public for pedestrian recreational use including hiking, snowshoeing, cross country skiing and dog walking.  In accordance with the wishes of the donor hunting, motorized and mechanized recreation is not permitted. \r\rMuddy in Spring.",
    "directions": "Simply park here: N44.49696 W72.72696\r\rFrom Stowe Village, take Route 108 (the Mountain Road) 3.5 miles to Edson Hill Road.  Turn right onto Edson Hill ROad, pass the entrance to Stowehof Inn and take the next drive on your right.  Park in the Wiessner Woods parking lot (please do not park alongside the road) on the left and follow signs to the trail head.",
    "geohash": "drum1",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/VT/6179/reg_022-38365.jpg",
        "https://trailpeak.com/storage//content/trails/US/VT/6179/reg_041-38365.jpg",
        "https://trailpeak.com/storage//content/trails/US/VT/6179/narrow_034-38365.jpg",
        "https://trailpeak.com/storage//content/trails/US/VT/6179/narrow_055-38365.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/wiessner-woods-near-stowe-vt-6179",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall winter",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "3 km",
        "Town": "Stowe, VT",
        "Type": "out-and-back"
    },
    "title": "Wiessner Woods",
    "trail_id": "6179"
}