{
    "description": "The West Coast Trail (WCT) is a 75 km (47 mile) long backpacking trail following the southwestern edge of Vancouver Island in British Columbia. It?s open from May 1 until September 30 and is part of the Pacific Rim National Park Reserve.  It has been rated as one of the best hikes in the world. The trail is extremely rugged and requires a high level of fitness, knowledge and skill to complete.  To cross some rivers and streams, hikers may have to ride cable cars or wade across; others are bridged by fallen logs or suspension bridges. There are two boat crossings on the trail:  Nitinat Narrows, near the midpoint of the trail, and Gordon River, at the southern trailhead.  The trail includes dozens of ladders, some of them 30 feet high, that hikers must ascend or descend. Hikers are shown how to read the tide tables at the mandatory orientation session and must be aware of the tides for some of the beach routes. The trail itself winds through forests, bogs and beaches. It passes old growth trees, waterfalls, streams and thick patches of deep mud. Along the coast, the trail includes sand and pebble beaches, headlands, and exposed shelf and boulders at low tide. The trail often diverts inland to avoid dangerous surge channels and impassable headlands, where cliffs descend straight into the sea even at low tide.  Wildlife that can be encountered include cougars, bears, wolves, orcas and gray whales, seals, sea lions, and eagles. There are also abundant tidal pools on the beach portions, where hikers can see a variety of mollusks, sea anemones, and fish. Designated campgrounds along the way feature \"bear boxes\" for safe storage of food, an outhouse (many of them composting latrines) and usually a stunning view of the Pacific Ocean and Olympic Peninsula. Often, there are two choices, the inland route or the beach route. The beach sections can be made impassable by high tides; tide tables are issued with maps by Parks Canada staff to all hikers prior to starting the trek.",
    "directions": "Hikers can choose to begin the trail in Port Renfrew and hike north, or in Bamfield and hike south. They can travel to and from either trailhead by trail bus, water taxi or by float plane from several cities on Vancouver Island (Victoria, Nanaimo, etc). More information can be obtained from Pacific Rim National Park Reserve at http://www.pc.gc.ca/pn-np/bc/pacificrim/co/visit/index_e.asp. My Journal:Day 1 (Pachena Bay Trailhead to Darling River - 14 kms / 5.5 hrs):  Rated easy.  Weather gray and overcast with a couple sunny breaks towards late afternoon; cold at night.My friend, Julianne and I caught the West Coast Trail bus at 6:30 a.m. in Victoria and arrived in Bamfield at 12:40 p.m.  It was a long but scenic ride on paved roads to Port Renfrew and then bumpy, gravel logging roads to Bamfield.  The ?Adventure Boss? (bus driver) was friendly and accommodating and we saw two bears along the way.  Weighed our packs at the WCT Registration Centre (Julianne 31 lbs and me 25 lbs, including water and 7 days worth of food), and after the mandatory Parks Canada orientation with ?The Family of 8? (4 adults and 4 children, the youngest of whom was 9 years old!), we hit the trail on our only gray, overcast day of the hike.  Made a wrong turn onto the beach then climbed our first set of ladders, including the second longest one on the WCT. We were immediately blown away by the lush, green rainforest ? huge jungle-like trees, tangled vines, oversized ferns, soft green mosses and bayou-like bogs.  Even the bird sounds were different from back home in Nova Scotia.  We visited Pachena Point Lighthouse and took a break at Michigan River campsite where we used the first of many unique composting latrines along the WCT.  Chatted with a hiker on the last night of his hike who told us the WCT was ?Awesome!? THAT turned out to be an understatement ? it was way beyond awesome; beyond breathtaking; beyond spectacular! But I digress ? I loved the colourful buoys hanging from the trees in the late afternoon sun at Michigan River; these would be our trail markers for beach accesses and campsites for the next seven days.  Saw plenty of mud but the trail was easy, and we walked the last 2 km on the beach to Darling River campsite where we spent the night alone.  Guess everyone stopped at Michigan River.  From our campsite, we had a ring-side view of the ocean and the sound of the waves lulled us to sleep; it was a good first day. Day 2 (Darling River to Tsusiat Falls ? 14 kms / 6.0 hrs):  Rated easy to moderate.  Weather fog in the morning lifting to sunshine and clear blue skies; cold at night.The tides were in our favour so we walked the sandy beaches and rock shelves of low tide for the first 2.5 km out of Darling River.  Met up with ?The Family of 8? who became our trail mates and friends over the next six days.  We left the beach and walked the length of a long log incorporated into the trail, then climbed up the side of a cliff using the roots of a tree for foot and hand holds.  We chatted with staff at the Quu?as Patrol Cabin near Tsocowis Creek and stopped for photos at the Donkey Engine.  We took our first and longest cable car ride across Klanawa River on the zip line, and man o? man, but it was fun!  Also, crossed a suspension bridge and descended LOTS of ladders down into Tsusiat Falls campsite.  The Falls were absolutely breathtaking and we had a lovely campsite on the beach protected by huge driftwood logs and an overhanging tree.  To get to the latrine in the woods, we had to climb up and over a HUGE barrier of drifted logs.  But we soon learned that this is how you get to most of the latrines along the West Coast Trail. Day 3 (Tsusiat Falls to Cribs Creek ? 16 kms / 8.5 hrs):  Rated moderate.  Weather same as yesterday (hot on the beaches in the afternoon).This was our longest and most spectacular day on the West Coast Trail.  As we left the campsite, Tsusiat Falls were even more pretty than they were the night before, shrouded in morning mist with rays of sunshine shining through.  We timed our start so we could walk the beach on the low tide and go through The-Hole-in-The-Wall.  On the way, we saw a huge bald eagle perched on a rock.  The scenery on the West Coast Trail is equally as beautiful in the fog as it is with clear skies and constantly changing -- boardwalks amongst jungle trees and lagoon-like bogs one kilometre; sandy beaches, rock shelves, blue ocean water and white crashing waves the next.  We leap-frogged The Family of 8 for most of the day, and crossed beautiful Nitinat Narrows on the ferry.  Spent 1 ½ hours at the ferry dock/restaurant feasting on salmon with baked potato and local crab sold by the ferry operator and talking trail with 20 or 30 other hikers.  Crossed a suspension bridge and filled up at the spring near Clo-oose.  Water was scarce and the trail was voluntarily closed and detoured due to bear sightings in this section.  Came to our first and most dangerous surge channel at Dare Point, appropriately named because you have a choice:  (a) to dangerously climb out onto the slanted rocks and go around the Point with the waves crashing in the surge channel right below your feet; or (b) to semi-safely use the rope and climb up and over the rock face.  We chose the latter with Julianne going up first, then hoisting the two backpacks up behind her (tough job!), and then I climbed up last.  The Family of 8 (kids and all) daringly opted to go around the Point with the help of the men.  Arrived at Cribs Creek in the evening sun ? another beautiful campsite on the beach with colourful buoys hanging from the remains of a weather-beaten, old tree.  We met one of ?The Guys? (also southbound) at Cribs Creek and shared the same campsites with them and The Family of 8 for the rest of the hike.   Day 4 (Cribs Creek to Walbran Creek ? 11 kms / 5.0 hrs):  Rated moderate.  Weather same as yesterday and the day before that.Took advantage of the tides and spent most of the day hiking on sandy beaches and rock shelves.  We saw fresh cougar and wolf tracks in the sand as we left Cribs Creek and heard the sea lions near Carmanah Lighthouse but couldn?t see them because of the fog.  We saw some seals quietly watching us from the water as we watched them from the shore.  The sedimentary rock formations look moonlike and eerie in the morning mist, reminding me of volcanic rock with bubble-shaped pockets and holes.  Checked out the whale bones at the lighthouse and then descended down to the beach and Chez Monique?s at Km 44.  Chez Monique?s is a really neat place that serves up breakfast and huge delicious burgers, chocolate bars, candy, fruits, vegetables, pop, beer and wine.  They also have a hiker drop-off box for extra food and supplies.  We both ordered burgers with the works and they were worth every penny!  At Carmanah Creek, we could have waded across but decided to take the cable car just for the fun of it.  Then came the long 4.5 km slog in soft sand to Vancouver Point, the roughest stretch of the entire hike as far as I?m concerned.  We waded across Walbran Creek to the campsite where the tents are nestled cozily in the spaces and pockets of a huge log jam on the beach.  To visit your neighbor, you climb up on the jam, then hop from log to log to their campsite and climb down into their site.  We saw a whale breaching and blowing just offshore in the evening sun but couldn?t tell if it was an orca or gray whale.   Day 5 (Walbran Creek to Camper Bay ? 9.0 kms / 5.5 hrs):  Rated difficult.  Weather same as yesterday and the day before that and the day before that.Today was an inland hike through the forest with ladders, ladders and more ladders and plenty of mud as well!  In fact, we?d heard horror stories about this section and someone told us there were 35 ladders between Walbran Creek and Camper Bay.  Not sure if that?s true but there certainly are A LOT!  According to the literature, this section is rated difficult and I can only imagine how treacherous and slippery those ladders and boardwalks would be in the mud and rain.  But we had great weather and only found it moderately difficult at best.  Mostly, our legs got tired from ascending and descending so many ladders (it pays to be in good shape and pack light on this trail).  After ascending the ladders from Walbran Creek to the higher plateau in the forest, the trail was muddy but fairly easy as far as Logan Creek.  Then we descended down, ladder after ladder to the long, skinny, swinging, swaying plank suspension bridge across the creek.  And then we ascended back up, ladder after ladder to the high plateau.  From Logan Creek to Cullite Creek, we walked through a large bog on LONG logs converted to boardwalks and traditional boardwalks as well.  Took another fun cable car ride across Cullite Creek and had an easy but muddy hike to Sandstone Creek, where we descended more ladders and crossed the creek.  At one point, we heard something that might have been a cougar so we made lots of noise and kept on moving.  Finally, we descended one last set of ladders to the campsite at Camper Bay, a lovely spot with views of the Rocky Mountains including snow-capped Mount Baker.  We spent the afternoon relaxing and sharing stories with our trail mates, including the Family of 8 and The Guys.  We learned that some of The Guys have now hiked the WCT 16 times! Day 6 (Camper Bay to Thrasher Cove ? 8.0 kms / 5.0 hrs):  Rated difficult.  Weather same as yesterday and the day before that and the day before that and the day before that.In order to climb the boulders between Owen Point and Thrasher Cove, the tides have to be lower than 1.8 metres / 6.0 feet so we decided to wait it out and hike the afternoon tide.  We?d heard Camper Bay to Gordon River would take about 1 hour per km and so we allowed about 7 hours to Thrasher Cove.  Crossed the creek at Camper Bay and immediately started ascending the ladders (as usual!).  That day, the forest route was a little more challenging ? some elevation changes, lots of mud, tree roots, and tilting, rotting boardwalks.  We got to Beach Access A in far less time than we expected so we kept to the woods and hiked on to Beach Access B.  When we came out of the woods, the ?beach? was magnificent -- a moonscape of craters and pocked rocks all the way to Owen Point.  We ignored a sign bolted into the rock floor that said ?Do Not Enter? and used ropes to get around a very slanted section of rock on what would have been a dangerous surge channel, had the tide been in.  On the other side we found an even BIGGER ?Do Not Enter? sign next to a detouring trail ? Oh well; next time.  Further along, we did another rope assisted section, saw some otters, and then from there, we waked a rock shelf ?superhighway? all the way to Owen Point.  When we arrived, the tide was too high and so we settled in for a long wait.  We watched a pod of sea lions lazing on the rocks offshore and seals played in the water right in front of us.  For about an hour, Julianne read her book; I attempted to paint Owen Point.  Then we found the ropes!!  And off we went ? straight up the cliff using the ropes on one side; over the top of caves; straight down the hand and foot ropes on the other side; down a treacherous little slippery section on our butts; more ropes along a slippery, slanted section and we were on the other side of Owen Point!  Piece of cake!  And the caves were lovely ? dark, damp walls with wide bands of yellow, green and rust sediments.  Next, came the HUGE boulders from Owen Point to Thrasher Cove -- over, under and around for 2.5 kms.  This section demanded unrelenting focus and was pretty slow going.  But after 5 hours of hiking (including a 1 hour wait at Owen Point), we rounded a point of land and there was Thrasher Cove campsite, The Family of 8, The Guys and many other friends we?d made along the way.  We watched the sun go down behind the mountains and ate the last of our food. Day 7 (Thrasher Cove to WCT Registration Centre, Port Renfrew ? 7.0 kms / 4.5 hrs):  Rated difficult.  Weather same as yesterday and the day before that and the day before that and the day before that and the day before that.  BUT this time, we woke up to blue skies & sunshine; no morning fog and no condensation on the tents!  Leaving Thrasher Cove, we immediately ascended at least 4 sets of ladders, and then we did a steep climb on rough trail to the highest point on the West Coast Trail at 71K.  We leap-frogged The Family of 8 all the way to the end and passed many northbound hikers just starting out.  The trail was rougher today ? lots of mud, rocks and roots ? and we had to watch our footing but no monstrous changes in elevation.  Stopped at the Donkey Engine and then barreled on to Gordon River where we caught the ferry and with that, our West Coast Trail hike was officially over.  From there we walked 2K on the roads to the WCT Registration Centre near Port Renfrew where we weight our packs (Julianne 21 lbs and me 15 lbs, including water and no food), and said goodbye to the Family of 8.  Then we waited for our ride to take us to Victoria and home sweet home!Bottom Line:Truth is, we didn?t find the West Coast Trail all that difficult.  But we got lucky ? the weather was perfect; the tide tables were right; we packed really light and we were in good shape.  Plus, we?re experienced backpackers who come from good Maritime stock where steep changes in elevation, mud, rocks, tree roots, sand and rain are the norm on a coastal trail. Highly recommend hiking north to south (Bamfield to Port Renfrew) so your pack will be lighter by the time you reach the difficult section after Walbran Creek.  Also recommend gaiters for the mud and sand, and collapsible trekking poles are a must on this trail.  Also, it?s windy on the beaches and it gets unseasonably cold at night so bring a warm sleeping bag and some extra clothes. You?ll see plenty of mud, sand, rocks and tree roots no matter what the weather, and Thrasher Cove to Gordon River is especially rugged. The ladders make the elevation changes easier (IF you?re good shape and pack light), and the boardwalks and beaches make for quick travel.  The suspension bridges are scary, and the cable cars are just plain fun! But, I can only imagine how grueling our hike would?ve been had it rained for seven days which happens often on the WCT ? mud up to our knees, sucking the boots right off our feet.  Slippery, wet climbs up and down the ladders with the mud of our predecessors on our hands, faces and clothes.  Treacherous boardwalks, wet tree roots and muddy rocks to slip and fall on.  Strong winds on the beaches pelting rain into our faces.  Cold and damp all the time, especially at night.  And mud, mud, mud and more mud!  I think THAT?S what rates the WCT as difficult!   And, if you?re afraid of heights like I am; well, just check that at the trailhead and enjoy the many exhilarating, heart stopping moments on the West Coast Obstacle Course, as I now fondly call it.  Can?t wait to go back!",
    "geohash": "c0x",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/6181/reg_Beach-17579.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6181/reg_Boulders-at-Owen-Point-17579.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6181/reg_Buoys-at-Cullite-17579.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6181/reg_Cable-Car-2-17579_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6181/reg_Camper-Bay-17579.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6181/reg_Carmanah-Lighthouse-17579.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6181/reg_Forest-2-17579.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6181/reg_Gordon-River-17579.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6181/reg_Julianne-in-Rock-Pocket-17579.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6181/reg_Julianne-on-Ropes-17579.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6181/reg_Moonscape-17579.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6181/reg_Mud-17579.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6181/reg_Owen-Point-17579.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6181/reg_Rock-Superhighway-17579.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6181/reg_The-Hole-in-The-Wall-17579.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6181/reg_Tsusiat-Falls-17579.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6181/narrow_Cable-Car-3-17579.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6181/narrow_Julianne-on-Suspension-Bridge-17579.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6181/narrow_Ladders-17579.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/west-coast-trail-near-bamfield-bc-6181",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 5,
        "Time": "150 hrs",
        "Total Distance": "75 km",
        "Town": "Bamfield, BC",
        "Type": "out-and-back"
    },
    "title": "West Coast Trail",
    "trail_id": "6181"
}