{
    "description": "Trail rating and time to complete are for cycling (allow 8 hours for hiking and rating of 3).\rThis out-and-back trail from Texas Creek campground to the northern tip of Christina Lake ambles gently through montane ecological zones, on hillsides high above the water. There are wilderness campgrounds at the midway point, and the beach at trail's end.\r\rFor bikes, it's easier to begin on the old road. You've got about 2km of solid climbing before the trail levels off at a wooded plateau of sorts. Go straight at the first 4-way junction, and stay left at the second fork (near the top of the climb).  \rA smooth singletrack then takes you roller-coastering. 500m farther along you'll cross a creek (dry in summer) and shortly after pop out onto a ledge with an open view of the lake. Hikers tend to turn around at this point. \rThe singletrack continues to undulate, alternating shaded forest for open, desert-like bluffs. At about 5.5km (halfway point) there is a trail down to a cove on the water with a small camping area, as well as a trail going higher to a viewpoint. To carry on, stay on the trail that parallels the lake and descends slightly. \rFrom here the trail is somewhat less travelled - wildflowers encroach, jamming into gears, deadfall remains uncleared (parks budget cuts) and there may be rockfall on the trail. There is also a section of narrow track on open slopes that, while not technical, requires steady steering. At about 8km, back in the shady trees, the high route ends and the trail begins its descent to the lake. Many cyclists will turn around here to avoid the grueling climb back out.\rThe descent is immediately steep, but rideable. Once the trail relents at lake level, water from several creeks flows freely. Stay on the main trail, veering left wherever in doubt, and avoiding crossing Sander Creek (the big one) unless aiming for the campground, in which case - follow the signs. After a km of root-hopping and puddle-skirting, the trail finally winds its way to the shore, and a wide, lonely beach (less lonely on weekends when power boaters can jet here sweat-free... incidentally, a boat shuttle at the end is a pretty great idea). \r\r",
    "directions": "Drive east from the village of Christina Lake and watch for signs announcing \"Gladstone Provincial Park\". From Castlegar or Rossland, once you spot the lake coming down the hill, watch for the same sign.\rTurn onto East Lake Drive and follow it to the park and campground boundary. There is a parking area with trail map just before the campground gates. Immediately to the left of this is an old road with a yellow swing-gate - follow this road, staying left at the first junction, signed \"Deer Point Trail\".\rThe 'official' trailhead, though - and maybe a more pleasant route for hikers - starts at site #42. The trails re-unite about 1km along.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/6182/reg_texas-ck-loki.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6182/reg_texas-pt.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/deer-point-texas-creek-near-grand-forks-bc-6182",
    "stats": {
        "Activities": "mtn-bike hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 4,
        "Time": "5 hrs",
        "Total Distance": "22 km",
        "Town": "Grand Forks, BC",
        "Type": "out-and-back"
    },
    "title": "Deer Point (Texas Creek)",
    "trail_id": "6182"
}