{
    "description": "Two major ascents. First day up Windy Joe and second day up Mt. Frosty. the Windy Joe trail goes up an old access road which leads to the top where there is an old Fire Lookout station. Going up the trail, there is a junction. One trail leads up to the lookout and the other is the Pacific Crest Trail and Frosty Trail. Approximately 1 kilometer along the PCT trail is a wilderness campsite with pit toilet, food cache and fire pit. If backpacking, make this the destination, setup camp and then backtrack and go up to the lookout on Windy Joe.\r\rFrom the camp, it is approximately an 8 kilometer hike to the ridge on Mount Frosty. Elevation gain is approximately 2500'. The last two kilometers involve a 1500' elevation gain to the ridge on Frosty. Once on the ridge, you can drop your packs and climb up another 300 feet to a lookout on the top of Frosty. \rDropping off the ridge, there is approximately a 4 kilometer hike to the Frosty wilderness camp. The trail passes through a Larch forest just before the camp. These larches are the oldest trees in British Columbia at approx. 2000 years old yet the largest are just 32 centimeters in diameter.\r\rNext day is the mainly downhill hike back to the starting point.",
    "directions": "Highway 3 to Manning Park. Take the road to the Lightning Lake campground. Before arriving at the campground, there is some parking at the start of the Rein Orchid trail. Leave the car, and follow the trail to Windy Joe.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/6187/reg_on-way-to-frosty-4341.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6187/reg_strike-flash-lakes-4341.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6187/reg_view-from-frosty-4341.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6187/reg_view-from-frosty2-4341.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6187/reg_windy-joe-lookout-4341.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/windy-joe-mt-frosty-loop-near-hope-bc-6187",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 4,
        "Time": "21 hrs",
        "Total Distance": "30 km",
        "Town": "Hope, BC",
        "Type": "out-and-back"
    },
    "title": "Windy Joe Mt. Frosty Loop",
    "trail_id": "6187"
}