{
    "description": "Located at Logan's Pass in Glacier National Park, Mount Oberlin (8,180') offers classic views of the Garden Wall and the surrounding peaks below the western end of the Going to the Sun Road.\nStarting from the interpretive centre, there is a well worn (but unofficial) trail that leads to the summit, ascending 1,500 feet over a couple of miles. Two routes are described in Edward's climbing guide - the southeast route and the Clements saddle route. We took the Clement's saddle route on the way up, which required climbing up a couple of class 3/4 ledges. We actually sought out a cliff face that we played around on and belayed a couple of people climbing up. To descend, we followed the southeast route, which is more or less a straightforward trail hike (class II).\nViews at the summit do not disappoint! The cliffs drop off below and accross the valley the Going to the Sun road clings precipitously to the Garden Wall.\nWhen you get to Logan's Pass, check in with park staff at the interpretive centre. Due to the high volume of visitors at the Pass, there is a possibility of restrictions on travel over the meadows. Your best bet is to do this climb early on in the spring (as soon as the Going to the Sun road is open). That way, you can hike over the snow covered meadows without worrying about trampling the fragile vegetation underfoot. Or better yet, do the approach on skis!\nReference: A Climber's guide to Glacier National Park (J. Gordon Edwards)",
    "directions": "Drive to Logan's Pass on the Goin to the Sun Road. Mt. Oberlin is the modest looking peak to the right of Mount Clements. Look for a faint trail heading to the summit. Check in first with park staff at the interpretive centre to discuss the approach accross the meadows.",
    "geohash": "c2xj",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/MT/6189/reg_IMG-6297-7064.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/6189/reg_oberlinGE-7064.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/6189/narrow_IMG-6292-7064.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/6189/narrow_IMG-6296-7064.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mount-oberlin-near-babb-mt-6189",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 4,
        "Time": "5 hrs",
        "Total Distance": "3 km",
        "Town": "Babb, MT",
        "Type": "out-and-back"
    },
    "title": "Mount Oberlin",
    "trail_id": "6189"
}