{
    "description": "Follow the Seymour peak trail to just before the first pump. You'll see a turnoff with a warning sign. This is when your trail gets a bit tougher. From here its ALL down hill, about 7.5km to the lake and 8km to the camp sites.The first major decent is called Wesley's staircase, once at the bottom it opens up and you cross a rock slide. The trail is pretty spotty but its not bad, eventually you hike into the forest. That lasts for awhile with a bit of up and down and a small lake witch is good to cool down in. There's one more major decent. Its a bit sketchy, kinda like a dried up creek bed. This is about 6km from the Seymour turnoff. You'll make it down towards the Elsay creek which you'll need to cross. It's not too bad if your smart about your steps, or if it hasn't rained in a while. By this time you're well on your way on the last stretch which is a smooth ascent to Elsay Lake. There's an emergency hut on the other side. It's always open. Just be clean! HAVE FUN!!",
    "directions": "The trail start up near the top of Seymour mountain. just fallow the trail signs from the parking lot. For those coming from  the Vancouver direction. Take the mount Seymour pkwy exit after you cross the second narrows bridge turn left and Mount Seymour Rd.If staying overnight you must park in the \"over night parking\" and although there are no signs telling you to pay, you do need to pay for overnight parking.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/6191/reg_DSCF1712-40922.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6191/narrow_DSCF1635-40922_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6191/narrow_DSCF1774-40922.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/elsay-lake-near-north-vancouver-bc-6191",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 4,
        "Time": "10 hrs",
        "Total Distance": "20 km",
        "Town": "North Vancouver, BC",
        "Type": "out-and-back"
    },
    "title": "Elsay Lake",
    "trail_id": "6191"
}