{
    "description": "A short, steep route to the very edge of Valhalla Provincial Park. Strangely shaped peaks and a birds-eye view of Mulvey Lake and basin are the reward on this outing; scrambles to the peak are optional.First, it must be said, the way in is over 40km of dirt road, albeit quality dirt. As there are other hikes in the park, it would make sense to make a weekend of it.The trail starts off benign enough; a gentle wooded path through some shrubbery that soon comes to a bridged creek crossing. After the creek the trail begins to ascend, then soon steepens into treed switchbacks. The slope is not exactly knees-to-chin, but it is unrelenting. In about an hour, you break clear of the trees and continue to climb on more open hillside, soon glimpsing the first sight of the bizarre shark fin that is Mt. Gimli. 30 minutes later should find you at the edge of a talus hill, where a windbreak has been built from shale. The views into the valley are great, as is the looming Gimli. The trail continues directly up to the base of the fin, then two options have been tramped out - one staying high and requiring some scambling, the other dipping lower but exposed to drops.Crawling your way up Gimli is also a possibility, but allow for the extra time and excertion.Note 1: If Valhalla is where brave warriors go after death, they must arrive there as flies - no shortage of small, winged, biting wildlife here.Note 2: Despite all the No DOGS signs, the park boundary does not begin until the very knife-edge of the ridge, so you are on crown land and nobody is allowed to hassle you about your pooch.",
    "directions": "There are two different access points for this part of the park - if coming from Slocan or north check a map. These directions are from Castlegar, Nelson or other points south. Heading north on HWY 6 after Crescent Valley, watch for a sign for 'Slocan Park' - a few KM later on the left will be  Passmore Upper Rd, take this and cross a bridge. Continue straight, the road curves and a sign for Valhalla (40km) greets you. The km markers count down from this end, bear that in mind. Pavement ends soon after. Gravel road is 2wd appropriate, the last 2km of switchbacks to the trailhead have some rock debris, but no big deal.Signs for Valhalla are clear at any major fork - continue along Little Slocan FSR. At about the 22km sign you will come across Little Slocan Lake FS Rec site - a great spot to free camp if doing Gimli or Gwillim lakes. A few meters later is a sign for Drinnon Pass, which is another hike in the park.Continue straight until just after the 15km marker, take a sharp (signed) left to a T intersection that is unsigned, go left again. The km markers now start at 0.At 5km stay right at the ambiguously placed sign. After 10km mark, stay left. Again, most forks are signed unless the main road is obvious.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/6203/long_gimli-view-1287.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6203/reg_gimli-sun-1287.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6203/narrow_P6262305-62934.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6203/narrow_gimli-peak-1287.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6203/narrow_gimli-trail-1287.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/gimli-ridge-near-slocan-bc-6203",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 4,
        "Time": "4 hrs",
        "Total Distance": "8 km",
        "Town": "Slocan, BC",
        "Type": "out-and-back"
    },
    "title": "Gimli Ridge",
    "trail_id": "6203"
}