{
    "description": "Your best bang for the buck in Valhalla country - this trail takes you into high ground quickly, and has no shortage of lakes, tarns, wildflowers and dragon-tooth peaks. Three campsites give several options for overnighting.\nSoon after leaving the lot you cross a beautiful creek with several pools above and below the bridge. The trail then winds gently through valley steeped in greenery, and passes through a large slide-path. A modicum of a trail has been hacked and trampled through the avalanche debris, but stay aware of flagging to keep you on the right path.\nYou then emerge from the valley at a boulder field. If you squint, you can actually see the trail materialize along flat stones. Find the dirt path on the other side - the next, short stone spill is tougher to discern, just aim for where the rock wall meets the plants, the trail reappears shortly below there.\nAfter a short switchback, you suddenly find yourself at Drinnon Lake (45mins from car) and the first campsite. The lake is nice, nothing mind-blowing, but less buggy than the others (which isn't saying much, but less is good, right?).\nThe trail continues left over a small bridge and immediately climbs 100m to the pass, where it levels out through wildflowers. It drops ever so slightly to Wicca Lake and the 2nd campsite. Just as you reach the lakeshore, the trail to the right skirts the shore for a different view, and reaches some tent pads.\nMain trail continues forward and then drops 150m to a swampy basin with a small lake and a few creek crossings (and more than a few buzzing demons). Note - this is where my GPS died.\nTrail continues regardless - at the end of the moist flats, it climbs 250m to the open, meadowy basin of Gwillim Lakes. \nNote - porcupines reign in the parking lot - bring wire for the tires.",
    "directions": "Long, long way on dirt. About 1.25 hours from the highway. 2wd fine until last 2km.\nThe park access from north (Slocan) and south (Castlegar/Nelson) is different,  the following description is from the south. \nTake hwy 6 through Slocan Park and watch for Passmore Upper Rd on the left. Take this and cross a bridge, stay straight at the fork, then road curves north and pavement ends. The km markers count backwards from 45 at this end. All major forks are signed 'Valhalla' to keep you on course - soon you are on Little Slocan FSR. At about 22km marker, come to Little Slocan Lake FS rec site - a nice place to spend a free night camping. Meters later, take a signed left for \"Drinnon Pass\". \nKM markers start at 0 now - again, all unclear forks are signed. A little after km 18, stay left, and then right. Low clearance cars may want to park here, as the 1st km of the next 2 to the lot is downright ugly - reminded me of an old creekbed.",
    "geohash": "c2u7",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/6205/reg_wicca-2-1287.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6205/reg_wicca-lk-1287.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6205/narrow_gwil-bridge-1287.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/gwillim-lakes-near-slocan-bc-6205",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 5,
        "Time": "5 hrs",
        "Total Distance": "12 km",
        "Town": "Slocan, BC",
        "Type": "out-and-back"
    },
    "title": "Gwillim Lakes",
    "trail_id": "6205"
}