{
    "description": "The Dromore Woodland trail system, as of 2009, is a new addition to PEI's collection, and for a fresh change, is not located in the central hilliest region of the province. Noting that, certainly doesn't mean the trail is flat by any means. Three of the four loops find themselves going along or across streams and creeks making for great terrain and visual appeal. In addition of the trail being new, it's also been assigned the IAT designation. (International Appellation Trail)The trail system is new because prior to the grand opening this past June, the only thing that existed was the Birding Loop trail, created by the PEI Forestry department. Now in addition to this, is the South, North and Central Loops, all connected with linear paths. In total, the Dromore Woodland trail system masses roughly 14K with of paths, and occupies 6 square kilometers. This is a great addition to longer length trails. You can spend a good part of the day hiking or snowshoeing the entire circuit.Starting along a dirt road, a trail map indicates where you are, and shows the other loops. The South trail seems to be the easiest and flattest of the set. It's also likely the first trail you'll do, unless you drive up the log road (High Bridge / Campbell Road) to find the other trail intersections. South Loop is at best, according to my GPS, 4K long from trailhead and back. The sign states a longer length. It's a great warm up for what comes next.After completing the south Connector which crosses some open fields, Central Loop really shows what this region has to offer, with streams, and the Pisquid river. The trail runs along and often crosses over this with well built though narrow bridges, and boardwalks. Often on hills, the builders have dug in steps in the dirt. Note to those considering mtn biking this. much of the infrastructure isn't bike friendly, and bike tires will quickly destroy this step work along the hills. I'm an avid mountain biker myself, and am reluctant to set tire to this piece of work.In all, Central Loop is stated as being 4.2K, and I have measured this along with the connector loop as being almost 5.5K. It's certainly the part of the trail system to look forward to with its showcase of bridge work and mix of terrain.If you want to make more of a go at this trail, take the North Connector segment which takes you north to Campbell Road which is the location of the last two loops, separated by the car bridge.The Birding trail, the original of the set, is a bit more than a kilometer (1.3Km) in length. It takes an hourglass shape to the left of the Pisquid River, and at times runs along its banks. Not too many features to speak of, except for boardwalks over boggy sections. It's more technical than the South Loop, though shorter Unlike how the map indicates, this green trail does not loop back on itself, but rather, spills out onto Campbell Road, where you turn left and walk back to the trail junctions. Unfortunately, signage and flagging does not indicate this.On the right side of the bridge, the 2Km North Loop goes out and around the High Bridge Road, crossing the Pisquid in a few places. It too is similar in technical level as the Birding loop.If you were after a nice one hour walk, I would suggest picking one or two loops either from the South or North end. If you want to hike a lunch and make a fun day of it, do it all at once. With two cars, you won't have to re-hike portions to catch your ride. I can't wait to hike this in the Fall.Trail signage is in the form of colored ribbons hanging from branches and tree trunks. Adjacent trails don't use the same color scheme. Trail signage exits at each junction, showing where you are, and the associated loops of the system. The more people use the trail, the more obvious the paths will eventually become. As of now, sometimes the way isn't obvious. In winter, white flagging is nearly impossible to see!Shannon BurtEast Coast editor",
    "directions": "You can access the trail from Charlottetown, by leaving along the Trans Canada highway (Route 1) toward Wood Islands. Upon reaching Route 5, turn left. (now 10 minutes from the trailhead) Follow Route 5 until you reach an intersection for highway 216. Turn left. This will eventually turn into a dirt road and intersects with route 214. Beyond this intersection, going straight, you will reach the trailhead. The dirt road is called High Bridge Rd, (also called Campbell road) and has a trailhead sign.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/PE/6210/reg_IMG-1955-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/6210/reg_IMG-1964-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/6210/reg_IMG-1966-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/6210/reg_IMG-1977-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/6210/reg_IMG-2157-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/6210/reg_IMG-2160-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/6210/narrow_IMG-1940-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/6210/narrow_IMG-1941-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/6210/narrow_IMG-1943-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/6210/narrow_IMG-1944-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/6210/narrow_IMG-1945-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/6210/narrow_IMG-1947-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/6210/narrow_IMG-1953-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/6210/narrow_IMG-1960-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/6210/narrow_IMG-1962-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/6210/narrow_IMG-1972-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/6210/narrow_IMG-1984-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/6210/narrow_IMG-1985-6702.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/dromore-trail-system-near-mount-stewart-pe-6210",
    "stats": {
        "Activities": "snowshoe hike ski-xc",
        "From": "",
        "Seasons": "winter fall summer",
        "Stars": 4,
        "Time": "5 hrs",
        "Total Distance": "14 km",
        "Town": "Mount Stewart, PE",
        "Type": "out-and-back"
    },
    "title": "Dromore trail system",
    "trail_id": "6210"
}