{
    "description": "This trail begins at the University of Lethbridge visitor's day parking lot.  The trail is initially concrete but transitions to a dirt path for much of the one kilometer descent to the river valley.  Shortly after entering the river valley take a dirt path branching off to the east.  This takes you through a cottonwood forest and by an oxbow lake.  The trail continues under the Whoop up drive bridge into another stand of cottonwoods.  As you travel towards the high level trestle bridge several trails coverge on a storm sewer outlet.  Climb gently around the outlet and the trail then exits the cottonwoods and onto a trail that is carved into the steep riverbank.  After crossing under the High Level Trestle bridge you enter the Elizabeth Hall Wetlands area.  Take one of the trails north to the the Highway 3 bridge to cross the Oldman river.  Once on the east side of the river you travel back towards the high level trestle bridge through one of the trails in the Nature Conservation area.  You will emerge out of the forest at the Helen Schuler Nature Center.  There are various exhibits and access to a bathroom at the center.  Continue onto a concrete trail that passes under the high level trestle bridge and continue the trail as it branches east.  This trail takes you through Indian Battle Park.  As you approach the footbridge that crosses back over to the west side of the river you will see a replica of an old fur trading fort-- Fort Whoop Up.  Once across the Oldman River you pass through a tunnel under Whoop Up Drive.  A concrete path will then take you directly to the ascent up the coulees and back to the Universityparking lot.\r\rApart from the last kilometer this is a trail with next to no change in elevation.  It is a great family trail.  I have always used this as a jogging route.",
    "directions": "The trail head is in west Lethbridge.  Take University Drive south and turn east on Valley Road (the main entrance to the University of Lethbridge).  Head east through a set off lights and turn north to enter the University public day lot.",
    "geohash": "c2zd",
    "photos": [],
    "source_url": "https://trailpeak.com/trails/lethbridge-river-valley-loop-near-lethbridge-ab-6216",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "10 km",
        "Town": "Lethbridge, AB",
        "Type": "out-and-back"
    },
    "title": "Lethbridge River Valley Loop",
    "trail_id": "6216"
}