{
    "description": "Sea Kayaking on the Ottawa River at Lac Deschennes (Britannia Beach to Nepean Sailing Club, to Aylmer Marina) is a surprisingly well kept secret for paddlers.  Those that live nearby can atest to completely different conditions on every outing.  The winds can howl down the Ottawa creating Ocean like conditions and some incredible surf.  On other evenings, it can be dead calm and the sunsets are the best in the area.Routes can vary from a launch at Britannia beach, to a longer middle of the channel paddle to Aylmer Island -- or over to Aylmer Marina. One can conceivably do a 2-3 day journey, all the way to Chats falls.Some of the attractions -- millionaires homes along Grandview avenue, to the military reserve at Shirley's Bay, to paddling along the Quebec side with cottage views.  If you are lucky, you might see the only Ottawa tall ship, the Black Jack out near Britannia Sailing Club, a storied club going back to the turn of the century and producing Oylmpic canoe/kayak champions.",
    "directions": "Launch at Britannia Beach, which is off Carling / Pinecrest -- where there is plenty of parking, or at Nepean Sailing Club.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/ON/6217/reg_IMG-0001-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/6217/reg_IMG-0002-5_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/6217/reg_IMG-0003-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/6217/reg_IMG-0004-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/6217/reg_IMG-0005-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/6217/reg_IMG-0006-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/6217/reg_IMG-0007-5.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/ottawa-river-kayak-lac-deschennes-near-ottawa-on-6217",
    "stats": {
        "Activities": "sea-kayak",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 3,
        "Time": "3 hrs",
        "Total Distance": "5 km",
        "Town": "Ottawa, ON",
        "Type": "out-and-back"
    },
    "title": "Ottawa River Kayak - Lac Deschennes",
    "trail_id": "6217"
}