{
    "description": "The High Rim Trail runs along the east side of the okanagan valley, from Vernon to Kelowna.  It has recently been the subject of a rejuvination project, and should be restored by the end of summer 2009.  The trail begins in Kalmalka Lake Park, passes Oyama Lake and through Wrinkley Face Provincial Park near Lake Country, and finishes at Mission Creek and Highway 33 in Kelowna.  There are camping spots along the trail, but with 5 or 6 access points, it can easily be hiked in stages.From another user: The hike has some gorgeous areas, cedar groves, monumental Douglas Fir, great lookouts, and also traverses active forest harvesting areas.In 2010, the Okanagan High Rim Trail had a lot of work done on it to improve trail surfaces, access points, signs, as well as an updated gps file for recreational and industry users, and the government.The entire length of the trail was worked on, but I've heard from some people who have completed sections of the hike that there are a few persistent problem areas. For example, the approach to the radio communications tower overlooking Vernon has been a problem area for excessive blow-down trees. Trail crews cut a new path through the debris, but more trees have since fallen. )",
    "directions": "The Trail heads are at the Cosen's Bay gate in Kalmalka Lake Park, near Coldstream or Vernon and also at Highway 33, near Mission Creek in Kelowna.  There are also access points at Oyama Lake Rd., Beaver Lake Rd, Postil Rd, and Philpot Rd.  The longest section is about 15 or so km. (Same directions to trail-head in alternate wording from another user:The trail can be accessed by multiple points along the way, but two main trail heads exist. The northern trail head access is from the parking lot in Cosen's Bay, Kalamalka Provincial Park.From Highway 97 in Kelowna, travel east on Highway 33 for approximately 20 km. the Trail head sign is located on the (right) side of the road, just before the Philpott Road turnoff (on left). The trail either descends to Mission Creek and continues as the Highlands Trail, or ascends northward towards Vernon. )",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/6224/long_Grand-view-47902.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6224/reg_CIMG2029-26336.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6224/reg_IMG-3175-47902.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6224/reg_IMG-3179-47902.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6224/reg_IMG-3185-47902.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6224/reg_IMG-3260-47902.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6224/reg_View-31810.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6224/reg_hi-rim1-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6224/reg_hi-rim2-5_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6224/reg_hi-rim3-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6224/reg_hi-rim4-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6224/narrow_Creek-31810.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6224/narrow_IMG-3198-47902.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/high-rim-trail-near-kelowna-bc-6224",
    "stats": {
        "Activities": "climb snowshoe hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "28 hrs",
        "Total Distance": "55 km",
        "Town": "Kelowna, BC",
        "Type": "out-and-back"
    },
    "title": "High Rim Trail",
    "trail_id": "6224"
}