{
    "description": "An energetic, alternative exit from the Flat Creek ride, or an In-n-Out from the South, this is a technical and aerobic climb to the top of Grass Pass, where, with a little side ride to Fir Creek Point, a promontory with A-MAY-ZING views in nearly all directions.  You are 400m above the Highwood River and highway 541, and there are peaks off to the West that will also take your breath away.  I am very happy I did this trail for these reasons and would recommend it to anyone with the energy to do it.\nIt is 6km (total in and out) from Sentinel *WITH 400m of climbing*, or 12.8km to link up with the Flat Creek Trail (with the same 400m of climbing) which will make it about a 25km day if you head straight to the hiway.  Or heck, make it an epic day and do Flat to the cabin, then on the way back, take this trail and get 34km back to the Sentinel (where if you don't have a shuttle car waiting you will need another 17km and 120m of decreasing elevation) to get to the Flat trailhead.\nFrom Flat Creek, you climb 300m in 7km up a very underused cowtrail, from the South, you climb up 393m on a very underused cowtrail.  It's a pretty good workout.\nTo find the trailhead at the South end, park at Sentinel Day Use area, cross the hiway and go East about 450m looking for the trail.  At the North end, the trailhead is not marked, but you can see a basic path disappearing off to the South from the main Flat Creek trail.  It is 2.2km West of the road that drops down to the abandoned well (and/or about 874m West of the Gate you pass through on the main trail)\nIf biking, coming down from Grass Pass to the South takes some serious braking power, I would not want to do this with crappy, wet rim brakes.  It is a very cobbley, rocky, and/or narrow descent dropping 393 meters in 2690 meters (that's a 15% grade for the mathematically challenged).  It is not flowey.  My wrists hurt from keeping the brakes hauled in so I didn't get out of control and even then, I ended up in the tulips (though reasonably gently, thanks for asking).\nOn the way to Fir Creek Lookout you will pass the famous(?) Boundary Pine tree and on the point itself there are a number of interesting gnarly old pines and the aforementioned great views.  Hiking wise, you could probably bushwack a bit to get a shorter path to the point.\nOn the way home, the best tasting beer and burgers we found all day was at the historic, Longview Saloon.  Very Cool.\nThis trail is 21km West and 400m higher than:",
    "directions": "Drive SW of Calgary to Longview, AB, then West on Hiway 541 to either the Flat Creek road access (21.0 km from the T in Longview) for the North option, or to the Sentinel Day Use Area (38.1km) for the Southern access.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/6226/reg_IMG-3461-Small-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6226/reg_IMG-3464-Small-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6226/reg_IMG-3465-Small-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6226/reg_IMG-3485-Small-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6226/reg_IMG-3491-Small-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6226/reg_IMG-3498-Small-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6226/reg_IMG-3503-Small-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6226/reg_IMG-3505-Small-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6226/reg_IMG-3509-Small-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6226/reg_IMG-3513-Small-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6226/reg_IMG-3515-Small-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6226/reg_IMG-3516-Small-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6226/reg_IMG-3517-Small-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6226/narrow_IMG-3468-Small-6828.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/wileman-creek-grass-pass-near-longview-ab-6226",
    "stats": {
        "Activities": "snowshoe hike ski-bc mtn-bike",
        "From": "",
        "Seasons": "winter fall summer",
        "Stars": 4,
        "Time": "4 hrs",
        "Total Distance": "6 km",
        "Town": "Longview, AB",
        "Type": "out-and-back"
    },
    "title": "Wileman Creek - Grass Pass",
    "trail_id": "6226"
}