{
    "description": "The trail itself is a simple loop leaving from a well-marked trailhead some 10 km past the park gates. It passes through aspen woodland and meadows, marshes and a few sand hillocks. A nice walk with a few minor hills, but all in all, quite easy.\r\rOur little group hiked the Moss Lake trail at Elk Island National Park on the weekend, only 12.7 km but a nice ramble through the bush. Unfortunately, we forgot that mid-August through September is rutting season for the Wood Bison who live in the park. \r\rThe adventure began as we drove into the park, and ran into a herd of bison wandering down the highway. Big mean bulls protecting the calves and their cows, bluff-charging the cars. How do you explain to your insurance company that your car got rammed by a wood bison - is that covered? I'm pretty sure my little Yaris would have got the worst of any direct confrontation. For once, we might have felt a bit safer in a big pickup truck! Got through that one by driving real slow, and made it to the trailhead.\r\rBailed out, rigged up and waited for the rest of the people. Edmonton Outdoor Club hike, so we had about 18 people with a wide variety of skill levels and experience. As usual, once the hike started, the group began to string out along the trail and broke up into fast, medium and slow. \r\rTwo of us wound up a fair bit ahead of the pack. We came around a corner and bumped into a young bull, severely startling all concerned. The mistake we made was looking back over our shoulders to find a spot to retreat to. I guess you should never turn your back on a bison, because when we turned back, he was already in full charge. All we could do was jump out of the way back into the bush and let him pass by down the trail. Instead of turning to attack when he got to us he kept on going, and ran into the next batch of hikers 20 or 30 metres behind us. They had the advantage of hearing the hookbeats and seeing him coming, and enough time to clear the track. He just charged right on through as everyone cowered in the bushes. When he met the (largest) slow group, he was down to a walk, and just changed course into the woods. That encounter happened because he was startled (as were we), so we started trying to make a bit more noise from then on. \r\rOf course, after a few more km you start forgetting to 'Hey-O' as you go along. The same lady is way out in front again chatting with another woman, and we're back a few metres. They go around the corner ahead of us and we hear a scream. Same situation - we get around the turn and another bull has them cornered up on a fallen tree trunk, bluff charging to keep them there. \r\rThen he sees the rest of us coming and comes charging down the trail. We've had time to get off the trail, and I've got a nice solid tree to hide behind. He slows down and tries to decide which way to get around the trunk to get at us. This time I'm ready, so I'm just talking nice and quietly to him and trying to keep the tree between us. I guess he realized that now he was out-numbered, because he stopped lunging at us and turned away into the bush.\r\rThat's when I noticed that three people had been hiding behind me while I was hiding behind my tree, keeping me and the tree between them and the bison. Thanks, guys! One unfortunate woman panicked when she saw him coming and decided to go bushwhacking to get away - when he left us, he ran pretty much head-on into her. I guess he swept by her at a distance of only a few metres, and she came running back to the group in tears.\r\rFrom then on, the hike became much more of a heads-up event, instead of a leisurely nature walk. Lots of yodelling and checking over shoulders, and no more problems. We ran into a park ranger and told her our tales of adventure. Instead of finishing her hike down the trail, she changed her mind and went back to the trailhead with us. \r\rJudging from how the bison responded in each case, it seems that the best things to do when you run into a wood bison are kind of the same as when meeting a bear. Stop, back up slowly, avoid eye contact, talk quietly, and make sure they have an escape route. Travelling in groups also seems to help. In both cases, the bulls would charge one or two people, but balked and turned away when confronted by a larger group. And stay away from the big herds. If they have some warning, they'll stampede to get away and protect the calves, but the bulls will turn back to challenge an intruder.\r\rApparently, you are three times as likely to be attacked by a bison in North America as you are a bear. Especially in rutting season.\r\r",
    "directions": "Highway 16 west of Edmonton 35 km. North to park gates (National Park Pass required). Follow road until it veers right. Look for Moss Lake sign.",
    "photos": [],
    "source_url": "https://trailpeak.com/trails/elk-island-moss-lake-trail-near-edmonton-ab-6227",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 4,
        "Time": "4 hrs",
        "Total Distance": "13 km",
        "Town": "Edmonton, AB",
        "Type": "out-and-back"
    },
    "title": "Elk Island, Moss Lake Trail",
    "trail_id": "6227"
}