{
    "description": "An off-the-beaten-path day hike up and over Mt. Brooks, above Lake Helen McKenzie, with nice views of southern Strathcona Park.  Some route-finding / bushwacking involved...\nTake your favourite route to the trail junction on the North side of Helen McKenzie, where the trail to Circlet Lake leaves the McKenzie / Battleship loop. (GPS route follows the old Dove Creek Trail - avoids the \"crowds\" and boardwalks through Paradise Meadows but much of the trail now goes through clearcuts).  At the first section of boardwalk towards Circlet, about 1/2 km from the junction, leave the trail to the right and head up through relatively open bush.  There are vague signs of intermittent trail, but just head up until you reach an area of rock fall from above.  Heading right at the lower edge of the rock fall leads to a gradual meadowed slope which you can follow upwards for a few hundred meters, then cut up to the shoulder.  The route along the ridge to the summit is fairly obvious, as is much of the route down the other side.  Basically, follow the ridge - there's some flagging but it's more for reassurance than guidance.\nThe GPS route follows some flagging straight down off the ridge to a series of meadows below, which in turn will lead you eventually to the Circlet Lake trail between Helen McKenzie and the Ranger cabin. Go left to return along Helen McKenzie, or right to make a bigger loop around Kwai / Croteau / Lady Lakes.",
    "directions": "From Hwy. 19 follow signs to Mt. Washington Ski Area (Strathcona Parkway) for 20 km.  For Dove Creek trail, turn left toward nordic ski area and park just past the intersection.  Scramble left down to old logging road and follow it for 1/2 km. - trailhead is quite well marked.  For traditional routes through Paradise Meadows continue to parking lot at Raven Lodge and follow the maps and signs.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/6229/reg_Mt-Brooks-Sept-23-004-8783.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6229/reg_Mt-Brooks-Sept-23-032-8783.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6229/reg_Mt-Brooks-Sept-23-034-8783.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6229/reg_Mt-Brooks-Sept-23-039-8783.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6229/reg_Mt-Brooks-Sept-23-041-8783.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/strathcona-mt-alan-brooks-near-courtenay-bc-6229",
    "stats": {
        "Activities": "ski-bc hike snowshoe",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 4,
        "Time": "6 hrs",
        "Total Distance": "16 km",
        "Town": "Courtenay, BC",
        "Type": "out-and-back"
    },
    "title": "Strathcona - Mt. Alan Brooks",
    "trail_id": "6229"
}