{
    "description": "I did this trail solo over 3 nights and 4 days of backpacking. I will explain the trail  day by day and rate it as so. \nNOTE: I would STRONGLY recommend doing this trail travelling from Floe Lake north to the rockwall as you get easier sections of hiking and not as many difficult pass ascents in a day.\nDay 1 - Floe Lake trailhead to Floe Lake - 10.7km - 4 hours chubby guy speed - 5/5\nI left my car at the Painted Pots parking lot closer to Hwy 1 and hitchhiked to the Floe lake trailhead. hopefully you can catch a ride.... took me a while. From the trailhead you follow river bottom for a couple kms then a few switch backs gets you up from the valley bottom and then you just traverse the hill with an easy grade for several km before you reach the main pull which is a few kms of switchbacks. This section klilled me bc i was pushing too hard bc of the excitement of the trip! Take your time. the trail has beautiful scenery for a valley hike but can be a bit of a pain as at times it is overgrown b/c of a past fire. The trail is still very visible though. Once you finish the switchbacks you have another km or so and the reward is VERY worth the climb! Possible the best camp i have ever spent the night at! you could do this section only as an overnighter just make sure you go up to Numa Pass before you go home.\nDay 2 - Floe Lake to Numa Pass to Numa Campsite to Tumbling Pass to Tumbling Campsite - 17.5 km - 9 hours chubby guy speed - 4/5\nThis section is easily done in one day of travelling north. If travelling south the ascent up to Numa Pass would have killed me as i was tired from the descent alone! Numa pass was one of my highlights of this route! so beautiful! You then descend for a long time down (3.5 hours)into Numa camp, which if possible, i would avoid camping in, as every other camp on this route is far more beautiful! Tip... my map was terrible and the jct to go up to Tumbling is about 3/4km past the camp. The trail up to Tumbling Pass, while you can still see the trail, is very overgrown in places and that combined with a hot sun and a long climb, made this section of the trail my least favourite by far. If it's been raining.. expect to get VERY wet from the vegetation. Once high enough on the avalanche slope it becomes enjoyable again. Tumbling pass is very beautiful and the descent into the camp is mild. The camp at tumbling is 2nd only to Floe lake on this trail. Very nice camp!\nDay 3 - Tumbling Camp to Rockwall Pass to Helmet Falls Camp - 11.9km - 7 hours chubby guy speed - 5/5 \nThis day is the best far and above the rest. A relatively easy climb gets you into the alpine and then it's easy walking for several km before you drop down to a glacial lake just to climb again before the LONG descent into Helmet Falls Camp. tip - take the time to walk up to helmet falls. Near the beginning once you reach the alpine, you will climb through a sparse tamarack forest until you reach Wolverine Pass (keep an eye out for the warden cabin on the right). Wolverine Pass is the only break in the massive rockwall and is astounding! Shortly after that the section of the rockwall that typifies this trail comes into view with it's completey flat top and face. Amazing. Once you go down to the glacial lake and back up you will begin to hear Helmet Falls despite being very far away. The descent to camp is a nice part of the trail. The camp is also very nice.\nDay 4 - Helmet Falls to Helmet Ochre Jct to Painted Pots parking lot - 14.4km - 3.5 hours very fast chubby guy speed (I really pushed myself as there isn't a lot of gawking to do at the scenery)\nThis section of the trail doesn't have much to look at as it is all in the valley bottom for the most part. Some nice meadows and avalance slopes and creek crossings. That is why i pushed myself (and i had a long drive ahead of me). The neatest part of this section is the painted pots about 1 km from the parking lot. \nOverall this trip was amazing and if you're willing to do a lot of slugging up and down hill, it's worth it!",
    "directions": "From Alberta follow Hwy 1 past Banff and turn South on Hwy 93 toward Radium Hot springs and watch for signs. \nFrom BC, pass Golden on Hwy 1 and again watch for signs. \nNothing complicated about finding the trailhead. :)",
    "geohash": "c3j",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/6237/reg_DSCF5086-0.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6237/reg_DSCF5090-0.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6237/reg_DSCF5116-0.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6237/reg_DSCF5120-0.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6237/reg_DSCF5155-0.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6237/reg_DSCF5159-0.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6237/reg_DSCF5193-0.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6237/reg_DSCF5201-0.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6237/reg_DSCF5210-0.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6237/reg_DSCF5220-0.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6237/reg_DSCF5240-0.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6237/reg_image-789.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6237/narrow_528622-10150884601048535-85188010-n-23980.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6237/narrow_DSCF5070-0.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6237/narrow_DSCF5098-0.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6237/narrow_DSCF5227-0.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/floe-lake-and-rockwall-pass-full-route-near-radium-hot-springs-bc-6237",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 5,
        "Time": "96 hrs",
        "Total Distance": "55 km",
        "Town": "Radium Hot Springs, BC",
        "Type": "out-and-back"
    },
    "title": "Floe Lake and Rockwall Pass full route",
    "trail_id": "6237"
}