{
    "description": "This little day hike is a good workout with a great reward at the top. While there are off trail routes to this location from the western end of carrot mtn, this is the best route. There is two routes up, but really only one side of the mtn has a consistent well defined trail. If you follow the gulley right up the creek it is a steady and steep trail with a few spots where your hands or poles will be needed. as you go up, not a bad idea to keep an eye out for bears as i have seen them before. on the way up you will get to a waterfall and not too far after that the trails grade decreases. Once at the bluffs you get a great view of Westbank, Shannon lake, the golf course, and Okanagan Lake! on the way down continue toward the east and you will follow the trail for quite a while (follow the flagging tape and rock cairns), but there comes a point when there are random game trails and confusing human trails going various directions. After having done this trail a few times, i still follow the wrong ones sometimes. There are a couple different options. 1) there is a trail that is the original trail down that loops around and rejoins the gulley trail about 1km up from the water tower. this trail is hard to connect onto though. 2) One time i followed a trail right to the base and followed behind the houses back to the car and 3) get to the bottom whichever route you like and then find your way back to the car hahaha. good luck. Another option is when you are going up the gulley trailwatch for some yellow ribbon that leads you to the right and that is the original trail around the east side and you can basically piece the trail together on the way up and come down the gulley. But if it's your first time on the mountain i would suggest going up the gulley and down the east side so you can see where the trail sorta starts to fragment, so going the reverse direction you have an idea where you need to end up. haha that was a lot explanation that was probably unnecesary.",
    "directions": "From HWY 97 turn right onto Barltley Road, then left on Shannon Lake Road towards the golf course.  Just before the golf course, take a right on Shannon Woods Drive by the Community Gardens.  Continue up the hill to Shannon Hills Drive and take a right, then left on Shannon Heights Place to the end of the street where there is a dead end.  You will see a chained off area.  Walk through there and up to your right up a gravel road and the water reservoir.  Cross over the reservoir to the trail head.  It was a bit bushy and hard to find at first but it clears out after a few feet.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/6238/long_20150510-143028-51449.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6238/long_Carrot-Mtn-Trailheads-35968.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6238/reg_Bluffs-40396.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6238/reg_CarrotMtn-40396.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6238/reg_CarrotMtn4-40396.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6238/reg_IMG-1902-42698.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6238/reg_IMG-7557-40902_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6238/reg_Jeremy-on-Carrot-2--21230.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6238/reg_Jeremy-on-Carrot-21230.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6238/narrow_CarrotMtn2-40396.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6238/narrow_CarrotMtn3-40396.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6238/narrow_IMG-1937-42698.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/carrot-mountain-bluffs-near-kelowna-bc-6238",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "6 km",
        "Town": "Kelowna, BC",
        "Type": "out-and-back"
    },
    "title": "Carrot Mountain Bluffs",
    "trail_id": "6238"
}