{
    "description": "This trail is amazing during the summer.  Several waterfalls and a variety of different sights make this an enjoyable experience.  The path is well marked and alternates in difficulty allowing for some uphill climbs with some rewarding flat plateaus.  A quarter of the way up there's an abandoned excavator which makes for a good photo!\r\r**Said 20km trip but may be more or less, not sure",
    "directions": "Head up coast meridian road and make a right on Harper Rd.   There's a gate right before the club on your right that leads up to the trail.   Head up this logging road and pass the first left hand trail.   Keep walking and then at your next for (go straight or head left) head left and travel up this path.   You'll reach another fork in the road,  the right trail heading upwards, the left heading straight.  Go along the left trail and cross a small creek.  You'll see a sign on your right indicating a trail to the \"summit\" trail.   Head along this trail and follow the markers heading to the summit.   You'll head along a long flat stretch and then reach a sign which shows whether or not you want to head left or right.  The left trail should indicate the \"Falls crossing\" trail.   Head along this and you'll shortly cross a path with a small waterfall.   Follow this path and you'll pass Lily pad lake and then Hourglass lake.   You'll reach a sign indicating you to go right to Dennitt lake.  This is a very steep downwards path!  Unless your goal is to reach dennitt lake i'd personally suggest spending your time at Hourglass lake as the water is quite clear and is gorgeous... if you're spending the night, there's more space at dennitt lake.  Took 2 hours and 40 minutes to get to dennitt lake from the gun range with minimal stops.  Pretty mucky in areas, wear appropriate footwear.\r\r**Said 20km trip but may be more or less, not sure",
    "geohash": "c2b8",
    "photos": [],
    "source_url": "https://trailpeak.com/trails/burke-gun-range-to-dennett-lake-near-port-coquitlam-bc-6246",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 4,
        "Time": "6 hrs",
        "Total Distance": "20 km",
        "Town": "Port Coquitlam, BC",
        "Type": "out-and-back"
    },
    "title": "Burke - Gun range to Dennett Lake",
    "trail_id": "6246"
}