{
    "description": "The complete Howe Sound Crest Trail is NOT a walk in the park. The HSCT is an ambitious overnight hike that will surely kick your butt and supply some breathtaking views. You start your day (early! or you'll run out of daylight) at Cypress Bowl ski lodge, stay the night in Magnesia meadow's emergency hut, and finish at Porteau Cove.It has taken me 3 attempts to complete this trail, the last go (August 16/17th 2009) was successful due in large part to previous training and lucky weather.  Do not attempt this trail under poor weather conditions or too early in the season unless yu are equipped and comfortable with ice/snow hiking/climbing (it takes a while for all of the snow to recede enough to spot trail markers and cross the quarry between the Lions).It has been recently re-tagged so it is easy to follow which is awesome.Make sure to check out the forecast, other reviews, and print off a reliable topographical map before you head out.I walked the trail September 4th/5th 2009 and like to provide some more information. Following there is a list of hiking times for those who intend to hike parts of it. There was equipment for two days and no hurry, but please add +10% or more to the times if you are not used to hike for 6 hours under these conditions:- Cypress Bowl ski lodge  2 h   The trail is partly quiet rough and there is ongoing construction.- Mt. St. Marks  1 h   There is a good hiking trail from Mt. St. Marks to the ridge between The Lions.- Mt. Unnecessary south peak 10 min- Mt. Unnecessary north peak 25 min    I do not recommend to hike the ridge from Mt. Unnecessary to The Lions under bad weather weather conditions due to exposed parts.- Intersection to Lions Bay50 min     There is the option to climb The Lions but no need. The trail leads on the south side around the west peak. - ridge between The Lions2 h    This part of the trail is the most rarely used one. Do not underestimate it, you loose and gain about 500 m in elevation.- intersection to Lions Bay30 min    You find a ridge with a trail to climb Mt. Harvey. Without backpack I needed 40 min up and down. -Magnesia Meadows emergency hut35 min     There is a good trail down to Deeks Lake. Although I missed the view the trail was walkable under rainy and foggy conditions.- Intersection to Lions Bay  40 min- Brunswick Lake emergency hut   55 min- Deeks Lake    1 h 45 min   -Parking lot on HWY 99, about 1 km south of Proteau Cove Provincial Park",
    "directions": "To get to the Howe Sound Crest Trail, take Hwy 99 in West Vancouver to the Cypress Bowl Exit, and drive all the way up to the Downhill Ski area, parking just in front of the ski purchase pass area (obviously closed for the summer).",
    "geohash": "c2b",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/6248/reg_Howe-Sound-5_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6248/reg_Magnesia-creek-evening-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6248/reg_Magnesia-emergencyhut-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6248/reg_TheLions-MtUnnecessary-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6248/reg_image-49218.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6248/narrow_image-49218.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6248/narrow_map-5.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/howe-sound-crest-trail-near-lions-bay-bc-6248",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 5,
        "Time": "11 hrs",
        "Total Distance": "29 km",
        "Town": "Lions Bay, BC",
        "Type": "out-and-back"
    },
    "title": "Howe Sound Crest Trail",
    "trail_id": "6248"
}