{
    "description": "An alternative (and very pleasant) route up the back of Mt. Becher, returning via the usual trail.  Can be combined with Boston Ridge route (see \"Mt. Becher via Boston Ridge\") for a longer loop.\nPark at old ski area and either head straight up past the burnt lodge or angle to the left to pick up a 4x4 track around the South of the ski hill (for a kinder/gentler, but longer start to your hike).  If going up the ski hill, pass the old lift building and follow the obvious track up and under the chair lift then up to the North of the ski hill until it rejoins with the other route at a T junction.  In a few minutes you'll pass an old T-bar lift, and in a few more minutes go right and slightly down hill at a Strathcona Park boundary sign.  In about 2 km. you'll reach a well marked junction with trails to the left (Mt. Becher) and right (McKenzie & Kwai Lakes) - turn right and follow the trail for an hour or so.  You'll come to a sign for Drabble Lakes and, a couple of minutes later, reach the well marked junction for Slingshot Meadows.  Go left for .4 km to reach Slingshot Meadows.  From here the trail up Mt. Becher is fairly well marked with a combination of orange squares on trees, flagging and cairns.  Climb through old growth into sub-alpline, and after an hour or so you'll reach the junction with the main Mt. Becher trail.  From here it's a 15 - 20 minute jaunt to the summit.\nReturn to the trail junction; turn right and follow the trail back down to the Becher / McKenzie junction then retrace your path to the parking lot.  To take the Boston Ridge route (much longer) follow cairns from the summit to the South and pick up the trail down the ridge - you'll eventually come out on Forbidden Plateau Road about 1.5 km. below the parking lot.",
    "directions": "From Hwy. 19 Northbound turn right at the second Courtenay exit, the right again at Forbidden Plateau Road.  Follow the road to the end at the old ski area parking lot.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/6252/reg_Becher-Snowshoe-April-22-06-008-8783.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6252/reg_IMG-0678A-8783.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6252/reg_IMG-0689A-8783.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6252/reg_IMG-0712A-8783.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6252/reg_IMG-0760A-8783.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mt-becher-via-slingshot-meadows-near-courtenay-bc-6252",
    "stats": {
        "Activities": "snowshoe hike ski-bc",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "7 hrs",
        "Total Distance": "17 km",
        "Town": "Courtenay, BC",
        "Type": "out-and-back"
    },
    "title": "Mt. Becher via Slingshot Meadows",
    "trail_id": "6252"
}