{
    "description": "This trail starts with a decent to a stream that must be crossed for the hike to be possible. This could make or brake your hike considering the crossing is dependant on a fallen log that could easily be taken out by next years spring run off. You then start to climb, and it is all up hill. After approximately half a kilometer to get on to an old, very overgrown logging road.  If you have sensitive legs you may want to consider wearing pants as low vegetation continually brushes against your legs the entire time you are on the old logging road.  About half way through the hike you reach the memorial plaque commemorating the people who died in the crash of Trans Canada Airlines Flight 810.  From here you have a view of the \"debris bowl\" where the majority of the debris from the plane that crashed, a Canadair Northstar, ended up.  Some pieces went there right away and others were carried there via slides, avalanches and spring run off. After the plaque the road continues up the mountain until you turn and hike up a well defined ridge until you get to the propeller cairn. Even though you do not come close to summiting the mountain you get great views of amazing vistas of Mount Rexford, Mount Slesse and The Illusion Peaks.  On the cairn you will find one blade from a propeller and multiple other pieces of debris. As well although they are rotting away there were a few prayer flags on the cairn. If you decide to venture onto the foot of Mount Slesse, take caution as a rock side could occur at any time and without warning.  Also bring bug repellent as there lots of biting black flies that make it hard to have a rest without getting bit",
    "directions": "From Vancouver take Hwy 1 to Chilliwack, take the Vedder Road exit and continue on Vedder Road until just before the Vedder Crossing Bridge and turn left onto Chilliwack Lake road.  Follow this road for 31 Km and turn left immediately after the Riverside Recreation Area onto (?). Cross the bridge and turn left 400m after the bridge.  Follow this road (Nesakwatch Creek Road) for 5.6 Km until you see a log marked Mt. Slesse at a small trailhead with flagging tape.  A 4x4 is recommended on Nesakwatch Creek Road as it has multiple areas where washouts have come across the road and left behind large rocks and there are large dips in the road that may damage low clearance vehicles.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/6254/reg_CIMG0142-24755.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6254/reg_CIMG0143-24755.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6254/reg_CIMG0153-24755.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6254/reg_CIMG0176-24755.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6254/reg_Mt-Slesse-09-017-22809.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6254/reg_Mt-Slesse-09-018-22809.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6254/reg_Mt-Slesse-09-026-22809_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6254/reg_Mt-Slesse-09-027-22809.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6254/reg_Mt-Slesse-09-029-22809.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6254/reg_Mt-Slesse-09-034-22809.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6254/reg_Mt-Slesse-09-037-22809.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6254/reg_Mt-Slesse-09-045-22809.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6254/reg_Mt-Slesse-09-082-22809.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6254/reg_Mt-Slesse-09-083-22809.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mt-slesse-memorial-near-chilliwack-bc-6254",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 3,
        "Time": "6 hrs",
        "Total Distance": "12 km",
        "Town": "Chilliwack, BC",
        "Type": "out-and-back"
    },
    "title": "Mt. Slesse Memorial",
    "trail_id": "6254"
}