{
    "description": "The trail has just been cleared and a metal bridge now allows you to cross Birnham Creek easily. The trail is punctuated by four sections. The first steepish section takes you to the metal bridge in about an hour. You will have climbed just under 1000'. The next section is a soggy plateau that offers a bit of a break before the third and steepest section. The third section leads you into the alpine. Cross the creek and follow flags and cairns to the waterfall overlook.\rThese are directions from the cairned outlook overlooking Birnham Falls. The final part, the ascent to the icefield, requires a bit of attention. From the overlook, head back a few steps and you will see a rough path that guides you up the rock face. You will be zigzagging up the slate rock face following cairns and looking for a ridge or escarpment to the left as you head northeast parallel to the falls. Ascend to the ridge as best you can; the best spot is to climb up to it just before the ridge starts angling to the right.\rThe ridge has an identifiable path. Notice it gets steeper and more rocky towards the crest. When you crest the ridge, notice to your right a gulley with a few guiding cairns that will take you to the opposite cliff face. Head towards a boulder with a large natural orange spot. This marks your route to the icefield. Make sure the route you take to the boulder is as flat as possible to avoid slipping on loose rock.\rAt the boulder a few grassy steps hugging the side of the cliff will take you to a delightful natural staircase that traverses the cliff and ends atop the ridge overlooking the icefield. Don?t be put off by the daunting appearance of the ascent. You won?t realise how easy it is until you are on the staircase.\r",
    "directions": "From Kaslo, drive 35km north to Cooper Creek; turn right onto the Argenta road. After about 1km arrive at a bridge. Head straight onto gravel (right takes you to Argenta). Follow this road for 11km and turn right onto Gracier Forest Service Road. After 10.5 km turn left onto a rough spur road that leads you after 1km to a parking space below the trailhead. Hike up to the trailhead from here.",
    "geohash": "c2uy",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/6256/long_MacBeth-IceFields-1-7-52897.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6256/reg_DSC-0447-0.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6256/reg_IMG-1457-40268.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6256/reg_IMG-1461-40268.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6256/reg_IMG-1481-40268.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/macbeth-icefield-near-kaslo-bc-6256",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 5,
        "Time": "10 hrs",
        "Total Distance": "24 km",
        "Town": "Kaslo, BC",
        "Type": "out-and-back"
    },
    "title": "MacBeth Icefield",
    "trail_id": "6256"
}