{
    "description": "This trail combines the Strawberry Hills and Fitzsimmons Creek (which returns along Barill Creek) trails from the MTB 'bible' into one 34km trail with a bit of pavement (6km), a bit of gravel (3.1km) and a whole lot o' lovin back country riding.  There is nothing overly technical on this, a lot of it is slightly overgrown double track / old logging roads, and there is a few sections of nice singletrack and several creek crossings.  Doing it gives you a true back country cycling experience that will give all riders, especially newer ones a great sense of accomplishment.  The 750m of cumulative climbing (all but 1 short section rideable) will also give confidence (and a workout).  You will get your feet wet in Summer, Spring is not recommended if the Highwood is moving!\nThis gives some great views of many of the surrounding peaks and especially of Fording Pass (from Lunch2 position).  There are a LOT of Tees and turns in the first 1/3 and the last 1/3 of the route, a GPS or some trial and error may be required.  Remember you're doing a big (probably counter-clockwise) circle so keep turning left.\nStart by parking at the Highwood House then ride W on Hiway 40 to Cat Creek parking area.  Ride through the parking to the far end and start out along the Lake of the Horns / Carnarvon Creek trail, but after 3.1km from entering Cat Creek (past the weather station, get across the Highwood River (caution!), then up the hill to the right not down to the left), turn left instead of right, cross McPhail creek and carry along.\nLunch1 is at the top of the ride about 400m (550m cumulative) higher than you started.\nLunch2 (hey! c'mon it was a long ride) gives you a great viewpoint.\nKeep riding along and following the map you printed out.\nEventually you will get spit out onto the gravel highway 541 about 3.2km South of Highwood House.  Pedal back to your vehicles.\nThis trail starts 44km West and 300m higher than:",
    "directions": "South of Calgary to Longview (about 75km SW) then go West on Hiway 541 to Highwood House (43.6km) gas station and store.  Park here (away from store parking).",
    "geohash": "c2yq",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/6259/reg_IMG-3536-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6259/reg_IMG-3541-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6259/reg_IMG-3626-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6259/reg_IMG-3628-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6259/reg_IMG-3637-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6259/reg_IMG-3641-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6259/reg_IMG-3642-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6259/narrow_IMG-3572-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6259/narrow_IMG-3608-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6259/narrow_IMG-3645-6828.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/strawberry-carnarvon-fitzsimmons-baril-34km-near-longview-ab-6259",
    "stats": {
        "Activities": "snowshoe hike ski-xc mtn-bike",
        "From": "",
        "Seasons": "winter fall summer",
        "Stars": 4,
        "Time": "5 hrs",
        "Total Distance": "34 km",
        "Town": "Longview, AB",
        "Type": "out-and-back"
    },
    "title": "Strawberry Carnarvon Fitzsimmons Baril 34km",
    "trail_id": "6259"
}