{
    "description": "This trail combines trails in Cataract Creek to Rye Ridge then back in on Etherington Creek (also from the MTB 'bible') into one 31km trail with a fair bit of double track fire road, but some really sweet downhill cruising.  There is nothing overly technical on this, a lot of it is slightly overgrown double track / old logging roads, and there is a few sections of nice singletrack and several creek crossings and several bogs. Doing it gives you a true back country cycling experience that will give all riders, especially newer ones a great sense of accomplishment. The 750m of cumulative climbing (all but 1 short section rideable) will also give confidence (and a workout). You will get your feet wet in Summer, Spring is not recommended if the water is really moving!\nThis gives many, many great views of the surrounding peaks all the way over to Plateau mountain.  There are not a lot of maps, so a GPS or some trial and error may be required. Remember you're doing a big (probably clockwise) circle so keep turning left.   Near the beginning you will ride along and see the Raspberry Fire Lookout way up on a hilltop.\nStart by parking at Etherington then ride S on Hiway 940 (gravel forestry Trunk Road) to Cataract Creek parking area.  Turn right and past the locked gates and carry on up the gated road.  There is a small climb on the road (of about 157m), but your real workout will happen about 15.8m into the ride where you climb 300m in the next 4.4km.\nIn that area you will see the first of two maps that gives you a Y choice , take the left (0.2km longer) route and you will have an easier climb and see an old trappers cabin (we missed that and so I can't exactly say what it is like).  \nFrom the top of that climb you will have a stupendous view over the valley below.  Stop and smell the flowers.  Have lunch.  A nap maybe.  After that comes the fun, -427m in 9.4km.  All downhill back to the cars.  Buckle up.\nEventually you will end up at the trails up behind Etherington where you parked and just pedal back to your vehicles.\nThis trail starts 44km West and 300m higher than:",
    "directions": "South of Calgary to Longview (about 75km SW) then go West on Hiway 541 to Highwood House (43.6km) gas station and store.  Turn there and drive South on Hiway 940 for 6km to the Etherington Creek Equestrian area.  Park there, ride a further 5.7km South on the road.  Turn right, you're there.",
    "geohash": "c2y",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/6263/long_IMG-3660-[800x600]-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6263/reg_IMG-3658-[800x600]-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6263/reg_IMG-3662-[800x600]-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6263/reg_IMG-3681-[800x600]-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6263/reg_IMG-3688-[800x600]-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6263/reg_IMG-3690-[800x600]-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6263/reg_IMG-3699-[800x600]-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6263/reg_IMG-3703-[800x600]-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6263/reg_IMG-3706-[800x600]-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6263/narrow_IMG-3676-[800x600]-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6263/narrow_IMG-3682-[800x600]-6828.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/rye-ridge-etherington-cataract-raspberry-near-longview-ab-6263",
    "stats": {
        "Activities": "snowshoe hike ski-xc mtn-bike",
        "From": "",
        "Seasons": "winter fall summer",
        "Stars": 4,
        "Time": "4 hrs",
        "Total Distance": "31 km",
        "Town": "Longview, AB",
        "Type": "out-and-back"
    },
    "title": "Rye Ridge Etherington Cataract Raspberry",
    "trail_id": "6263"
}