{
    "description": "A trail that bares all! (You may not want to take your kids on this trail)\n \nA co-worker of my wife's told us about this trail just outside of Halifax. Since we told her about our upcoming trip to the area, she let us in on this unique spot.\n \nCrystal Crescent Beach is one of the few \"beaches\" in close access to the Halifax region's population. With its beautiful white sands, it's a popular draw. Also along the coast line are huge bouldery rocks left as erratics from the retreating ice sheets from long ago. A trail stretches out along the peninsula taking those interested on a nice stroll along the rocks, hugging the coast, and further inland. We hiked out 4.5K before turning around for home. \n \nFrom a few parking lots close to East Pennant, the start of the trail serves as local access to a few beaches, and consequently, runs as a wide board walk making for easy hiking. Going with a pack and day hikers makes you feel rather out of place from the rest of the beach goers with their flip flops, towels and coolers. At the end of this posh part of the trail (about 1.5K) things change quite dramatically in terms of your sense of \"adventure.\" \n \nThe trail improves to single track, and the beach just beyond would raise a few eye brows and cause a few blushing faces. If you are offended by bathing nudists, well, your only option is to either turn around now, or keep your head down, sans eye contact, and simply follow the trail that skirts just along the inland grasses!\n \nThe trail provides you a means of hiking an awesomely rugged coastline. You can choose to follow the peaty path inland, or have fun, walking along bus sized boulders and smaller cobble, and take in the occasional crash and spray of Atlantic ocean swells meeting land. We chose to mix it up a bit, since the path and the rocks are never far from each other. \n \nThe trail extends out until Pennant Point, but we hiked only until we saw it in the near distance. Some inland ATV trails were visible, but it's quite boggy and was sure to soak our boots.\n \nFor a great hike less than a half hour out of the city, Crystal Crescent trail is a great experience. Going in after a storm would really give a show worth photographing. We were glad to get 'er done.\n \nShannon Burt\nEast Coast editor",
    "directions": "From Halifax, head to Sambro along Highway 306. Crystal Crescent Beach is a provincial park, so simply follow the signs to reach the parking lots. Any trail leading right toward the coast will get you on your way.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/6268/long_DSC-0257-58184.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6268/reg_CC-waves-42889.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6268/reg_IMG-2029-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6268/reg_IMG-2032-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6268/reg_IMG-2038-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6268/reg_IMG-2045-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6268/reg_IMG-2055-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6268/reg_IMG-2060-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6268/reg_IMG-2063-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6268/reg_IMG-2065-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6268/reg_IMG-2073-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6268/reg_IMG-2074-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6268/reg_IMG-2082-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6268/narrow_IMG-2025-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6268/narrow_IMG-2030-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6268/narrow_IMG-2033-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6268/narrow_IMG-2042-6702.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/crystal-crescent-trail-near-halifax-ns-6268",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "12 km",
        "Town": "Halifax, NS",
        "Type": "out-and-back"
    },
    "title": "Crystal Crescent Trail",
    "trail_id": "6268"
}