{
    "description": "Very steep trail that is relentless in the \"up 'department for first 3 kilometers, and then it is easier for the last 3 kilometers .Very well brushed and maintained. A small (4 person) cabin next to a lake (Bob Lake or Dunster Lake) in a open meadow setting. The cabin has 2 double beds, 4 summertime sleeping bags, and 2 inch foam to sleep on. There is a 2 burner camp stove and fuel, plenty of cooking pots and pans, some cutlery, and a few cups and plates. The lake is a very good source of very clean drinking and cooking water. The lake maintians its level from either rain water or snow melt from the past winters.",
    "directions": "Leave the Yellowhead Hwy. at the Dunster turn-off. Cross the single lane bridge across the Fraser River and continue to the 3 way stop sign. Turn left(east) and immediatly turn right on to the \"Pepper Pit road\". Follow this road for approx. 2 kms. and park at a gravel pit embankment adjacent to the trail head sign. The trail start is 20 meters further up the road, and the elevation is 900m.\r\n\r\nThere is a wonderful viewpoint of the Dunster Valley at the 2km point in the hike, at an elevation of 1470m. ",
    "geohash": "c36",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/6269/reg_50th-trip-034-19947.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6269/reg_50th-trip-037-19947.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6269/reg_50th-trip-041-19947.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6269/reg_50th-trip-051-19947.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6269/reg_50th-trip-061-19947.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/dunster-trail-near-dunster-bc-6269",
    "stats": {
        "Activities": "ski-bc hike climb",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 4,
        "Time": "7 hrs",
        "Total Distance": "6 km",
        "Town": "Dunster, BC",
        "Type": "out-and-back"
    },
    "title": "Dunster Trail",
    "trail_id": "6269"
}