{
    "description": "The Schriebers Meadow Trail, at the southern foot of Mount Baker, crosses glacial streams, and climbs up through old growth forest into the marmot filled alpine meadows at the foot of the Easton Glacier, looking up at the rugged Black Buttes ridge line, Colfax Peak and Sherman Peak below the Mt Baker summit.\r\rFrom the signboard at the trailhead car park, cross the bridge and follow the obvious trail through Schriebers Meadow.  Cross Sulphur Creek, the main stream draining from the Easton Glacier.  The bridge here is long gone, so you'll have to find a log, or wade.  Be aware that water levels can rise dramatically throughout the day.\r\rPick up the trail on the other side of Sulphur Creek.  At the trail intersection, take the sharp left past the log seat past heather and abundant blueberries and huckleberries.  Follow up through Morovitz Meadow, sneaking views of the glacier and summit plateau above.  Take the signposted right up the Railroad Grade Trail.  \r\rThe Railroad Grade follows past a couple of early camp sites (Railroad Grade Camp) before following the moraine wall of the receded Easton Glacier into the high alpine meadows.  \r\rA sub-ridge to the climbers left of the Railroad Grade has four camp sites , known as high camp (6,000-7,000 ft).  The main climbers camp Sandy Camp, can be found in a wind protected basin at the top of the Railroad Grade.   Additional rocky camp sites are to be found scattered high up around the rocky ridge beside the Easton Glacier giving quick access to the Easton Glacier ascent route.\r\rThis area is highly used.  As such it required that you pack out all you bring in, including human waste.  Toilets are are supposedly installed every June, and taken out again in late September, but this is not always the case.  Signage pointing to them can be found at Railroad Grade camp and High Camp.  Bring appropriate bags (available at park offices) for transporting human waste.\r\rLate summer water can be west of Railroad Grade Camp, and at the northern end of Sandy Camp.  Numerous runoff streams can be found on the rocky ridge above Sandy Camp.",
    "directions": "From Sedro Woolley, drive 13 miles (22km) east along the Hwy Rt 20.  Turn Left (north) on Baker Lake Rd and drive 12.5 miles (21km).  Turn left off the blacktop onto the gravel NFD 12 Rd, at the sign directing you to the Mt Baker National Recreation Area.  Follow NFD 12 for 3.5 miles (5.7 km).  It can be a little confusing at times, with roads going off left and right, but stay on the most used road.  At 3.5 miles, turn right up the switch-backed NFD 13 to the large car park at the end.\r\rNote: You will need to pick up an annual or daily Northwest National Forest Pass.  You can pick them up at Sedro-Woolley, Hwy 20, 810 State Street (360) 856-5700.  More info can be found here.",
    "geohash": "c29m",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/WA/6273/reg_IMG-8862-6103.jpg",
        "https://trailpeak.com/storage//content/trails/US/WA/6273/reg_IMG-8868c-6103.jpg",
        "https://trailpeak.com/storage//content/trails/US/WA/6273/reg_IMG-8870-6103.jpg",
        "https://trailpeak.com/storage//content/trails/US/WA/6273/reg_IMG-8874c-6103.jpg",
        "https://trailpeak.com/storage//content/trails/US/WA/6273/reg_IMG-8925-6103.jpg",
        "https://trailpeak.com/storage//content/trails/US/WA/6273/narrow_IMG-8876-6103.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mt-baker-schriebers-meadow-to-railroad-grade-near-sedro-woolley-wa-6273",
    "stats": {
        "Activities": "ski-bc hike snowshoe",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 5,
        "Time": "6 hrs",
        "Total Distance": "15 km",
        "Town": "Sedro Woolley, WA",
        "Type": "out-and-back"
    },
    "title": "Mt Baker - Schriebers Meadow to Railroad Grade",
    "trail_id": "6273"
}