{
    "description": "Three Brothers Mountain off Heather Trail\nUPSIDE\nEasy instant access with a car road to the high altitude. Quite decent view of 360 degrees from many spots along the way. Beautiful alpine meadows and often sparse stands of Alpine Fir/ White Spruce. Wide well surfaced decent trails, especially at the alpine meadows. Gentle incline all the way to keep running, no need to walk. There are washrooms at the parking and bottom part of the trail(first 1/3 of the way?). Interesting ridge line trail at towards the end. Very modest exposure & gives comfortable thrill to beginner mountain trail person like myself. (When I crawled on the ridge at Brunswick mountain the thrill was clearly beyond me- although it was described as Moderate in advanced guidebooks)\nDOWNSIDE\nTrail gets bit rooty and hard to see them in the woods. Personally I don't like going back up to finish the trail.\nNear the peak some briefcase size of rocks unstable. Fairly crowded despite being the weekday.\nCONTENT\n(From the upper parking lot to main(first peak) of Brothers mountain 70mins, return 61mins.\nTotal running time to go and return 131mins. Total time spent was 141mins including 10mins break at the top. Pace was about 10% slower than usual due to recuperation of calf muscle. Fast runner should be able to do a go-return trip in 100minues. )\nFrom the clear sign equipped upper parking lot you start. Trail almost immediately starts going down, albeit gradually, till you get to the campsite in about 3-4km. I think this is the lowest point and ascent starts from here for the first time. But most of ascent is very gentle and you can continue the good running pace. At about the half way point meadow you get to see Brothers mountain still quite far away, but you will get there rather quick as the climb is very gentle. You will continue with cliff on your east side(but not scary sudden drop type like in North Shore mountains). Then there is a clear sign at the second turn off on the trail for Brothers mountain.\nAfter the junction the ascent has a short somewhat steeper section but no need to walk here as it ends quickly. Because there are no trees there the whole mountain scale looks big but actually from this point the peak is a mere hill away. Soon you get to enjoyable ridge with good view on both sides and after few crawling you get to the top. Great view from the top.\nReturn is straight forward. But because the bottom of the trail is at the roughly the half way point, you need to climb again to get back to the parking. Some guidebooks said vertical drop is 300m, but I felt its more like 600-700m. May be because of fair amount of mini ups and downs of 10-30m.",
    "directions": "Go to Manning Park; 45-60min South East of Hope on Hwy #3 towards Princeton.   Turn North off the highway(opposite side of the lodge or the lakes).  Follow the sign for \"Sub Alpine Meadows 15km\".   Follow the road, keep going past the end of the pavement until the dead end loop with park signs.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/6281/long_DSC02201-37278.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6281/long_DSC02202-37278.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6281/reg_DSC00001-11896.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6281/reg_DSC00003-11896.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6281/reg_DSC00004-11896.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6281/reg_DSC00006-11896.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6281/reg_DSC00016-11896.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6281/reg_DSC00038-11896.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6281/narrow_DSC00028-11896.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/three-brothers-mountain-running-only-near-hope-bc-6281",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "21 km",
        "Town": "Hope, BC",
        "Type": "out-and-back"
    },
    "title": "Three Brothers Mountain (running only)",
    "trail_id": "6281"
}