{
    "description": "A wide, easy trail to some tarn-speckled sub-alpine meadows, and the tackling of a scree slope to descend to a small lake. It's a three-hour roundtrip to the tarns, which can be a nice turnaround point for those with small kids or cheap shoes. The drive to the trailhead is about 45 mins from the highway - graded dirt, except the last few kms are on rough road. \r\rImmediately after the parking area, the trail crosses a bridge and eases into a gentle, wide grade that makes one wonder why they didn't bring their mountain bike. 15 mins later the trail crosses back over the creek (no bridge) and while an easy rock-hop in late August, the creek's nature hints at a frightening ford earlier in the season - plan accordingly. \rThe trail, still wide, cuts back into a long switchback that leads out of the valley bottom. 30 mins from the parking area you arrive at a convoluded 4-way junction - this is the bottom end of a lollipop loop. I recommend the right trail as it follows the creek and almost immediately opens into a low meadow along a scree slide. It then cuts up a short but steep slope to dump you into the meadow proper. \rThe left trail continues upward through forest and features a steady climb the entire way (a more efficient return route). The junction in the meadow is obvious, but unsigned. \rWithin an hour from the car, you arrive at the tarns. Cross them to the north side and the trail continues through a narrow gap between slopes, then curves left to the base of a large, looming scree slide. The small pass is evident at the top of the slope, and while clambering up a do-it-yourself route is certainly possible, the established trail makes things easier (especially for the descent). \r30 mins from the tarns sees you at the pass, and the trail's high point. You cannot see the tiny blue lake as yet, but can catch glimpses through the trees as you wind down the hillside. In two hours total, you can be dipping your toes in the chilly waters of Tanglefoot.",
    "directions": "From Cranbrook, head north on HWY 3. Take hwy 95 at the junction (following signs for Fort Steele). Shortly after the fort, watch for paved Wardner Fort Steele rd on the right, which you follow just over the Wild Horse River and left onto Mause Creek Rd. In less than 1km, another Mause Creek Rd shoots left toward the mountains - ignore the DEAD END sign, dozens of roads continue for ages after this point.\rAt the first major intersection, stay left on Boulder Crk (may be signed for the Fisher Peak hike - same area). At the 4km marker, stay right, and continue straight where a faint road cuts across the main one. \rThe road is in pretty good shape until it begins to climb, then you are faced with half an hour of choppy, chunky road, with sections of redeeming smoothness. No major waterbars or creek crossings, so any decent car could handle it.\rYou may pass some cars at the Fisher Peak trailhead, continue straight for ten minutes or so, the road will end in a wide parking area. The trail is signed as Mause Creek, but everyone knows it as Tanglefoot - either way, you're in the right place.",
    "geohash": "c2vf",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/6290/narrow_IMG-0727-Medium--26989.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6290/narrow_tangle-tarns-1287.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6290/narrow_tangle-trail-1287.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6290/narrow_tanglefoot-cascade-1287.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/tanglefoot-lake-near-cranbrook-bc-6290",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 5,
        "Time": "4 hrs",
        "Total Distance": "11 km",
        "Town": "Cranbrook, BC",
        "Type": "out-and-back"
    },
    "title": "Tanglefoot Lake",
    "trail_id": "6290"
}