{
    "description": "Bear's Hump is just over 1km (one way) with a 240m. elevation gain located in Waterton National Park in Southern Alberta.  The trailhead begins next to the ramp at the information centre.  The trail begins to  gain elevation quite soon after the sign (please stop and read the sign as there are often notices and bear warnings posted) and becomes progressively more difficult rather quickly.  This trail is aided by the series of switch backs and wooden steps placed strategically along some of the more difficult areas to help with footing.  While the trail may seem challenging and overwhelming for some it is well worth the effort. The view of the the valley, Waterton Lakes and Waterton townsite are spectacular so bring a camera.  We had a nine and six year old on this hike and they both did better than the adults.  Take plenty of water, especially on a warm day.  I love photography and for this spot I would recommend going up in the evening or early morning.  Not only will you have better lighting for photos it will be a cooler climb on a warm day. Have a picnic atop the rocks overlooking the park but watch for chipmunks.  Those little guys love nuts and will come to you if you offer.  But watch out once they know you have food they try to come home  with you.  I love this hike! It was a short but challenging hike plus the kids really enjoyed it too.  Make sure you take frequent rests and drink water on the way up, particularly with children.  Enjoy!",
    "directions": "At the information centre just after the gates at Waterton National Park, Southern Alberta.  Located next to the ramp.  Easy to spot.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/6293/reg_IMGP6186-25497.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6293/reg_IMGP6198-25497.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6293/reg_IMGP6348-25497.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6293/narrow_IMGP6240-25497.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6293/narrow_image-14642.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/bears-hump-near-waterton-park-gate-ab-6293",
    "stats": {
        "Activities": "river-canoe hike mtn-bike",
        "From": "",
        "Seasons": "summer",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "0 km",
        "Town": "Waterton Park Gate, AB",
        "Type": "out-and-back"
    },
    "title": "Bear's Hump",
    "trail_id": "6293"
}