{
    "description": "Tidewater Subdivision (TWS) railtrail is all that remains of the CNR tracks which used to connect Deerholm with Cowichan Bay tidewater pier starting in 1925. Today, the railtrail is in good summer condition for cycling or hiking due to constant use by local residents as a shorcut between Glenora Wine country and the city of Duncan, BC. Once the rains come, it will become quite muddy. We cycled the TWS from its current eastern terminus at Koksilah Road to the Kinsol Trestle on the Trans Canada Trail (TCT). The accompanying GPS track only shows the 6km part utilizing the TWS. Once on the TCT, one can turn left for 11km to Kinsol Trestle or turn right for 2km to glenora Staging Area (GSA). From GSA it's approximately another 20km to the western terminus of the TCT at the villaage of Lake Cowichan. N.B. The TWS trail is blocked from Langtry Road to Glenora Road by Seshia Road landowners. Therefore, one must ride around this section on Langtry and Glenora roads. The TWS can be picked up again westbound at Seshia Road.\r\n\r\nEdit test",
    "directions": "Northbound on Hwy-1, turn left onto Koksilah Road and stop at the 50km speed-sign 100m before Miller Road. The speed sign is on the righthand side of Koksilah Rd and the TWS trailhead is covered by brush on the lefthand (western) side. Look closely or you'll not find it. Actually, the eastern side of the TWS can be seen on the righthand side of Koksilah Road and may be suitable for parking one's vehicle. Make certain the vehicle tires are off the road's paved surface; also, don't become stuck in the ditch! Southbound on Hwy-1, turn right at the Allenby road traffic light then left onto KOksilah Road. Follow instruction above to trailhead and parking.",
    "geohash": "c",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/6294/reg_tidewater-cycle-kinsol-19432.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6294/reg_tidewater-cycle-koksilahparking-19432.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6294/reg_tidewater-cycle-road-19432.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6294/reg_tidewater-cycle-seshia-19432.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6294/reg_tidewater-cycle-tct-bridge-19432.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/tidewater-subdivision-railtrail-near-duncan-bc-6294",
    "stats": {
        "Activities": "hike mtn-bike",
        "From": "",
        "Seasons": "summer",
        "Stars": 5,
        "Time": "1 hrs",
        "Total Distance": "2 km",
        "Town": "Duncan, BC",
        "Type": "out-and-back"
    },
    "title": "Tidewater Subdivision Railtrail",
    "trail_id": "6294"
}