{
    "description": "Fundy Paddle Attack 2009\nBelow is a log of our recent adventure on July 27 - Aug.1. We paddle from Cape Chignecto through to Five Islands in the Bay of Fundy. Culprits: Blair & Angela Doyle, Tony Isaacs and David Hubley. Attached is the maps with our track - it was 117 km as the GPS rolls. We did nightly SPOT check-ins and you will see (and at times not see with the fog) it was a place I will be returning to someday soon as it rivals Cape Breton in landscape and is indeed a \"natural wonder\" with it's changing seascape. \nThe tidal range was upwards to 37 ft. and the resulting paddling strategy on departure / landings and around headlands played into the challenge. \nDay one - Monday\nAfter dropping into the Cape Chignecto Park office to check/ pay - in we arrived at Spicers Cove at 1400 hours to bump into Derk from Nova Shore Adventures. He was leaving from just having done a tour to the Three Sisters. The last 4 km of road was sloppy and rutty with dump trucks passing regularly, but the old van pulled through. We loaded our boats and in the bright sun headed for Seal Cove by 1600 hours on the high tide - now out going tide which is in our favour. \nAs we paddled around the Three Sisters our old friend FOG began to intermittently visit and made for a blurred view of the area. The spires and caves enroute to the sisters and Eatonville Cove after them was grand to paddle around too. Seal Cove was a driftwood wall and it was nice to see as it is indicative of an area that has been less impacted by the wrath of human kind. We camped down on the beach - the upper beach ;-) - instead of trucking all our gear up to the sites we had booked. Actually enjoyed a lovely salmon and veggie/noodle dinner from Ang. \nDay two - Tuesday\nWe got up and onto the water for 0945 hours and departed on calm seas into the fog during the dropping tide with the intent to catch the low tide slack at Cape Chigecto and run the with incoming tide along the coast. It was a dark and revealed sea-bed rumble along the shore to the Cape and around. We stopped at Broad Cove (just around the cape) for some lunch and Dave's beans. \nAs we were departing and we got layer up, the sun broke through the mist and brightened up the day until we got to McGahey's Brook just before the West Advocate beach area. This area of coast was amazing with the high cliff and varied rock being brightened by the sun. We stopped to check out a ladder / stairway that lead to the trail above and a 'last chance to return' caution note was posted for would be beach combers. Our friend FOG returned at about now and we had a long hour and a half paddle in the pea soup visibility, but gentle swell along Big Beach until we 'suddenly' entered Advocate Harbour due to the current flushing in past the breakwater. It was fun actually as our sense of direction was way off with the fog and we explored south into Lubber Hole for a possible campsite. It was 1600 hours and our friend left us again (the fog) to reveal a nice calm harbour just about flooded full and an eagle perched atop a tree. The campsite along the berm were quite exposed. \nWe decided to make a run for Cape D'or in the now - suddenly appearing - bright sun to catch the finishing flood and high tide slack to get around. Going around the most dangerous Cape in the maritimes in without the fog was also part of the attraction. The waters were expectedly churned up towards the Cape and we had some fans (tourists) resting on the rocks as we rounded. The famous Dory Rips could easily be seen in the distance, but the slacker water next to the shore was kind to us. \nIt was not as smooth sailing as we had thought though - as we made our way to Horseshoe Cove we had to punch into the out going rips around a few of the points. You could really see the rips increasing once we got into our campsite in the cove. \nIt was late and we had one of the biggest days paddling in awhile - we covered over 35 km, but enjoyed Tony's (really his wife Deb's) Jumbali - with extra scallop for me..............  \nDay three - Wednesday\nWe awoke to our old friend FOG and decided to wait until the low tide at 1300 hours to paddle. After breakfast we trekked to the Cape D'or Lighthouse to listen to the fog horn..... It was a bit sunny where we were by then, but the view at the lighthouse was all white. A sin for the visitors they were getting, but par for the course in this end of the world. \nWe fielded a few visitors ourselves where we were camped, and as we were leaving a family came down and went beach / sand flat hiking with a pup (fireball). We were back on the water as scheduled for 1300 and rounded Cape Spencer and had to ride through in the incoming rips at our back, had a late lunch on the rocks opposite Spencer Island and as the sun shown on us we made our way - way - way along Greville Bay. The winds were supposed to be SW, but we had a light NE (head wind) from about the middle of the bay to our break / stop just past MacKay Brook.\nThe view was great but the bay was long and fog continually threatened in the distance. We even got to re-pass Fireball and the family we originally encountered at Horseshoe cove at departure. They were at Fraserville beach as we paddled by. \nAfter a break we were into the pea soup fog again for the last 9 km to our chosen campsite just past Fox Point. This paddle felt as though we were in a tunnel with the fog so thick and the seas so calm. I knew the entire Bay of Fundy was on my right, but it felt as though I could just head over to the other side of a river. We arrived at 1930 hours and Davy cooked up some Campbell's Chicken mix. It was a short fire and off to the pillow gods after another 29 km.\nDay Four - Thursday\nWe got up to a clear sky and a full view of Cape Split only 5 - 6 km across the bay. With an outgoing tide we were on the water by 1030 hours and on a calm sea we plugged our way against the tide towards Cape Sharp. We had a few outgoing rips to skip through, but had no problem making steady headway. \nAs we approached Black Rock, just before Cape Sharp, the sky was threatening and a stop for lunch had us under the Bothy Bag (quick shelter) out of the wind and rain. A fishing boat was working some lines just off shore and we watched a tree whiz by in the strong current when we stopped. As we got going again, it was beginning to return. \nWe waited until the tide changed at 1400, worked our way to the cape and rounded Cape Sharp in some very fast tail rips - that were in our favour. The rain through Parrsboro Bay was extremely heavy and steady, and the fog returned whiting out our view of Partridge island where we were to camp. \nThe water, due to the heavy rain dropping out of the small bay and off the Partridge island estuary was something to see. Tony scouted for the site and ran about 500m just to get a boo at the land. We tugged our boats up the 'very full' stream in the mudflat and onto high ground. Until now the wind was gentle from the SW. As soon as we started to put the tarp - it came - and it blew 40 + knots and heavy rains for about 10 minutes and all we could do was cower under a tarp. We were glad to be off the water. \nWith the wind not letting up, we sourced around the whole area for a protected camp spot and ended up tucking into the upper bay on the grass. We dragged the boats the rest of the way, set up camp and hiked the 4 km into Parrsborro for supper by 1945 hours. We returned by 2200 hours and dropped off to dozer land after a 17 km paddle and a wild afternoon 'rickshawing' hauling boats. \nDay Five - Friday\nWe awoke to a tree that had fallen on or tarp and clear and calm skies. After another short drag, we got on the water for 845hours, rounded Partridge Island and paddled up to a restaurant on the east side of Parrsboro for some breakie. This large scoof of food prepped us and we were on the water by 1100 hours, in the sunshine and against the dropping tide. \nThe goal today was Five Islands via Clarke Head and The Brothers islands. We got to the Brothers for 1315 hrs where we hiked and explored to await the low tide to switch at 1530 hours. Besides lots of rocks and views, we saw some eagles and a young seal sunning itself - and it didn't see us so we got lots of pics. \nWhen the tide changed we rounded the ocean side of the littlest Brother and made very quick time to the Five Islands and Pinnacle Island. It was 7 km away and we were doing 7 - 8 km an hour with slight tail wind and tail tide. \nWe pitched camp on Pinnacle and enjoyed some yummy Spaghetti with fried Pepperoni chunks from me (Blair). Dave made a very entertaining attempt to make some cookies too...... we buried his super-dooper creation for future geologists to try to identify. We did a before-dusk paddle around the island on the high tide and hit the hay by 2200 hours after a very sunny 25 km paddle. \nDay Six - Saturday\nWith a grand view of the rest of the islands we got underway at 0900 hrs to give us about an hour and half before the incoming high tide changed and dropped. Not before Ang brewed up some terrific Cinnamon roils - of course! We explored the remainder of the islands enroute to our takeout at Sand Beach Point. The most notable was Long Island where the Run for Moses race occurs each June and the top of the island has been made into a retreat by American Dick Lemmon . We were ashore by 1030 hrs, but the 2.5 hour drive to Spicers Cove to get the van got longer when we found a slashed tire. Resulting we didn't get back to Dave and Ang at the put out until 1500 hrs, but only had a 6 km paddle today. \nGood time was had by all; the weather and sea state was pretty friendly compared to what it could have been. This trip was low on the wildlife scale, but very high on the scenery and environmental appreciation scale. A geologists playground I would call it.\nBlair Doyle",
    "directions": "http://www.capechignecto.net/about/index.htm",
    "geohash": "f8",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/6299/reg_FundyPaddleAttack2009Blair-179-0.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6299/reg_FundyPaddleAttack2009Blair-187-0.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6299/reg_FundyPaddleAttack2009Blair-199-0.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6299/reg_FundyPaddleAttack2009Blair-232-0.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6299/reg_FundyPaddleAttack2009Blair-252-0.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6299/reg_FundyPaddleAttack2009Blair-273-24583.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6299/reg_FundyPaddleAttack2009Blair-389-24583.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6299/reg_FundyPaddleAttack2009Blair-412-0.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6299/reg_FundyPaddleAttack2009Blair-426-0.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6299/reg_FundyPaddleAttack2009Blair-456-0.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6299/reg_FundyPaddleAttack2009Blair-479-0.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6299/reg_FundyPaddleAttack2009Blair-516-24583.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6299/reg_FundyPaddleAttack2009Blair-521-24583.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/cape-chignecto-to-five-islands-near-parrsboro-ns-6299",
    "stats": {
        "Activities": "sea-kayak",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 4,
        "Time": "42 hrs",
        "Total Distance": "117 km",
        "Town": "Parrsboro, NS",
        "Type": "out-and-back"
    },
    "title": "Cape Chignecto to Five Islands",
    "trail_id": "6299"
}