{
    "description": "This is a short synopsis of one of our Highlands of Cape Breton trips we took in mid-August of 2008 - hopefully it will offer some thoughts for folks looking to go. Caution - it was the gentlest trips weather - seastate wise I have ever had around this area and literally a Sea World of wildlife too. Monday - 40.23 km - start 0947 - 1751 hours - over 8:08 hoursLeft out of Cheticamp River from the Parks Canada warden station up the coast towards Fishing Cove. Sunny and winds were non-existent until we got to the cove and blew a light 5 knot along our tail. Lots of Eagles, Seals, Mackerel, Shearwaters and encountered a couple of pods of Pilot Whales as we were completing the crossing of Pleasant Bay. Had one breach completely out of the water about 50 feet behind us. Thought we had a sick pilot whale in the shallows before Pollets Cove, but it tuned out to be a Basking Shark ( 30 - 40 ft) and it was right under our boats for awhile. Met some 3 other folks that were headed around to meat cove in kayaks and two characters from Eskasoni  that were staying the month at Pollets.........  It was cool to watch the squadrons of Shearwaters dive bomb the ocean getting fish. Tuesday - 24.74 km - start 1119 - 1640 hours - over 5:21 hoursRelaxed and went for a short walking tour about the cove. Left with winds almost non-existant again and did some substantial caving on the way up to Cape St. Lawrence. Winds were variable until we got to the cape. Checked out the 'very wet and windy' camp site there and came around the bend into a 15 knot easterly head breeze, but were the seas were settled enough we were still able to get under the archway just past the cape. The one in all the NS tourism commercials.... We landed at the waterfalls in Meat Cove and settled in for the night. We had a Basking Shark constantly prowling the cove throughout the evening. Wednesday - 18.23 km - start 0802 - 1124 hours - over 3:22 hours\tand - 5.36 km - start 1500 - 1615 hours - over 1:15 hoursLeft early today to get across Bay St. Lawrence before an afternoon predicted 15 - 20 knots winds from the east. As we rounded the point into Bay St. Lawrence we began to count dbl fumes of water spouts in all directions. It was flat calm again and we could see Sea World going on in the bay. As we drew near to the center we were surrounded for most of the crossing with Fin Whales, White Sided Dolphins, Porpoise, Minke Whale, and the ever present seal. The highlight was when a hugh Fin Whale broke the surface 20 ft in front and between us as we neared the east side of the bay. It was incredible. After making around Money Pt and to the Gulch before noon, the wind began it's blow as we arrived. We lunched and slept for an hour, then when for a late afternoon cave explore and rock hop north of the campsite in the 20 km sow-west with gusts of 30+ with the down blasts from the hills above. Thursday - 19.65 km - start 0836 - 1254 hours - over 4:17 hoursGot up, retrieved my sunglasses in the waterfall from the night before and got under way early.  With flat calm seas 'again' we rock-hopped and water fall-ed our way down to Cabot Landing then onto South Harbour and Eagle North Outfitters to the van. Got flashed by an older couple skinny dipping on North Harbour beach........... ! Finding the entrance to the harbour was fun - very deceptive and quick-sandy. Grand times were had. Total - 108 kmBlair Doyle",
    "directions": "http://www.pc.gc.ca/eng/pn-np/ns/cbreton/visit/visit2.aspx",
    "geohash": "f8",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/6300/reg_CapeBretonHighlands2008-017-24583.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6300/reg_CapeBretonHighlands2008-043-24583.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6300/reg_CapeBretonHighlands2008-056-24583.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6300/reg_CapeBretonHighlands2008-064-24583.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6300/reg_CapeBretonHighlands2008-072-24583.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6300/reg_CapeBretonHighlands2008-079-24583.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6300/reg_CapeBretonHighlands2008-104-24583.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6300/reg_CapeBretonHighlands2008-112-24583.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6300/reg_CapeBretonHighlands2008-115-24583.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6300/reg_CapeBretonHighlands2008-190-24583.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6300/reg_CapeBretonHighlands2008-208-24583.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6300/reg_CapeBretonHighlands2008-225-24583.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/cape-breton-highlands-near-cheticamp-ns-6300",
    "stats": {
        "Activities": "sea-kayak",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 4,
        "Time": "35 hrs",
        "Total Distance": "108 km",
        "Town": "Cheticamp, NS",
        "Type": "out-and-back"
    },
    "title": "Cape Breton Highlands",
    "trail_id": "6300"
}