{
    "description": "The hike to the summit of Trophy Mountain starts with a worn trail past Sheila lake, past several alpine ponds and quickly moves from sub-alpine to the alpine as you make your own path amoung the boulders. Elevation gain from Sheila Lake to the Trophy Mountain summit is 500m, with the peak at an elevation of 2575m. Starting at Sheila Lake (having completed the 6 km from the parking lot of the trailhead to Trophy Mountain Meadows) continue following the worn trail towards the summit. Once the trail disappears, we headed to the west side of the summit, the least steepest approach to the ridge of the mountain. It is also the lowest point of the ridge and easy to spot from a distance. Here the terrain is mostly boulders and rocks to scramble over. Once on the ridge, the hiking is moderate with mostly the alpine taking away your breath as the hiking is not difficult from this point. Be forwarned that hiking along the ridge it appears the summit is close, until hiking to that point only to discover there's another 20 min. of hiking. Again, and again. We made this mistake several times. But the views are worth the effort!!",
    "directions": "Drive to Clearwater on Hwy 5 and turn North onto Clearwater Valley Road at the Wells Gray info centre. Travel 11.8 km and turn Right onto a marked gravel road leading to Trophy Mountain Meadows. Follow the signs along this 12 km road leading to the trailhead for Trophy Mountain. Follow the well-worn/marked 6 km trail to Sheila Lake. Continue following path around the lake to head towards the summit of the mountain.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/6310/long_IMG-1642-14056.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6310/long_IMG-1655-14056.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6310/long_IMG-1660-14056.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6310/long_IMG-1662-14056.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6310/reg_IMG-0014-21577.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/sheila-lake-to-trophy-mountain-summit-near-clearwater-bc-6310",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 4,
        "Time": "5 hrs",
        "Total Distance": "1 km",
        "Town": "Clearwater, BC",
        "Type": "out-and-back"
    },
    "title": "Sheila Lake to Trophy Mountain Summit",
    "trail_id": "6310"
}