{
    "description": "Scenic Point is a minor peak near Two Medicine Lake Glacier National Park, Montana. The well maintained trail continues past the viewpoint all the way to the village of East Glacier. We stopped at Scenic Point and enjoyed the great weather and views of the mountains to the west and the prairies to the east. We could even spot the Sweetgrass hills off in the distance. \nWe were tempted to continue further afield to Medicine Point but decided to save that for another day. An interesting ridgewalk described in the climber's guide is to do a big loop starting on the trail and hitting Medicine Point, Mt. Henry and Mt. Appiskoti all in the same day (see trail posting here on Trailpeak for  The Scenic Point Traverse  ). From Mt. Henry you would drop to the saddle between Mt. Henry and Appiskoti and then either go back down from the saddle, or run up to tag Appiskoti and then descend via the saddle back down the drainage and eventually crossing the drainage and rejoining the scenic point hiking trail. \nElevation gain: 682 m (2,240 ft) to Scenic Point\nEl. at summt: (2,292 m) 7,522 ft\nDistance: 12.3 km (7.7 miles)\n5 hours round trip including lots of breaks.",
    "directions": "The trailhead is located just a short distance from the Two Medicine Campground. At the (signed) trail head there is parking lot. \n[We traveled down from Lethbridge, AB and discovered on the way back that the fastest route to access East Glacier is to take the Del Bonita border crossing and cruise through the town of Browning.]",
    "geohash": "c2x7",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/MT/6311/long_merged-shot1-7490.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/6311/reg_IMG-6767-7490.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/6311/reg_IMG-6768-7490.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/6311/reg_IMG-6791-7490.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/6311/narrow_IMG-6793-7490.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/scenic-point-near-east-glacier-park-mt-6311",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "5 hrs",
        "Total Distance": "12 km",
        "Town": "East Glacier Park, MT",
        "Type": "out-and-back"
    },
    "title": "Scenic Point",
    "trail_id": "6311"
}