{
    "description": "Calf Robe Mountain is accessed by Firebrand Pass  near East Glacier (Glacier National Park, Montana).\nFollow the hiking trail towards Fireband Pass (described elsewhere on trailpeak). Hiking towards the pass, the south ridge of Calf Robe mountain can be gained before entering the valley heading towards the pass between Calf Robe and Redcrow mountains. \nAlthough a bit of a slog to gain the ridge, the views really open up once you get onto the ridge and from there it's an easy class II scramble to the summit. From the summit the views are most worthwhile! You can make out views onto the prairies to the east and most notable peaks include Summit Mountain to the south and Grizzly peak to the north. \nIt's a pretty full day to summit Calf robe, but since you're there a person could also tag Redcrow mountain as well, if you were willing to drop down to the pass and ascend another 1,000 ft or so to Redcrow's summit. We discussed the idea briefly but decided to bail on Redcrow and hoof it back to the parking at Lubec trailhead (I think this is the correct trailhead name... to confirm!)",
    "directions": "See Firebrand Pass  description. From the village of east Glacier, drive approximately 10.3 kms down the highway. Look for marker 203 and pull off on the parking near the rail (Lubec trailhead, I think.)",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/MT/6313/long_2-calf-robe-summit-merged-shot-north-eastsml-7490.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/6313/long_MERGE-going-downsml-7490.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/6313/long_profile-calf-robe-7490.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/6313/reg_IMG-6814sml-7490.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/6313/reg_IMG-6865-calf-robe-mountain-in-the-distance-sml-7490.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/calf-robe-mountain-near-east-glacier-park-mt-6313",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 4,
        "Time": "7 hrs",
        "Total Distance": "16 km",
        "Town": "East Glacier Park, MT",
        "Type": "out-and-back"
    },
    "title": "Calf Robe Mountain",
    "trail_id": "6313"
}