{
    "description": "NTS Map 83E/14\rElevation Gain: 1475m\r\rLightning Ridge (2475m) is the highest point in the immediate area around the town of Grande Cache.  Despite a difficult hike with a one-way distance of 11km, the views from the top are impressive on a clear day.  However, on a stormy day this is not the place to be!\r\rThe first 6km follows the same trail as for Mount Stearn,  found here.  Once into the pass to the North of Mount Stearn, the trail branches to the right and traverses a treed slope towards Lightning Ridge.  Look for the occasional red trail marker.  This section of trail is plagued by branches at body-height, most of which fight back when pushed out of the way.  After 8km, what is left of the trail forks at the base of the ridge. The left path will go to the South of the ridge and back down to the Smoky River.  The right path meanders down the drainage to the East of the ridge and takes off towards the Sheep Creek valley to the North.\r\rAt this point, leave the trail and head straight ahead between those two trails up a very steep hill, known locally as \"Big Hill\".  There is no trail here, but angle up and to the right.  A decent amount of vegetation makes the climb a little easier on the legs.  Once on top of the hill, cross the saddle and climb a worn path up the final summit ridge.  A register marks the summit, part of the Passport to the Peaks program.\r\rThe easiest way down is to return using the same route (22km total distance).  An alternative is to traverse along the ridge to the North, which is about 4km in length.  After descending off the North end, find the trail from Sheep Creek and follow it on the East side of Lightning Ridge back to the base of the big hill.  Then return along the original trail (31km total distance). \r\rNote: GPS data and route overlay on NTS map are for the entire traverse.  For the direct route, take into account the first 11km section.",
    "directions": "From the town of Grande Cache, take Hwy 40 North for several kilometres. After crossing the bridge over the Smoky River, turn left on the Sulphur Gates Road. Travel 3.5km to the trailhead, located on the North side of the road just after a gravel pit. A small parking area is on the opposite side of the road.",
    "geohash": "c3e",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/6316/long_083e14-route-detail-2-11604.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6316/reg_IMG-3166-sm-11604.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6316/reg_IMG-3168-sm-11604.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6316/reg_IMG-3181-sm-11604.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6316/reg_IMG-3182-sm-11604.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6316/reg_IMG-3185-sm-11604.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6316/reg_IMG-3191-sm-11604.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6316/reg_IMG-3212-sm-11604.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/lightning-ridge-near-grande-cache-ab-6316",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 5,
        "Time": "10 hrs",
        "Total Distance": "22 km",
        "Town": "Grande Cache, AB",
        "Type": "out-and-back"
    },
    "title": "Lightning Ridge",
    "trail_id": "6316"
}