{
    "description": "The ONLY reason this trail gets a 3 is because the waterfall and its surroundings are really cool. Otherwise, you're dealing with sweeping vistas of airports, the unrelenting thrum of hydroelectric stations and, in the summer, the oppressive heat of the Columbia Valley. On the bright side - it is extremely well signed from toe to tip.\r\rIt is actually several trails all convoluded into one as the waterfall, in my humble opinion, is the only worthwhile destination. There is a closer parking area, also, which would reduce the roundtrip distance to maybe 6km (see directions below).\r\rWe started off at the golfcourse trailhead, keeping left for the Elk Cut-off trail (right is Dove Hill trail - a tedious series of switchbacks on a baking hillside that leads to the top of a hill and some 360 degree views of industry and brown terrain. You can make it a loop on your return, but why bother?). The Elk trail climbs along a dirt service road to a series of radio and TV towers, where a proper trail cuts into the greenery on your right. \rFrom here its a shady amble through mixed pine forest, where, after about 2km, you meet up with the end of the Dove Hill trail and begin to descend. \r\rYou'll then pop out onto a dusty access road right next to Brilliant Generating station, which you have to walk right past. This trail doesn't exactly immerse you in the trappings of wilderness, but the falls are worth it, trust me. \rYou are now on the Scatebo Reach trail, which is the major artery that runs 12km from this point to the ferry/trail-only access community of Glade. The route winds along open cliffside for a while, where you can enjoy the chest-rattling hum of the plant, along with views of the highway and dam below, as well as the smokestacks of the pulp mill in the distance. Near the top of the open plateau is where the second trail-head is located.\rSoon you return to the cooler forest, where you will see the remains of the old Doukhabor water-transport system along the trail. The big, chunky bluff looming above to your right is the Brilliant Overlook - the spur is well-makerd if you wish to tackle the 300m ascent for even bigger views of nothing special. (Sorry Castlegarians... you've just made a mess of the valley. I'm sure it was pretty a century ago!).\rContinue onward and the forest becomes thicker and cooler - in the spring and early summer the ground will be spongey and wet. Soon you reach another spur signed for \"McPhee falls- 5 mins\". Even in September, after a very dry summer, McPhee creek was running, though the falls would be far more impressive in, say, June or July. \rThe area around the creek is like another world - cool, moist, green. The trail crosses a sturdy bridge and ends right at the base of the falls; the cascade itself is a 4 or 5-meter high curtain, seeping over a sheer, mossy rock wall.",
    "directions": "From Castlegar, follow the signs for Nelson and the airport out of town. Just past the airport, watch for golf course signs leading to the Castlegar Country Club (Ootsishenya rd). Just through the golf course gates, on the left hand side is a short dirt track leading to the trailhead parking area. Maps may be available in the info box.\r\rThe second option, closer to the falls, is at an unsigned park & ride along the highway, beyond the airport and golf course, just before the bridge crossing the Kootenay river. A road extends upward beyond the park and ride, where you will meet up with the Scatebo Reach trail shortly after the Brilliant Sub-station. Continue to the left for the falls.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/6321/reg_mcphee-view-1287.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6321/narrow_mcphee-falls-sat-1287.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/scatebo-reach-mcphee-falls-near-castlegar-bc-6321",
    "stats": {
        "Activities": "hike snowshoe",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 3,
        "Time": "3 hrs",
        "Total Distance": "10 km",
        "Town": "Castlegar, BC",
        "Type": "out-and-back"
    },
    "title": "Scatebo Reach / McPhee Falls",
    "trail_id": "6321"
}