{
    "description": "A gentle trail through open pine forest in Syringa Provincial Park, overlooking Arrow Lakes. Pets are welcome, but on leash. Though the main trail is easy, there are two optional viewpoint extensions which can significantly increase the difficulty and elevation gain of your outing.\r\rThe trail begins with some easy switchbacks to the top of a bluff, from which point onward it is a gentle meander through sunny, open forest. The trees are mostly yellow pine, but are interspersed with the usual conifers of the region. There are a number of interesting rock outcroppings along the way. \rThe first viewpoint spur is a detour of about 1km (one way) and a gain of (guessing) 150m. At the outset, the trail is clear and wide, but the way is unmarked, and once the route leaves the forest and encounters steeper rock faces, it becomes several boot-beaten options. It appeared as though the main route stayed to the right, just below the knoll, and curved almost around to its back.\rThe viewpoint is an open rock face with a nice vista of arrow lakes and the surrounding mountains. The peak a little behind you and to your right is where the second viewpoint trail takes you. If you lose the path on your way down, just stay on the spine of the little ridge, the trail will reappear soon enough.\rAbout 1km after returning to the main trail you'll encounter the second viewpoint spur. I did not take this one, but it appears much longer, and climbs significantly higher than the first.\rScant meters later is a fork - the left returns in short order to the road below, just above the park gatehouse. It is possible to cross to the lakeshore, where there is an open, rocky beach, and follow the shore back to your car.\rThe right extends your walk by 2 km along the Yellow Pine Trail, which returns to the road above the very end of the campground area.\r\r\r\r",
    "directions": "There are 3 access points. The first is immediately after the initial, closed, gate to Syringa day-use area. Keep an eye out for a service road on your right, about 10m past here are stairs leading up into the woods. Parking along the roadside is permitted.\rThe second is just across the road from the gatehouse, signed with a picture of a hiker. \rThe third, also stairs leading into the woods, is just across the road from the tippy-tip of the campground.\rYou can return via the trails, or drop to the lakeshore. There is a trail just where the trees meet the beach, but it ends about 1km from the first trail head at the road. I prefer to rock-hop along the water's edge all the way down to the day-use area.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/6322/reg_syringa-loki-1287.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6322/reg_syringa-path-1287.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6322/reg_syringa-shore-1287.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6322/reg_syringa-view-1287.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/syringa-yellow-pine-trail-near-castlegar-bc-6322",
    "stats": {
        "Activities": "mtn-bike hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "11 km",
        "Town": "Castlegar, BC",
        "Type": "out-and-back"
    },
    "title": "Syringa / Yellow Pine Trail",
    "trail_id": "6322"
}