{
    "description": "One of Rossland's newest trails, Tamarack was designed to give riders a forested climbing alternative to the Malde Crk logging road. It also provides a blue run option in what is otherwise black diamond territory. \r\rTo keep the grade ridable, trail builders inserted a whole whack of switchbacks along the 2.5km route, which limits your ability to cruise on the descents, but definitely lets you work on your cornering skills. \rThe entire trail is forested, the path itself consisting of packed dirt with occasional roots and imbedded rocks.\rShuttling to the top is still optional for those that simply want to descend, and now a group of intermediate and expert riders can start at the same point and descent via parallel trails. \rAt the bottom, Tamarack intersects Doukhabour Draw trail, to return to Malde Rd, stay right. The next junction is with a wider track/road, stay right again and follow this all the way to the paved road and lower parking area.",
    "directions": "From lower Rossland, follow Spokane St back beyond the residential area. Pass a section where the road is divided for a short stretch, then ignore Ross St on the right, take the next left at Drake's and stay right at the final fork. Malde Rd will end and the FSR will begin; there is a parking pull-out just before the dirt road begins, if climbing, park here. \rTo the right is an unsigned dirt road, take this to another dirt track almost immediately on your left. Follow this to a signed intersection, take the trail leading uphill called \"Doukhabour Draw\". After several meters, reach another trail junction, take the trail to the left signed \"Tamarack\".\r\rIf continuing by car up Malde FSR, climb about 2km - keep an eye out for a flat parking area with an orange gate on the left, continue a little further until the climb crests. You will see a trail on the right, this is the lower entrance of Tamarack, you want the higher one, so go a little further. There is a widening in the road for parking, and on the right-hand side is the signed beginning of the Tamarack trail. There is a fork almost right away, stay left and high, the low fork simply pops you out a little further down the road.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/6325/narrow_tamarak-1-1287.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/tamarack-bike-near-rossland-bc-6325",
    "stats": {
        "Activities": "mtn-bike",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "5 km",
        "Town": "Rossland, BC",
        "Type": "out-and-back"
    },
    "title": "Tamarack Bike",
    "trail_id": "6325"
}