{
    "description": "This little used Gladstone PP trail is accesible only by boat, or 12km hike/bike to the starting point. It climbs 700m over 3km, with not a single switchback. Plan for 3 hours up, 2.5 down. Due to limited use and zero maintenance by park staff, some areas are becoming overgrown, but the route is very well tagged. The views of Christina Lake are stunning, and the destination lake is pretty, but not a must-see by any means.\nThe beach at this end of Christina Lake has a great forest service Rec site with outhouse, picnic tables and fire pits. The trail begins at Troy Creek rec site, in the far west corner where the forest begins in earnest. It climbs immediately and steeply until reaching the lowest of the rock bluffs, providing a nice teaser view of the lake.\nIt continues more moderately along the bluff, and then turns sharply into the trees and continues its no-nonsense ascent to a second rocky area with even better views of the lake. Here, the route remains exposed for a time, as the  trail, still steep, clambers along and around the rock face. It appears that the summit looms just above you, but when you arrive, you find that the trail cuts sharply left into a gully, on its way to the next ascent. \nAs the trail drops a little into the cool forest and evens out, it is plagued by shrubbery and brambles, but is still discernible. Then, inevitably, it cuts right and another steep ascent ensues.\nWhere this grunt levels out at somewhat of a plateau, you've gained 700m; from here to the lake you'll gain another 100, but over much gentler grades. The trail now bounces between forest and open rock, with the terrain changing enough to keep things interesting. Eventually, an old sign on a tree tells you you've travelled 2.5km, which is difficult to believe given how much energy you've exerted.\nAfter this, the trail drops into a bit of a hanging valley, with open forests and giant cedars - a bizzare landscape considering where you are. The trail will then climb steeply for a very short time, and eject you onto a long, flat, mossy rock. Here it will change direction somewhat, dropping you into a gully that follows the outflow from Xenia Lake. The grade from here in is pleasant, the path cool and shaded, and before you know it, you are perched just above the lake, with a negligible descent to its shore. \nThere is a trail ringing the lake, as well as a rec site where the dirt road from Grand Forks meets it on the other side. While a touch reedy around the edges, there are several spots where rocks jut into the water where one could easily enjoy a picnic and some sun, trying not to think about the knee-jarring descent.",
    "directions": "By boat, travel to the very north end of Christina lake, to a large beach signed \"Troy Creek Rec Site\".\nBy foot or by bicycle, follow the directions for the Deer Creek bike trail (on trailpeak) - it terminates at Troy Creek. \nThis would make a nice weekend outing - to bike or hike to the end of the lake and camp, then do the trail as a day-trip. It is absolutely impossible to bike the Xenia trail, so bring a lock for your ride.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/6326/reg_DSC-0005-1-2-1287.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6326/reg_DSC-0010-1-1287.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6326/reg_DSC-0011-1-2-1287.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6326/reg_DSC-0013-1-1287.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6326/narrow_DSC-0015-1-1287.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/xenia-lake-near-grand-forks-bc-6326",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 3,
        "Time": "6 hrs",
        "Total Distance": "9 km",
        "Town": "Grand Forks, BC",
        "Type": "out-and-back"
    },
    "title": "Xenia Lake",
    "trail_id": "6326"
}