{
    "description": "NTS Map: 92G11. I quite enjoyed myself on this hike. It stays at a generally low elevation and makes a 11.5 km (7 mi) round trip, which makes it an excellent all-year-round (almost) hike. It is accessible near Squamish--leave Hwy #1 at Horseshoe Bay and get on Hwy #99. Nearing Squamish you pass the large Murrin Provincial Park parking lot on the left. Park here, and then continue on foot towards Squamish. After a few hundred feet you'll see a trail heading up a steep bushy slope on the right.\r\n\r\nAfter a little ways of switchbacks, you'll get to a series of viewpoints that render magnificent views of the Squamish valley.  Next the path proceeds through some woods and onto an old logging road (now more like a big rocky path). This does almost a 90-degree turn and continues along, ending to lead you back in the woods. Eventually you'll emerge on a little ridge (quite cute!) that leads to a large rock platform. Soon afterwards you'll find yourself overlooking Petgill Lake.\r\n\r\nThe lake is fairly small, and you can quite easily circumnavigate it in just a few minutes. In case you're wondering, the best place to eat is right where you emerge from the trail and can see the lake (there is an open rock area).  If you head clockwise around the lake from this point, you'll soon see another trail that splits off to the left. It leads up to a ledge...that lends one the best view of the Squamish River (ummm, not the Fraser River) and Squamish that I've ever seen! The view from the top of Stawamus Chief is great, showing almost 270 degrees, right down into the valley, but from this viewpoint there seems to be a more artistic influence...making for a more interesting sight.\r\n\r\n\r",
    "directions": "See above.  There is GPS data attached to this trail (see \"download GPS\"), which if loaded into your GPS can help you find route points.\r",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/634/2752137602-682e703839-b-16154.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/634/reg_DSC00013-40639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/634/reg_IMG-3232-4608.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/634/reg_IMG-3237-4608.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/634/reg_IMG-3271-4608.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/634/reg_IMG01155-20120527-1258-40639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/634/reg_IMG01167-20120527-1440-40639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/634/reg_petgill2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/634/topo_petgill1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/634/narrow_DSC00005-40639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/634/narrow_DSC00018-40639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/634/narrow_DSC00019-40639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/petgill-lake-near-squamish-bc-634",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 3,
        "Time": "4 hrs",
        "Total Distance": "12 km",
        "Town": "Squamish, BC",
        "Type": "out-and-back"
    },
    "title": "Petgill Lake",
    "trail_id": "634"
}