{
    "description": "NTS Map: 92G6. Want to cleanse your mind of the city rush and busy-ness Take the ferry to Bowen Island and enjoy the hike to Mount Gardner - an 11 km trek with spectacular summit views on a clear day. The 20-minute ferry ride from Horseshoe Bay to Snug Cove adds to the joy and the feeling of - getting away. The hike to Mount Gardner's north summit is a pleasant hike, mainly under the coverage of trees along a well-kept and well-marked trail (UPDATE many hikers are noting the degraded condition of this trail in the comments). Pleasant also due to the fact that you'll hike mostly on the soft ?bed? of pine needles, with only a few rugged or rooty parts. We did the hike on a weekday, which left us almost all by ourselves on the trail. Once you get to Mount Gardner's north summit, your 719m high scramble (it is steep) will be rewarded by the views: Howe Sound and Gambier Island to the north, the Coast Mountains of the mainland to your north/northeast. Looking northwest, you can see the village of Gibsons; beyond is the Sechelt Peninsula, and southeast there's Vancouver and English Bay. Since we did the hike in early May, we got to see some of the mountains still snow-covered - which adds to the beautiful panorama. And according to our hiking guide, it's an all-year hike - except after a serious snowstorm.",
    "directions": "Take the ferry from Horseshoe Bay to Bowen Island. When we planned our trip to Mount Gardner, we decided to take our bikes along to Bowen Island so that we cycled the first 3 km to the actual trailhead (and back to the ferry terminal once we had descended). You can also walk to the trailhead through Crippen Regional park (add 3 km and 30 - 45 minutes one-way to the above given distance and hiking time). Thus, the directions to the trailhead given here are along Mount Gardner Road.  From Snug Cove, go straight along the main road up a hill, and turn right at the school onto Mount Gardner road. When you get to Killarney Lake, look for the numbers on the poles, and at pole 490 turn left. We locked our bikes to pole 491 on the other side of the paved road. Head left onto a service road (Bowen Pit road). Pass the gate and shortly after that, turn left towards the creek onto the Skid trail (Ignore the sign reading 'Hikers trail' since this is the less pleasant way on the old gravel logging road). Now, the trail is well marked with blazes and signs 'Mount Gardner' North summit. Don't get confused by the occasional mention of the 'South Route' ? you're still OK. Follow these signs to the 719m north summit. We descended the same route we came up; however if you look for more variety there are options for different descents.",
    "geohash": "c2b2",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/636/long_Untitled-Panorama2-35773.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/636/reg_HeyWhoCalled-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/636/reg_IMG-0475-21992.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/636/reg_IMG-0478-21992.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/636/reg_MountGardner.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/636/reg_OurRide-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/636/reg_dsc04580-19167_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/636/narrow_IMG-7848-35773.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mount-gardner-bowen-island-near-vancouver-bc-636",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 5,
        "Time": "5 hrs",
        "Total Distance": "11 km",
        "Town": "Vancouver, BC",
        "Type": "out-and-back"
    },
    "title": "Mount Gardner (Bowen Island)",
    "trail_id": "636"
}