{
    "description": "Always a treat in summer, this area offers an equally delightful wintertime experience. The pristine meadows filled with meandering streams, lakes and wild flowers in the summer are transformed into a winter wonderland when the snow starts falling.  A ski trip in to the Wendy Thompson Hut is a long but possible day trip, particularly in early spring when the days are a little bit longer. The hardest part is turning around and going home, so plan on spending the night in the well-appointed, comfortable hut. (The hut was built and is maintained by the Alpine Club of Canada Whistler Branch. Don't be a deadbeat freeloader. Pay the very modest per night fee.)\r\n \r\nAccess is easy provided that the Duffy Lake Road is clear.  Simply park on the North side of the road 400m past the Cayoosh Creek Bridge. From here, make your way in to the Cayoosh Creek FSR. The road wasn't obvious when I was there, due to snow ploughing, but it isn't hard to find. Just head in through the trees. When you get to the ACC sign, you know you're on the right track.\r\n \r\nThe winter trail breaks off from the summer trail upon entering the forested area, taking a higher route which crosses over the Mt. Rhor trail on its way to the first meadow. The trail climbs steadily, easing off as you approach the first meadow. Do not count on there being a trail. Route finding skills are required. If you can find your way to the first meadow though, it?s pretty straightforward from there.  The first meadow makes a great lunch stop and there is good skiing to be had on the Western slopes although I did not partake myself. We had hooked up with 3 guys from the ACC who gave us the 411 on the area. \r\n \r\nHead towards the end of the meadow where you will begin to gain elevation again. Before long, you will come to the lake. After skiing up hill all morning it feels good to stretch your legs as your skis glide across the snow on the surface of the lake. \r\n\r\n\r\n \r\nAfter the lake, you climb steadily through the trees for what feels like forever but probably wasn't more than 45 minutes until the hut comes into sight.  The hut makes a great base camp for exploring the surrounding area. The ACC guys spent 2 nights in the hut so they could ski the surrounding slopes.\r\n \r\nYou don't have to be an expert backcountry skier to have fun in this area. It is a strenuous day trip but does not require any technical skills. Anyone who is an average skier could manage this trip. \r\n   \r\n \r\n There is GPS data attached to this trail (see \"download GPS\"), which if loaded into your GPS can help you find route points.",
    "directions": "Drive 33 km from Pemberton, past Joffre Lakes, & over the Cayoosh Creek bridge.  400m past the bridge you'll see a big metal shed (I think they store snow clearing equipment in there). Park on the other side of the road and ski in from there.\r",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/638/reg_013.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/638/reg_5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/638/reg_IMG-0322b-6103.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/638/reg_IMG-0325-b-6103.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/638/reg_IMG-0332c-6103.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/638/reg_IMG-0409-6103.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/638/reg_best1_IMG-0427-6103.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/638/topo_reg_2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/638/narrow_3.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/638/narrow_IMG-0407-6103.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/638/narrow_newgeneralmap.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/marriott-basin-near-pemberton-bc-638",
    "stats": {
        "Activities": "snowshoe ski-bc",
        "From": "",
        "Seasons": "spring winter",
        "Stars": 4,
        "Time": "9 hrs",
        "Total Distance": "16 km",
        "Town": "Pemberton, BC",
        "Type": "out-and-back"
    },
    "title": "Marriott Basin",
    "trail_id": "638"
}