{
    "description": "NTS Map: 092H03I hope that someone will fill in the blanks for me on this trip. I did it too early in the year and had to stop short of the lake because there was just too much snow to continue.This trail is easily accessible and not bad as far as wooded trails go. I have to admit, I am somewhat biased in favor of higher alpine trails. There are several interesting river crossings that break up the monotony and offer an occasional view.Elevation gain is 880 meters and the trail is in good shape.  The second bridge is the most impressive. At 1.5km you have to cross a wire cable suspension bridge over Radium Creek. My son had fun swinging on it. You might have a hard time getting some dogs across it though. The grade becomes steeper after the bridge. You cross the creek again at 2.5km. On the other side you'll find an old cabin site. Another half a km brings you back to the creek. At 4km you will pass an old helipad and the grade eases. At the north end of the lake there is an old forest service cabin.Apparently Radium Lake is a good place from which to explore the surrounding peaks. Macdonald Peak and  Mount Webb are both accessible from the valley.",
    "directions": "?Zero? your odometer at the intersection of Chilliwack Lake Road & Vedder Road.  37.3km along Chilliwack Lake Road is the turn off (Paulsen Road) where you will take a right. There are several little cabins. Drive to the end of the road where you'll find plenty of parking. The trailhead is marked.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/639/reg_IMG-5324-14923.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/639/reg_Pictures042.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/639/narrow_Pictures006.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/639/narrow_Pictures009.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/639/narrow_Pictures020.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/639/narrow_Pictures023.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/639/narrow_Pictures028.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/radium-lake-near-chilliwack-bc-639",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 3,
        "Time": "5 hrs",
        "Total Distance": "11 km",
        "Town": "Chilliwack, BC",
        "Type": "out-and-back"
    },
    "title": "Radium Lake",
    "trail_id": "639"
}