{
    "description": "This trail makes a great day trip. It would be a long day with a heavy pack but the trail extends far beyond the second viewpoint if you are so inclined.  When most other trails are still covered in snow, you can still get a bit of an alpine fix by way of some spectacular views in spring time along the Sigurd Creek Trail.Do try to make it  past the second view point. Apparently there are spectacular views of the glaciers of Ossa and Pelion Mountains just one hour past the second look-out, but we were pressed for time and had to head back.  Easy access is another strong selling point for this trail as it is only 36 km past Squamish on the Ashulu River Road. Any car in reasonable shape can make this trip. Park on the main road and hike for 15 minutes along the A-200 logging road. You could drive it in a 4x4 or all wheel drive car but it's only 15 minutes and it's pretty narrow. Unless you don't care about your paint job, walk.From the trailhead, enjoy an easy 15 minute walk before starting your ascent. You gain about 1000 ft between here and the junction of Crooked Falls and the main trail and it's not on a nice wide maintained trail. The trail is marked but it's easy to miss the markers sometimes as you're paying closer attention to your footing.  There is a large white quartz rock about 10 minutes before you reach the turn off to Crooked Falls. Then the trail drops suddenly and comes back up to the junction.  We did not have time to visit the falls. Hopefully someone else will and will post some pictures.The first view point is about 10 minutes past the junction on your right. There is a log with a small plaque dedicated to Randy Stoltman and just beyond it, a wonderful place to stop for lunch and take in the view.  If you decide to continue to the second view point, the trail climbs very steeply for 15 minutes before levelling off and becoming quite boggy (at least in May). The trail is not in good shape here although hard working trail maintenance crews have done their best.  Follow Siguard Creek past some nice waterfalls and enjoy the relatively leisurely grade for a while because the trail turns away from the creek and climbs straight up hill up to the second view point. There are no switchbacks on this trail. Personally, I prefer it this way but its murder on the knees coming down.You cross a small tributary of Siguard Creek shortly before the second viewpoint and may see some flagging tape on your right. Do NOT follow the flagging tape. Stay left, following the orange markers. On your left you will see a large knoll. That's the second viewpoint.  The trail continues on from here but you really won't get any better views than you got from the viewpoint by continuing down into the valley. The trail is steep and slippery so don't bother unless you are continuing on to the next viewpoint about an hour further along the trail.",
    "directions": "From the traffic lights at Cleaveland Avenue in Squamish (McDonalds) set your odometer to '0' and continue up the highway for 10 km, turning left on to the Squamish Valley Road. Stay left and continue on after the road turns to gravel. Stay left again and cross the Squamish River over a sturdy wooden bridge. Cross 3 more bridges and after the 4th bridge you'll see branch road A-200 on your left. Park on the main road.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/641/reg_IMGP2284.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/641/reg_IMGP2290.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/641/reg_IMGP2300.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/641/reg_IMGP2310.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/641/reg_IMGP2315.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/641/reg_hike-sqm-6565-14798.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/641/reg_hike-sqm-6692-14798_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/641/reg_hike-sqm-6700-14798.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/641/topo_map1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/641/narrow_hike-sqm-6462-14798.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/641/narrow_hike-sqm-6573-14798.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/641/narrow_image.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/641/narrow_m-IMG-3439-29023.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/641/narrow_m-IMG-3440-29023.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/sigurd-creek-near-squamish-bc-641",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring summer",
        "Stars": 3,
        "Time": "6 hrs",
        "Total Distance": "9 km",
        "Town": "Squamish, BC",
        "Type": "out-and-back"
    },
    "title": "Sigurd Creek",
    "trail_id": "641"
}