{
    "description": "NTS Map: 92G7. This 10 km hike is in the Pinecone Burke Provincial Park, just east of Port Coquitlam. It makes a pleasant day hike, close to Vancouver but far enough to ?get out? and leave urbanisation behind. The goal of this trip is not a summit, but one, no two, nice lakes. Throughout your hike, you'll make approximately 860m of elevation gain, and the trail is fairly well marked with signs and flags. The hike offers a variety of pleasures: On your ascent, you'll have some beautiful views over the Pitt River lowlands. When we hiked it, the trail was ?crowded? with tiny frogs in various colours and shades. We also ran into a wild turkey, and due to fortunate wind, it didn't seem to bother at all about us four hikers plus Hailey, our Australian cattle dog companion, being so close. Hailey, however, seem to have a clogged nose or generally defective smelling instincts, because neither did she detect the crowds of frogs we passed nor the bird. Another attraction along the tour, is the old-growth forest that you'll get to see, some beautiful yellow cedar and mountain hemlock trees.",
    "directions": "Turn north off Lougheed Highway (Highway 7), on the east side of Port Coquitlam, onto Coast Meridian Road. Continue until Apel Road, where you take your right (approx. 2.5 km), and then right again on Victoria Drive. When Victoria Drive splits (at the top of a hill), stay on the left fork. Follow the signs to Minnekhada Provincial Park. Go straight; the road's surface will turn into gravel at some point (Quarry Road). From the entrance to Minnekhada, it is approximately 3.5 km to the trailhead. There's a large sign at the trailhead. The trailhead itself is a rather unpleasant sight ? lots of garbage and litter. Don't let your trip be spoiled by that picture--the trail itself is really clean. Your route starts on an old logging road, just to the left of the sign. Follow that road for about 5 minutes, and then go right onto the marked trail. From now on, the route is fairly well marked with signs and/or flags. Approximately 1? hours into the hike, the trail becomes less steep, and you'll reach a relatively flat spot. Shortly after that, you'll enter old-growth yellow cedar and mountain hemlock. From now on, the trail is more even, but also quite muddy and wet, especially early in the season. Taking your gaiters might be a good idea. Soon after that, we encountered the first snow-covered spots; also we noticed the more chilly air. 15 minutes from the flat spot, there's a junction marked with orange signs. You'll go on straight (left will take you to an old ski village) and you'll reach Munro Lake soon. To continue to Dennett Lake, make your way around the east side of Munro Lake, which we found less muddy than walking along the west side. Watch for the flags that mark the turnoff for Dennett Lake. Continue for about 1 more km, in which you make another 160m of elevation. We walked most of the time on snow here, and Dennett Lake was still frozen. Still, it's a beautiful spot to spend some time, on the east side of Burke Ridge, especially when it's a sunny day. To descend, we took the same route that we came up.  Map: Port Coquitlam 92-g-07",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/643/long_munro-map-10559.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/643/reg_2542356299-d075473bf1-14307.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/643/reg_2542356725-140e9c58a3-14307.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/643/reg_2543181756-2d7c85f172-14307.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/643/reg_3071-94341470445-666285445-2972685-460031-n-7770.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/643/reg_3071-94341475445-666285445-2972686-587613-n-7770.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/643/reg_DennettLake.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/643/reg_IMG-8536-10559.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/643/reg_IMG-8581-10559.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/643/reg_IMG-8597-10559.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/643/reg_IMG_2368.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/643/reg_IMG_2374.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/643/reg_View-13157.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/643/reg_best01_IMG-8478-10559.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/643/reg_poco-pitt-meadows-maple-ridge-pitt-river-13157.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/643/topo_Dennett_MunroLakes.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/643/topo_MunroLake-DennettLake.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/643/narrow_3071-94341415445-666285445-2972674-2086495-n-7770.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/643/narrow_IMG-8476-10559.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/643/narrow_IMG-8606-10559.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/643/narrow_MunroLake.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/munro-lake-dennett-lake-near-port-coquitlam-bc-643",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "6 hrs",
        "Total Distance": "10 km",
        "Town": "Port Coquitlam, BC",
        "Type": "out-and-back"
    },
    "title": "Munro Lake / Dennett Lake",
    "trail_id": "643"
}