{
    "description": "Chadsey Lake trail starts at the top of Sumas mtn.Locals know this lake as Lost Lake but it's really Chadsey,old maps of the forest road up the mtn show the road as lost lake road.    Several hike a bike due to the natural steepness ,but the whole trail is all in the canopy .(no clearcut logging ) We ride from the bottom to the top and go in just below the summit tower (75 feet below on a trail (signed with lookout 500meters) ) enters on E. side of the access rd.Going across the summit ,through a tiny logged area down a set of stairs you reach a  T. E takes you in a couple of minutes to a great view of Chilliwack and the C valley.W. at the T takes you down to Chadsey , at the N. end of the lake you reach a junction go R. which is W. and go around the lake ,keeping the lake on the L. hand side of you.Very poorly marked  , with one junction which will take you down to Barrowtown if you go W. Keeping the lake to the L. of you and you will come to the S. side of the lake the trail goes down S. or E. backup to the access road. (this E. up trail is very poorly built --old ) Go S. down from the S. part of the lake , one blowdown area which work is being done to clear . One big ravine to go through and down till it gets real flowy you will then exit onto a double track logging road.   Go W. a 100ft and L. back into the canopy takes you down till a L turn takes you to a log bridge .Across and climb up till you finally get out onto Lower Sumas road.Personally at the lower logging road go E. watching on the S. side of the road a trail appears (TimeOut MtBike trail) and go out this short trail till it exits onto Bakstad road just up from Batt road.This is the best way out.If natural hiking or a little natural extreme turns your crank this is worth it. Bring food, water and in summer Chadsey is a  great lake to swim in and enjoy.Fvmba.com  has been working to keep this gem open and clear.Mr.g",
    "directions": "Lower Sumas roadturn N. onto Batt road till dirt head either up till summit(as of Sept end gate is gone but another is coming higher up than the last one)orat Batt road T Go E down this short dirt road -Bakstad rd till corner where a parking area ( small waterfall ) and hike up  the mtbike trail (TimeOut)till the dirt road .Going L which is W. up till you see the mid entrance of Chadsey (orange taped with limited signage)You will see the old 1867/1967 plates on some trees.",
    "geohash": "c29pk",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/6432/reg_DSCF1934-31731.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6432/reg_DSCF1935-31731.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6432/reg_DSCF1942-31731.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6432/reg_DSCF1943-31731_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6432/reg_DSCF1952-31731.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/chadsey-lake-centennial-trail-near-abbotsford-bc-6432",
    "stats": {
        "Activities": "hike mtn-bike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 5,
        "Time": "3 hrs",
        "Total Distance": "10 km",
        "Town": "Abbotsford, BC",
        "Type": "out-and-back"
    },
    "title": "Chadsey Lake (Centennial trail)",
    "trail_id": "6432"
}