{
    "description": "This short little trail in Graystokes provincial park leads to a small alpine lake that has no name on any maps, but can assumed to be called Lemon Lake.  Its just over a km from the FSR to the Lake.  The lake doesn't have a trail around it or anything, but it's such a short walk its still worth it.  Be prepared for bugs and some wet spots if is been wet recently.  we were greeted with 18cm of snow in early October, so check and be prepared.  There are other trails in the park, including a 3km hike up Mt. Moore, but the brutal road (more like atv trail) and the snow made access impossible.  unless you have a really crazy truck.  be prepared.  really.",
    "directions": "Do not attempt to get to this trail without a 4x4.  Graystokes provincial park is only 45km from the highway, but it is at least 2 hours drove, with a stream crossing or 2, some minor boulder fields and potentially a lot of mud.  Take Graystokes road north east off of highway 33 just outside of the Joe Rich area east of Kelowna.  Basically you are following mission creek for the first 5 km, but then it gets potentially weird.  Take Graystokes FSR (not always well marked) and continue straight at the old trapper cabin/creek crossing just after the snowmobile cabin (a good place to stay if you want to).  The road continues up into the park, towards Graystokes lake, and the Lemon Trailhead is on the right hand side, about 1 km before Graystokes Lake.  Bring a GPS and a backroads map book.  The GPS will get you to the trailhead, but the batteries were dead, so no map of the trail.  check out http://www.env.gov.bc.ca/bcparks/explore/parkpgs/graystokes/grstks_map.pdf for a map of the park.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/6437/reg_003-3-6465.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/lemon-lake-near-kelowna-bc-6437",
    "stats": {
        "Activities": "snowshoe hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 2,
        "Time": "2 hrs",
        "Total Distance": "3 km",
        "Town": "Kelowna, BC",
        "Type": "out-and-back"
    },
    "title": "Lemon Lake",
    "trail_id": "6437"
}