{
    "description": "NTS Map: 92G14. High Falls Creek is stunning; try to choose a clear day for this 12 km hike and get impressive views of the creek itself, the magnificent mountains of the Tantalus Range and over the Squamish Valley. A good part of your elevation gain involves scrambling over rocks and boulders, fairly steep right from the beginning. Often, the ascent borders right along the canyon, however, chains and ropes give you support.\r\nThis may not be your perfect hike if you are afraid of heights or on a wet day, since the bluffs may be quite slippery. Your ascent will also be rewarded by an extensive wildlife--moss gardens, yellow on the rocks, luscious green in the forest, violets, dogwood trees, and others. On our descent on the logging road, we 'followed' a hummingbird for quite some time. Watch out, one person in our group scared up a black bear, while filling up his water supply at a small creek (less than 1 km after we hit the logging road for our descent). Above hiking time of 5 hours includes one-hour lunch break at the top of the bluffs. \r",
    "directions": "\r\nFrom Squamish, at the traffic lights at Cleveland avenue, go north on Highway 99 for about 10 km. Turn left onto Squamish Valley Road, across from Alice Lake Provincial Park. Another 3.5 km farther, keep left at the fork. Continue, after about 19 km, the asphalt road turns into gravel. Stay on this S-main road, ignoring a bridge across the Squamish River on your left. Then cross over a wooden bridge next to a power station on your right (you can't miss it!).  Shortly, you'll see the bridge crossing over High Falls Creek. Park your car just before that bridge. \r\nTo get to the trailhead, walk north across the bridge. Watch for flagging tapes and a sign on a tree, marking your turnoff to your right. It quickly becomes a relatively steep trail, with scrambles over rocks and boulders.\r\nThe trail is fairly well marked with flagging tape, and a couple of signs pointing out worthwhile views. More climbing brings you to a small rock gully with a bluff on your right. This spot offers a variety of great views. After that, the trail enters forest and levels out. It swings left first, then back to the creek, but high above it. Leaving the trees, you'll enter a more open area with young conifers and a variety of fauna. Getting to the logging road, which you can see to your left, involves a final scramble over a rock slide. Stay fairly high here and look for the cairns that mark the route.\r\nOnce you're on the road, turn left, and head back towards the Squamish Valley. Walking along the road is a nice alternative to climbing down the bluffs, and this less exciting route will be enhanced by some more beautiful views.",
    "geohash": "c2bk4",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/645/reg_High-Falls-Creek-10-23966.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/645/reg_IMG-0016-21992.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/645/reg_IMG-0020-21992.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/645/reg_IMG-0070-38340.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/645/topo_squamishvalley_Tantalus2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/645/narrow_highfalls.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/high-falls-creek-near-squamish-bc-645",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 5,
        "Time": "5 hrs",
        "Total Distance": "12 km",
        "Town": "Squamish, BC",
        "Type": "out-and-back"
    },
    "title": "High Falls Creek",
    "trail_id": "645"
}