{
    "description": "I completed this loop during the end of the summer season on Oct 11/09. There was heavy frost in the higher elevations and slight amount of snow. I completed the loop counter clockwise, starting from my house in Lynn Valley (which my GPS file shows). The amount of time it took from the Headwater gate to the top of Grouse was three hours, four hours to reach the bottom of the BCMC and then finally five and half hours later, I arrived back at the gate. \nAgain the GPS file shows my path from my house through Lynn Valley and then through Varley Trail. I lost the GPS signal a couple of times while I was on the trail. You can see those sections as straight lines on the map. Hence, I think the total distance is slightly over 30km as my real path is slightly longer then the straight line. You get the idea.\nI didn't rate this full loop as extreme because I am sure there has to be a trail harder then this. So I only rated it as difficult. \nThere is one other map showing only the Hanes Valley traverse where you have to do a car drop (ortake the bus). I thought I would put this on as a full loop just in case anyone was thinking of doing it but needed some further information such as total distance and time.\nYour time will vary based on trail condition and personal fitness. Please be sure to bring enough food, water and spare clothing.",
    "directions": "Please see other Hanes Valley Traverse map for complete details, as this file is specifically meant for people who intended to do this as a full loop.",
    "geohash": "c2b",
    "photos": [],
    "source_url": "https://trailpeak.com/trails/hanes-valley-full-loop-near-north-vancouver-bc-6450",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 5,
        "Time": "6 hrs",
        "Total Distance": "30 km",
        "Town": "North Vancouver, BC",
        "Type": "out-and-back"
    },
    "title": "Hanes Valley Full Loop",
    "trail_id": "6450"
}