{
    "description": "According to the 1885 edition of Sailing Directions for the South-East Coast of Nova Scotia and Bay of Fundy, ?Cape Sharp derives its names form a remarkably sharp eminence, 300 feet high, with which it terminates.? Cape Sharp and Cape Split, extending from the opposite shore and just 2 2/3 miles distant form Cape Sharp, define the narrowest part of the entrance to Minas Basin. \nThe first Cape Spear Lighthouse was a square white wooden tower, thirty-four feet tall, attached to a two-story dwelling and went into service in 1886 with Robert J. Ward as its keeper. \nOn March 1, 1904, a fog signal was activated at Cape Sharp that gave blasts of 3 ½ second?s duration every minute. Built under contract by A. H. Dyer of Parrsboro for $1,307, the fog alarm building was a rectangular wooden structure with a red roof and was located 225 feet from the lighthouse with a horn projecting from its seaward face at an elevation of forty-five feet above high water mark. The Canadian Fog Signal of Toronto supplied the machinery for $2,400. \nThe present lighthouse, a pepper-shaker-style white tower with a red lantern room, was constructed in 1973 along with a dwelling for the keeper, who at that time was Victor Elliott. Victor and his wife Betty served twenty-four years at Cape Sharp, leaving only when the light was unmanned in February of 1989.",
    "directions": "From Route 2 (Glooscap Trail) in Parrsboro, go south on Main Street. Continue south past the Ship's Company Theatre, where the road will then become Whitehall Road. Continue on Whitehall Road towards Minas Basin, and you will see the large, white Ottawa House By The Sea Museum on your left. Near here the road will become dirt, but continue west for 6.1km (3.8 miles). At this point, you will have just come down a hill. The main road will make a hard right turn, and there will be a road to your left that leads down to the shore. Turn left and on your immediate right there will be a road that leads up and over Cape Sharp to the lighthouse. The road is too rutted and overgrown to drive, so park and enjoy the 1.3km walk to the lighthouse. \nThe lighthouse is owned by the Canadian Coast Guard. Grounds open, tower closed.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/6466/reg_capesharp1-2008-26501.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/cape-sharp-near-parrsboro-ns-6466",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "6 km",
        "Town": "Parrsboro, NS",
        "Type": "out-and-back"
    },
    "title": "Cape Sharp",
    "trail_id": "6466"
}