{
    "description": "A multi-season trail that is part of the Battle Mountain-Caribou Meadows-Table Mountain trail network in Wells Gray Prov. Park.  From alpine meadows in bloom during the summer to alpine touring and backcountry skiing in the winter, this area has fantastic backcountry opportunities.  The first part of the Battle Cr Trail (approx 2.5km) is quite steep and can be grueling with a heavy pack.  The rest of the trail has a moderate grade through alpine meadows.  There is a public use cabin (Wpt 002) just off the Battle Cr/Fight Lk/Battle Mtn trail junction and a tent site at Fight Lake (Wpt 003).  There is also a private backcountry chalet farther up the Fight Meadows just under 52 Ridge that may be available for booking through a local guiding company.\r\rAs with most alpine areas in Wells Gray, beware of the local bear population; there is a healthy number of grizzlies that call the Caribou Meadows home.  A food cache is available at the Fight Lk campsite.\r\rThe GPS data was gathered during a late fall hike; much of the tour was on 1m of snow and the trail between Wpt 005 to Wpt 006 may not be the actual summer trail location.  There are guideposts marking the trail to assist the winter traveler through the alpine meadows (as long as the snowpack is less than 2m)",
    "directions": "From the Hwy 5-Clearwater Valley turnoff, travel 26.4km up the Clearwater Valley.  The turnoff from the Clearwater Valley Rd is well marked.  The Battle Cr Trailhead is approx 2km up the gravel road.  Continuing another 5km past the Battle Cr Trailhead will bring you to the Ursus (Philip Lk) Trailhead but the road is rough and is recommended for high-clearance 4X4 vehicles only.",
    "geohash": "c34x",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/6470/reg_Battle-Creek-Trail-21577.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6470/reg_Fight-Lk-Cabin-001-21577.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/battle-creek-trail-to-fight-lake-near-clearwater-bc-6470",
    "stats": {
        "Activities": "ski-bc hike snowshoe",
        "From": "",
        "Seasons": "summer fall winter",
        "Stars": 4,
        "Time": "5 hrs",
        "Total Distance": "9 km",
        "Town": "Clearwater, BC",
        "Type": "out-and-back"
    },
    "title": "Battle Creek Trail to Fight Lake",
    "trail_id": "6470"
}