{
    "description": "Elevation gain: 1200m \nTrail run rated:  A2 - moderate.\nTime: 4:25 for running.\nA great single track trail takes you over high mountain passes, past pristine alpine lakes to Shadow Lake and back around to hwy 93. \nThe route slices its way through huge stands of larch that coat the trail with a soft carpet of needles in the fall. You can do the route either way, but north to south has less elevation gain.\nStart on the Arnica Lake trail and in under 1 km you will pass by the beautiful blue waters of Vista Lake. Grunt up the steep by manageable climb to Arnica Lake at km 4.3. Drop down past Twin lakes and climb back up those 200 m to Gibbon Pass. Continue down to Shadow Lake Lodge and take a right on the Hawk Creek trail. In 5.5 km you reach a signed junction. Turn right and start climbing up towards Ball Pass. \nFrom Ball Pass it is 8.5 km of fast and furious downhill all the way to the highway.\nRating A2: Route finding required. Steep and loose footing. Exposed running. Discrete trail junctions.\nTrail reprinted from \"Mountain Running in the Canadian Rockies\" by Bob Walker, with permission. Visit his website for purchasing this book.\nText and photos copyright Bob Walker 2009.",
    "directions": "Start at the tiny Vista lake pullout on Hwy 93, 8km south of the Trans-Canada.\nThe other end of this route is across the road from the Floe Lake parking lot, 24 km south of the Vista Lake pullout.\nMountain Running in the Canadian Rockies features all of the best trails that the Canadian Rockies have to offer. Whether you are a leisurely jogger, long distance runner, adventure racer, hiker, fastpacking enthusiast, or mountain adventurer you will love this book.\nThe Bow Valley Edition covers Kananskis (Bragg Creek), Kananaskis (Spray Lakes), Ghost Wilderness, Canmore, Banff, Assiniboine and Kootenay (Hwy 93).",
    "geohash": "c3j",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/6482/reg_mntrng-8779.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6482/reg_strm-trail-8779.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/storm-traverse-near-radium-hot-springs-bc-6482",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 4,
        "Time": "5 hrs",
        "Total Distance": "29 km",
        "Town": "Radium Hot Springs, BC",
        "Type": "out-and-back"
    },
    "title": "Storm Traverse",
    "trail_id": "6482"
}