{
    "description": "Elevation gain: 1800m \nTrail run rated:  A3 - difficult.\nTime: 9:30 for running.\nThis popular trail is one of the premier routes in the Rockies. The route described will take you through tight single track, big mountain passes, larch forest, rocky, rooty, muddy, technical, cruisy, buff and any other descriptor you can think of for a trail. There are many options and variations of the route, this is the longest and most diverse. \nRating A3: Moderate navigation required. Challenging route choices. Steep and exposed running. Loose footing. Moderate scrambling. Long committing distances.\nFrom the parking lot follow signs for Bryant creek. At km 11.5 (1 km before the Marvel Lake junction) take a left on a small and possibly unsigned single track. The trail twists and turns, eventually going around Owl Lake and joining another trail at Marvel Pass. Turn right and head down the rocky, technical descent toward Marvel lake. When the trail disappears at the western end of Marvel lake follow flagging or bushwhack up, trending a little to the right. 200 m of climbing will put you on the Marvel lake trail, which you follow left and up to Wonder Pass. Another 400m of steep climbing will get you onto Wonder passwhere you can look out in all directions at the incredible mountains that compose the area. \nFrom here it is a gentle 3 km ramble through wonderful larch forest to Assiniboine Lodge. From the lodge head north through amazing high alpine terrain towards Og lake and onto the Valley of the Rocks. Enjoy the gentle undulating and slightly downhill terrain as you make your way to the last climb up Citadel Pass. The climb up to the pass is under 600 m, but at this stage it usually feels much bigger. \nFrom the top of Citadel Pass enjoy a short downhill, followed by some flats and a small uphill at Howard Douglas Lake. Make your way down toward the hotel at Sunshine Village and go around the gondola station to the ski-out road. Follow the road all the way down to the  parking or after the gondola mid-station you can get to the Healy pass trail just down left below the road.\nTrail reprinted from \"Mountain Running in the Canadian Rockies\" by Bob Walker, with permission. Visit his website mtnrunning.ca for purchasing this book.\nText and photos copyright Bob Walker 2009.",
    "directions": "From Canmore take the Spray Lakes rd and drive 34 km to the Mt Shark road. Turn right  and drive 5 km to the parking lot and trailhead for Bryant Creek.\nMountain Running in the Canadian Rockies features all of the best trails that the Canadian Rockies have to offer. Whether you are a leisurely jogger, long distance runner, adventure racer, hiker, fastpacking enthusiast, or mountain adventurer you will love this book.\nThe Bow Valley Edition covers Kananaskis (Bragg Creek), Kananaskis (Spray Lakes), Ghost Wilderness, Canmore, Banff, Assiniboine and Kootenay (Hwy 93).",
    "geohash": "c3j",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/6489/reg_a-1-8779.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6489/reg_a-3-8779.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6489/reg_a-4-8779.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6489/reg_assiniboine2-8779.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6489/reg_assiniboine3-8779.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6489/reg_mlake-8779.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6489/narrow_wonder-pass-8779.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/assiniboine-to-sunshine-trail-run-near-canmore-ab-6489",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 5,
        "Time": "9 hrs",
        "Total Distance": "63 km",
        "Town": "Canmore, AB",
        "Type": "out-and-back"
    },
    "title": "Assiniboine to Sunshine trail run",
    "trail_id": "6489"
}