{
    "description": "This trail is part of the Dobson Trail, one of two long-distance trail systems in the province. The Dobson spans from Riverview right to the boundary of Fundy National Park. This portion (Hayward Pinnacle)  is somewhat in the middle, and is ranked as one of the prettiest and least untouched sections of them all. It's also the highest point in Albert County. On a good day, one could see clear to Moncton.Our weekend trip in early December was part of my continued efforts of camping every month of the year. The original plan this time was to bring each of our significant others along for some winter camping, but in the end, it ended up being only my friend from Moncton who knew the trail, and me.After leaving a vehicle at the Prosser Brook trailhead, we drove back to Berryton to start our hike southward. It was not a usual December time of year, and thus no snow had yet fallen. As we hiked along through mixed forest, we crossed a few streams and crossed a few atv roads. It really was a nice trail despite there being the occasional portion of trail effected by ATV users. Between our night's stay and the trailhead, we came across two camp sites, some with litter, but no actual ATVers in sight or sound.Our destination was 10K in, and from Mike's past experience, he remembered there being a delapitated hut. The trail has clear blue flashes, with green spur flashes all in the AT style. Beyond that, there were even KM markers. How posh?We crossed streams and walked through tall magestic older forests. The route passed along a valley, but there was too much hase from the drizzle on our first day to appreciate it. This is cerainly an autumn choice of hike, but in less than a day, we'd appreciate a different change of scenery.We reached our night's stay after 10K of hiking. It was in the middle of the afternoon, but we knew that night would fall in only a couple of hours. The hut wasn't how Mike remembered from 20 years ago. Back in 2000, it had been rebuilt. It was simple, and in great shape. It had plexiglass for windows, and was un insulated. Inside, there were benches and a table for having a meal. Plenty of nails to hang any damp items, or for simply keeping gear off the floor. In all, it was a clean well kept place.I was tempted to use it for a shelter, but remembering my stake on camping every month of the year, meant that sleeping in a shack would forgo any further claims. Besides, I did bring a 4 season tent for this very purpose. Word had it that snow was coming. We didn't realize how much.Our efforts at building a fire were stymied by the damp wood and ground around us. Our hike included a good portion of drizzly weather, only later turning to light snow nearing our arrival. My second, all be it, minor failure was the performance of the Primus mini torch I took along for a fire source. I didn't know it performed poorly when cold. Warming it up on my pocket did the trick until it got cold again. I find that high heat does not always a camp fire make. I've had better luck using a good old tea light. Slow and steady can win the race. I, of course, had no tea light candles to spare.With my tent set up, and mike's bivy bag in place, we set ourselves to relax and cook in the hut while the temp dropped and snow commenced. Mike brought cigars for the occasion, and I brought not quite enough brandy. We chatted while Detroit, my dog, slept on his Z-rest after eating his dinner.The site was a great location for a night's stay. It had a great water source, and not far away, a side trail attraction called Hayward Pinnacle. This look-off is noted as being the highest point in Albert County. It's a spur trail off the Dobson, but the trail continues to an access road.One thing I neglected to mention is that the area has recently been riddled with wind power projects. Some see it as a conspiracy from Irving to cut down more trees with a view to green-dom. Anyway, if you have ever heard home owners complaining about the noise those huge wind props generate, well we had first hand (ear?) experience on what they were enduring. All night long, came the seemingly not so distant jet engine sound, mixed with out of sync \"whomp-whomp\" sounds of a closer set of prop blades harnessed by the wind. If you get to read this before heading out to the area, bring some ear plugs, or pray for a calm day.Next morning, we had 6K to get to our second vehicle at the south end at Barryton. With all the snow, we wondered if we were going to be able to get out without getting stuck.",
    "directions": "From Hillsborough, take highway 910 off of route 114. Travel through Osborne Corner, Rosevale, to Berryton where you wll see the Dobson trail signage as it crosses the road.We parked another vehicle at the other end. This can be found by following out of Riverview, route 112, then 895 south-east until you reach Prosser Brook Road. Take the next right after Beaman Road, and look for the Dobson trail signage as it crosses the road. Also look for skidoo signage. This end is nearest Hayward pinnacle.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NB/6491/reg_IMG-0988-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/6491/reg_IMG-1010-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/6491/reg_IMG-1018-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/6491/reg_IMG-1031-6702_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/6491/reg_IMG-1032-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/6491/reg_IMG-1055-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/6491/IMG_0988.JPG",
        "https://trailpeak.com/storage//content/trails/Canada/NB/6491/narrow_IMG-1000-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/6491/narrow_IMG-1003-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/6491/narrow_IMG-1012-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/6491/narrow_IMG-1035-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/6491/narrow_IMG-1048-6702.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/hayward-pinnacle-dobson-trail-near-hillsborough-nb-6491",
    "stats": {
        "Activities": "snowshoe hike ski-bc mtn-bike",
        "From": "",
        "Seasons": "winter fall summer",
        "Stars": 4,
        "Time": "14 hrs",
        "Total Distance": "16 km",
        "Town": "Hillsborough, NB",
        "Type": "out-and-back"
    },
    "title": "Hayward Pinnacle (Dobson trail)",
    "trail_id": "6491"
}