{
    "description": "An easy hike from the highway, you'll pass a nice lake on the way. when you hit a fork in a clearing marked by a small cairn take the left trail whichs winds slightly further through the forest culminating at the bottom of a huge scree pile. this is the base of cinquefoil. gain the ridge you can see at the top of the scree. once on the ridge you have a gradual hike up to the first steep hump. the whole mountain is a series of humps which provide some good routefinding practice and the first test comes on the first hump where you must navigate some dense underbrush. follow the sheep trails up and to the right until you come to a clearing with a series of rock slabs. they look like big steps. make your way to the top of these and follow more sheep trails up always making sure to stay right until you reach treeline. once above treeline you can see your way to the summit continuing to climb what seem like endless mound after mound of broken rock, and in the spring, mud, water and snow. an alpine meadow just below the top gives well deserved respite from the winds of the ridge top and the moss under foot feels great compared to the punishing scree piles you've already been through. don't turn back now. the summit is marked well with a large cairn containing a register.",
    "directions": "Drive to Merlin Pass trailheadon the south side of the Yellowhead highway(hwy. 16), 24km east of Jasper and 20km west of Pocahontas Cabins. Trailhead may not contain signage but is well marked.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/6495/reg_077-26680.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6495/narrow_042-26680.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6495/narrow_046-26680.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6495/narrow_047-26680.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6495/narrow_052-26680.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6495/narrow_057-26680.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6495/narrow_063-26680.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6495/narrow_069-26680.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6495/narrow_070-26680.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6495/narrow_075-26680.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6495/narrow_076-26680.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6495/narrow_080-26680.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/cinquefoil-mountain-near-jasper-ab-6495",
    "stats": {
        "Activities": "hike climb",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 3,
        "Time": "8 hrs",
        "Total Distance": "18 km",
        "Town": "Jasper, AB",
        "Type": "out-and-back"
    },
    "title": "Cinquefoil Mountain",
    "trail_id": "6495"
}