{
    "description": "An easy hiking trail in the summer, snowshoeing trail in the winter.\r\rThis is the trail around Lightning Lake in Manning Park, BC. I'm posting it as a snowshoeing trail, because it's not really promoted that way, but is a lovely, easy 8 km snowshoe around the lake. Note that we cut across the mouth of the bay on the right (north west) side, just past the trailhead in the parking lot. DO NOT VENTURE ACROSS THE ICE UNLESS YOU ARE ABSOLUTELY SURE IT IS SOLID). Otherwise, add approx 1 km for the walk around the bay.\r\rHead southwest from the parking lot all the way to the end of the lake. You can actually continue on for several km to Flash and Strike Lakes, but will have to back track. You can also short circuit your outing by crossing over Rainbow Bridge, for a total trip of approx 4 km.\r\rAt the south end of Lightning Lake, cross the small bridge over Lightning Creek to the other side of the lake and do the return 4 km on that side. \r\rYou will probably observe deer and rabbit tracks, possibly moose, and get a look at the mountains surrounding the lake.",
    "directions": "Hway 3 from Hope eastward 45 km or so, or westward from Princeton, also approx 45 km, to Manning Park Lodge. It is approx 2.5 hours from Vancouver.\r\rAt Manning Park Lodge, turn south and drive the 6 km or so to Lightning Lake day use area, park in the parking lot and head southwest on the north side of the lake, or go around the north end of the lake and head south west on the south side of the lake, keeping right at the Frosty Mtn trailhead.",
    "geohash": "c2dp",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/6509/narrow_ManningLightning-7287-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6509/narrow_ManningLightning-7290-7359.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/manning-park-lightning-lake-near-hope-bc-6509",
    "stats": {
        "Activities": "hike snowshoe",
        "From": "",
        "Seasons": "summer winter",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "8 km",
        "Town": "Hope, BC",
        "Type": "out-and-back"
    },
    "title": "Manning Park, Lightning Lake",
    "trail_id": "6509"
}