{
    "description": "A moderate, delightful 2-3 hour loop along the Cheakamus river, just south of Whistler.\r\rThis trail follows the Cheakamus River from near the site of the Whistler 2010 winter Olympics Village. There are parallel roads, covered with snow in winter (see other postings on this site), but this one is along the Farside Trail on the north side of the river and the Riverside Trail on the south side, crossing the suspension bridge approx 3.5 kms east of the trail head.\r\rIt is basically a coniferous forest, with spruce, and huge Douglas Fir and Cedars (see photo).\r\rWe walked east along the north side of the river, and went to the Valleyview outlook approx 500 m east of the bridge. You can continue much farther on either side of the river, with many other features. Just don't forget, if you hike/snowshoe in, you have to come back.\r\rFrom the Valleyview outlook, we walked back along the Cheakamus Lake road approx 500 m, turned left at the suspension bridge sign, crossed the river over the suspension bridge (see photo) and came back westward on the south side of the river.",
    "directions": "Drive to whistler, at the first light as you drive into Whistler (Function Junction), turn right (east), drive less than 1 km, turn left on the Cheakamus Lake road (BEFORE the 2 lane bridge). You can either park near the 1 lane bridge and head east on the north side of the river, or drive a further 500 m or so, park in the Riverside Trail parking lot, and head east on the south side of the river.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/6516/narrow_Cheakamus-7299-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6516/narrow_Cheakamus-7300-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6516/narrow_Cheakamus-7305-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6516/narrow_Cheakamus-7314-7359.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/whistler-interpretive-forest-cheakamus-river-near-whistler-bc-6516",
    "stats": {
        "Activities": "hike snowshoe",
        "From": "",
        "Seasons": "summer fall winter",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "8 km",
        "Town": "Whistler, BC",
        "Type": "out-and-back"
    },
    "title": "Whistler Interpretive Forest, Cheakamus River",
    "trail_id": "6516"
}