{
    "description": "Great all season hike for Families. Takes less then 20 minutes to get to the falls. Trail follows the creek through the forest, a pretty sight year round. \nThe bridge has fallen into disrepair over the last few years, and no longer has the hand rails it once did. The Bridge its self how ever, is still in tact. Cross the bridge to get closer to the falls, only takes you another 20 feet or so over though, so not missing much by not crossing. Small pool at base of falls. Probably not a good idea to swim though. \nA Nice trip quick hike that can be followed up with Lunch and a fire at  Becker's island back down the road, by the second yellow bridge.",
    "directions": "Take Westsyde road through town, and past black pines. A nice rural  drive, taking about 20 minutes. After a tight left hand turn, the brown  \"Jamieson Creek FSR\" sign will be on your right. If you go across a  wooden plank bridge, you just missed the turn! Zero your trip meter at  this point. Follow the road up, being careful to yield to logging trucks. For  people with a 2 way radio, the req. is 159.24 (Recently the logging  company has been posting a sign below the fsr sign, letting road users  know if there is active logging.) Staying on the main road, you'll cross two yellow bridges. Take note to the right of the second one, is a great place to have lunch after. The road narrows going up a hill, but there are ample pull outs to let trucks pass. When your trip meter says 12.2 Km, there'll be a pull out to your right. Don't worry about the mile marker in front of you saying 13, its wrong. Cross the road to the creek side, climb down the bank to the \"Jamieson falls\" sign. There's your trail head!",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/6521/narrow_DSC01695-0.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6521/narrow_DSC01698-0.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6521/narrow_DSC01700-0.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6521/narrow_DSC01704-0.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/jamieson-creek-falls-near-kamloops-bc-6521",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "1 km",
        "Town": "Kamloops, BC",
        "Type": "out-and-back"
    },
    "title": "Jamieson Creek Falls",
    "trail_id": "6521"
}