{
    "description": "A nice hike off the beat track that offers great scenery and excellent views.\r\rAt the very end of the last parking lot for the Sooke Potholes there is an access point for the Galloping Goose. Directly across from the access point is the remains of an old road heading off into the woods. This road follows Maryvine Creek for a short distance, then becomes a footpath. Follow this footpath up to the pipeline. There is a short side trail on the left which will take you to a very nice waterfall. \r\rWhen you reach the pipeline turn left along it and use it to cross Maryvine Creek. Immediately after crossing the creek follow the footpath on your right. This is a little used footpath so it is quite faint in places and easy to lose. There is enough flagging tape and little cairns to guide the way, but you need to pay attention. The trail climbs moderately until you reach the bluffs, then the trail zig-zags steeply up the bluffs to a wonderful viewpoint by a large boulder covered in little cairns. \r\rThe trail you have been following will lead you down the other side of the ridge to Peden Lake. If you want to continue to the highest point of the ridge, locally known as Black Bear Mountain, you?re pretty much on your own. Just east of the large boulder, if you?re lucky, you can pick up a flagged trail headed due north. This flagging is sporadic and there is no evidence of a trail on the ground. A topographical map and knowledge of how to use it would be an asset. Follow the curve of the ridge along the highest ground and you?ll be fine. It?s pretty open and easy going. If you don?t keep to the high ground you may find yourself on dangerously steep ground. The actual summit is covered in trees and allows very little view, but there are several view points around the summit which make the climb worthwhile.",
    "directions": "From Victoria follow the island highway west toward Sooke. The island highway becomes Sooke Road. Just before the bridge over Sooke River, turn Right onto Sooke River Road. Park in the last parking lot for the Sooke Potholes. A parking fee may be in effect in summer months.",
    "geohash": "c2858",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/6522/reg_Peden-Ridge-1-27004.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6522/reg_Peden-Ridge-2-27004.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6522/reg_Peden-Ridge-3-27004.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6522/reg_Peden-Ridge-5-27004.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6522/narrow_Peden-Ridge-4-27004.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/peden-ridge-to-black-bear-mountain-near-sooke-bc-6522",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 5,
        "Time": "4 hrs",
        "Total Distance": "5 km",
        "Town": "Sooke, BC",
        "Type": "out-and-back"
    },
    "title": "Peden Ridge to Black Bear Mountain",
    "trail_id": "6522"
}