{
    "description": "This hill doesn?t actually have a name, and I?ve never heard of a ?local name? for it, but some friends have dubbed it Grasshopper Ridge owing to the large number of Grasshoppers that make this place home, so that?s what we call it.\r\rThis trail branches off the horse bypass trail for Todd Creek trestle; there is more than one approach. I?ll describe our usual route.\r\rBegin on Sooke River Road just before the first gate for the Sooke Potholes. Here you will see an old gated road. Follow this road to the Galloping Goose where it becomes the horse bypass. Shortly after passing the Goose there are two old roads branching off to the left in quick succession. Follow the second, less overgrown road. After crossing Todd Creek, instead of  following the horse bypass back to the goose, continue following the road up to the top of this hill. The trail becomes quite steep near the top. Enjoy the view.\r",
    "directions": "From Victoria follow the island highway west toward Sooke. The island highway becomes Sooke Road. Just before the bridge over Sooke River, turn Right onto Sooke River Road. Park in the small gravel parking area just before the first Gate for the Sooke Potholes. Make sure your car tires are not touching the pavement or your car might get towed.",
    "geohash": "c285",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/6523/reg_Grasshopper-Ridge3-27004.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6523/narrow_Grasshopper-Ridge1-27004.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6523/narrow_Grasshopper-Ridge2-27004.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/grasshopper-ridge-an-unnamed-hill-in-sooke-near-sooke-bc-6523",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "3 km",
        "Town": "Sooke, BC",
        "Type": "out-and-back"
    },
    "title": "Grasshopper Ridge - An Unnamed Hill in Sooke",
    "trail_id": "6523"
}