{
    "description": "This Ridge is known Locally as Monument Mountain, most like because of a memorial plaque to a Richard Bernie Doerksen that you will pass near the summit.\r\rThis hike begins as a nice walk along a gated road with moderate incline. Stick to the main road until the third prominent junction at N 48° 24.987 W 123° 40.760. Here turn left onto what was once Twin Long Road. We call this ?Mud Junction? because it is almost always muddy, even in the warm summer months. Follow Twin Log Road as it descends to Charters River. You will need to ford the river; in the winter months and after heavy rains it may not be safe to do so. After fording the river continue along the road as it climbs into the hills. Note an old abandoned, orange truck and the remains of a stone oven on the left. A little more than half a kilometre after passing the old truck note a trail to your right which leads to a spectacular, but unfortunately intermittent waterfall. At about one kilometre past the old truck, follow a well flagged and obvious trail on the left at N 48° 26.300 W 123° 40.762. From here make the short climb on to the ridge and a little cairn. This is not the true summit. (If you just have to stand on the top you can bushwhack one kilometre north to reach the summit. However there isn?t much of a view so I don?t recommend it.) Follow the trail south (left) which soon opens up and allows for wonderful views as you descend the ridge. The ridge trail descends to a very overgrown old road. Your only option is to follow the road south as the other direction is too overgrown. At the next trail junction turn left. The next trail junction after that is at Twin Log Road. Turn right and retrace your steps to the parking lot.",
    "directions": "From Victoria follow the island highway west toward Sooke. The island highway becomes Sooke Road. Follow Sooke Road to Saseenos (just before Sooke). Turn Right on Harbourview Road. Park in the CRD parking lot at the end of the road.",
    "geohash": "c285",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/6526/reg_IMG-0241-27004.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6526/reg_IMG-0242-27004.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6526/reg_Monument2-27004.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6526/reg_Monument3-27004.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6526/reg_Monument5-27004.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6526/narrow_Monument1-27004.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6526/narrow_Monument4-27004.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/monument-mountain-ridge-trail-near-sooke-bc-6526",
    "stats": {
        "Activities": "mtn-bike hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 5,
        "Time": "3 hrs",
        "Total Distance": "8 km",
        "Town": "Sooke, BC",
        "Type": "out-and-back"
    },
    "title": "Monument Mountain Ridge Trail",
    "trail_id": "6526"
}