{
    "description": "This alternate route to Grass Lake makes a nice loop when combined with the route ?Grassy Lake via Harrison Trail? posted by Ickster.\r\rBegin on Sooke River Road just before the first gate for the Sooke Potholes. Here you will see an old gated road. Follow this road past the Galloping Goose, past the pipeline, and past both trails to Peden Lake. At N 48° 27.300 W 123° 41.562 follow the trail on your right. The trail will take you up over a small hill and then down to the northern end of Grass Lake. Here you will find a prominent junction, turn right and follow it to a short side trail on your left which will take you to the site of the old Alpine Club of Canada hut. The cleared site where the hut once stood is still obvious but nothing else remains. This is a great place for a picnic. I suggest returning by reversing Ickster?s route which branches off this route just after passing the pipeline.",
    "directions": "From Victoria follow the island highway west toward Sooke. The island highway becomes Sooke Road. Just before the bridge over Sooke River, turn Right onto Sooke River Road. Park in the small gravel parking area just before the first Gate for the Sooke Potholes. Make sure your car tires are not touching the pavement or your car might get towed.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/6527/reg_Grassy1-27004.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6527/reg_Grassy4-27004.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6527/narrow_Grassy2-27004.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6527/narrow_Grassy3-27004.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/grass-lake-the-long-way-near-sooke-bc-6527",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "7 km",
        "Town": "Sooke, BC",
        "Type": "out-and-back"
    },
    "title": "Grass Lake - The Long Way",
    "trail_id": "6527"
}