{
    "description": "Just before Sooke Road changed from two lanes to one lane, at the point where the power lines cross the highway, you?ll find a path leading into the woods. After fording a little creek (Veitch Creek) you?ll come to an old logging road (Veitch Main). Turn right, proceed along Veitch Main for approximately 3/4 of a mile; just after the road meets the creek and then climbs up a small hill, look for a spur road off to the left. Take this spur into the valley between Sugarloaf and a lower, unnamed knoll to its northeast. The route is well flagged and pretty easy to follow. Follow the trail for a while; at one point there is a sharp turn to the right down into a slightly boggy area. Continue almost to the end of the valley, where the trail makes a sharp turn left (roughly south) and heads up. Many different colored tapes around several prominent trees indicate the trail up. The climb to the summit is a fairly steep go. The distance of this route is similar to the other route up Sugarloaf and the climb to the summit is equally steep, however, there is much less up and down along the way making it the easier of the two routes.\rBeware of the locals, some of them are under the impression that you cannot access this part of the park without trespassing. This is untrue, if you look at the park?s boarders (accurately displayed on the CRD?s Natural Area?s Atlas: http://www.crd.bc.ca/maps/natural/atlas.htm) you?ll see that this access point is in the small section of the park which crosses Sooke Road. Officially the Sooke Hills Wilderness Park Reserve is not open to the public, however the CRD are aware of hikers using the area and choose to turn a blind eye.",
    "directions": "From Victoria follow the island highway west toward Sooke. The island highway becomes Sooke Road. Just after the road switches to one lane park at the mailboxes on the right hand side of the road. Walk back along the road to the trailhead.",
    "geohash": "c285",
    "photos": [],
    "source_url": "https://trailpeak.com/trails/sugarloaf-mountain-north-face-near-sooke-bc-6529",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 5,
        "Time": "2 hrs",
        "Total Distance": "4 km",
        "Town": "Sooke, BC",
        "Type": "out-and-back"
    },
    "title": "Sugarloaf Mountain - North face",
    "trail_id": "6529"
}