{
    "description": "This is a great little afternoon hike to take while camping here. Follow the trail headed east from the north side of the bridge on Mayo Road. This trail follows the twists and turns of the river. Watch for side trails which lead to the waters edge or lookouts. When the trail enters the Horseshoe Bend Group Campsite turn right, walk past all the tent pads to a wooden barricade by the river, here turn left and pick up the trail again. Please be respectful if there are campers at the site. When the trail meets the Trans Canada Trail, a wide gravel path, turn right. Follow the Trans Canada Trail until crosses the river. Just after crossing the Trestle follow the footpath that branches off to the right. This trail takes you through the forest, then over Stoltz Bluff, and back to Mayo Road. When the trail meets Mayo Road, turn right and return across the bridge.",
    "directions": "From Duncan Follow Highway 18 towards Lake Cowichan. Turn left on Skutz Falls Road, then left on Riverbottom road. There is a small amount of parking near Mayo Road. If this is full park at the Skutz Falls Day Use Area.\r\rFrom Lake Cowichan Follow Highway 18 towards Duncan. Turn right on Skutz Falls Road and follow the directions given above.",
    "geohash": "c0xv",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/6533/narrow_CowichanRiver1-27004.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6533/narrow_CowichanRiver2-27004.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6533/narrow_CowichanRiver3-27004.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6533/narrow_CowichanRiver4-27004.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/cowichan-river-skutz-falls-to-66-mile-trestle-loop-near-lake-cowichan-bc-6533",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 5,
        "Time": "3 hrs",
        "Total Distance": "7 km",
        "Town": "Lake Cowichan, BC",
        "Type": "out-and-back"
    },
    "title": "Cowichan River - Skutz Falls to 66 Mile Trestle Loop",
    "trail_id": "6533"
}