{
    "description": "This is pure bushwacking except for the start where there is an unofficial trail to the first waterfall. If you persist and head upstream for about another 1.5 hours you will be rewarded with a massive waterfall (pictures included). unfortunately I did not have my GPS that day to share track.\r\n\r\n \r\n\r\n \r\n\r\n \r\n\r\nThere are a lot of dirt road on top of the hills that surround the stream but I am unsure on where they start or end up and sometimes following those instead of the brook will make you miss a fall. the walking is easy in terms of forest as this is mostly a mature evergreen forest. There are some places where you have to walk furher up the hill than near the stream to avoid rocks walls. Therefore make sure you don't have problems with your ankles as you will be walking on a slant most of the day. I ended up walking on the left hand side of the brook all day (if facing upstream). I think they are more falls upstream then where I finished.\r\n\r",
    "directions": "\r\n\r\nHead north on highway 209 out of Parrsboro. Turn left on Spence Road. Go to the end of the road and turn left on Newville Rd. Park after crossing stream at 45° 27.762'N, 64° 20.066'W. Follow left bank (if looking upstream) and head upstream of river",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/6552/reg_DSC-0081-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6552/reg_DSC-0072-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6552/narrow_DSC-0057-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/jeffers-brook-falls-near-parrsboro-ns-6552",
    "stats": {
        "Activities": "hike snowshoe climb",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 3,
        "Time": "5 hrs",
        "Total Distance": "8 km",
        "Town": "Parrsboro, NS",
        "Type": "out-and-back"
    },
    "title": "Jeffers Brook Falls",
    "trail_id": "6552"
}