{
    "description": "The trail starts out with an easy trail for about 2 kilometres where it then joins up with an another trail from the upper parking lot*. A little further back on this trail you can see the First Brother mountain way off in the distance. At the junction you will see a sign detailing what is ahead on your hike. The trail then decends for about 4 kilometres into Buckhorn Wilderness Camp.  This is the low point of the hike and you get water from a small sream at the far end of the camp(remeber to purify the water before drinking it). So far on this hike you have been in trees but  the trail then ascends out of Buckhorn Wilderness Camp through an old burn and into alpine territory(meadows and few trees) after you pass through the old burn you continue to climb up in the meadows until you level out at the junction with Bonnevier Trail.\nDO NOT TAKE THIS WAY FOR THAT IS NOT THE TRAIL. Once you pass the  Bonneveir trail you continue with some easy up and down hiking the beautiful alpine meadows. After about an hour of hiking in the meadows you will pass a small tarn or mountain lake. If you go to your right when you reach the lake you can come to the edge of a 200 ft sheer cliff (watch your step). From hear you will continue into a windswept saddle which you climb out of and follow the trail to a information post that is the junction of the Heather Trail and the ascent to the top of the First Brother Mountain. The ascent to the top is very steep and difficult and on fairly loose scree so make sure you watch your footing. \nOnce you reach the top of the First Brother you follow down a sort of ridge that takes you over the 2 false peaks of the First Brother mountain. The third and final peak of this mountain is the highest and has the summit post on it detailing the mountains height. From the summit there is a commanding view of the meadows and the northern Cascade Mountains. This is the end of the hike and follow the trail back to the parking lot.\nIf you do this hike when the flowers are blooming it makes the hike all  that more spectacular. When I went the meadows were splashed with beautiful alpine lupine making parts of the meadow almost all purple from a distance.\n*The upper parking lot starts you off higher and closer to the junction of the trail from the lower parking lot.",
    "directions": "From Vancouver take Hwy 1 To Hope the Take Hwy 3 to Manning Park Lodge. Proceed past the first entrance to the lodge and right across the road from the second entrance to the lodge is the road to the subalpine meadows. Take this road and follow it up past the Cascade lookout and up to the meadows for 15km. Park at the lower parking lot (pay parking) an take the trail to the right of the parking spots. The trail to the left only leads to outhouses.",
    "geohash": "c2dp",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/6555/reg_Manning-Park-09-031-22809.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6555/reg_Manning-Park-09-034-22809.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6555/reg_P8120432-22809.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6555/reg_P8120439-22809.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6555/reg_P8120440-22809.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6555/reg_P8120442-22809.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6555/reg_P8120443-22809.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6555/reg_P8120444-22809.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6555/reg_P8120446-22809.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6555/reg_P8120447-22809.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6555/reg_P8120449-22809.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6555/reg_P8120450-22809.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6555/reg_P8120455-22809.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6555/reg_P8120456-22809.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6555/reg_P8120467-22809.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6555/reg_P8120468-22809.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6555/reg_P8120471-22809.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6555/reg_P8120472-22809.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6555/reg_P8120477-22809.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/the-first-brother-near-hope-bc-6555",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring summer",
        "Stars": 5,
        "Time": "7 hrs",
        "Total Distance": "21 km",
        "Town": "Hope, BC",
        "Type": "out-and-back"
    },
    "title": "The First Brother",
    "trail_id": "6555"
}