{
    "description": "Cole Island was a Royal Navy ammunition depot, and many brick buildings are still standing. The waters from to the northwest shallow to exposed mud flats at low tides.\r\n\r\nThe paddle from Fleming Beach to Cole Island is a fantastic trip with opportunities for detours to Fisgard Rock, Fort Rodd Hill, Thetis Cove, or  into the Esquimalt Lagoon. From Fleming Beach, Cole Island is 6.6 nautical miles round trip. A detour under into the Esquimalt Lagoon adds another 1.5 nautical miles to the trip.\r\n\r\nParking is plentiful and free at Fleming Beach. There is a boat launch ramp, twin floating docks, and restroom facilities. The bay itself is well sheltered and calm under all wind conditions.\r\n\r\nWhen leaving Fleming Bay, the narrow exit is bounded by rocks and a rubble breakwater. Rocks around Scroggs Rock and between Brother?s Islands and Signal Hill are hard to spot, and are often obscured by bull kelp (waypoints 7 to 14). Although this area has a lot of submerged hazards, you are likely to see many harbour seals, some sea lions and the occasional sea otter basking on the rocks and it is a great place to relax.\r\n\r\nAlthough the waters can be flat calm, seas up to 1 metre can develop on windy days; alternative landing points include the Canadian Forces Sailing Association docks (CFSA) and Limekiln Cove in View Royal.\r\n\r\nDue to increased harbour security, the Department of National Defence has instituted an enforceable exclusion zone around the Esquimalt naval dockyard and all warships in the area. It's a really good idea to stay well to the West when entering the harbour, and to politely clarify your intentions to waterborne Military Police who operate in the area.  To the northwest of Fort Rodd all land belongs to the DND, as does Constance Cove to the east; landing in these areas is not a great idea. \r\n There is GPS data attached to this trail (see \"download GPS\"), which if loaded into your GPS can help you find route points.",
    "directions": "Launch ramp at Fleming Beach, off Munro Road, Esquimalt. UTM 469638.2  5363161.0\r",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/656/reg_cisl15.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/656/topo_cisl34.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/656/narrow_cisl02.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/656/narrow_cisl09.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/fleming-bay-to-cole-island-near-victoria-bc-656",
    "stats": {
        "Activities": "river-canoe sea-kayak",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "6 hrs",
        "Total Distance": "9 km",
        "Town": "Victoria, BC",
        "Type": "out-and-back"
    },
    "title": "Fleming Bay to Cole Island",
    "trail_id": "656"
}