{
    "description": "This is a trail desciption to reach two waterfalls on Christie Brook near Truro, NS. They are approximately 15-20 foot each. There might be another (more formal) way to get to the waterfalls but this is the way I reached them. I ended up getting into the forest between two houses. The walking is easy, the terrain is flat until you hit the ravine where the stream flows. The slope of the ravine to the stream is not too steep that you could take children down. The forest is mainly deciduou and easy to travel through to the first fall (the most downstream one). My GPS track then goes downstream further but don't bother as there was not other fall that way. Instead head upstream to the other falls which are located in an area of evergreen which have a small part that is hard to get through but overall not too bad. All of these falls seem to have big pools at the bottom so they are good for swimming and probably some river running. Also quite handy are some flat areas around the falls for camping.\r\n\r",
    "directions": "\r\n\r\nDrive to Valley Station (near Bible Hill and Truro). Drive on the Old Greenfield Rd until Old Union Rd.  Across the road from it is a driveway blocked with large rocks. Park here, head down the driveway.  At the clearing a strail starts leading to the lower falls.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/6564/green7.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6564/reg_2009-05-12-059-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6564/reg_2009-05-12-043-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6564/narrow_2009-05-12-063-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6564/narrow_IMG-1406-43788.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6564/narrow_IMG-1408-43788.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/christie-brook-falls-near-truro-ns-6564",
    "stats": {
        "Activities": "hike river-kayak",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "3 km",
        "Town": "Truro, NS",
        "Type": "out-and-back"
    },
    "title": "Christie Brook Falls",
    "trail_id": "6564"
}