{
    "description": "The Trans Canada Trail is a vision to have a multi use trail stretch from coast to coast across Canada. This section is the Cowichan Valley. This abandoned train route is the same as the Galloping Goose in Victoria and the Shawnigan section of the TCT.\r\rThe trip is 35 km one way so there and back in one day would be too much but a car shuttle can be done. Smaller sections can be done too since there are many accesses.\r\rMost of the trail is quite well packed pea gravel but in some rural areas motor vehicle use has made a few select sections muddy. Bring plenty of water and food on your trip!\r\rThe trail passes through many areas of the Cowichan Valley including lush rainforests and rural farmland. We had a nice sunny day. It was great!",
    "directions": "Type the GPS co-ordinates into Google Maps.\r\rSouth end (N 48° 40.175 W 123° 41.660) - Turn west onto Kokisilah Road off the TCH and follow that for until you pass over a distinctive wooden truss bridge. The road will then fork, take the left turn. Follow Riverside Road for many kilometers until you reach the Trans Canada Trail parking lot and Kinsol Trestle. The road is paved for a bit but will then get rougher.\r\rNorth end (N48 49.328 W124 03.097) - The Cowichan Valley Regional District (CVRD) has set up a nice spit cedar fence to mark the access to the trail.\r\rMid-way (N48 45.434 w123 47.597) - This is a good parking lot for a day trip going either way. There is an amazing site including picnic tables and washrooms. Go to the end of Robertson Road near Duncan.\r\rThe trail can be accessed at almost any point in Cowichan River Provincial Park.",
    "geohash": "c",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/6566/reg_4300959045-7c0e7ac53a-o-19432.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6566/reg_4300959163-b88b2dffc3-o-19432.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6566/reg_Holt-Creek-Trestle-D-20121019-00187-46447.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6566/reg_IMG-0510-7279.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6566/reg_IMG-1659-7279.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6566/reg_PICT0829-18988.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/trans-canada-trail-cowichan-valley-section-near-duncan-bc-6566",
    "stats": {
        "Activities": "mtn-bike hike",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 4,
        "Time": "5 hrs",
        "Total Distance": "35 km",
        "Town": "Duncan, BC",
        "Type": "out-and-back"
    },
    "title": "Trans Canada Trail Cowichan Valley Section",
    "trail_id": "6566"
}