{
    "description": "This is one of the ice climb haunts for both Saint John and Moncton ice climbers alike. Right off the secondary road, and less then 100 m from the car, is a band of frozen drainage that would flow into the kennebecasis River. From the cliffs, you can see snowmobilers cruising the ice sheets.\nBack to the real ice. Hampton seems to fatten early enough, and although it holds routes in the 10-15 meter range, it's a great spot to put up about 5 lines, ranging from WI2 to WI4. A noted line to the far right is a pillar that tops out on thin to almost no ice, necessitating the need for hard left turn. It's a creative climb.\nSo for people from Moncton, it's worth a very pleasant full afternoon ice social climbing, and for those from Saint John, it's a short travel distance to work on your footwork, then move on to other places.\nShannon Burt\nEast coast editor\ntrailpeak.com",
    "directions": "From Moncton, take Highway 2 toward Fredericton. At the junction, go onto Route 1 toward Sussex. At Hampton, turn off the highway, toward Hampton Station. (route 100) Go right on route 121, and left onto Main Street. Follow this until Route 845 on your left. Continue along until the route sharply veers right. Go straight onto Norton Shore Road. At the next V, continue straight or slightly left (dirt road) and continue along the water. You will be able to see the ice on the right behind some local houses. See the google map fr details.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NB/6567/reg_IMG-1007-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/6567/narrow_IMG-1004-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/6567/narrow_IMG-1005-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/6567/narrow_IMG-1010-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/6567/narrow_hampton-ice-copy-6702.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/hampton-ice-climb-near-saint-john-nb-6567",
    "stats": {
        "Activities": "climb",
        "From": "",
        "Seasons": "winter",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "1 km",
        "Town": "Saint John, NB",
        "Type": "out-and-back"
    },
    "title": "Hampton Ice climb",
    "trail_id": "6567"
}