{
    "description": "This is a description on how to get to a couple of waterfalls on two tributaries of the East River near Economy.  The Road to go up there is a dirt road but my Toyota Echo made it up no problem.  Once you leave your car you travel on a logging Rd which you could probably drive on if you had enough clearance.  The first part is through a logged area unfortunately.  There are small patches of trees left where a small brook was running and I followed this instead of trying to get through the logged area which can be full of prickly shrubs (i.e. raspberries if you are lucky).  I then met the branch of the brook but was unsure which way to the falls.  I headed upstream which was a mistake and followe d the brook for a little while until I figures that the falls were in the other direction.  I then followed the brook downstream.  \n\nAfter a while, you travel under a full canopy which is very nice until you reach the top of the fall.  If facing downstream, go on the right bank to make your way down the falls.  At the base of that waterfall is the confluence of the other branch of the stream.  Walk upstream for a little bit and you will be rewardede with two other waterfalls. This part of the forest is also quite nice as it has been a while since its been logged and you have a nice composition of mature deciduous trees.",
    "directions": "In Lower Economy, turn from Highway 2 onto the Gerrish Valley Rd and go up the mountain for about 9.5km.  Park and take the dirt road on your left. After 800m, take a right into woods until you hit the stream.  Head downstream to a very nice fall.  Below the falls is another branch of the East River.  Follow it up for a couple of hundred metres for two others falls.  Falls are about 20-25feet.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/6570/reg_2008-06-06-026-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6570/reg_2008-06-06-035-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6570/reg_2008-06-06-059-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6570/reg_2008-06-06-078-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/east-river-falls-near-truro-ns-6570",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "5 km",
        "Town": "Truro, NS",
        "Type": "out-and-back"
    },
    "title": "East River Falls",
    "trail_id": "6570"
}