{
    "description": "This is a nice place to visit. You can see two waterfalls almost side by side.  The second fall probably only exists at the high water time of year.\n\nThere is no trail, but you can follow the brook upstream for one km from the dirt road to the waterfalls. The first part is through a bunch of alders.... not fun but not as bad as other alder thickets.  There is an old foundation of some sort in the middle of it (maybe it used to be the site of a mill?).   There is a bit of downfall to go over and under but overall not too bad.  You will criss cross the stream a few times to get to the fall but the stream is fairly narrow and therefore the likelihood of wet feet is almost nil.\n\nThere are no holes deep enough for swimming at the base of either falls. The forest surrounding the falls is quite nice with a high overhead canopy.  It would be a good place to spend a few hours by the sound of the falls.  I tried to make my way back to the car by climbing the hill on the left (looking downstream).  This doesn?t save you any time at all and I would recommend just following the brook back to the road or maybe try the other bank.\n\nBenoit Lalonde",
    "directions": "Make your way to South Branch (near Brookfield) and take the Meadowvale Rd to Reid Station Rd on the right. Park 250m down the road and walk alongside the brook heading upstream.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/6573/reg_DSC-0209-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6573/reg_DSC-0215-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6573/narrow_DSC-0219-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mccullough-brook-falls-near-truro-ns-6573",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "3 km",
        "Town": "Truro, NS",
        "Type": "out-and-back"
    },
    "title": "McCullough Brook Falls",
    "trail_id": "6573"
}