{
    "description": "I noticed that the 1:50000 topo map showed a fall on this brook.  It takes a while to get there but the waterfalls are magnificent and there are a few more in the area to make this trip worthwhile.  You can see my GPS track and it is not a bad one to follow.  Park anywhere along the dirt road and head into the woods until you hit the stream.  After a couple of hundred metres you will reach the first fall and it is not a bad one but the lst two are way better.  The forest is mainly evergreen.  Patches have been cut recently but all along the stream is the remnant of the mature forest and it is quite easy to navigate through.  The last part of my GPS tracks are where there are two falls one after another.  I would say they are about 35 feet each with deep pools for swimming and enough areas close by to setup camp.  There are a few places where I crossed the river to make the walking easier and the stream is easy to jump over or skip over a couple of boulders.  My return track takes my along the top of the ravine on the right hand side of the brook (facing downstream).  Not a bad way to come back but maybe better to cut to the road that's located close by.  I will post some other waterfalls hike I've done close by but here are the names of the brooks;  Black brook (2 of them), Green Brook and Good Hunting Brook (2 branches).",
    "directions": "Take highway 348-South from New Glasgow and drive all the way to Caledonia.  In Caledonia take Cameron Settlement rd on your right and then take dirt road on your left (1km past the turnoff from #348).  Drive about 1.6km and park.  Head into the woods on your right.",
    "geohash": "f859",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/6578/reg_2009-11-26-210-small-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6578/reg_2009-11-26-217-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/chisholm-brook-falls-near-new-glasgow-ns-6578",
    "stats": {
        "Activities": "snowshoe hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "4 km",
        "Town": "New Glasgow, NS",
        "Type": "out-and-back"
    },
    "title": "Chisholm Brook Falls",
    "trail_id": "6578"
}