{
    "description": "This is a desciption on how to get to a 40 foot waterfall on the Black Brook located near Cameron Settlement. Once you leave your car by the bridge over the black brook and you are looking upstream, there is a house on the left bank of the stream.  At the back of the house is an area that has been clearcut.  The fastest way to the fall is throug the clearcut area (see GPS track) although it will be hard to say when to cut back to the stream/fall.  I followed the stream bank to get to the fall and then returned by the clear cut area.  The stream bank is fairly easy to walk with mostly mature evegreen trees.  At times of low water, you could probably wall on the edge of the stream as it is fairly shallow.  There are a few places where you have to climb on the banks to circumvent some large boulders or rocks that come right down into the stream.  The falls are beautiful but are located in a narrow area of the stream which would make it hard to put a tent in place close to the falls.",
    "directions": "From New Glasgow take highway 374 soth to Trafalgar and turn left on Cameron Settlement rd for about 8.7km and park approx at ( 45° 17.166'N,  62° 31.780'W).  There is a bridge over the black brook and a house by the side of the stream.  If you are making your way down from the 374 don't forget to stop in Hopewell (Turn on Elgin Rd) to see some waterfalls downstream of the bridge on Elgin Rd.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/6579/reg_2009-11-26-160-small-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6579/blackbrkCamSettkmnt.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/black-brook-falls-near-new-glasgow-ns-6579",
    "stats": {
        "Activities": "snowshoe hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "2 km",
        "Town": "New Glasgow, NS",
        "Type": "out-and-back"
    },
    "title": "Black Brook Falls",
    "trail_id": "6579"
}