{
    "description": "I finally made it to the series of waterfalls on the Chiganois River.  They are some of the most beautiful albeit a bit remote falls in NS.  \n\nThe first time around, I tried to make my way from the south on a branch of the Chiganois River that flows just downstream of the last main waterfalls visited with my track.  I was unlucky in that endeavor because on the day I was there, there was a big rain storm.  The tributary was so swollen by rain that I could not cross it at any point. I even tried to remove my boots to go across in the water but the current was too strong.  I think in summer it would have been easy to cross this tributary but the way down from the plateau is very (very) steep. \n\nThe way to go is definitely from the upstream portion which I describe below.  It might take you longer, but the walking is easy and navigation is also very easy. \n\nYou start on an old ATV trail by the side of a material pit.  You go down a little hill and you need to cross the upper reaches of the tributary I was describing in the upper part of the text.  There are numerous rocks that you can either skip across or if the water is high you can still step on with water below the top of your hiking boots.  You follow the main path (don?t take the right hand side branch) until you hit a logging road. (Maybe you can make your way there by car but I am unsure how)  Turn right on said logging rd and follow it to a kind of a T intersection.  Take a left and follow the path that hugs the edge of the clearcut area.  The road will become again a kind of ATV path.  Follow the path by and into the cleared area and you will soon start to descend into a forest which hasn?t been cut.  It is a very nice deciduous (leafy) forest with a high canopy.  The path soon begins to hug the side of a stream that will flow into the main branch of the Chiganois River.  The path will lead you to the main branch Chiganois River and close to the right is the top of a massive waterfall (50feet and the highest of the ones to see that day).  This will be about 3km from your car.  It looks like the path crosses the river upstream of the fall but on the day I was there the current and flow would have even prevented ATV from crossing.  I made my way to the fall by following the bank of the river and climbed down the ravine to the base of the first fall.  \n\nThere were a couple of large boulders at the base of the fall and conveniently a large tree trunk had been caught between them to make some kind of a bridge which I crossed.  I stayed on that side of the river to see the four or five remaining waterfalls.\n\nWalking through this forest is easy with little deadfall to slow you down.  A lot of the walking is slanted as you keep close to the stream.  On my way back I ended up going to the top of the ravine and followed some kind of an old, not very well defined, path to get back to the first fall.  Like I said there are many other falls on this part of the river with one in particular (picture posted) that is very nice to look at and has ample room to put a tent up by the stream with a commanding view of the fall.  I think there might be some more falls upstream of the 50 foot one but I need to return to confirm.",
    "directions": "Starting in Belmont (near Debert) take Belmont Rd north to Upper Belmont Rd.  Turn on Upper Belmont Rd and continue to  45° 32.409'N, 63° 21.289'W.  Park at the sand pit and head on the path on the right hand side.",
    "geohash": "f84",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/6581/reg_2009-10-05-056-small-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6581/reg_2009-10-05-011-small-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/chiganois-river-falls-near-truro-ns-6581",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 5,
        "Time": "3 hrs",
        "Total Distance": "10 km",
        "Town": "Truro, NS",
        "Type": "out-and-back"
    },
    "title": "Chiganois River Falls",
    "trail_id": "6581"
}