{
    "description": "UPDATE 2019Park at N45.55541° W63.11209°.  Continue straight as the road is now impassable and filled with raspberry bushes.  Not very far in, turn to the right ..again the road is now filled by bushes but the place you want to start turning is at; N45.55490° W63.11113°.          Then follow overgrown trail until it bisects a brand new atv trail (which I'm told ends up in someones backyard by the lakes).   The atv trail is about at; N45.55196° W63.10859°.  Follow it towards the brook and you will find a brand new staircase.  Go down to the river and follow it upstream to the fall.OLD post below for information onlyThis walk in the woods is fairly easy except for the last few hundred feet.  You might want to circumvent the area I bushwhacked though to get to the waterfalls.   The forest is absolutely amazing with the whole forest floor covered by ferns and a very high canopy.  This might be a good place for some tele turns in winter.  The dirt road will kind of stop at a clear cut area.  The river is basically on the other side of the clear cut area.  However I really struggled to get through this patch and I suggest you might want to go around the patch by staying in the mature forest and towards your left.  There is a small waterfall at the top of about 15 feet and I crossed the stream below it.  I then made my way down the larger waterfall (something like 50-60feet) on the left hand side of the brook if looking downstream.  It doesn?t look like you would swim at its base but I might be mistaken.  Falls are approximately at  45° 33.170'N, 63° 6.380'W.  Have a look at the 1:50000 topo before  setting out it will make your life easier.  Follow my gpx track it will be easier as well.",
    "directions": "Make you way towards Earltown from Truro and just before getting to that town turn right onto Briorchan Rd.  Go up the hill and turn right on Taylor Rd.  At the Y intersection head to the left (not towards the lakes).  After a few hundred feet, turn right and continue as far as you dare with your car.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/6582/57.WhiteBrookFall.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6582/narrow_2009-07-27-056-small-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/white-brook-falls-near-truro-ns-6582",
    "stats": {
        "Activities": "snowshoe hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "3 km",
        "Town": "Truro, NS",
        "Type": "out-and-back"
    },
    "title": "White Brook Falls",
    "trail_id": "6582"
}