{
    "description": "This is a good adventure to do in all seasons except for winter where the road leading to the start might not be plowed at all for 10s of km.  I think most of the stream you will follow on this trail is part of the Portapique River Wilderness Area.  Ask around and you will find out that most people are unaware of this area.  This hike will take you to about 4 different waterfalls ranging from 15-30 feet.\r\r\rFrom the blueberry field described in the direction, make your way down the dirt road and over the washed out area.  Follow this dirt road to its disappearance in a very dense evergreen forest.  The trees here are quite small and it is best if you can circumvent them by following the high grassed areas that surround the trees.  By going through the grassed areas you will not be going in a straight line but the walking will be easier.  The heading you need for the end of the dirt road to the stream (Gammel or Gamble Bk) is about due south.  You should reach the stream in about 12 minutes.  If you do not have good orienting skills, maybe this is not the adventure for you.  \r\rOnce you have reached the stream, head downstream and you will come up to the first fall of about 20 feet in about 20 minutes after leaving you car.  The walk to the first fall is very pleasant with a mature evergreen forest surrounding you.  The ground is almost devoid of shrubs which make travelling very easy.  After maybe another 20 minutes from the first fall you come on top of a series of waterfall stacked on top of each other.  There are at least 3 different sections that fall over 25 feet and a cascade type at the very end.  I made my way from the right (looking downstream) to bypass the first fall and then on the left to bypass the rest.  Be careful when going down along the falls because the cliffs are quite high and unstable but the rewards are worth the decent.\r\rI ended up turning around after 2.8km of leaving my car.  Maybe I should have made my way all the way down to the confluence of the Portapique River.  I returned by staying on top of the ravine and I saved about 10-15 minutes (See GPS track).   Like I wrote earlier this is part of a Wilderness area and the forest is very scenic and I highly recommend this adventure.  I will also try to post another adventure close by on Wilson Brook.\r",
    "directions": "Take highway 2 from Glenholme like you are going towards Five Islands.  Take a right on East Montrose Rd (in East Montrose) and turn left on Mines Bass River Rd.  On Mines Bass river Rd, turn right on old Castlereagh Rd.  Go up the Cobequid mountains and continue on this rd until 45° 29.425'N, 63° 46.194'W.  Take the dirt road on the right at that location, go around a lake and continue and the main path to 45° 29.619'N, 63° 44.489'W.  There is a huge blueberry field at that location and it is the start of the hike.",
    "geohash": "f84dv",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/6583/41.Gamble.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6583/narrow_2009-07-15-011-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6583/narrow_2009-07-15-027-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6583/narrow_2009-07-15-037-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6583/narrow_2009-07-15-053-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6583/narrow_2009-07-15-058-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6583/narrow_portipique-46494.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/portapique-river-wilderness-area-near-truro-ns-6583",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 5,
        "Time": "2 hrs",
        "Total Distance": "6 km",
        "Town": "Truro, NS",
        "Type": "out-and-back"
    },
    "title": "Portapique River Wilderness Area",
    "trail_id": "6583"
}