{
    "description": "If you are reading this trail post, don?t forget to read another one called Portapique River Wilderness Area which is located close-by to this hike.  The fist portion of the hike is along an old dirt road which is undriveable because of numerous trees that have fallen over and some very deep ruts.  From the start to the end of the road you will basically go down a hill the whole way to a distance of about 1.5km. At some point during the descent you will see signs that you have entered the Portapique River Wilderness Area\r\rAt this point enter the forest and head into a North direction.  The start of the walk in the forest is very peaceful as it is a mature deciduous forest.     There is almost no shrubs at the ground level, just a lot of ferns which makes walking very easy.  The canopy is high overhead which means that even in the height of a summer day, it is nice and cool to walk through the forest.  After a few hundred meters, you arrive at the top of the ravine with a brook flowing at its base.  The descent is quite steep but manageable since there are a lot of tress to hold on to.  Once you hit the stream, head downstream to its confluence with another brook on your left hand side (looking downstream).\r\rIf you follow that main brook (Wilson Bk) further downstream and to its confluence to the Portapique River you will see a set of two falls of about 10-15feet each.  On your way back, take the other branch of the brook and follow it up for a few hundred meters to another fall which is about 15-20feet high.  You will see that my GPS track goes a lot further up this branch of Wilson Bk but I did not see any other falls by going further upstream.  Once you?ve seen the fall, make your way back to your car by following the brooks.  I tried to go and ?dead reckon? my way back to the dirt road and ended up walking on the wrong side of the ravine for a while (see the GPS track that is between the two streams).    However the extra walk made me see another beautiful mature deciduous forest but really I could have done without the extra ups and downs of the ravines.\r",
    "directions": "From East Montrose, take East Montrose North and turn left on Mines Bass River Rd and follow it as it becomes Old Castlereagh Rd and head up onto the top of the Cobequid.  Turn right on a dirt road located at (45° 29.430'N, 63° 46.200'W) and park by the side of a dirt road located on your left at  45° 29.915'N, 63° 45.073'W.  Follow this dirt road?.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/6585/reg_2009-07-15-059-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6585/reg_2009-07-15-079-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/wilson-brook-fall-near-truro-ns-6585",
    "stats": {
        "Activities": "mtn-bike hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "8 km",
        "Town": "Truro, NS",
        "Type": "out-and-back"
    },
    "title": "Wilson Brook Fall",
    "trail_id": "6585"
}