{
    "description": "This is a description of a hike I did after looking at a map purchased at the Bass River general store that showed some waterfalls in the Cobequids (Title is something like Map of Economy River trails ? 5$).  The fist part is kind of boring since you follow some kind of an ATV/snowmobile/old logging road.  In the summer time, I would definitely bring a mountain bike to explore more but I was there in December so I snowshoed most of the way.  Like I said at first you make you way over some hills on this old trail.  The forest is not that spectacular but the sound of silence is deafening.  You will follow the main path and go around a small impoundment and a few minutes afterwards, you cross a small brook.  I kind of continued on the right after the brook and went further up the hill and pass a camp of some sort.  It was then that I looked at a map and realized I had missed the branch of the trail I wanted to take.  The branch you might want to take is located immediately to the right after you cross the brook.  I don?t know how I managed to miss it.  Anyways, you can see from my GPs track that I then went cross country across the forest in a NW direction for about 2.3km until I was on top of the ravine of the East Bass River.  Again the forest in this area is quite nice and mostly dominated by mature maple, beach trees.  There are small pockets of very tall evergreen as well.  The descent to the river is very very steep so take care.  There are also some small rock cliffs that you want to avoid.  Apart form the descent in the ravine, I was wearing my snowshoes the whole way.  At the bottom of the ravine, my GPS lost its signal for a while (see straight line track), but making my way downstream I saw two very beautiful (and ice covered) waterfalls (20-25feet).  Making your way along the river is mostly easy except in the areas around the waterfalls where you will have to climb back some ways up the slopes top get around rock walls.  After climbing back another steep slope to the top of the ravine, I almost immediately intersected a trail.  I walked on the trail back to the area where I had crossed the stream and missed the trail in the first place.  UPDATE 2018The description above I did back in 2006 or 2007. This was pre satellite image and pre some of the logging road that can take you way closer to the fall without too much bushwhacking.   I also notices a long area downstream of the main fall which had the potential for more falls (45.464331, -63.776535).  If you park somewhere here (45.460812, -63.780573), you can follow the dirt road for a while and then veer to the right and down a small ravine to the east bass river.   The ravine gets narrow with lots of rock walls and deep pools.  there are a few smaller falls on this section, one of which is a three tier of about 20ft total.  the last fall before the main fall is framed on either side by 10ft rock walls and its hard to take a good picture.   Afterwards you walk about 200m more and the main fall is right there (45.469869, -63.779968).",
    "directions": "In Bass River, take Maple Rd to where it turn sharply to the right and becomes Mines Bass River Rd.  Continue on Mines Bass River Rd, over the East Bass River and turn left on New Castlereagh Rd and drive about 2.25km to where a dirt road is located on your left.  Take this dirt road...BTW the New Castlereagh Rd was plowed when I did the hike in December.UPDATE 2018Take old Economy Rd to a logging road at; 45.442549, -63.791768.  Take the logging road heading north and turn on the right at; 45.458496, -63.786579.  Drive about 750m and park.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/6586/reg_2008-12-19-183-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6586/narrow_2008-12-19-175-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/east-branch-bass-river-falls-near-truro-ns-6586",
    "stats": {
        "Activities": "snowshoe hike mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "11 km",
        "Town": "Truro, NS",
        "Type": "out-and-back"
    },
    "title": "East Branch Bass River Falls",
    "trail_id": "6586"
}