{
    "description": "Again this is a hike I attempted after seeing a map showing some waterfalls on the upper reaches of the Bass River of Five Islands.  I started the hike by finding where a tributary flowed underneath the dirt road I was driving on.  Following this tributary (Little Pike Fire Bk), the forest is mainly composed of mature evergreen and the slope can be quite steep in some areas while very manageable in others.  There are two places on this brook where you will see some falls.  Although this tributary is quite small and might be dry at certain times of the year (I was there in late May and there was water flowing). \r\rOnce you have reached the main river, you need to go downstream for just a few minutes to see a wide but not very high waterfall.  This is probably a fun one to jump with a kayak.  The water looked very deep at its base and looked good for swimming.  I then made my way upstream.  The walk upstream is not too difficult although there are some cliffs to bypass by going some ways up the hill.  The river is quite wide and unless you plan to get wet, you cannot cross it easily in most places.   I followed it upstream to a place where the water cascades down through some fairly big rocks. The map I had showed a waterfall here but I think its more like a cascade, unless the fall was located more upstream then I went.  I retraced my steps back to a small tributary (Gundalow Bk) and made my way up this brook.  There was a small waterfall on this tributary but not much to look at.  I then cut across back to the first tributary and made my way back to the top of the ravine\r",
    "directions": "Take highway 2 to Five Islands.  Turn right on New Britain Rd and follow it to the top of the Cobequid.  I drove about 6km before reaching the tributary described above (45° 27.909'N, 64° 1.898'W).  I made my way up with my Echo so ground clearance is no problem for most vehicles.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/6587/reg_2008-05-30-009-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6587/reg_2008-05-30-041-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6587/reg_2008-05-30-049-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6587/narrow_2008-05-30-059-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6587/narrow_2008-06-06-001-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/bass-river-of-five-islands-falls-near-truro-ns-6587",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "8 km",
        "Town": "Truro, NS",
        "Type": "out-and-back"
    },
    "title": "Bass River of Five Islands Falls",
    "trail_id": "6587"
}