{
    "description": "This is an extra hike to add when you are visiting Harrington Falls or Garden of Eden Falls (as some locals call it) described in another post (Cobequid Waterfalls series).  Once you reached the base of the main fall, turn right and make you way to the top of the extremely steep ravine.  Be careful on this part since  its so steep, the soil has a tendency to be slippery.  But as always, the ascent is way easier than the descent.  Once you?ve reached the top of the ravine, don?t cut to the stream just yet but walk a little more upstream, as it will be easier to walk down the stream and then stand on top of the main waterfall.  The view is incredible but not a good place for people that are afraid of heights.  \r\rYou the follow the brook upstream for another 1.5km to another very nice waterfall.  The walk upstream is surprisingly easy with very little deadfall to go through.  The forest is mature with a high canopy.  The only problem I ran into was the bugs.  I didn?t bring any bug dope and there?re were enough flies buzzing my head that I had to wear my hoodie for the whole hike especially when I stopped to take some pictures.  This was one of the onlty times that I have been bothered by flies in NS (except once when I was swarmed on an island near Tangier?but that for another post).  The waterfall is about 20-25 feet and once you?ve reached it its time to turn around.  I made my way back downstream by following the brook but then went down the ravine on the opposite (of the way I came up) side of the falls.  I cannot say which side is easiest to go up/down as both are extremely steep but still doable.\r",
    "directions": "Direction;  Take Lynn Rd in Lower Five Islands to  45° 27.197'N, 64° 6.740'W.  The rail is on your left and it used to be marked by flagging tape until they clear cut the whole area.  Make your way towards this point (45° 27.286'N, 64° 7.066'W) which is beyond the clear cut area and back on the trail.  Follow this down to the Harrington River.  Cross it the river and you will be at the base of the main waterfall (Garden of Eden Fall).",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/6588/reg_2008-06-06-105-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6588/long_20170901-142530-60352.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6588/reg_2008-06-06-085-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6588/narrow_2008-06-06-083-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6588/narrow_2008-06-06-092-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6588/narrow_2008-06-06-095-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/garden-of-eden-upper-falls-near-truro-ns-6588",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "6 km",
        "Town": "Truro, NS",
        "Type": "out-and-back"
    },
    "title": "Garden of Eden Upper Falls",
    "trail_id": "6588"
}