{
    "description": "This is a small description of a trail that will lead you to the top of the north mountains and also to a small waterfall via some really cool single track mtn bike trails.\r\r\rI had seen a map of this area before that showed some trails built by the Woodville community.  I explored part of them and I will definitely be back to explore some more.  I parked by a weigh station and immediately turn right onto a trail and down a small hill.  At the bottom of the hill is a bridge that I crossed and then the trail went up a small hill on the other side to a small clearing.  At the small clearing, I took the left path and followed it up to the top of the north mountain.  The part that goes up is about the size of an ATC and some part are starting to get washed out but still a lot of fun on the bike.  The forest has a high canopy all the way up so you are quite shaded from the sun.  From this main trail there are numerous single tracks size side trails with some having built-up ramps on them.  Thanks to however built these, there great!  \r\rOnce on top of the mountain, my GPS track will take you on another single track that follows the brow of the mountain to a small waterfall on the brook which you crossed at first. Pass the brook you link up with an old logging road which is quite wide but there is not vehicle traffic so you can really let you brakes go and you come down the mountain.  I turned left on the logging road to get back to my car.  There are many more trails up there to explore.  Well worth the trip.\r",
    "directions": "Highway 101 to Berwick, Highway 360 north to highway 221.  Turn right on highway 221 towards Kinseman corner.  Turn left on Bligh Rd and follow it until a sharp bend in the road.  Right after the bend turn right on dirt rd (Bligh Rd).  Park at 45° 7.319'N, 64° 40.033'W.",
    "photos": [],
    "source_url": "https://trailpeak.com/trails/woodville-trails-near-berwick-ns-6589",
    "stats": {
        "Activities": "mtn-bike ski-xc hike snowshoe",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "4 km",
        "Town": "Berwick, NS",
        "Type": "out-and-back"
    },
    "title": "Woodville Trails",
    "trail_id": "6589"
}