{
    "description": "Located on Portland Island, Princess Margaret Marine Park is a great overnight or day trip from the government wharf at Swartz Bay.  Numerous trails circle Portland Island, affording views of the BC Ferries to the west and Moresby Island to the east. Expect to see an abundance of marine life as you pass Celia Reefs and pass Hood Island to the northeast.  Off the northeast shore of Portland Island at 48º 43.323' N, 123º 21.339' W., the sunken freighter G.B. Church is a popular diving location.\r\n\r\nAt the end of Barnacle Road (470020.0 5392715.4),  the Swartz Bay government wharf is a good launching point for kayaks, as is the small sandy beach.  Following the GPS waypoints through Stranger Pass will keep you well clear of BC Ferries transiting through Gosse Passage and Satellite Channel to the west, but beware of wake from both the ferries and powerboats. Keeping track of the ferries schedule is a great idea, as is monitoring Victoria Marine Traffic on channel 11. \r\n\r\nThe current in the channel between Portland and Brackman is strong;  if you forgot to check the tide tables before departing and find that the current is opposing you, detour around the west side of Brackman and approach Shell Beach from the north. Landing at Shell Beach, the water shallows rapidly at about 3 metres from shore, to a beach that is mixed shell and sand, and is very abrasive. Be sure to carry your kayak well above the high tide line as vessel wakes regularly sweep well past the current tide line.\r\n\r\nThe shell middens located at the Shell Beach campsite are protected archaeological sites, and may not be disturbed. Brackman Island to the southeast is a protected habitat, and may not be landed on.\r\n\r\nProvincial campsites are available at Shell Beach, Arbutus Point and Princess Bay. If camping overnight, ensure that all food is stored in airtight containers to avoid providing a buffet to the local raccoon population.\r\n There is GPS data attached to this trail (see \"download GPS\"), which if loaded into your GPS can help you find route points.",
    "directions": "Exit Pat Bay Highway onto Lands End Road, turn onto Wharf Road, wharf access on Barnacle Road.\r",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/659/reg_3.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/659/reg_4.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/659/reg_5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/659/narrow_1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/659/narrow_2.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/swartz-bay-to-portland-island-near-victoria-bc-659",
    "stats": {
        "Activities": "sea-kayak",
        "From": "",
        "Seasons": "spring summer",
        "Stars": 3,
        "Time": "7 hrs",
        "Total Distance": "0 km",
        "Town": "Victoria, BC",
        "Type": "out-and-back"
    },
    "title": "Swartz Bay to Portland Island",
    "trail_id": "659"
}