{
    "description": "This trail starts just off of a dirt road which was used for logging when I was there in the fall of 2009.  There are large trucks on the dirt road so be careful.  The end of the trail was, surprisingly, a waterfall.  From the starting point you need to go around a metal gate (44° 56.364'N, 64° 46.403'W).  From the aerial photos, the whole trail used to be under canopy but now the first half has been logged.  Follow the main hauling road in a South direction as it eventually goes down hill a little.  Once you?ve reached the low point in the trail and you start to climb again, the logging end as well.  The rest of the way to Shingle Mills Falls is on an old road full of small ruts filled with water and frogs.  The forest is mainly evergreen with some beech and maples.  You hear the roar of the water before getting to the falls on the right side of the trail.  These are not the tallest falls around but still quite nice.  This would make a nice hike in winter as well in snowshoes or x-ski (as long as the logging road is plowed?if not it will add another 7.5km return to the trip).",
    "directions": "Take the Berwick exit off highway 101 and make your way to the Evangeline trail (highway 1).  Drive west on highway 1 to East Aylesford and take a left turn on Aylesford Rd towards Factorydale.  Once you have gone up the South Mountain look for a dirt road on your right and turn (44° 57.024'N, 64° 44.049'W).",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/6590/23.ShingleMill.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6590/reg_2012-01-15-13.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6590/reg_Shingle-Mills-Falls-2-42976_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6590/reg_Shingle-Mills-Falls-42976.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/shingle-mills-falls-near-aylesford-ns-6590",
    "stats": {
        "Activities": "snowshoe hike ski-xc mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "2 km",
        "Town": "Aylesford, NS",
        "Type": "out-and-back"
    },
    "title": "Shingle Mills Falls",
    "trail_id": "6590"
}