{
    "description": "Another good trail to complete in any season is located to the south of Greenwood.  The trail could be done by hiking, biking, snowshoes or x-skis as it is quite wide and does not have too many hills.  The return point of the hike I describe is the waterfall but I think the paths continue further than this.\r\rThe first part of the path is wide enough and smooth enough that most people (including me) will drive down the road.  At some point you have to park since there is a big wash out around a culvert in the middle of the road.  The whole way to the falls is under a mature evergreen forest and you hear the sound of the water in the river almost the whole time you are hiking.  After a while you come to a branch on the trail, I turned right but if you continue straight you will still come out by the side of the falls.  However if you do continue straight you will be across form a big area that would be suitable for camping.  If the river is high, you might have a hard time to cross but if is relatively dry there are a few boulders downstream of the fall that you might be able to jump form one to another.  Anyways, I turned right on the trail and descended a small hill to a brand new, atv size, bridge.  I crossed the bridge and as soon as I started to go up I noticed a small trail on the left.  I took the little trail (good for mtn bike as well) and made my way to the fall.  The falls themselves are Crytal Falls are about 20 feet high.  At the base of the falls, is a large submerged area that would probably be good for swimming and jumping off from the top of the wall (you might want to check out the depth first).  Once you have returned to you car drive to the metal bridge that is just down the hill (Rockville Notch).  Park at the bridge and make your way on the right hand side bank of the stream (facing downstream) to another series of waterfalls.  These are about 100m from the road and therefore easy to bring children.\r",
    "directions": "Take highway 201 where it begins and follow it towards South Greenwood.  Turn left on Greenwood Rd and then right on Meadowvale and immediately left again on Greenwood Rd (again).  Drive all the way to Harmony Rd.  Turn right on Harmony and immediately left there is the start of the trail/ dirt road.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/6591/22.CrystalFall.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6591/long_P1030086-40942.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/crystal-falls-near-greenwood-ns-6591",
    "stats": {
        "Activities": "mtn-bike ski-xc hike snowshoe",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "3 km",
        "Town": "Greenwood, NS",
        "Type": "out-and-back"
    },
    "title": "Crystal Falls",
    "trail_id": "6591"
}