{
    "description": "A good trail to bring the family to some spectacular waterfall is located around Bridgetown.  The fist part of the trail follows the right hand side fence (if looking towards the hills) of a farm.  Once you are passed the farm buildings the trail continues on the dirt road that appeared to your right.  Follow this dirt road uphill for a while as you cross a small stream, turn right and pass a camp.  \r\rNot very further passed the camp you will notice some kind of faint trail on the left.  I took this trail and made my way down into a very nice mature evergreen forest to the brook flowing.  You will then start to hear the falls before you see them.  The first parts of the falls are mostly cascades over and under big boulders.  Make your way upstream to another and bigger fall that runs on top of the rock face and then t last one which is the tallest of them all and looks almost like a waterslide (for crazy people only).  There is another small yet scenic fall after that.  The whole way up the side of the falls is quite easy with only one or two trees to go over.",
    "directions": "Take highway 201 to Tupperville and turn left on a dirt road that is located beside a wood building.  You can see some orchards just passed the buildings.  Continue on this to a y intersection and turn to the left to where you will see some farm building surrounded by a fence.  Park there (44° 47.560'N, 65° 21.985'W).",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/6592/reg_Tupperville-Falls-II-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/tupperville-falls-near-bridgetown-ns-6592",
    "stats": {
        "Activities": "hike snowshoe",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "3 km",
        "Town": "Bridgetown, NS",
        "Type": "out-and-back"
    },
    "title": "Tupperville Falls",
    "trail_id": "6592"
}