{
    "description": "The walk to the fall is not too long from the main road but gets really steep to go down the ravine created by the Folly River. The first part of the hike is super easy as you follow the rail track for about 700m. alternatively, you could cut across the forest to reduce distance by half. After 700m I spotted a small brook flowing underneath the rail track and followed it down the ravine. The forest is mainly composed of big evergreen trees but looking at some aerial pictures there are also some nice deciduous forest all around. I think the evergreen are mostly confined to alongside the brook I followed down to the Folly River. The descent is not too steep except at the very end where it becomes pretty vertical so choose wisely where you will come down by the side of the river. Here is a nice waterfall on the folly river at that point (The toblerone) and another fall across the river that looks like it?s suspended in the air. I followed the Folly river back upstream, for a while. In some spots the walking is easy but in others you have to climb back high on the banks to circumvent some rock cliffs. I accidently turned off my GPS when I walked upstream but I made it to where the east branch Folly River flows into the main Folly River and did not see any other big waterfalls.",
    "directions": "Take highway 4 towards Wentworth and park pass the bridge over the railroad track. Follow the tracks on your right?",
    "geohash": "f84ff",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/6593/reg_2008-10-03-029-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6593/reg_2008-10-03-027-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6593/narrow_2008-10-03-033-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/folley-river-lower-fall-near-truro-ns-6593",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "2 km",
        "Town": "Truro, NS",
        "Type": "out-and-back"
    },
    "title": "Folley River Lower Fall",
    "trail_id": "6593"
}