{
    "description": "I will try to explain how to get to a massive waterfall and rock cliffs on the East Branch Moose River (not the West Branch).  I think this might be the tallest falls in NS apart from the North River Falls in Cape Breton Island.  Unfortunately I did this hike pre-GPS so I do not have a track to share with you.  The naming of some of the branches of the Moose River changes depending on the version of the 1:50000maps.  The fall I describe is located at (45.441° N 64.177° W).\nAfter finding some flagging tape by the side of the road in the vicinity I thought the falls would be I exited my car and followed this tape through an area which had been logged in the recent past and was now overwhelmed by small evergreen packed close to each other.  Keep following this tape or at least head into a direction to the mature forest you see growing in the back of the area that has been cut.  Once you have entered the forest, the walking becomes very easy.  The forest is mature and has minimal amount of shrubs growing since the canopy is complete and very high.  You ill walk on a descending slope to the edge of the ravine created by the East Branch Moose River.  The walk done the ravine is very steep at times but not too bad since there are a lot of trees that you can use to slow down your descent.\nI reached the stream and I immediately turned upstream towards the noise and bright sunshine.  The area around the falls is big and open.  On the opposite side of the ravine which I came down is a massive rock wall that could be used for climbing depending on the strength of the rock.  The fall is quite tall.  I would estimate in the 100 foot range at least.  From some maps I have seen, there are one or two more falls above this one but I did not know this at the time so I will have to go back.  Maybe I will bring my GPS that time around so I can post tracks.",
    "directions": "Highway 2 to Moose River and turn on dirt road once you have crossed a bridge over the East branch Moose River. Drive up the Cobequid mountain for about 4.4km and turn right on the dirt road.  The road continues kind of straight for a while and then turns right at the base of a small sugarloaf covered by evergreen.  Continue past the sugarloaf and do not take the road that turns left pass the sugarloaf instead continue in a straight direction.  After a few hundred meters look for flagging tape on your left.  The road continues for a while afterwards but finishes in a cul-de-sac.",
    "geohash": "f846e",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/6594/47.EastMooseRiver2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6594/reg_Moose-River-Gorge-026-27121.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6594/reg_Scan10117-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6594/narrow_Moose-River-Gorge-014-27121.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6594/narrow_Moose-River-Gorge-022-27121.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6594/narrow_Moose-River-Gorge-031-27121.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6594/narrow_Moose-River-Gorge-044-27121.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6594/narrow_Moose-River-Gorge-069-27121.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/east-moose-river-gorge-near-parrsboro-ns-6594",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 5,
        "Time": "2 hrs",
        "Total Distance": "4 km",
        "Town": "Parrsboro, NS",
        "Type": "out-and-back"
    },
    "title": "East Moose River Gorge",
    "trail_id": "6594"
}