{
    "description": "This is a short hike that you can bring the family to see some very nice waterfalls on two different brooks in the Wentworth Valley.  The bulk of the walking is on a old dirt road which would be suitable for x-skis or mtn bike although you would have to walk to reach the falls.\r\rMake you way down the dirt road at the end of the clearing and walk for 400m or so to the first brook.  You should see the fall at that point it is just upstream of the road.  The fall cascades down a nice pink colored rock face.  There is some deadfall to get through to get at the base of this fall.  \r\rCome back to the road and follow it as it gradually begins to ascend the mountains.  Once it reaches the top you will cross a brook.  Follow this brook downstream to see about 5-6 different falls of all shapes and size.  The last one is the biggest.  The walk in the forest to these falls is very easy.  Trees are widely spaced and you could probably do some nice tele turns in here as shrubs are most non existent and slope is steep enough to gain speed but not too much to loose control.\r",
    "directions": "Highway 4 towards Wentworth.  As you go don the hill from Folly Lake take second road on your right (First one is gated).  Follow this road to its conclusion in a cleared area.  Head North to the start of the dirt road?",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/6595/reg_2009-09-09-057-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6595/narrow_2009-09-09-007-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6595/narrow_2009-09-09-027-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6595/narrow_2009-09-09-035-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/hart-lake-brook-falls-near-truro-ns-6595",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "3 km",
        "Town": "Truro, NS",
        "Type": "out-and-back"
    },
    "title": "Hart Lake Brook Falls",
    "trail_id": "6595"
}