{
    "description": "Here is a good walk in the middle of nowhere that eventually takes you to two waterfalls of about 15 feet.  The map I had showed some more falls on the upper reaches of the East Branch Great Village River but really there were all small ones. \r\rYou head into the forest and follow the brook downstream.  This forest is not fully mature so expect top pass through some areas with a lot of shrubbery.  Overall it is not too difficult to pass through.  You will have to cross the stream from time to time to find easier walking areas.  At some point the stream you are following will flow into another one coming in from the right.  Continue heading downstream and you will eventually come to a nice waterfall.  I suggest turning around at his point.  \r\rI ended up walking a lot further to another point where the stream joined another (see my GPS track ).  However apart from being a nice walk in the woods there wasn?t too much to look at.  Once you?re heading upstream, take the left hand side brook and continue to another fall that cascades down over some rocks.  I then saw some clearing on the right hand side of the brook and went through the clearing until I hit a dirt road.  I followed this dirt road back to my starting point.  \r",
    "directions": "Highway 4 towards Wentworth, take a dirt road on your left 2km past the Baseline Rd.  The road goes up and by a communication tower.  Follow the main road to a spot where the stream flows underneath the road at ; 45.542° N 63.589° W",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/6596/narrow_2009-07-06-099-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6596/narrow_2009-07-06-107-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/east-branch-great-village-river-near-truro-ns-6596",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "6 km",
        "Town": "Truro, NS",
        "Type": "out-and-back"
    },
    "title": "East Branch Great Village river",
    "trail_id": "6596"
}