{
    "description": "This is a description on how to get to a 20 foot fall on the Main branch of the Great Village River.  The first part of the hike is on an ATV trail that looks good to further explore as it is leading into an area that doesn?t have many roads.\r\rI started this hike on a small dirt trail that lead you to a camp on the right but the trail continues through an area that has been logged until you reach the edge of the ravine of the river.  As you head down the path, you will begin to enter a forest which is a mixture of evergreen/deciduous.  Once you have reached the river head upstream.  The path crosses the river and continues?.As you head upstream, you will have some difficulty in walking in some areas as many trees have fallen over.\r\rThe walking is a bit difficult but not very long as you arrive at the fall in a short while.  After taking some necessary pictures, I headed to the left of the fall and up the ravine slope at this point.  I did this so as not to have to retrace my steps through the deadfall.  You will go up for a while in a nice mature evergreen forest until you arrive in the flat spots on the top.  From then on you have to navigate your way through raspberry and evergreen patches until you meet the road once more.\r",
    "directions": "In Londonderry, take Westchester Rd and drive on it pass the metal bridge over the Great village river.  Park at  45° 30.279'N, 63° 38.629'W and begin trail on your right.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/6597/narrow_2009-09-18-095-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/upper-great-village-river-fall-near-truro-ns-6597",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "2 km",
        "Town": "Truro, NS",
        "Type": "out-and-back"
    },
    "title": "Upper Great Village River Fall",
    "trail_id": "6597"
}