{
    "description": "This is a short hike I did to see a fall on a tributary of the East Branch Folly River.  Its close to another hike posted (East Branch Folly River).  This fall is in two parts of about 15 feet each.\nThe first part of the hike is through some alder patches and this is not the most fun you will have during the hike.  Luckily you are past this section pretty quickly and after a little walk through a mature deciduous forest you will find yourself at the top of the ravine of the river.  The trees along the ravine are mature evergreen and apart from the slope is easy to walk.  Once you have reached the river head upstream and try to cross the river as your final destination is across from where you are.  There are some placed that you will need to climb quite high back onto the slope to avoid some rock walls that plunge down to the river.  Maybe with some sandals you could just walk in the water in those sections providing the water is not too deep.  \nYou will eventually reach a brook on the right and you follow it upstream for a few minutes to the two falls.  Once I was back to the main river, I crossed it and made my way back to the top of the ravine in a more or less straight line to avoid retracing my steps long the river.  Once you?ve cleared the evergreen section, the slope is a lot less steep.   What remains to cross is another patch of alders and you?ve reached the road.",
    "directions": "I parked here to start; 45° 30.922'N, 63° 30.864'W.  To get close you can follow direction given in East Bracnh Folly River Post.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/6598/reg_2009-07-06-067-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6598/narrow_2009-07-06-056-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/east-branch-folly-river-falls-on-tributary-near-truro-ns-6598",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "3 km",
        "Town": "Truro, NS",
        "Type": "out-and-back"
    },
    "title": "East Branch Folly River - Falls on tributary",
    "trail_id": "6598"
}