{
    "description": "This summer I made my way up the Debert river to see some waterfalls.  After a lot of walking I realised that the main fall on this brook is close to the start of the hike.  Therefore the rest of the hike is to be enjoyed for the scenery and not in the anticipation of seeing another fall.\r\rRight from the start I should have looked more closely for the continuation of an old dirt road that parallels the river on the left bank (looking upstream).  I started on this road but then I ended up walking through some nasty alders thickets and a lot of raspberry bushed but eventually made my way to this road.  It is hard to find the road because the area has been logged and tall grass has grown to cover everything so look at my tracks on the way back to follow road.  Once you have reached the road follow it has it leads you to a nice deciduous forest.  After a while it kind of ends where a tributary enters the river.  The river is very wide and therefore it was easy to walk alongside the water for most of the way up to the first, and really only, waterfall.  The river bottom in this area is composed of boulders and looks like a mountain stream in most parts.  \r\rThe waterfall is located in a rocky ravine but are not tremendously high.  The falls are located about 2km from the start.   There is a good camping spot (used before) just downstream of the fall on the left bank).  Just below the main fall is a fairly big circular pool.  After taking some pictures I noticed that a beaver was swimming in there and it swam all the time I was there (15minutes).\r\rI headed upstream for a few kilometres along the banks of the stream and often having to scramble my way up the ravine to pass through some sections.  I eventually turned around in an area of the river which was constricted by high rock walls but unfortunately no falls. \r",
    "directions": "In Debert, take East Folly Mtn Rd up to where you cross a bridge over the Debert River.  Park at  45° 29.087'N, 63° 26.631'W and head upstream.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/6599/reg_2009-09-18-003-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6599/reg_2009-09-18-007-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6599/reg_2009-09-18-033-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/debert-river-fall-near-truro-ns-6599",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 3,
        "Time": "3 hrs",
        "Total Distance": "11 km",
        "Town": "Truro, NS",
        "Type": "out-and-back"
    },
    "title": "Debert River Fall",
    "trail_id": "6599"
}