{
    "description": "There is a short hike to a waterfall on Panuke Lake which you can easily do with a family.  This is a waterfall on the stream which empties Halls Lake into Panuke Lake.\r\rThe hardest part of this hike is to make your way to the start of the path.  I suggest that you look closely at the 1:50000 or aerial photos to draw a map to the trailhead.  Once at the trailhead follow the dirt road on your right towards Panuke Lake.  This road is quite wide and goes through an evergreen forest.  As you start to descend to the lake you will notice a faint trail on the left.  Take this trail (single track size) and follow it until it crosses the brook.  Follow this brook downstream for 10m on the right hand side (looking downstream) to have a better view of the fall.  \r\rThis is a neat fall because it actually ends up in the lake.  I have heard that it used to be taller but when they filled the lake (as a reservoir), the height of the fall was reduced.  However it is still about 30 feet high.\r",
    "directions": "In St Croix, take Hartville Rd and continue to sharp bend and past railroad track.  Just after the track, turn right on dirt road and past quarry and eventually taking a minor road that turns to the right (2.8km after leaving pavement).  I parked at (44° 54.795'N, 64° 3.050'W) and headed down the dirt road on the right.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/6602/reg_2009-06-01-027-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6602/reg_IMG-3326-40974.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6602/reg_IMG-3341-40974.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6602/narrow_2009-06-01-005-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/halls-lake-falls-near-windsor-ns-6602",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "2 km",
        "Town": "Windsor, NS",
        "Type": "out-and-back"
    },
    "title": "Halls Lake Falls",
    "trail_id": "6602"
}