{
    "description": "Here is an adventure along a reach of a river people in Nova Scotia have seldom seen.  This is the West Avon River located near Martock.  I got interested in this part of the river because the 1:50000 topo was showing a waterfall.  Part of the hike is on a logging road but the majority is through the woods and then along the river.\r\rDepending on what time of year you go on this hike you might not be able to drive as far as I did on the logging road.  Clearance is not too much of an issue as I drive a small Echo.  I parked at around   44° 54.807'N, 64° 19.485'W and continued a little ways (800m) to the end of the road.  You will then turn left and traverse through a logged area. At the time I was there the logged area was pretty prickly so you might want to find a patch of woodland which has not been cut (around a stream) and follow the stream to the river.  As soon as you enter the forest you go down a steep but short bank and then walk in a more or less flat area.  The forest is quite nice and composed of a mixture of mature trees.  Further along you will then find yourself on the lip of the ravine where the Avon river flows at its base. There are some bigger evergreen trees in this section.  \r\rFrom my tracks, once I reached the river, I headed upstream to see the falls.  The walking by the river can be quite easy but in some placed there is a lot of shrubbery to go through or around.  I was there right after a big rainfall and the river was swollen.  It may be possible t walk along the edge of the stream in times of lower water which would make the trek easier.  I walked along the river for a while and saw a couple of cascades but really no fall to speak of.  I don?t think there is an actual tall fall on this river but the rapids looked bid enough and fun to run with a kayak.  At some point during the walk along the river, I saw a road across the river that came almost right to the bank?maybe an easier way to see this stretch of the river.\r\rI made my way back almost the same way but this time around I did see some pretty good size boulders that could be used for bouldering.\r",
    "directions": "From highway 14 near Martock, take Sangster Bridge Rd and turn left on Mines Rd after crossing the East Avon.  Drive to  44° 55.240'N,  64° 19.217'W which is right past the powerlines and turn at that location on dirt road on left.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/6605/reg_2008-12-12-003-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6605/reg_2008-12-12-007-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6605/reg_2008-12-12-013-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6605/narrow_2008-12-12-011-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/west-avon-river-falls-near-windsor-ns-6605",
    "stats": {
        "Activities": "climb river-kayak hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "6 km",
        "Town": "Windsor, NS",
        "Type": "out-and-back"
    },
    "title": "West Avon river Falls",
    "trail_id": "6605"
}