{
    "description": "I got interested to see if this river lived up to its name; Falls Brook.  Also it is an easy spot to reach when travelling to the valley or Martock.   It?s also a fast hike suitable for the family. The turn around point for me on this hike was a waterfall and there are more than one to see.\r\rI?ve since returned to this river and found an easier way to see the falls.  From the road, turn right on a dirt road that passes between two houses and becomes an ATV trail.  If you continue straight on this trail you will come to the rivers edge.  Instead take a left on the main fork you encounter after the houses and head uphill.  As you are walking up the hill you are surrounded by mature evergreen forest.  Makes you imagine the way it used to be in some parts of NS.  If you see a trail to your left don?t follow it.  I have no idea where it goes.\r\rOnce you have reached the top of the hill, the trail is more or less level for a while and you need to turn and cut across the forest on you right.  You will probably hear the falls before you get to them.  The fall that is the most upstream is also the most scenic one and more classical fall where the water falls without touching the rock wall.  There is another massive fall further downstream which I think is taller but it kind of runs on the rock surface.\r\rI?ve included some pictures but it was very foggy at the time and the picture don?t do justice to this spot.\r",
    "directions": "From Highway 1, turn on Three miles Plains Cross Rd.  At the stop, go straight, the name of the streeet changes to Mountain Rd.  Start of Trail is at  44° 57.340'N,  64° 6.289'W",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/6606/31.EttingerFall.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6606/reg_15541525-10158099342150389-7317314919545035259-n-58061.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6606/reg_DSC-0038-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6606/narrow_2008-12-12-021-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6606/narrow_2008-12-12-033-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/three-miles-plains-falls-near-windsor-ns-6606",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "2 km",
        "Town": "Windsor, NS",
        "Type": "out-and-back"
    },
    "title": "Three Miles Plains Falls",
    "trail_id": "6606"
}