{
    "description": "I wanted to go on a hike that?s close to the city, short and has a goal; two falls.  The total distance is not great but some of the bushwalking is moderate. \r\rI started on a dirt road on the right with a signs prohibiting dumping.  The sign must work because I did not see any trash anywhere.  Take this road as it goes down and crosses a small brook.  There are some signs that there are abandoned mine pits along this road.  I guess it explains the name of the road taken to this location.  Continue on the main path as it goes up a hill, onto a ridge and finally back down a small hill.  At the bottom there is a bridge that you go across and not very long after you turn to the left.  You continue on this path as it does a complete 180 degree rotation on your heading.  Once you reach this point (44° 55.444'N, 63° 29.733'W) cut in the woods towards the river on your left.  \r\rAs you bushwack your way through many bushes you will be rewarded by two falls of which the second one is the tallest and most scenic.  Once you have seen the second fall, head back to the road.  As you can see from my track, I took the long way to get to the falls.  Therefore I followed a faint trail to the right upon my return to a small bridge made with a metal railing.  I then made my way through the mixed forest back to mines Rd.  This saved time but walking wasn?t easy and also you don?t want to end up in somebody?s backyard so be careful.  \r",
    "directions": "Exit the 102 after the airport, and take highway 2 towards Elmsdale.  Turn right on Oldham Rd and follow it to a 90degree bend.  Continue straight in the bend and take Mine Rd.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/6607/reg_DSC-0007-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6607/narrow_DSC-0006-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/oldham-falls-near-halifax-ns-6607",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "4 km",
        "Town": "Halifax, NS",
        "Type": "out-and-back"
    },
    "title": "Oldham Falls",
    "trail_id": "6607"
}