{
    "description": "There is a fall that appears on the 1:50000 topo map near NS Power dam in White Rock. Part of the trail is on an ATV trail while the other part is through a forest onan unofficial trail\r\n\r\nOnce you leave your car and walk down the dirt road for a short while, take the right hand side atv-size trail. Continuing on, you will go downhill for a while and be surrounded by a very nice mature deciduous forest on the left and a recently cut area onthe right. There are some fields from time to time as well as a camp to the left of the trail.\r\n\r\nOnce you have reached a wood bridge over a stream, you have gone too far....\r\n\r\nI did find a faint trail from the fall to the ATV trail on my way back. Look for it, it is on the right hand side of the brook facing downstream. If you find the trail walking is easy, if not then it will just take you a bit more time/energy to reach the falls. You come to the top of the fall in an area which looks like its been use for camping. Go towards the right and away from falls to find a gently way down to the stream. There is a deep pool at the base of the fall which would be good for swimming. The fall is about 25 feet.\r\n\r\n\r\n\r\n\r",
    "directions": "\r\n\r\nFrom Highway 1 past Wolfville, turn left on sleepy hollow Rd and continue on it to a point just after you crossed the Gaspereau River. Turn right on Sunken Lake Rd and park at 44° 59.420'N, 64° 27.439'W",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/6608/29.LittleRiverFall.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6608/reg_2008-08-14-038-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6608/narrow_2008-08-14-003-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6608/narrow_2008-08-14-021-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/little-river-falls-near-wolfville-ns-6608",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "4 km",
        "Town": "Wolfville, NS",
        "Type": "out-and-back"
    },
    "title": "Little River Falls",
    "trail_id": "6608"
}