{
    "description": "There is a series of waterfalls on Fourmile brook upstream of the culvert beneath the highway. There is no marked trail but it is easy to walk on the edge of the river for most of the way.\r\rMost of the forest in this area is dominated by mature evergreen but there are some maple and beech trees as well.  The brook is not very wide and fairly shallow.  This makes it easy to cross from side to side when you need to.  There are some areas where rock walls come right down to the edge of the stream and in those cases you have to go up on the slopes of the ravine to make your way forward.  \r\rThere are two significant falls on this brook.  You will come first to a 15-20 foot fall that is kind of shaped like a trapezoid.  The second significant fall is even taller (maybe 50ft) and is shaped more like a pyramid.  There could be some ice climbing opportunities on the second one although I don?t know if the fall is steep enough (maybe good for beginners ice climbers).  \r\rThere are a few other falls in this area that are worth a visit and will try to post info on the following; Arrowhead, Drysdale, Annandale.\r",
    "directions": "Make your way to highway 256 (Balmoral Rd) between West New Annan and  The Falls Park at 45° 38.296'N, 63° 16.743'W and follow brook upstream.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/6612/56.FourMile.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6612/reg_DSC-0023-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6612/reg_DSC-0010-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/fourmile-brook-near-tatamagouche-ns-6612",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "1 km",
        "Town": "Tatamagouche, NS",
        "Type": "out-and-back"
    },
    "title": "Fourmile Brook",
    "trail_id": "6612"
}