{
    "description": "This is a description of a loop on the Crowbar trail system in the Salmon River Wilderness Area.  This is the area that is closest to Dartmouth and also part of the original trails that have been developed for a while.  \nAfter crossing the stream you will see some trail markers.  I made my way to the right but the first part (called lookoff loop)can be done on either side to reach the lookoff.  By going to the right, you will get to the edge of a small lake quickly.  The trail then turns to the left and tarts to climb a small hill.  You are following a small rock wall (20ft) for a short while.  \nThe forest for most of this trip is dominated by tall evergreen tress.  There are so smaller deciduous trees.  Also with elevation gain, the trees do change and become smaller as they are exposed to least favorable growth conditions.  After walking on a level area and then a short descent you will begin the last climb to the lookoff point.  The terrain is not too steep as my four year old made it up with no problem (descent can be a bit more tricky).  At the summit you will walk on some granite ridge and finally to an area that is quite exposed and has a erratic block on the ridge (see picture).  This is the lookoff point.  You will see the camp below you as well.\nAfterwards keep on the trail and at the Y intersection take a right for a longer trip or continue straight to come down the ridge and then back to your starting point.  If you decide to continue for a longer trip, it will be well worth it.  For a while afterward you are walking on the top of the ridge and on some more granitic rocks.  As you are getting near a lake, you enter an evergreen forest and then make your way down the ridge to the edge of the lake.  You cross the outlet of the lake and then kind of follow the edge of the lake.  Then it?s back into the forest and a long climb to the top of another ridge.  I remember seeing some pretty big boulders (25ft plus) during this hike and I think some of them were during this climb.  At the top you get another viewpoint.\nThere is also another trail that links to your right in this area.  This trail will lead you all the way to Porters Lake if you follow it.  I did not follow this trail but rather continued towards Salmon River. After being at the top of the ridge you descend into the forest and back to the edge of the lake before again starting to gain elevation again.  At the top of this next ridge there are some more large areas of exposed granitic rocks.  The descent to the river was made difficult because of deadfalls.  This has probably been cleared since the time I was there.  \nYou finally make your way to the edge of a large rectangular lake.  At this point you will follow the trail and lake downstream.  There is also an unmarked trail that follows this lake upstream to the largest lake located upstream.  This part of the trail has been in use for a longer time and is quite easy to follow.  There are some magnificent evergreen trees in this area.  There are also a few unofficial camping spots along the way especially near the stream that has a few rapids in it.  This trail leads you back to the head of the lake where the camp is located.",
    "directions": "Take highway 7 to Lake Echo and turn left on Circle Drive, and then turn left on Sunrise drive.  This becomes River Rd.  Drive all the way to the end of the road to an area by a scout camp.  My track begins on river rd because I did the hike in March and the road was only plowed to my starting point.  Walk along the lake by the scout camp on a trail and then cross the stream that flows into the lake using the rocks or small wood bridge (the bridge was broken last time I was there).",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/6617/reg_2008-03-14-007-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6617/reg_100-0858-27121.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6617/reg_100-0870-27121.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6617/reg_100-0885-27121.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6617/reg_100-0894-27121.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6617/reg_100-0916-27121.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6617/reg_100-0918-27121.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6617/reg_100-0929-27121.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6617/reg_100-0931-27121.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6617/reg_100-0937-27121.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6617/reg_2008-03-14-001-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6617/reg_2008-03-14-015-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6617/narrow_15283997-10157987614715389-7483573946542140713-n-58061.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6617/narrow_15318018-10157987614690389-5669830057541536068-n-58061.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6617/narrow_2008-03-14-009-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/crowbar-lake-trails-salmon-river-wilderness-area-near-halifax-ns-6617",
    "stats": {
        "Activities": "hike snowshoe",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "12 km",
        "Town": "Halifax, NS",
        "Type": "out-and-back"
    },
    "title": "Crowbar Lake trails, Salmon River Wilderness Area",
    "trail_id": "6617"
}