{
    "description": "This is one of the first fall I saw on mainland NS and it is quite massive.  To reach this fall the first time, I followed the stream from the road but I will explain a better way to get there.  The fall is about 50 feet high and quite wide.  \r\rJust passed the stream is a large logging road, make your way up the road and turn immediately to your right on a road at the first chance you get.  You are crossing some areas that have been logged recently but stay on the haul road because it is right over the old trail.  \r\rAfter about 300m you exit the logged area and the trail is now completely covered by evergreen trees.  The trees are tall enough to give off good shade in the summer.  Follow this trail for another 350m to another logged area.  Stay on the same heading through the logged area to the trail awaiting for you on the other side.  The trail resumes under a canopy for another short while before again getting into a short but cleared area.  Afterwards follow the trail over some wet areas and at some point you will hear the falls on your right.  Cut across the forest and down the ravine to the base of the waterfall.\r",
    "directions": "Take highway 289 past Upper Stewiacke and towards sheepherders Junction.  The stream you need to follow is at  45° 21.570'N, 62° 51.238'W.  If you pass the county line you have gone too far (stream is about 1.3km before county line).",
    "geohash": "f85",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/6619/reg_Scan10069-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6619/Sheepherders.jpeg"
    ],
    "source_url": "https://trailpeak.com/trails/sheepherders-falls-near-new-glasgow-ns-6619",
    "stats": {
        "Activities": "snowshoe hike ski-xc",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "4 km",
        "Town": "New Glasgow, NS",
        "Type": "out-and-back"
    },
    "title": "Sheepherders Falls",
    "trail_id": "6619"
}