{
    "description": "NTS Map:92B11.  Along with 11 other small Gulf Island parks, Sidney Spit Provincial Marine Park, located on Sidney Island, was incorporated into one umbrella National Park in May 2003.\r\nThe straight line visual route paddle to Sidney Spit from the boat launch ramp at Tulista Park passes through waters that can rapidly develop moderate seas. This is a popular fishing area and marine traffic can be heavy.  Attention to tide tables and current marine weather forecasts are essential in this area.  \r\nIn the summer months, a foot passenger ferry operates from the foot of Beacon Street in Sidney. The 25 minute ride is relatively inexpensive, and is a great way to pre-position tents and bulky gear at your base camp for kayak exploration of the area.\r\nExpect to see Orcas, Dall porpoises and harbour seals; bald eagles, cormorants, and blue herons;  fallow deer, wild turkeys, quail, pheasants, squirrels and chipmunks.\r\n\r\nThe 400-hectare marine park at the west side of the island is well known for a long sandy spit, sheltered  lagoon, and hiking trails. A 2.5 hour hike will take you from the lighthouse at the west end of the spit, to the remains of an abandoned brick factory at the east end of the park.  While at the brick factory, binoculars provide good views of the Mandarte Island Seabird Colony. The trails are easily passable by all ages. Facilities include a day-use picnic area, 24 tent sites, fire pits and pit toilets. The potable water supply can be limited and salty; be sure to bring plenty of drinking water. \r\n\r\nThe paddle is 2.62 nautical miles from the Tulista Park boar ramp to the ferry dock at Sidney Spit. A detour into the lagoon to the east is an additional 1.1 nautical miles. There is GPS data attached to this trail (see \"download GPS\"), which if loaded into your GPS can help you find route points.",
    "directions": "Pat Bay Highway to Sidney, follow Beacon Drive to signs for Washington State Ferries terminal.\r",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/662/reg_IMG-4886-33605.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/662/reg_IMG-4903-33605.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/662/reg_IMG-4909-33605.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/662/narrow_s1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/662/narrow_s2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/662/narrow_s3.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/662/narrow_s4.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/662/narrow_s5.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/sidney-spit-marine-park-near-victoria-bc-662",
    "stats": {
        "Activities": "river-canoe sea-kayak hike",
        "From": "",
        "Seasons": "spring summer",
        "Stars": 3,
        "Time": "7 hrs",
        "Total Distance": "5 km",
        "Town": "Victoria, BC",
        "Type": "out-and-back"
    },
    "title": "Sidney Spit Marine Park",
    "trail_id": "662"
}