{
    "description": "I'm all for an urban outting when time is tight, and you just want to get out there after work, yet maintain other commitments or work within shorter time frames.\nAny other time of year, you couldn't pay me to step foot inside a golf course. Let's just say that the activity isn't my cup of tea. That being said, I'm very happy when these private operators allow the public to access their grounds, and even set a groomed track for cross country skiers.\nRight in the heart of Charlottetown, you'll find a wind swept landscape, with tree stands here and there to break up the sight lines. I took a morning to try it out, just after a small snow storm leaving fresh wet snow.\nBecause of the new snow and blowing winds, the two day old track had been covered over. I managed to find it here and there, but for the main part, set my own track, and did the loop twice. Trying to avoid the fairways for the most part, I stuck to the edges, or the treed sections.\nIn all, my track measured about 3.7K, and I did that loop twice. I suspect the track they put down would be shorter, but I could be wrong. Regardless, it was a good time, and with the growing daylight hours after work, I would consider returning regularly.\nShannon Burt\nEast coast editor",
    "directions": "Belvedere Golf course is best accessed off the perimeter road on the east end of Charlottetown. Drive east along Riverside Drive, and turn right at Kensington Road. After two intersections, take Greensview Drive on your left, and look for the clubhouse on the right.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/PE/6620/long_belvadere-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/6620/reg_IMG-0002-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/6620/reg_IMG-0003-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/6620/reg_IMG-0007-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/6620/reg_IMG-0008-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/6620/narrow_IMG-0001-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/6620/narrow_IMG-0004-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/6620/narrow_IMG-0006-6702.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/belvedere-golf-course-xc-ski-near-charlottetown-pe-6620",
    "stats": {
        "Activities": "snowshoe ski-xc",
        "From": "",
        "Seasons": "winter",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "4 km",
        "Town": "Charlottetown, PE",
        "Type": "out-and-back"
    },
    "title": "Belvedere Golf course XC ski",
    "trail_id": "6620"
}