{
    "description": "This hike takes you to a good size waterfall in an area where you wouldn?t expect a waterfall of that size (about 50ft).  I describe two ways to get there; one is easier than the other.\r\rI went to seek this waterfall in summer after a rain event and therefore the stream and fall were probably running higher than usual.  I did not know where the falls were located; therefore I followed the stream up from where I parked my car.  After going over a fence I cut to the streams edge.  The first few hundred meters are hard to go up by the side of the stream as it is overcrowded by alders.  Afterwards you walk into an open area and then into an evergreen forest.  There are a few trees down but overall the walking is easy.  There are a few places that you will have to cross the stream but it?s no problem as it is not very wide.  I made my way up the left side (facing upstream) of the ravine to circumvent some of the deadfall and then came upon the falls below me.  I had to climb down a fairly steep slope to the base of the falls.\r\rOnce I finished taking some pictures, I climbed back up the left side again and there just above the falls and to the left is a dirt road.  I followed this wide dirt road down a long hill.  At the end of the hill is a locked gate by the side of the main road where I parked.  The roadway is definitely the easiest and fastest way to go up to the fall and the descent would be fun in X-skis.\r",
    "directions": "Take highway 236 in Truro towards old Barn.  Turn left on Milltown Rd.  Look out for a gated dirt road on your left (45° 20.284'N, 63° 23.651'W).",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/6622/narrow_2009-06-24-014-small-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mill-brook-falls-near-truro-ns-6622",
    "stats": {
        "Activities": "ski-xc hike",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "2 km",
        "Town": "Truro, NS",
        "Type": "out-and-back"
    },
    "title": "Mill Brook Falls",
    "trail_id": "6622"
}