{
    "description": "There are many ways to get to these falls/area and I will go over the way I made it there the first time.  From the 90 degree corner, I walked down the old overgrown road that branches off the corner.  After only a few minutes, I came upon a brook to cross.  I was there is the winter so crossing was easy.  However it might be harder to cross on days where the stream is swollen by rains.  After I crossed the stream, I climbed the slope and headed to the left (in a downstream direction).  If you follow the stream to the top of the fall, you will not be able to climb down to its base at that point because the terrain is too steep.  I made my way up to the top of the ravine and followed another old trail though a mixed forest and down the slope towards the Bay of Fundy.\nThis trail had a sharp bend to the right.  I just kept going straight into an evergreen forest and then finally to the edge of the Bay of Fundy.  At this point I had to carefully make my way down the rosk to the beach.  Some of these rocks are quite high and you have to be careful where you come down.  On the beach, I made my way back to the stream.\nThe stream has carved a kind of gorge.  The walls are either side are quite steep and high above you as you walk upstream.  It looks like most of this gorge or cove would be filled at high tide so you may need to time this hike with the tides.  At the back end of the gorge or cove, the stream takes a left turn and disappears from your view.  As soon as you get to that point where the streams bends you will see the massive waterfall that is located at the end of the gorge.  There are a few trees to go over or under to reach its base.  There is some kind of legend with this fall and a pirates treasure (search for it on the internet ? Black Hole Bk)\nOn your way back, you can turn left once you reach the Bay of Fundy.  You will come across a few house built on top of a bluff.  There is a road that will lead you back to your car which located by the houses.  If you go just a little further you will come across a brook.  Follow it up to another nice waterfall.  This fall is perched so the water just falls a good 20ft to the ground?very scenic.  If you go back to the beach and still go a little more to the left (towards Baxters Hbr), you will see another brook.  Follow it up to see two more very nice falls.\nMy GPS tracks shows how to get to the Black Hole Brook cove the fastest way possible (its the cove to the right of the track).   Unfortunately at high tide the cove is full of water so the track ends there.  There is also a smaller track going to the left of the main track and this leads to another fall described above",
    "directions": "Take highway 221 towards Sheffield Mills and take the Black Hole Brook Rd. On top of the mountain, stay on the Black Hole Brook Rd (straight).  Continue to where the road has a 90 degree turn.  Take the dirt road on your right (45° 13.930'N, 64° 29.711'W)",
    "geohash": "f841k6",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/6624/reg_07584076-B910-4FBD-99E1-F138157C8F4D.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6624/reg_2008-02-01-006-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6624/narrow_2008-12-18-065-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6624/narrow_2008-12-18-073-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/black-hole-brook-fall-near-canning-ns-6624",
    "stats": {
        "Activities": "climb hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 5,
        "Time": "2 hrs",
        "Total Distance": "4 km",
        "Town": "Canning, NS",
        "Type": "out-and-back"
    },
    "title": "Black Hole Brook Fall",
    "trail_id": "6624"
}