{
    "description": "I made my way to this waterfall by taking the long way in.  Good workout if you decide to follow my tracks but if you do not have much time, I suggest you take the dirt roads to the upper reach of the stream and walk downstream for a hundred meters or so to the fall.\r\rThis hike starts by the side of the road where the brook flows just alongside of it.  Follow the stream upstream, keeping it on your left.  By doing this you can avoid some hardships and walk in old agricultural fields.  As you come close to a house, head into the woods.  Up on the opposite bank, you will notice that the forest has been cut.  I tried to cut across this logged area but the bushes make it very hard to walk.  Therefore, I went back to the stream and made my way slowly upstream.  The first part of the hike can be difficult at times since this area is full of deadfall (Hurricane Juan maybe).  At mid-point of the hike the deadfall aren?t numerous anymore and the walking becomes easier.\r\rThe forest is composed of evergreen tress and there are a few nice spots with a high canopy.  You end-up criss-crossing the stream a few times as you make your way upstream.  Towards the end of the hike, there is a branch to your right, don?t take it.\r\rAt the end there is a nice 20 ft waterfall.  After looking at my tracks on Google Earth, I saw that there was a road just above the fall.  If I had known that the fall was located so close to it, I would have come in to the fall from upstream instead.  \r",
    "directions": "Drive To Gays River and take highway 224 towards Cooks Brook (Eastern direction).  Park at 45° 2.177'N, 63° 15.624'W , locate the brook and head upstream.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/6626/narrow_DSC-0018-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/cooks-brook-fall-near-stewiacke-ns-6626",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 2,
        "Time": "2 hrs",
        "Total Distance": "8 km",
        "Town": "Stewiacke, NS",
        "Type": "out-and-back"
    },
    "title": "Cooks Brook Fall",
    "trail_id": "6626"
}