{
    "description": "Start from the gravel pit right beside the Three Sisters Dam along Spray Lakes Trail. Get on the second ridge to the left of the gully. Apparently, there is a trail that goes through the wooded area. Follow this, and you will eventually pass the treeline. Once you pass the treeline, follow the ridge to the summit. eventually, you will have to climb down a challenging face of rock (I'd grade it at 5.1). Its not too bad; you can boulder it. Once past this, keep the upper ridge on your left until you find a clear path to the summit.I did this trail in february, but I didn't take the recommended trail. I took the right ridge, which I found considerably more difficult, albeit shorter. As a general rule, allow yourself twice the amount of time to complete the route in the winter as you would in the summer. This means taking a headlamp and getting an alpine start, even if its dark. I highly recommend doing this scramble in the dry season, as certain areas of the mountain are very prone to avalanches, especially on the downclimb. If you do go in the winter, make sure you take food, water, avalanche safety equipment, crampons, gaiters, and at least one alpine axe (I strongly recommend taking two for faster ascent and better control if you do begin to slide). Snowshoes are optional. If you don't like the idea of getting an alpine start in the winter, be prepared to stay on the mountain overnight, if conditions necessitate it.I don't recommend taking this trail in the spring. During the spring, the danger of avalanches on this particular mountain range is extremely high (so high, in fact, that the trail for middle sister is completely shut down). If you do decide to do it in the spring... its your funeral.The trail may not be 13km. The distance depends on the route you take. There is another, longer route that takes you up the northeast face that requires a 7.4km hike to the base. I can't give you an estimate for the distance of the route described on this page. You'd have to trace it on a map. Gem Trek publishes topo maps of the area, so it might be worth looking at one of those for your route.Important to keep on the same track as you took up. when you reach that flat section after which you have to go down along the creek. Take a note of the markers which get you back on the ridge, which takes you down to the start if the tree line Once you come down to the start of the treeline, there is a major unmarked section going to left - Avoid it. We took the wrong turn to left and so did 2 other groups. This left section takes you down to the creek which goes along the ridge which is on right. Coming down this creek wasted our 2hours . Where it should have taken us only half hour to get down from treeline, it took us more than 2.5 hours and its very slushhy and sketchy. You wont realize you took a wrong turn until you come way down and it just a steep drop to the main creek area. Actually this must have been an old trail which got completely destroyed by the floods in 2013. Best is to stay on the Right side and on the ridge when you start the treeline descent. If you feel its not the way you came up by, don't see any pink markers on trees, then its better to walk up to the tree line and take the correct route.",
    "directions": "Take the Spray Lakes Trail past the Nordic Centre and through the provincial park. In the winter, the drive takes about 30 minutes. There are three dams. The gravel pit I spoke of is beside the third dam, which is located a few kilometres past the spot where you cross the bridge spanning the river. You'll be able to see windtower from the starting point, to the east.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/6629/long_20170703-124104-55837.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6629/reg_Big-Sister-Kananaskis-Sept-13-43--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6629/reg_Big-Sister-Kananaskis-Sept-13-94--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6629/reg_Big-Sister-Kananaskis-Summit-Ridge-Sept-13-5--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6629/reg_image-52855_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6629/narrow_Big-Sister-Kananaskis-Down-climbing-Sept-13-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6629/narrow_Big-Sister-Kananaskis-Sept-13-74--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6629/narrow_Big-Sister-Kananaskis-Sept-13-81--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6629/narrow_Big-Sister-Kananaskis-Slope-Sept-13-44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/big-sister-near-canmore-ab-6629",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "winter fall summer",
        "Stars": 4,
        "Time": "7 hrs",
        "Total Distance": "13 km",
        "Town": "Canmore, AB",
        "Type": "out-and-back"
    },
    "title": "Big Sister",
    "trail_id": "6629"
}