{
    "description": "The Grice Bay boat launch is located at the end of Grice Bay Road, which leads east from Hwy 4. The boat launch and parking lot are located within the Pacific Rim National Park Reserve, so be prepared to pay for parking.\r\n\r\nAt low tide, approximately half of the 32 km mudflats at Grice Bay are left exposed. At higher tides, the mudflats are partially covered by dense growths of eelgrass and algae and can be quite difficult to pass through. The GPS waypoints keep you well to the west of the exposed mudflat areas, but you may have to head slightly north of track to avoid shifting patches of eelgrass. \r\n\r\nDawley Passage Provincial Park is located at the south end of Fortune Channel between Meares Island and the west coast of Vancouver Island. The 154-hectare park has no services, no set campsites, and collects no fees. The park contains a number of Nuu-chah-nulth First Nations heritage sites. Seals, sea otters and bears feeding at the low tide line are common sights in this area. In early June, migrating grey whales frequent the area to feed.\r\n\r\nAlthough the waters are sheltered, strong currents in the range of 4 to 5 knots in the tidal narrows of Dawley Passage give this route an intermediate to expert level of difficulty; don?t try this area without carrying marine chart #3673 and up to date tide and current tables. \r\n\r\nCanoe and kayak rentals are available in Tofino and Ucluelet.\r\n There is GPS data attached to this trail (see \"download GPS\"), which if loaded into your GPS can help you find route points.",
    "directions": "From Nanaimo, head north on the Island Hwy to Hwy 4 to Port Alberni. Continue to the Tofino-Ucluelet junction. Head north to Grice Bay Road.\r",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/663/reg_g1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/663/reg_g2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/663/reg_g3.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/663/reg_g4.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/663/narrow_g5.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/grice-bay-to-dawley-passage-provincial-park-near-tofino-bc-663",
    "stats": {
        "Activities": "sea-kayak",
        "From": "",
        "Seasons": "spring summer",
        "Stars": 4,
        "Time": "7 hrs",
        "Total Distance": "7 km",
        "Town": "Tofino, BC",
        "Type": "out-and-back"
    },
    "title": "Grice Bay to Dawley Passage Provincial Park",
    "trail_id": "663"
}