{
    "description": "Very pleasant deambulating along the Kootenay and Cross Rivers, just southeast of Kootenay NP, near Radium Hot Springs, BC.\r\rThis is a private resort operated as Nipika Mountain Resort, open year round except for the month of April. It has been operated by Lyle and Dianne Wilson since 1979. We spent just a few hours there Sunday afternoon, Feb 21, 2010, but our experience was great, as Diane was so hospitable. Their website is at www.nipika.com . Pls take a look.\r\rBecause of the lack of snow, and that it was hardpacked, we left our snowshoes in the car and wore YakTracs on our boots. From the day use centre, we headed west around the horse corrals, made our way down to the Kootenay River to the 1 lane bridge that crosses it, and then headed east and then north along the beautiful Kootenay 3 kms to the Cross. We then made our way back up the cliff along the edge of the Xcountry trail, headed east to overlook the canyon of the Cross. There are apparently 3 waterfalls within walking distance, we saw the first.\r\rWe then headed back south and west towards the day use centre, adding a few loops to make sure we would walk at least 10 kms that sunny, fresh afternoon. The trail network is quite extensive and you could probably spend at least a couple days just snowshoeing different trails, or Xcountry skiing till you dropped.\r\rMost terrain is basically flat, the main descent and ascent being the 35 m down to or up from the river. \r\rThe attached GPS data is over both snowshoe and Xcountry trails, as we were walking on very hardpacked snow. Hopefully when you go, you can wear your snowshoes and stick to the snowshoe trails.",
    "directions": "From the flashing light where Hways 93 and 95 meet at Radium Hot Springs, drive 19.6 km east along Hway 93 through Kootenay NP to Settlers Road (or 18.3 km from the NP booth). Turn east/south onto Settlers Road and drive 14 km south to Nipika Mountain Resort. As Settlers Road starts in the NP, there is NO sign at the start of the road for the resort. 12 of the 14 km are in the park, and the first sign for the resort is where you exit the park, with only 2 km left to get to the resort.\r\rIf going for the day only, go to the day use lodge and get the lowdown from Diane.",
    "geohash": "c",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/6640/reg_Nipika7363-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6640/reg_Nipika7365-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6640/reg_Nipika7366-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6640/narrow_Nipika7369-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6640/narrow_Nipika7370-7359.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/nipika-snowshoe-near-radium-hot-springs-bc-6640",
    "stats": {
        "Activities": "ski-xc hike snowshoe",
        "From": "",
        "Seasons": "winter spring",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "11 km",
        "Town": "Radium Hot Springs, BC",
        "Type": "out-and-back"
    },
    "title": "Nipika Snowshoe",
    "trail_id": "6640"
}