{
    "description": "Park one car at Buntzen and one car at Sasamat and do the trail between the two, with a side trip to the Punta Del Este Lookout. This lookout is at the top of the first leg of the Diez Vista trail. Take the right fork at the top to get to the Punta Del Este Lookout, which looks across Buntzen Lake to Eagle Mountain. There is about a 400 m elevation gain in total.\r\rThe first part of the trail is very well maintained, both from Sasamat and Buntzen side. There is a steady uphill  until the turnoff to the Diez Vista trail, at the power lines. The trail gets much narrower and steeper here, with many switchbacks and some areas where you have to tread carefully.\r",
    "directions": "From the Buntzen side, head over the floating bridge at the south end of the lake, and follow the signs for the Diez Vista trail. When you reach the power line, take the uphill trail labelled \"Diez Vista until you reach the fork. From here you can go on the Diez Vista or up to the right which is the Punta Del Este lookout. \r\rFrom the Sasamat side, look for the trailhead above Parking lot A. The trail goes up to the powerlines. From here follow the Diez Vista trail to the Punta Del Este fork.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/6642/reg_feb2010-075-27160.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6642/reg_feb2010-078-27160.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6642/reg_feb2010-088-27160.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6642/reg_feb2010-095-27160.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6642/reg_feb2010-099-27160.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6642/reg_feb2010-104-27160.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/buntzen-lakepunta-del-estesasamat-lake-near-anmore-bc-6642",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 4,
        "Time": "6 hrs",
        "Total Distance": "8 km",
        "Town": "Anmore, BC",
        "Type": "out-and-back"
    },
    "title": "Buntzen Lake/Punta Del Este/Sasamat Lake",
    "trail_id": "6642"
}