{
    "description": "As long as you are exploring in the Debert River area you might want to explore the following fall.  It?s a small hike to a nice waterfall where you wouldn?t expect to see one.After leaving your car on the hauling road, continue heading in the same direction of the road into the area that has been logged.  There is a small patch of trees left standing in the middle of the cleared area and you should either go through it or to the right of it.  Once you?ve gone through that thicket go towards the edge of the forest/clearcut area.  As soon as you get to the forest, you will have to go down a somewhat steep section of about 3metres.  At this point you will see the stream and you should be above the fall. Follow the brook downstream to the top of the falls and go to the right to make your way to the base.UPDATE 2016;I went looking for some iron mine adits off this brook....BTW they have collapsed!   But I decided to revisit this fall.  I came from a downstream direction and ......there are two bigger falls downstream of the original one I saw !   From the original post......walk downstream another 200-300m and you will come to the next sets of falls.  NS is awesome!",
    "directions": "In Debert, take Upper Debert River Rd to A T intersection.  Turn right on East Folly Mtn Rd.  Turn left on dirt road about 650m later and head uphill to  45° 30.110'N, 63° 28.728'W.  At that point, turn left on dirt road and follow it until you cannot drive anymore.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/6649/reg_2009-09-18-073-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6649/narrow_2009-09-18-067-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/pine-brook-fall-near-truro-ns-6649",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "3 km",
        "Town": "Truro, NS",
        "Type": "out-and-back"
    },
    "title": "Pine Brook Fall",
    "trail_id": "6649"
}