{
    "description": "This is a moderate to strenuous hike along a logging road to an easy walk along the lake.  You may hike the 7.5 km return trip to the lake, or you can go further to the viewpoint at the top (it's all uphill).  The average grade is 10% with an elevation gain of 230 meters to the lake.",
    "directions": "Located west of the Stave Lake dam on Dewdney Trunk Road, across from the Municipal Land-fill.  Do not park in front of the gate.  Follow the logging road up the mountain.  At about kilometer 3.0 you will follow a marked side trail.  If you wish to continue on to the viewpoint, carry on the logging road as it curves around the summit.  The viewpoint is at an elevation of about 600 meters.  If you decide to head for the lake, you will follow a rustic trail to the shore of the lake.  This trail intertwines with an old cedar plank corduroy road.  For safety reasons, do not walk on the plank road as you may fall through it.  At the lake, there are a few open areas where you can rest or eat before making your return trip.\nAlternate Directions by brancher:\nFrom Vancouver, take Hwy 7 to 224 St. in Maple Ridge. Turn left for 3 km, then right (east) on Dewdney Trunk Rd. After 18 km cross the Stave Falls Dam. Continue on for 2.5 km and park on the north side of the road across from the landfill operation.\nOn the way back, take a diversion around the north and east side of the mountain with bird's eye views of Hoover Lake and Mt. Baker.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/665/reg_Hoover-Lake-004-13157.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/665/reg_Hoover1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/665/reg_hoover003-11387.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/665/reg_hoover019-11387.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/665/reg_hoover025-11387.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/665/reg_hoover029-11387.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/665/reg_hoover031-11387.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/665/topo_Hoover2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/665/narrow_Hoover3.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/665/narrow_hoover004-11387.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/hoover-lake-near-mission-bc-665",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "4 hrs",
        "Total Distance": "8 km",
        "Town": "Mission, BC",
        "Type": "out-and-back"
    },
    "title": "Hoover Lake",
    "trail_id": "665"
}