{
    "description": "This is a description of a trail in the Gully Lake Wilderness Area.  This only covers a small part of the wilderness area so there is much more to explore.  The end of the trail description is a set of falls of about 40ft below Gully Lake.  I did the trail with my mountain bike since I was going to follow established trail for the most part.From the main dirt road, go through the metal gate (to prevent ATVs perhaps?) and follow the wide dirt road as it heads downhill.  At the foot of the hill, you will cross Salmon river on a bridge and then the road starts to climb again.  Within 1km of the bridge, turn right on a trail.  From then on you will be mostly under tree canopy.  The trail beforehand is very wide and there is no tree cover to provide any shade on a hot summer?s day.  The trail immediately goes down hill (almost like a u-turn).  At the bottom of the hill, keep on the main track and turn left.  This is some kind of very old dirt track and for the most part is fairly level with little inclines.  You will cross a small brook or two before reaching the Gully Lake stream.  Most of the forests in these parts are mixed with some trees having fallen across the trail.  You will know that you arrived at the Gully Lake Brook because there will be a smaller trail going upstream on the left hand bank of the brook (if looking upstream).  Take this trail.  You will now be going a fairly long hill.  The forest is now composed of mature deciduous and the canopy is very high overhead.  The ground is covered by ferns.  This forest reminds me of part of the Cape Breton Highlands.  It?s an absolute delight to go through this forest.  The trail will fade in and out until at some point disappears.  At this point, head to your right down the gully to the stream.  Follow it upstream to the fall.  There is a smaller fall above the main one.",
    "directions": "Take Stevens Cross exit on Highway 104.  Turn right on highway 4 (Pictou Rd) towards Upper Kemptown.  Take Kemptown Rd towards Earltown.  Park at approximately (45° 32.342'N, 63° 6.809'W).",
    "geohash": "f85",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/6650/long_14970901-10157673136935075-757212749-o-58567.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6650/long_14971054-10157673145610075-1464230243-og-58567.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6650/long_14975789-10157673163520075-524022403-o-58567.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6650/reg_gully-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6650/narrow_14970878-10154500472775090-2045239704-o-58567.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6650/narrow_14971018-10157673161625075-445671141-o-58567.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6650/narrow_14971741-10154500473900090-839059502-oo-58567.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6650/narrow_15007696-10157673162325075-1116749587-o-58567.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6650/narrow_15034138-10154500475835090-791364116-haha-58567.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6650/narrow_15034262-10157673163425075-696919250-o-58567.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6650/narrow_2009-07-27-001-27177_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6650/narrow_2009-07-27-011-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/gully-lake-wilderness-area-near-truro-ns-6650",
    "stats": {
        "Activities": "snowshoe hike ski-xc mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "12 km",
        "Town": "Truro, NS",
        "Type": "out-and-back"
    },
    "title": "Gully Lake Wilderness Area",
    "trail_id": "6650"
}