{
    "description": "A moderately easy, but very pleasant snowshoe through open forest of larch, lodgepole and ponderosa pine, and spruce, generally along the edges of Xcountry ski trails but also along some dedicated single width snowshoe trails. Snowshoers, pls stay on extreme right or left edges of the Xcountry trails.\r\rYou will have the chance to see stellar jays, grey jays (whiskey jacks) and woodpeckers. \r\rThe Xcountry trails are operated by Kimberley Nordic Club (www.kimberleynordic.org), the whole site is part of the Kimberley Nature Park ( http://kimberleynaturepark.rockies.net/ ) and is absolutely beautiful, well groomed and maintained. There are dozens, if not hundreds of kms of trails in the park, in addition to the dozens of Xcountry kms. The longest circuit of Xcountry trails is 6.5 kms, but if you add some of the park trails to your outing, you can easily do 10-15 kms in your outing.\r\rAt \"Five Corners\", we went down Higgins Hill and then up to Myrtle Mtn. We had really wanted to go to Dippers Lake, but took the wrong trail. Regardless, A good trip to Myrtle Mtn with a great view of the area from the top.\r\rMany other trails within the park connect to the Xcountry trails and give an opportunity for lots of snowshoeing, hiking and of course, Xcountry skiing.\r\rNot to be missed when in the Kimberley area. \r\r\r\r",
    "directions": "From \"downtown\" Kimberley, follow the signs to Kimberly Ski Resort, but follow the Gerry Sorensen Way and \"Nordic Centre\" signs to the very top of the road. Pay your self pay fee ($5 / person, or $20 / family) and enjoy your day.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/6651/reg_Kimberley7442-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6651/narrow_Kimberley7434-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6651/narrow_Kimberley7436-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6651/narrow_Kimberley7441-7359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6651/narrow_Kimberley7444-7359.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/kimberley-to-myrtle-mountain-near-kimberley-bc-6651",
    "stats": {
        "Activities": "ski-xc hike snowshoe",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 4,
        "Time": "4 hrs",
        "Total Distance": "11 km",
        "Town": "Kimberley, BC",
        "Type": "out-and-back"
    },
    "title": "Kimberley, to Myrtle Mountain",
    "trail_id": "6651"
}