{
    "description": "Pipestone is a network of about 20km of XC trails in the Lake Louise area.  And it is usually one of the first areas to get XC snow in the year.  They are sporadically track-set, so if that is important to you, check at the LL Parks center (and grab a cinnamon bun at the bakery) at the main 'mall' in Lake Louise.  If skier-set trails are OK for you, there is probably enough traffic that you won't be breaking trail.  The trails are well marked so no worries there and it is generally easy to moderate hills.  The network allows good flexibility in making a day of your desired length from 2 to 22km. I've been wanting to do Pipestone for a while and a dearth of snow anywhere else in the area made this our first choice this weekend.  I'm glad I got to go out there.It was a warm day without a lot (any) fresh.  I was the only guy with wax-less skis and they were perfect, all the waxers were at the gooey end of the spectrum which made for good vacuuming up of th pipe needles with their skis.  They don't stick to wax-less though... heh heh.",
    "directions": "Drive West of Calgary, past Banff turns, and 1km PAST Lake Louise exit.  Turn right (North) up the road and into Pipestone parking area.  Trailhead is at far end of lot.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/6656/long_PipestonePlot-6828.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6656/long_XC-Skiing-Pipestone-Loop-Lake-Louise--19-Today-Feb-17-2019-900x288--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6656/long_XC-Skiing-Pipestone-Loop-Lake-Louise-Lake,-View-Hector-&-Richardson-Feb-17-2019-900x320--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6656/reg_XC-Skiing-Pipestone-Loop-Lake-Louise-View-Mt-Whyte-Feb-17-2019-900x675--44639.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/pipestone-trails-near-banff-ab-6656",
    "stats": {
        "Activities": "mtn-bike ski-xc hike snowshoe",
        "From": "",
        "Seasons": "summer fall winter",
        "Stars": 3,
        "Time": "3 hrs",
        "Total Distance": "13 km",
        "Town": "Banff, AB",
        "Type": "out-and-back"
    },
    "title": "Pipestone Trails",
    "trail_id": "6656"
}