{
    "description": "This is a good place to stop when you want to stretch your legs for a few minutes on a road trip on Highway 101 through the Annapolis Valley.  It?s a short walk to a massive waterfall of about 50ft located where you wouldn?t expect to find anything scenic.\r\rI?ve gone to these falls by going downstream where the stream goes underneath highway 101 but it is more difficult to access that way since you need to downclimb a good height which would not be suitable for children.\r\rThe better way to access these falls is to head upstream on the left bank of the stream.  The forest is dominated by evergreen and there is a small unofficial path all the way to the fall.  The whole walk is suitable for children.  You will first come to a smaller fall of about 10 feet before a sharp bend will reveal the main fall of about 50 feet or so.   I have been to look at these falls in the height of the summer and they are a bit less impressive during low flow.\r\r",
    "directions": "Take highway 101 to Exit 13, turn right on Highway 12  towards Kentville and then immediately right again on Prospect Rd.  Drive on this road for about 1.1 km until you go over a bridge.  The falls are about 400m upstream of this point.\r",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/6659/28.MooresBrookFall.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6659/reg_B75BA3C0-9DF3-4836-A1E1-DEFA0DA91236.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6659/reg_DSC-0142-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6659/reg_DSC-0145-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6659/narrow_DSC-0141-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/moores-brook-falls-near-kentville-ns-6659",
    "stats": {
        "Activities": "snowshoe hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "1 km",
        "Town": "Kentville, NS",
        "Type": "out-and-back"
    },
    "title": "Moores Brook Falls",
    "trail_id": "6659"
}