{
    "description": "Bamberton Provincial Park is a superb starting location for a trip to the see the remains of the Bamberton cement factory in Squally Reach. \r\n\r\nThe park offers 50 campsites and a 225 metre long sandy beach that is great for beachcombing, swimming, a quiet picnic or a picnic with the kids. From the parking lot, the beach is a 2 minute walk downhill along a paved wheelchair accessible trail.\r\n\r\nHeading south the shore line, a 2 kilometre paddle through clear sheltered waters brings you to the foreshore area of the now closed Bamberton cement factory. Although the skeletal remains of the buildings and dock structures are a fascinating glimpse into the economic history of this area, they are in private property, dangerous, and best viewed from a distance. Along the way are several small patches of gravel beach, some with the foundations and remains of abandoned buildings and logging equipment. On this trip, you will often see bald eagles, seals, sea lions and the occasional killer whale. \r\n\r\nFrom the Bamberton Mill, a 4 nautical mile paddle on a course of 144 magnetic brings you to McKenzie Bight and the popular beach at Mount Wark Regional Park. (UTM 10U 462698E 5377845N NAD27)\r\n\r\n There is GPS data attached to this trail (see \"download GPS\"), which if loaded into your GPS can help you find route points.",
    "directions": "Trans Canada highway from Duncan or Victoria to Bamberton Provincial Park turn off.\r\n\r\nTrailhead at parking lot(UTM 10U 461628E 5383526N NAD27)\r\n\r",
    "geohash": null,
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/666/reg_12-3-19616.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/666/reg_7-5-19616.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/666/reg_b1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/666/reg_b4.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/666/reg_b5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/666/narrow_11-3-19616.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/666/narrow_b2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/666/narrow_b3.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/bamberton-park-squally-reach-near-victoria-bc-666",
    "stats": {
        "Activities": "river-canoe sea-kayak",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "7 hrs",
        "Total Distance": "4 km",
        "Town": "Victoria, BC",
        "Type": "out-and-back"
    },
    "title": "Bamberton Park - Squally Reach",
    "trail_id": "666"
}