{
    "description": "This hike will take you to a waterfall on the Tunnel Brook but I called the hike railroad falls since you are following the track for most of the journey there.  This fall is located on a tributary of the Salmon River which flows through Truro.  If it wasn?t for the track, this fall would be quite remote but now it is more accessible for most people including children.\r\rYou start the track by following the trail on the left from the main dirt road.  This trail goes down a fairly steep hill but the trail is in great shape.  At the bottom of the hill, make your way to the railroad track.  Immediately you will cross another tributary to The Salmon River.  Follow the track for about 1.7km to another tributary.  Look upstream and if there are not a lot of leaves you should just about see this waterfall.\r\rGo down to the stream and follow it up about 100m to the base of the 35 foot tall waterfall.  There is a smaller fall at the top but it?s not worth the hassle of going up the side of the fall to see it.  The forest is composed of evergreen and deciduous trees.  There is some deadfall on the right hand side so best to avoid this side.\r\rThere is also a main set of rapids to see on the Salmon River at about the halfway point of the hike.  You will hear the rapids before you see them.  Just head into the woods when the roar is at its maximum to see them.\r\r\r\r",
    "directions": "Go to Valley Station (near Truro) and take Old Greenfield Rd.  Turn left on Greenfield Rd and then left on Union 1B road.  Follow this road Union to a point at approximately (45.398996°N, -63.116021°W) just past a quarry.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/6664/reg_DSC-0003-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6664/reg_DSC-0009-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6664/reg_DSC-0015-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/railroad-falls-near-truro-ns-6664",
    "stats": {
        "Activities": "hike snowshoe",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "4 km",
        "Town": "Truro, NS",
        "Type": "out-and-back"
    },
    "title": "Railroad Falls",
    "trail_id": "6664"
}