{
    "description": "This is a hike that is located close to Burnside Falls.  If you have driven all the way to see Burnside falls you might as well add another hour and hike to these smaller falls located close by.\r\rFollow the path to its conclusion and then head to the right in case you want to see Burnside falls from the other side of the river.  If you only want to see the two other falls, I suggest you follow the track I will post and take the path that goes across a cleared field on the left side of the trail before you reach the end of the trail.  Make your way across this field and then back into the forest.  Once in the forest head downhill to the stream and then walk downstream to see two falls.  One is about 10 feet while the other is about 15 feet.\r\rThe forest in this part of the hike is easy to navigate and walk through as it is composed of large mature trees,  If you decide to walk upstream along the brook (like I did) to get to the falls, you will face a whole lot of deadfall and a not very pleasant bushwalk to the falls.\r\r\r",
    "directions": "From Highway 289, turn on Pembroke Rd and follow it up to approximately 45.307616°N, -62.979899°W.  Turn right on that dirt road and cross the Pembroke River.  Head down the secondary path on your right off the main road at approximately 45.309582°N, -62.972032°W.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/6665/reg_DSC-0027-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6665/reg_DSC-0029-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/pembroke-tributary-fall-near-new-glasgow-ns-6665",
    "stats": {
        "Activities": "hike snowshoe",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "4 km",
        "Town": "New Glasgow, NS",
        "Type": "out-and-back"
    },
    "title": "Pembroke Tributary Fall",
    "trail_id": "6665"
}