{
    "description": "The Comox Glacier, 1960 m, towers over the Comox Valley and causes everyone in the valley to put it on their to do lists.  This hike can be done over the course of three days or two days or one long day as done here.  I personally found this to be one of the harder hikes that I have done due to the constant elevation gain and loss before you get up to the Glacier.  There are some ropes to help in the stepper sections, if you do suffer from a fear of heights these sections will make it difficult for you as they are fairly exposed and steep.  Once on the glacier the actual summit is on the other side of the glacier so you will have to walk across the glacier.  This does not require a rope, crampons or ice axe but care needs to be taken when jumping over the crevasses.  Now when we did this hike we were fueled on McDonald egg McMuffins which powered us up to the first rock cairn in just under 5 hours.  It takes about 1 hour to walk to the other summit.  The true summit should not be missed.  The views into Strathcona are absolutely fantastic and you can easily sit on the summit for most of the day.  Roughly with breaks about 12 hours round trip.  Keep in mind the back side of the glacier is very interesting and you can spend a lot of time wandering around looking at the neat rock and water ponds.  Total kilometers was about 16.     From the parking area the trail heads down along a creek.  Cross the creek over a fallen tree and keep going until you see a sign pointing you left.  From here on you will steadily gain elevation until you get to the top which will take about 2 hours.  This is the Frog Ponds area and most parties doing it over two or three days camp here.  From here you can see the trail in the distance as it slowly makes it way higher and higher up the side of the glacier.  Keep following this trail as it losses and gains elevation with the last gain at Lone Tree Pass.  From here to the first summit won?t take you very long as you will be energized with adrenaline.  From this summit cairn you can see the true summit way off on the other side of the glacier.  Make your way in that direction watching out for crevasses along the way.  Once at the true summit sign into the registry and enjoy the view.  For you route back either retrace your steps or make your way along the backside of the glacier.  This section has great rocks formations and beautiful waterfalls, streams and ponds.  One of my favourite hikes on the Island.",
    "directions": "Directions to the trailhead are as follows. From Courtenay, take Lake Trail road to the Comox Lake Dam. Follow Comox Lake Main, when you go across the Cruikshank River (a very long high bridge) make a right onto Cruikshank main. You are then going to drive for a bit and when you come to South Fork Main make a left.  Follow this for about 8 kms and make a right.  There is a sign here but it is hard to see.  Keep following this road for the next 5 kms until you see the trail head.  You can?t miss it with its big spray painted sign.  The last few kilometers have some good cross ditches and will stop most cars.  You can park here and then walk the last few klicks.  All 4x4s and high clearance 2 wheel drives will not have any problems.  Now this can change depending on what mother nature does to the road.",
    "geohash": "c0yc",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/6666/reg_P8070019-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6666/reg_P8070031-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6666/reg_P8070032-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6666/reg_P8070036-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6666/reg_P8070059-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6666/reg_P8070083-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6666/reg_P8070086-Large--4612_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6666/reg_P8070090-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6666/reg_P8070093-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6666/reg_P8070095-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6666/reg_P8070101-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6666/reg_P8070108-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6666/reg_P8070138-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6666/narrow_P8070043-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6666/narrow_P8070072-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6666/narrow_P8070097-Large--4612.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/comox-glacier-near-courtenay-bc-6666",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 5,
        "Time": "12 hrs",
        "Total Distance": "16 km",
        "Town": "Courtenay, BC",
        "Type": "out-and-back"
    },
    "title": "Comox Glacier",
    "trail_id": "6666"
}