{
    "description": "This is a fantastic scramble up the West Ridge of Mt. Arrowsmith and then a rappel down the nose.  Unfortunately my camera broke on this trip and I don't have any pictures of the trip.\r\rFrom the trail head you will start heading down a step ravine.  Once you jump across the creek in about 15 minutes, there is a waterfall in the creek beside you make a right and head up hill.  There is no trail at this point and you will be bushwhacking a bit until you reach the rock.  Here you begin your scramble up the west ridge.  Keep making your way up, at times you will come to a plateau area, take a break and enjoy the view.  At one section there will be a significant rock wall in front of you.  Veer right at this point and make your way up the snow gulley.  From here you will be on another plateau.  Head straight up the rock wall.  At the top here you will be able to see the radio repeaters of Mt. Arrowsmith, head down here and veer leftish.  After a little while you will begin to make your way up to the top.  When you reach the first repeater leave your packs here and head for the second repeater which is the true summit.  Sign the registry and go back to the packs for lunch.  After lunch head eastish and you will be heading down the nose.  When you reach the first set of rappel loops, go ahead and rappel.  Once you are on less vertical ground, make your way to the second set of rappel loops.  Rappel down and then make your way down some more.  When you come to a notch, head down it towards Port Alberni, don?t head up.  Follow the downward slope fairly close to the rock.  Eventually you will come to the woods again.  Pick up the trail and don?t cross the stream.  This trail will take you all the way back your vehicles.\r",
    "directions": "Follow highway 4 out to Port Alberni, at the top of the bump before Port Alberni (as you start heading down), get into the left turning lane and make a left here (after 100 meters you will see a parkingdump area on your right, this means you are on the right road). In about 30 minutes you will be at the trail head, watch for logging trucks. Drive about 3 km and then turn left on Cameron River Main. Drive about 8 km to the Pass Main, turn left. You will drive about 5km up the mountain, at the last switch back park on the side of the road. Remember on the way back, you will come to a fork in the road, you want to make a right here. The road conditions can be quite rough.",
    "geohash": "c0z2h",
    "photos": [],
    "source_url": "https://trailpeak.com/trails/west-ridge-near-port-alberni-bc-6667",
    "stats": {
        "Activities": "hike climb",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 5,
        "Time": "7 hrs",
        "Total Distance": "8 km",
        "Town": "Port Alberni, BC",
        "Type": "out-and-back"
    },
    "title": "West Ridge",
    "trail_id": "6667"
}