{
    "description": "Mt. Wesley (908 m) is the peak right across Cameron Lake that everyone has seen on their way to Cathedral Grove Provincial park.  I would not recommend summiting this peak.  Your time is much better spent summiting nearby Mt. Horne.  This peak has some serious bushwacking and route finding.  Also there is no actual view from the summit but your lunch can be enjoyed just below the summit a rocky bluff overlooking Cameron Lake.  This a short but very steep trail.  Round trip time is about 4 hours.\r\r     Park on the North side of Cathedral Grove Provincial Park. Take the trail on the left of the out houses and in minute look for a trail on your left. It is just past the root note sign on the right. If you go past a fallen log on the trail that has been chained sawed, you have gone too far. This trail will take you to a gravel road, once at the gravel road, make a right. After about 5 minutes you will see some cabins on the lake. At the 2nd cabin you will see some flagging tape on your left, follow this trail. This short but steep trail will get you warmed up for the real work about to come. At the end of this trail you will come to the old railroad tracks, make a right and follow the tracks. Just past a rock fall on the tracks you will see a trail on the left with a rope to help you up. Follow this trail. Keep following this steep trail until you get to the saddle between Mt. Horne and Mt. Wesley.  From here you will be making a right and heading into the very thick raspberry bushes, push your way through and head left into the clear cut.  When you come to the high point, you will see an old broken tree in the distance in the clear cut.  Head towards this tree and then head leftish through some more thick bushwhack.  In about 5 minutes you will come out to a logging road.  Make a right on the road and look for some flagging on your left in a little ways.  From this point you are about an hour from the top, follow the sparse flagging to the top.  You will know you are at the top when you see the few planks of wood marking the top.  For a nice view head back down to the bluff overlooking Cameron Lake.\r",
    "directions": "Cathedral Grove Provincial Park is located between Qualicum Beach and Port Alberni on Hwy #4, which runs right through the park. From Hwy #19 and Hwy #19a take the exit to head west on Hwy #4 toward Port Alberni. Then park on the north side of the park, on the right if you are coming from Qualicum Beach.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/6668/reg_P7190139-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6668/reg_P7190140-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6668/reg_P7190141-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6668/reg_P7190142-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6668/reg_P7190143-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6668/reg_P7190145-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6668/reg_P7190146-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6668/reg_P7190147-Large--4612.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mt-wesley-near-port-alberni-bc-6668",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 2,
        "Time": "4 hrs",
        "Total Distance": "8 km",
        "Town": "Port Alberni, BC",
        "Type": "out-and-back"
    },
    "title": "Mt. Wesley",
    "trail_id": "6668"
}