{
    "description": "Mirren Lake in Strathcona Provincial park is great day trip.  The hike features stunning cliffs, beautiful waterfalls running off this cliffs, interesting terrain and a nice swim on a hot day.  The trail begins with a step grind and then lessens as you begin your hike along the Kweishun Creek.  You cross the creek a couple of times and in one section is quite steep as you climb beside?s a waterfall and in another section a rope has been provided to help you up.  The trail is well marked and flagged and even if you lose the trail you can?t get lost.  On both sides of you is towering cliffs so the only way to go is forward.    Total distance is about 15 kms and takes about 6 hours return.  The GPS directions start at the bridge over the Cruikshank River.\r\r     From the trailhead make your way up the steep flagged path.  Continue on this path for the next half hour.  You will come out to an opening by a pond with beautiful views of the high cliffs.  Head to the right around the pond, once through some brush you will basically be following the Kweishun Creek.  You will hop this creek a few times, just find a good spot to do it.  When you get to the waterfall stay to the left of it.  This is step precarious so watch your footing here.  As you make your way up, you will notice on your left a dryish stream bed that has created steps, take advantage of these steps to help you up.  In about a half hour you will come up to a huge icefeild (global warming permitting), hop the creek and make your way up the steppish terrain.  You will shortly come across a rock with a climbing rope attached to it, use it if you need it.  Keep making your way along the valley floor.  You will then come to a section with a lot of stone debris.  Here you want to go as far to the left as possible and keep making your way.  This will get you to a small lake.  Take a rest and then make your way over to Mirren which is just over the next hump.  Once at Mirren enjoy your lunch and have a good swim.\r",
    "directions": "Directions to the trailhead are as follows. From Courtenay, take Lake Trail road to the Comox Lake Dam. Follow Comox Lake Main, when you go across the Cruikshank River (a very long high bridge) make a right onto Cruikshank main. You are then going to drive for a bit and when you come to South Fork Main make a right.  Keep going for a bit and you are going to make a left at West Fork.  From here on the directions not so good in that there is active logging going on so stuff is always changing.  Basically when in doubt make a right.  When you hit the dead end park and the trail head starts just behind you.",
    "geohash": "c0y",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/6669/reg_P7260157-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6669/reg_P7260159-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6669/reg_P7260162-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6669/reg_P7260164-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6669/reg_P7260168-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6669/reg_P7260185-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6669/reg_P7260188-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6669/reg_P7260193-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6669/reg_P7260194-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6669/reg_P7260201-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6669/reg_P7260206-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6669/reg_P7260214-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6669/reg_P7260218-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6669/reg_P7260219-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6669/narrow_P7260160-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6669/narrow_P7260187-Large--4612.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mirren-lake-near-courtenay-bc-6669",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 5,
        "Time": "6 hrs",
        "Total Distance": "15 km",
        "Town": "Courtenay, BC",
        "Type": "out-and-back"
    },
    "title": "Mirren Lake",
    "trail_id": "6669"
}