{
    "description": "The Red Pillar (2031 m) is the 11th highest peak on Vancouver Island and probably the largest summit of any peak on the island.  The summit is massive and you can easily share it with lots of people and still have it all to yourself.  I would say the views are awesome but the day I was up was a low cloud day and we could barely see the other side of the summit.  This route takes you up from Oshinow Lake (by canoe if you have it) and up the West Ridge.  I highly recommend taking a canoe, not only does it give you legs a rest on the way there and back, its fast (30 minutes), but rumor has it that the path around the lake has some serious blow downs which will zap your energy and add time.  Although the West Ridge is rated low 5th class, there is very little exposure and the rock is solid with lots of good grip, I would lower the rating to a 4th class route.  A rope is not needed but crampons and an ice axe are for navigating the snow to the West Ridge, even though you will only be using the items for less than 30 minutes, you still need them.  Although the route can be done as a very long day trip, I would recommend doing this as two day adventure.  Tent sites are not 1st class but some decent ones can be found along with water in the small tarns.  Going down to Esther Lake is not a good option, the route is very steep down to the lake and having to lose and gain the elevation again is not worth while, stay on the ridge.  The route itself is it good shape with plenty of flagging and a worn path.  Total distance is 15 Kms.  The GPS route starts in Port Alberni.\r\r      From the trail head either put your canoe in here or pick up the trail and head around the lake.  In the canoe make your way all the way down the lake and when you get to a grassy area on the right, take out your canoe.  The trail is about 5 meters away in the bush.  Make your way along the trail and past some of the deadfalls.  After a little while you will get to a sign putting you in the direction of the Red Pillar.  Follow this direction.  From here on the your legs will start screaming.  The elevation gain for the next three hours is serious, with very few switch backs and is quite tiring, especially with a full pack.  In some sections you will have to do a bit of route finding as the flagging has been lost.  Near the top the elevation gain will ease up and you will be out in the open.  Once you reach the ridge you still have a while to go.  If you want you can setup camp in this area, but I recommend going further.  Basically just keep following the ridge.  Once you have been for quite a while, the place where you want to setup camp is in the area just before you go down and start climbing on the Red Pillar.  This area has the most flat ground that you have probably seen so far and there should be numerous little tarns for water.\r\r     The next day, begin by heading down and to the left of the Red Pillar.  You will then start to gain elevation as you make your way around the Red Pillar.  Once you get to the Cliffe Glacier and can see Argus Mountain and Mt. Harmston, the start of the West Ridge is just around the corner.  If the conditions are anything like it was when I was there, the snow is going to be like concrete.  I only brought half crampons expecting soft conditions but was wishing for my full crampons, so bring the big ones.  Once you have your crampons and ice axe ready, make your way around the crevasses.  Once you get to the rock, the trail goes off to the right and then up.  From here on use your route finding skills and make your way to the summit.  It will be off to you left when you get up there.  Hopefully your view is a little better than mine and you can really enjoy yourself.\r",
    "directions": "Starting from the Port Alberni Info Center to \"Oshinow\" Deep Lake Trail Head (1.5/2hrs - approx. 40kms)  Drive down Johnson st hill to River rd turn right and cross over a small bridge, veer right again just before the Petro-Can now drive north west for 18 kms to the far end of Beaver creek rd.  Follow through the right turn onto Sommers rd and stay on it for 2 kms then take a left onto a main logging rd.  Stay on this main line for 9kms and follow the road left crossing Lanterman creek.  Drive for another 5 kms down staying left the whole time on branch 105 until you come to a T intersection, turn right here. Now stay on the Ash River Main Line first passing Turnbull Lake on the left then Elsie Lake on the right, after that you'll cross over the upper Ash river.  Stay on the Ash River main line for another 8.5km before it turns right.  If you cross over the Ash River again heading up the Gretchen main line you've gone too far, so turn around and take the first left.  Here the road narrows and bushes in a bit, approx.4km turn right onto branch 110 from here the road get rocky with steep sections.  This would not be recommended for low clearance 2 wheel drive vehicles, 4x4 is preferred.  2km further up take a sharp left onto branch 110H there might still be a small sign nailed to a tree saying \"",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/6670/reg_P8210001-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6670/reg_P8210012-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6670/reg_P8210013-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6670/reg_P8220021-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6670/reg_P8220024-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6670/reg_P8220027-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6670/reg_P8220033-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6670/reg_P8220035-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6670/reg_P8220107-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6670/reg_P8220115-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6670/reg_P8220116-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6670/reg_P8220120-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6670/reg_P8220122-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6670/reg_P8220124-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6670/reg_P8230130-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6670/reg_P8230132-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6670/reg_P8230134-Large--4612.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/the-red-pillar-near-port-alberni-bc-6670",
    "stats": {
        "Activities": "hike climb",
        "From": "",
        "Seasons": "summer spring",
        "Stars": 4,
        "Time": "14 hrs",
        "Total Distance": "15 km",
        "Town": "Port Alberni, BC",
        "Type": "out-and-back"
    },
    "title": "The Red Pillar",
    "trail_id": "6670"
}