{
    "description": "Argus Mountain and Mt. Harmston (both 1980 m) are the 16th and 17th highest peaks on the island.  The route described here begins from Oshinow Lake and makes its up way up to the base of the Red Pillar.  From here you go down and across the Cliffe Glacier to climb Mt. Harmston from the South-East Ridge and then Argus Mountain from the South West Ridge.  The Mt. Harmston ascent is very easy and requires nothing.  For Argus Mountain the ascent can be a little airy in a few places and some parties may like to have a rope.  All in all it is a straight forward climb.  Climbing of either or both peaks will require an overnight stay.  The best place for that is right at the base of the Red Pillar where there is some level ground and water. As for equipment crampons, ice axe and helmet will be needed.  The glacier in the morning will be rock hard and don?t even think of attempting this without the spikes.  As for roping up on the glacier, you will decide based on the current conditions.  When I did it, we didn?t need to.  From this camping area you are looking at an 8-10 hour and about 20 kms.  The GPS route starts in Port Alberni.\r\r     From the trail head either put your canoe in here or pick up the trail and head around the lake.  In the canoe make your way all the way down the lake and when you get to a grassy area on the right, take out your canoe.  The trail is about 5 meters away in the bush.  Make your way along the trail and past some of the deadfalls.  After a little while you will get to a sign putting you in the direction of the Red Pillar.  Follow this direction.  From here on the your legs will start screaming.  The elevation gain for the next three hours is serious, with very few switch backs and is quite tiring, especially with a full pack.  In some sections you will have to do a bit of route finding as the flagging has been lost.  Near the top the elevation gain will ease up and you will be out in the open.  Once you reach the ridge you still have a while to go.  If you want you can setup camp in this area, but I recommend going further.  Basically just keep following the ridge.  Once you have been for quite a while, the place where you want to setup camp is in the area just before you go down and start climbing on the Red Pillar.  This area has the most flat ground that you have probably seen so far and there should be numerous little tarns for water.\r\r     The next day, begin by heading down and to the left of the Red Pillar.  You will then start to gain elevation as you make your way around the Red Pillar.  Once you get to the Cliffe Glacier and you can see Argus Mountain and Mt. Harmston in the distance.  Put on your crampons and start making your way to down the glacier to the base of the Ridge of Argus Mountain.  Then make your way around this and head towards the col between Mt. Harmston  and Argus Mountain.  Once you get to this make your way up the South East ridge of Harmston.  The route here is easy and straight forward.  The biggest worry here is the loose rocks that you could slip on or dislodge onto someone.  Once you are done signing into the registry and looking around.  Make your way down the same way that you came up.  Once you are back on the glacier, make your way across it to the one of the snow fieldsglaciers coming down the Argus Mt. ridge.  From here make your way up the South West Ridge to the summit.  When you get near the top the route more to the left has a bit more exposure and loose rocks.  If you don?t like this just make your way more to the right and you can find a less exposed route.  Or just rope up if that makes you feel better.  Once you are down on the summit make your way down the same way but drop onto the Red Pillar side of the Cliffe Glacier.  From here make your way across the glacier and back to you camp.  Hope you enjoyed yourself!\r",
    "directions": "Starting from the Port Alberni Info Center to \"Oshinow\" Deep Lake Trail Head (1.5/2hrs - approx. 40kms)  Drive down Johnson st hill to River rd turn right and cross over a small bridge, veer right again just before the Petro-Can now drive north west for 18 kms to the far end of Beaver creek rd.  Follow through the right turn onto Sommers rd and stay on it for 2 kms then take a left onto a main logging rd.  Stay on this main line for 9kms and follow the road left crossing Lanterman creek.  Drive for another 5 kms down staying left the whole time on branch 105 until you come to a T intersection, turn right here. Now stay on the Ash River Main Line first passing Turnbull Lake on the left then Elsie Lake on the right, after that you'll cross over the upper Ash river.  Stay on the Ash River main line for another 8.5km before it turns right.  If you cross over the Ash River again heading up the Gretchen main line you've gone too far, so turn around and take the first left.  Here the road narrows and bushes in a bit, approx.4km turn right onto branch 110 from here the road get rocky with steep sections.  This would not be recommended for low clearance 2 wheel drive vehicles, 4x4 is preferred.  2km further up take a sharp left onto branch 110H there might still be a small sign nailed to a tree saying \"",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/6671/reg_P8210001-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6671/reg_P8210012-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6671/reg_P8210013-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6671/reg_P8220021-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6671/reg_P8220024-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6671/reg_P8220026-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6671/reg_P8220031-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6671/reg_P8220032-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6671/reg_P8220037-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6671/reg_P8220039-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6671/reg_P8220042-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6671/reg_P8220057-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6671/reg_P8220060-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6671/reg_P8220062-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6671/reg_P8220085-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6671/reg_P8220099-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6671/reg_P8230134-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6671/narrow_P8220065-Large--4612.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mt-harmstonargus-mtn-near-port-alberni-bc-6671",
    "stats": {
        "Activities": "hike climb",
        "From": "",
        "Seasons": "summer spring",
        "Stars": 4,
        "Time": "14 hrs",
        "Total Distance": "15 km",
        "Town": "Port Alberni, BC",
        "Type": "out-and-back"
    },
    "title": "Mt. Harmston\\Argus Mtn.",
    "trail_id": "6671"
}