{
    "description": "This is a description of a small hike that takes you to a magnificent 50 foot waterfall.    The area at the base of the waterfall looks deep enough to swim.UPDATE 2019.Seems like my directions below are out of date as there is now a no trespassing sign on the dirt road I initially took to the fall.   These days people access this fall via a dirt road located at N45 10 13.8 W63 03 27.0,  while the fall is located at; N45 09 40.5 W63 03 09.3.  It seems you just hike up that road until the fall which should be on your left across the brook.OLD POST BELOW; DO NOT FOLLOWFrom the main highway you turn on a dirt road at 45° 10.331'N, 63° 2.945'W.  The road goes up a steady moderate hill and begins to level off where another road meets it on your right.  Take the dirt road on the right.  The road will be flat at first before descending a small hill.  At the bottom of the hill the main road continues to the left and so should you.  The road will come quite close to the stream from time to time and after less than 2km from the starting point you will reach the falls.  The forest around the fall is composed mostly of evergreen with some of them quite mature.At the end of the dirt road just before the falls, you will need to cross the stream.  There are some rocks to step on to cross or you can easily jump over since the stream is about 6 feet wide at that location.  The falls are impressive and there is a small cabin tucked away in the forest close by.",
    "directions": "From Brookfield, tahe highway 289 towars Upper Stewicake.  Turn right on Cloverdale Rd and then left on South Branch Rd.  In South Branch, continue straight on Meadowvale Rd until just before you cross Findlay Brook (N45 10 13.8 W63 03 27.0).",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/6677/long_20170504-135154-31077.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6677/reg_DSC-0083-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6677/narrow_DSC-0085-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/findlay-falls-trail-near-stewiacke-ns-6677",
    "stats": {
        "Activities": "snowshoe hike mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "4 km",
        "Town": "Stewiacke, NS",
        "Type": "out-and-back"
    },
    "title": "Findlay Falls Trail",
    "trail_id": "6677"
}