{
    "description": "This is a description of a hike through the woods of Stewart Hill (hills between the Stewiacke and Musquodoboit rivers).  The end of the hike is in, for a lack of a better word, canyon with a 50 foot waterfall at its head.\r\rFrom the starting point look to the horizon and you can see a slight dip in the hills in the distance.  This dip was carved by the stream you will follow to the fall located upstream.  Set off down the hill and to the left on some kind of ATV trail.  The trail traverses a grassy area before going down a hill and into the forest.  At the base of the hill you will cross two intermittent streams.  Then continue on the trail and passed a hunting blind on your right.  Not long afterward, make your way to the right through some small deciduous trees and up the large hill covered by evergreen trees.  Walk sideways on the hill through the evergreen forest until you hit the ravine created by the brook.\r\rThe forest around and in the ravine is quite scenic.  You will see some massive beech trees? some of the biggest I have seen in NS.  Walking upstream in the ravine by the brook is very easy because the forest is mature and trees are widely spaced apart.  At the end of the ravine, the slope on either side become more like rock cliffs and form a kind of canyon.  Unfortunately the nice waterfall at the head of the canyon is completely obstructed by deadfall.  Maybe it will get displaced with some heavy rains.\r\rBy the way the rock walls wouldn't be good for rock climbing as they are composed of slate like material.",
    "directions": "From Upper Stewiacke, take Brookfield Dean Rd and turn right on Stewart Hill Rd towards Upper Musquodoboit.  Park by the tall antenna on the left after going up a hill.\r",
    "geohash": "f851",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/6678/narrow_DSC-0075-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6678/narrow_DSC-0081-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/black-brook-canyon-fall-near-stewiacke-ns-6678",
    "stats": {
        "Activities": "hike snowshoe",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "4 km",
        "Town": "Stewiacke, NS",
        "Type": "out-and-back"
    },
    "title": "Black Brook Canyon Fall",
    "trail_id": "6678"
}