{
    "description": "This is a hike that starts just off a logging road in the middle of nowhere but the logging road is also part of the vast network of snowmobile/ATV trail system of NS which may be good to explore by mountain bike.  The turning point of the hike is a waterfall of about 20 feet.\r\r\rHead into the woods in a due south direction.  The first part of the hike will be through somewhat dense trees since this are was logged some time ago.  However if you tend to veer to the right you will enter part of the forest which hasn?t been logged in a long time and the walking will be easier.  After about 600m from the main road you will come to the top of the ravine where Sucker Brook flows.  The ravine was very steep at the location where I came down but there are other places to go down that might be easier. This part of the brook does not have a waterfall but it is still quite scenic and worth the trip.  \r\rOnce you have reached the brook, head upstream.  The ravine is wide enough to be able to walk along the brook with ease.  There are a few spots where you will cross the brook but it?s easy since it?s only about 4-5 feet wide.  After a while you will reach the fall and then you can either come back to your car by retracing your steps or by basically heading due north from the falls.  My GPS track shows that I returned to my car by heading north from the waterfall and crossing a logged area back to the main road.  By going this way you will save some time.  The logged area is fine to cross as long as you can deal with a lot of thorny brush.\r\r\r",
    "directions": "Take highway 289 passed Upper Stewiacke and turn right on dirt road at  45° 19.515'N, 62° 53.428'W. This is about 1km passed a bridge over the Stewiacke River.  Drive uphill to second dirt road (500m from highway 289) on your right and turn on it.  Park where the main road turn at a 90 degree angle (45° 18.577'N, 62° 52.466'W).  Head into the woods on a south heading.\r",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/6679/reg_DSC-0064-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6679/narrow_DSC-0067-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/sucker-brook-fall-near-new-glasgow-ns-6679",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "4 km",
        "Town": "New Glasgow, NS",
        "Type": "out-and-back"
    },
    "title": "Sucker Brook Fall",
    "trail_id": "6679"
}