{
    "description": "This is a spot to go out and seek if you are already in the area to see some other falls (Sucker Brook, Fall Brook, Black Brook Canyon Fall, Butcher Hill, Findlay).  The hike is short and will take you along two different cascades on a branch of the Stewiacke River.  \r\rFrom your car you enter a dense evergreen forest and there are a lot of animal path though them to make the walking easier.  Make your way to the brook and then follow it downstream to the sets of cascades.  The forest around the brook isn?t spectacular or anything but I was surprised to see so many animal paths.  \r\rFollowing the brook is a breeze since most of the brook is not located in a ravine so you have lots of space to walk along.  I crossed the stream a few time but realistically you don?t need to.  Stick to the right bank of the stream (looking downstream) and you will be fine.  You could also reach this area by walking upstream this tributary of the Stewiacke River since it flows into the Stewiacke River in an area where the highway is only about 200m distant.  This was my first plan but the Stewiacke River was still running fairly high, it was winter and I forgot my waders to get across.\r\r\r",
    "directions": "From Highway 289 past Upper Stewiacke, turn left on a dirt road located at 45° 18.012'N , 62° 53.045'W (also called Burnside bypass).  Continue on main road until you turn right on a secondary road at  45° 19.852'N, 62° 55.142'W.  Drive 500m and turn left on dirt road.  I left my car about 300m down this road and headed into the woods in a north direction.  You can see a faint road in the woods in Google earth which is a good way to return to your vehicle after seeing the cascades on this brook.\r",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/6680/reg_DSC-0070-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6680/reg_DSC-0072-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6680/narrow_DSC-0073-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/upper-stewiacke-river-cascades-near-new-glasgow-ns-6680",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 2,
        "Time": "1 hrs",
        "Total Distance": "4 km",
        "Town": "New Glasgow, NS",
        "Type": "out-and-back"
    },
    "title": "Upper Stewiacke River Cascades",
    "trail_id": "6680"
}