{
    "description": "\"One of Newfoundland's best kept secrets\" is how many people describe the spectacular and awe inspiring trails that the King's Point and Rattling Brook Economic Improvement Committee first opened in 1991. We recommend the spectacular vista of South West Arm from the Hay Pook; it's a view you won't soon forget! But don't just take our word for it - Sir Alexander Murray, head of the Newfoundland Geologic Survey, recommended it over a century ago.The Alexander Murray Hiking Trail is the signature hiking trail in the Green Bay area and a significant tourist attraction in its own right. It is simply the most amazingly constructed trail I have ever seen. The West Coast Trail involved a lot of construction but this trail in this small community puts it into another category altogether. For starters this is a hiking trail with a welcome centre, where they proudly state that there are 2200 stairs on the trail. That?s up AND down, not all up.The trail starts behind the visitor centre, where there is a small booth with information and a voluntary log book. In 2009, over 900 hikers signed this log book. A solid bridge over the brook takes you into mixed forest then the ?moose barrens? where there are well signed areas of significance. At 2km the stairs begin. They are well constructed and a comfortable height. Take your time, take pictures (rest stop, that is). Near the top of the ridgeline that the trail follows, there is a side trip down into Corner Brook Gorge and waterfall. This should be done, even if there are a few more stairs, it?s worth it. Back on the main trail keep your eyes open on your left for remnants of the old ladder-style trail system, in place before the stairs. You?ll appreciate the stairs after seeing that.Eventually the stairs give way to rock and rubble and soon ? the summit. The viewing platform provides good views of the Green Bay area and the Gaff Topsails. After a snack and well deserved rest, start the downward stairway. Along the way there are several waterfalls and a campsite with 2 well constructed tent platforms. The trail continues to loop around through boggy areas (boardwalks) to the 2km point where will meet the main trail.At the trail?s end you might want to make a donation to the trail maintenance fund. Upkeep on this trail could be quite costly, I would think.The good folks of King?s Point and area are rightfully proud of their achievement. If you?re in the area you owe it to yourself to check it out.",
    "directions": "Trail Head is located on the left hand side shortly after entering the Town of King's Point.",
    "geohash": "fbb4",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NL/6684/reg_Alexander20-4--0.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6684/reg_IMG-0806-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6684/reg_IMG-0809-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6684/reg_IMG-0824-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6684/reg_IMG-0868-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6684/reg_IMG-0878-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6684/reg_IMG-0887-6702_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6684/reg_IMG-0891-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6684/reg_am1-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6684/reg_am2-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6684/reg_am7-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6684/narrow_-MG-0861-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6684/narrow_IMG-0837-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6684/narrow_IMG-0851-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6684/narrow_IMG-0864-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6684/narrow_IMG-0866-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6684/narrow_IMG-0870-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6684/narrow_IMG-0907-6702.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/alexander-murray-hiking-trail-near-kings-point-nf-6684",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 5,
        "Time": "3 hrs",
        "Total Distance": "9 km",
        "Town": "King's Point, NF",
        "Type": "out-and-back"
    },
    "title": "Alexander Murray Hiking Trail",
    "trail_id": "6684"
}