{
    "description": "This hike explores the Second Brook which flows into River Philip near Collingwood.  The start of the hike is at an old fish hatchery facility and will take you 6km upstream of that point to a fall called Great Falls.  The Great Falls are pretty impressive but I am not sure I would called them great as they are some easier ones to see in NS that are greater.  \nYou start on the logging road in the woods and after a little while the road will come closer to the river and continue in this matter for a while.  The road might be passable by car but I am unsure as there was lots of snow on the ground when I did the hike.  After approximately 2.8km the road will begin to ascend a large hill.  At this point you will hear the roar of water.  Head into the woods to look at a series of about 5 falls.  I think they could be impressive but they were covered by snow when I was there.  However the combination of deep snow and rushing water created there kinds of tunnels which were pretty cool to look at.\nAfter you have climbed by the falls, you will enter a flat area of the river which is dominated by alders.  I headed to the right (looking upstream) and into the forest to bypass the alders.  The forest is composed of mature deciduous trees and it?s a pleasure to walk though it.  Lots of moose tracks too!  This would probably be a good place to tap some trees for maple syrup collection.  At some point you will cross an ATV road which has a bridge over the river.  I headed on the opposite bank at that point to continue making my way upstream.  Again there are some nice stretches of forest in that area that are dominated my mature maple and beech trees.  \nFinally you will reach the Great Falls which strangely enough are very remote but at the same time not so much since there is a cabin built right in front of them.  From the cabin I headed onto the ATV path to join some kind of logging road and then back to the bridge over the river (from the last paragraph).  I think you could use this road instead to see the falls by mountain bike or maybe even a car?but you would miss the incredible forests sights on the way there.\n\t",
    "directions": "Take the Trans Canada highway towards Amherst from Truro and take exit 8.  Turn right off the ramp towards Westchester or Collingwood Corner.  Drive on the Wentworth Collingwood Rd to the second river (45.590858, -63.832541).  Park by the old fish hatchery and head upstream",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/6689/reg_DSC-0119-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6689/reg_DSC-0121-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6689/reg_DSC-0123-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6689/reg_DSC-0129-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6689/reg_DSC-0133-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6689/narrow_DSC-0125-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6689/narrow_DSC-0130-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/second-river-falls-near-springhill-ns-6689",
    "stats": {
        "Activities": "snowshoe hike ski-bc mtn-bike",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "13 km",
        "Town": "Springhill, NS",
        "Type": "out-and-back"
    },
    "title": "Second River Falls",
    "trail_id": "6689"
}