{
    "description": "Endless twisty singletrack, loose volcanic pumice trails, lots of switchbacks, after the first 40+mins of descent climb on old logging roads to an awesome viewpoint then descend more flowy intermedaitely technical singletrack until you emerge at Mowsons bond through a burnt trail (from the 2009 fire).\nDifficult to navigate without a guide but hopefully the GPS data will help.\nIt's very remote there so play carefully as its a long way to first aid or medical attention (100km on rough roads). Plus there are lots of bears in this area which is truly a remote backcountry location. (Of course this just makes the riding sweeter)",
    "directions": "Take Road 40 from Lillooet towards Gold Bridge or take the Hurley FSR \n(4WD) from Pemberton to Gold Bridge. Follow Road 40 along Carpenter \nLake and turn off at the Tyax Resort signs onto Tyaughton Lake Road.\nContinue up to Tyax Wilderness Resort (www.tyax.com) a great place to stay before and after your ride. They also have some shuttles to the \ntrailhead from here.\nPass the entrance to the resort (at 8km) continue until you reach a deactivated logging road on the left before you reach/cross Cinnabar Creek. \nIf you have a 4WD you can drive from here otherwise start riding to the end of the road and see the trail head on the right through the cutblock.",
    "geohash": "c309",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/6698/reg_2009-09-07-2790-10746.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6698/reg_2009-09-07-2794-10746.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6698/reg_2009-09-07-2797-10746.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/north-cinnabar-to-mowsons-pond-near-lillooet-bc-6698",
    "stats": {
        "Activities": "mtn-bike",
        "From": "",
        "Seasons": "summer",
        "Stars": 5,
        "Time": "3 hrs",
        "Total Distance": "22 km",
        "Town": "Lillooet, BC",
        "Type": "out-and-back"
    },
    "title": "North Cinnabar to Mowsons Pond",
    "trail_id": "6698"
}