{
    "description": "Cream Lake in Strathcona Provincial Park is a beautiful glacier lake at the bottom of Mount Septimus.  The route is beautiful with great views of Big Interior, Big Jim Lake and even a glimpse of Della Falls in the distance.  This hike can be done as a very long day trip or you can break it up by staying overnight at the Bedwell Lake camping area or backcountry camp at Cream Lake.  The trail to Cream Lake is in good condition and well worn.  Although there are no markers or flags to mark the route the trail is worn enough that you can?t get lost.  Total distance from the parking area 10 kms and 6 kms from Bedwell Lake (both one way).  Total time from the parking area about 8 hours and from Bedwell Lake 4 hours.\r\rFrom Bedwell Lake follow the trail past the pit toilet, this will lead you in the right direction.  As you make your way along the trail you will be gaining elevation, not a severe gain but a gain none the less.  After a little while you will come up to a waterfall, make your way up the water fall on the left of it.  You have now reached Big Jim Lake.  Head around the left of the lake and head towards to the other side.  Once you reach the other side and head up, you will see Mt. Septimus looming in the distance.  That is your bearing and head towards it.  After a while you will come to a high point overlooking Cream Lake, you can either stay here and enjoy the view or head down and camp at Cream Lake.  Camping at Cream Lake is backcountry camping so please camp responsibly and leave no trace.  There are not many trees in which to hang your food up in, we used a long stick and put our food bags on the big huge rock (you will know the one).",
    "directions": "From Courtenay take either the old highway or the new highway to Campbell River. Once there take Hwy 28. You will then come to a bridge, don't go over the Buttle Narrows bridge, just keep heading straight on Buttle Lake road (or Western Mines Road).  At the bottom of Buttle Lake you will cross a bridge, then make a left on the mining road.  Follow this road until you get a chance to make a right.  Make the right and the road will deteriorate and head up.  Follow this road all the way to the BC Parks parking area.  The conditions of the road vary from year to year. If you drive slow enough or don?t really care about your car you will make to the trail head.  4x4s will not have any problems.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/6701/reg_P7030016-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6701/reg_P7030017-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6701/reg_P7030020-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6701/reg_P7030022-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6701/reg_P7030031-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6701/reg_P7030033-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6701/reg_P7030039-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6701/reg_P7030042-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6701/reg_P7030044-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6701/reg_P7030045-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6701/reg_P7030046-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6701/reg_P7030053-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6701/reg_P7040124-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6701/narrow_P7030048-Large--4612.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/cream-lake-near-campbell-river-bc-6701",
    "stats": {
        "Activities": "ski-bc hike snowshoe climb",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 4,
        "Time": "8 hrs",
        "Total Distance": "10 km",
        "Town": "Campbell River, BC",
        "Type": "out-and-back"
    },
    "title": "Cream Lake",
    "trail_id": "6701"
}