{
    "description": "Mt. Rosseau (1962 m) is the tallest peak of the Septimus-Rosseau Massif.  The views from the top are awesome and standing on the actual summit is not for the faint of the heart.  It is the first peak that I have been on that you feel like you are standing on top of the world.  The route described here is from Cream Lake up the Septimus Glacier and then along the scree field above Love Lake.  The route then heads up into some very loose rocky terrain.  It takes about 5 hours to reach the top and about 4 hours down.  You will need to bring a helmet, crampons and ice axe.  Although I highly recommend bringing a rope for rappels down, depending on your climbing ability you may not need one.  I would rate the difficulty at low 5th class, just keep in mind there is a lot of loss debris.\r\rFrom Cream lake make your way up the Septimus Glacier and head to Col between Septimus and the large rock plateau.  After about an hour of plodding your way up, you will come up to spectacular views of Love lake and Nine Peaks.  From here make your way along the snow or scree field, this should take about a half hour or so.  You will now go around the corner and come upon the huge snow field of Margaret Peak.  From here on you are on your own and you will have some good route finding abilities.   Pick a line that looks good and slowly make your way up.  We went up a slightly leftish route.  Once again be careful of the loose debris and in 2-3 hours you will be standing on top of the world.\r",
    "directions": "From Courtenay take either the old highway or the new highway to Campbell River. Once there take Hwy 28. You will then come to a bridge, don't go over the Buttle Narrows bridge, just keep heading straight on Buttle Lake road (or Western Mines Road).  At the bottom of Buttle Lake you will cross a bridge, then make a left on the mining road.  Follow this road until you get a chance to make a right.  Make the right and the road will deteriorate and head up.  Follow this road all the way to the BC Parks parking area.  The conditions of the road vary from year to year. If you drive slow enough or don?t really care about your car you will make to the trail head.  4x4s will not have any problems.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/6702/reg_P7030016-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6702/reg_P7030017-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6702/reg_P7030030-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6702/reg_P7030031-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6702/reg_P7030045-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6702/reg_P7030046-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6702/reg_P7030053-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6702/reg_P7040063-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6702/reg_P7040069-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6702/reg_P7040073-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6702/reg_P7040075-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6702/reg_P7040094-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6702/reg_P7040096-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6702/reg_P7040102-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6702/narrow_P7040092-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6702/narrow_P7040118-Large--4612.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mt-rosseau-near-campbell-river-bc-6702",
    "stats": {
        "Activities": "hike climb",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 4,
        "Time": "14 hrs",
        "Total Distance": "5 km",
        "Town": "Campbell River, BC",
        "Type": "out-and-back"
    },
    "title": "Mt. Rosseau",
    "trail_id": "6702"
}