{
    "description": "Fortuna Mountain has both north and south peaks, approachable from the saddle or there are other options. The loop in the GPS data attached goes to South Fortuna then the saddle. In places you get wide open views all the way to Mexico.\nThere are number of trails in Mission Park that can be used to make almost any desired loop. In spring the area is carpet of green, in summer everything dies and turns brown. \nIf the San Diego river happens to have water approaching from the visitor center may not be the best idea, when were there the \"enhanced river crossing\" had 3 feet of water.\nOn Wednesdays there are guided tours from the visitor center than describe the local vegetation.",
    "directions": "Fortuna Mountain Saddle from Calle de Vida From Interstate 15 - Take 15 to the Clairemont Mesa Blvd. exit. Proceed east on Clairemont Mesa Blvd. to Seda Drive and turn right. Proceed down Seda Drive 2 blocks and turn left onto Calle de Vida. Proceed down Calle de Vida and go to the end of the street. The trail head is at the yellow gate. Look for the park kiosk.\nFrom Route 52 - Take 52 to the Santo Road exit. Proceed south on Santo Road to Clairemont Mesa Blvd., turn left. Proceed east on Clairemont Mesa Blvd. to Seda Drive and turn right. Proceed down Seda Drive 2 blocks and turn left onto Calle de Vida. Proceed down Calle de Vida to the end of the street. The trail head is at the yellow gate. Look for the park kiosk.",
    "geohash": "9mu",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/CA/6704/reg_IMG-1337-7279.jpg",
        "https://trailpeak.com/storage//content/trails/US/CA/6704/reg_IMG-1348-7279.jpg",
        "https://trailpeak.com/storage//content/trails/US/CA/6704/reg_IMG-1354-7279.jpg",
        "https://trailpeak.com/storage//content/trails/US/CA/6704/reg_IMG-1357-7279.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/fortuna-mountain-saddle-near-san-diego-ca-6704",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 4,
        "Time": "4 hrs",
        "Total Distance": "10 km",
        "Town": "San Diego, CA",
        "Type": "out-and-back"
    },
    "title": "Fortuna Mountain Saddle",
    "trail_id": "6704"
}