{
    "description": "This is a nice hike which offers views of the Olympic Mountains and Sooke Hills.\r\rPark your car at the pull off with the mailbox right where the Sooke-a-hala switches from two lanes to one lane each way. Walk back along the road past the \"compound\" with the barking dogs and various pieces of industrial equipment. Take a left into the bushes on an obvious trail and you'll come upon a rusted out Volkswagen Beetle. Follow the trail for a couple of minutes until you reach a stream. Cross the stream and hike up to a wide cleared out trail. Take a right and follow this trail for about 30 minutes. You'll cross the stream again over a pipe covered by tonnes of earth. Immediately after you'll reach a fork in the trail. Take the left trail which follows alongside the stream. About 200-300m from the fork there will be a flagged trail on your right which leads to the summit of Mt. Braden. Don't go up this trail, as you will using it instead for your descent. Keep following alongside the stream for awhile until you reach another flagged trail on your right. Take this trail. It is a well flagged gradual ascent to the summit. At times you'll feel like you have hiked too far past Mt. Braden, but don't worry it loops back. After an hour on this trail you should reach the summit. Enjoy the views.\r\rFor the descent head south down the rocky face of the summit and find a well flagged trail. This trail will lead you down the mountain and meet back up with the wide cleared out trail alongside the stream. Retrace your steps back to your car.\r\rNote: There was quite a bit of bear poop on the way up the summit so be careful.",
    "directions": "Take Highway 14 out to Sooke.  Right where the Sooke-a-halla goes from two lanes to one lane each way there will be a pull off with a mailbox. Park here and walk back along the road past the \"compound\" with the barking dogs and industrial equipment. The trail head will be obvious and right on you left.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/6709/long_18-27485.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6709/long_19-27485.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6709/long_P1000283-27485.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mt-braden-loop-near-victoria-bc-6709",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "11 km",
        "Town": "Victoria, BC",
        "Type": "out-and-back"
    },
    "title": "Mt. Braden Loop",
    "trail_id": "6709"
}