{
    "description": "When British naval vessels were refitted at Esquimalt Harbour they were sailed to an island just off of Oak Bay and then sailed back, completing a trial run. Thus the island was eventually given the name Trial Island. \r\n\r\nFrom the Ross Bay beach, head east towards Trial Island, lining yourself by using the radio antennas as a lead mark. To the north along the shoreline, stay clear of rocks and kelp beds at Templar Rock and Harling Point. Once clear of Harling Point, you have a choice of entering Enterprise Channel to the north east, or paddling to the south east to pass the right hand edge of Trial Island at Staines Point. The Enterprise Channel route is the more scenic of the routes, but the 3 knot current at full flood or ebb tide through the 100 metre wide channel can make for an interesting paddle. Several sandy beaches on the east side of Trial Island are good for landing.\r\n\r\nOther than the currents, rocks and kelp beds, you should keep an eye out for high speed whale watching boats that transit the area.\r\n\r\nThe route through Enterprise Channel is 5 kilometres one way; approaching the Staines Point lighthouse directly is 3.5 kilometres.\r\n There is GPS data attached to this trail (see \"download GPS\"), which if loaded into your GPS can help you find route points.",
    "directions": "Clover Point off Dallas Road\r\n\r\nParking lot UTM 10U 4742158E 53614865N\r\n\r\n\r",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/671/reg_trl1w.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/671/reg_trl2w.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/671/reg_trl3w.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/671/reg_trl4w.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/clover-point-to-trial-island-near-victoria-bc-671",
    "stats": {
        "Activities": "river-canoe sea-kayak",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 3,
        "Time": "6 hrs",
        "Total Distance": "5 km",
        "Town": "Victoria, BC",
        "Type": "out-and-back"
    },
    "title": "Clover Point to Trial Island",
    "trail_id": "671"
}