{
    "description": "Around the central uplift the Charlevoix?s crater\nThe topography of Charlevoix has been shaped 360 million years ago by a 15 billion Tonnes  meteorite. The body hit exactly at the joint between the Canadian Shield and the St-Lawrence Lowlands. I read somewhere that it made a 9 km deep hole. Today, the crater makes 56 km in diameter. \n You can hike on the edge of the crater from the Canadian Shield on the north side; do sea kayaking on the St-Lawrence River on the opposite side, or being imaginative, you can bike around the central uplift which is named Le Mont Des Eboulements. A 32 km ride; one third paved road; one third gravel road, one third back country rough forest road. Tree hundreds meter elevation difference between highest and lowest point.  \nOnce outside the public road, there is no indications; you need the GPS trail. \nOne of the picture was shot from the outer edge of the crater (see the trail ?On the edge of Chralevoix?s crater?), looking at the  Mont des Eboulements",
    "directions": "You can start the ride from the Village of Les Eboulements which is located in-between Baie St-Paul and La Malbaie along the scenic 362 road.",
    "geohash": "f2",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/QC/6710/reg_no-1-8318.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/6710/reg_no-2-8318.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/6710/reg_no-3-8318.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/6710/reg_no-4-8318.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/around-the-central-uplift-of-charlevoixs-crater-near-baie-saint-paul-pq-6710",
    "stats": {
        "Activities": "mtn-bike",
        "From": "",
        "Seasons": "summer",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "32 km",
        "Town": "Baie-Saint-Paul, PQ",
        "Type": "out-and-back"
    },
    "title": "Around the central uplift of Charlevoixs crater",
    "trail_id": "6710"
}