{
    "description": "The trail head starts at 9,700 feet for a total elevation of 4740 feet. This route lets you climb two 14ers in one hike. It is an excellent trail that is very beautiful and rewarding.  With an incredible view over the city of Leadville and Twin Lake. The mount Elbert is the highest peak in the Rockies, and second highest in the contiguous United States with is 14,440 feet.\r\rThis is a moderate to strenuous day hike. Be aware of changing weather conditions on mountain peaks and prepare for them. This trail passes through spruce-fir and aspen stands, then through some rock beds to ruins of mining operations and cabins. Continuing your hike will bring you to timberline and eventually Mount Elbert. For those who don't wish to climb the peak, there are many excellent views from various points along the trail.",
    "directions": "The entrance is in a very small campground accessible by the Independance Pass, close to the Twin Lake village. You  can drive from Aspen or Twin Lakes. Twin Lakes is between Leadville and Buena Vista. Turn West off of Highway US-24 onto CO-82 and drive about 10.5 miles to the trailhead. This is the easiest turn-off to miss because the sign is very small and off the road in the trees. The turn off is about 4.2 miles West of the town, Twin Lakes, and 4 miles East of the CO- 82 South Fork Lake Creek junction. The sign reads \"Black Cloud Trail.\" There is parking for a few cars off the road about 50 to 100 feet. From the parking area, the trail is on the right (east side).",
    "geohash": "9wuq",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/CO/6712/reg_Leadville-colorado-030-26303.jpg",
        "https://trailpeak.com/storage//content/trails/US/CO/6712/reg_Leadville-colorado-108-26303.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/black-cloud-trail-mt-elbert-near-twin-lakes-co-6712",
    "stats": {
        "Activities": "hike snowshoe",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 5,
        "Time": "7 hrs",
        "Total Distance": "9 km",
        "Town": "Twin Lakes, CO",
        "Type": "out-and-back"
    },
    "title": "Black Cloud trail (Mt Elbert)",
    "trail_id": "6712"
}