{
    "description": "Divide Peak is a great little scramble in the northeastern part of Glacier National Park.\nHighlights include an old fire lookout and an eerie approach through the remnants of a forest fire. From the top of the mountain there are wonderful views of St. Mary lakes and its neighboring peaks - including Little Chief, Red Eagle, Curly Bear and White Calf.\nIn the summer you can drive most of the 3 km approach to the base of the mountain, but as we were attempting this peak as part of our annual 'April Fools' scramble (an early season hiking tradition amongst a few friends), my friend J. and I had to contend with a bit of snow and had to walk most of the approach.\nThere are a few secondary roads spurring off the main trail, probably for some sort of logging operation of the burnt out trees. It's not too hard to follow the main road or secondary paths through the forest to the base of the mountain, but just to be sure, I had GPS'd the route beforehand (the main road actually showed up on my Montana GPS basemap). \nI dragged along snowshoes but never required them as the snow was hardpacked on the main road as a result of snowmobilers that frequent the area in winter. I would be interested in touring the approach as far as the repeater tower with light touring skis and trying some gentle turns if the snow permitted.\nIt was a short, slippery grunt to gain the ridge and just a tad dicy because of the snow. Under normal (dry) conditions, gaining the North ridge should be straightforward.\nWe stopped for a quick bite just as we got onto the ridge, unaware that the old fire lookout was just a few minutes away. It was crazy windy on the day we did this scramble, and when we spotted the lookout, we stopped in for a few minutes respite from the wind. The lookout is quite old and delapidated, and was actually swaying ever so slightly in the wind! We wondered out loud, is today the day this shelter is going to  blow apart? Steel cables fix the structure into place, but regardless, I really think the shelter is putting up its brave last stand and might simply blow apart in the wind in the near future.\nFrom the fire lookout, it is a grunt up to the summit and we proceeded pretty slowly because of the violent wind. There seemed to be a wind tunnel effect from the start of the ridge to about 2/3rds of the way up to the summit, probably as a result of the winds blowing up the valley. Near the top there was a bit of hands-on scrambling required - nothing too difficult, but challenging because of the snowy/windy conditions.\nWe carefully picked our way down and the views disappeared as it started to snow about halfway down - we couldn't really see the snow as it was blowing so hard, but we could feel it whipping against our faces. I was happy to have brought along a ski mask!  \nChecking the online snowpack data the next day from Waterton's Akamina snow pillow (just a bit further north), I found out that we had been hiking during the beginning of a snowstorm that dumped 25 cm over the following 12 hours!",
    "directions": "Driving south from the village of St. Mary, follow highway 89 south. Set your odometer to zero at the junction of route 89 and the turnoff to the park (the Going to the Sun road) and follow route 89 for 9.5 km. As the road crests to a highpoint, pull off sharply to the right at the remants of a big billboard and follow the gravel road (see waypoint). Follow the main gravel road (the power lines parallels the main road at the start). The main road continues towards some sort of repeater tower. Follow the main road as close as possible to the base of the mountain (either stop at the big meadow, or follow the spur road that leads right to the base of the ridge). \nThis approach is the Blackfeet reserve, so a tribal permit is required ($10/year - available at nearby Duck Lake Lodge and valid for a year starting April 1st). Apparently there are conservation officers roaming about that are enforcing this, so if you do not have a permit, be warned, you may have to pay a fine.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/MT/6713/long_P3281901fire-lookout-7064.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/6713/long_map-7490.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/6713/reg_resized-P3281851-7490.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/6713/reg_resized-P3281867-7490.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/6713/reg_resized-P3281868-7490.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/6713/reg_resized-P3281870-7490.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/6713/reg_resized-P3281872-7490.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/6713/reg_resized-P3281891-7490.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/6713/reg_resized-P3281900-7490.jpg",
        "https://trailpeak.com/storage//content/trails/US/MT/6713/reg_resized-P3281905-7490.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/divide-mountain-glacier-national-park-near-babb-mt-6713",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "6 hrs",
        "Total Distance": "8 km",
        "Town": "Babb, MT",
        "Type": "out-and-back"
    },
    "title": "Divide Mountain (Glacier National Park)",
    "trail_id": "6713"
}