{
    "description": "A walk on the beach at Torrey Pines just south of Del Mar. Starting from the state park proceed south. Follow the trail around the base of the cliff when you encounter the obvious rocks. It's generally only passable when the tide is at least partly out. \nHowever be warned once you are south of the these rocks  the locals consider this section of the beach to be \"clothing optional\" despite the fact there is at least one sign stating \"nudity prohibited\". \nWe encountered a number individuals acquiring an \"all over suntan\".  It's a scenic beach walk with an interesting twist, great place for watching sunsets. Plus you can frequently observe hang gliders flying over the cliffs",
    "directions": "From the 5 FWY exit Carmel Valley Road west to Torrey Pines Road south (aka Pacific Coast Highway). There are four parking options. The first is the large-capacity lot on the left side of Carmel Valley just before reaching the coast. Option two is the roadside parking along the southbound shoulder of PCH. Options three and four are both within the State Park at the south end of the beach. An entrance fee ($4.00 per vehicle) is collected at the gate which is open from 8am until sunset daily. The lower, beach level lot is directly beyond the gate, with additional parking around the park headquarters and trailheads at the top end of the road.",
    "geohash": "9mue",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/CA/6715/reg_IMG-1245-7279.jpg",
        "https://trailpeak.com/storage//content/trails/US/CA/6715/reg_sd-Beach-Torrey-Pines-7279.jpg",
        "https://trailpeak.com/storage//content/trails/US/CA/6715/reg_torrey-pine-beac-1-7279.jpg",
        "https://trailpeak.com/storage//content/trails/US/CA/6715/reg_torrey-pine-cliff-7279.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/the-beach-at-torrey-pines-near-del-mar-ca-6715",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "6 km",
        "Town": "Del Mar, CA",
        "Type": "out-and-back"
    },
    "title": "The Beach at Torrey Pines",
    "trail_id": "6715"
}