{
    "description": "This is a short hike that will take you to a series of waterfalls in a deep ravine near Lochaber.  The hike is short and the highest fall is about 20 feet high.  There are plenty of other hikes to do in this area (Black Brook Fall, Good Hunting Brook Fall, Green Brook Fall, Chisolhm Brook Fall).\nAs you leave you car by the bridge, make your way in the old field on the right hand side of the brook (looking upstream) to almost the left corner of the field.  About 20m from the corner of the field (on the right) you should be able to discern a small overgrown path which will lead you to a second field.  This other field still had some old and somewhat large stumps that are overgrown with colorful lichens.  I did not see the path in question on my way to the fall so my track kind of follows the stream for a while before finding its way into the field with the stumps.\nMake your way to the back of this field where the stream is flowing out of a ravine.  There is a small fall there but it?s not the final one to see on this hike.    We followed the stream into the ravine and we made it almost to the falls by remaining in the ravine but there was a place where we couldn?t go through and we had to get back to the top of the ravine.  In summertime or at low water time, you won?t need to ascend the very steep slopes of the ravine like we did (see the GPS track).  The forest along the ravine is composed of somewhat mature evergreen with some smaller trees that you can grab onto if you need to ascend/descend the slopes.  After about 800m from your starting point, you will come to the highest fall (20ft) and there are about three more, smaller falls upstream.",
    "directions": "In Antigonish, take highway 7 towards Sherbrooke.  Turn right on Ohio Lake Rd and then left on West Side Lochaber Rd.  Drive to a bridge over the main branch of McNabb Bk at approximately 45.41472N,  -62.03233.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/6716/reg_DSC-0193-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6716/reg_DSC-0202-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mcnabb-brook-falls-near-antigonish-ns-6716",
    "stats": {
        "Activities": "snowshoe hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "2 km",
        "Town": "Antigonish, NS",
        "Type": "out-and-back"
    },
    "title": "McNabb Brook Falls",
    "trail_id": "6716"
}