{
    "description": "The area between the Johnson Street Bridge and the Bay Street Bridge passes along the Selkirk waterfront, an industrial area that is slowly being rehabilitated for recreational and residential use. Upstream of the Selkirk Trestle, you will encounter narrower and shallower waters, boarded by parks and waterfront homes. Upstream of the Tillicum Bridge the waterway widens slightly as you pass Kinsman Park, and then narrows again until you pass under the last bridge at Admirals Road and enter Portage Inlet, a fjord designated as a waterfowl protection area.\r\n\r\nThe Gorge is an easy paddle for novice and intermediate paddlers up to Tillicum Narrows, where the current can exceed 6 knots. Consulting the tide tables will allow you to plan your trip upstream to arrive at a rising tide, and return downstream on the ebb. Although experienced paddlers may want to play in the rapids, it is possible to portage around them.\r\n\r\nFrom the public wharf at the foot of Government Street across from the Empress Hotel, start your trip by heading towards the blue Johnston Street Bridge. This is a busy stretch of water, with seaplanes, whale watching boats and both commercial and pleasure craft to deal with. If the main span of the bridge is up, keep a close watch for approaching fishing boats or tugs entering the narrow stretch of water under the bridge. \r\nThere is GPS data attached to this trail (see \"download GPS\"), which if loaded into your GPS can help you find route points.\r",
    "directions": "Pay parking at lots along Government Street. Public wharf towards the Parliament Buildings along the paved sea wall path.\r\n\r\nParking lot UTM 10U 472645E 5363549N\r",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/672/reg_ihbr1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/672/reg_ihbr2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/672/reg_ihbr5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/672/narrow_ihbr3.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/gorge-waterway-near-victoria-bc-672",
    "stats": {
        "Activities": "river-kayak river-canoe sea-kayak",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "7 hrs",
        "Total Distance": "15 km",
        "Town": "Victoria, BC",
        "Type": "out-and-back"
    },
    "title": "Gorge Waterway",
    "trail_id": "672"
}