{
    "description": "Configuration -out and back, scenery views of Lake Ramon, distant lake Poway, birds , creek lined with oak and sycamore, flowering plants along the upper trail. Portable toilets at both Lake Ramona at trailhead.\nTrail starts going through a grove of old oaks, pass the trailhead marked Lake Poway. Turn left at sign pointing to Lake Ramona, following the road (trail). \nIt's a scenic walk with flowers in season. Climb up the switch backs to the lake. Where you can decide on any further adventures. With an appropriate licence you can fish in the lake.",
    "directions": "Fron I-15, exit at Rancho Bernardo Road and travel east for 3.5 miles. Note that the the road becomes Espola Road and the Summerfield intersection. Watch for the Blue Sky Ecological Reserve sign on the left, and turn into the nearby parking lot. Trail head is to the right.\nMore fun at treat for eyes and taste buds can be found at the Hamburger Factory Restaurant 14122 \nMidland Road (N32 58.207 W117 02.167)\nFrom Blue Sky turn left on Espola Rd Drive approximately 3 miles and turn right on Twin Peaks. At about 0.8 miles turn left on Midland restaurant is about .5 miles further",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/CA/6720/reg_IMG-1275-7279.jpg",
        "https://trailpeak.com/storage//content/trails/US/CA/6720/reg_Poway-dam-7279.jpg",
        "https://trailpeak.com/storage//content/trails/US/CA/6720/reg_ramona-lake-7279.jpg",
        "https://trailpeak.com/storage//content/trails/US/CA/6720/reg_ramona-lake-flowers-7279.jpg",
        "https://trailpeak.com/storage//content/trails/US/CA/6720/reg_ramona-lk-view-01-7279.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/blue-sky-to-lake-ramona-near-poway-ca-6720",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "8 km",
        "Town": "Poway, CA",
        "Type": "out-and-back"
    },
    "title": "Blue Sky To Lake Ramona",
    "trail_id": "6720"
}