{
    "description": "This is a hike that will take you to three distinct waterfalls.  The first fall is the biggest with an estimated height of 100 feet.  There are two more falls upstream which are approximately 20 feet each.\r\rI had been to the first fall back in 2004 or so and I had always wanted to go back since there was not a lot of water at the time of my first visit.  I also wanted to find a quicker way to the biggest fall since the first time around I bushwhacked my way from where the river crosses the dirt road and it was about an 8 km total trip from that point.\r\rThis time around, I continued with my car on the dirt road over the bridge and up the Cobequids until a location just passed a 90 degree bend in the road.  There is a small trail that starts there but it quickly disappears.  At that point just follow one of the many intermittent streams through the forest and down the ravine.  Once you have reached the main river, head upstream.  You should make it to the biggest fall within about 700m from leaving your car.  The slope on the ravine is not too steep and the forest is composed of mature deciduous trees with some mature evergreen where the slope is steepest.  I went across an old logging road at some point but it seems to be running parallel to the river and not to the fall.\r\rOnce I reached the fall, I made my way to the top by climbing on the right hand side of the fall (looking upstream).  I then followed the stream for another 500m or so to see the next two waterfalls.  Again the forest is quite mature and easy to walk through.  On my way back I decided to keep on top of the ravine instead of following the stream.  Upstream of the last waterfall there was an old road I followed up the ravine.  As you can see on my GPS track it was a good idea to follow this road until a point where I veered off to the right a little bit too much.  I ended up on another logging road and eventually to the main road but I added another 1.5km to the route.\r\r\r",
    "directions": "In Bass River, take Maple road and follow it to an intersection with the old Economy Rd.  Turn left on Old Economy Rd and go over the West Branch of the Bass River and up the Cobequids.  Park at  45° 27.388'N, 63° 49.324'W.\r",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/6725/reg_DSC-0214-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6725/reg_DSC-0219-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6725/reg_DSC-0222-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6725/reg_DSC-0226-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/west-bass-river-falls-near-truro-ns-6725",
    "stats": {
        "Activities": "hike snowshoe",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "4 km",
        "Town": "Truro, NS",
        "Type": "out-and-back"
    },
    "title": "West Bass River Falls",
    "trail_id": "6725"
}