{
    "description": "This hike is close to some other hikes I have described such as West Bass river, East Bass river and also to some other hikes described on the site; Kenomee Canyon, Devil?s Bend.  Therefore you should add this small hike described below if you are planning to go hiking for the day.  The turnaround point to this hike is a 50 feet high waterfall.  The fall is also spectacular since it came also be quite wide (20 feet or so).\r\rThe fist part of the hike will take you though and area which has been dammed off by beavers so its better to go up the small hill on the right to avoid the wet areas.  Once you have gone around this spot you can come down to the stream edge and make your way upstream to an area about 1.2km from the start where a smaller branch of the river flows into the main stream.  Follow this branch instead of the main stream for another 800m. This section of the hike goes more or less uphill and the walking becomes progressively easier until you reach the mature maple forest.  At this point, the scenery is beautiful in the forest as there is little brush to impede your view.  You will see a small cascade just before you reach the main waterfall.\r\rOn the way back, I found a very old trail on the top of the ridge and you can follow it to an area where the two branches of the stream meet.  Then just follow the stream back to your car.\r\r\r",
    "directions": "Take highway 2 and west of Bass River turn right on Economy River Rd.  Drive and park where the stream flows under the road at approximately N45.43641, W-63.84915.\r",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/6726/narrow_DSC-0232-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6726/narrow_DSC-0235-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/east-branch-economy-river-fall-near-truro-ns-6726",
    "stats": {
        "Activities": "hike snowshoe",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "4 km",
        "Town": "Truro, NS",
        "Type": "out-and-back"
    },
    "title": "East Branch Economy River Fall",
    "trail_id": "6726"
}