{
    "description": "Mont Groulx (complementary trail)\r\rWhen my brother Normand asked us (Sylvie and me) if we were willing to do the Mont-Groulx the week end after, we said euh.. yes; his friend Mario would also come.\r\rMario from Montreal, Normand from Charlevoix, Sylvie and me from Fermont with a meeting point at the Manic 5 Dam, this meant a return trip of 2050 km for Mario, 1320 km for Normand and 700 km for us.\r\rNobody live close  to the Mont-Groulx. \r\rThe efforts are however rewarded.\r\rI said complementary trail,  because our section of trail can be added to Hugo?s trail is already on trailpeak site.\r\rThe trail starts from the parking lot near the bridge of La riviere Beaupin  and follows the summer path to the Mont-Jauffret.  The winter trail follows the stream close by  on the North side. The return trip js 16 km and the elevation difference is 640 m. \r\rOnce on top, you can walk as long as you wish or make a linear hike of 33 km from one access to the the other (see trail from Hugo de Quebec).\rThe area is wild; the trail is rough. Be prepared. The area was foggy the first day. We needed a GPS already set up with trails entrances and waypoints.\r\rWe were lucky to see a ?caribou forestier?at close range on the top.  We took very nice pictures.\r\r\r",
    "directions": "\rFrom Baie Comeau, you take de road 389 North; There two possibilities for lodging on your way up:  the Motel  de l?Energie at km 210 and Le Relais Gabriel at km 316. They have a Web site.  \r\rThe entrance to the Mont-Groulx via the Mont-Jauffret is well indicated at around km 362 (9 km before the bridge over the Beaupin River.\r",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/QC/6731/reg_001-8318.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/6731/reg_002-8318.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/6731/reg_025-8318.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/6731/reg_041-8318.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/6731/reg_042-8318.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/6731/reg_5607-8318.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/6731/reg_5643-8318.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/6731/reg_5647-8318.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/6731/reg_5651-8318.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mont-groulx-via-mont-jauffret-near-fermont-pq-6731",
    "stats": {
        "Activities": "ski-bc hike",
        "From": "",
        "Seasons": "summer fall winter",
        "Stars": 4,
        "Time": "14 hrs",
        "Total Distance": "16 km",
        "Town": "Fermont, PQ",
        "Type": "out-and-back"
    },
    "title": "Mont-Groulx via Mont-Jauffret",
    "trail_id": "6731"
}