{
    "description": "WAYPOINTS:\nHARRISON HOTEL:                      N49 17.739 W121 47.172\nHARRISON HOTSPRINGS:            N49 18.358 W121 47.778\nSANDY POINT BEACH FORK:        N49 18.474 W121 48.018\nSANDY POINT BEACH:                  N49 18.582 W121 47.963\nWHIPPOORWILL LIGHT BEAKON: N49 18.694 W121 48.038\nHARRISON RIVER:                         N49 18.567 W121 48.146\nHARRISON RIVER BEND:                N49 18.438 W121 48.117\nEasy hiking trail from Harrison Hotsprings. First km paved to hotsprings gazebo. Then well beaten path to Sandy point beach, then visible trail for the rest of the loop. Slight climb. White diamond markers for the entire trail. Slippery rocks on Whippoorwill Point. Rainforest vegitation. Salmon berries. Panoramic beach views. Bring your camera.\nStart out at Harrison Hotsprings Hotel (Waypoint) and head north on the left side of the lake for 1 km on a paved road till you get to the Hotsprings gazebo. (Waypoint). From there the trail starts. Well beaten trail, uphill for 200 meters. On your right looking down over some rocks you'll see Harrisons sewage treatment plant.\nShortly after that the trail splits. Right (lower trail) leads you over a rock scramble. No problem for hikers, but if you prefer the easier trail, take the left (upper trail) that goes around this rocky outcrop. The trails will merge again right after the rockoutcrop. From here it gets more flat. The trail will bend slightly to the left into a small gulley where you hit another fork. I call it the Sandy Beach Fork (Waypoint). \nYou can hike either way (clockwise or counterclockwise) since here starts the loop trail.We took the right (lower) trail first and headed down to Sandy Beach. (Waypoint).\nMost hikers turn around here and think thats it. But on the northend of the beach, a little hidden in the bushes,  the trail contiunues slightly uphill into the forest  again. It flattens out \nagain and after a couple  hundred meters you can branch of to the right for a short side trail out to the Whippoorwill Point light beacon. (Waypoint) Great views back to Harrison Hotel with the Mt. Cheam group as a backdrop. Straight out in the middle of the lake you'll see Echo Island, and to the north east you'll see Long Island with some more fantastic mountains as a backdrop. The rocks out at the point might be a little slippery. but that's where you have to be, for the best photo opps.\nHead back up to the trail and continue your loop following along the Harrison River (Waypoint).\nAt one point you can hike out to the river for some great views.\nWhen the river bends slightly (Waypoint) the trail heads up into the forest again. It flattens \nout after a 100 meters and you will end up at the Sandy Beach Fork again, to complete your \nloop trail. From here head back the same way to Harrison.\nYou can do the trail in 1 hour if you jog, or it can take up to 3 hours if you pick lots of salmon \nberriers, enjoy the vistas and take lots of photos.\nWe asked for a little trailmap from the counter at the Harrison Hotsprings Hotel. Don't know if \nthey hand it out to everyone or just to their guests? They sure was very helpful.",
    "directions": "See description and / or GPS",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/6737/reg_Harrison-River1-27777.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6737/reg_Harrison-River2-27777.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6737/reg_Sandy-Point-Beach-Echo-Island1-27777.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6737/reg_Sandy-Point-Beach-Echo-Island2-27777.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6737/reg_Sandy-Point-Beach-Mt.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6737/reg_Sandy-Point-Beach-looking-north1-27777.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6737/reg_Sandy-Point-Beach-looking-north2-27777.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6737/reg_Sandy-Point-Beach1-27777.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6737/reg_Sandy-Point-Beach2-27777.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6737/reg_Whippoorwill-Lighthouse-HarrisonLake1-27777.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6737/reg_Whippoorwill-Lighthouse-HarrisonLake2-27777.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6737/narrow_Whippoorwill-Lighthouse1-27777.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6737/narrow_Whippoorwill-Lighthouse2-27777.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/whippoorwill-trail-harrison-hotsprings-near-harrison-hot-springs-bc-6737",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "5 km",
        "Town": "Harrison Hot Springs, BC",
        "Type": "out-and-back"
    },
    "title": "Whippoorwill Trail / Harrison Hotsprings",
    "trail_id": "6737"
}