{
    "description": "It's close proximity to Vancouver, easy access, and views make this trail a great hike when you are pressed for time. Its gentle grade makes it a good choice for people hiking with children, or with non-hikers.\r\n\r\nThe trailhead is at the parking lot of the Cypress Bowl downhill ski area just before the building where you buy your lift passes. There's a sign which says \"Yew Lake Trail\" and \"Howe Sound Crest Trail.\" After crossing a small wooden bridge, the Yew Lake Trail branches off to the left. Stay on the Howe Sound Crest Trail. The trail soon runs into a gravel road. Turn left and continue the gentle climb. In about 20 minutes you'll come to a nice view of Bowen Island before the trail takes you back into the forest. Majestic old trees surround you as you hike along a very civilized, wide trail. There is a short trail branching off to your left that will take you to the Bowen Island Lookout but to be honest, the view isn't as good as the view you just saw so unless you're looking for something to do, just continue on. Just past this turn off is a picture perfect view of The Lions. The trail losing some elevation now, but not for long and after about 10 minutes you'll get another view, this time of the ocean and the Sechelt Peninsula. I would have hiked right on through had I not stopped and looked back to say something to my partner as you kind of need to turn around to see it. In under an hour you will come to Strachan Meadows. Continue up towards the twin peaks for more ocean and Lions views.\r\n\r\nThe trail continues up the gully to the two summits but is quite steep. The meadow makes a nice destination for a short and easy hike.\r\n\r",
    "directions": "Take the Cypress Bowl (#8) Exit off of Highway 1. Drive to the top (16 km). Wasn't that easy?\r\n\r\n\r\nsome cool footage launching from Strachan\r\n\r\n \r\n\r",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/674/reg_IMGP2354.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/674/reg_IMGP2361.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/674/reg_IMGP2366.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/674/reg_IMGP2370.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/674/narrow_IMGP2356.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/674/narrow_IMGP2369.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/strachan-meadows-near-vancouver-bc-674",
    "stats": {
        "Activities": "snowshoe hike",
        "From": "",
        "Seasons": "winter summer",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "4 km",
        "Town": "Vancouver, BC",
        "Type": "out-and-back"
    },
    "title": "Strachan Meadows",
    "trail_id": "674"
}