{
    "description": "I'm all for getting out to hike or explore some wilderness. Sometimes the problem has to do with time commitment. With a trail that's a half hour out of town, you have to account for at least an hour of travel time that's devoid of adventure. Not so with urban or city outskirts options, and East Royalty trail is a prime example of adventure just minutes away. An earlier version of this path was posted by Andy Collier and you can find some of the routes in his description and trail map:  East Royalty Trail.\nSince the fall of 2009, local mountain bikers reclaimed some of the more urban end of the community trails, and started cleaning them of junk and debris. With money from the City, the trail will get more publicity and become a community feature for fitness and well being. For people looking for an adventure outlet closer to home, this is a win win situation.\nOne trailhead starts off in a community, not too on top of near by properties, so there's no major drawing attention to one's self if you want to park and go.  An open grassed house lot prefaces the trailhead, so that's the most obvious land mark. Depending on where you live, you might think green and ride or walk to the trailhead, as instead of driving.\nThe trail tears through a narrow band of forest that divides neighboring communities, so thirty feet separates one back yard from another. The trail here runs fairly straight and smooth. There's the odd trail feature of bumps and jumps built by the local kids and can be just as easily enjoyed as avoided.\nAfter a few road crossings, and running east-north-east, the trail begins to shift its feel from urban to rural, as farm fields start to spring up on either side. You'll see fewer homes, and more wilderness. Wright's Creek eventually shows up ahead, along with a T in the route, and you will be able to make out a trussed bridge to your right, the gate way to a community recreational area.\nA right at the T in the path takes you to that bridge, where upon crossing, it opens to some beautiful teachnical single track that twists and turns in the woods along the shore. This would be the main attraction! It's so easy to forget that you're just on the edge of town. The terrain remains flat, so the technical aspects lean toward roots, ND tight twists and turns, rather than lung sucking hill climbs. For that, you'd want trails in the Bonshaw / Strathgartney area. (25 minutes out of town)\nThe trail has been blown clear of leaves, and constant use keeps it free of twigs and blow down.\nWhile I hiked the path, I encountered dog walkers and a young boy on a mini bike riding along the main path, so be aware that there might be motorized users. Regardless, and like all urban trails, you may just have to share the path. I had my dog with me, but the moto-cross rider was very conciencious of him and me, and kept his speed in check while he went by us. I'm not sure if he partakes in the techncal single track, but seeing how he rode with care, I felt that for him, and myself, the trail was a great place to enjoy a ride, so close to home. \nIt's great to find a path that runs for 7K and change. The route doesn't have to end where it starts, because back at Wright's Creek junction, upon returning, you can continue straight instead of backtracking to give you more flowing  trail to ride back to St. Peter's road. (My track started from there) Although parking is more tricky along St. Peter`s road, the entry point there gives you a fun and fast warm up to the technical stuff as it runs along side Wright`s Creek on your left. This alternative trailhead puts you not too far from the other one. If you wanted to cut tothe chase and ge right to the technical stuff, you can park your car near the covered bridge, an avoid all the real urban content all together. Nice to have options!\nI've  given this an expert rating because 70% is technical single track that twists and turns with plenty of log hops and wheel traps. The route is tighter than we'd like, and maybe we'll open it up to more flowie sections as time goes on. On a recent visit, even a seasoned expert went ass over tea kettle at one bizzaar spot. Watch out for trail features that snag your wheels. As this gets ridden more and more, things should smooth out and simplify. \nKudos to the local mountain bike riders, and the recreational administration of Charlottetown for breathing new life into a hidden secret. It's amazing what a simple trail can do.\nEast coast editor\nShannon Burt",
    "directions": "Driving toward East Royalty along the arterial highway, turn at the signaled intersection onto Route 2 heading toward Saint Peters. Immediately after you pass the KFC, (there are entry trails behind there in the woods) take a right onto Northridge Parkway, and a right again onto Westcomb Crescent. At the first intersection,  (West Ridge Crescent) you'll see open grass and some woods on the left. The trail starts here in the woods, and runs East. The woods on the other side of the road is fenced off.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/PE/6745/reg_eastroyalty-005-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/6745/reg_eastroyalty-006-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/6745/reg_eastroyalty-007-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/6745/narrow_eastroyalty-001-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/6745/narrow_eastroyalty-002-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/6745/narrow_eastroyalty-003-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/6745/narrow_eastroyalty-008-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/6745/narrow_eastroyalty-009-6702.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/east-royalty-trail-riverside-ride-near-charlottetown-pe-6745",
    "stats": {
        "Activities": "snowshoe hike mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "7 km",
        "Town": "Charlottetown, PE",
        "Type": "out-and-back"
    },
    "title": "East Royalty Trail -Riverside Ride",
    "trail_id": "6745"
}