{
    "description": "This is the first section of the Clearwater River Trail that continues on into Wells Gray Prov Park.  A 7km hike that starts in Clearwater and ends on the Clearwater Valley Rd at Candle Cr.  See several types of Volcanic and River formations including amazing bluffs, natural land bridges, waterfalls and river features.  Also a great way to see some of the paddlers that frequent the Clearwater River rapids during the summer and fall months.  \r\rThere are no defined camping areas along the trail, but there are several interesting places along the river to rest and take a refreshing dip.  The Triple Decker Falls is the first of many amazing waterfall features that are all along the Clearwater River valley.  \r\rTrail is moderately well maintained and signed with new bridge installations and most of the deadfall cleared for the 2010 season.  There are several steep sections to the trail and some tricky drop-off areas so take care.  Mtn Biking on the trail is not recommended (several sections would be considered double black diamonds).\r\rThe best way to enjoy this trail is to drop off a bike at the Triple Decker Falls Trailhead (Candle Cr) and then park or get dropped off at the Clearwater River Trailhead at the end of Dutch Lk Rd.  Total round trip including trail and pavement is approx 14km.",
    "directions": "The Clearwater River Trailhead is reached by turning West onto the Old Hwy 5 at the Wells Gray Inn on Hwy 5.  Take a right onto Dutch Lake Rd at the RCMP station.  Keep left at the 'T' junction and follow Dutch Lake Rd to the end.  Trailhead is signed.\r\rThe Triple Decker Trailhead is accessed by turning North onto the Clearwater Valley Rd from Hwy 5 at the Wells Gray Info Centre.  Travel 4.4km to Candle Cr and park on the left behind the cement barricade.  You will see a large white sign denoting Woodlot 301; the trailhead is signed by a yellow warning sign but is otherwise unmarked.  You will hear the roar of the Triple Decker Falls.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/6748/narrow_Candle-Cr-Falls-001-21577.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6748/narrow_Cleawater-TripleDecker-Trail-21577.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6748/narrow_SpringFalls-011-21577.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/clearwater-river-triple-decker-trail-near-clearwater-bc-6748",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "7 km",
        "Town": "Clearwater, BC",
        "Type": "out-and-back"
    },
    "title": "Clearwater River - Triple Decker Trail",
    "trail_id": "6748"
}