{
    "description": "Baby Steps is new singletrack that all abilities of riders will enjoy.  It's not typical MOAB rock, rather, it's smooth hard pack single track as the images show.  The trail grade is also gentle, you can take it either way, going down after doing Klondike Bluffs is the most fun -- I found, however, I encountered other riders going up.  Because it undulates, swoops, dips, and rises, it's probably a similar experience either way.  It's a ton of fun, it's so buttery smooth and fun, you dip down then come cresting up the next hill and there are barely any ledges.  There is one slickrock section I remember, but it's mostly red dirt singletrack.\nYou can see from the google map how the trail is off to the side of the Klondike Bluffs trail, it zig zags it's way more or less parallel to it, with a few egress points where it actually rejoins Klondike in a few places, should you wish to enter or exit Baby Steps.  \nI found the scenery to be spectacular, you do get Arches National Park on the Horizon.  I did this trail by first taking Klondike up to the hiker's lookout over Arches -- and, then found Baby Steps on the way down to make my own loop.\nHowever, in it's entirety, Baby Steps is actually a much larger and longer trail that descends down the other side of Klondike Bluffs into the plain below and then loops a long way around and back.  Most definitely however, the tight singletrack of my route was outstanding fun.  The combination of Klondike and Baby Steps made for a nice 2.5 hour loop if you include all of Klondike.  \nI saw some families on Klondike, so this is very intermediate.  While Klondike is almost all slick rock, Baby Steps is almost all singletrack,.  Do this trail, there aren't many like it in MOAB.",
    "directions": "Take 191 North out of MOAB and take the Klondike Bluffs turnoff. There is a parking area right off 191, however, if you continue a couple of miles on the dirt road, you get to the main parking area most use.  On my visit, there were about 10 vehicles mid-week in April.  The actual trail is well signed, so it's not had to get on the Klondike trail and then follow along the sandy trail at first until the slick rock starts.  At the start of the slick rock is the dinosaur foot prints, worth a stop.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/UT/6749/reg_IMG-0005-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/UT/6749/reg_IMG-0007-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/UT/6749/reg_IMG-0010-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/UT/6749/reg_IMG-0011-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/UT/6749/reg_IMG-0013-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/UT/6749/reg_IMG-0020-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/UT/6749/reg_IMG-0095-pref-5.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/klondike-bluffs-baby-steps-near-moab-ut-6749",
    "stats": {
        "Activities": "mtn-bike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "15 km",
        "Town": "Moab, UT",
        "Type": "out-and-back"
    },
    "title": "Klondike Bluffs - Baby Steps",
    "trail_id": "6749"
}