{
    "description": "This is a hike down into an area called McCallum Gulch.  The hike will take you down the gulch and then upstream of the East Branch of the Moose River to a massive fall partially surrounded by 100-200 foot rock cliffs.  As you set off down the stream which flows under the road, you will encounter the first waterfall (40ft) within about 100m.  The forest is quite dense around this fall and you will need to push though some evergreen.  As you make your way downstream, the forest will gradually open up.  After no more than a couple of hundred feet, you will be at the top of another waterfall (60ft).  Make your way down to its base on the left hand side (facing downstream).  Once you are at the base of this fall and you are making your way downstream, you will notice that the right hand side of the gulch is composed of evergreen and the soil is covered by moss, the left side is an open Acadian type deciduous forest.  What a cool contrast and good example of how the direction of a slope can affect its vegetation.Rom the start of the stream to where it empties into the East Branch of the Moose River, you will walk about 2.5km and see at least two more significant waterfalls.  The walking is quite easy in the middle portion but gets a bit tougher in the lower reaches with some vegetation and deadfall to impede your way.I?ve described how to get to the massive Moose river gorge waterfall (www.trailpeak.com/trail-East-Moose-River-Gorge-near-Parrsboro-NS-6594 ) before but since the end point of MacCallum Gulch is only about 1.5km from the massive waterfall, I decided to make my way up to see them.  As you make your way up the East Branch of the Moose River, you will need to go up the slope in numerous spots as there are rock outcrops that prevent you from walking along the waters edge.  Maybe in the summertime you could walk in the river to save some time and effort (these slopes are extremely steep at times).  After some effort you will be rewarded by reaching the massive fall and cliffs.  My track on this post shows that after looking at the fall, I made my way up the cliffs on the right to afford a better view of the fall.  These must be some of the highest cliffs in NS. The view at the top reminds me of the Clyburn Valley trail.   For the climbers out there; the rock is solid, there is ample room to belay, there are places with some overhangs and the rock walls can easily be 100-200ft or more.  There are two main cliffs section, one is by the river and the other is at the top of a scree slope that faces the waterfall.Once at the top of the cliffs, make your way up the gentle slop in a due East direction.  By not going down the slop into the gorge, you can be back to the starting point in about 1.5 km instead of about 4km required to retrace your steps.  I eventually made it to a secondary road which led me to the main road where I had left my car.",
    "directions": "Make your way past five Islands towards Moose River and turn right on logging road located at  45° 24.913'N, 64° 8.097'W.  Continue on main road and park where a stream flows under the road (45° 26.451'N, 64° 9.525'W).  At the time I was there, the stream had washed out the road at the culvert making it uncrossable by car.  Follow this stream down into the gulch?",
    "geohash": "f846",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/6750/narrow_DSC-0009-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6750/46.McCallum.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6750/reg_DSC-0014-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6750/reg_DSC-0024-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6750/reg_DSC-0036-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6750/reg_DSC-0037-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6750/reg_McCallugh-Gultch-041-27121.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6750/narrow_DSC-0011-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6750/narrow_DSC-0012-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6750/narrow_DSC-0019-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6750/narrow_DSC-0022-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6750/narrow_DSC-0027-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6750/narrow_DSC-0028-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6750/narrow_DSC-0032-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6750/narrow_McCallugh-Gultch-025-27121.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6750/narrow_McCallugh-Gultch-039-27121.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mccallum-gulch-near-parrsboro-ns-6750",
    "stats": {
        "Activities": "climb hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 5,
        "Time": "3 hrs",
        "Total Distance": "7 km",
        "Town": "Parrsboro, NS",
        "Type": "out-and-back"
    },
    "title": "McCallum Gulch",
    "trail_id": "6750"
}