{
    "description": "The Salt Marsh Trail is part of an old train railroad that has been transformed into a great part of the \"Trans Canada Trail\". The trail provides a straight easygoing adventure for hikers and bikers alike. This trail is also a good option for cross-country skiing in the wintertime.\r\rFor some people a short walk out to one of the many bridges and back will be a great adventure, you will get to see the great salt marsh, smell the costal air and take in some beautiful panoramas. Others that are up for more of an endurance challenge can make the round trip of the trail of 13km or the one-way trip of 6.5km. There are markers for every kilometer of this trail to help you keep an idea of how far you have traveled.\r\rThe trail is in very good shape and all the bridges are quite stable making this a great place to bring the family. You are sure to see some costal birds and also maybe some boats and clam diggers, depending on the tides when your there.",
    "directions": "From Dartmouth take Cole Harbour Road going east on Highway 207. Then take Bissett Road, it will be on the right hand side of the road. Travel along Bissett Road  until you reach a parking lot on the left hand side of the road. This parking lot has a trail that leads to the beginning of the Salt Marsh Trail that is a further down the road.",
    "geohash": "dxf",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/6753/reg_DSC-0503-48348.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6753/reg_DSC-0525-48348.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6753/reg_DSC-0533-48348.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6753/reg_IMG-20120928-00053-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6753/reg_IMG-20120928-00055-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6753/reg_IMG-20120928-00056-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6753/reg_IMG-20120928-00057-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6753/reg_image.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/salt-marsh-trail-near-halifax-ns-6753",
    "stats": {
        "Activities": "mtn-bike ski-xc hike",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 5,
        "Time": "4 hrs",
        "Total Distance": "13 km",
        "Town": "Halifax, NS",
        "Type": "out-and-back"
    },
    "title": "Salt Marsh Trail",
    "trail_id": "6753"
}