{
    "description": "Starting at the viewing platform overlooking the Spahats Falls (Wpt 50), descend steeply and visit the base of falls.  Follow N. on the doubletrack behind the platform about 300m to the start of the descent (marked with blue ribbon).  The bridge crossing Spahats leads further S. on the Clearwater R trail. If you follow the submitted track, you will travel up the Clearwater River Tr through mature Cedar and Douglas Fir stands, occasionally allowing you access the Clearwater R.  At the 1st Canyon Bridge, you can either cross the bridge and continue N. into the valley or ascend a moderate to steep double track bringing you back to the highway. If you stashed a bike at the 1st Canyon trailhead, its a quick 3km back to the Spahats Falls turnoff.  Be sure to enter the road leading into Shaden lookout parking (Wpt 54) and travel the 1km or so of doubletrack along the cliffs to the Spahats lookout and parking.\r\rAll trails are moderately well maintained and the bridges are in excellent condition.  Some technical scrambling to get under the falls, and some scattered blowdown.  Amazing views and interesting landforms.  And watching the paddlers on the river.\r",
    "directions": "Spahats Falls turnoff is well marked; drive 10km north on Clearwater Valley Rd into the start of Wells Gray.  Info center is available at the turnoff from Hwy 5.  The trailhead of the 1st Canyon is another 3km North on the pavement, not well signed but the double track is hard to miss, beginning South just below the turnoff.",
    "geohash": "c34w",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/6757/reg_Spahats-Trail-002-21577.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6757/reg_Spahats-Trail-009-21577.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6757/narrow_Spahats-Trail-004-21577.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6757/narrow_Spahats-to-1st-Canyon-21577.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/clearwater-r-spahats-cr-to-1st-canyon-near-clearwater-bc-6757",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "7 km",
        "Town": "Clearwater, BC",
        "Type": "out-and-back"
    },
    "title": "Clearwater R - Spahats Cr to 1st Canyon",
    "trail_id": "6757"
}