{
    "description": "Here is a description of a hike that will lead you down a gulch and then to 4 or 5 waterfalls (the last two are about 60feet tall).  This is a good hike to add to others you are pursuing in the same area such as Moose River Gorge or McCallum Gulch.As soon as you leave your car, head down a steep slope though the evergreen forest.  Within 100m you should be able to find a small tributary that flows into the main brook where the falls are located.  Once you reach the main brook, you can go upstream and see a 20ft fall and then make your way downstream to see the remainder of the falls of this hike.  Most of the walking is easy except to go up and down the gulch to reach the stream where the terrain can be somewhat steep.  The vegetation on the slope is mainly mature evergreen and some of the upper part of the ravine has been logged recently.  There are some nice maple and beech trees along the brook and on the opposite bank of the ravine.  You?ve seen the last of the waterfalls once you?ve past two falls of about 50-60ft.  These are not true falls as the water hugs the rocks all the way (no freefall) but there are still beautiful to see.  I would try to see these falls after a rain event or snowmelt since this stream does not drain a large area.UPDATE 2016;  There is an upper fall that I went to see in early June.  It's about 300m upstream of the most upstream of my track in the 90 degree bend. It's beautiful and worth the detour",
    "directions": "Highway 2 to Moose River and turn on dirt road once you have crossed a bridge over the East branch Moose River. Drive up the Cobequid mountain for about 4.4km and turn right on the dirt road. The road continues kind of straight for a while and then turns right at the base of a small sugarloaf covered by evergreen. Continue past the sugarloaf and do not take the road that turns left pass the sugarloaf instead continue in a straight direction. The road continues for a while afterwards but finishes in a cul-de-sac.  Park just before the cul-de-sac and head down into the ravine on your right.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/6759/reg_DSC-0046-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6759/narrow_DSC-0041-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6759/narrow_DSC-0043-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6759/narrow_DSC-0048-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6759/narrow_DSC-0103-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/humming-brook-falls-near-parrsboro-ns-6759",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "2 km",
        "Town": "Parrsboro, NS",
        "Type": "out-and-back"
    },
    "title": "Humming Brook Falls",
    "trail_id": "6759"
}