{
    "description": "It will take a couple of hours to paddle into Hotham Sound from your launch site in Egmont but once you?ve arrived, you will have quite the welcome. Freil Falls, a 1,400-foot tiered waterfall, greets paddlers entering the tranquil Hotham Sound. \n Some of the deepest water on Canada?s coast is right here at the entrance to Hotham Sound. Depths just outside the sound reach down to 2,400-feet which make this an ideal location for the American and Canadian Navy to use for submarine and sonar testing, and they do. This depth also means that as you view Freil Falls, it is likely that you are sandwiched between almost 4,000 feet of water. (2,400 ft. into the deep below and 1,400 ft. cascading from above.) Once you have taken in Harmony Falls, paddle a short distance onward, keeping parallel with the shoreline; you will reach a fantastic paddling playground called the Harmony Islands.\nThe Harmony Islands are a great place to set up camp and use as a base for further explorations of Hotham Sound. Pack your swimsuit on this trip, because the water in Hotham Sound is exceptionally warm for the west coast and there are great spots for a summertime swim. It also isn?t a bad idea to pack a snorkel. Ever wonder what creatures are swimming beneath you as you slice through the water in your kayak? This is a great place to put on a mask and check it our.\nBeyond the Harmony Islands, you can continue paddling north into the sound to pass Syren Point and explore some interesting tide pools in Baker Bay. No matter where you take your boats within Hotham, you will most likely be enjoying some very easy paddling. The Sound?s secluded location, shielded by mountains on all sides, makes its waters some of the calmest around. Even though you will have to paddle through some choppy water in Jervis Inlet on your way to Hotham, we still recommend this trip to beginning paddlers. Gliding across Hotham?s still water is a quick way to fall in love with the ease of maneuvering a kayak.",
    "directions": "The launch point for this trip is at EGMONT, BC, right at the end of Sunshine Coast. \nThere is a public wharf that can be used to launch your kayak, plus you should be able to find rental kayaks around there: do you home work and call ahead a few places.",
    "geohash": "c0zg",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/6764/reg_-MG-9449-6219.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6764/reg_IMG-2305-6219.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6764/reg_IMG-2340-6219.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/hotham-sound-near-sechelt-bc-6764",
    "stats": {
        "Activities": "sea-kayak",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 5,
        "Time": "14 hrs",
        "Total Distance": "50 km",
        "Town": "Sechelt, BC",
        "Type": "out-and-back"
    },
    "title": "Hotham Sound",
    "trail_id": "6764"
}