{
    "description": "NTS Map:92B12.  Located near Victoria BC, Spectacle Lake is a 54-hectare provincial park with easy hiking trails and a small lake used for swimming, canoeing, kayaking, fishing, and in the winter, skating. The lake is fed by many creeks and streams, with marsh-type wetlands along some sections. The lake is stocked with trout, and both eastern brook trout and rainbow trout may be caught. \r\n\r\nThis park is ideal for those with children, and has picnic tables, pit toilets, a boat launch, and a sandy beach at the end closest to the parking lot. The trail that encircles the lake is a wide, well-maintained, easy 2-km hike through shady mature forest, with wooden bridges crossing small creeks. Many trails branch off from the main trail, but we didn't have a chance to explore any of them. Approximately half of the trail is wheelchair accessible; the other half is a narrower trail that climbs and winds a bit more, with some roots across the path. There are many wild strawberry plants along this half of the trail. \r\n There is GPS data attached to this trail (see \"download GPS\"), which if loaded into your GPS can help you find route points.\r",
    "directions": "Spectacle Lake Provincial Park is located 30 km north of Victoria just off Highway 1, on southern Vancouver Island, near the summit of the Malahat. UTM 10U 458573E 5379407N\r",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/677/reg_sp4.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/677/reg_sp5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/677/narrow_sp1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/677/narrow_sp2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/677/narrow_sp3.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/spectacle-lake-trail-near-victoria-bc-677",
    "stats": {
        "Activities": "river-canoe hike mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "2 km",
        "Town": "Victoria, BC",
        "Type": "out-and-back"
    },
    "title": "Spectacle Lake Trail",
    "trail_id": "677"
}