{
    "description": "This is a hike in the upper reaches of the East Branch Bass River near Castlereagh.  Old maps show Castlereagh as some kind of agglomeration with a school and other houses but now the landscape is dominated by old foundations and blueberry fields.  Of course this hike will take you to five distinct waterfalls.  Two of which are located in narrow rock cliffs.\r\rFrom your car, follow the old trail that is flagged.  This old trail will end in a clearing but I found a cutting line at its backend and followed it to the top of the ravine.  From your car to the edge of the ravine, it?s about 700m.  The ravine can be steep in some parts but overall has enough small trees for you to hold on to make your descent safely.  There might be another fall, which I didn?t go to, upstream from this point but I made my way downstream.  The forest on the ravine slope is mainly mature conifers while around the stream it?s mostly deciduous.  The stream is narrow enough that you can skip from boulder to boulder to cross it.  You will need to cross it a few times to go around some deadfalls and rock cliffs.  After about 1.75km you will reach two waterfalls on this stream.  Keep heading on the left side (facing downstream) to avoid the slippery rock cliffs on the other side.\r\rOnce past these falls, you will be at the confluence of the two branches of the river.  Head upstream on the branch located to your right (facing downstream).  As you go up the stream you will be rewarded with three other falls.  I suggest you climb the rocks beside the falls themselves as the rock cliffs are high and narrow and won?t offer you much view to the falls if you scale them.  Also being between these cliffs gives you a much better appreciation of the power of water that has carved the rock faces.  \r\rOnce you are done, scale the ravine by the side of the two waterfalls you saw at first to the top of the plateau.  Then make your way in a direction to the main road.  This will save a lot of time since you won?t have to follow the stream again.  You should probably aim to get to the falls with this route in the first place since there were no large falls to see within the route described above.  Just to warn you, on the plateau there are numerous old trails that you can follow but not all of them will take you back to the road so it is a good idea to bring a compass.\r",
    "directions": "Take highway 2 from Glenholme like you are going towards Five Islands. Take a right on East Montrose Rd (in East Montrose) and turn left on Mines Bass River Rd. On Mines Bass river Rd, turn right on old Castlereagh Rd. Go up the Cobequid mountains and continue on this Rd and park at  45° 29.809'N, 63° 46.183'W",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/6770/reg_DSC-0084-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6770/reg_DSC-0087-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6770/reg_DSC-0089-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6770/reg_DSC-0096-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6770/narrow_DSC-0091-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/castlereagh-falls-near-truro-ns-6770",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "6 km",
        "Town": "Truro, NS",
        "Type": "out-and-back"
    },
    "title": "Castlereagh Falls",
    "trail_id": "6770"
}