{
    "description": "\r\rThis is a trail I have wanted to do for a long time.  I had spotted Sam Higgins Falls on the 1:50000 topo maps and deduced that it must be quite a large fall since only a few waterfalls are marked on the 1:50000 topo in Nova Scotia.  This trail is suitable for all ages and you can take your mountain bike right up to the fall (you will need to ford the river twice with your bike or bushwhack with it for about 200m).  There are four or five distinct waterfalls and although none are very tall, they run between high rock cliffs which make this place very special. \r\rThe first part of the trail (about 1.5km) follows an old road which is now used exclusively by ATVs.  The trail will go up and down some insignificant hills and though some hardwood forest as well as old fields.  Once you get to the river, head upstream.  The main path crosses the river where there are some rock cliffs on the left side.  If you are on foot, it?s easy to make your way up the cliff and though the evergreen forest to the other side.  If you are biking, I would suggest fording the stream as the ATVs do at this point.  As you head upstream you will rejoin a trail on the left (there is an old beat up SUV stuck in the mud at this point).  You go through another mixed forest until you get to Sam Higgins Falls\r\rAt the end of the trail is a large flat area with evidence that people camp here pretty often.  There is enough water to go swimming at the base of the falls.  You can make your way up the cliffs to see some of the other falls but be careful as the cliffs are very steep in some locations.\r\r\r",
    "directions": "Starting in Belmont (near Debert) take Belmont Rd north to Upper Belmont Rd. Turn on Upper Belmont Rd and turn on dirt road located at  45° 29.149'N, 63° 23.627'W.  Drive on the main road for about 2.5km and park where the road does a 90 degree turn.  Follow the ATV trail on the left side?\r",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/6771/reg_DSC-0109-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6771/reg_DSC-0117-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6771/narrow_DSC-0098-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6771/narrow_DSC-0102-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/sam-higgins-falls-near-truro-ns-6771",
    "stats": {
        "Activities": "mtn-bike hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "6 km",
        "Town": "Truro, NS",
        "Type": "out-and-back"
    },
    "title": "Sam Higgins Falls",
    "trail_id": "6771"
}