{
    "description": "Trail for hiking or for horses from Anzac forest road 5.2 km into a small lake inaccessible by road. Lake is 2.8 km long with not bad fishing, and plenty of wildlife viewing opportunities. Trail winds its way along a valley mostly hugging the side of a hill. Tall old growth trees in this valley interfere with GPS signals on older units, however newer Hi-Sensitivity units still work well. \nCloser to the lake the trail is more in the open, allowing for good signals. The trail will cross a creek then wind it's way through a patchwork of large meadows. Pay attention to your GPS here as the meadows have a maze of heavily traveled game trails here that lead in all directions. Easy to get on the wrong one. Shortly after leaving the meadow area and when still about 400m from the lake there is an unmarked side trail that is easy to miss, which leads to an old trappers cabin. \nThe bears and squirrels have had their fun in it, however with a little effort it can be cleaned up enough for emergency use, with a serviceable wood stove and a large supply of canned food. When approaching the lake shore you can often find moose grazing in the tall grass. The far end of the lake also offers great moose viewing opportunities with a very heavily traveled game trail crossing over to another small lake. Wolves can often be spotted along here as well, be caution should be used due to a large bear population.",
    "directions": "Follow forest service roads to Anzac forest road. The Topo Canada mapset has all these roads on them however, it will try to route you on the old overgrown road along the river. Continue on the Colbourne road past this point and it will route you onto the newer Anzac road. Go 6.7km along this road and you'll find an old large cut block on the north side of the road. Park here and hike to the far edge of the cut where the trail track starts. It is difficult to find this trailhead without the GPS track.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/6774/reg_CIMG0225-28621.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6774/reg_imgp6791-28621.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6774/reg_imgp6804-28621.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6774/reg_imgp6813-28621.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6774/reg_imgp6841-28621.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6774/reg_imgp6857-28621.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/destilita-lake-trail-near-prince-george-bc-6774",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "11 km",
        "Town": "Prince George, BC",
        "Type": "out-and-back"
    },
    "title": "Destilita Lake Trail",
    "trail_id": "6774"
}