{
    "description": "NTS Map:92B6.  The 3 kilometre beach trail from Ogden Point to Clover Point passes Holland Point, Glimpse Reefs, Finlayson Point and Horseshoe Bay; some of the most scenic areas of Victoria. Most sections of the trail are easy to pass at low tide, but at high tides become more of a scramble and difficult for children. The trail starts off along a sandy beach, then into alternating rock cliff sections and cobble beaches, ending in the spectacular curving beach as you near Clover Point.\nThere are many access points to the trail that provide easy ways to go around areas that may become impassable due to tide, weather, or mud. The access points are level crossings onto a paved trail that roughly parallels both the beach and Dallas Road.\nStarting at the far west end of the trail from the Dallas Road seawall is only possible at low tide; alternate high tide access is available 200 metres to the east. At Clover Point, you can return to Ogden Point along the beach trail, by following the foot path along Dallas Road, or by circling through Beacon Hill Park and then south down Douglas street to meet with the paved path or a set of stairs back down to the beach trail.\nThis trail is a great way to get used to the beach hiking conditions that you will encounter on the Juan de Fuca Marine Trail. \n There is GPS data attached to this trail (see \"download GPS\"), which if loaded into your GPS can help you find route points.",
    "directions": "At the foot of Dallas Road sea wall at Menzies Street",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/678/reg_dr5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/678/narrow_dr1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/678/narrow_dr2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/678/narrow_dr3.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/ogden-point-to-clover-point-near-victoria-bc-678",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "2 km",
        "Town": "Victoria, BC",
        "Type": "out-and-back"
    },
    "title": "Ogden Point to Clover Point",
    "trail_id": "678"
}