{
    "description": "Waterfalls, natural landbridges, massive bluffs, caves and the Kettle (a favorite section of rapids for paddlers on the Clearwater R) - this section of the Clearwater River trail network has a bit of everything.  Trail grades vary from rolling flat to boulder and talus hopping to steep decents/ascents into and out of the Clearwater River valley.  It is best to give yourself most of a day to enjoy all the little side trails.  \r\rMultiple access points exist (i.e. the Kettle access from the Clearwater Dump Rd and the Landbridge Trail access from a trailhead on the Clearwater Valley Rd) so you can enjoy these trails in sections if you wish.  As the photo above indicates, there are very steep descents and ascents into and out of the river valley - proper footwear and being reasonable fit is a must.\r\rTrail sections between Wpt 16 & 17 and between Wpt 21 & 26 (as of May 15, 2010) have not been cleared for some time and there are poorly marked sections and deadfall scattered throughout.  Note that the overlapping trail sections between Wpt 24 & 25 are necessary as Spahats Cr has been known to change its bed and block the lower trail.",
    "directions": "The parking lot at the Spahats Falls is 10km north up the Clearwater Valley Rd.  The turnoff is very well signed.  The trail that descends down to the base of the falls is approx. 250m along a doubletrack trail behind the lookout platform and is marked by blue ribbons.\r\rThe Candle Cr (Triple Decker Falls) trailhead is approx 4.4km  along the Clearwater Valley road from the Hwy 5 turnoff.  Park behind the concrete barrier and the trail is marked by a large yellow caution sign.\r\rThe Landbridge trailhead is approx 8.7km, between the Candle Cr trailhead and the turnoff to the Spahats Falls.  The trailhead is very poorly but a bit of searching at Wpt 19 will reveal the trail.",
    "geohash": "c34w",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/6787/reg_Clearwater-River-Trail-005-21577.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6787/reg_Land-Bridge-012-21577.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6787/narrow_Clearwater-R-Candle-Cr-to-Spahats-Cr-21577.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6787/narrow_Clearwater-River-Trail-001-21577.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6787/narrow_Land-Bridge-008-21577.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/clearwater-r-candle-cr-to-spahats-near-clearwater-bc-6787",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 4,
        "Time": "5 hrs",
        "Total Distance": "11 km",
        "Town": "Clearwater, BC",
        "Type": "out-and-back"
    },
    "title": "Clearwater R - Candle Cr to Spahats",
    "trail_id": "6787"
}