{
    "description": "Little Habour, near Lake Charlotte, NS\nMid May, 2010 was the Atlantic Paddle symposium date, and the location was near Lake Charlotte, Nova Scotia. It was the perfect spot for a wide collection of on the water clinics for white water, flat water and open ocean skills building.  Little Harbour was the spot for Rock hopping, and our prime spot due to the semi harsh conditons was Little Bald Rock right off the edge of Porter's Island.\nRock hopping essentially is the play of paddling your boat in and around rock gardens, and in some cases, up and over ledges with and without the assistance of ocean surf.\nWe had two groups launching at the warf a Little Harbour. Our group went North-West toward Porter's Island. There we had shelter from the 30K winds and waves for some training in bow rudder work. It's a great technique for turning in tight spots with minimal slow down. \nAfter some session work, we headed out to Little Bald Rock and found gaps and ledges to play in and around.  It was a lot of fun to watch some of the crew plant their boats right up on the rocks, and seal launch off the back side. I'm always fearful of tipping over during the last moments, so I stay away from most things above sea level. Some rocks were covered with enough sea weed that they would treat the nicest of composite hauls with care.\nThe area consists of an archipelago of small islands that could make a rock garden tour ideal on both calm and harsher days. Where we paddled, there were numerous places to get off the water.\nLittle Harbour Head is somewhat shallow, so be mindful of lurking rocks just at or below the water surface. Tidal change is minimal.\nShannon Burt\nEast Coast editor",
    "directions": "This area is off route 7 along the coast East of Jadore, around Clam Harbour.  Clam Bay is the primary area. Look for Beech Hill Road, sea side (right), and follow it South East. It turns into West Ship Harbour Road, and then to Little Harbour Road. Look for the fishing warf.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/6788/long_IMG-1286-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6788/reg_IMG-1278-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6788/reg_IMG-1279-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6788/reg_IMG-1281-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6788/reg_IMG-1282-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6788/reg_IMG-1285-6702.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/little-harbour-rock-hopping-near-lawrencetown-ns-6788",
    "stats": {
        "Activities": "diving sea-kayak",
        "From": "",
        "Seasons": "summer",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "5 km",
        "Town": "Lawrencetown, NS",
        "Type": "out-and-back"
    },
    "title": "Little Harbour Rock hopping",
    "trail_id": "6788"
}