{
    "description": "Note: GPS doc only includes the waypoint.\r\nClam Harbour Beach is a public beach area, where, given the right winds and wave conditions, will give you great sea kayak surfing. We visited the area in mid May 2010 during their Paddle Symposium. The day 1's morning session was an intro to kayak surfing. With Wetsuits a plenty, we were off to play in the relatively moderate to mild surf. (Hey, you can't plan the conditions, but you can make the most of them)\r\nWe enjoyed playing on 2-3 foot crashers, first learning how to \"bongo surf\" in the frothy stuff where you lean into the wave with a brace, and simply ride the wave safely into shore. Afterwards, we learned how to really take advanage of the waves for fun, speed and thrills.\r\nThe strategy is to make the waves work for you, so with the right timing, and understanding that waves come along in sets, you start to paddle very hard as you feel a wave coming. As the instructor says, switch to the PLF mode, and just give 'er. When you really get good, it takes two solid padel strokes to get on the wave. Sometimes leaning forward is all it takes to get from being just behind the wave to being in that sweet spot, and being continuously pushed on the forward slope of the wave. That's THE place to be.\r\nWe also learned sturn rudder manouvers, how not to put your limb joints into danger with over extensions, and when simply to let the boat ride it out naturally.\r\nFor safety, we created our surf zone area, and exit ramps to redue the risk of people T-boning thier kayaks into one another. A lesson I could have learned years ago when the nose of one in coming boat cracked the side of my plastic boat. You learn either from experience or from awesome advice at clinics such as this one.\r\nClam Harbour Beach offers a 3.5K crescent of surfable coast line with safe sandy runouts. \r\nThere were plenty of shallow capsizes, rolls and sand digging as people had a hoot on the waves.\r\nNote that this water is cold, and wetsuits make the worry less of a concern. Helmets would be strongly recommended as well.\r\n \r\nShannon Burt\r\nEast Coast Editor\r",
    "directions": "\r\nAlong Route 7 running East past Lake Charlotte, take Beech Hill Road on the right. This turns into West Ship Harbour Road, and then Clam Harbour Road as it continues South East. Eventually, on your right, you'll come to Beach Road, and during the off season, the entry points are gated. We parked by the second gated enterence, and hiked our kayaks 200 meters to the beach.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/6789/reg_surf1-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6789/reg_surf2-6702.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/clam-harbour-beach-kayak-surfing-near-lawrencetown-ns-6789",
    "stats": {
        "Activities": "river-kayak sea-kayak",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "3 km",
        "Town": "Lawrencetown, NS",
        "Type": "out-and-back"
    },
    "title": "Clam Harbour Beach kayak surfing",
    "trail_id": "6789"
}