{
    "description": "A 5 - 8 km moderate climb hike with fantastic views of the Okanagan Valley, Kelowna City, almost up to Vernon and down to Penticton. Several small parking areas allow you to leave your 4WD along side this service road. So you can make it a fulldays hike from the bottom, or a short 2 hour hike if you park at the lower communication towers or anything in between. The 2WD parking area sits at about 500 meters, while the top is 1286 meters.\nIf you start at the 2WD parking area (with all the dirtbikers) you hike for 1 km in open area on the 4WD road. At the 1st switchback that takes the 4WD road to the right, hike straight up onto a trail and into the open forest/shrubs. It is quite a steep hike for 500 meters but levels out at the top. Occasional open areas give you better and better views as you get higher. Notice the powerline that goes up the mountain on your lefthand side and use it as a guide toward the top.\nAt the top you can even follow the powerline, but we used more the trails. When you get to the rockface near the top, follow to the  left at the base of those cliffs, for 200 meters through some shrub. You'll see a crevace that you can climb easily without any climbing gear. Be careful of some prickley rosehip bushes as you hang on to some of the shrubs for some support. At the top of the crevace the mountain levels out and the forest gives way to plain rocks and bolders. Follow the powerline approximately and after a little dip again trough some nice big trees and a little gully, you should be able to see the towers up at the top. Also be careful of those tiny little cactuses if you take a dog with you, afterall its the Okanagan. At the top (1286 m) you have a 360 degree view of the Okanagan Valley and all the way up to BigWhite. Downhill we took the 4WD service road which is easy to follow and takes you to where you parked your vehicle..",
    "directions": "From Kelowna head on Hwy 97 South over the bridge. At the first traffic light turn right (Westside Road). Or from Westbank head north till you start going downhill toward the lake. Turn left at the traffic light (Westside road). On Westside Road head north for 8.4 Km. As you go up the hill toward Traders Cove, turn left onto Bear Creek Main (thats what it shows on the roadsign) even if Google Maps call it Lambly Creek Road. Drive for 2 km on this logging road and then turn right on Blue Grouse Road. (No sign). 2WD vehicles will have to park after 200 meters on this dirt road. 4WD vehicles can drive up the mountain as far as they want, or better as far as you would like  to hike. \nWe parked at the first switchback, since from here it is where the trail starts. At the lower part the mountain is crisscrossed by dirtbike trails, up higher those disappear.",
    "geohash": "c2",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/6790/reg_012-27777.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6790/reg_013-27777.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6790/reg_015-27777.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6790/reg_019-27777.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6790/reg_025-27777.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6790/reg_030-27777.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6790/reg_031-27777.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6790/reg_032-27777.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6790/reg_033-27777.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6790/reg_036-27777.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6790/reg_037-27777.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6790/reg_038-27777.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6790/narrow_001-27777.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6790/narrow_006-27777.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6790/narrow_007-27777.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6790/narrow_008-27777.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6790/narrow_009-27777.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6790/narrow_010-27777.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6790/narrow_011-27777.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/blue-grouse-mountain-near-kelowna-bc-6790",
    "stats": {
        "Activities": "mtn-bike hike climb",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 5,
        "Time": "5 hrs",
        "Total Distance": "8 km",
        "Town": "Kelowna, BC",
        "Type": "out-and-back"
    },
    "title": "Blue Grouse Mountain",
    "trail_id": "6790"
}