{
    "description": "The Eatonville Day Use Park is a very scenic and diverse area located on the northern part of Cape Chignecto Provincial Park. It opened during the summer of 2009. The Park boasts two new hiking trails along with an Interpretative Centre and lots of areas to picnic ? all of which you can explore in one day. The Interpretative Centre which is open from mid-May to mid-October is fully self-sustaining and provides visitors with information and interpretive displays on the historical and geological significance of the area. Washroom facilities are available as well as a large parking area.We visited the park just one week prior to opening for the season in 2010 and although it was a cool and blustery day, we enjoyed having the whole park to ourselves. When closed,the park is gated and locked so we simply parked our car at the gate and made the 1km walk in.The two main trails can be accessed just outside the door of the Interpretative Centre. Although they are relatively short (a mere 7km in total), it is amazing what you see along the way. One trail takes you out to awesome views of Andersons Cove, Eatonville Harbour and the famous Three Sisters. You may or may not know the Three Sisters have been a long-time highlighted geological feature of Cape Chignecto and are shrouded in historical folklore. It is only since these trails opened that the Three Sisters became easily accessible to the general public. The second trail takes you out to Squally Point. Squally Point boasts an ancient raised beach that was created during the last ice age. It sits atop a cliff which descends straight down to the rocky shore below.Here you also get more views of Andersons Cove and Eatonville Harbour. Both trails are well-developed with lots of signage, areas of rest, boardwalks and engineered look offs with an array of vistas. My only disappointment with these trails is that they are more like roads than hiking trails. I understand the goal is to have them accessible by wheelchair which is wonderful but I?m hoping the ?road look? to the trails will eventually make way for narrower pathways that are more natural looking while still maintaining a smooth surface for those with physical disabilities.Although definitely off the beaten path, we really enjoyed our afternoon at the Eatonville Day Use Park and are very much looking forward to returning.",
    "directions": "From Parrsboro, travel West on Hwy 209 towards Advocate Harbour. You will pass through the small town of Advocate Harbour and also the entrance to Cape Chignetco?s Information Centre on the bottom end of the park. Continue up Hwy 209. When you reach the community of Apple River, look for the West Apple River Road on the left. Take the West Apple River Road as far as you can go (a good 10-15kms). You will eventually see the sign for the Eatonville Day Use Park and continue up that gravel road until you reach the parking lot.",
    "geohash": "f81f6",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/6791/long_Chig7-22378.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6791/long_Chig8-22378.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6791/long_chig1-22378.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6791/reg_Chig10-22378.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6791/reg_Chig3-22378.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6791/reg_Chig4-22378.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6791/reg_Chig5-22378.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6791/reg_Chig9-22378.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6791/narrow_Chig2-22378.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6791/narrow_Chig6-22378.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/eatonville-hiking-trails-cape-chignecto-near-parrsboro-ns-6791",
    "stats": {
        "Activities": "snowshoe hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 5,
        "Time": "3 hrs",
        "Total Distance": "8 km",
        "Town": "Parrsboro, NS",
        "Type": "out-and-back"
    },
    "title": "Eatonville Hiking Trails - Cape Chignecto",
    "trail_id": "6791"
}