{
    "description": "This is a nice little hike to a 50 foot waterfall which will only take you less than 20 minutes to reach and back to you car.  The hike is located just a few kilometers off highway 104 in Marshy Hope and is a good distraction on a long drive.\r\rI parked at the end of the road in a large clearing.  The road/trail continued but got very narrow.  It looks like ATV would use that part of the trail.  You continue on the trail for a minute or two and then come to a Y intersection.  Take the trail to your left.  The forest in this part is mainly immature to mature evergreen.  The trail is well maintained and would be fun with a mountain bike.  The trail descends a slope for the next few minutes.  You will see another trail to your left.  Don?t take it but continue on the main trail as it continues to descend a slope.  You will then enter a very nice deciduous forest with some large mature beech and maple trees.  You will hear the fall before you see it.  It is located about 20m from the trail to your left.\r\rThe fall is composed of a few different cascades and the rocks are covered by a thick layer of bright green moss which makes it look surreal.  The brook that feeds this fall is not very large so you can expect this fall to go almost dry in the height of a dry spell.\r",
    "directions": "Look and turn on John Munroe Rd off  Highway 104 in Marshy Hope.  Continue on this road up the hill and past a salvage yard.  Take the dirt road to your right at 45° 36.329'N, 62° 12.672'W, and follow it to its conclusion at 45° 36.609'N, 62° 13.430'W.\r",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/6792/reg_DSC-0005-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6792/narrow_DSC-0001-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/bear-brook-fall-near-antigonish-ns-6792",
    "stats": {
        "Activities": "mtn-bike hike snowshoe",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "2 km",
        "Town": "Antigonish, NS",
        "Type": "out-and-back"
    },
    "title": "Bear Brook Fall",
    "trail_id": "6792"
}