{
    "description": "This hike will take you up the hills to the west of Antigonish to waterfalls that have carved a deep gorge into the rock.  The falls are not the tallest in the region but being able to travel up into the gorge is pretty unique and well worth the trip up.\r\rThe easiest way to reach the fall is to follow the edge of the agricultural field located to the right of the stream (facing upstream).  Towards the back end of the field you will find an old road.  Follow this road to another grassy field.  Turn around from time to time to admire the view and also to look at the gypsum(?) quarry close by.  Again at the back end of this field, you will find an old road.  Follow this road as it dips in and out of a small stream.  The forest at this point is composed of mature evergreen and is quite nice and shady on a hot day.  Immediately after traversing that small brook, you will see to your left a large ravine.  You can make your way down the ravine to the stream to admire how the water has carved out a large section of rocks to create fair size cliffs.  Afterwards get back to the road and continue uphill. You will pass a small (8ft) fall at first.  \r\rThe forest will gradually change to one dominated by mature deciduous trees.  Once you reach that section of the forest, continue uphill as the road will fade in and out until you reach a section where the stream has carved a gorge into the rock wall.  I was able to climb beside the stream and into the small little passages where the stream flows.  I call this a gorge but it is in no way comparable to lets say slot canyons but for Nova Scotia it?s pretty rare to see something like that.  Once you?ve reached the top of the last fall and if it?s not summer you should be able to have a very nice view of the valley from your vantage point.  Make your way back to your cat the same way you came in.\r\r",
    "directions": "On Highway 4 (west of Antigonish), take Brierly Brook School Rd to its conclusion on Brierly Brook Rd.  At this intersection you will see a stream to your left (45° 36.492'N, 62° 4.027'W).  This is the stream you will follow up to the falls on its eastern branch.\r",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/6793/reg_DSC-0008-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6793/reg_DSC-0011-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6793/narrow_DSC-0016-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6793/narrow_DSC-0023-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/school-rd-brook-falls-near-antigonish-ns-6793",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall spring",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "5 km",
        "Town": "Antigonish, NS",
        "Type": "out-and-back"
    },
    "title": "School Rd Brook Falls",
    "trail_id": "6793"
}