{
    "description": "This hike takes you up a hill to a nice viewpoint of the town of Antigonish, then through a mature hardwood forest and finally to an impressive 50ft waterfall.\r\rFollow the ATV trail at the end of the road as it follows the power lines and climbs fairly steeply the hills in front of you.  After only a few minutes of climbing you will see a very nice view of the area surrounding Antigonish.  Continue on the trail under the power lines for about 1.4km.  At this point you will cross the headwaters of the stream where the fall is located.  \r\rTurn right at this point, enter the forest and follow that stream.  The forest is mature enough that it?s quite easy to walk beside the brook.  There are almost no deadfalls or small bushes to impede your way.  After a while you will come up to a few small falls and then immediately afterward to the large one.  I made my way down on the left hand side bank (looking downstream) but I had to climb back up a little bit to circumvent the cliffs surrounding the fall.  Once you?ve made your way down to the stream, you will notice how the stream has carved quite a long and sinuous ravine.  \r\rOnce I finished photographing the fall, I noticed some flagging tape and a trail downstream of the fall going further downhill.  I followed this trail, past some ponds and took a right hand turn on a secondary trail (see GPS track).  This trail leads to the back of a house on Douglas Rd.  I went through the forest and back to Douglas Rd to its conclusion where my car was parked.  You can see on my GPS track that going to the fall from Douglas Rd will take a lot less time but I did not know where the fall was located in the first place and that is why I choose to follow it down from the headwaters.  Another option would be to traverse to the stream from Browns Mountain Rd. \r\r",
    "directions": "In Antigonish, take highway 245 towards Malignant Cove.  Turn left on Clysedale Rd and then take another left on Connors Rd.  Park at the end of Connors Rd by the B&B and follow the power lines up the hill.\r",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/6794/reg_DSC-0032-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6794/reg_DSC-0029-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6794/narrow_DSC-0027-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6794/narrow_DSC-0030-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6794/narrow_DSC-0035-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/browns-mountain-fall-near-antigonish-ns-6794",
    "stats": {
        "Activities": "hike snowshoe",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "4 km",
        "Town": "Antigonish, NS",
        "Type": "out-and-back"
    },
    "title": "Browns Mountain Fall",
    "trail_id": "6794"
}