{
    "description": "This is a hike that will take you into the woods and up the hill located at the back of the town of West Lawrencetown near Middleton, Annapolis Co.  There are at least 6-7 waterfalls to see during this hike.After passing the pool, turn right and head to the stream.  Follow it upstream and through the magnificent evergreen forest.  The stream has been carving the rocks here for a while but because of the geology of the region instead of having a tall waterfall, you are left with a lot of smaller falls.  Within the stream and fall areas, you will notice a lot of boulder size rocks everywhere.  The boulders are fun to climb over as you go upstream to see the next waterfalls.  There might be a few large ones that you could do some bouldering but all in all most of them would be too small.  Towards the end of the hike, you will see one or two falls that have large pools at their feet which would be ideal and deep enough for a refreshing dip.Once I made it to the top of the falls, I crossed the forest on the left and went all the way back to Trout Lake Rd and to my car instead of retracing my steps (see GPS track).UPDATE 2017; Fast forward to May 2017...I was hiking up a nearby brook to find some waterfalls and decided to cut at the top of the hill to Trout Brook to revisit some of the falls.   Well it seems all these years ago, I had missed a massive fall located about 200m further upstream of the place I had visited previously.  Not only is the fall massive at about 40ft or so, there are huge rock wall on either side framing it too!  Furthermore, the walk from the fall going downstream is also interesting as the rock walls on either side is made up of large square blocks of granite.",
    "directions": "Exit 18 on highway 103.  Turn left on Elliot Rd and make your way to Lawrencetown.  Turn left on highway 1 and then right on Lawrencetown lane.  Continue straight through highway 201 and as the street is renamed Trout Lake Rd.  Park when you see a sign for pool on your right, 380m, after crossing Highway 201.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/6796/reg_DSC-0899-1--27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6796/reg_P1010012-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6796/reg_P1010016-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6796/reg_P1010022-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6796/reg_P1010027-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6796/narrow_P1010029-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/trout-brook-falls-near-middleton-ns-6796",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "2 km",
        "Town": "Middleton, NS",
        "Type": "out-and-back"
    },
    "title": "Trout Brook Falls",
    "trail_id": "6796"
}