{
    "description": "The beach and weather at Rathtrevor Provincial Park are just a few of the reasons that this is among the most popular parks on Vancouver Island. On a low tide the ocean recedes almost a kilometre, exposing a 2 km stretch of sandy beach. When the tide rolls in over the hot sand, the warmed water is unbeatable for swimming and saltwater fun. \r\n\r\nStarting from the parking lot at Rathtrevor, you will have either a manageable 150 metre carry to the water at high tide, or a real killer of over a kilometre at low tide. \r\n\r\nHeading almost east from the beach, paddling towards the passage between Mistaken Island and Cotton Point will set you up for a turn to the south when you clear Madrona Point. Heading southeast with the shoreline on your right will take you into Northwest Bay and Wall Beach.\r\n\r\nWall Beach and the entire south shore of Northwest Bay are fascinating for both the rocks and the sea life, and offer many excellent areas for beachcombing. When you have had enough of the Northwest Bay area, you can head back to Rathtrevor Beach or head to Mistaken Island for an extended paddle and more beachcombing. \r\n\r\nKeep in mind that the waters shallow very gradually in this area, so a small change in tide will result in a rapidly changing shoreline and sometimes strong currents on or off the shoreline. The weather can change rapidly in this area, ranging comfortable and sunny to cool and raining and back over the period of an hour.\r\nThere is GPS data attached to this trail (see \"download GPS\"), which if loaded into your GPS can help you find route points.\r\n\r",
    "directions": "Rathtrevor Provincial park is located off the Trans-Canada Highway in Parksville. Alternative but very limited parking (free!) is available at Wall Beach.\r",
    "geohash": null,
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/681/reg_ra1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/681/reg_ra2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/681/reg_ra5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/681/narrow_ra3.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/681/narrow_ra4.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/rathrevor-beach-to-northwest-bay-near-nanaimo-bc-681",
    "stats": {
        "Activities": "river-canoe sea-kayak",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "4 hrs",
        "Total Distance": "12 km",
        "Town": "Nanaimo, BC",
        "Type": "out-and-back"
    },
    "title": "Rathrevor Beach to Northwest Bay",
    "trail_id": "681"
}