{
    "description": "This trail stretches from the Meech Lake side of the Eardley Escarpment, over the top along the old McCloskey Road (Trail #2) to the Western Cabin on the far side of the escarpment, for lunch, views, and then the journey back.  It is a total of 9.33 km, with approximately 200m of elevation gain.\nOut of the parking lot, the trail rises steeply over the first kilometer.  Mountain bikers use this track, so you have to keep an eye out for cyclists hurtling around corners at top speed. As a result, the trail is wide and well groomed for cyclists, even if a bit steep.\nAlong the way, you cross small bridges over the numerous creeks and streams tumbling down the hills.  We also spotted a buck in the forest near the top of the escarpment. \nLunch was at the Western Cabin, with fabulous of of the Ottawa Valley, the river, and Dunrobin on the far side. \nFrom the Western Cabin, we headed back up the trail to the ridge road (Trail #1), and then North to Trail 24 (the McDonald logging trail) to complete our loop back to the trail head.  The trip was just over 9.3km in length, and took us about 4 hours, including an hour stop for lunch at the Western Cabin.",
    "directions": "Head North on Highway 5 from Ottawa.  Take the Chelsea Exit, and turn left toward Camp Fortune across the Highway.  Follow the road for several kilometers until you come to Meech Lake.  Parking Lot 12 is about 4 km from the south end of the lake on the left side.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/QC/6821/long_View-from-Western-copy-29080.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/6821/reg_DSC-0318-29080.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/6821/reg_DSC-0322-29080.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/meech-to-western-near-gatineau-pq-6821",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 3,
        "Time": "4 hrs",
        "Total Distance": "9 km",
        "Town": "Gatineau, PQ",
        "Type": "out-and-back"
    },
    "title": "Meech to Western",
    "trail_id": "6821"
}