{
    "description": "This hike starts off from the Sea-to-Sky Highway, about 50m north of Sunset Marina, and gives an alternative to the road access from the south to Cypress Provincial Park, the Howe Sound Crest Trail (HWSCT) and Bowen Island Lookout. The round trip is approximately 10 km with an elevation gain of 975m. At the beginning, the trail is fairly steep and proceeds through rather uninteresting forest and dense trees (which are very welcome on sunny days, however). Also, the noise from the highway and the sounds of outgoing ferries will follow you for quite some time. There?s one viewpoint (signed!) of Bowen Island on your grunt up. But be patient, the grade will finally ease and the forest you walk in becomes more interesting (some big trees). You?ll cross a small creek on a log, and then traverse the outlet of Yew Lake on a bridge. The trail leads straight ahead to an old logging road, where you take your right. Pass the pump-house, and a few minutes later, the HSCT crosses. You can see the Cypress ski lifts and slopes, as well as the parking area. Take your left here and continue uphill to an old logging road, which the HSCT follows to the left. Shortly after, you?ll arrive at a signboard with trail information. The elevation here is 1035m. For a small variation on your return trip, take the trail to Bowen Island Lookout, which is a bit overgrown but it?s easy to follow the orange flagging tape. From the lookout, a trail descends through the small plantation and leads you on to the pump-house road. From here, you?ll return your ascent route.",
    "directions": "Drive north from Horseshoe Bay on Highway 99 for 5 km to Sunset Marina. Just north of Lawrence Way, park on the west side of the road, opposite a private driveway. Cross the highway to the east side, and walk about 50m north of this private driveway. Go up the old overgrown logging road to a gate (shortly before it, you?ll meet again the private driveway). Cross the gate, walk up the road until you reach two water towers. The trail starts between these two.\r\n\r\nMap: 92 G 06 - North Vancouver\r\n\r",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/683/reg_BowenIsland.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/683/reg_Cypress.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/sunset-beach-trail-near-vancouver-bc-683",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 3,
        "Time": "5 hrs",
        "Total Distance": "10 km",
        "Town": "Vancouver, BC",
        "Type": "out-and-back"
    },
    "title": "Sunset Beach Trail",
    "trail_id": "683"
}