{
    "description": "This is a description on how to get to two beautiful 30ft waterfall in the Eigg River Wilderness area near Baileys Brook.  There is no official trail but you can follow a faint one from the starting point to about halfway to the falls.\r\rAs you leave your car, do not head down to the stream (as I did ? see GPS track). It is better if you can stay on the same contour line and keep going straight through the logged area and then into an evergreen forest.  Once you are in the evergreen forest, the faint trail should be easier to pick up.  Even if you do no see the trail just remain at approximately the same contour.  This is an easy place to walk since there is no underlying brush ion the forest but at the same time it can be kind of an eerie place to travel through.  The area near the stream is hard top travel through as there has been a lot of beaver activity (flooding and alders chocking the stream edge).  After about 1.3km from leaving your car, you need to get to opposite bank of the stream.  The falls are located on the tributary which is on the opposite side of where you have travelled through the evergreen forest.  \r\rAs soon as you cross the brook and head up the tributary, you will enter a nice leafy forest.  There are a lot of boulders on the edge of the stream and a bit of blowdown to cross.  You gradually start to go up the mountain and after following the tributary for 500m you will encounter the first fall.  It is a two tier fall and is surrounded by steep rock cliffs on the right hand side (facing upstream).  On the right hand side there is also a rope to help you go up the side of the fall.  \r\rIf you travel another 200m upstream you will a nice cascade, with the water flowing beside some large boulders and then immediately upstream the last fall.  This fall is quite well worth the hike and again is surrounded by moss and fern covered cliffs.\r",
    "directions": "Exit 29 from the 104 towards Barneys River and turn right on Arbuckle Rd.  Turn right on Baileys Brook/Ardness Rd.  Once you have past the Glendhu Rd (on your right), look for a small road right after a bridge over Vameys Brook.  Turn on the road and follow it to a Y intersection.  Turn to the left at the Y intersection and continue until the road make a sharp 90 degree turn to the left.  Park there and head into the wood as if the road did not do the 90 degree turn?.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/6834/reg_DSC-0078-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6834/reg_DSC-0083-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6834/reg_DSC-0085-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6834/narrow_DSC-0095-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/vameys-brook-falls-near-antigonish-ns-6834",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "5 km",
        "Town": "Antigonish, NS",
        "Type": "out-and-back"
    },
    "title": "Vameys Brook Falls",
    "trail_id": "6834"
}