{
    "description": "The trail from Beryl Gaffney Park in Manotick to Stonebridge Park in Barrhaven is an easy walk.  A 7.3 km round trip with just 40m of elevation gain, this pleasant trail is a favorite for dog lovers and cycling families as it meanders through forests and fields alongside the Rideau River first, and then the Jock River.Begin at the cul-de-sac on Lockview Road in Manotick.  A short 1/3 km walk through a grassy field with views of the river and locks brings you to slight descent and then a walk across a dozen large boulders set as stepping stones into a small stream.  Then walk up the other side, through fields, and past the Rideau Valley Conservation Authority.  At approximately 0.6 km you will cross another bridge over a fairly steep ravine. The path then turns to the right leading through some tall trees, and and emerges onto Hazelwood Way ? a short residential cul-de-sac with just three homes on it?s eastern side. On the other side of Hazelwood, continue along the trail.  At 0.9 km there is a fork in the trail.  You can take the right or left if you prefer.  We usually choose the left, and then take the right on the way back.  Going right will bring you to a viewing bench at the river?s edge.  Both forks rejoin at the 1.05 km mark where there is a bridge crossing another ravine. At 1.5 km, cross another bridge over another ravine.  The trail follows the river until it bears west at the 1.8 km mark, and begins to follow the contour of the Jock River.  The Jock isn?t visible yet, as the trail climbs through a pine forest, crosses a private drive, and then dips back down near Prince of Wales Drive before emerging alongside the Jock.  At 2.2 km, pass under Prince of Wales Drive via a footpath beside the Jock River.From this low point of 81m elevation, the trail climbs to 133m as it follows the Jock on the north side, and passes a cemetary to the south.  At approximately 2.6 km, the trail emerges into a sunny field beside homes in the Stonebridge development.  The first home must belong to an  astronomy buff, as it has not just one, but two astronomical observatories in the back yard.At 2.8 km, the trail crosses another bridge.  Look for the weir in the river which is used to maintain the water level upstream, and without which the Jock would dry to a trickle in the summer.On the other side of the bridge, the trail enters dense cedar forest before emerging about .3 km away.  From here it?s a flat and easy walk to Stonebridge park at the 3.5 km mark, and then we turn around and go back.",
    "directions": "From Ottawa, head south on Prince of Wales Drive toward Manotick.  At Rideau Valley Drive, turn left.  Take the next left, Barnsdale Rd, and then turn left again at Lockview Road.  Park at the cul-de-sac at the end.",
    "geohash": "f241",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/ON/6839/reg_IMG-0473b-31836.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/6839/reg_IMG-2642-53985.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/6839/reg_IMG-2648-53985.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/6839/narrow_IMG-2622-53985.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/6839/narrow_beryl-gaffney-bridge-copy-29080.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/beryl-gaffney-near-ottawa-on-6839",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 5,
        "Time": "3 hrs",
        "Total Distance": "7 km",
        "Town": "Ottawa, ON",
        "Type": "out-and-back"
    },
    "title": "Beryl Gaffney",
    "trail_id": "6839"
}