{
    "description": "NTS Map:92B11.  The Hartland trail system in Mount Wark Regional Park is the first CRD multi-use park area, and is an amazing example of co-operation between municipal government and the cycling community. \r\n\r\nThere is a wide variety of intersecting trails, with difficultly levels and terrain that will appeal to all riders. The difficulty of the trails range from Easiest for the main hardpacked  trail that follows a powerline right of way, to Most Difficult for trails such as Skull Trail.\r\n\r\nThe parking lot has washrooms, a trail map, emergency telephone and topographical map of the trail system. The trails start directly across Hartland Road from the parking lot.\r\n\r\nAfter a short ride from the parking lot, you will encounter a well developed Technical Training area, a map of the area and contact information for local cycling groups. Proceeding along the main trail, numerous side trails branch off to the left and right; most local bike shops carry the South Island Mountain Bike Society map of the trails.\r\n\r\nAlthough the entire trail system has cellular coverage, GPS signals in this area can be quite intermittent, especially when under tree canopies.  There is GPS data attached to this trail (see \"download GPS\"), which if loaded into your GPS can help you find route points.\r",
    "directions": "Pat Bay Highway to Royal Oak Exit. Turn left (right if coming from the ferries) at the traffic lights onto Royal Oak Drive, and then right onto West Saanich Road. Turn left onto Hartland Road; the well-marked parking lot is at the end of the road.\r",
    "geohash": "c28hn",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/684/reg_DSC00672-1-10441.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/684/reg_P2210064-0002-10200.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/684/reg_obey-the-rules--10441.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/684/reg_picasabackground-10441.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/684/narrow_best1_hl1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/684/narrow_hl2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/684/narrow_hl3.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/684/narrow_hl4.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/684/narrow_hl5.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/hartland-trails-near-victoria-bc-684",
    "stats": {
        "Activities": "hike mtn-bike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 5,
        "Time": "4 hrs",
        "Total Distance": "10 km",
        "Town": "Victoria, BC",
        "Type": "out-and-back"
    },
    "title": "Hartland trails",
    "trail_id": "684"
}