{
    "description": "Located on Page Lagoon, Piper's Lagoon Regional Park offers excellent kayaking, hiking and beach combing.  \nA 300 metre man made causeway leads to a small forested island; at the end of the causeway you are faced with a rocky climb to the start of the island's 4 km circular trail system. The trail borders very close to 50 metre bluffs, and can be very slippery on wet and windy days.\nAt low tides, Shack Island is accessible across a muddy flat that is interspersed with oyster and barnacle-encrusted rocks, and liberally coated with sea weed. Shack Island is a step back in time to the days when unserviced island cottages were popular. Although the small cabins are now abandoned, they are in remarkable shape. If kayaking to the island, the west side has several small beaches that are good for landing.\nThe GPS data has two sets of way-points leading to Shack Island; one for kayaks and canoes, the other for hiking. The north side of the causeway is exposed to wake from BC Ferries transiting to and from Horseshoe Bay, and can make for quite interesting launchings on windy days. \nThe west side of Shack Island is exposed to Hammond Bay; heading to the north east, the reefs at Neck Point offer good opportunities to observe seals and the occasional sea lion.\nMap: NTS 92f01",
    "directions": "Turn east at the sign off of Hammond Bay road. Hammond bay road can be accessed by turning right off of TCH, at Woodgrove Mall.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/685/reg_IMG_0630_Large_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/685/reg_IMG_0632_Large_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/685/reg_IMG_0633_Large_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/685/reg_IMG_0635_Large_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/685/reg_NECKY-29183.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/685/reg_best1_pl4.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/685/reg_pl1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/685/reg_pl2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/685/reg_pl5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/685/topo_IMG_0636_Large_.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/page-lagoon-to-shack-island-near-nanaimo-bc-685",
    "stats": {
        "Activities": "river-canoe sea-kayak hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "6 km",
        "Town": "Nanaimo, BC",
        "Type": "out-and-back"
    },
    "title": "Page Lagoon to Shack Island",
    "trail_id": "685"
}