{
    "description": "Starting at the entrance of the Wells Gray Park (just past the Wells Gray golf course and Helmcken Falls Lodge) is the start of Stillwater Trail.  At approx 7km from the Clearwater Valley Rd, you'll reach the junction of the MacLeod Hill Trail.  This trail follows the base of MacLeod Hill, with a small public cabin about 2/3rd of the way to the Murtle River.  After about 8km of travel, you'll reach the Murtle River and the trail that runs back to the Clearwater Valley Rd.  Enjoy the views of Pyramid Mtn and stop and visit the old Majerus homestead and get a feel of what life might have been like at the turn of the century..  At the farm, you can either remain in the Murtle River Trail or turn onto the Blackwater Trail and travel 6.5km back to where you started.  \r\rThese trails are available for use year round.  In the winter, join in the annual Wells Gray Birchleg Loppet and re-enact some Nordic history (http://www.murtlerivernordics.com/birchleg.php).  During the rest of the year, walk, bike or take a horseback tour along part or all of the trails.  There are several other trails that join this network, including the Smith Lake Loop, the Upper Stillwater route, and the Upper Murtle River Trail.  All the trails submitted here are old roads; the Lower Stillwater and the Murtle River Trail are definitely doubletrack trails, while the MacLeod Hill and Blackwater trails are more like very wide singletracks.  Due to access availability and the amount of year-round use, these trails are relatively well maintained from blowdown but don't be surprised to find recent deadfall, lush herbaceous growth, and muddy sections.  \r\rThe amount of time to complete the loop depends on the method of travel.  2.5hr pedaling hard, 3hrs on fast skis, or an overnight trip by foot.  Lots of wildlife viewing opportunities and, during the frost free period, many many mosquitoes.",
    "directions": "Turning off the Hwy 5 onto the Clearwater Valley Rd, the Stillwater trailhead is just before the entrance to the park - about 35.5km.  The start of the Murtle River Trail is just 4.5km further up into the park.  If you wish to bike the loop in the summer and don't desire to finish the trip with 1.5km of 12% adverse grade, drive a little ways down the Stillwater Trail to the junction of the Blackwater Trail.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/6853/reg_Murtle-River-biking-001-21577.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6853/reg_Murtle-River-biking-003-21577.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6853/reg_Murtle-River-biking-004-21577.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/stillwatermcleodmurtleblackwater-loop-near-clearwater-bc-6853",
    "stats": {
        "Activities": "mtn-bike ski-xc hike snowshoe hike",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 3,
        "Time": "3 hrs",
        "Total Distance": "25 km",
        "Town": "Clearwater, BC",
        "Type": "out-and-back"
    },
    "title": "Stillwater/McLeod/Murtle/Blackwater Loop",
    "trail_id": "6853"
}