{
    "description": "Follow trail markers from trail head to Tricouni meadows. During summer this route is very muddy. During winter its very difficult to make it very far up B200 FSR to the trail head. So the best time to attempt this is during spring when the trail head becomes snow free. Which leaves you a nice snow pack to walk on and avoid the mud. Once at the meadows assess your avalanche danger and pick the safest route to the peak. Depending on snow pack melt this route can change weekly or daily.  Play safe.To Tricouni PeakTotal Distance: 14.0 km (return) Estimated Time: 7 hours Average Grade: 13.1% Structure: Linear - Return Elevation Gain:  918 mStart Elevation: 1204 m Max Elevation: 2122 m",
    "directions": "Follow Highway 99 (Sea-to-Sky) a short distance north of Squamish to Squamish Valley Road, directly across from Alice Lake Provincial Park. Turn left on Squamish Valley Road and reset your odometer, following it for 26.5 km. It should be noted that kilometer markers along the route vary wildly and for the most part cannot be trusted - use your car's odometer instead.Eventually the road will turn to gravel and become Squamish River Forest Service Road. Follow it for approximately 2-3 km, ignoring all side roads and passing a hydroelectric power station on the right. Cross over the bridge after the power station and drive past the High Falls Creek trailhead. 1.4 kilometers past the bridge, turn right onto an unmarked road - this is BR200. (total distance approx 28 km Highway 99)Turn right onto BR200 and reset your odometer.2.3 km - stay straight6.0 km - take right (main) fork7.9 km - take left fork9.5 km - road becomes extremely rough, tough 4x4's only past this point10.3 km - end of road / parking / trailhead",
    "geohash": "c2bk",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/6856/long_google1-24018.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6856/long_panoresize-24018.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6856/reg_P1020771resized-24018.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6856/reg_P1020816resized-24018.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6856/reg_topo2-24018.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6856/narrow_P1020769-24018.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/tricouni-peak-winter-route-near-squamish-bc-6856",
    "stats": {
        "Activities": "snowshoe",
        "From": "",
        "Seasons": "spring winter",
        "Stars": 4,
        "Time": "8 hrs",
        "Total Distance": "13 km",
        "Town": "Squamish, BC",
        "Type": "out-and-back"
    },
    "title": "Tricouni Peak Winter Route",
    "trail_id": "6856"
}