{
    "description": "I've listed this as 4 hours but can be done in 2.5 hours. The GPX file is not complete as the batteries died but the trail is well marked along the way. There are you are here maps along the route and trees are marked with yellow and red and you can follow the markers depending on which direction you are trying to go. This is a provincial campground but does not have the traffic that nearby Cape Split receives. There may be lots of cars parked in the lower parking lot but you'll likely find that people are down on the beach, it is worth a visit at the end of your trip. Note that though there are maps along the route it has not been updated for a while and the trail has changed. Due the the changing cliff the trail now takes you through the campground just after the picnic park for a short time before entering into the woods again. There are signs.From http://www.novascotiaparks.ca/parks/blomidon.asp:A 14 km (8.5 mi.) system of interconnected trails provides access to a variety of habitats and numerous scenic look-offs within the park.? Jodrey Trail - The 6 km (3.7 mi.) long trail skirts 183 m (600-ft.) sea cliffs with numerous viewing stations overlooking the Minas Basin. This trail winds through a sugar maple, yellow birch and beech forest and near the park's only bog. At Indian Springs Brook, a cairn commemorates the gift of 162 ha (400 acres) to the park by the late Roy Jodrey.? Look-off Trail - The 1.6 km (1 mi.) long trail offers views of the Minas Basin and Five Islands Provincial Park, 24 km (15 mi.) across the bay.? The Woodland Trail winds 3.2 km (1.9 mi.) through forest habitats of sugar maple, yellow birch, beech, and white spruce and balsam fir.? The Borden Brook Trail - 3.5 km (2.2 mi.), the trail skirts a series of waterfalls while passing through a predominantly white spruce forest.? A short interpretive trail also provides information on the hardwood and softwood forests of Nova Scotia.",
    "directions": "Blomidon Provincial Park is located on Nova Scotia's Fundy Coast, 25 kilometres (15 miles) north of Highway 101, Exit 11. From Exit 11, follow Route 358 to Canning, then proceed through Pereau to the park. Civic address is: 3138 Pereau Rd, Canning.You can park at the bottom of the hill or drive up to the picnic park to access the trail. If you park at the bottom you'll enjoy a steep climb for about 1 km ending at a lovely lookoff/picnic table overlooking the shore and farmland below.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/6859/reg_4540-87146900854-568280854-2316897-3478148-n-26935.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6859/reg_4540-87146980854-568280854-2316911-3226139-n-26935.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6859/reg_IMG-9008-58862.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6859/reg_n568280854-62246-3360-26935.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6859/reg_n568280854-62249-4127-26935.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6859/reg_n568280854-660708-2926-26935.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6859/reg_n568280854-944327-131-26935.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6859/reg_n568280854-944332-1424-26935.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6859/narrow_4540-87146915854-568280854-2316900-6697455-n-26935.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6859/narrow_4540-87146920854-568280854-2316901-6463805-n-26935.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6859/narrow_4540-87146990854-568280854-2316913-6345000-n-26935_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6859/narrow_4540-87147005854-568280854-2316916-2256059-n-26935.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6859/narrow_n568280854-944318-7958-26935.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6859/narrow_n568280854-944344-4581-26935.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/cape-blomidon-near-canning-ns-6859",
    "stats": {
        "Activities": "snowshoe hike mtn-bike",
        "From": "",
        "Seasons": "fall",
        "Stars": 4,
        "Time": "4 hrs",
        "Total Distance": "14 km",
        "Town": "Canning, NS",
        "Type": "out-and-back"
    },
    "title": "Cape Blomidon",
    "trail_id": "6859"
}