{
    "description": "This is a hike located in an area where they have put up some wind turbines on top of the mountains in 2009.  The mountains are part of the Cobequid range although the hills are not as high as in other areas such as Bass River or Five Islands.  However since these hills have been around for a while, the streams flowing around them have had the time to carve out some deep ravines.  This is a description of a hike on the eight mile brook as it flows into the Cobequid Mountains and then a tributary where two falls are located.\r\rI parked at the bridge where the stream flows underneath ?Back Rd?.  On the right there is a road that parallels the stream for about 400m until you get to a wide field.  I suggest crossing the field to the right hand side corner opposite where you entered the field as there is an ATV path there that will lead you to a dirt road (this dirt road probably ends up on the ?Back Rd? which would be another way to tackle this hike).  From the agricultural field, you can sport at least 3 or 4 wind turbines.  Follow this dirt road, passed a metal gate and continue straight until the road ends at the edge of the forest.  Enter the forest and follow the main brook until a tributary flows into the main brook on your right (if facing upstream).  Follow the tributary up to see two waterfalls of about 20ft each.  Go after a big rainfall as this stream does not drain a lake and so it can run dry in the summer.  On the way up you will see that the forest is divided along the stream edge into an evergreen forest on your right and a deciduous forest on your left.  Just before the second fall, you will also notice two large (5ft across) culverts in the middle of the stream.  Unfortunately, these were left there once they were pushed from there original positions upstream.  I was not too surprised then to intersect two different dirt roads in the upper reaches of this tributary.  Even the most remote corners of Nova Scotia have been explored or logged at some point.  \r\rAfter about 2.5km from my car, I walked up the ravine on a dirt road on my right.  This trails climbs steeply through an evergreen forest and then you are rewarded by a magnificent viewpoint where you can see for tens of kilometers in an south-eastern direction.  I could also hear the blades of the windmill clearly at this point and although I did not try to find them, I am sure that some of the dirt roads up there will lead you to them.  Follow this dirt road as it descends rather steeply down the mountain and then back to the area where the steel gate is located.\r\r\r",
    "directions": "Take the Salt Springs exit on the TransCanada highway and turn right on Stillman Rd which is off highway 4.  Turn left on Graveyard Rd and drive to its conclusion on Brookland Rd.  Turn left on Brookland Rd and continue until you turn right on ?Back Rd?.  Drive to where the eight mile brook flows underneath Back Rd.  (Alternatively drive maybe 100-200m farther along the Back Rd and turn left on the dirt road and drive until the metal gate describes above. This will shave off at least 2km from your route).",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/6864/reg_DSC-0019-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6864/reg_DSC-0021-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6864/reg_DSC-0022-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6864/narrow_DSC-0013-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/eight-mile-brook-falls-near-new-glasgow-ns-6864",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "5 km",
        "Town": "New Glasgow, NS",
        "Type": "out-and-back"
    },
    "title": "Eight Mile Brook Falls",
    "trail_id": "6864"
}