{
    "description": "This is a hike on a small tributary of the Six Mile Brook where you will see some small falls (10-20ft), in a magnificent forested setting.  Look closely in the pools of the stream to see some fair size brook touts.  I mean fair size to where they are located since you wouldn?t even think that the stream would support any fish since its pretty small. \r\rAs you leave your car, you will notice some signage on your left just before you cross the bridge.  The sign looks like a wave within a mountain.  There is a single track trail system in this area I was not aware of and it means I need to come back another day to explore.  Cross the bridge and turn left on the dirt road.  Follow it for about 200m.  At this point follow the tributary on your right.  If you complete this hike in time of low flow, you can walk within the brook?s floodplain.  There are a few blowdowns to crawl underneath or jump over but all in all it?s an easy walk upstream.  In numerous areas, it seems the stream is running on a carpet of moss. This is a hike that would be even better after a rain event to see the waterfalls at full capacity.  There are a couple of placed where even the rock walls along the stream edges are covered by a carpet of moss which means that even in the dead of summer heat, this would be a refreshing place to go hiking.\r\r\r",
    "directions": "Take the Salt Springs exit on the TransCanada highway and turn right on Stillman Rd which is located off Highway 4 and continue until you cross the Four Mile Brook Rd.  Continue straight at this intersection and you will soon see a large quarry on your right.  Drive passed the quarry and then take the right hand side at the Y on the road in a wide open area (probably the old quarry footprint).  Drive on this small dirt road until you get to a bridge over Six Mile Brook.  Park before the bridge as it is better suited for ATV?s than cars.\r",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/6865/reg_DSC-0024-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6865/reg_DSC-0027-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6865/reg_DSC-0031-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6865/narrow_DSC-0030-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/six-mile-brook-falls-near-new-glasgow-ns-6865",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "5 km",
        "Town": "New Glasgow, NS",
        "Type": "out-and-back"
    },
    "title": "Six Mile Brook Falls",
    "trail_id": "6865"
}