{
    "description": "This adventure starts at the Heffley Lake boat launch and takes you around the entire perimeter of the lake. The great thing about this trip is that the water is so crystal clear and amazing when there is no wind and a decent amount of sun. It took me just under 3 hours to do the whole thing, but I paddled for 95% of the time without stopping. \r\rThere's a few rope swings, some islands, and an abundance of wildlife, such as eagles, loons, ducks and Canada Geese. For those of you who are into Geocaching, there are some caches in the area and one particularly interesting one under water that you'll have to dive in to retrieve. Paddling in the evening is calm and relaxing - I set out around 6pm and was able to catch a beautiful sunset at the end of the day. It was the end of June and the temperature up there was 17 degrees on  a slightly overcast evening.",
    "directions": "Take the Yellowhead Highway North of Kamloops until you get to Heffley Creek (the same turn-off you would take for going to Sun Peaks Ski Hill). Follow the Heffley-Louis Creek road up the hill until you arrive at the lake (which will be on your right). The boat launch is on the East side of the lake and there is also a campground at the absolute East of the lake.",
    "geohash": "c349",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/6866/reg_Heffley01-25013.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6866/reg_Heffley02-25013.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6866/reg_Heffley03-25013.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6866/reg_Heffley04-25013.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6866/reg_Heffley05-25013.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6866/reg_Heffley06-25013.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6866/reg_Heffley07-25013.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6866/reg_Heffley08-25013.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6866/reg_Heffley09-25013.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/heffley-lake-near-kamloops-bc-6866",
    "stats": {
        "Activities": "river-canoe river-kayak",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 5,
        "Time": "3 hrs",
        "Total Distance": "14 km",
        "Town": "Kamloops, BC",
        "Type": "out-and-back"
    },
    "title": "Heffley Lake",
    "trail_id": "6866"
}