{
    "description": "This trail climbs the Eastern Side of Nadina Mountain, first following an old logging road and then turning into a stream-side path through the woods, and leading up out of the trees. This trail doesn't take you all the to the top of the mountain, just out of the woods but once up there you should have no trouble getting to the top... just keep going up! The trail is marked only by the occasional faded ribbon and some trees with branches bucked off on either side of the trail, but it's definitely followable.  I made sure to take a GPS track of the trail so I'll hopefully be able to add that very soon! \r\rAs I said, the trail takes you just out of the larger trees and then you just keep following your way up the rocky slope, and enjoy the many streams running down as you emerge (this part can be a bit wet!) Keep an eye out for the many mountain sheep/goats that like to hang out up on the mountain!\r",
    "directions": "From Houston, drive down the Ootsa Nadina Road for approximately 40 km. There is an old logging road heading West towards Nadina mountain (junction is at N54d06'53\" / W126d45'34\" ) Follow the old road for 6.5 km - A 4x4 is recommended, but if your vehicle can't get through some of the ruts in the road then you can always hike in or take an ATV. As of June 2009 the road was easily driven in a pickup, but obviously roads CAN change! This brings you to the entrance of the old cut block, now lush with trees. From here park and continue following the road south for about half a km, where you should find the trail starting on the north side of a small creek.",
    "photos": [],
    "source_url": "https://trailpeak.com/trails/nadina-mountain-east-trail-near-houston-bc-6867",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 4,
        "Time": "10 hrs",
        "Total Distance": "40 km",
        "Town": "Houston, BC",
        "Type": "out-and-back"
    },
    "title": "Nadina Mountain East Trail",
    "trail_id": "6867"
}