{
    "description": "The trailhead to Mount Proctor is located adjacent to the information centre on the east side of Fernie (look for a trailhead sign in the parking area). The information centre distributes trail maps published by the B.C. Forestry service and shows the route rather clearly. The approach trails are popular with mountain bikers, and it is reccommended to bring along a bike for the approach.\nThere are two options for the approach: staying low and following the creek (the Fairy Creek trail) or turning to follow the ridge (the Mt. Proctor trail). We followed Fairy Creek and stashed our bikes in the woods after turning at what we thought was Fairy Creek Falls at the 3 km mark. After we started to ascend, following a faint elk trail, we became ensnared in upslope bushwhacking. After consulting with our GPS, it was discovered that we had turned off too early and had not even made it to Fairy Creek Falls! Nevertheless, we pressed on and made it to the ridge after an hour or so of not-so-pleasant bushwhacking. \nArriving on the ridge, we were greeted with pleasant views down to the highway below and could see our destination far off in the distance. Following the ridge, we dropped off a false summit to the col beneath Mt. Proctor and trudged accross snowy slopes, eventually gaining the true summit. From the top there were great views of Three Sisters, Mt. Fernie and accross the valley to the town below. \nRetracing our steps, we followed the ridge back to our bushwhack, descended back to our bikes and had a wild (and very fast) ride back to the cars. I rated this trail as difficult due to the distance to the summit and amount of vertical ascent but it is mostly a hike, with a couple of short pitches of moderate hands-on scrambling along the ridge.\nWe did this as an early season scramble on May 24th/2010 and were able to enjoy beautiful snowy peaks all around (the snow did not hinder our approach). Included is a link with a bit of fun... head-cam footage with my POV cam (drift X170)!",
    "directions": "The trailhead is located in the parking area just at the east side of the town of Fernie (look for the historic oil drilling rig next to the info centre as you drive into town from the east).",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/6869/long_IMG-0049-7490.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6869/long_IMG-0068-7490.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6869/long_resized-IMG-0050-7490.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6869/long_resized-IMG-0058-7490.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6869/long_resized-IMG-0063-7490.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6869/narrow_resized-IMG-0066-7490.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mount-proctor-near-fernie-bc-6869",
    "stats": {
        "Activities": "hike mtn-bike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "9 hrs",
        "Total Distance": "12 km",
        "Town": "Fernie, BC",
        "Type": "out-and-back"
    },
    "title": "Mount Proctor",
    "trail_id": "6869"
}