{
    "description": "This is a fantastic, brand new trail 5-6 km south of Pemberton at the Rutherford Creek power project.  Park on the left side of the site (main site) across the tracks just in from Hwy 99 on the left as approaching from Whistler.  Ride for about 45 minutes up the old logging road that starts right behind all the machinery and worker trailers.  As you are climbing you will see the top part of the trail join the road on the right after 25-30 minutes and the bottom half starts on the left about 5 more minutes up on your left.  After 15 more minutes of steeper climbing you will come to the top entrance (a stone step-up; note: there is more trail farther up if you climb more).  After a few quick minutes of pedalling the trail starts to make its way back down in a hurry.  Lots of very exciting, steep and continuous steep slick rock, drops and sandy descents get you to the road again.  \nTake a few deep breaths and head down the bottom half. (which is further up the road to the left).  Cross the log bridge at the start and enjoy more of the same.  Although the second half isn't as hairy, it is just as flowy as the first half and much more ridable for most decent riders.  The end of the trail spits you out just meters from where you parked.  A great trail that starts and finishes in an enjoyable and memorable loop.  This will be an instant classic in the sea to sky corridor; well done to the makers.  Please note I don't know if the name is accurate or not, but the ride is there and it rocks.\nThere is GPS data attached to this trail (see \"download GPS\"), which if loaded into your GPS can help you find route points.",
    "directions": "20 km north of Whistler or 5 km south of Pemberton.  Turn left at the Kewiit yellow and black sign at Rutherford Creek (just before the creek if approaching from Whistler--it's the main site and camp--see picture) and park on the left hand side of the area.  The trail starts past all the construction and trailers; just follow the deactivated logging road.  This is a must stop trail for all riders passing through, who want a great taste of the area.",
    "geohash": "c2bt",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/687/long_park.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/687/reg_flat.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/687/reg_view.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/687/topo_kurt.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/687/narrow_anitadown.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/687/narrow_markdown.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/phd-near-pemberton-bc-687",
    "stats": {
        "Activities": "mtn-bike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 5,
        "Time": "3 hrs",
        "Total Distance": "6 km",
        "Town": "Pemberton, BC",
        "Type": "out-and-back"
    },
    "title": "PhD",
    "trail_id": "687"
}