{
    "description": "The trail can be broken into 4 sections with the most traveled being the hike to Cape St Lawrence all options involve climbing at least 800ft in the first kilometer after that it eases of, when doing the complete loop it is advisable to carry on past the Cape St Lawrence turn off and proceed to Lowlands Cove, going the other way it can be a bit tricky to pick up the trail inland'\n There are established campsites at Cape St Lawrence and Lowelands Cove \nCape St Lawrence Trail .\nTrail length 5km one way, maximum elevation 850ft. This Trail starts by the Office at the campground (check with office if you plan to leave your vehicle near here) on the gravel road and changes to a narrow track after 150 meters and proceeds up the hill. This is by far the steepest and most challenging part of the hike in the first kilometer you will climb nearly 700ft and pass by a wooden gate and the sign for the Meat Cove Look Off trail to your left, by the time you reach a meadow and corral to your right most of the climbing is finished. About 2 kilometer from the start you will see the side trail to Cape St Lawrence to your right, as of July 09 this was well marked with flagging tape on both sides, it?s the first trial to your right past the meadows of any size and suitable for an ATV or horse and cart originally.\n There are a few well established sheltered campsites at Cape St Lawrence, French Brook \nLowlands Cove Trail\n5km to the coast from the Cape St Lawrence turn off or 7 km from the camp ground.\nInstead of taking the Cape St Lawrence turn off at the 2 km mark keep straight on after another kilometer you will see the Pollets Cove turn off to your left, after about another kilometer you should see the disused road and trail to the abandon zinc mine also to the left (1.5 km), another 0.75 km takes you to an abandoned farm all that remains is a clearing and some farm implements. The trail proceeds gradually down to the coast, the old road bed is washed out at the brook just passed the abandon farm but is easy to cross with dry feet in summer months. The topographic map indicates a side trail to Lowlands Cove Brook starting 0.7 km from the coast, I was day dreaming and totally missed this turn off, judging by the stunning scenery it would be worth locating.\nLowlands Cove Coastal Trail\n3.2 km coastal trail. Just keep a safe distance from the cliff edge and follow ATV and animal tracks along the coast at this time you will be proceeding over open grasslands with great views of the coast and highlands. If proceeding from Lowlands cove the Cape St Lawrence Light and start of the trail to Meat Cove is easy to find, proceeding the other way to Lowland Cove be on the look out for the trail just before the grassy area changes to a wooden area as Lowlands brook is approached, steel posts painted red can be found though out the Lowlands there are a couple located close to where the trail starts inland.\nMeat Cove Look Off\nThis 0.5 km side trail is located 1 km from the campgrounds after a steep climb on a sharp corner where the road crosses a brook. As of July 09 it was clearly marked with a sign, the trail appears new and is clearly marked with flagging tape, as the trail is so new follow the flagging tape or you will easily lose the trail. The trail rises 150ft from its start to a stunning view of the valley and Meat Cove.\nHazards  Other that the short trails around Meat Cove these are back country trails prepare accordingly. as a minimum take water and extra clothing.\nMoose, deer, bears, cattle and horses can be found in the area, the horses are very friendly, pets should be kept under control at all times.\nHunting is allowed in this area, wearing bright coloured clothing is advised during hunting season.",
    "directions": "The trail system is accessed from Meat Cove which is literally at the end of the road, the most northern community on Cape Breton, from the Cabot Trail take the turning to Aspy Bay and proceed north the pavement will run out and the remaining 8km is over a good gravel road that winds its way around the cliffs and valleys, the views are stunning and many tourists come just to drive this section of the road. At Meat Cove the Internet Cafe/welcome center has a large board showing some of the hiking trails, maps of the trails are available inside and the latest information on trails and parking.\nAnother couple of hundred yards takes you to the campsite and another 100 yards takes you to the end of the road and a turn around, to the left can be seen a cart trail this is the start of the trail.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/6880/reg_P1020464-1-26849.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6880/reg_P1020471-1-26849.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6880/reg_P1020473-1-26849.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6880/reg_P1020477-1-26849.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6880/reg_P1020479-1-26849.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6880/reg_P1020485-1-26849.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6880/reg_P1020486-1-26849.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/cape-st-lawrence-lowelands-cove-near-ingonish-ns-6880",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 4,
        "Time": "7 hrs",
        "Total Distance": "16 km",
        "Town": "Ingonish, NS",
        "Type": "out-and-back"
    },
    "title": "Cape St lawrence Lowelands Cove",
    "trail_id": "6880"
}