{
    "description": "This trail offers stunning views of Meat Cove and the surrounding area from a maximum elevation of 1040 feet. It also offers a fantastic cardiovascular workout climbing 900ft in 0.75km. We just took our time with frequent rest stops and had no problems, just know your limitations.\n The ridge of the mountain is over a kilometer long with fantastic views in all directions and great blueberry picking in season.\nThis trail starts a short distance up the road from the Internet Cafe and is marked by a small sign on a tree, and a few stones placed to form steps, the trail climbs steeply nearly 900ft in the first 0.75km and then levels off somewhat. The local community have installed ropes and rebar railings to assist your ascent/decent in the steep sections.",
    "directions": "The trail system is accessed from Meat Cove which is literally at the end of the road, the most northern community on Cape Breton, from the Cabot Trail take the turning to Aspy Bay and proceed north the pavement will run out and the remaining 8km is over a good gravel road that winds its way around the cliffs and valleys, the views are stunning and many tourists come just to drive this section of the road. At Meat Cove the Internet Cafe/welcome center has a large board showing some of the hiking trails, maps of the trails are available inside and the latest information on trails and parking. Park here, the start of the trail is a short distance back up the road you just came down.\nAnother couple of hundred yards takes you to the campsite and another 100 yards takes you to the end of the road and a turn around.",
    "geohash": "f8kgm",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/6881/reg_P1010038-26849.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6881/reg_P1010045-26849.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6881/reg_P1010051-26849.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6881/narrow_77445BBD-EDA9-48B4-8AC7-AAC799F2F30F.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6881/narrow_A19D3119-5E64-4F88-B969-644013D6D946.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/meat-cove-mountain-near-ingonish-ns-6881",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 5,
        "Time": "2 hrs",
        "Total Distance": "3 km",
        "Town": "Ingonish, NS",
        "Type": "out-and-back"
    },
    "title": "Meat Cove Mountain",
    "trail_id": "6881"
}