{
    "description": "The Liberty Lake trail is one of the few official multi day hikes in Nova Scotia, most people  spend 4 days and 3 nights on the trail and park a vehicle at each trail head or arrange lifts. It offers a pleasant walk in the woods with nice campsites on lakes or by brooks away from it all, don't expect to meet many if any fellow travelers in the backcountry part of the trail.\n It is possible to do a complete loop by extending the trip a further 2 days to do this one would have to set up a base camp at one of the campsites close to Big Dam Parking lot and  then drive your vehicle back towards the Eel Weir parking lot a distance that would be a  comfortable day hike back to your base camp, Jakes Landing parking lot would be a suitable  spot. \nStarting from the Eel Weir end of the trail you cross the Mersey river bridge and proceed  up a parks access road, the hiking is easy and you should be able to make good time, the  tree cover is good and you are mostly be in the shade after 7km you will pass campsite 28 after  that it is possible to access some of the lakes in the area by short side trails every few  kilometers or the side trail to Poison Ivy Falls campsite 38.\n After 17km you should come to campsite 37 a convenient first or last night stop, you will quickly  discover that campsite 37 is not a campsite at all but a cabin complete with wood stove and  4 large bunks with plenty of room on the floor for more people. This has looked liked like a 5 star hotel to many a cold, wet and weary hiker.\n  The access road continues until nearly campsite 41 now located at Lucifee Brook (it used to be at Little Red Lake). At this point you enter into the backcountry trails,  your speed will likely drop considerably, vegetation can be waist high either side of the  trail, if the is any moisture present you will be wet from the waist down. The next section  is very pleasant as the trail follows a couple of streams about 3km from campsite 42 you  will enter a wet marshy area, occasionally I've got across with dry feet, often the water is  ankle deep.\n Just past campsite 42 you will find a ranger cabin and helipad, the next section of trail  is probably the least used trail in the park and is slow going with wet marshy sections, from campsite 43 the trail  gradually improves as traffic is more frequent. From campsite 46 to the Stillwater the trail follows an ATV track used by park workers and the going is easy again, the final  section back to the the Big Dam parking lot is a mixture of graveled trails and good unimproved sections. \nDistances\nEel Weir (Mersey River) to Big Dam parking lot - 61km\nEel Weir to Campsite 37 - 17km\nCampsite 37 to Campsite 42 - 16km\nCampsite 42 to Campsite 45 - 14km\nCampsite 45 to Big Dam Parking Lot - 12km \nGPS Waypoints\nEel Weir N44 20.027 W65 12.251\nCampsite 37 N44 18.370 W65 21.148\nCampsite 42 N44 22.970 W65 25.057\nCampsite 45 N44 27.576 W65 20.197\nBig Dam Trail Head N44 26.547 W65 15.222",
    "directions": "Take the No.8 highway to Kejimkujik national park main entrance and after checking in at  the vistors center proceed either to the Eel Weir on the Mersey river or the Big Dam  parking lot. You will require permits for the park and camping from the visitors center,  free maps are available for the main roads and trails although for this kind of trip I  would advise purchasing the back country guide from the visitors center which is a topo map  with all the trails and campsites marked on it.\n  It is advisable to phone ahead and reserve your campsites in advanced.\n Park phone 902-682-2772  website http://www.pc.gc.ca/pn-np/ns/kejimkujik/index.aspx",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/6886/reg_IMG-2394-1-26849.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6886/reg_IMG-2444-1-26849.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6886/reg_IMG-2465-1-26849.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6886/reg_IMG-2472-1-26849.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/kejimkujik-liberty-lake-near-kejimkuoik-park-ns-6886",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 3,
        "Time": "56 hrs",
        "Total Distance": "61 km",
        "Town": "Kejimkuoik Park, NS",
        "Type": "out-and-back"
    },
    "title": "Kejimkujik, Liberty Lake",
    "trail_id": "6886"
}