{
    "description": "This hike is quite short and easily accessible; nevertheless, it takes you close to a wildly leaping and tumbling waterfall that is much better appreciated when you are in its spray than from a distance.\r\rThe section along the north shore of Bow Lake is an easy ramble with open views toward the Bow Glacier and sharply pointed St. Nicholas Peak (the town of that name was the birthplace of Swiss guide Peter Sarbach). Following southwest up the flats of the alluvial fan, you cross a small headland and make your way toward a short but narrow canyon.\r\rBow Glacier Falls originate in a fair-sized lake (unseen from below) that lies in a basin below the receding toe of the Bow Glacier. Photographs from the early 20th century show that the ice once flowed right over the cliffs down which these cascades now drop.\r\rDistance: 4.5 km (2.8 mi) ? Num-Ti-Jah Lodge to base of Bow Glacier Falls\rDay Hike: 1.5 ? 2 hr one way\rElevation Gain: 170 m (560 ft)\rElevation Loss: 10 m (33 ft)\rMaximum Elevation: 2100 m (6890 ft)\rTrailhead: Parking area near end of spur road to Num-Ti-Jah Lodge west off Icefields Parkway, 3.0 km (1.9 mi) north of the Crowfoot Glacier viewpoint and 5.0 km (3.1 mi) south of the Bow Summit junction\r\r0.0 ? Trailhead kiosk (elevation 1940 m). Follow along lakeshore.\r2.6 ? Northwest corner of Bow Lake. Continue over gravel flats, crossing one small headland and aiming for north side of small canyon.\r3.2 ? Climb steeply up narrow path.\r3.4 ? High point above canyon (2010 m) opposite large chockstone forming a natural bridge. Descend to west.\r3.6 ? Edge of moraine basin at upstream end of canyon (2000 m). Take faint path to west towards falls; it soon fades, however, and you are left to pick your way over the rough terrain.\r4.5 ? Base of Bow Glacier Falls (2100 m).",
    "directions": "Trailhead: Parking area near end of spur road to Num-Ti-Jah Lodge west off Icefields Parkway, 3.0 km (1.9 mi) north of the Crowfoot Glacier viewpoint and 5.0 km (3.1 mi) south of the Bow Summit junction",
    "geohash": "c3jjv",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/6887/reg_085-11997.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6887/reg_DSCN4088R5-56032.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6887/narrow_089-11997.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6887/narrow_IMG-0058-11997.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6887/narrow_IMG-0060-11997.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6887/narrow_IMG-0061-11997.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6887/narrow_IMG-0064-11997.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/bow-glacier-falls-near-banff-ab-6887",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 5,
        "Time": "4 hrs",
        "Total Distance": "9 km",
        "Town": "Banff, AB",
        "Type": "out-and-back"
    },
    "title": "Bow Glacier Falls",
    "trail_id": "6887"
}