{
    "description": "This is a forest education hike. There is a picnic spot halfway through the trail beside Dalrymple Creek. \nHere is some history of the trail's namesake, as provided by a user of trailpeak.com (local to the area).\n\"Mr. Dalrymple, after whom the Dalrymple Trail was named, lived in the first half of last century in a snug cabin on the shore of the upper Salmon River, well below where the trail meets the Vancouver Island Highway.   Aptly termed a hermit, he lived miles from the nearest neighbour in a forest, well below this point. \nAt times, Dalrymple could be seen on the dusty gravel roads, walking the 20 miles to the nearest store. Such was the case in the fall of 1951.  My mother, Helen Rosenau, then the only teacher in the only one-room school in the valley, stopped Dalrymple on the road and invited him to Christmas dinner.  He arrived on foot, dressed like a country gentleman, having walked only ten miles.  However, he was one week early.  He did not know the date.  That day was December 18, when our one-room Upper Sayward School, had not yet started Christmas holidays.  We invited him in and he stayed for dinner and enjoyed hearing of his solitary existence.  \nThat evening our family straightened out his dates and invited him again for the real Christmas dinner, seven days later.  He came again the next week, this time to the real Christmas dinner, on December 25, 1951. \nSeveral years later he left the Sayward Valley and moved to the Lower Mainland.  We heard to our sorrow that the change to heavily travelled roads took his life.  He was killed by being run over by a motor vehicle in the late 1950s.  His cabin burned down and the home site returned to forest.  \nThe Dalrymple Trail winds high above the home site,  twisting through a second growth fir forest that was replanted in the pioneer?s time.   The century following Dalrymple added the present great height to the surrounding fir trees.  \n ? Joel Rosenau, Nanaimo, BC \"",
    "directions": "Head 10km south of the Sayward junction towards Campbell River. The parking lot is on your left hand side of the highway",
    "photos": [],
    "source_url": "https://trailpeak.com/trails/dalrymple-creek-trail-near-sayward-bc-6891",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "1 km",
        "Town": "Sayward, BC",
        "Type": "out-and-back"
    },
    "title": "Dalrymple Creek Trail",
    "trail_id": "6891"
}