{
    "description": "This is a nice paddling trip that will take you around a couple of islands in Tangier Harbour and bypass three of the nicest and secluded beaches in Nova Scotia.  You can do this trip in a couple of hours or pack up your tent and stay overnight on one of those beaches.There are countless routes to do around Tangier Harbour but here is the one I did last week.  From the starting point, aim your boat to the left towards Hog/Hen Islands.  I tried to go between those two islands about an hour after high tide and was left to pull my boat for part of the way.  A better way to go is to go around Hen Island and the mainland where the channel is a bit deeper.  After crossing between the two islands, have a look at the nice rock wall on the south side of Hen Island before aiming to paddle along the mainland and towards the wharf you see off in the distance.  Another starting point option is to put your boat in the water by the wharf.  Follow this part of the coastline and you will by pass an area where there is a picnic table located high on a rocky bluff.  A few minutes late you will enter a large cove caller Carryover Cove.  This separates the mainland from Mink Island and as the name suggests you will need to carry over your boat for a few meters over sea grass unless you are there at a very high tide.Once you?ve on the other side of the cove, there is a nice, tall, rock wall to your left as well as a couple of erratic blocs located close to the water.  Going to the right after Carryover Cove, you will enter a long cove that takes you to the middle of Mink Island.  Not much to see in this cove and you could easily bypass it if you are short on time.  To the left of the cove?s entrance (if facing it) is a very nice beach/camping spot.  Continuing from this point you paddle between Mink and Little Irondbound Islands and following the coastline of Mink Island you eventually get to Sandy cove.  This is the nicest beach in the area.  It?s a perfect crescent shape and the sand is very fine and lightly colored which, on a sunny day, will give a turquoise color to the water in the cove. On the day I describe in this post there was a heavy fog cover over all Tangier Harbour.  Instead of leaving Sandy Cove and making my way up to Tangier Island, I crossed the harbour and made landfall on Baltee Island instead.  I?ve paddle this harbour a few times and it can get a dense fog.  Therefore bring a compass and use it!  From the point near sandy cove to Baltee or Tangier Islands, it?s an open water crossing of about 1km.  On a nice day you wouldn?t even think twice about it but on a foggy day you will not have any sightlines to either islands or back to where you came from when you are in the middle of the harbour.  There is an ice spot to rest if you paddle between Tangier Island and Outer Islands.Back to Baltee Island, there are two camping spots.  One is near Baltee Head (south end of the island) while the other is on Romkeys Point.  I?ve camped at the beach at Romkey Point in the past.  You can set up on the beach or there is a spot in the forest at the north end of the beach that?s been cleared to make space for a tent if you think the tide will flood the beach.  On my way back to the car, I went into the passage between Baltee and Inner Baltee Islands and then tried to come back up into Tangier Harbour on the other side of the small island located between the Baltee Islands (see GPS track).  This was a big mistake as the water wasn?t high enough and I had to pull my boat through a muddy/stinky area.  The mud is so thick in the cove that I nearly lost a boot!  Back into Tangier Harbour, I aimed my boat for the point of Hog Island.  All in all this description will take you about 3.5hrs including  quick stops to two of the beaches described above.  I strongly suggest you make some extra time and paddle to Tangier Island as well.",
    "directions": "Take highway 107/7 towards eastern shore from Dartmouth.  Drive all the way to Tangier (about 70km).  Turn right on Masons Point Rd and park by the park at the edge of the water.  There is ample room there to put your boat in the water at high or low tide.  There is also a kayak outfitter located right there so you can rent some boats as well.",
    "geohash": "dxgq",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/6893/reg_DSC-0095-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6893/reg_DSC-0097-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6893/reg_DSC-0098-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6893/reg_DSC-0104-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6893/reg_DSC-0105-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6893/reg_DSC-0111-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6893/reg_DSC-0114-27177_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6893/reg_DSC-0118-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/tangier-harbour-near-halifax-ns-6893",
    "stats": {
        "Activities": "sea-kayak",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "16 km",
        "Town": "Halifax, NS",
        "Type": "out-and-back"
    },
    "title": "Tangier Harbour",
    "trail_id": "6893"
}