{
    "description": "NTS Map:92B11.  The 155 hectare John Dean Provincial Park has five main hiking trails that cross the south and east face of Mount Newton. The 6 kilometres of trails range from wide gravel access roads to narrow hard packed dirt in heavily forested areas. Some sections of the trails are steep moss covered rock faces that will be very slippery on rainy days. The wooden stairs are a bit spongy; use the handrails with caution. Although portions of the trail system can be steep and are geared to more advanced hikers, runners or approach shoes are suitable footwear.\r\n\r\nThis park has some of the largest Douglas fir trees that remain on the south coast of Vancouver Island. Many of the trees are dying, resulting in the closing of many areas of the park and removal of picnic tables and outhouses. The parking lot has bathrooms, but there is no evidence of the water supplies that are indicated on the park map.\r\n\r\nAlthough the parking lot has a topographical map of the park trails, the only sign visible points towards the Illahie trail. The trailheads for Bob Boyd's Climb and Thunderbird Trail are actually located to the north of the parking lot on John Dean Road. The trails can be confusing in this park as they are not well marked; the signs can be described as inconsistent, confusing, and ready to tip over from lack of maintenance. Carrying a compass and map will help you decipher where you are within the park and select your trails accordingly.\r\n\r\nThe GPS data has a tracklog and waypoints that lead in a loop from the parking lot, along parts of the Thomson Cabin, Woodward, West Viewpoint, Skipper's and Illahie trails. GPS coverage is negatively affected by the RADAR sites and the dense foliage in the area, and WAAS coverage is non-existent.\r\n\r\nStarting from the parking lot, cross over the barricaded gravel access road to the north east, and head up the hill to the reservoir, RADAR site, and Abraham Collins look out, where you can catch views of the Saanich Peninsula, the Gulf Islands and the Cascade Mountains.\r\n\r\nPast the lookout, the access road intersects with the Thomson Cabin Trail; a heavily wooded section which skirts around a large fenced RADAR dome compound and passes the decaying remains of a cabin.\r\n\r\nAt the junction of the Woodland, Switchback and Woodward trails, stay to the north west (right) and head towards John Dean's Emerald pool. At the next junction where the Illahie and Woodward trails meet, stay to the left. Branching to the right will take you back to the parking lot on a 5 minute walk if you have had enough.\r\n\r\nAt the next junction, marked as Woodward and Merrill Harror Trails, stay to the north (right). Proceed straight ahead and cross the earth dam at the junction of the West Viewpoint and Valley Mist Trails. \r\n\r\nAt the junction of Skipper's Path and Bob Boyd's Climb, stay to the right. Taking the left path at the next two junctions will take you back to the parking lot.\r\n\r\n There is GPS data attached to this trail (see \"download GPS\"), which if loaded into your GPS can help you find route points.\r\n\r",
    "directions": "Turn west off Hwy 17 onto McTavish Road, head south onto East Saanich Road, and then west onto John Dean Road. Follow John Dean Road until you reach the parking lot.\r",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/690/reg_GarryOakJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/690/reg_MtBakerJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/690/reg_SidneyJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/690/reg_VictoriaJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/690/reg_bayJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/690/reg_map.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/690/reg_map1JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/690/narrow_OakCamasJPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/690/narrow_jd1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/690/narrow_jd2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/690/narrow_jd3.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/690/narrow_jd4.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/690/narrow_map2JPG.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/john-dean-park-near-victoria-bc-690",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 2,
        "Time": "2 hrs",
        "Total Distance": "3 km",
        "Town": "Victoria, BC",
        "Type": "out-and-back"
    },
    "title": "John Dean park",
    "trail_id": "690"
}