{
    "description": "Fisher Peak is the highest and most appealing summit of the Southern Rocky Mountains, it dominates Cranbrook's Eastern skyline. The peak is an outstanding 9336 feet (2846 m) high and offers a panorama view of the Kootenay River Valley and the southern Rockies. The elevation gain from the trail head is approx 4400 feet (1400m). From the trailhead the trail starts an immediate steep grade up the forest covered slopes. The first quarter of the trail follows a creek that flows aggressively down the mountain side. Mid way up the mountain the creek displays a waterfall that pours out of the lower end of the bowl. The creek makes its way under the rocks, as you cross these rocks you can hear the water rumble beneath your feet.After the waterfall the forest cover thins out as the route passes through the subalpine. Here you will most likely be welcomed by many marmots as they peak their heads in and out of the rocks. The alpine will offer a ray of vegetation from mossy rocks to subalpine flowers such as Indian paintbrush. The lower alpine bowl offers excellent camping opportunities surrounded by pools of water from the melting snow. At the back of the bowl there is a steep scree gully north west that offers a route to the ridge. The route is very slick with loose rocks and offers few handholds. Beware of falling rocks coming from above hikers.  Ascend the scree chute to the rugged saddle on the ridge. The ridge is very narrow but provides the first view of the Southern Steeple Mountain range. From here you head north, directly left of the saddle, towards the summit. Look for yellow markers on the side of the rocks that mark the best route to the top, there are approx 4 yellow markers between the saddle and the peak. Do not go around the back end of the mountain (North west side) as it is a very difficult rock climb to the top from here. Stick to the center of the route and follow the yellow markers. From the saddle to the peak it is a 900 foot scramble. The last 200 feet below the peak is the most technical section. Take caution on which route you choose. At the peak there is a metal box with a book for signing. Enjoy the view from the top! Scott Niedermayer brought the Stanley Cup to the top of Fisher Peak after winning the cup with the New Jersey Devils. For more details on this hike and others like it in the Cranbrook area, pick up a copy of ?Mountain Footsteps? by Janice Strong.",
    "directions": "The road requires a 4x4 vehicle with clearance, a standard SUV will work but be careful of tire pinching rocks. Head North on Hwy 95 to Fort Steele, approx 500m after the Fort Steele turn off make a left onto Wardner Fort Steele Rd. 2.2kms down Wardner Fort Steele Rd turn left onto Mause Creek Rd. Keep left on Boulder Creek Rd at 2.3km. At 4km sign marker take right onto Mause Creek. (There are numerous signs to point you in the right direction to trailhead) At 10.1km the Fisher Peak trailhead sign will appear on the left.",
    "geohash": "c2vf",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/6904/long_14-8084.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6904/long_15-8084.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6904/long_23-8084.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6904/long_25-8084.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6904/long_29-8084.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6904/long_34-8084.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6904/long_8-8084_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6904/reg_Scott-8084.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6904/narrow_2-8084.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6904/narrow_24-8084.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6904/narrow_28-8084.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6904/narrow_4-8084.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/fisher-peak-near-cranbrook-bc-6904",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring summer",
        "Stars": 5,
        "Time": "6 hrs",
        "Total Distance": "10 km",
        "Town": "Cranbrook, BC",
        "Type": "out-and-back"
    },
    "title": "Fisher Peak",
    "trail_id": "6904"
}