{
    "description": "A loop hike mostly through the forest on old roads. The only scenic spot is \nat the lookout and the best view point is about to become inaccessible. Due \nto recent events at lookouts around the province, the residential area is \nbeing fenced off with cameras added for security.  Hence this will eliminate \naccess to the best view point. \nStarting with Whiskey Jack Trail head east to connect with Fire lookout \nroad. Past the Lookout continue down to the creek and eventually connect \nwith Hydro Line trails that head to Elk Pass. We followed the Hydo line \nmostly from Elk Lakes parking back to Bolton Creek but missed one turn \nand ended up next to the road for about 300 meters.\nThis would probably make a better ski trip than hike. There were a few \nbikers on the trail too. There is one creek crossing where you may get wet.",
    "directions": "Peter Lougheed Provincial Park - west of Calgary about 50-60km to Hiway \n#40 going South (Kananaskis Trail).  Drive South on #40 for 50km to park \nentry.  Follow road until you see parking lot for Bolton Creek Trading post. \nTrail starts behind the trading post. \nStart on paved trail. Head east to Whiskey Jack trail.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/6909/reg_DSC00049-7279.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6909/reg_IMG-1523-7279.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6909/reg_IMG-1527-7279.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6909/reg_IMG-1531-7279.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6909/reg_IMG-1534-7279.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/kananaskis-fire-lookout-loop-from-bolton-creek-near-kananaskis-ab-6909",
    "stats": {
        "Activities": "hike ski-xc mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 2,
        "Time": "5 hrs",
        "Total Distance": "15 km",
        "Town": "Kananaskis, AB",
        "Type": "out-and-back"
    },
    "title": "Kananaskis Fire Lookout loop from Bolton Creek",
    "trail_id": "6909"
}