{
    "description": "NTS Map:92K3.  Located on the east side of Quadra Island at Drew Harbour, Rebecca Spit Provincial Marine Park is a popular destination for both waterborne and land based activities. The 2 km long narrow hook of land has long stretches of beach on the west and east sides. An extensive system of trails runs along both sides of the spit, making this an ideal place to bring the family for a day on the water. The west shore of the spit has warm shallow water and sand beaches.  The east side beaches consist of a mix of cobble and sand, and have a large amount of driftwood. Park facilities include picnic tables, fresh water, pit toilets and a large gassy playing field.\r\n\r\nThe nearest camping is a 140-site campground operated by the Cape Mudge Indian Band. The campground is located near the park entrance.\r\n\r\nKayaks and canoes can be easily launched from both sides of the spit; the walk from the parking lot to the shoreline ranges from 30 to 50 metres depending on the tide. There is a boat launch ramp located at the south end of the parking lot.\r\n\r\nDeparting from the sandy west shore of Rebecca Spit, the sheltered shallow water of Drew Harbour is ideal for observing many types of sea life or an introductory lesson for kayaking.\r\n\r\nHeading north, stay clear of the Heriot Bay ferry terminal and the east side of Heriot Island as you head into Hyacinth Bay.  Rounding Hyacinth Point, you enter Open Bay, with many rocky areas containing an abundance of sea life. Although the shoreline is mostly rocky, there are a few small patches of small cobble and sand that make for good landing points at low tide. The shoreline of Open Bay is a good area for hiking, and to catch a quick snack or lunch.\r\n\r\nFrom Open Bay, a small unnamed island visible to the north east provides shelter from Hoskyn Channel. The passage between Quadra and the small island is navigable at all but the lowest of tides; however, the water does shallow rapidly near the shoreline and rocks are covered by bull kelp. Hoskyn Channel can be a busy area with recreational and fishing boats transiting at high speeds.  To the south, the west side of the Breton Islands is another interesting place to check out the sea life or land for a quick beach walk.\r\n\r\nReturning to Rebecca Spit, you can either land back at your starting point or explore the exposed east shore of the spit. A short walk and an easy carry from the east shore takes you back to the parking lot.\r\n There is GPS data attached to this trail (see \"download GPS\"), which if loaded into your GPS can help you find route points.",
    "directions": "Quadra Island can be reached via a 10 minute long BC Ferry trip from downtown Campbell River. From the Quathiaski Cove ferry terminal on Quadra, a 15 minute drive following signs to the Cortes Island Ferry (Heriot Bay) and the park will bring you to the entrance.  \r",
    "geohash": "c0y",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/691/reg_rbs4.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/691/reg_rbs5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/691/narrow_rbs1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/691/narrow_rbs2.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/rebecca-spit-to-open-bay-near-campbell-river-bc-691",
    "stats": {
        "Activities": "river-canoe sea-kayak hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 5,
        "Time": "6 hrs",
        "Total Distance": "0 km",
        "Town": "Campbell River, BC",
        "Type": "out-and-back"
    },
    "title": "Rebecca Spit to Open Bay",
    "trail_id": "691"
}