{
    "description": "This is a description of a hike to two distinct waterfalls as well as some rapids on Beaver river near Keppoch.  The last fall is about 35 feet high and has a large pool at its base suitable to cool off after the bushwacking required to get there.\r\rFollow the river downstream as it flows in a couple of culverts underneath the road.  Walking in the stream, which is only about 6-10ft wide, is the easiest way to go.  This is a Nova Scotia bushwacking adventure at its finest or worst depending how you like it.  The forest on either side of the stream has a lot of deadfall as well as small shrubs that prevent you from maintaining a good walking speed.  Right at the set off you will see a small cascade.  There will be a major cascade at about 500m after you?ve started which is quite scenic to look at.  After about 1km, you will notice the forest to your left is now a mature deciduous forest and walking becomes easier.  The major waterfall is located 1.4km away from the road.  There are a few nice maple trees in this area that are large enough that you need two people to encircle it with their arms.  Just to think?this is what the majority of forests in NS used to be like.\r\rOn my way back from the fall, I noticed a faint but distinct old road on the right hand side of the brook (looking upstream).  Using this road will make your walking easier and faster back to your car.  Looking at the GSP track afterwards, I noticed that there has been some logging quite close to the last fall and you could get there some other ways that I described above but you would miss the fall located in the middle of the hike.\r\r",
    "directions": "From Highway 104 heading east, take exit #29 to the right.  After about 200m, turn left on Weavers Mountain Rd.  Follow this road for about 14km.  You will skirt Indian Lake and then turn left on a main road (there is a snowmobile shelter at this cross road).  Follow this road until you see some marshes to your right.  Park and follow the brook downstream.\r",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/6918/narrow_DSC-0231-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6918/reg_DSC-0211-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6918/reg_DSC-0217-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6918/narrow_DSC-0214-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6918/narrow_DSC-0233-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/beaver-river-falls-near-antigonish-ns-6918",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "4 km",
        "Town": "Antigonish, NS",
        "Type": "out-and-back"
    },
    "title": "Beaver River Falls",
    "trail_id": "6918"
}