{
    "description": "Boom Lake is a wonderful hike to take your (out-of-shape!) visitors and relatives out to see the real, pristine Rockies in Banff National Park. The trail starts high up near the continental divide so the elevation gain and steepness of the trail is minimized. The trail is wide and easy to follow; after a short climb, the trail levels out through picturesque forest, with snow-capped mountains rearing over the treetops. Just when everyone starts to ask, \"when will we get there?\" the trail opens up onto a beautiful, large, alpine lake sitting directly at timberline and right below the jagged edge of the continental divide. The lake makes a lovely picnic stop--bring your camera. The trail elevation also makes it a great early season hike as the snow is generally gone by early June. Kids can handle the hike well, though small children may need to be carried for portions. I've seen strollers used, but for the last few hundred metres, the strollers need to be carried. The hike is superb for older people, otherwise not used to the elevations in the Rockies. Best of all, the hike is not well known and is therefore not (relatively) crowded, a rare experience nowadays in our National Parks.In the winter it makes a pretty decent ski, easy-ish to go up using waxless or skins and the 3.2km closes to the parking lot is a great downhill on the way back (30 kmh fun!). There has been a slight re-route of the trail to go through the forest rather than across the tail end of an avalanche run.  I didn't see anything on the entire trail that would make me the slightest bit worried unless we had a brazillion feet of snow some year.NTS Map: 082N08Elevation Gain: 175 m (575 ft).",
    "directions": "Go west from Calgary, and continue west from Banff on the Trans Canada Highway (#1).  Turn south-west on Hwy 93 to Radium, B.C. and ascend the continental divide. The trailhead is 7.1km down the road on your right (west) side just before you reach the summit of the divide (stay in Alberta) and starts at the end of a well marked parking area. Photo courtesy of: Dave Stephens",
    "geohash": "c3j7",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/692/reg_020721-1525-15S500F0A5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/692/reg_83D493B1-5DA3-4FF0-B97A-E4C3645FAFB4.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/692/reg_89BD43EE-8465-4AF8-9359-63BD7B437C0E.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/692/reg_IMG-7669-41026.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/692/reg_IMG-7687-41026.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/692/reg_Picture-069-25276.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/692/reg_Picture-080-25276.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/692/reg_image-51922.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/692/topo_020721-1532-57S500F0A5.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/boom-lake-near-banff-ab-692",
    "stats": {
        "Activities": "hike ski-bc ski-xc",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 5,
        "Time": "3 hrs",
        "Total Distance": "10 km",
        "Town": "Banff, AB",
        "Type": "out-and-back"
    },
    "title": "Boom Lake",
    "trail_id": "692"
}