{
    "description": "Lookout Trail (Big Lookout)One of my favourite trails in Gros Morne National Park is the Lookout.Trail, also known as the Big Lookout. The trail starts out at the Discovery Center just outside Woody Point on Route 431 and winds its way up through the lookout hills to a lookoff at the top of Partridgeberry Hill.The 2.5km trail climbs 300m through boreal forest and bog meadowsmaking it a tough slog on a hot day but the panoramic view from the boardwalk and the lookout at the top are well worth it. When you hit the boardwalk that protects the delicate wetlands you begin to see hundreds of picture plants, Newfoundland?s provincial flower, dotting the landscape. The Tuckamore is thick in places and on my last trip up I walked 20 feet away from a moose and didn?t even see her until I got higher up and looked back to see her munching lazily in the grass!The view from the top of the lookout is absolutely breathtaking. The 360 degree panorama offers great views of Bonne Bay, The Tablelands, The Lookout Hills, and the Long Range Mountains. It is boasted as the best panoramic view in the whole park and I can?t say that I disagree. It can get pretty windy at the summit so bring a windbreaker in case you get cold.From the lookout, the trail winds around the back of Partridgeberry Hill and gives some great views of the surrounding countryside. During the summer, the lush green color is very beautiful. As you wind around the Tablelands begin to come into view. Due to high amounts of ferrous minerals in the rock, these 500 million year old monoliths are a rusty reddish brown color that reminds you of Mars from a distance. The contrast of the lush green bog combined with the rust colored mountains make for a great opportunity to get some awesome photos!The climb back down is fairly uneventful but nice nonetheless. Plenty of songbirds make their presence known in the forest and there are plenty of interesting plants to occupy those with an interest in botany. Make sure to bring plenty of water with you because the trail does not cross any brooks. The 5km return trip is a pretty good workout but it is one of the most rewarding hikes in the park. Ryan Young,Newfoundland Editor.",
    "directions": "The trail starts at the Discovery Center, just outside Woody Point on route 431.",
    "geohash": "f8yc9",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NL/6924/long_lookout4-8764.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6924/reg_lookou9-8764.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6924/reg_lookout1-8764.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6924/reg_lookout10-8764.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6924/reg_lookout11-8764.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6924/reg_lookout12-8764.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6924/reg_lookout2-8764.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6924/reg_lookout3-8764.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6924/reg_lookout5-8764.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6924/reg_lookout6-8764.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6924/reg_lookout7-8764.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/lookout-trail-big-lookout-near-woody-point-nf-6924",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 5,
        "Time": "3 hrs",
        "Total Distance": "5 km",
        "Town": "Woody Point, NF",
        "Type": "out-and-back"
    },
    "title": "Lookout Trail (Big Lookout)",
    "trail_id": "6924"
}