{
    "description": "The Old Growth Trail is owned and maintained by the good folks at  Island Lake Lodge. In fact, they own the entire valley beyond Mount Fernie Provincial Park. To their credit, they have made this area and all of their trails available to the hiking public - free of charge.\nThis trail begins at the 4km mark on the road up to the lodge. There are excellent signs and a good sized parking area. It then proceeds about 2km north to the lodge itself. with minor elevation gains. The ancient Western Red Cedar trees along this trail are up to 800 years old and have been spared the fires and logging of nearby areas.\nThis trail is a great place to hide from the heat. The giant cedars form a thick canopy overhead which creates a nice cool environment. It's interesting to see what can grow amonst theses massive trees, even different species growing in the remains of the few that have been cut.\nFrom the lodge you can turn around and return, arrange a shuttle or sit on the deck with a cold drink (or hot, depending on the season), then return.",
    "directions": "Take the road to Mount Fernie Provincial Park and drive straight through. Keep right at the Island Lake Lodge sign and drive about 4km to the parking area (on the right).",
    "geohash": "c2y1",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/6935/reg_og06-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6935/reg_og1-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6935/reg_og2-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6935/reg_og3-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6935/reg_og5-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6935/narrow_og4-7064.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/old-growth-trail-near-fernie-bc-6935",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "2 km",
        "Town": "Fernie, BC",
        "Type": "out-and-back"
    },
    "title": "Old Growth Trail",
    "trail_id": "6935"
}