{
    "description": "This trail is a great day long hike. The first three hours are great scrambling but the last couple hours, depending on your choice of ascent and time of season, are either spent slogging up snow or shale.  I regretted not bringing an ice axe or crampons for climbing up the snow.  We did this climb in late July so the snow was very icy and slippery, not good for glissading down - too steep and no traction. However the views are wonderful and there was plenty of wildlife throughout.  It was just under 5 hours ascent time, and 4 hours descent  (we went the wrong way and spent half an hour backtracking)  \r\rI have been told that June is the best time to do this climb but should be done with caution and with good knowledge of avalanche conditions. Bring proper snow equipment or avoid the snow altogether, stick to the path up the middle of the rock faces between the two snow patches but right of the cliffs.  We went the wrong way and ended up free climbing the cliffs, fortunately we met other hikers at the top to show us the better way down!",
    "directions": "This hike begins from the Galatea day park area. Cross the first two bridges of the trail and then take a right on the terrace trail back towards Kananaskis village. go approx 1.3 km till you hit a drainage area (rocky creek).  It is the first break in the trees and is quite obvious when you hit it.  Start Hiking up the creek.  There is a path on the right side of the creek which you can take most of the way to the base of the bowl.  Once you hit the bowl, the trail kinda disappears in snow and shale. You will turn north up the bowl and start your real ascent- you are only halfway when you hit the turn! I have read and seen multiple directions for hiking once you start up the bowl.  From my experience, given the poor climbing quality of the snow, stick to the rocks in between the two snow patches, and aim to go up closest to the right snow patch.  This will involve a lot of gravel and scree, but the only way to avoid this is to go earlier in the season. Basically it is just straight up from here. Coming down the scree was quite fun, but it eventually loses it's stability and is more like climbing down steep gravel.  I found the descent very challenging and had a couple of falls because of the difficult footing. \r\rHave fun on this hike, but use caution. Be prepared for a challenge!",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/6944/reg_kidd5-30956.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6944/reg_kidd6-30956.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6944/narrow_kidd2-30956.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6944/narrow_kidd3-30956.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6944/narrow_kidd4-30956.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6944/narrow_kidd7-30956.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mount-kidd-near-canmore-ab-6944",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 4,
        "Time": "10 hrs",
        "Total Distance": "14 km",
        "Town": "Canmore, AB",
        "Type": "out-and-back"
    },
    "title": "Mount Kidd",
    "trail_id": "6944"
}