{
    "description": "The trail has easy to difficult portions with beautiful wide winding trails through forested areas along the Welland Canal, and access in several places to The Friendship Trail along the canal between Port Colborne, and Dain City. The area also contains very rocky trails with steep drops and climbs through an old quarry area behind the old Robin Hood Mill, as well as many winding thinner trails into forested areas which can be moderate to difficult. There is access to Mud Lake which is part of The Niagara Conservation Authority. As with many trails across the Niagara Region we believe it is best to remain off of the muddier trails in late spring or after heavy rainfalls.The area boasts several races during the year, Frostbike in February, Canal Days Mountainbike Race CDMBR August long weekend, and the Great Lake to Lake Classic which passes through some of the trails on Father's Day.",
    "directions": "The best place to park and then  access the trail would be \"Lock Eight Park\" which you can get to coming off of either Hwy 140 or Hwy 58 as you travel south into Port Colborne. From either Hwy you will come upon Main St. You can turn west onto Main St. if coming off the 140, or east off of 58. Travelling a short distance to the Welland Canal where you will find the Port Colborne Locks, and Lock Eight Park situated on the west side of the locks. For convenience you will find The Pedal bike shop, and @ 27 a restaurant within sight of the parking lot. If coming into Port from Hwy 3 you can continue directly to Lock Eight as Hwy 3 becomes Main st.At Lock Eight Park you can access The Friendship Trail going north crossing through Derek Point and out behind the old Robin Hood where you'll find the quarry area. This is where you can begin to explore the area :)",
    "geohash": "dpxsh",
    "photos": [],
    "source_url": "https://trailpeak.com/trails/the-hood-near-port-colborne-on-6949",
    "stats": {
        "Activities": "mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 5,
        "Time": "3 hrs",
        "Total Distance": "15 km",
        "Town": "Port Colborne, ON",
        "Type": "out-and-back"
    },
    "title": "The Hood",
    "trail_id": "6949"
}