{
    "description": "A steep, no-nonsense charge upward to an alpine meadow and small lake, with opportunities to explore the basin. Route-finding skills necessary at times when the trail magically disappears. There are well-placed pockets of running water along the way. It's a tad remote, but with 4 hikes in the immediate area, worth the trip out.The fact that you have to search out the trailhead a little hints at what the rest of the trail will be like in places. You have to start off down an old jeep track, now grass-covered, and through a few minutes of beautiful meadow before a solitary flag announces the trail's beginning. For 30 minutes you'll amble through shockingly green corridoors of cedar and fern with a gently undulating, clearly defined trail. Next you burst into a hanging valley so dominated by plantlife that it exhales its own warm, moist air. At this point you can see the surrounding peaks and a little ways up the valley. Berry bushes and the occasional stinging nettle encroach upon the trail, but, surprisingly (due to its remoteness), it seems to get enough traffic that the trail never quite disappears.Eventually you re-enter a short patch of shady forest where you'll have to cross the main stream. At the very end of July the crossing was not dangerous and simply required a few well-aimed rock-hops. The route quickly re-emerges into the sweltering greenery. Now things get tricky. When the trail nears the stream again, keep an eye out for a crossing. It was miserably signed when I went, but hopefully the flagging I've added will help the next hapless wanderer. Once across the stream (again, not too much trouble) look up at the long debris chute - you're going up that. It doesn't matter how, since you will undoubtedly lose the snippets of trail along the way. Look for the top of a rock wall, where the grade eases - that's where the trail re-appears. Don't worry, once the chute starts to peter out, you're bound to come across one segment of the trail or another. Your best bet is to stay on the right of the chute, out of the brush (which is mostly nettles) and stick to the high point (makes a bit of a spine most of the way up). There is run-off in the debris gulley, which is the last water until the lake.The climb will take about 45 minutes before it zags right into some trees.  There is a small flat, shady spot with perfect sitting logs - I recommend a rest since the vertical is only half done, and is about to get worse. You'll quickly shoot out into the open slope again, at the mercy of the elements, and wonder what the trail-builders had against switchbacks. At times you have to grope for roots and rocks, hoping they won't come loose, and it feels like you're gaining more height than distance. There are moments where the trail levels and aims right, and you think \"this must be the end of it\" but it isn't. This only happens a few tear-inducing times before you find yourself in a very alpine-ish meadow with large boulders and snow patches which signifies the true end of the climb. Should take about 1.5 hours in total. From trailhead to lake you gain 650 meters, and I would wager 400 of those is straight from valley bottom to lakeshore in that unrelenting push. Mere minutes after the end of the climb you find yourself lakeside. It's a small one, but has lovely colouring, and the outlet disappears over the edge of a cliff, giving it that \"infinity pool\" feel. From here, everything is wide open to explore at will. There is a flat, grassy area just across the outlet where there is evidence of past campers. There is also a ridge-top traverse to Twin Lakes, with possibilities of coming out at a secondary trailhead, but the way is unmarked and requires topo maps. Give yourself 3 hours to come up, and 2.5 down.",
    "directions": "Along HWY 6 from Cherryville, drive East until you see the Goldpanner Cafe & Campground. Less than 2km from here, watch on the left hand side for the South Fork FSR, with wooden signs showing distances to the various hikes (there are 4 up here).At about 2.5km stay right at the junction, then left at the next one. It is straight-forward from there until a fork after km 14 which is left for this hike, right for Pinnacle Lake (there is a great camp spot next to a creek just a few meters in on the right fork). Take a right at the next fork (Mt. Beaven is left).The parking lot is around the 20km mark. The road is excellent (average 40km/hr) until the 14km fork, then it is still fine for a regular vehicle, just with some short sections of steep with loose rock.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/6956/long_Monashee-Lake-Hike-Rioulx-Lake-360-Pano-Cropped-Small-35968.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6956/long_Monashee-Lake-Hike-Rioulx-Lake-Pano2-Cropped-Small-35968.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6956/long_Monashee-Lake-Hike-Rioulx-Lake-Pano3-Cropped-Small-35968.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6956/long_Monashee-Lake-Hike-Rioulx-Lake-Pano4-Cropped-Small-35968.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6956/long_Monashee-Lake-from-North-Slope-Sunset-Panorama-Cropped-Small-35968.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6956/long_Monashee-Lake-from-South-Slope-Panorama-Cropped-Small-35968.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6956/reg_2013-07-10-at-20-52-52-35968.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6956/reg_2013-07-11-at-12-09-49-35968.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6956/reg_2013-07-11-at-16-38-10-35968.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6956/reg_2013-07-11-at-18-37-32-35968.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6956/reg_image-48376.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6956/reg_monash-lk-above-5-1287.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6956/reg_monashee-infinity-3-1287.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6956/reg_monashee-lk-meadow-1-1287.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6956/reg_monashee-wile-4-1287.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6956/narrow_2013-07-11-at-13-12-16-35968.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6956/narrow_DSC-0002-35968_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6956/narrow_mon-trail-7-1287.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6956/narrow_mon-trail-down-6-1287.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/monashee-lake-near-cherryville-bc-6956",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 4,
        "Time": "6 hrs",
        "Total Distance": "8 km",
        "Town": "Cherryville, BC",
        "Type": "out-and-back"
    },
    "title": "Monashee Lake",
    "trail_id": "6956"
}