{
    "description": "A short trail which skirts an amazing continuous cascade, ending at a pretty alpine lake.Wear waterproof boots and long pants (or bring a machete) - the first section of this trail was a muck-fest on July 31st, I can only imagine what it's like earlier on in the season. On the bright side, it's a perfect hike for dogs because you never go more than 15 minutes without coming across a creeklet.It doesn't seem to get much traffic, so I had to beat the plants back constantly with my hiking pole. Every once in a while a mystery plant would sting my shins and it hurt like the dickens! I finally narrowed it down to the culprit (pic included) after falsely accusing several poor plants. Internet research has informed me that the evil thing is called stinging nettle, and it's rampant around the base of the waterfall. The plants become overbearing in the open valley for a short time, then there is a slight reprieve as you enter a short patch of forest. You then arrive at a healthy stream, where a debris jam makes a fortuitous bridge crossing. It looks like the trail suffered some avalanche damage, and appears to be a goat path in sections, but it is fairly easy to follow. You'll soon see a long cascade in the near distance (once you see this, watch for more nettle!) but there doesn't seem to be a way to get to its base.The path then begins to climb alongside the falls, close enough to hear but not to see them, and is pretty much the only steep portion (and mercifully short). You climb to the very tippy-top of the falls. There is a fantastic rest stop where the trail heads in earnest toward the stream - there are wide, flat rocks and you can dip your toes in the water.The trail appears to continue alongside the river, but don't be fooled! You need to backtrack a few meters and look uphill for the real trail. After a few more minutes of climbing, the path levels out significantly and you get to walk stream-side all the way to the lake. This portion is easily one of my favourite sections of trail of all-time. The stream runs along solid bedrock for its entirety, cascading again and again, occasionally forming deep, eddying pools. The whole way is rimmed by green mosses. It's total perfection!Before you know it, the trail pops you into an open forest overlooking the lake, which is pretty cool itself. There are steep peaks on all sides, and there were still snowfields leading right down to the water. You can see countless long, thin waterfalls on the slope opposite, and an out-of-place island sits just off the shore.The trail takes less that an hour and a half each way, so you can make a day of it at the lake.",
    "directions": "Along HWY 6 from Cherryville, drive East until you see the Goldpanner Cafe & Campground. Less than 2km from here, watch on the left hand side for the South Fork FSR, with wooden signs showing distances to the various hikes (there are 4 up here).At about 2.5km stay right at the junction, then left at the next one. It is straight-forward from there until a fork after km 14 which is right for this hike, left for Monashee lake. There is a great camp spot next to a creek just a few meters in, just over the bridge. Stay left after the 16km marker, and left again around the 20km. The road is in really good shape until the 20km, then there are steep, loose sections right up to the trailhead at 22km. 4wd isn't required, but I wouldn't do it in a low-rider, either.",
    "geohash": "c2gvs",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/6957/reg_20150809-084502-56664.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6957/reg_horrible-plant-1287.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6957/reg_pin-ck-sparks-1-1287.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6957/reg_pinn-ck-sparks-4-1287.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6957/reg_pinnacle-lake-3-1287.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6957/narrow_20160721-174451-56664.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6957/narrow_20160721-174516-56664.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6957/narrow_pinn-falls-2-5-1287.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6957/narrow_pinnacle-lake-vert-2-1287_best1_.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/pinnacle-lake-near-cherryville-bc-6957",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 5,
        "Time": "3 hrs",
        "Total Distance": "5 km",
        "Town": "Cherryville, BC",
        "Type": "out-and-back"
    },
    "title": "Pinnacle Lake",
    "trail_id": "6957"
}