{
    "description": "From 9 to 12 July 2010 Patsy Duncan and I canoe-camped an 83 km, 6 portage, 7 lake loop in the remote back country of Manitoba's Whiteshell Provincial Park. The Route covered Big Whiteshell Lake, Crowduck Lake, Eagle Nest Lake, Little Echo Lake, Park Lake, Echo Lake, Saddle Lake, back to Crowduck then Big Whiteshell lakes to complete the loop.\nRecommended camp sites include Malcolm Island on Big Whiteshell Lake, Upstairs-Downstairs islands in Eagle Nest Lake, and a park cabin at the western end of Saddle Lake.\nBe careful of high winds on the bigger lakes. On Sunday, 11 July 2010, increasingly strong winds brought our morning canoe traveling to an abrupt stop. On Echo Lake we were pinned down on a rock peninsula from 11:30 am to 9:30 pm until the winds died down and we pushed off to cross a wide bay on Echo Lake. We needed to make up some distance and paddled until midnight, stopped by the sounds of a waterfall at the end of the lake. We eventually located a portage path by flashlight and at the other end of the portage we discovered a park shelter where we slept until dawn. We woke the next morning to the scolding call of an eastern phoebe, and quickly located the cause of its distress - a nest full of young under the eave of the shelter!\n \nWe recorded birds for the Manitoba Breeding Bird Survey while canoeing this remote area -- a terrific way to enjoy the outdoors and contribute to the Bird Atlas project. Spurred on by our initial success, we are now planning to do a number of bird atlas canoe-camping trips over the next 4 years!",
    "directions": "From Winnipeg take highway 59 north to hgwy 44, travel east on 44 to Hgwy 11, turn north on 11, then right (east) on Provincial Road (PR) 307, continue to and turn north on PR309. (If hungry for restaurant food then turn south on PR309 to the White Lake Campground). Take PR309 northeast to the Big Whiteshell Provincial Park Campground. Check in with the Park Office and let them know where you are going (fill out a trip report), unload your canoe etc. at the boat launch beside the main beach, park at the overnight parking lot near the tennis court, and walk back along the trail to the beach.",
    "geohash": "cbu",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/MB/6958/reg_9-12-July-2010-Canoe-Trip-30832.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/MB/6958/reg_DSCN0866-30832.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/MB/6958/reg_Eastern-Phoebe-Nest-1-30832.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/MB/6958/reg_Patsy-Duncan-listening-to-dawn-chorus-on-Saddle-Lake-30832.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/MB/6958/narrow_Raven-nest-on-Eagle-Nest-Lake-cliff-30832.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/3-night-whiteshell-loop-near-pinawa-mb-6958",
    "stats": {
        "Activities": "river-canoe",
        "From": "",
        "Seasons": "summer",
        "Stars": 5,
        "Time": "28 hrs",
        "Total Distance": "83 km",
        "Town": "Pinawa, MB",
        "Type": "out-and-back"
    },
    "title": "3 night Whiteshell Loop",
    "trail_id": "6958"
}