{
    "description": "NTS Map:92F7.  Located west of Parksville, the lake and shoreline of the 65 hectare Spider Lake Provincial Park present good opportunities for hiking, canoeing, kayaking, fishing and swimming. The 57 hectare lake has many interesting small bays that make for interesting exploring from the water or the wooded trails that follow the shoreline. The trails are suitable for all ages, and include some wooden boardwalks over sensitive areas.\r\n\r\nA small sandy beach close to the parking lot makes a great place to swim in the warm waters of the lake, and is well suited for launching kayaks and canoes. The lake is stocked with steelhead, bass, kokanee and trout. Park facilities include pit toilets, picnic tables and drinking water.\r\n\r\nThe nearest camping is at a private campsite near to the entrance to Horne Lake Caves Provincial Park; however camping is available at Little Qualicum, Englishman River and Rathtrevor Provincial Parks, all within easy driving distance.\r\n\r\n\r",
    "directions": "Take the exit for Horne Lake caves from Highway 19 or Highway 19A, travel 60 km north of Nanaimo, and then 16 km west of Qualicum Beach.  There is an 8 km gravel road along Horne Lake Road and Spider Lake Road. The centre of the park is at 49?21'00\" N 124?38'00\" W.  The parking lot is at 10U 382225E 5466744N Map 92F/7\r",
    "geohash": "c0z4",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/696/reg_sp3.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/696/reg_sp4.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/696/narrow_sp2.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/spider-lake-near-courtenay-bc-696",
    "stats": {
        "Activities": "river-canoe hike mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "4 hrs",
        "Total Distance": "3 km",
        "Town": "Courtenay, BC",
        "Type": "out-and-back"
    },
    "title": "Spider Lake",
    "trail_id": "696"
}