{
    "description": "Distance: 18km (one way)\r\rTrail 9 starts at the Wabasso Lake trailhead and returns through the valley to Old Fort Point just outside the town of Jasper.  It provides fun and sometimes challenging singletrack with plenty of roots, rocks and short steep hills.  The trail generally stays within forest, but does open up at times when on ridges and open sections of the valley.\r\rThe first 3km to Wabasso Lake is one of the roughest sections of the trail.  One long uphill section climbs a ridge where nice views to the South give a chance to catch your breath.  Once at the lake, the trail circles around the shoreline and soon arrives at a bridge across Wabasso Creek.  After crossing the bridge, Trail 9 forks left to follow along the East side of Wabasso Creek.  The right fork heads up towards the Skyline Trail.\r\rThe next section of trail provides a mix of narrow singletrack through forest along the creek, while climbing up and traversing some of the ridges.  At 10km, the trail crosses the main access into Valley of the Five Lakes.  Continue straight here, as Parks asks mountain bikers to avoid the popular hiking trails around the lakes.  The trail becomes wider at this point due to increased use, but some rocks and roots make the trail rougher again.  The trail also has some steep and technical hills along this section as it goes over some of the small ridges at the bottom of the valley.\r\rTrail 9 meets Trail 1 once near Old Fort Point.  Turn right to follow Trail 1 East, as the left trail is for hikers only.  Follow Trail 1 as it descends down to the parking lot for Old Fort Point.\r\rFor those wanting to complete a loop, it is possible to cycle back to the Wabasso Trailhead by traveling South along the Icefields Parkway (Hwy 93), which will approximately double the distance.",
    "directions": "Travel South from the town of Jasper on the Icefields Parkway approximately 15km.  Follow the signs to turn left into the parking lot for Wabasso Lake.  The trail begins just beside the trailhead kiosk at the South end of the parking area.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/6961/long_Trail9-Elevation-11604.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6961/reg_IMG-4233-11604.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6961/reg_IMG-4241-sm-11604.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6961/reg_IMG-4243-sm-11604.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6961/reg_IMGP1882-34722.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/6961/narrow_IMG-4238-sm-11604.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/trail-9-wabasso-to-old-fort-point-near-jasper-ab-6961",
    "stats": {
        "Activities": "mtn-bike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "18 km",
        "Town": "Jasper, AB",
        "Type": "out-and-back"
    },
    "title": "Trail 9 (Wabasso to Old Fort Point)",
    "trail_id": "6961"
}