{
    "description": "A good, but short, beginner mountain bike ride, xc ski or liesurely stroll to one of the less disgusting lakes in the Kettle Lakes area.\r\rThere are about a dozen \"lakes\" scattered in this basin, but most are the reed-rimmed, swampy, lilly-dominated mosquito breeding grounds that nobody would choose to swim in. It's not so much the water as the shoreline... can't get to the water without immersing yourself shin-deep in black muck. Worth it?  Maybe if you're on fire.\r\rBut I digress, the first lake you arrive at, only 2km from the road, is actually called Joan Lake and has a surprisingly out of place sand beach. It's the largest lake in the immediate area and can definitely not be designated a pond, plus it's really warm. \rThe trail in is an old road, so it's wide and easy to follow, with just enough small ups, downs and roots to make it a fun ride for beginner bikers.\r\rAbout 200m before the lake, you'll encounter a spur to the left signed \"Cleo Lake\". Though this trail looks easy to follow, it will come to an abrupt and messy end in a swampy area with shoulder-high grass. This leads me to believe that it's most likely a winter trail for skiing and snowshoeing, because there is no conceivable way to follow it in the summer.\r\r",
    "directions": "From Kelowna, head south on Hwy 33 to Trapping Creek FSR. After about 10km, watch for a bridge on the right and cross the river. After a few km, ignore the road to the left and continue until you arrive at a Y intersection. Take the right (Lassie FSR) and about 5km in watch on the right hand side for a narrow spur road with a wooden post signed \"Cleo Lake\". You can drive in about 100m to a parking area, or just park on the roadside.\r\r From Rock Creek, head north along Christian Valley Rd to State FSR. Stay on this until taking a right on Lassie FSR (a major road). After passing Cup Lk on your right (a nice camping spot - and one of the only other swimmable lakes) a few km on watch for a spur road with a \"Cleo Lake\" signpost on the left.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/6971/reg_DSC-0077-1-1287.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6971/reg_DSC-0078-2-1287.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/cleo-lake-near-kelowna-bc-6971",
    "stats": {
        "Activities": "mtn-bike ski-xc hike",
        "From": "",
        "Seasons": "summer fall winter",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "4 km",
        "Town": "Kelowna, BC",
        "Type": "out-and-back"
    },
    "title": "Cleo Lake",
    "trail_id": "6971"
}