{
    "description": "The nicest part of this trail is the trailhead. There is a green, grassy field with ample room for camping, a gurgling creek and a quaint wooden bridge. Beyond that, I only do this trail if you are desperate for a workout - both lakes are equally scummy, reed-lined messes of muck with nowhere solid to perch along their shore. \r\rThe trail itself (to the first lake) is pretty nice- in shady forest with a wide variety of wildflowers. Scarce minutes from the trailhead you'll get to a spot where a clearer trail cuts across this one - it doesn't look like it, but your trail continues forward and up. It climbs in earnest for most of its 3o minutes, then crests a bluff with some large sitting rocks (a perfect vantage from which to call to your idiot dog if it gets lost in the swamp below). You'll then quickly descends to the \"lake\" shore. There is a path to the right that immediately drops to the water, the path on the left continues on to the campsite and second lake.\r\rIf you go left, the path is devoured by greenery at a tiny bay-type thing- you have two choices here: 1) the plank at your feet continues all the way to the continuation of the trail - if you trust in its existence, push through the grasses and shrubs and you will emerge on the path once more 2) if the water level is low, hop across the log jam and follow the grassy/reedy lakeshore 100m or so and you'll see a sandy path heading up to the picnic/camp area. \rWhy anyone in their right minds would want to haul camping gear up here, where mosquitoes and flies persist well after they've dwindled everywhere else in the province, I do not know.\r\rThe second lake looks IDENTICAL to this one, so if you don't like this one, don't bother continuing on. The trail is quite obvious for a spell, following what seems like an ATV track to a 3-way junction that is signed - straight on for the lake. From here, the trail appears to get very little use, there is a lot of deadfall, and some unapologetically sharp spruce saplings have taken over in a few spots. It can become difficult to follow in the brushier areas, and there is no flagging and only a very occasional orange square on a tree.\rAbout 45 mins from pond/lake #1, you will arrive (yay) at the water's edge. The trail continues to the end of the lake where the rec site is located, and on to a 4wd road that is an alternate arrival option... in case you'd like to experience the magic from a new perspective.\r\r",
    "directions": "From Kelowna, head south on Hwy 33 to Trapping Creek FSR. After about 10km, watch for a bridge on the right and cross the river. After a few km, ignore the road to the left and continue until you arrive at a Y intersection. Take the right (Lassie FSR) and follow it to its end at a T intersection with State FSR, the hang a right. About 6km along, on the left (even though the backcountry mapbook puts it on the west side) you can't miss the invitingly green Sago Creek rec site. The trail begins across the bridge. \r\rFrom Rock Creek, head north along Christian Valley Rd to State FSR. Stay on this all the way (10km, maybe more) to the Sago Creek rec site. The trail begins across the bridge. \r",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/6972/long_DSC-0110-3-1287.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6972/reg_DSC-0112-5-1287.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6972/reg_DSC-0120-7-1287.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/collier-lakes-near-kelowna-bc-6972",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 2,
        "Time": "3 hrs",
        "Total Distance": "7 km",
        "Town": "Kelowna, BC",
        "Type": "out-and-back"
    },
    "title": "Collier Lakes",
    "trail_id": "6972"
}