{
    "description": "This is a 2.6km one way trail down a gentle grade to Freshwater Bay.  The trailhead is off the highway to Cape Spear from St. John's, after you drive (or bike as we did) up the South Shore steep road out of town, it levels out then the highway starts a long slope down so keep your eyes on the left you'll see a trailhead parking area and an old sign for Freshwater Bay.\nAfter parking, the trail is obvious and it travels through lush forest over rocky and boardwalk covered trail sgements until emerging at Freshwater Bay, where it intersects the ECT (East Coast Trail).  We saw about a dozen hikers on the trail on the 5.2km round trip, likely a local favourite for the fitness minded as well as popular with those looking to relax on the large crescent shaped beach of boulders.  I suspect some stop here to whale watch as we saw some whales heading into Freshwater Bay later on in the day while looking out from Fort Amherst in St. John's.  The way back is a bit more work, it will get your heart working a bit, but nothing too strenuous at all, a nice hike for close to town.",
    "directions": "Drive out of St. John's on the South Shore as if heading to Cape Spear, but just a few km out of town (start looking on the left about 3.5km out of town, as you crest the highpoint and start descending on the road to Cape Spear).  Note: If you continue on to Cape Spear (or perhaps hike the ECT to it) you'll find the oldest surviving lighthouse in NL and a great place to whale watch.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NL/6973/reg_IMG-6461-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6973/reg_IMG-6462-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6973/reg_IMG-6463-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6973/reg_IMG-6464-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6973/reg_IMG-6468-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6973/reg_IMG-6474-5.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/freshwater-bay-near-st-johns-nf-6973",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "5 km",
        "Town": "St. John's, NF",
        "Type": "out-and-back"
    },
    "title": "Freshwater Bay",
    "trail_id": "6973"
}