{
    "description": "Money Point is named after a cove where a French Galleon was wrecked for years after gold coins kept washing ashore, this cove is actually 2km from the Money point lighthouse. The trail is the old lighthouse access road, the first half is in good condition but the descent down to Money point is quite impassible to ATV and snowmobiles due to erosion and vegetation growth, we saw very little in the way of recent traffic tracks and no sign of ATV traffic on the lowlands around Money Point.\nAfter parking at the end of the road the trail starts following the power line up the hill, it is a steady ascent of 1000ft in 1.4km with no breaks, towards the top behind you there are good views of Bay St Lawrence, the next couple of kilometers are relativity flat then the descent down 1200ft  starts it seems straight down but at one time this old road carried jeeps and on one occasion a 30 ton crane, water and erosion has done its work on this section, one section 500ft down is over loose rock, you really have to watch your footing most of the way down.\n The trail comes out onto the lowlands about 1.5km from Money Point and what is left of the light, the cove where money washed ashore is to your right. The remainder of the trail is along the old road along the grass lands, the is no sign of a vehicle having been here for a very long time and very little in the way of hiker traffic. We had the place to ourselves and the views were terrific. \n There used to be a full light station here, when it was automated in the late seventies the original tower a 80 ft steel structure was dismantled using the 30 ton crane and shipped to Ottawa for the maritime museum the rest of the buildings where leveled. The original light was replaced with a smaller building and tower about 30 ft high, this too apparently is no longer needed and the coastguard in its wisdom has taken a chainsaw to the base of the tower and pulled it over, (see pictures) you would have thought a better use could have been found for the building. Interestingly I looked up the light in the latest (July 2010) list of lights put out by the coast guard and they still have the light listed as fully functional, it seems some one has a communications problem. Another day beacon has been installed which has provision for a light on it but no light was installed.\n  We choose one of the hottest days of the year for our hiking so enjoyed lunch in the shade of the old tower before heading back, the wasn't a lot of water on the trail for our dog but just past the light and 3/4 of the way back the are good streams. The return trip seemed easier I prefer to climb up loose material than down.",
    "directions": "Turn of the Cabot trail towards Aspy Bay and Meat Cove, carry straight on and do not take the turning to Meat Cove but carry on past the Co-op, approx. 1.7km past the Co-op take the gravel road to the right proceed past the fire hall 2.4km to the end of the road and park.\nGPS\nTrail head N47 00 46.4 W60 26 25.6",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/6974/reg_IMG-2719-1-26849.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6974/reg_IMG-2720-1-26849.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6974/reg_IMG-2724-1-26849.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6974/reg_IMG-2727-1-26849.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/6974/reg_IMG-2733-1-26849.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/money-point-near-ingonish-ns-6974",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 4,
        "Time": "6 hrs",
        "Total Distance": "14 km",
        "Town": "Ingonish, NS",
        "Type": "out-and-back"
    },
    "title": "Money Point",
    "trail_id": "6974"
}