{
    "description": "Starting out the trail drops down a short ridge with soft mulchy ground making it a nice easy start. Immediately we got to the first bridge which really is well built.\nAfter the bridge the trail stays in a mossy self guiding fresh cut trail up to an old over grown FSR that connects you to the old statlu  logging road. On the way down the first over grown road we came to another fresh built log bridge made by our Hero Wolf. Really a great job.. it must have been hard work hoisting the log across that river and getting it in position just right. Well Done!\nGetting to the lake  didn't feel to long. An hour 45 minutes at a good pace with an even grade trail except for the quick vertical gain before the dangerous water fall.\nArriving at the lower lake we came immediately to a small camp site with room for a couple tents 3 would be very crowded.\nTaking a right from here and following the edge of the lower lake we where presented with some great views and some over grown sections which made the trail hard to see at times. The first bolder scramble you come to looked like by far the best swimming hole on the lake and probably a great spot to catch a fish. We saw a few fish jumping at this spot.\nJust before the big log creek crossing the trail on our right to the upper Statlu lake. At this point the trail got pretty steep. Steep at times but the tame switchbacks made it a bit of relaxing climb and certainly easier on the knees on the way down.\nAbout two thirds up we came to a great lookout with a view of the lower lake and the far end of the valley. Amazing stuff.  After the lookout the trail got really steep with a few ropes helping the way and some creek bolder crossings.\nGetting to the top of the climb it flattened out and began to descend to the upper lake  basin. From here on the trail get harder and harder to follow until finally it becomes a strait alder bushwhack to the camp grounds on this cold small sub alpine lake.",
    "directions": "From Highway #7 (Lougheed Highway) just West of Agassiz, turn onto Morris Valley Road next to the Sasquach Inn. Reset your odometer here. Follow the road heading north and ignore the turn for Hemlock Valley. The road eventually crosses a narrow wooden bridge and passes a fish hatchery before turning into gravel. Reset your odometer as you pass the side road for Weaver Lake. You should now be on Harrison West Forest Service Road - be extremely cautious of active industrial traffic such as logging trucks.\nFollow the gravel road for 28.8 kilometers, based on the metal distance markers. Shortly after the road winds it's way downhill around a series of sharp corners, turn left onto Chehalis-Mystery Forest Service Road. Reset your odometer again and travel for another 8 km to a point where a newer logging road leads off to the right. Unless you have a high-clearance vehicle, continue down the road for another 50 meters to where Mystery Forest Service Road has been partially blockaded with a large dirt embankment. Park here.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/6975/reg_253344-31320.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6975/reg_CIMG0060-31320.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6975/reg_CIMG0065-31320.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6975/reg_CIMG0084-31320.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6975/reg_CIMG0088-31320.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6975/reg_CIMG0095-31320.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6975/reg_CIMG0099-31320.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6975/reg_CIMG0106-31320.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6975/reg_CIMG0114-31320.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6975/reg_CIMG0115-31320.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6975/reg_CIMG0144-31320.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6975/reg_CIMG0164-31320.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6975/reg_CIMG0174-31320.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6975/reg_CIMG0219-31320.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6975/reg_DSC05590-46735.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6975/reg_DSC05591-46735.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6975/reg_DSC05592-46735.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6975/reg_DSC05593-46735.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/statlu-lake-near-harrison-hot-springs-bc-6975",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 2,
        "Time": "4 hrs",
        "Total Distance": "13 km",
        "Town": "Harrison Hot Springs, BC",
        "Type": "out-and-back"
    },
    "title": "Statlu Lake",
    "trail_id": "6975"
}