{
    "description": "NTS Map:92B11.  At first glance, the trail in this 49 hectare park appears to be a quick stroll through the trees; the CRD website refers to a 30 minute hike on \"gentle forest trails\". The truth of the summit trail is that it is a 400 metre uphill scramble over bare rock, crushed rock, and tree roots, with an elevation gain of 108 metres. The park trails are steep, rocky and have some interesting sections with loose rock.  The trails will be very slippery during rainy weather. \r\n\r\nHiking to the summit of Bear Hill rewards you with good views of Sidney, the Saanich Peninsula, Mount Baker, and the San Juan and Gulf Islands. On a warm day, you can expect to see bald eagles riding the thermals over the north side of the hill. All in all, it's well worth the climb to the summit for the views and the cardio workout.\r\n\r\nNumerous branch trails take you to view points, and can be used to extend your visit to the park. The GPS data track and waypoints follow the direct route to the summit.\r\n\r\n There is GPS data attached to this trail (see \"download GPS\"), which if loaded into your GPS can help you find route points.\r",
    "directions": "Pat Bay Highway to Sayward Drive. Turn left at Hamsterly Road, then right at Brookleigh Road, right at Oldfield Road and again right on Bear Hill Road. The parking lot is small, holding about 6 cars. The trail head is 20 metres further up the road, at 10U 469514N 5377101E\r",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/699/narrow_bh2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/699/narrow_bh4.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/699/narrow_bh5.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/bear-hill-near-victoria-bc-699",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "1 km",
        "Town": "Victoria, BC",
        "Type": "out-and-back"
    },
    "title": "Bear Hill",
    "trail_id": "699"
}