{
    "description": "The sign at the start and stop (Sandy Cove/Salvage) says ?rugged? and it is.  This trail could be an ankle twister and a soaker both, so be prepared with sturdy hiking boots. Also bring pants, and, lots of water.  I?d also advise on a GPS with the waypoints and track log from this trail entry if this is your first time on the trail,  this is not a walk in the park. This is however what experienced hikers look for and it will reward those to give it a try.  I hope the trail stays closer to it?s current state for those who like their hikes natural.  Ironically, this trail is more natural than most in the nearby national park.  Some may find it to be a bog slog at times, but it's got an equal amount of elevated rocky barrens - just remember good hiking boots!  I didn't mind the challenge moving though the fen/bog and overgrown trail in parts and it never got so bad that I sank in over the top of my hiking boots. My one recommendation to the trail crew would be a few well placed boulder/rocks to hop along the muddy sections, similar to what's been done on the east coast trail. This trail is unique for the way it moves between forested hard pack trail, wet bog/fen, and rock barren highlands with views.  This trail offers a mix of mountainous barrens with unique flora, tarns, and alpine lakes that one might experience in the sub alpine of B.C.  These barrens deliver magnificent views of other rocky peaks and eventually, of the sea itself. With another quarter to a third of the trail offering  single-track through mossy forest, interspersed with segments of overgrown bush (don`t panic the trail is there and there are markers).  In the forested sections,  you?ll experience the type of hard pack forest trail that would not be out of place on any typical trail, but that is only 1/4 of the story. There are roots, short steep descents and ascents in and out of the forest to the barrens that make this trail more like an old school classic.  It will appeal to the hiker that wants to be challenged.  This trail takes you on a ride and will thrill you with every turn as it changes from peat bog/fen wetland to rocky barren and peaks overlooking what is some of the prettiest back-country terrain I have ever seen.  It?s as rich a natural canvas as the east coast trail,  due to the inland topography eye candy that any budding photographer will love.  Pitcher Plants are in abundance (flower of Newfoundland). People are not.While there are short boardwalks in sections, sparing you from sinking into the bog to your knees, I found that a quarter to a third of the trail was through wetland and bog where if not careful, your hiking boot could submerge.   I found myself hopping from dry spot to semi-dry ?spongy area?, and several times immersed my boots to the brim - but never to the point water poured in.  I was very thankful for my waterproof Lowa hiking boots for both the support they provided and for keeping water out.  You cannot do this trail in shoes, and, at one point I put my pants back on as I was wading through overgrown bush.  It gave way with ease so it didn't bother me at all.   I started to stride across the bog sections with greater confidence as I glimpsed my goal, the next red and white trail marker.  There must be something about the \"stitching\" of a bog / fen that mats the vegetation and biomass together to give you relatively good support underfoot.You are following a red and white striped trail pole (marker) that you will keep an eye out for.  They are placed quite frequently enough to give the new hiker to this area the confidence they need to stay on the trail. Getting lost in here would be no picnic as the thick bush and soggy wetlands would almost be impenetrable even though the road may only be 2  to 4 km away at any given time, this is wilderness.  While on the rock barrens (at least three major barrens to traverse and smaller sections as well) you will have your camera out the whole time and this is the easiest hiking as it?s free of bush and it?s dry!  Here you follow the red markers as well as rock cairns set up by other hikers and the trail crew.  Only in one area on the back-end of the trail leading out of a fen/bog and onto higher ground (oddly even higher ground here can be mushy) did I need to spend 5 min looking for the trail again as I completely faded  into a wetland (choice foot placement did the trick).  At this juncture (marked as \"gotlost\" waypoint  in the GPS data attached) there was thick forest all around me, and a lot of blowdown. I had lost the trail.  After just a few minutes however, I found the trail on higher dryer ground and and sure enough I found the next red striped marker not far away and I was up and climbing to the next (and one of the final) ridge barrens towards \"Sunshine Hill\" delivering superb views out over the ocean.  It is a heritage trail, and there are several ?signs? along way with spur trails offering paths to heritage points of interest, however I had no time for this, my crew would wait for me in Salvage 4 hours after starting the trail.  In the future I'd allow 5-6 hours, with time for lunch, but I cranked it out in under 4 hours including some backtracking where I accidentally ended up reversing my path for a bit when I came off the lookout at Sunshine Hill. This trail rock and rolls you, there are lots of elevation gain up and down that will get your heart going if that?s what you want.  They say the trail is about 12km long one way, but it felt longer owing to the rugged terrain, twists, and climbs.  I should have taken a few spur trails to heritage points of interest, but this was my first time on the trail.As a side note, I heard the trail crew came through the very next day after my visit. The National park  nearby tends to weed whack a lot, whereas this trail could use a little more attention.The other big reason for doing this trail is the end point, one of the most scenic fishing villages on my trip, Salvage has views of an equally rugged harbour and it?s own in-town trail network taking you by old cemeteries and other community remnants.  The best part, and I am hesitant to share it, was the handful of cherries I had by a local cherry tree near one of the trail signs.  Like no cherries I?ve ever had from a grocery store, these were thirst quenchers that were juice filled and tart. I had worked up quite a sweat on this sunny August day.  The cherries were a complete surprise and the village photos a chance to make your own postcards.  Not many trails can thrill a hiker for it?s challenge and scenery, then reward with the traditional Newfoundland fishing village.  WARNING: A final warning (again), this trail is only 12 km but it is rugged and overgrown in places.  That shouldn?t discourage you as it is well marked.  I?d advise not doing this trail alone. Having the GPS data handy and a decent map with co-ordinates may be helpful. The first barrens I hit blew me away and  I wanted more.  The combination of exceptional terrain and the old community of Salvage make this trail (that I almost skipped) one of the top trails of my 10 day trip.",
    "directions": "Get to Eastport then Sandy Cove to start, and in Sandy Cove you?ll find the parking lot for the trail with ease.  It?s signed and there are plenty of warnings.  Do this trail so that Salvage is your end point, it?s the reward, and if the museum is open (it was closed the summer we visited due to lack of visitors in the area so go hike this trail and let people know you love it!), stop in.  If you want a shorter sampler, perhaps start at Salvage and hike up to Sunshine Hill and a bit beyond for an idea of what this trail is all about.  Do some barrens, some single-track and even the overgrown stuff, and bog and get to your next barren, then turn back and you?ll have experienced a lot of what this trail has to offer while only covering half the distance.  The red markers are frequent, they really make this trail doable.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NL/6990/reg_DSC-0185-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6990/reg_DSC-0186-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6990/reg_DSC-0202-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6990/reg_DSC-0204-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6990/reg_DSC-0208-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6990/reg_DSC-0209-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6990/reg_DSC-0211-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6990/reg_DSC-0212-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6990/reg_DSC-0215-5_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6990/reg_DSC-0224-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6990/reg_DSC-0230-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6990/reg_DSC-0235-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6990/reg_DSC-0241-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6990/reg_DSC-0243-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6990/reg_DSC-0253-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6990/reg_DSC-0269-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6990/reg_DSC-0272-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6990/reg_town1-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6990/reg_town2-5.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/sandy-cove-to-salvage-the-old-trails-near-salvage-nf-6990",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 4,
        "Time": "5 hrs",
        "Total Distance": "12 km",
        "Town": "Salvage, NF",
        "Type": "out-and-back"
    },
    "title": "Sandy Cove to Salvage - The Old Trails",
    "trail_id": "6990"
}