{
    "description": "Time and distance are for a return trip.\nThe Turpin's Trail head is located behind the Lane House Museum, and winds up Lighthouse hill. The trail is 9 km long and takes approximately 3 hours to complete. Varied terrain, includes wooden bridges, stone paths, strairways, sand and grass, the level of difficulty is easy to somewhat moderate in areas. The trail follows a rugged coast line, winds through wooded areas and along Sandy Cove Beach, providing excellent scenery and a variety of views. \nOn the day we were on the trail we saw one lonely female caribou which was kind enough to pose for photos. There are also a lot of pitcher plants in the low areas of the rocky slope which you will encounter as you exit the trees. There is also the remains of an old dory and the largest trail cairns I've ever seen.\nThe trail is well marked along the barren, rocky areas. When you arrive at the beach, it's probably best to follow the beach back towards the road.\nIn 1752 the first Irish settler arrived in Tilting, having been previously settled by Portugese, French and English. His name was Thomas Burke and he was born in Dungarvan, County Waterford in 1722. Many Irishmen followed suit and began to settle in Tilting. Eventually the number of Irish settlers surpassed the number of English settlers. At one point only 3 surnames, Chalk, Dominey, and Waterman, represented the English planters. Eventually the Irish were the only remaining settlers/planters in Tilting, and are the ancestors of today's residents. The Irish surnames that still exist in Tilting include Broders, Bryan, Burke, Dwyer, Foley, Greene, Hurley, Lane, McGrath, Mahoney, Keefe, and Reardon. For more information on the village of Tilting, click here .",
    "directions": "The Turpin's Trail head is located behind the Lane House Museum in Tilting. An abreviated loop can be done by starting at the sign near Sandy Cove Beach.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NL/6991/reg_tilt1-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6991/reg_tt1-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6991/reg_tt2-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6991/reg_tt3-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6991/reg_tt4-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6991/reg_tt5-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6991/reg_tt6-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6991/reg_tt7-7064.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/turpins-trail-near-tilting-nf-6991",
    "stats": {
        "Activities": "ski-xc hike snowshoe",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "9 km",
        "Town": "Tilting, NF",
        "Type": "out-and-back"
    },
    "title": "Turpin's Trail",
    "trail_id": "6991"
}