{
    "description": "Time and distance are for a 'there and back' round trip. There is a 500' elevation gain. On a clear day you will want to stay and enjoy the views.\nSandy Cove is a beach community close to Eastport, NF, which is also the trailhead for 2 great trails - the Old Trails (link) network which ends at Salvage and the short but spectacular Lookout Trail.\nThe trail starts at the beach at a well marked and signed trailhead. The trail is obvious all the way to the spectacular summit with views of Bonavista Bay and Newman Sound. It's a fairly  rough trail with rocks and lots of roots but there are 5 benches strategically set out to rest as you go. On the day that we were there it was foggy but still a nice view. As soon as we returned to the trailhead, the fog lifted, the view opened up, but sadly we had to leave. At the top you may even find a little cairn constructed in celebration of some Albertans getting to NL finally.\nThe pioneers of Sandy Cove (the Kings and Matchims formerly of Barrow Harbour) occupied land lots (roughly rectangular in shape) on level ground above and behind a steep sand embankment that rises some 75 feet from sea level. These lots were divided by a road running parallel to the \"bank\". This created an orderly linear settlement with dwellings disposed along both sides of a roadway. Each family occupied a garden for farming. Vegetable crops and livestock helped supplement income from fishing and logging and, for most families, support a mixed household economy.\nSubsequent families at Sandy Cove infilled and expanded settlement along the original road but some (late comers) also moved inland and settled along a road to Eastport. Today Sandy Cove has a neat T-shaped layout displaying an array of both traditional vernacular outport houses and newer suburban styled dwellings.\nSandy Cove beach faces southward unto Newman Sound and lies alee of prevailing westerly winds and the numbing easterlies that so often afflict visitors to Eastport beach.\nSandy Cove has maintained a population level in the range of 150-175 persons over the last 60-70 years. Like many outports it now functions primarily as a residential base from which residents commute regularly or seasonally to work outside. For others Sandy Cove is a place where attachments are maintained in local primary activities such as fishing or in services. For others it is a place for retirement or as a holiday destination. Community functions and services over the years have been largely shared and integrated with those of Eastport and Happy Adventure. Sandy Cove nourishes the reputation as one of the best kept rural communities in the province.",
    "directions": "Drive to Sandy Cove and head for the beach, you can't miss it.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NL/6992/reg_sc1-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6992/reg_sc2-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6992/reg_sc3-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6992/reg_sc4-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6992/reg_sc5-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6992/reg_sc6-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6992/reg_sc7-7064.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/sandy-cove-lookout-near-sandy-cove-nf-6992",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "1 km",
        "Town": "Sandy Cove, NF",
        "Type": "out-and-back"
    },
    "title": "Sandy Cove Lookout",
    "trail_id": "6992"
}