{
    "description": "An Island group (archipelago) that reminded me of the Broken Group in B.C. which is a top paddling destination in Canada. I think the Bay of Exploits is one of the top kayak trips in Canada as it is surrounded by dozens of crown owned Islands that are varied in their elevation creating a stunning horizon vista and hundreds of rock formations, small coves, and beaches.  A good deal of free camping to boot - mind you - the vegetation is thick on the Islands.  Our trip was with local expert guide Paul Langdon who has lived in this area his whole life and also operates a camp-and-guide 5 day paddle trip in this area with camping close to a lighthouse.  We didn't have 5 days, so we settled for a fairly long day paddle around Hummock Island which scored an A+ for the rock gardens, gentle swell, and vistas.  It was a perfect day but these same waters could be tricky in severe weather.  Distances are approximate:  2.5 km from beginning of Laurence Harbour (Pauls place is marked with the only photo icon in the google map attached) to the open water, then a 5km open water crossing (allowing for a non-direct line) to Hummock Island, then a 5 km circumnavigation of the Island itself with a return sums up to 20 km of paddling, with extra bays and rock gardens you may be looking at 22km of paddling if you enjoy it fully as we did.The reason Paul likes to base camp on Exploits Island(s) is twofold.  First, in Newfoundland, the weather can change and you may have to sit out a day.  Second, with so much in the area, it's possible to have 5 very different paddling days without the hassle of breaking camp everyday.  For those who kayak trip, you know that you don't usually get off the beach without a 2 hour effort to break camp. There is a 4 km hike with decent elevation gain from the camp area to the historic lighthouse on the bluffs and we spotted the lighthouse to our left as we made our way across the channel to Hummock. As we paddled out of Laurence Harbour, we spotted dozens of Islands all around us with a mountainous silhouette on the horizon, cliffs, bald eagles. It's all crown land and barely visited. As I paddled  I vowed I'd return for the full 5 days another time.  Our crossing to Hummock was relatively long, at about 4.7 km as the crow flies or 5 km with relaxed, in ideal conditions.Hummock itself was a majestic paddling playground in fairly protected waters, with tall cliffs, rock gardens where our group played like otters, and, a few beaches worthy of a landing and lunch.  Plenty to interest the whole group, by far the most fun was paddling the exposed side of the Island where gentle 2 foot swells washed over the rocks and allowed our experienced paddlers to shoot some narrow passages for thrills.  See the video (click videos) in this trail description at the top and right to see our trailpeak editors in action.What a day.  Hummock itself is a good destination in good weather, but it's a longish day paddle, we completed it with a small rest in about 6 hours from Paul Langdon's boat launch. Paul, our guide, mentioned that in bad weather, this would be an entirely different paddle.  However today it was all sunshine and barely a wave. We were treated to crystal clear waters, no crowds (or anyone for that matter), and lots of interesting shoreline and views.  A few lobster traps sitting on the crest of the cliffs and beaches of Hummock Island indicate this area is used by fisherman in smaller boats. There is otherwise negligible boat traffic.One can spend a whole week here, and from the looks of the map, I believe it.  With just a small sampling, we were still giddy at the end of the paddle and very much impressed with the area.  It qualifies as a hidden gem.  I wish we had more time to explore, but the editor's trip of 2010 has us moving on to Fogo Island next.",
    "directions": "Paul Langdon operates Canoe Hill Adventures.  It's tricky getting to his place and boat launch but if you look at the attached google map, you'll see a photo icon marking his boat launch, at his kayak operation / base.  There is a public launch nearby, however, at Paul's you have rental kayaks and the opportunity to leave your vehicle and be guided by Paul  either for a day trip or a 4-5 day experience.",
    "geohash": "fbb",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NL/6993/long_IMG-1054-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6993/reg_DSC-1774-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6993/reg_IMG-0186-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6993/reg_IMG-0191-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6993/reg_IMG-0194-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6993/reg_IMG-0196-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6993/reg_IMG-0199-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6993/reg_IMG-0202-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6993/reg_IMG-0206-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6993/reg_IMG-0209-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6993/reg_IMG-0212-5_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6993/reg_IMG-0220-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6993/reg_IMG-0223-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6993/reg_IMG-1032-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6993/reg_IMG-1064-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6993/reg_IMG-1067-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6993/reg_IMG-1068-6702.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/hummock-island-bay-of-exploits-near-botwood-nf-6993",
    "stats": {
        "Activities": "sea-kayak",
        "From": "",
        "Seasons": "summer",
        "Stars": 5,
        "Time": "6 hrs",
        "Total Distance": "20 km",
        "Town": "Botwood, NF",
        "Type": "out-and-back"
    },
    "title": "Hummock Island - Bay of Exploits",
    "trail_id": "6993"
}