{
    "description": "From Elfin Lakes, shortly past the shelter take the right fork toward Opal Cone and Mamquam Lake. The left fork will take you to The Saddle and The Gargoyles.\nThe trail drops down to Ring Creek and then up again on the other side of the moraine toward Opal Cone. To get to Opal Cone, look for a trail that leads off to the left of the main trail. Opal Cone is the rim of an extinct volcano that overlooks the Bishop Glacier. Stunning views are to be had from here on a clear day! The trail will lead you back to the main trail to Mamquam Lake.\nShortly after passing Opal Cone, you move onto an area called The Barrens. As of Aug. 19, 2010, this area is still covered by packed snow, but is easy to navigate. Just follow the cairns. On the other side of the barrens, you descend one side of Zig Zag Creek, cross the creek, and then ascend the other side. The descent, as well as one short stretch on the other side, follows a narrow trail (",
    "directions": "This hike starts from Elfin Lakes, 11 kms. from the Diamond Head parking lot. See \"Elfin Lakes (Garibaldi Provincial Park)\" for details on accessing the trail head.\nTrailhead is on Garibaldi Park Road accessable from Mamquam Rd at Garibaldi Estates.",
    "geohash": "c2b",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/6996/reg_Diamond-Head-2971.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6996/reg_Mamquam-Lake-and-Pyramid-Mtn-2971.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6996/reg_Ring-Creek-valley-2971.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/6996/reg_Zig-Zag-Creek-valley-2971.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mamquam-lake-garibaldi-provincial-park-near-squamish-bc-6996",
    "stats": {
        "Activities": "snowshoe hike",
        "From": "",
        "Seasons": "winter summer",
        "Stars": 5,
        "Time": "9 hrs",
        "Total Distance": "22 km",
        "Town": "Squamish, BC",
        "Type": "out-and-back"
    },
    "title": "Mamquam Lake (Garibaldi Provincial Park)",
    "trail_id": "6996"
}