{
    "description": "Malady head leaves right out of the campground and after .5 km of old road, you see the \"real\" trailhead which is marked, it`s another 2 km to a fantastic lookout over the park and towards the sea.\nOverall the terrain is well maintained national park  styled trail, with stone gravel along the first 200m or so allowing just about anyone to sample it.  It descends and rises a few times, into one or two open clearings, before it's final rise and gradual ascent to the viewpoint and platform.\nThe final 500 m does get steeper, offering a semblance  of a workout, but overall, this trail is accessable to most, with no bog or wetlands to worry about. It passes through a mossy forest for the most part and  I liked the way the light played in these sections.\nOverall -- a great trail for the family -- the view is fantastic and a nice finish to a 2.5 km one way hike.  No technical footwork required, this trail is classic single-track with no  fuss.  If you want a real wilderness challenge, there are longer Terra Nova trails to check out, and, of course, the Sandy Cove to Salvage trail also on this site (gets an A+ from me) at 12 km and very diverse and rugged.",
    "directions": "Main camping area at Malady Head Campground, after checking in at the campground entrance, you will see signs if you stay straight on the main road, hike is to your right and slightly up the hill, you can also very easily walk to it from the campground, just head east and look for the road sloping up with a gate.  You at first walk through a discontinued car camp area that is being slowly reclaimed by nature, you'll see the real trailhead on your left it is well signed.  GPS data is also attached, have a peek at the google map and zoom in.  Very easy to find, and once on it, you have no spur trails or means of getting lost.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NL/6997/reg_DSC-0123-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6997/reg_DSC-0126-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6997/reg_DSC-0127-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6997/reg_DSC-0130-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6997/reg_DSC-0142-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6997/reg_DSC-0151-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6997/reg_DSC-0153-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6997/reg_DSC-0155-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6997/reg_DSC-0161-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6997/reg_DSC-0171-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6997/reg_DSC-0172-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6997/reg_DSC-0176-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6997/reg_DSC-0178-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6997/reg_walking1-5.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/malady-head-terra-nova-natl-park-near-eastport-nf-6997",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "5 km",
        "Town": "Eastport, NF",
        "Type": "out-and-back"
    },
    "title": "Malady Head - Terra Nova Nat'l Park",
    "trail_id": "6997"
}