{
    "description": "On the way back from sea kayaking with Paul Langdon in the Bay of Exploits, we passed by a sign on the road in Phillip's Head indicating a WWII Gun Battery was up the hill.  We decided to check it out, not so much because it is a hike, it`s more of a walk up the hill to see a historical point of interest.  As we walked the 200m or so to the Gun Battery, we did see a Bridal Path trail circling the hill with spur trails down to the cove.  You can get a 2 km walk out of this, certainly the incline to the Gun Battery is doable by all.  An ideal walk for seniors and a trip down memory lane.We were completely surprised by the size of this gun battery, having expected to find a cement platform or two we found large gun bunkers more akin to those you might find on the beaches of Normandy.  With two main gun batteries, dozens of rooms (that you can walk into) and a long underground corridor or trench connecting the complex, this is more on the scale of a fort with rumoured escape hatches, ammunition rooms, lookouts and long hallways.Without knowing anything else of the area -- it was clear that this installation protected a very important WWII asset, and, google did of course fill in the rest of the answer.  Apparently Botwood was a very important ore and wood deepwater shipping terminus, as well as a transatlantic seaplane air service base (seaport).  Being on a direct line from London to New York, many important people who flew this route in WWII stopped in Botwood, even Winston Churchill.  I hope he liked the Cod and Scruncheons or perhaps a fisherman's platter -- the staple of our editor's trip 2010.  Learning that hundreds of servicemen and women were stationed in the area, with a submarine net also at this particular point, I now know that what we tripped upon was a very important relic of Newfoundland's WWII history.  One can only imagine the fear that gripped the Island as Nazi submarines patrolled the shoreline looking for shipping  targets.  The Canadian forces ensured defenses were strong at this point as a contingency for any invasion.  With the shortest flight distance to Europe, this sea plane base and port would have been a candidate invasion point for a beachhead had the war in Europe been lost.  It is hard however to imagine an invasion of North America being very realistic but enemy activity is well documented in the area.  Torbay Bay submarine detection aircaraft (such as the PBY Catalina -- of which one is still on display in Botwood) spotted many U boats off the coast, and, Bell Island did see action with sinkings on both sides.I personally find these walks to old forgotten installations fascinating, and - battles did rage off the coast of NL in WWII - the war was being fought close to home, spies being dropped off by submarine perhaps, airplane ferry service and a key transportation hub mean that Newfoundland had WWII on it's doorstep at all times.  From here to Gander (airbase and museum) one can find several remnants of WWII.  Another walk to a coastal defence installation that one of our editors partook in, is Fort Amherst guarding St. John's Harbour. There, one of our editor's fathers (Brian Coffey's father) was with the combat engineers of the Newfoundland regiment and surveyed the installation for the guns at this point.  Brian got a chance to visit the site, and, while waiting, I watched some fishing boat owners anxiously awaiting their boat which was coming back after 4 days at sea some 200 miles offshore.  The road up to Fort Amherst in St. John's was no doubt a place where many waited for those to return from sea throughout history.Finally, on our editor's visit 2010, staying at Points East B&B just north of St. John's, owner Elke Dietmar told us of a local trail that visits other WWI coastal defence gun installations that the Americans manned in WWII.  It seems that the person interested  in hiking and history can make a full tour of it in NL as we also stopped at the Gander air museum to quickly checkout some vintage aircraft sitting near the parking lot.",
    "directions": "Look at the Google Map, off hwy 352 on the way to Laurence Harbour and Paul Langdon Sea kayaking at the Bay of Exploits, it's also not far from Botwood, NL.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NL/6998/reg_DSC-1778-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6998/reg_DSC-1779-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6998/reg_DSC-1780-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6998/reg_DSC-1781-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6998/reg_DSC-1782-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6998/reg_DSCF1993-51661.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6998/reg_DSCF1997-51661.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/wwii-gun-battery-guarding-botwood-nl-at-phillips-head-near-botwood-nf-6998",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 2,
        "Time": "1 hrs",
        "Total Distance": "1 km",
        "Town": "Botwood, NF",
        "Type": "out-and-back"
    },
    "title": "WWII Gun Battery guarding Botwood NL at Phillip's Head.",
    "trail_id": "6998"
}