{
    "description": "A hike up a dramatic landscape of rock with steep terrain on either side dropping  to the aquamarine shoreline, Brimstone head walk/hike leaves the campground for some of the most stunnning vistas on Fogo Island. Looking back to the historic town of Fogo and to the sea itself, you'll notice the geography on Fogo Island is very different. Even as you drive into town after arriving by ferry you will feel compelled to get out and experience what surely feels like one of the very corners of the earth (in fact it is).Three of the four of us climbed the steps and rocky trail to the platform at the top of Brimstone head.  The glacial erratics and boulders littering the area, it's a rock-on-rock landscape with sparse but delicate vegetation.  Surprisingly, flowers, berries, heath, moss and lichens all survive here creating a contrast of beauty and extreme that is situated in one of the 4 corners of the earth according to the flat earth society.We did this short but steep hike during the Fogo Music Festival and as we neared the peak, a boat parade was en-route to the cove directly below us by the festival grounds.  This, the last day of the fishery season, marked with a beach ceremony and boat parade was in thanks for another season of bounty. We heard music directly from the beach as speakers were brought down to the shore and religious music was being sung -- clearly the sea is still very much a part of life for the people on Fogo.Many former residents of Fogo return for the festival weekend.  And it was a perfect day, a very hot day. After my two hikes (here and Fogo head just across the cove) I was thirsty and finished my hiking in town at the Pharmacy where I loaded up on cold drinks.  I also walked around town taking photos and stopping in front of the two historic churches, imagining the generations of sea faring families and the lives lived on this Island.  Apparently Fogo resisted resettlement and as a result, a vibrant culture remains with fishing, tourism, and, the arts now making up a good deal of the economy where one of the most lucrative ancient  fishing outposts in Newfoundland existed.Numerous signs exist in town to fill you in on the Spanish, French, English, and Irish heritage that make up the Islands past.  Still very quaint, today's residents mix the modern with the old and it seems to work.  The hike up Brimstone head gives great views back to town and a close up view of this rugged land.",
    "directions": "Take the ferry to Fogo Island, drive to Fogo and camp or B&B it.  The hike to Brimstone head can't be missed, just go to the campground and baseball diamond (site of the folk festival) across the bridge in town (past the Pharmacy) or just look for the promontory that is Brimstone head with the large winding wooden stairs that are silver in colour.  Nearby also you will find the Fogo head hike, which is a longer (5km) all in hike with two lookout platforms and a hike down to the beach before circling into town.  Do them both for a fantastic hike/walk experience.  Our gang set up some tents on the Brimstone head for a few classic shots, and I have attached these.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NL/6999/reg_DSC-0007-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6999/reg_DSC-0011-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6999/reg_DSC-0013-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6999/reg_DSC-0017-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6999/reg_DSC-0019-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6999/reg_DSC-0023-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6999/reg_DSC-0046-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6999/reg_DSC-1815-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6999/reg_DSC-1819-5_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6999/reg_DSC-1821-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6999/reg_DSC-1822-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6999/reg_DSC-1830-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6999/reg_DSC-1831-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6999/reg_DSC-1836-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6999/reg_DSC-1838-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6999/reg_DSC-1841-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6999/reg_DSC-1846-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6999/reg_DSC-1851-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/6999/reg_DSC-1854-5.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/brimstone-head-fogo-near-fogo-nf-6999",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "2 km",
        "Town": "Fogo, NF",
        "Type": "out-and-back"
    },
    "title": "Brimstone Head - Fogo",
    "trail_id": "6999"
}