{
    "description": "NTS Map:92B11.  The 442 hectare Elk/Beaver Lake Regional Park is a multi-use park that appeals to hikers, cyclists, equestrians, paddlers, and people just wanting a picnic at the beach. The lakes are used by fishermen, rowers, windsurfers, and water skiers, all on a co-operative basis in well-established and marked areas.  Powerboats are restricted to two areas--a high speed water skiing area in the north west section of the lake, with the remaining lake areas being restricted to human, wind, and small engine powered boats.\r\n\r\nThere are four main areas that are well suited for launching canoes and kayaks; Beaver Beach, Hamsterly Beach, the Bookleigh boat launch, and the rowing center, ramp and beach at Eagle beach. All four areas have large parking lots that are close to the water. Between Elk and Beaver Lakes, a series of small islands make great stops for a quick picnic. The area around Hamsterly Beach gets quite crowded in the summer, with all sorts of mayhem occurring as visitors try windsurfing or take a jaunt in a balloon tired pedal boat.  The areas south of Eagle Beach leading into Beaver Lake tend to be much quieter and are frequented by serious competitive paddlers.\r\n\r\nHamsterly Beach, at the north west end of Elk Lake, and Beaver Beach at the southeast end of Beaver Lake, both have a large sandy beach, washrooms and change houses, a playground and a seasonal concession stand. In addition, kayak and canoe rentals are available at Hamsterly Beach.\r\n\r\nApproaches to the buoyed rowing lanes in the waters surrounding Eagle Beach are often restricted to allow for competitive rowing events; restriction dates are published well in advance of events. The Saanich police department and Coast Guard regularly patrol the lakes, checking for alcohol, life jackets, and to ensure that power boats stay within the designated zones and speed limits.\r\n \r\n19 kilometres of trails connect Elk and Beaver lakes, with trails designated as multi-use or pedestrian only. \r\n\r\nThe longest of the trails, the 10K Trail that loops around the lakes, is an easy, mostly level, well established trail with many opportunities for branching on or off the trail. While the trail is named 10K, it is 9.4 kilometres long if you take all branches that lead towards the water. Although dog owners are for the large part very good about picking up after their pets on the trail, the same can not be said for the horse crowd that share parts of the trail. The trail section between Eagle and Hamsterly beaches closely parallel highway 17, making for a noisy walk on this section. On the western sections, the trail is quiet and serene.\r\n\r\n\r\n There is GPS data attached to this trail (see \"download GPS\"), which if loaded into your GPS can help you find route points.\r",
    "directions": "Elk Lake--Sayward Road traffic light on Highway 17.\r\nBeaver Lake--Haliburton Road traffic light on Highway 17. \r\nEagle Beach - marked exit across traffic on Highway 17.\r\n\r",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/700/narrow_eb1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/700/narrow_eb2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/700/narrow_eb3.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/700/narrow_eb4.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/700/narrow_eb5.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/elkbeaver-10k-trail-near-victoria-bc-700",
    "stats": {
        "Activities": "river-canoe sea-kayak hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "10 km",
        "Town": "Victoria, BC",
        "Type": "out-and-back"
    },
    "title": "Elk/Beaver 10K Trail",
    "trail_id": "700"
}