{
    "description": "Fogo Head is a well marked route close to the Brimstone head hike -- and, as you take the bridge out of the town over to Brimstone head (one of the 4 corners of the earth!), you'll see the trail marker on your right.  If you continue on the road, you'll end up at Brimstone head / baseball diamond and campground (music festival).This is a longer hike than Brimstone head, with less boardwalk and stairs, although there are some, especially on the descent.  It's one big loop, about 5km if you include the portion where you walk the road back to town and then back to the trailhead.  I found this hike to be spectacular in terms of views, even more so than Brimstone head, and it's longer.  There are two platforms (peaks) to the trail, both Middle Head and Fogo Head overlooking far away Islands (little fogo Islands -- which had communities in the day) and each also has views back to the Brimstone Head hike.  The landscape seems like it's off the cover of a led zep album, erratic rocks everywhere. In the height of summer - small delicate flowers bloom and butterflies seem able to handle the gentle breeze.Fogo is rugged, it's hardscrabble rock and low level vegetation that has somehow made peace with the rock on which it clings for life.  The scenery is dramatic, and if you are lucky, a fishing vessel or two will move into the picture that is framed by aquamarine sea colours and jagged coastline.  I took a lot of photos on this short hike, and loved every minute of it.After hitting peak number two (Fogo), and contemplating life on the distant Islands you spot, it's time to descend. And what a descent.  Fortunately, stairs and railings help you (or climb)  45 degree slopes to the beach and shoreline before making you climb again about half the distance back to the third platform.  Here a cannon rests from an old defense (the Spanish, French, and English were all here from the late 1600's on).  Now you are at the terminus of this hike, and, you follow the road back into town while snapping pics of the cove and homes that dot this communities coastline.  It's very pretty here, with the views across town anchored by 3 churches -- 2 of which still operate.Yet another hike followed by a town walk and photo shoot.  If you hike Brimstone head, Fogo Head, and a third -- Marconi point hike -- that gives you three shorter trails all in one day.  You'll be tired and happy, your fill of maritime photography and landscape, and you may well have overworked the muscles while distracted by the scenery so my advice is to take a few days and just relax.  Note:  Fogo is both an Island and a town (community).  These hikes are in the community of Fogo.  There are several other hikes on Fogo Island, including some ancient Irish settlements (the oldest in Canada) written up by other Trailpeak editors.  Use the search engine to find more, Fogos is a must stop if in the area.  There is a small caribou community on the Island, and one of our editors even got some photos of one on another hike!",
    "directions": "Fogo Head is a well market route close to the Brimstone head hike -- in fact, as you take the bridge out of the town over to Brimstone head, you'll see the trail marker on your right.  If you continue, you'll end up at Brimstone head / baseball diamond and campground (music festival). If you hike on this weekend, you may hear echoes of \"Dirty old Town\" by at least one set of performers, a favourite song commemorating the coal mining days.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NL/7000/reg_DSC-0035-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/7000/reg_DSC-0038-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/7000/reg_DSC-0041-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/7000/reg_DSC-0044-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/7000/reg_DSC-0052-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/7000/reg_DSC-0054-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/7000/reg_DSC-0056-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/7000/reg_DSC-0060-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/7000/reg_DSC-0063-5_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/7000/reg_DSC-0064-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/7000/reg_DSC-0068-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/7000/reg_DSC-0071-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/7000/reg_DSC-0073-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/7000/reg_DSC-0077-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/7000/reg_DSC-0086-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/7000/reg_DSC-0090-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/7000/reg_DSC-0101-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/7000/reg_DSC-0106-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/7000/reg_peak1-5.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/fogo-head-fogo-island-near-fogo-nf-7000",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "5 km",
        "Town": "Fogo, NF",
        "Type": "out-and-back"
    },
    "title": "Fogo Head - Fogo Island",
    "trail_id": "7000"
}