{
    "description": "This is a multi-day sea kayak trip with camping along the Bruce Peninsula. It originates in Tobermory, right off the public dock, and with boat rentals just up the street, this is an epic trip for low hassle factor.  Heading out of harbour, you make your way through the Islands to Flowerpot Island where you camp (watch for spiders and snakes -- lots of them).After a second day depart, we make our way in rather rough weather some 7km to land, however, we don't realize the bay we pull into is private, it's a big rocky beach and we've paddled a fair bit.  Note to self, head a bit further east before stopping, however, rougher weather had us taking the direct line, and the landowners were kind enough to allow us to finish our lunch.Onwards, we made regular camp at the very same spots (3 nights) hikers would camp on the Bruce Trail along the Bruce peninsula and within the National Park.  Being down near the water is best, but, since this was a hiker's route first, kayakers have to lug their stuff up to the tent pads well off the water.  I hope that for the kayakers sake, parks people allow kayakers to camp closer to the water.Nevertheless, day after day we pass pristine shoreline with incredible pebble beaches and terrain that hikers will never see.  We get to stop along some of these shorelines (and even swim - it's cold but doable) and have many beaches to ourselves.The camp spots are noted in the waypoints attached (3 nights on Peninsula, 1 on Flowerpot), however, I will say that the one week link for this trip is that the final leg around Cabot head and down to the exit point (government docks in Dyers Bay) is a long (long) paddle.  We had some beginner paddlers with us, and combined with rough weather around Cabot point, the winds really picked up and forced some very slow going on the last day.This route needs a camp spot at or before Cabot Head, to make an easy exit the next day or even an exit right from Cabot Head if possible as it is serviced by road, there is a lighthouse, and, even a bird sanctuary in the Wingfield Basin (lagoon like).  If in need of an exit, this small harbour at Cabot point is the one to aim for.  On the very last day, winds went from favourable to 3-4 foot seas and strong opposing winds as we rounded Cabot Head.Stop in at the lighthouse if park staff are there, or the bird sanctuary around to the right -- an easy going group doing bird studies here, you may get some help there of needed.  Just note that before you hit Cabot point (head) you are out of the National Park -- so camping is not (officially) permitted even though it is a provincial nature reserve.Bring a marine radio, marine charts, GPS, compass and know how to use them -- and consider hiring a guide for this trip.  We made our way as a fairly large group, limited somewhat by the lack of experience of the two weakest paddlers in a double.  Be mindful that there can be long legs on this journey, but it is spectacular and quite epic for Ontario sea kayaking.",
    "directions": "Public launch out of Tobermory, Ont.  Sea Kayak rental shop is in town just up from the boat launch and near some restaurants.",
    "geohash": "f0",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/ON/7001/reg_IMG-1351-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/7001/reg_IMG-1354-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/7001/reg_IMG-1367-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/7001/reg_IMG-1370-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/7001/reg_IMG-1376-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/7001/reg_IMG-1380-5_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/7001/reg_IMG-1384-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/7001/reg_IMG-1388-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/7001/reg_IMG-1391-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/7001/reg_IMG-1397-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/7001/reg_IMG-1401-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/7001/reg_IMG-1407-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/7001/reg_IMG-1408-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/7001/reg_IMG-1409-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/7001/reg_IMG-1410-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/7001/reg_IMG-1411-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/7001/reg_IMG-1415-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/7001/reg_IMG-1418-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/7001/reg_IMG-1421-5.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/fathom-five-bruce-peninsula-near-collingwood-on-7001",
    "stats": {
        "Activities": "sea-kayak",
        "From": "",
        "Seasons": "summer",
        "Stars": 5,
        "Time": "28 hrs",
        "Total Distance": "52 km",
        "Town": "Collingwood, ON",
        "Type": "out-and-back"
    },
    "title": "Fathom Five - Bruce Peninsula",
    "trail_id": "7001"
}