{
    "description": "This is a description of a very nice half day paddle out of Popes Harbour on the Eastern shore.  The paddle as described below comes in just shy of 14km and took two and a half hour with a 20 min snack break included.  The paddle circumvents some of the biggest islands on the eastern shore and strikes through an unusual feature; the Bawleen (hence the name of the paddling route).  I?ve posted a topo of the area so you can have a look at the features I name in this post.\r\rFirst, I paddled to some exposed rocks in the middle of the cove that were covered by cormorants drying their wings and then basically around Duchtowen point towards Spry Bay.  Once in Spry bay and across from your location you will see a large barren hill which has a large box like structure on its summit as well as a lighthouse dissimulated in an evergreen forest.  As soon as I rounded Gerard Island and paddled into Spry Bay, there was a lot more exposure to large ocean swells.  I continued to follow the edge of the island bypassing at least one more significant rocky island.  Once your past Lawler Point (stone ridge outcrop that juts out into the ocean with a rocky beach on its south side) you should be ale to see Little Stoney and Stoney Islands in the distance.\r\rPaddling to the Stoney islands, you will see on your right the entrance to the bawleen which has a spectacularly sheltered body of water sandwiched between two islands.  Make you way to the Stoney Islands and to the nice sandy beaches located on the larger Stoney Islands (the beaches are all facing the Bawleen).  I stopped there to eat a little snack and stretch my legs.  These are the only sandy beaches I saw on this paddle.\r\rAfter exiting the passage between Stoney and Phoenix islands, I was again very exposed top the large ocean swells which are not dangerous as long as you stay away from the rocky outcrops.  There is enough water to go in the sheltered areas between Phoenix island and McGrawth Islands.  You come out of there in Dipper cove and then you will need to go around Popes Head.  This bluff is barren and would be a cool place to pitch a tent for a night.  Of particular importance on foggy days, there is a fog bell just next to Fish Point.  From Popes Head to Net Mooring Point, you will be exposed to the ocean conditions of the day and there is no good place to bail if the conditions are dicey.  I suggest you look carefully at the conditions before attempting this crossing.  Once past the Net Mooring Point, you can either stricke for the Bawleen through Glawsons Gut or go around the rest of Gerard Island.  I?ve done both but I prefer going into the Bawleen at the end of this trip since it is usually quite calm in there.  Paddling into the Bawleen, make your way to an area called the South Mud Hole.  In the back of the hole, there is a 100m trail that  you can take with your boat that crosses Gerard Island.  Once across the island, you are basically in front of Hitchies Cove (where you started the paddle).\r\r \r",
    "directions": "Take highway 7 from Dartmouth and make your way to Popes Harbour.  I put in at Popes Harbour, where Hitches brook flow into Hitchies cove (44.814359°, -62.636494°).  You cannot miss this entry point as there is a small white building that sits right next to the brook and on the edge of the cove.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/7004/reg_2010-08-20-061-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/7004/reg_2010-08-20-069-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/7004/reg_2010-08-20-071-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/7004/reg_2010-08-20-075-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/7004/reg_2010-08-20-087-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/7004/reg_2010-08-20-098-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/7004/reg_2010-08-20-099-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/7004/reg_2010-08-20-105-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/7004/reg_ntdb-mspaserv461128256459814622-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/7004/narrow_2010-08-20-082-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/7004/narrow_2010-08-20-107-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/bawleen-the-near-halifax-ns-7004",
    "stats": {
        "Activities": "sea-kayak",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "14 km",
        "Town": "Halifax, NS",
        "Type": "out-and-back"
    },
    "title": "Bawleen (The)",
    "trail_id": "7004"
}