{
    "description": "This is a small hike that you can do when you have a bit of extra time on your hand and are travelling on the 101 highway near Kentville.  The turnaround point of the trail is a small hidden valley that is more or less surrounded by rocky outcrops and has a cascade at its head.\r\rFollowing the main path for about 600m, you will need to leap or circumvent a couple of large puddles in the trail as well as cross a brook that can be about 6 feet wide at its peak outflow but was more or less a trickle in august.  At the 600m mark, you should be able to see a track on the right hand side of the trail at the same time as the major trail is turning to the left at almost a 90 degree angle.  Most of this part of the trail is under a mixed forest and apart from a five foot waterfall, is rather ordinary.\r\rFollow this smaller trail with some flagging tape from time to time for another 500m or so until you get to a small cascade.  Go to the top of the small cascade and enter the ?hidden valley?.  There is ample evidence of people using this place for campfires and maybe some camping.  Across from the fire pit, you will see and hear the brook cascading down a good 20-30 feet.  The Hidden valley is surrounded by all side by some rocky outcrops which gives this place a very special feeling. The trees in the valley are mostly deciduous with a few tall evergreen as well and therefore the valley is quite cool even on the hottest days.  I think I am going to go back after a big rainfall to look at the falls which could be pretty spectacular.\r",
    "directions": "On Highway 101, the trailhead is located on the south side of the highway across the Kentville water tower (45.059194°, -64.451614°)",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/7008/narrow_DSC-0024-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/7008/narrow_DSC-0025-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/hidden-valley-near-kentville-ns-7008",
    "stats": {
        "Activities": "mtn-bike hike snowshoe",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "2 km",
        "Town": "Kentville, NS",
        "Type": "out-and-back"
    },
    "title": "Hidden valley",
    "trail_id": "7008"
}