{
    "description": "I highly recommend \"the wild coast3\" by John Kimantas and Desolation Sound map by wavelength magazine. Both for sale at MEC with detailed info about camping sites and landings. As a number of camping spots do have tricky spots where tide makes a big difference. Take my word on that... hiking is great but not when your have a kayak and 2 weeks supplies to carry ;)\r\nJohn's book TWC3 has a break down of the area and you can make your own trip based on how much time you can spend in the area. Again I highly suggest TWC3 ...\r\nPlaces to avoid would be anchorages where the \"stinkpot congregate. Such as Prideaux Haven, Tenedos Bay, and Grace Harbour. Where its a obstacle course of anchors, bow lines and sewage.\r\nDepending on your trip remember to print out your tide chart and plan the route. And a number of passages to have 12knot full flow some serious tidal rapids ;)  See my attached videos showing one power boat barely making it.\r\nPlay safe and have a good time.\r\nParking is a tad interesting... the main street into lund does have free parking 100+m up from the dock. Or shell out some hard earned cash to park closer. \r\nA quiet launch ramp is located behind the hotel where we drove down unloaded the boats and gear. Then parked up the street for free.. \r\nFurther info\r\nhttp://www.env.gov.bc.ca/bcparks/explore/parkpgs/desolation/\r",
    "directions": "\r\nLund BC\r\nDriving directions to Lund, BC via vancouver bc\r\n292 km ? about 4 hours 49 mins\r\nNorth of Powell River and Lund on the Sunshine Coast; 90 miles north of Vancouver. Lund is the closest community, town or city. \r\nPrideaux Haven: Strategically located as a base for exploring the Sound, this anchorage is an elongated bay dotted with islands and small coves at the far north end of the park. A pit toilet is also located here.\r\nTenedos Bay: A sheltered bay east of Mink Island in Homfrey Channel. Nearby Unwin Lake provides a great opportunity for a freshwater swim. Pit toilets, wilderness camp sites and an information shelter are also located here.\r\nGrace Harbour: A large sheltered bay located in Malaspina Inlet and surrounded by Gifford Peninsula. This area provides pit toilets, wilderness camp sites, an information shelter and an upland hiking shelter.\r\nvideos\r\nhttp://www.youtube.com/watch?v=Vq8G3xcwyTo\r\nhttp://www.youtube.com/watch?v=_9_BpaxVy2c",
    "geohash": "c0",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/7011/long_[Group-10]-P1040331-P1040334-4-images-24018.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/7011/long_[Group-2]-P1040231-P1040237-7-images-24018.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/7011/long_[Group-3]-P1040240-P1040246-5-images-24018.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/7011/long_[Group-4]-P1040255-P1040270-16-images-24018.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/7011/long_[Group-5]-P1040277-P1040285-9-images-24018.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/7011/long_[Group-6]-P1040300-P1040306-7-images-24018.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/7011/long_[Group-9]-P1040310-P1040320-9-images-24018.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/7011/long_google2-24018.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/7011/long_google5-24018.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/7011/reg_topp-24018.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/desolation-sound-9-days-near-powell-river-bc-7011",
    "stats": {
        "Activities": "sea-kayak",
        "From": "",
        "Seasons": "spring summer",
        "Stars": 5,
        "Time": "63 hrs",
        "Total Distance": "205 km",
        "Town": "Powell River, BC",
        "Type": "out-and-back"
    },
    "title": "Desolation Sound  - 9 days",
    "trail_id": "7011"
}