{
    "description": "Bergeron Falls Hiking Trail. This very rewarding hike leads to Bergeron Falls, one of the highest waterfalls in northern B.C. The falls plunge 100 metres over a sandstone lip into a spectacular horseshoe shaped bowl. Hiking to the top of the falls and back involves a distance of 8.8 km return, takes 3 to 4 hours, and is moderately strenuous. The circular route, completed in 2010, is more strenuous (although rope hand-lines have been placed to help hikers through the steeper parts), and longer (11 kms including the sidetrail to the base of the falls). It is highly recommended. It has much more varied scenery, leads to both the bottom and the top of the falls, and includes impressive riverside, knife-edge and canyon sections. There are kim 1 to km 9 markers along this route, excluding side-trails.\nWarning: This trail has huge unfenced dropoffs at the cliff edges. Children and pets should be closely supervised. Some simple scrambling, and negotiation of a rock ledge high above the creek are needed to reach the base of the falls.\nDirections to the Trailhead\nFrom Tumbler Ridge, drive north towards Chetwynd on\nHighway 29 for 5 km to a right turn onto a gravel road.\nThe turn is marked with a sign displaying a hiker and ?8\nkm?. Follow this road for 8 km to its end in a large gravel\npit. There is a sign at the trailhead.\nTrail Directions\nFrom the parking lot, the trail climbs gently through mixed aspen and spruce forests. At 0.6 km, a fork is reached. For Bergeron Falls, take the right fork (the left fork leads to the Bergeron Cliffs). The trail climbs steadily until it levels out on a bench. Just before 1.0km, Vomer Creek is reached. This stream has a small waterfall, which can be seen by heading 10 metres off the trail. Shortly after passing the falls, the trail follows a long cutline through the forest.\nAt km 2.2 a major junction is reached. Keeping left leads\nto the top of the falls and viewpoints, 2 kms further on.\nFirst it passes through an interesting forest of small pine\ntrees in an old burn area. This is mostly level hiking\nexcept for where the trail descends to cross Bergeron\nCreek via a long footbridge (use at own risk and be\naware that there is a huge waterfall downstream).The\ntrail then ascends and approaches the edge of the cliff,\nleading to spectacular viewpoints of Bergeron Falls. A\nrope barrier has been placed at the old first viewpoint to\nkeep hikers away from the unstable cliff edge. For hikers\nwishing just to see the falls from the top, continue to the\nlast viewpoint bench but do not descend further.\nKeeping right at the km 2.4 junction is the recommended\ndirection of travel for the Circular Route (see map). After\na level section this trail descends steadily until it crosses\na clear, spring-fed creek before coming out on a cliff\nbank overlooking the Murray River. Close by is an\nhistoric pack trail. The trail then edges along the top of\nbluffs (stay away from the cliff edge), with great views of\nthe river below, before passing along and then\ndescending a spectacular knife-edge ridge (km 4), which\nleads to river level. A side trail gives access to the river\nand the mouth of Bergeron Creek. The Circular Route\nthen crosses the creek via a bridge and heads upstream,\nsometimes in the forest, sometimes in the gravel bars.\nSoon there is an important junction. Keeping left leads\nalong a dramatic, rough, 500 metre long side-trail,\nthrough a scenic slot canyon (which involves minor\nscrambling and a ledge) to the magnificent scenery at\nthe base of the falls. This section is best done during\ntimes of low water, and is impassable during floods. Stay\non the north bank of the creek until the falls are in sight,\nand then wade across the creek to get right to the falls.\nBack at this junction, heading up the slope the trail\nclimbs relentlessly, past km 5, until it reaches one of the\nfine viewpoints of the falls and joins main trail to the top\nof the falls described above. Once again, be careful at\nthe bridge crossing over the creek above the falls.\nThere are a number of other fascinating features in the\narea just above the falls. A favourite is the side-trail to\nHidden Valley, a dry, cool, mossy, steep-sided, linear\ncleft that parallels the main cliff edge. An offshoot from\nthe Hidden Valley trail leads to the bottom of Dipper\nFalls, a small waterfall in attractive rocky surroundings\non Bergeron Creek. Scalpel Ridge is another side-trail\nfrom the main trail: it follows a narrow knife-edge ridge\nbefore descending to a forest glade beside the creek.\nBergeron Creek is one of the many tributaries of the\nMurray that enter the river valley with waterfalls. These\ncreeks cut their channels after the ice retreated from the\nMurray River following the last glaciation.\nOn the return trip back to the trailhead, one may link up\nwith the Bergeron Cliffs by heading further along the\ncutline, following this connector trail to meet up with the\ntrail to the cliffs. The trail climbs steadily, coming out on\ntop of the cliffs and following along them, with great\nviews. The cliffs trail is covered in a separate brochure.\n© 2010 Wolverine Nordic and Mountain Society",
    "directions": "From Tumbler Ridge, drive north towards Chetwynd on\nHighway 29 for 5 km to a right turn onto a gravel road.\nThe turn is marked with a sign displaying a hiker and ?8\nkm?. Follow this road for 8 km to its end in a large gravel\npit. There is a sign at the trailhead.",
    "geohash": "c3c",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/7014/narrow_hiking-and-niking-002-11997.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/7014/narrow_hiking-and-niking-003-11997.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/7014/narrow_hiking-and-niking-012-11997.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/7014/narrow_hiking-and-niking-018-11997.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/7014/narrow_hiking-and-niking-025-11997.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/7014/narrow_hiking-and-niking-026-11997.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/7014/narrow_hiking-and-niking-038-11997.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/bergeron-falls-near-tumbler-ridge-bc-7014",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 5,
        "Time": "4 hrs",
        "Total Distance": "11 km",
        "Town": "Tumbler Ridge, BC",
        "Type": "out-and-back"
    },
    "title": "Bergeron Falls",
    "trail_id": "7014"
}