{
    "description": "Twillingate has done a lot of work lately to try to entice visitors to the area to come out and 'take a hike'. Fred Bridger is president of the local tourism association and has done a lot of the work himself in clearing, maintaining and promoting these trails. He hasn't done it alone, of course. I don't have any names but Fred did mention several friends who have helped tremendously in this effort. Fred also happens to be an excellent guide. He knows the trails, of course, but he is also well versed in local history and folklore and some might say has a litlle 'gift of the gab'.\nThis trail starts at the lighthouse which is currently being refurbished. It passes above Devil's Cove (a beautiful spot) and winds its way over and under the twisted and tortured trees and tuckamore that line the cliffs. The trail is so twisted that we travelled 3km in order to get 1km from the lighthouse, as the crow flies. \nEventually the trail emerges on the top of the cliffs and stays there a while, then gets back into the up and down aspect of the trail. This is not a difficult trail, but Fred would like to point out that it's not easy, either. The up and downs are steep, but short, and can be slippery when wet. Good footwear would be an asset.\nOn our way we had great views out over the ocean, saw a pair of nesting bald eagles, and in most years, icebergs would most certainly be seen. It was a good workout with a good guide. Fred can be found most days out on the trails. You can also find him at Paradise B & B in Twillingate.",
    "directions": "Go to Long Point Lighthouse in Crow Head. The trailhead is on the harbour side of the lighthouse (right side as you look past the lighthouse).",
    "geohash": "fbc49",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NL/7016/reg_tw1-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/7016/reg_tw10-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/7016/reg_tw2-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/7016/reg_tw3-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/7016/reg_tw4-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/7016/reg_tw5-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/7016/reg_tw6-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/7016/reg_tw7-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/7016/reg_tw8-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/7016/reg_tw9-7064.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/lighthouse-cuckolds-cove-near-twillingate-nf-7016",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "winter fall summer",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "4 km",
        "Town": "Twillingate, NF",
        "Type": "out-and-back"
    },
    "title": "Lighthouse-Cuckolds Cove",
    "trail_id": "7016"
}