{
    "description": "Southeast Brook falls is a short hike situated right off route 430 on the way to Gros Morne. What?s great about this trail is that it gives a nice quick reward for the very little effort put into the walk. \nThe trail is mostly an easy gravel path with a few sets of expertly built steps that undulate through dense mixed woods, but there is the occasional boulder sticking out of the trail that may require your attention. They can be slippery when wet or catch your toe.  After less than half a K, your ears will catch signs of the visual rewards soon to follow. You?re almost there. \nSoon after, you will descend to a viewing platform with protective guard rails. From here, you can see the cascade, and if you position your camera just right, you can get a good shot. With the railing as a brace, you can even get a steady long exposure.\nThe trail continues up toward the head of the falls for both a view back beyond the cliff, as well as a view of the feeder stream. I found an earthy unmarked foot path that continues up even further, but I suspect it is not a sanctioned part of the real trail. Never the less, this more technical section will get you a chance for some rock hopping, and gives a view of a smaller set of falls further up stream.\nAll told, the hike is about one kilometre return, and the fall?s total descent is about 40 meters, though not a dramatic single drop. (Likely in the Spring) This is a great warm-up hike to start off the day, or to get cooled off.  It is definitely a trail worthy of new hikers and kids alike. If you have time left in your day, and have the energy for one last go, I count this one as worthy.\nShannon Burt\nEast coast editor",
    "directions": "Along the right side of Route 430, just south of the 431 junction within the national park borders.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NL/7017/reg_-MG-0688-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/7017/reg_-MG-0699-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/7017/reg_IMG-0692-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/7017/reg_image-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/7017/narrow_IMG-0691-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/7017/narrow_IMG-0700-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/7017/narrow_IMG-0701-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/7017/narrow_IMG-0705-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/7017/narrow_MG-0689-6702.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/southeast-brook-falls-gros-morne-np-near-bonne-bay-nf-7017",
    "stats": {
        "Activities": "snowshoe hike",
        "From": "",
        "Seasons": "winter fall summer spring",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "1 km",
        "Town": "Bonne Bay, NF",
        "Type": "out-and-back"
    },
    "title": "Southeast Brook Falls, Gros Morne NP",
    "trail_id": "7017"
}