{
    "description": "NTS Map:92F1.  Rhododendron Lake is a small lake that was once a popular picnicing and camping site maintained by MacMillan Bloedel; one of many forestry campsites on Vancouver Island. In recent years, many of these sites have been closed, partly because of vandalism and partly as logging areas are decomishioned and restored to their natural state.\r\n\r\nA rough and largely overgrown trail loops around the lake, through areas that are home to many of Vancouver Islands indigenous plants, and of course to the namesake shrub of the lake. The lake is suitable for kayaking and canoeing, but the carry from the parking area is rough, steep and daunting; making it a lot of work for a relatively small paddling area. \r\n\r\nOn my last trip to Rhododendron Lake, I spotted two small bears rambling across the road, and many small deer feeding along the brush line. I also spent 45 minutes searching in vain for a hub cap that flew off on the logging main road; I didn't even bother stopping when the second one flew off. \r\n\r\nThe surrounding area is fantastic for hiking along abandonded logging side roads, but permission must be acquired from the gate keeper at the entrance to the logging division. There is a day use fee for this area, payable at the entrance. \r\n\r\n\r\n\r\n\r\n\r\n \r",
    "directions": "Rhododendron Lake is located 21 kilometres southwest of the Island Highway near Nanoose Bay via the Northwest Bay logging mainline. A map of the area and driving directions are provided free of charge. Centre of lake: 92F/1  49?11'00\"  124?17'00\"",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/702/long_DSC00940-1--31694.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/702/reg_DSC00954-1--31694.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/702/reg_rl1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/702/reg_rl5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/702/narrow_rl4.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/rhododendron-lake-near-nanaimo-bc-702",
    "stats": {
        "Activities": "river-canoe hike mtn-bike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 2,
        "Time": "5 hrs",
        "Total Distance": "2 km",
        "Town": "Nanaimo, BC",
        "Type": "out-and-back"
    },
    "title": "Rhododendron Lake",
    "trail_id": "702"
}