{
    "description": "This is an extremely short paddle to a great spot to camp or simply explore. A trail in same the area called Stanleyville takes you to the same destination, but I couldn?t resist going back the 3Km after making camp to come back in the kayak.  It was win-win because I was able to take most of everyone?s heavy gear back in my hatches.\rStanleyville was a community that once thrived in the area. It has now since been abandoned. A few bits of evidence remain if you look along the Stanleyville River?s estuary.\rThe route hugs the coastline of Lomond that sits in the waters of the South Arm of Bonne Bay. Advantage of the kayak over the hike is that you don?t have any climbing to do, as well as you get to see the cliff faces around Lomond and Tucker?s Head. \rIf you can get close enough in your kayak, or simply get out and explore the shoreline on the camping side, to see the various rock formations, created by geology and water. The shore line is almost doable on foot, with the exception of rounding the point where the rock faces nearly drop vertically into the water. If you don?t mind getting wet for about 10 feet, go for it!\rThe camping opportunities include a fresh water supply, as well as flat areas for pitching your tent, and a pit privy.\rThis area offers great views of Killdevil Mountain, across the water, and given the right time of day for lighting, offers great photo opportunities, and the waves at the shore?s edge will make sleep come easy!\r",
    "directions": "Enter Gros Morne National Park along route 430, and take route 431 toward the Tablelands. After about 10-13K, look for the signage for Lomond, and follow the dirt road on the right toward the park. To the left is a hiking trail, and to the lower right is the dock and let in for paddling Bonne Bay.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NL/7021/reg_paddle1-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/7021/reg_paddle2-6702.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/lomond-by-kayak-near-bonne-bay-nf-7021",
    "stats": {
        "Activities": "sea-kayak river-canoe river-kayak",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "2 km",
        "Town": "Bonne Bay, NF",
        "Type": "out-and-back"
    },
    "title": "Lomond by Kayak",
    "trail_id": "7021"
}