{
    "description": "St. Paul?s Inlet is a great spot for an easy let in, terrific views and a great full day?s paddle. You get to explore the natural glacial formations that created the fjords, see waterfalls, as well as get to do some rock garden play. It?s a paddle with never a dull moment.\nI had the opportunity to be guided by a Corner Brook local, Ryan Young of Guide 4 hire.ca and we set off on a nearly 30K day trip. Given the time, it would be great to slow the pace, and camp over night up in the eastern end of the inlet where a river flows. That would give the photographer an ample opportunity to see the richly lit hills in both late afternoon and early morning. \nWe let in behind the Gros Morne Resort, from a gravel access road that sits between it and a convenience store. This takes you right down to the water where you can see inspiring views of the mountains off in the distance. It?s exciting to realize it?s there where you?re headed.\nOur first adventure encounter came in the form of seals. They sun themselves on shallow rocks, and with some skill in being low key, I was able to paddle to within 10 feet of one, who never took his eyes off me. At the last minute, he had enough and swam to a safer distance.\nAs we paddled south, we rounded a small peninsula and came upon basalt and granite rock gardens.  These are a lot of fun to cruise along side, as compared to the alternative open water crossings that lack much changing views. Although the Long Range Mountains and Tablelands beyond look stunning, it?s nice to have ever changing features so close up and personal on a longer outing.\nAfter threading our way through a rock boundary line, we continued south-east, hugging the left shore line. We continued on, taking in the steep forested and rock faced walls carved by glacier ice from long ago.\nWe paddled along until I noticed a contrasting feature along the opposite side of the water, just east of Sandy Point. A large waterfall cascaded from huge boulders, and I simply couldn?t wait for Ryan?s itinerary to see it, so like any guide?s worst night mare (good thing he?s a friend of mine), without saying a word, I sprinted off. \nAfter taking in the view and snapping some pix, I sprinted back. Ryan was searching for me with binoculars, and was relieved to have sighted me as I returned.  He was situated by some shallow sea caves that I could see on my approach. Off we continued to the far end of the inlet.\nWe exited the inlet along Bottom Brook which leads to a lake called Bottom Pond. (you see Newfoundland doesn?t name their lakes ?Lakes?, but rather, ?Ponds.?\nWe fought our way up into the waterway, paddling against the current and shallow flow. At one point, we both had to get out and float our kayaks up a gentle slope too shallow and too swift to paddle against. Soon after, we found a gravel side bar and parked for lunch.\nAll around us, the hills sloped steeply from the Long Range Mountain range Interestingly, just south of us lies the North Rim hike, one of a few back country hikes the national park offers.\nHad  I better known the geography (my GPS did have a basemap) I would have tried to push on up stream to gain access to Bottom Pond. By the looks of things, it would have been an incredible spot for camp, lunch or anything. It would put you in a central position for 360 degree views of water, cliffs, and glacial valley views.\nAfter lunch, we explored a little bit further up the brook, but soon turned around. (Oh had I known!) the return float run, involved some white water paddling experience, namely in knowing how to ferry, and Gain access to the eddy pools. It was fun while it lasted.\nUpon exiting Bottom Brook, we paddled on the south side of the inlet, and checked out yet another waterfall originating from Rainy Gulch, from which we shot some video both from the water, and from mid way up the falls.\nHaving enough visual stimulus for the day, we opted to B-line it home from Sandy Point, which meant a long open 7K line toward the edge of a nearly invisible peninsula, and a kilometre or more of water on either side. You can see the Gros Morne Resort, but if you try to paddle directly toward it, you?ll be sadly surprised that there?s a grassy land mass thwarting your passage. The crossing took us a bit more than an hour.\nRounding the point into Eastern Arm, I found the water surprisingly bath-tub warm and in only a few places shallow. We watched the rocks and sea life below the surface before landing back at the calm shores behind the Resort. It was a great paddle that went 27K in total.\nThis paddle can be done with a guide, or in a group, but Ryan says that winds can blow, pushing waves up into the narrowing inlet creating harsher conditions. There are several places to get off the water, but in many locations, the rocks are big, making landings hard. So, plan with the weather in mind,  even taking some over night gear in case you get pinned down.\nShannon Burt\nEast Coast editor",
    "directions": "Drive through Gros Morne National Park along highway 430, on your way to Cow Head. When you reach St. Paul's, cross the bridge, and look for the Gros Morne Resort. The road to the let in, is between it and the convenience store. Alternatively, let in at the bridge.",
    "geohash": "f8yg",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NL/7022/reg_0000-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/7022/reg_0940-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/7022/reg_0973-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/7022/reg_0976-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/7022/reg_0993-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/7022/reg_1001-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/7022/reg_IMG-0937-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/7022/reg_IMG-0950-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/7022/reg_IMG-0954-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/7022/reg_IMG-0968-6702.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/st-pauls-inlet-near-st-pauls-nf-7022",
    "stats": {
        "Activities": "sea-kayak",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 4,
        "Time": "5 hrs",
        "Total Distance": "27 km",
        "Town": "St. Pauls, NF",
        "Type": "out-and-back"
    },
    "title": "St Paul's Inlet",
    "trail_id": "7022"
}