{
    "description": "NTS Map:92B6.  Cuthbert Holmes Park is located between the Trans-Canada highway and Colquitz Creek.  The park is an oasis of nature within a busy urban environment. The area is important both as a migratory bird refuge, and as a spawning stream and counting station. Originally a farm, and later the site of Victoria's last drive-in movie theater, the park is a good example of remediation and the ability of nature to recover if given a little bit of help and time.\r\n\r\nThere are two main marked trails to choose from when entering the park, a paved path paralleling the highway, and a bark mulch path leading into the trees. \r\n\r\nHeading along the mulch path, the trail soon enters a wooded area and starts to display the many unmarked branch trails that network the park. Branching to the south, a narrower trail meets Colquitz Creek, offering views of migratory birds and tidal marsh. The trail will eventually meet up with a footbridge over the creek, leading to Ker Avenue. Continuing on, you will meet up with the main trail, eventually crossing a second footbridge and a choice of trails that lead to the arena, the Tillicum Mall parking lot, or across Burnside Road where you can connect with the Colquitz Creek Linear Trail.\r\n\r\nThe paved path is boarded by the highway to the north, and a large meadow to the south. While the meadow is fenced with low barbed wire, numerous unofficial trails have been created, allowing you to connect with the main park trails.\r\n\r\nThe interconnecting trails in this small park lend themselves to several hours of exploring in a quiet wooded setting. They also make this a great location for practicing compass work, mapping, GPS usage, and orienteering.\r\n There is GPS data attached to this trail (see \"download GPS\"), which if loaded into your GPS can help you find route points.\r",
    "directions": "Off Admirals Road, at junction of Trans-Canada highway\r",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/703/reg_map.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/703/narrow_cb1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/703/narrow_cb2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/703/narrow_cb4.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/703/narrow_cb5.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/cutherber-holmes-regional-park-near-victoria-bc-703",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "2 km",
        "Town": "Victoria, BC",
        "Type": "out-and-back"
    },
    "title": "Cutherber Holmes Regional Park",
    "trail_id": "703"
}