{
    "description": "Turpin?s Trail is an 8K hike just outside the community of Tilting, on Fogo Island. It starts just out side of town near where locals visit the beach, and finishes inside the historic community. Turpin was a seaman who warned the community of an impending native attack, and was beheaded as a result by the invading Beothuck. Here?s some more info on the history.\nThe hike starts at a parking lot where locals use a sandy beach. The path parallels the roadway to Tilting, and thus seems unusual as a way to start off. Soon enough it crosses a bridge, turns right, heading into the stunted softwood scrub. \nOne very distinct feature of Fogo Island, and perhaps less so if I were able to see more of Newfoundland, is the vast baron rocky territory with limited ground cover for vegetation. It?s very similar to northern tundra with erratic boulders strewn about, by receding glaciers long ago. Turpin?s Trail sits as a gravelly and stony path taking you through both dramatic inland and coastal scapes.\nOn such a beautiful day as ours was, we could see the inlets and rocky hills that make up Fogo Island. The flatter areas grow meadows, and we were happy to hear that Fogo is home to its own herd of caribou. Though we never saw the herd, we did spot one caribou eating the grass near the trail.\nThe trail has a portion that loops back to the parking lot, but another 2.5K takes you right into the community. You pass an historic grave yard dating back to the 1700?s, along with more interpretive signage.\nThis is a great trail, that doesn?t so much scream ?government economy support? in that it makes good use of the existing infrastructure in defining the route. Along the shore, the existing boulders help define the path. Some trails we?ve experienced are nothing more than coarse gravel framed by pressure treated lumber, which is great for drainage, and longevity, but poor for getting a feel for the real terrain. (not to mention expensive) If you are looking for history, a coastal experience, and a remote location, Fogo Island, the community of Tilting and Turpin?s Trail will give it all.\nShannon Burt,\nEast coast editor",
    "directions": "Fogo Island is reached by a ferry service that costs @20. You only pay to get off the island. From Route 340, take the 335 to Port Albert where the ferry service is. Drive the main road on Fogo Island  towards Shoal Bay, Joe Batt's Arm and then Tilting. The trailhead is on the left as you approach the community.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NL/7033/reg_IMG-1077-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/7033/reg_IMG-1083-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/7033/reg_IMG-1091-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/7033/reg_IMG-1092-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/7033/reg_IMG-1093-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/7033/reg_IMG-1096-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/7033/reg_IMG-1120-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/7033/reg_IMG-1121-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/7033/reg_IMG-1126-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/7033/reg_IMG-1139-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/7033/reg_IMG-1151-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/7033/reg_IMG-1152-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/7033/reg_IMG-1153-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/7033/reg_IMG-1159-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/7033/narrow_IMG-1112-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/7033/narrow_IMG-1141-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/7033/narrow_IMG-1165-6702.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/turpins-trail-fogo-island-near-tilting-nf-7033",
    "stats": {
        "Activities": "snowshoe hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "8 km",
        "Town": "Tilting, NF",
        "Type": "out-and-back"
    },
    "title": "Turpin's Trail, Fogo Island",
    "trail_id": "7033"
}