{
    "description": "NTS Map:92B5.  The Devonian Park trails lead through thick forest and mixed woodlands to the cobble beach at Parry Bay. There are two main trails in the park; the Beach Trail leading through the center of the park, and a bridal path following the west perimeter of the park. \r\n\r\nThe bridal trail is the easier of the trails to walk as it follows the contours of the land in rolling arcs, as opposed to the rapid elevation changes of the Beach Trail.  \r\n\r\nFollowing the Beach trail, you encounter dense ferns, Douglas fir and broadleaf maples as the trail follows Sherwood Creek to Sherwood Pond. Sherwood Pond is a staging area for migratory birds, such as turnstones and sandpipers. Proceeding onwards, the vegetation along the trail rapidly changes to coastal arid varieties, and then to salt marsh. At the same time, the trail itself changes from packed mulch and dirt, to rock, and finally cobble as you approach the beach.\r\n\r\nThe bridal trail is boarded on one side by a fenced pasture, and on the other side by the forested areas of Devonian Park. Walking along the rocky bluffs, good views of Victoria, Esquimalt, the  Juan de Fuca Strait , and the Olympic Mountains are seen as you climb up from the beach.\r\n\r\nTo extend the length of your hike you can follow the beach towards Witty's Lagoon, and head up Taylor Road, turning left on William Head Road to return to the parking lot. You can also hike the 3 kilometres to Witty's Lagoon at low tides.\r\n\r\n There is GPS data attached to this trail (see \"download GPS\"), which if loaded into your GPS can help you find route points.\r\n\r\n\r",
    "directions": "Colwood exit on Trans-Canada highway. Turn left on Metchosin Road, (turns into William Head Road). Trailhead at 10U 459886E 5351133N\r",
    "geohash": "c285h",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/704/reg_map.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/704/narrow_dev1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/704/narrow_dev2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/704/narrow_dev3.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/704/narrow_dev4.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/devonian-regional-park-near-victoria-bc-704",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "5 km",
        "Town": "Victoria, BC",
        "Type": "out-and-back"
    },
    "title": "Devonian Regional park",
    "trail_id": "704"
}