{
    "description": "NTS Map:92B6.  Albert Head Lagoon Regional Park has a sand and cobble beach that encloses a small tidal lagoon; the lagoon is a wildlife and a migratory bird sanctuary.\r\n\r\nAlthough the 7 hectare park is small, it offers many recreational opportunities, including hiking, swimming, kayaking and canoeing. This is a great place to have a quiet picnic while the kids play in the water and on the beach. The narrow spit in the park is mixed cobble and sand on the east side, and has a large amount of driftwood. Crossing the spit towards the west, the change in scenery and vegetation is dramatic. Coastal marsh grass covers the shoreline, with a mixture of small firs and shrubs at the edge of the creek at the south end.\r\n\r\nOn calm days this is very good launch location for exploring the waters around Albert Head, or as a starting point for a trip to the Esquimalt Lagoon, or Wittie's Lagoon. From the parking lot, the water is a short 50 foot carry. Several small islands and a sweeping bay are located between the beach and Albert Head, less than a kilometer to the southeast. Albert Head is Department of National Defense property, and therefore landing is prohibited in marked areas and at the small dock in the bay.\r\n\r\nThe section of beach that is enclosed by the park is only 400 metres long, ending to the south at a small creek that flows into the enclosed lagoon. At low tides you can cross the stream and hike up hill and then along a rough trail along the bluffs, following the DND fence line to the south for some great views of the cove, Victoria to the northeast, and the Olympics to the south. Hiking past the park boundary to the north, you can walk along the beach to Gotha Point, 4.5 kilometres away at the end of the Esquimalt Lagoon. Midway along this route, you pass underneath a gravel and sand loading pier, and past some spectacular sand bluffs.\r\n\r\nThere is GPS data attached to this trail (see \"download GPS\"), which if loaded into your GPS can help you find route points.",
    "directions": "From Metchosin Road, turn onto Farhill Road. Farhill turns into Park Drive, and then Delgada Road. The parking lot is at the end of Delgada Road, at UTM 10U 10U 463809 5360419.\r",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/706/narrow_ah1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/706/narrow_ah3.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/706/narrow_ah4.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/706/narrow_ah5.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/albert-head-regional-park-near-victoria-bc-706",
    "stats": {
        "Activities": "river-canoe sea-kayak hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "1 km",
        "Town": "Victoria, BC",
        "Type": "out-and-back"
    },
    "title": "Albert Head Regional Park",
    "trail_id": "706"
}