{
    "description": "The Sinkhole used to be one of my favorite trails in Western Newfoundland. The quiet forest trail was a great place to walk and enjoy \nthe beauty of nature. Unfortunately, the local paper company, arrived since my last visit a few years ago and clear cut a very large area, including the Sinkhole trail. The trail now consists of a machine road and a panoramic view of thousands of tree stumps.\nDespite my disappointment, I still enjoyed being back in the area, and you can now get a great view of Bonne Bay! The trail starts just outside the boundary of Gros Morne National Park near Lomond River. It is accessed through an old dirt road that leads to a communication tower 6.5km into the wilderness. The road is rough and you will need a vehicle with high clearance if you decide to drive to the trailhead. You could also hike it straight from the highway.\nThe trail is currently marked with green ribbon and you will know you are close when you begin to hear rushing water. The Sinkhole itself is a large depression in the earth the sinks down well over a hundred feet. A cascading waterfall pours from the top and disappears into the rocks below. Local lore suggests that it eventually drains into Little Bonne Bay Pond. You can climb down with the help of a rope and explore the bottom but beware of slippery rocks. Another interesting thing is a large pile of sawdust at the bottom, remnants of an old mill.\nDespite the destruction of the original trail this route is well worth the short amount of time it takes to complete it. The waterfall is absolutely amazing and you can get some breathtaking views of the entire countryside.\nRyan Young\nNewfoundland Editor",
    "directions": "You access this trail by taking an old woods road near Lomond River Lodge. Take the road between the two bridges that cross Lomond River. Turn right at the first fork and follow the road for about 5km. You will see a large machine rope. AT the time of this article the trail was marked with green flag tape.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NL/7061/reg_sh1-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/7061/reg_sh2-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/7061/reg_sh3-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/7061/reg_sh4-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/7061/reg_sh5-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/7061/narrow_sh6-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/7061/narrow_sh7-7064.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NL/7061/narrow_sh8-7064.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/the-sinkhole-near-woody-point-nf-7061",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "4 km",
        "Town": "Woody Point, NF",
        "Type": "out-and-back"
    },
    "title": "The Sinkhole",
    "trail_id": "7061"
}