{
    "description": "A short ~5.5 mile trail to pristine back country lakes in the Selway-Bitteroot wilderness. If you want to be alone in the woods this is your place.\nThis trail starts 13 miles up a bad dirt road which requires high clearance vehicles (any standard 4x4 truck or SUV will make it). The bad road means that you'll probably have the trail head all to yourself. The Cove lakes are only 300 ft higher than the trail head but there is about 2000 ft of elevation change along the way. The area is mostly sub alpine and in mid July there were snow patches in shady spots.\nThe trail starts at ~6000 ft by dropping 500 ft over a mile and then crosses a small stream. A short 300 foot climb and then another drop of 500 ft covers the second mile. With a stream crossing over a very skinny log. The next 3 miles climb from ~5200 ft to ~7000 feet and have great views of the surrounding valleys of and entrance to the Selway crags. The last half mile drops rapidly 800 feet to the Cove lakes.\nThe lower and larger lake has sever camp areas is crystal clear, deep and nice for swimming on a hot day. Small trout are abundant but not really big enough for eating. From the cove lakes a hike over jessie pass will  bring you into the Selway Crags.",
    "directions": "Lowell on US 12 in Idaho, head ~15 miles down the Selway river road. Take the seasonal Fog Mountain road 13 miles till it dead ends at the trail head. Three trails leave from the trail head, the Cove lakes trail is the northern most trail.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/ID/7069/narrow_Cove-Lakes-057-31839.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/cove-lakes-near-kooskia-id-7069",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 3,
        "Time": "4 hrs",
        "Total Distance": "9 km",
        "Town": "Kooskia, ID",
        "Type": "out-and-back"
    },
    "title": "Cove Lakes",
    "trail_id": "7069"
}