{
    "description": "NTS Map:92B5.  The Tower Point section of Witty's Lagoon Regional Park features a large grassy meadow, several small rocky beaches and trails along the rocky shoreline of Parry Bay. \r\n\r\nThe hike from the parking lot starts with a gravel section bordered by blackberry bushes, and then opens up into a large grassy field. Crossing the field, you soon see Witty's Beach to the South.  Slightly further on are two small side trails that lead to small rocky beaches. Race Rocks and the Olympics are visible to the south, and Victoria to the east.\r\n\r\nContinuing on to the western point of the park, the trail curves to the north, and several small islands and Albert Head come into view. At low tides a short scramble down a rocky path brings you to yet another small rock and cobble beach. Blue Herons frequent the small islands, which are within a stone's throw of the trail. \r\n\r\nContinuing to the north, the park boundary is marked by a fence, and the trail heads uphill through trees, and then back down the north edge of the field you walked past when you first entered the park. \r\n\r\nThere is GPS data attached to this trail (see \"download GPS\"), which if loaded into your GPS can help you find route points.\r\n\r",
    "directions": "Metchosin Road to Duke Road, and then Olympic View Drive to the parking lot. UTM 10U 462399 5359427\r\n\r",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/707/narrow_tp2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/707/narrow_tp4.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/707/narrow_tp5.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/tower-point-witties-lagoon-near-victoria-bc-707",
    "stats": {
        "Activities": "river-canoe sea-kayak hike mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "2 km",
        "Town": "Victoria, BC",
        "Type": "out-and-back"
    },
    "title": "Tower Point - Wittie's Lagoon",
    "trail_id": "707"
}