{
    "description": "(The 8K is measured one way)\nThe Tea Pot is a sandstone sea stack that still stands, un like the famous elephant Rock of years ago. You can visit this point of interest by walking up the beach from the private campground known as Twin Shores, or you can get more interactive views by using your kayak.\nWe chose to make it an interesting paddle by launching from Darnley Basin and paddling around a small landmass to arrive at the sea stack, and exit through the campground. This is on PEI's North Shore.\nWe found our let-in by hunting around the cottage roads until we found beach access from Darnley Basin. From there, we found the scenery to be low lying red cliffs and white sand beaches around the channel. Be careful of the tides if you choose to paddle through the narrow channel, as rips could make it a challenge coming or going at any other time of the tide cycle. The basin is fairly shallow.\nAs we passed along the outter coast, we found more secluded beaches and low clay cliffs. The tide, currents and shallow water made padding a chore, but getting further away from shore would make the trip visually dull.\nOnce you round the corner and paddle along the North Shore, you can see the pointed top of the Tea Pot off in the distance. Along the way, you'l see the popular beach and all the campers enjoying the summer-warmed ocean water. About one Kilometer later, yu will arrive at the teapot.\nThe sea stack is best viewed in the morning hours, preferably early with the low sun revealing deep shadows and textures in the red sandstone. Unfortunately we visited in the mid afternoon, so the lighting wasn't as apealing. Still, with the right tides and light, you can have a blast kayaking around this rock formation, and get some great photos. For an easy paddle, it's worth it as a kayaking destination.\nShannon Burt\nEast Coast editor",
    "directions": "From Kensington, take route 20 toward Malpeque, and continue right. The road will cross a bridge, which could serve as an alternative let in, but there is a retainer wall along the banks. At Darnley, take a left at the Lower Darnley Road, and look for Darnley Basin Lane on the left. Or, simply drive further to Twin Shores Campground, and get to the beach to make your paddle way shorter.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/PE/7073/reg_IMG-2096-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/7073/reg_IMG-2121-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/PE/7073/reg_IMG-2129-6702.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/the-tea-pot-darnley-near-malpeque-bay-pe-7073",
    "stats": {
        "Activities": "sea-kayak",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "8 km",
        "Town": "Malpeque Bay, PE",
        "Type": "out-and-back"
    },
    "title": "The Tea Pot, Darnley",
    "trail_id": "7073"
}