{
    "description": "NTS Map:92B12, NTS Map:92B11, NTS Map:92B6, NTS Map:92B5.  The Galloping Goose Regional Trail is named after Car #15813, a noisy, gas-powered passenger car that carried passengers and mail from Victoria to Leechtown. During its gold rush days, Leechtown had a population larger than that of Victoria, but the population declined rapidly when the gold rush ended. Starting in 1922, The Canadian National Railway serviced Leechtown, but the service was dropped in 1931, as there was no profit in running a train to a ghost town. From 1931 to 1971, the line was used by freight trains carrying logs and supplies.\nIn 1987, as part of the Rails To Trails program, the rails and ties were removed from the line and the rail bed was cleaned up to become suitable for use as a recreational corridor. As it follows the former railway right-of-way, the Galloping Goose runs from downtown Victoria to Sooke, passing through urban, rural, and wilderness areas and ends at the remains of Leechtown. The Galloping Goose is included in the Cowichan portion of the BC Trans Canada Trail System.  \nThe trail has many access points at road crossings, however, there are only six points where parking is authorized, plentiful, and free:  at km 10, Atkins Road just south of the Trans-Canada highway underpass (washrooms). This parking lot is accessed by turning off Sooke Road onto Six Mile Road, and then turning right at the Galloping Goose overpass.At km 14, Aldeane Avenue, off Sooke Road (across from the entrance to Royal Roads).At km 17.5, Glen Lake Road, off Sooke Road. At km 30, the parking lot for Matheson Lake, south of Malloch Road on Rocky Point Road.At km 35, the parking lot for Roche Cove Regional Park (washrooms).At km 44, a small parking lot off Sooke River Road, just before Sooke Potholes Provincial Park.\nBC Transit operates buses equipped with bike racks on many routes, including routes to View Royal, Colwood, Langford, Metchosin, Sooke, and Swartz Bay. The bus service provides a low-cost, convenient alternative to cycling or hiking back to your starting destination after a long trip on the trail.\nThe trail can be divided roughly into three main sections, each with its own trail characteristics and level of traffic:The first section, running from the center of downtown Victoria to the junction of Highways 1 and 1A near Thetis Lake, is a paved section used by cyclists, pedestrians, and rollerbladers. Although this is the busiest of the three sections, most trail users are considerate and stay to the right hand side of the trail. The 1:20 000 aerial photograph of downtown Victoria has the first 19 trail waypoints superimposed on it, and corresponds to the UTM grid map.Starting from Johnston Street Bridge, the trail follows the Selkirk Waterway to the Selkirk Trestle, follows the abandoned train right-of-way cut underneath Gorge and Burnside Roads, and then opens into a light industrial area. Passing over the Trans-Canada Highway on the Switch Bridge, the trail becomes a paved corridor set back from and parallel to the Trans-Canada highway. At the Helmcken underpass tunnel, the trail starts to veer away from the highway, and becomes mostly hard packed dirt with some paved sections.Side trips include Cuthbert Holmes park and the Colquitz Linear Trail System, the Lochside Cycling trail, and Thetis Lake Regional Park. \nThe second section takes you through View Royal, Colwood, Langford, and Metchosin, and ends at Roche Cove in East Sooke. This section of the trail is packed dirt/gravel, and is used by cyclists, pedestrians, and equestrians. The amount of traffic on the trail is quite low in this section, the users being predominantly mountain bike riders.Passing through the communities of View Royal, Colwood, and Langford, the trail starts to take on much more of a rural look, although it has many road crossings, including major intersections on Sooke, Kelly, and Jacklin Roads. Although the trail remains mostly flat, it does climb and fall gently in some areas. Crossing Sooke Road at the intersection of Glen Lake, the trail rapidly becomes increasingly wooded, quieter, and more characteristic of an old rail line.  Heading through Metchosin, the trail passes pastures, farms, small creeks, and arbutus-covered hills. Nearing the section around Matheson Lake, the trail narrows and is surrounded by rock and trees, but opens again as you near Roche Cove. Looking above Roche Cove and Matheson Lake in the aerial photograph, the Galloping Goose is shown as a cut line through the trees.Side trips include Mill Hill Regional Park, Esquimalt Lagoon, Fort Rodd and Fisgard Light National Historic Sites, the gardens at Royal Roads University, Albert Head Lagoon Regional Park, Witty's Lagoon Regional Park, Devonian Regional Park, Pedder Bay, East Sooke Park, Matheson Lake Regional Park, and Roche Cove Regional Park. \nThe third section runs along the Sooke Inlet, turns inland to Sooke Potholes park, and ends at Leechtown, an abandoned mining town. This section of the trail is used by cyclists and equestrians, and is packed gravel/dirt. Past Sooke Potholes, the traffic is very low on the trail and it is advisable to travel with a companion or in a small group.From Roche Cove, the trail passes through the coniferous forests of Sooke as it follows the edge of the Sooke Basin. At km 39, nearing Coopers Cove, the trail crosses Sooke Road and then passes through the Ayum Creek residential area. Intersecting with the Sooke River, the trail becomes an almost steady uphill climb as you head through the Sooke River Valley toward Sooke Potholes Provincial Park.Past the potholes, the Galloping Goose truly looks like a train right-of-way, with sections of train rail and wooden ties seen just off the trail. It is easy to imagine an old train struggling to surmount the seemingly endless uphill grade in this section, and the trail levels only when it crosses the rebuilt trestles that pass high above Charters Creek at km 46 and Todd Creek at km 47.  Pushing on towards Leechtown at km 55, you pass numerous swimming holes, abandoned logging equipment, and more scattered remains of the former railway line. Leechtown is outside the boundaries of the trail property, and sits on privately owned land. There is only one way out ? back the way you came, but it's almost all downhill and a breathtaking ride.Waypoint list:0\tE&N Train Station 1 \tJohnson Street Bridge2\tHarbour Road South 3\tHarbour Road north4\tBay Street Bridge underpass.5\tSelkirk Trestle south approach, Arthur Currie Lane. 6\tSelkirk Trestle north approach, Waterfront Crescent7\tGorge Road East bridge underpass.8\tBurnside Road East bridge underpass9\tDupplin Road10\tKelvin Road11\tArdersier Road12\tSwitch Bridge south approach, Cinduthel Road13\tSwitch Bridge north approach, Carrey Road14\tHarriet Road, parallel to Trans-Canada Highway15\tTillicum at Trans-Canada Highway16 \tBurnside Road West overpass17\tMcKenzie Avenue at Trans-Canada Highway18 \tAdmirals Road.19\tGrange Avenue20\tBelgrave Avenue21\tWilkinson Road overpass22\tEaton Avenue23\tCamden Avenue24\tQuincy Street25  \tHelmcken underpass 26\tErskine Lane27\tTalcott Road28\tBurnside Road West29\tTCH underpass at Burnside Road West 30  \tSooke Road, parking lot 31 \tSix Mile Road overpass32\tAtkins Road33\tAtkins Road34\tAtkins Road35  \tNobhill Road36\tNobhill Road at Sooke Road 37\tBelmont Road underpass38  \tAldeane Avenue at Sooke Road39\tHagel Road40\tPickford Road41 \tKelly Road42\tBrittany Drive, bad intersection43  \tJacklin Road44\tGlen Lake Road at Sooke Road45  \tLuxton Hall at Marwood   46\tEnglewood Road47\tLuxton Road at Van Island Rangers 48\tHappy Valley at Loma Linda Drive49\tWinter Road50\tHappy Valley Road at Glen Forest Road51 \tLindholm Road 52\tBennett Road53 \tKangaroo Road at Rocky Point Road 54\tTaylor Road55 \tLombard Drive 57 \tRocky Point Road58 \tGillespie Road nn\tSooke Road near Coopers Cove nn\tLudlow Roadnn\tHarbourview Roadnn\tWoodlands Road 40.6 kmnn\tMeota Drivenn\tSooke River Road nn\tSooke River Road 44 kmnn\tCharters Trestle 44.8 kmnn\tTodd Creek Trestle 46 kmnn\tLeechtown 55 km\nFurther information:The Victoria Cycling Federation has produced an excellent map showing the Galloping Goose and Lochside trails, along with parks and cycling routes. The map covers the area from Swartz Bay to Port Renfrew, and is available at most cycle shops in Greater Victoria.\nThe Victoria Capitol Regional District website has a downloadable map and description of the Galloping Goose, and information, maps, and directions to many of the parks near the trail route.\nThere is GPS data attached to this trail (see \"download GPS\"), which if loaded into your GPS can help you find route points.",
    "directions": "See description for parking locations.",
    "geohash": "c28",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/708/long_Galloping-Goose-Trail-Sooke-Bassin-May-9-2015-2--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/708/long_Galloping-Goose-Trail-Sooke-May-9-2015-3--44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/708/reg_DSC00055-7279.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/708/reg_DSC00057-7279.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/708/reg_Leechtown-sign-7279.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/708/reg_Sooke-bay-2-7279.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/708/reg_W-GG-trail-3-7279.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/708/reg_matheson_lake.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/708/narrow_Galloping-Goose-Trail-Lake-May-9-2015-44639.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/708/narrow_best1_gg2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/708/narrow_downtown_air.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/708/narrow_gg1.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/galloping-goose-near-victoria-bc-708",
    "stats": {
        "Activities": "mtn-bike hike",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 5,
        "Time": "14 hrs",
        "Total Distance": "55 km",
        "Town": "Victoria, BC",
        "Type": "out-and-back"
    },
    "title": "Galloping Goose",
    "trail_id": "708"
}