{
    "description": "This is a nice loop trail on one of the larger foothills overlooking the town of Golden, Colorado. The trail is narrow, suitable for hiking only, but is well maintained and has spectacular views that permit views of Downtown Denver and out to the flatlands beyond.\r\rThe loop trail consists of two named trails. Cedar Creek trail heads up the hillside from the trailhead and meets the Mt Galbraith Loop trail about halfway up. \r\rIt is recommended that you proceed around the loop in a counter-clockwise direction. This permits you to proceed up the few stairlike sections of the trail, and also leaves the most spectacular views for the end of the loop.\r\rThere is very little shade or treecover on the trail, which provides for some amazing views all the way around the trail, however, it does require that you plan for a fair amount of sun exposure. The trail does not ever crest the top of the hill, most likely to prevent lightning strikes from harming hikers during the sometimes spontaneous storm-fronts that pass by. There is however a delightful spire of rock beside some trees halfway around the loop at the highest point with some spectacular views and a bit of shade if you decide to pause for a snack break.\r\rBecause of the narrowness of the trail, a subtle dance is required when passing other hikers, so be polite; this is a popular trail for trail runners. Also, in places, flat rocks have been arranged to form stairs that would be impossible to navigate in a wheelchair.",
    "directions": "Access to this trail is incredibly easy. Follow Hwy 470 to Hwy 93 near Golden and take the Golden Gate Canyon Rd exit west towards the foothills. The trailhead will be on the left 2.4 km (1.5miles) from the intersection.\r\rThere is ample parking at the trailhead, as well as pit toilets which are made from stainless steel and kept quite clean.Unfortunately they still provide a certain tangible odour to the parking area. No running water is present.",
    "geohash": "9xj4",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/CO/7087/reg_galbraith007-20033.jpg",
        "https://trailpeak.com/storage//content/trails/US/CO/7087/reg_galbraith009-20033.jpg",
        "https://trailpeak.com/storage//content/trails/US/CO/7087/reg_galbraith011-20033.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mount-galbraith-park-near-golden-co-7087",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "7 km",
        "Town": "Golden, CO",
        "Type": "out-and-back"
    },
    "title": "Mount Galbraith Park",
    "trail_id": "7087"
}