{
    "description": "although some people climb this mountain in the winter, it is best climbed in late summer or early fall to avoid large patches of snow and to enjoy good weather and good views. The trail itself is about an 8 hour hike to the top of a 1500 m peak at the west end of Sproat Lake near Port Alberni. You climb about 1000 meters during the hike. Getting to the trail head from Port Alberni is about a 1:40 hour drive. A 4X4 vehicle is required as the last portion is very rough and steep and the logging road has been deactivated (has drive-through cross-ditches). The trail itself is fairly clear if you look carefully. It is also ribboned reasonably well. The lower part is through an impressive stand of Western Hemlock and Amabilis Fir. Once you get to a small lake/large pond the forest opens up a bit. There are a few wet slippery sections. The top part is a a rock scramble, but not technical.",
    "directions": "From the corner of Johnston Road and River Road (Hwy 4) by the river in North Port Alberni it is about a 30 km drive. Get yourself a Backroads of BC book (http://www.backroadmapbooks.com/main/index.html ) and follow the directions to the upper Nahmint River.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/7090/reg_KlitsaTrailhead-16063.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/7090/reg_Klitsastart-16063.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/7090/reg_viewfromklitsaSummit-16063.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/7090/narrow_Klitsa2-16063.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mount-klitsa-brook-george-trail-near-port-alberni-bc-7090",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 4,
        "Time": "8 hrs",
        "Total Distance": "16 km",
        "Town": "Port Alberni, BC",
        "Type": "out-and-back"
    },
    "title": "Mount Klitsa, Brook George Trail",
    "trail_id": "7090"
}