{
    "description": "Technical single track trails featuring bridges, rock gardens, tough short climbs and downhills, twisty single track roots etc.   Good to ride when other areas are still wet as there is great drainage.   The more advanced (not really double black -- intemediate by most standard but really fun) are harder to find, and are closer to the start area, closer to the plant than the far reaches of this network (not even as far as the open pit area).  Stop in at the local bike shop for detailed maps, or, click expand + on the right, and click \"play GPS\".  Zoom in as far as you can, and notice when the icon moves to Barrick road (close to the end of the session) and heads south into a wonderful forest area, this is the start of the more technical and well constructed trails.  The other trails of note are the ones that hug the slope off the pit area (towards the canal), however, generally avoid the lowland area itself close to the canal, It can get really wet in Spring and it will be a muddy slog. Great fun for a few hours - check out the canal ships, and if you want some extra scenic miles -- take the canal paved path -- as far as you want (to St. Catherines if you like).",
    "directions": "Take Main St. (Hwy 3)  and park at lock 8 park (at the jackknife bridge over the welland canal.  Trails are in the lands by the old Robin Hood Mills grain elevators on the north end of Port Colborne.   You can see the grain elevators from many kms away.  Park at Lock 8 Park and take the paved bike path north over a bridge.   Some trails are marked with green arrows.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/ON/7094/reg_IMGP1061Lcr-0.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/7094/narrow_CDMR-2010-43-0.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/the-hood-near-port-colborne-on-7094",
    "stats": {
        "Activities": "mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "20 km",
        "Town": "Port Colborne, ON",
        "Type": "out-and-back"
    },
    "title": "The Hood",
    "trail_id": "7094"
}