{
    "description": "This is a hike that will take you to see two beautiful waterfalls one of which is truly spectacular as it is located inside a slot canyon on the George Fraser Brook.  From where you park by the edge of the blueberry field, follow the old road that goes around the edge of the field and is overgrown by alders.  Continue on this road towards the forest.  Once in the forest, you need to go down the steep ravine in front of you.  Try to always go to your left in order to intersect the stream at a point that is lower that the slot canyon and waterfalls.  It is impossible to enter the canyon from upstream, unless you have some serious climbing skills and gear.  There is some flagging tape in the woods but not enough to guide you so use your best judgment or follow my gps track posted below.  The forest is easy to navigate as there is little brush in this mature evergreen forest.I eventually made it to the stream and I was about 50m from the entrance to the slot canyon.  Total distance so far from your car?about 500m.  There is a nice waterfall of about 20ft that exits the slot canyon.  Make your way to the left (direction are always by looking upstream in this post) of the fall, up the bank using some ropes that are already there and you can drop to the top of the waterfall using a piece of rope attached to trees.  This is a useful piece of rope as it is a 6-8ft straight drop to the stream.  Prepare your self to be amazed from this point on.  Apart from the areas near Wards Falls and Sammy Higgins Falls, you have never seen a site like this in Nova Scotia; a slot canyon.  The river has carved a deep canyon here of about 150ft long through the rocks and in some places even leaving an arch overhead.  The sides of the canyon must reach something like 200ft in the air?truly an amazing site.  At the end of this passage you will see another nice waterfall.  My pictures do not do justice to this place.  It is fairly dark in there and with the sunny condition on the day I was there most of the pictures are partially overexposed (i.e. bring a ND filter for your camera).To get out of the canyon, you can reuse the same rope you came in with or there are some more ropes above the first waterfall that will take you up the ledge on the right hand side of the stream (looking upstream).  Be careful anytime you are using those ropes because you don?t know how long they have been there so don?t rely entirely on them. Also, I was there in a relatively low flow condition of the stream which enabled me to see the whole slot canyon.  I can assume that after a big rain event, you will need to swim or wade to see the furthest waterfall.",
    "directions": "Take the Bennet Hill Road off Highway 209 (west of Parrsboro).  Drive about 2km on this road to a T intersection in a big blueberry field.  Turn left and park just before the road turns to the right and starts to climb a steep hill.  Go southwest from this point as if following the old road on the edge of the blueberry field.",
    "geohash": "f8442",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/7098/reg_DSC-0036-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/7098/reg_DSC-0044-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/7098/reg_DSC-0055-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/7098/reg_DSC-0079-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/7098/reg_FraserCanyon3.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/7098/narrow_9-44070.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/7098/narrow_DSC-0010-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/7098/narrow_DSC-0013-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/7098/narrow_DSC-0014-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/7098/narrow_DSC-0016-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/7098/narrow_DSC-0020-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/7098/narrow_DSC-0021-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/7098/narrow_DSC-0032-27177_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/7098/narrow_DSC-0051-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/7098/narrow_DSC-0092-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/7098/narrow_DSC-0094-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/george-fraser-brook-slot-canyon-near-parrsboro-ns-7098",
    "stats": {
        "Activities": "climb hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 5,
        "Time": "1 hrs",
        "Total Distance": "3 km",
        "Town": "Parrsboro, NS",
        "Type": "out-and-back"
    },
    "title": "George Fraser Brook Slot Canyon",
    "trail_id": "7098"
}