{
    "description": "This is a hike that will lead you to Wards Falls and the many slot canyons located upstream of the fall.  Although there is a well defined 8km trail that can take you all the way to the base of the falls, I am describing a quicker way to get there with minimal bushwacking.From the transmission tower, go towards the guiding wire located on the left (if facing the diligent river valley).  If you kind of go straight down from this point, you should find yourself about 100m upstream from the main canyons on the diligent river.  From the tower to the stream, it will be about 300m in a very nice  mature deciduous forest with a high canopy overhead.  There is a smaller canyon just upstream from this point but since the other ones are way bigger, I wouldn?t bother about this one too much.  As you come in upstream from the first section of canyon, you will be able to climb down a 5ft waterfall and into the slot canyon ahead without too much difficulty.  Mind you, I was there in low water condition?.it must be impossible to get in after a big rain event.  You can walk in about 20-30 ft before another waterfall impedes your way.  This one fall into what looks like a deep pool and the walls on either side cannot be scaled to follow the stream.  Therefore make your way back upstream and up the first waterfall.  Make your way to the right bank (facing upstream) and up the steep slope.  Keep heading downstream at this point and look for a small area where there is enough trees and terrain to safely take you down into what I will call the middle of the slot canyons.  At the rivers edge make your wau upstream into the large canyon ahead and you will be able to see the waterfall and pool that you couldn?t navigate before.  Exiting this canyon, I tried to follow the stream again but it proved to be impossible with high walls on either sides and deep pools.  I therefore made my way up the left bank this time about opposite to where I came down to the river.  At this point you will need to go very high up the ravine to bypass the biggest section of the slot canyon.  I made my way through some thick evergreen trees to an area where a mature forest was dominating and the terrain was easy to come down the ravine.  In this mature forest, I was able to pick up a trail that took me all the way down to Wards Fall and the amazing large and deep canyon located upstream of the fall.Although the fall is kind o f nice, the canyon above it is spectacular.  There used to be a ladder to take you above the fall.  In September 20101, it wasn?t there but there were some ropes to the right hand side of the fall which enables me to climb above the fall.  Once above the fall you will enter a large and deep canyon carved from the river into solid rock.  You can see the sky above you but it is a good 150-200ft above your head.  Again I was able to go deep into this canyon because the water was low.  From the debris in there, I would suggest not to attempt this at high flows.Once I was done, I climbed back up the trail on the left bank towards the transmission tower.  With minimal bushwacking, I exited the woods by the guiding wires that sit opposite the road that leads to the transmission tower.",
    "directions": "From highway 209, take Ramshead River Rd towards York Settlement and turn right on York Rd and continue on the main road as it climbs through blueberry fields.  You will soon see the transmission tower and the roads will eventually lead you there.  I parked about 500m from the tower see the GPS track) because part of the road had been washed out and the low clearance on my Echo prevented me from driving ahead.",
    "geohash": "f844",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/7099/narrow_DSC-0103-27177_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/7099/reg_1-44070.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/7099/reg_15-44070.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/7099/reg_DSC-0079-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/7099/reg_DSC-0083-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/7099/reg_DSC-0088-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/7099/reg_DSC-0097-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/7099/reg_DSC-0121-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/7099/reg_DSC-0123-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/7099/narrow_DSC-0072-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/7099/narrow_DSC-0102-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/7099/narrow_DSC-0106-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/7099/narrow_WardsFalls2-Text-62833.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/diligent-river-canyon-wards-fall-near-parrsboro-ns-7099",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 5,
        "Time": "2 hrs",
        "Total Distance": "4 km",
        "Town": "Parrsboro, NS",
        "Type": "out-and-back"
    },
    "title": "Diligent River Canyon (Wards Fall)",
    "trail_id": "7099"
}