{
    "description": "NTS Map:92F2.  MacMillan Provincial Park is home to Cathedral Grove, 136 hectares of old growth forest. Logging companies plan to log right up to the boundary of the park, making a visit to this park an important educational opportunity that will spread awareness of how important and diverse our coastal forests are. \r\n\r\nThe park is divided into two sections, separated by a short but sometimes perilous crossing of Highway 4.\r\n\r\nOn the south side of the highway, three interpretive trails are available for easy walks through old-growth Douglas firs that are as old as 800 years and have circumferences of up to 9 metres . The shortest, Big Tree Trail, is a short walk and offers close up views of the magnificent trees, viewing platforms and many photo opportunities. The longest trail, the Riverside Trail, and the Living Forest Trail connect at points with the Cameron River.  On the north side of the highway, the Old Growth Trail offers two loops through ancient Western red cedars, Western Hemlock, and Grand fir.  A short branch trail that leads to Cameron Lake.",
    "directions": "16 km east of Port Alberni on Highway #4. The center of the park is at 49?17'00\"  124?40'00\"   \r\n\r\n\r",
    "geohash": "c0z27",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/710/narrow_cg1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/710/narrow_cg2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/710/narrow_cg3.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/710/narrow_cg4.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/710/narrow_cg5.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/cathedral-grove-macmillan-park-near-port-alberni-bc-710",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 5,
        "Time": "2 hrs",
        "Total Distance": "2 km",
        "Town": "Port Alberni, BC",
        "Type": "out-and-back"
    },
    "title": "Cathedral Grove - MacMillan Park",
    "trail_id": "710"
}