{
    "description": "This is a hike that follows an ordinary stream that crosses the highway North of Parrsboro.  Follow it for less than 1km and you will witness a spectacular two-tier waterfall.  The start of the so called trail traverses a farmers field.  Please seek permission.Park on the side of the road where the cattle fence runs alongside a large hill covered by blueberries.  Follow the fence (there is a faint trail) towards the woods.  There is a lot of blackberry/ raspberry in this section so I wouldn?t recommend wearing shorts.  After 300m, you will enter the woods and follow the stream.  The ravine slopes are steep so the easiest way to the fall is to hop across the rocks within the stream channel.  The forest is a mixture of mature deciduous and evergreen trees.  You will go up a small cascading portion of the stream and then after just a few minutes will come up to the beautiful 50ft waterfall.  There are two sections of the fall and I wasn?t able on that day to climb to see better the upper portion.  There is a large pool at the base of the fall which would make this place suitable for cooling off in the summer.  Although this is not the longest hike you will ever do, it?s a good place to visit if you only have a half hour or so.  There is some indication of another fall more upstream but I didn?t have the chance to hike my way up to see it.",
    "directions": "On highway 302 towards Parrsborro, park at  45.476836°, -64.344996° and hike upstream.",
    "geohash": "f844x",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/7100/narrow_DSC-0126-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/7100/narrow_DSC-0130-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/7100/narrow_DSC-0131-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/hannas-brook-fall-near-parrsboro-ns-7100",
    "stats": {
        "Activities": "snowshoe hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "2 km",
        "Town": "Parrsboro, NS",
        "Type": "out-and-back"
    },
    "title": "Hannas Brook Fall",
    "trail_id": "7100"
}