{
    "description": "This rough trail connects north end of the North Blue Forestry Road to the backcountry operating base of Snowy Mountain Alpine Tours. \nThe trail descends a clearcut before making its way up the valley.  Leaving the clearcut the trail angles down through slide alder before reaching a main creek.  This creek has a major caribou trail connecting the valley bottom to the alpine to the east.  There is space for two small tents at the creek.  The trail then descends an aging cutblock before using an overgrown skidroad and wet meadows to a bridged crossing of the North Blue just south of a prominent treed hump visible from the parking lot. After more old skidroad, the trail crosses a wet meadow and dips into the woods.  The remainder is in old growth forest and climbs the west side of the valley to reach a moist meadow area.  Snowy Alpine's buildings are at the north end of the meadow.  The trailhead is about 6m higher than the buildings, so the trail climbs the same amount, 200m, in both directions.",
    "directions": ".7km north of the North Blue River bridge north of Blue River, turn west onto the North Blue Forest Service Road.  The turnoff from the highway is signposted as Blueberry Road.  Drive to the north end of the North Blue FSR.  Follow the cat road 30m beyond the parking area to the trailhead.  The valley containing the route can be seen ahead.\nThe first 16km of the North Blue FSR is drivable with ordinary cars, but the last 8km requires suv-level clearance.  The final 2km are rough and steep, requiring a low range.\nWaypoints:\n52:12:00-119:25:54=+0.0 Trailhead.  Trail route is visible ahead.  Trail end is at the further and westerly of the two forested bumps visible ahead.\n52:12:24-119:26:12=+.87 Two small tentsites.  Caribou trail to alpine to the east intersects here.\n52:12:25-119:26:14=+.89 Stream crossing with bridge.\n52:12:27-119:26:14=+.94 Stream crossing with bridge.\n52:12:51-119:26:35=+1.89 Bridge across North Blue River.\n52:12:49-119:26:41=+2.06 Old landings with large dry flat spaces for tents.\n52:13:00-119:27:07=+2.72 Meadow\n52:13:11-119:27:32=+3.29 Stream crossing.\n52:13:21-119:27:44=+3.55 Snowy Mountain Alpine Tours operations base.  No suitable ground for tenting.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/7119/reg_SANY3369sm-0.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/7119/reg_SANY3371sm-0.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/7119/reg_SANY3378sm-0.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/north-blue-hiking-trail-near-blue-river-bc-7119",
    "stats": {
        "Activities": "snowshoe hike ski-bc",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 2,
        "Time": "2 hrs",
        "Total Distance": "4 km",
        "Town": "Blue River, BC",
        "Type": "out-and-back"
    },
    "title": "North Blue Hiking Trail",
    "trail_id": "7119"
}