{
    "description": "The destination of this trip is a bluffy knob, which gives you fine views to Croker Island (north) and south down Indian Arm to Vancouver. On a clear day, you may even recognize Vancouver Island away in the distance. The hike to Croker Lookout makes a shorter alternative to the complete Dilly-Dally Trail, a 24 km trip along Eagle Ridge to the east of Buntzen Lake. I gave this hike an overall \"average\" rating, since it is a 6 km (one way!) less exciting walk along the east side of Buntzen Lake and on gravel road to get to the actual trail. Tedious! So, for this portion, you might consider using a bike. Total elevation gain is about 350m. Croker Lookout is at an elevation of about 450m, which makes it also perfect for an all-season hike.",
    "directions": "From Vancouver, drive east through Port Moody/Coquitlam, either from Highway 7a (from the Trans Canada) or from the Barnet Highway from Hastings Street and turn left onto Ioco Road. Follow Ioco Road around the north shore of Burrard Inlet and follow the signs for Anmore and Buntzen Lake. At the gated Powerhouse Road, turn left into the parking lots. Walk along the trail at the east side of Buntzen Lake. Pass North Beach and head for the small settlement of Buntzen Bay. Just before, branch off right on a dead end that leads to a power pylon, beyond which your trail heads off uphill to the trees above the right-of-way. Next, take your left, and cross two creeks. Finally, you'll start to gain some elevation. Join the former \"road\" used for logging, but which, in spots is hardly recognizable as such. Amazing and pleasant, how quickly nature takes back again what belongs to her anyway...\r\n\r\nMaps: 92 G / 07 Port Coquitlam; BC Hydro - Buntzen Lake Reservoir\r",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/712/reg_crokerlookout.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/712/topo_BCHydro.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/712/narrow_2000042AIMGjpg.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/dilly-dally-trail-to-crocker-lookout-buntzen-lake-near-vancouver-bc-712",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "6 hrs",
        "Total Distance": "17 km",
        "Town": "Vancouver, BC",
        "Type": "out-and-back"
    },
    "title": "Dilly-Dally Trail to Crocker  Lookout (Buntzen Lake)",
    "trail_id": "712"
}