{
    "description": "This is a hike through a gulch located near Five Islands which will lead you pass 5 impressive waterfalls.  The terrain near the last three falls is extremely steep and deserves the gulch designation in the 1:50 000 topographic maps.\r\rI started the hike on an old logging road which you can easily follow although it has been overgrown a bit by alders and raspberry bushes.  Once the old logging road ends you are about 100m from the edge of the ravine where McCarthy Brook flows.  Go down the ridge line, through the mature evergreen forest, to the brook and within a few minutes you will encounter the first waterfall.   This is the smallest of the five you will see on this hike.  Most of the time you will be able to walk easily by the brook or skip across the rocks within the stream bed if the water levels are low.  The forest around the brook hasn?t been logged for a long time so you will be travelling through a mostly mature deciduous forest with patches of evergreens.\r\rFrom you car, it will be about 2.5km until you see the next fall.  This two-tier fall is very impressive with a height of about 50ft in total and a deep pool at its base suitable for swimming.  You have to make your way around the ridge on either side of the fall as the cliffs are quite steep near the fall.  Travelling just another 500m or so you will come up to the final three waterfalls of this journey.  These are quite a gem.  I made my way around the falls by going on the left hand side bank (facing upstream).since there is a little ledge that will lead you all the way down to the base of the upper fall.  From there retrace your steps back to the bank and prepare top descend a long and steep section of a beautiful deciduous forest.  At the base of the falls, you will be in a kind of natural amphitheatre, with a lot of room in the middle to set up camp.  The last waterfall runs along a rock face which you can go to the top of by climbing on the right hand side bank.  On top of this rock face, you will see the middle waterfall which falls well cleared off the rock wall (true fall) into a deep pool which would be a cool place to relax in the summer.\r\rI was looking at a map after I completed this journey and I saw that there is another branch to McCarthy Brook which flows into the main brook not very far downstream of the three last waterfalls.  I bet there would be a good waterfall ont his branch as well since it descends the same number of contour lines.  If you do go to this other brook and there is a nice fall, I would appreciate if you would let me know (Thanks!).\r\rGoing back towards your car, you will need to go up a very steep slope at first to go around the three falls.  Afterward, I made my way to the stream and at some point (see GPS track) I cut across the top of the ravine towards my car instead of following the stream.  There are a few more old logging roads that cut almost all the way to the river and if you do find one (like I did), they will take you back to the main dirt road and ultimately to your car.\r",
    "directions": "Drive on the #2 highway towards Five Islands from Truro and 2.5km past the Lynn Road (Harrington River bridge), turn right on the dirt road.  Drive 3.1km to a Y intersection and turn right.  Drive another 1.7km and turn into the old logging road on your right.  Follow this logging road?..You can probably access this gulch from downstream a swell but you would have to cross the Harrington River which depending on the time of year could run fairly high.",
    "geohash": "f846s",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/7122/narrow_2010-10-01-023-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/7122/reg_2010-10-01-040-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/7122/narrow_2010-10-01-014-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/7122/narrow_2010-10-01-033-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/7122/narrow_2010-10-01-037-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/7122/narrow_2010-10-01-043-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/7122/narrow_2010-10-01-049-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mccarthy-gulch-falls-near-parrsboro-ns-7122",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 5,
        "Time": "2 hrs",
        "Total Distance": "6 km",
        "Town": "Parrsboro, NS",
        "Type": "out-and-back"
    },
    "title": "McCarthy Gulch Falls",
    "trail_id": "7122"
}