{
    "description": "This bushwhacking exercise will take you to three different waterfalls located in the upper reaches of the North river.  This river already has a well know and massive waterfall in its lower reaches and visiting these three more falls is an added bonus to a trip in this part of the province.\r\rHead down into the woods to the left of the dirt road in a NW direction.  In about 300m you will come to the top of the ravine where the North River flows.  The forest at the top was logged at some point and now is covered by 20-30ft high evergreen.  This make walking through this forest either easy or hard depending which stand you have to go through.  The slope down the ravine is fairly steep and requires some agile footwork in some places.  Down by the river you should come up to you first waterfall, which has a kind of natural rock tub located by the main part of the fall.  In the summer, it would be a great spot to soak in while listening to the sound of the fall.\r\rMoving upstream for about 400m you come up to next waterfall or cascade which was created by a narrowing of the stream by the rock cliffs on either side. Luckily, the water was down on the day of my visit and I was able to climb on the rocks to the left of the cascade (looking upstream).  After seeing this cascade I climbed the bank back up towards my car thinking this was the last fall to see?.This was a big mistake because as soon as I reached the upper part of the slopes, I could hear the roar of another fall located upstream.  I made my way back down the ravine yet again.  This section is very dangerous as it is composed of boulders covered by moss.  Oftentimes, my feet slipped into moss-hidden holes between the boulders so be careful when navigating this steep section.  This last fall is the highest of the three on this section of the river and well worth the detour.  \r\rI made my way back up the ravine by going a little more upstream than the fall.  The terrain there was easy to navigate through a mature evergreen forest and there wasn?t any of those boulder sections to navigate.  \r\rP.S. The trail to the massive waterfall on the North River is located on the 90 degree right turn on the Little York Rd.\r\r",
    "directions": "Take the little York Rd off Highway 2 in Lower Five Islands and drive approximately 5km.  There is a secondary dirt road that turns to the right.  Park there and head into the woods on the left hand side of Little York Rd.  \r",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/7123/reg_2010-10-01-057-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/7123/reg_2010-10-01-059-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/7123/reg_2010-10-01-081-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/7123/narrow_2010-10-01-070-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/north-river-upper-falls-near-parrsboro-ns-7123",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "2 km",
        "Town": "Parrsboro, NS",
        "Type": "out-and-back"
    },
    "title": "North River Upper Falls",
    "trail_id": "7123"
}