{
    "description": "From the bridge and looking upstream, go on the right hand side of the brook.  You can definitely follow an old road at first and then some kind of unofficial trail for about 500m or so.  Someone had kindly cut a lot of brush and fallen trees on this part of the hike and therefore the travelling is quite fast on this section.  Once you reach the end of the trail, the bushwhacking begins.  I criss-crossed this 6-10ft wide brook in numerous places instead of trying to navigate to some of the dense alder shrubs on the side of the brook.  Another 500m will lead you to the base of the falls.  There are some deep pools and rocks cliffs right at the bottom of the main fall which prevents you from getting good access quickly from walking in the brook.  Instead, you have to make your way up the steep slope (right hand side again) and then drop back to the stream edge in front of the main waterfall.  There is only one kind of natural path that will lead you to the front of the main fall.  It?s extremely steep so be careful since underneath the moss is a lot of loose slate type rock that is ready to give way if you are not careful.  After gazing at that amazing 40ft waterfall, scramble your way to the top of the main waterfall to see the two other, smaller, waterfalls located on top of the main fall.  Again there is a kind of natural path that will lead you there and then you can actually jump across the upper part of the main fall to see the other smaller falls.   The forest all around the falls is composed of these massive evergreen trees which make you wonder what Nova Scotia used to look like before all of the logging occurred.",
    "directions": "Highway 104 to Lower south river, turn right on highway 316 towards St Andrews, turn left on Antigonish-Guysborough Rd and continue until Roman Valley, Turn left on North Intervale Rd and continue on this road until a bridge located at  45.488386°, -61.650937°.  Follow this brook upstream to the fall.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/7126/75.NorthBrookmira.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/7126/reg_DSC-0013-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/7126/reg_DSC-0016-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/7126/narrow_DSC-0007-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/7126/narrow_DSC-0011-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/north-intervale-falls-near-havre-boucher-ns-7126",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "1 hrs",
        "Total Distance": "3 km",
        "Town": "Havre Boucher, NS",
        "Type": "out-and-back"
    },
    "title": "North Intervale Falls",
    "trail_id": "7126"
}