{
    "description": "This is a 4-5 km loop trail that starts at the Ancient Cedar Forest trailhead some 4 km up the Sixteen Mile Creek Forest Road.  At the trailhead you have a couple of options.  Follow the trail towards the Ancient Forest and then turn left and head for Cougar Lake, and from there follow the well-built trail to Showh Lake and return the same way or walk down the gravel road and return to your car. You could also add on the Ancient Cedars trail and make a longer semi loop.  There is a maze of trails in the area and a couple of lookouts as well.  This is a multi - use area so you are likely to find ATV's and Hummers on the gravel roads and horses on some trails as well, but the main loop trail is for walkers only (although it appears that the mountain bikers are riding the trails connecting the two lakes).\r\nCougar Lake was the nicer of the two lakes and I got a sense of being alone in the wilderness as I sat and ate my lunch under the watchful eye of a Canada Jay who was looking for a handout.\r\nAlthough you climb some on this trip it is certainly okay for families, and it's less crowded than the ancient cedars trail.",
    "directions": "Drive north from Whistler towards Pemberton and just pass Green Lake you will see a sign on the left hand side of the road indicating Cougar Mountain adventures.  Turn here and it is 4 km up a well-maintained gravel road to the lower parking lot.  Park here if you are going to do the Ancient Cedars trail or have a low slung vehicle; otherwise for the shortest route into the Lakes, continue up the gravel road for another km to the upper parking lot.\r",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/713/reg_WhistlerDay3June29_2003027.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/713/reg_WhistlerDay3June29_2003030.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/713/reg_WhistlerDay3June29_2003035.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/713/reg_WhistlerDay3June29_2003042.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/713/narrow_WhistlerDay3June29_2003025.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/showh-cougar-lake-loop-near-whistler-bc-713",
    "stats": {
        "Activities": "hike ski-xc mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "9 hrs",
        "Total Distance": "5 km",
        "Town": "Whistler, BC",
        "Type": "out-and-back"
    },
    "title": "Showh-Cougar Lake Loop",
    "trail_id": "713"
}