{
    "description": "Sea Kayaking (or canoeing) Lac La Peche in the western region of the Gatineau park delivers many inlets, bays, and open water to explore.  There are over a dozen back-country paddle in only campsites, and this weekend, we were at campsite #11 -- pretty much the furthest away from your start at the beach parking lot.  It's a canoe/kayak only lake, meaning some campsites are reachable only by paddling.  \nThe paddling to the campsite takes just under an hour, and I made my way there by GPS, as it was dark as I paddled into to meet friends.  (the video attached shows us all heading out of campsite #11 the next day).\nIt's clean water (although the giant beaver lodge in our small cove made me wonder), the lake has lots of clean open water and excellent swimming opportunities.  Bugs can be bad, try for a campsite on a peninsula or Island, something that allows for a breeze.  \nOur circunavigation the next day was fun -- we went back to the beach, for a quick stop, then on to the more northerly side of the lake, another wide expanse of shallower water and then the winds picked up on us, made it interesting, it was like a windstorm, proving that even on a relatively small lake, be ready for anything.\nAll in all -- a great lake to paddle around, it's not terribly long and you can paddle the lake in a day, stopping here and there for lunch.  The beach and parking area is big, a great place to relax, a nice place to ease your way into back-country paddling, and one of the few paddle-in-only camp areas that close to Ottawa.\nLa Pêche Lake Ticket Booth\nSincennes Road,\nLa Pêche, Qc J0X 2W0\nTel.: 1 866 456 3016 (toll-free)",
    "directions": "Far side of Gatineau park, there are actually two ways in.  One from below the Gatineaus closer to Qyon, the other the top and over route at the north end of the route, going past Lac Phillipe turnoff and proceeding to Lac La Peche turnoff.  About 45 mins from Ottawa.  Take 366 through Ste-Cecile-De-Masham (Route Principale Est) with a turnoff on Chemin D'Eardley, and, a few kms down the road look for the signs to Lac La Peche, you'll follow a longish gravel road by some farms (Chemin Sincennes) before you get to the ticket booth.  On the way out, when you get back to Chemin D'Eardley, try taking that directly south, it actually takes you through some fairly pristine Gatineau park, I was amazed at the size of the trees and old growth as I took this lesser used road back in the direction of Qyon/Luskville and I enjoyed it.",
    "photos": [],
    "source_url": "https://trailpeak.com/trails/la-peche-sea-kayaking-near-gatineau-pq-7130",
    "stats": {
        "Activities": "sea-kayak river-canoe",
        "From": "",
        "Seasons": "summer",
        "Stars": 3,
        "Time": "3 hrs",
        "Total Distance": "10 km",
        "Town": "Gatineau, PQ",
        "Type": "out-and-back"
    },
    "title": "La Peche Sea Kayaking",
    "trail_id": "7130"
}