{
    "description": "This hike on a well defined, but muddy, trail will take you into the James River Wilderness Area and ultimately to Cuties Hollow where there is a multi-tier, 50 ft plus, waterfall.\r\rAs you set out onto the path, you may see a sign with ?fall? on it.  The first couple of hundred feet is through an old cleared area which has been overgrown with alders.  Luckily, the alders have been cut back from the trail.  For the next 1.1km you will have to circumvent, too numerous to count, mud holes.  On foot or on a mountain bike, it is easy to avoid the mud since there has been enough people walking around them and into the forest to develop some secondary path around the wet spots.  The forest again for the first km or so is mainly composed of evergreen trees some of which are covered by a thick layer of moss which gives them a nice look.  \r\rAfter the first km of trail you will traverse a secondary branch of the James River.  In times of high water, I have had to take off my boots and wade through the 8-10ft channel.  Last time, I was there and in a low flow conditions, someone had put down a metal railing in the stream bed which you could use to traverse the stream without getting your feet wet.  Just past the stream, another trail (to your left) joins the one you are on.  Keep going on the main trail as it slowly goes up a small hill and into a very nice and mature deciduous forest.  Lots of birch and beech trees in this part of the forest.  You will hear the falls before seeing them about 600m after crossing the stream.  There are numerous paths on your right that will take you close and one in particular which some very nice people have put ropes to aid you in your 125 ft descent to the base of the waterfalls. The waterfalls are composed of at least three parts but the nicest portion runs is the easiest to see as it plunges into the bottom of the gorge and therefore right in front of you.  To access the other parts of the fall requires a little bit more scrambling.\r\rIn a prior visit to Cuties Hollow, I made my way to the top of the fall using a rope located on the right side of the waterfalls.  I didn?t try it this time but I would be careful about using a rope exposed to the elements especially since you can make your way to the top of the falls by some other trails running along the rim of the gorge where the falls are located. \r\r",
    "directions": "On Highway 104 near Marshy Hope, take the Strathglass Rd which becomes the Browns Mountain Rd.  Continue on this road as it climbs and then descends the hill in front of you.  Park at  45° 37.509'N, 62° 9.967'W.  The trail starts to the right (east) of the road.\r",
    "geohash": "f85g9",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/7131/reg_DSC-0069-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/7131/reg_DSC-0077-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/7131/narrow_DSC-0075-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/7131/narrow_DSC-0076-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/7131/65.CutiesHollow.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/cuties-hollow-fall-near-antigonish-ns-7131",
    "stats": {
        "Activities": "mtn-bike hike snowshoe",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 5,
        "Time": "1 hrs",
        "Total Distance": "4 km",
        "Town": "Antigonish, NS",
        "Type": "out-and-back"
    },
    "title": "Cuties Hollow Fall",
    "trail_id": "7131"
}