{
    "description": "This trail is a loop of Goldstream Park.  It's fairly easy and and must if you live near Victoria or are visiting and don't want to venture very far.  Starting at the parking lot, there are a couple parallel nature trails (wheelchair accessible) which meander north towards the nature center.  Before reaching the nature center, there is a tunnel beside a wooden bridge.  Head into the tunnel and under the highway.  The tunnel may have a few inches of water after rainy weather or during the spring melt, but it's usually dry and at the most requires waterproof shoes.  On the south side of the creek is a well defined short trail to Niagara falls, not to be confused with Niagara falls on the great lakes, but still worth the trip.  Now the real trail begins.  Back at the tunnel, there's a steep slope on the north side of the creek that starts the trail up to a rail trestle.  Go all the way up to trestle and enjoy the view, but beware the train does still use it twice a day.  Just before the trestle is a trail branch that's hard to see on the way up, but plainly visible from the other direction.  This is the gold mine trail which passes a 10 meter long tunnel that used to be a gold mine.  The trail eventually turns into the Arbutus Ridge trail and then meets up with the Prospector's trail.  Simply follow the signs at the trail cross roads to find your way around.  The Prospector's trail meets up with the Goldstream river and crosses it near the highway.  If the water level is low, head under the highway, or (quite often) you will need to wait for a break in traffic to bolt across the highway.  Not the best situation, but it's only a couple lanes.  On the other side of the highway, the trail continues up the hillside in the trees (not immediately visible from the far side of the highway, but easy to spot once crossed).  You'll climb some stairs and head past a viewpoint (not a good viewpoint, but it's got it's own sign).  Continue north and you'll come to a perpendicular fork in the trail.  Continue straight and down the stairs to the road which passes through the parking lot, or take the fork to the right to tackle Mount Finlayson and add 400 vertical meters to your walk.  Mt Finlayson is much harder than the rest of Goldstream park, and adds another hour and a half, so you might want to save it for another day unless you like power walks (or runs).  It's still an easy climb for most hikers.",
    "directions": "From Victoria, head north on the Number 1 highway and you'll see the turnoff just after leaving Langford.  From the rest of the Island, just head towards Victoria and once you're over the Malahat you'll see the turnoff.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/7134/reg_IMG-1700-7279.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/7134/reg_IMG-1704-7279.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/7134/reg_IMG-2717-32598_best1_.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/goldstream-park-near-langford-bc-7134",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "12 km",
        "Town": "Langford, BC",
        "Type": "out-and-back"
    },
    "title": "Goldstream Park",
    "trail_id": "7134"
}