{
    "description": "Most of this hike is on an old logging road and is suitable for all age/fitness levels except for the last 100m where you have to navigate a very steep slope to get to the bottom of the ravine.  If you do go down the hill, you will be rewarded by a 60 ft plus waterfall.\r\r\rAs you set off on the old road, you are surrounded by majestic hardwoods which have a dense canopy overhead.  There are a few potholes on this road but it?s easy to keep your feet dry.  If you have a high clearance on your vehicle, you can drive this first part.  Turn on the secondary road on your left which has a large tree trunk blockings its entrance (580m from highway 105).  The road gradually climbs a small hill and then you have to go over a wire rope which had been installed in the middle of the rope.  Turn right immediately past the metal wire and follow this road until you meet another road on your right.  Take the road to your right and hike another 1.25km to where a significant ATV trail is located on the left. Just before getting to this ATV trail, you will be climbing a small hill and you can easily hear the waterfall to your left.  The ATV trail down the ravine to the base of the fall is very steep and you have to be careful.  The waterfall is truly magnificent is composed of many ?steps?.  The forest on the slope of the ravine and near the fall is composed of very mature hemlock trees which give a lot of shade to the area.  The return distance is about 6km and could be easily done by mountain bike or cross country/snowshoes.\r\r",
    "directions": "Take highway 105 in Nackawic and drive towards Mactaquac.  The old logging road you want to start on is located at (45° 58.795'N, 67° 9.442'W) and is sometimes called Lower Caverhill Rd.\r",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NB/7139/reg_DSC-0029-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/7139/narrow_DSC-0019-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/coac-fall-near-nackawic-nb-7139",
    "stats": {
        "Activities": "mtn-bike ski-xc hike",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "6 km",
        "Town": "Nackawic, NB",
        "Type": "out-and-back"
    },
    "title": "Coac Fall",
    "trail_id": "7139"
}