{
    "description": "This is one of little inner city jewels - it's quite busy on a nice day with people walking their dogs and otherwise just out for a nice walk and when combined with a the 'Wall garden walk it's a wonderful little get away just of Crowchild Trail.  For 30 years this was a relatively barren strip of prairie grass land left over after the development of the community of Silver Springs.  It was road 'right-of-way' for the eventual connection of Sarcee Trail in the north with Sarcee Trail south of the Trans Canada Hwy.  The road would have gone through the Bowness and required the expropriation of a number of properties and a bridge across the Bow River.   When the alignment of Crowchild Trail and Stoney Trail were finalized and Sarcee Trail abandoned, the city turned it into recreation reserve and through cooperation with BP (British Petroleum) program the area was landscaped and planted with thousands of trees and gardens.   Now, about 10 years later, it's a wonder little oasis to walk, or jog.  The track I've shown is one I use in the winter for X-C Skiing - about 3 loops makes a great workout  after work.  Best of all I can put my skis on right outside the garage door - no driving!",
    "directions": "Just park in the parking lot off of Silver Springs Drive (by the tennis courts, baseball diamond and soccer fields.)  There's always lots of room except during soccer season (May & June).  In the summer and fall a walk up the the wall garden will be especially rewarding.  (I'll add some better photos of that next year.)",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/7145/reg_SS-BP-Forest-20101031-136-s-32708.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/7145/reg_SS-BP-Forest-20101031-138-s-32708.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/7145/reg_SS-BP-Forest-20101031-139-s-32708.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/7145/reg_SS-BP-Forest-20101031-141-s-32708.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/7145/reg_SS-BP-Forest-20101031-145-s-32708.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/7145/reg_SS-BP-Forest-20101031-147-s-32708.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/silver-springs-bp-forest-wall-garden-near-calgary-ab-7145",
    "stats": {
        "Activities": "ski-xc hike",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "2 km",
        "Town": "Calgary, AB",
        "Type": "out-and-back"
    },
    "title": "Silver Springs BP - Forest & Wall Garden",
    "trail_id": "7145"
}