{
    "description": "NTS Map:92B6.  The Ed Nixon Trail is part of the Langford Trail Network, 15 kms of trails that provide access to recreational areas in Langford. The trail is a popular access point for mountain biking, hiking, and canoeing.\r\n\r\nFrom the parking lot, a series of elevated wooden boardwalks protect the marshlands as you head towards the wooded section of the trail. Along the way, the trail connects with the Henson Trail, which will take you towards Humpback Valley Road and Goldstream Park. As you head into the wooded section of the trail, the terrain starts to roll gently, although it remains wheelchair accessible. Two fishing floats, picnic tables and outhouses are provided on the trail. Shortly after the second fishing float, the trail comes to a dead end; you can turn back at this point, or scramble up a short hill to meet the E&N train tracks.  You can follow the train tracks or power line cut trail; heading west will bring you to Humpback Valley Road; heading east takes you to the head of the Leigh Road Trail.  Beware of the train passenger car service on the tracks; the train moves fast and can be very hard to hear on windy days, even though it sounds its whistle often.\r\n\r\nFor those that enjoy fishing from the shore, docks, or boats, the lake is stocked with rainbow trout, cutthroat trout, and small mouth bass. There are three wheelchair accessible fishing floats that also provide temporary docking for kayaks and canoes. A small parking lot, boat launch ramp, and trailhead for the Leigh Road Trail are located at the end of Leigh Road.\r\n\r\nThe Leigh Road Trail comes to a dead end at a small clearing that opens onto the Lake, A short scramble through some brush and up a rocky embankment, and you are on the E&N railway tracks. With a LARGE amount of caution, you can head along the tracks towards and join up with the end of the Ed Nixon Trail. Remember to listen for trains!\r\n\r\nBack at the Leigh Road trailhead, you can cross the tracks and head west up the power line cut for a mountain bike ride to the junction of Humpback Valley Road, and then either carry on for more exploration or head north towards the Trans-Canada Highway for a loop back to the parking lot along the highway or Henson Trail. The campsite section of Goldstream Provincial Park is on your way back; a great place to stay when exploring this area. \r\n\r\nAnother choice at the trailhead is to connect with the CRD water pipeline trail system, a veritable maze of wooded trails that take hours to ride. The trails in this area are a combination of wide rolling and narrow steep climbs, with many small branch single tracks on bare rock. Caution should be exercised in this area, as sightings of cougars are not uncommon.\r\n\r\n\r\nThere is GPS data attached to this trail (see \"download GPS\"), which if loaded into your GPS can help you find route points.\r\n \r",
    "directions": "Goldstream Avenue at Trans-Canada Highway.\r",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/715/narrow_lake1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/715/narrow_lake2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/715/narrow_lake3.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/715/narrow_lake4.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/langford-lake-near-victoria-bc-715",
    "stats": {
        "Activities": "river-canoe hike mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "15 km",
        "Town": "Victoria, BC",
        "Type": "out-and-back"
    },
    "title": "Langford Lake",
    "trail_id": "715"
}