{
    "description": "From Friends of Seaton Hiking Trail website:\r\rThe Seaton Trail is located along the West Duffins Creek in Pickering, Ontario. It runs for 12.7 km from 3rd Concession near Brock Road northwest to Highway 7 at Green River. The trail follows historic hunting and fishing routes on the creek, used for centuries by aboriginal people. In pioneer times, the creek and valley became the site of several water powered mills. A former grist mill stills exists at Whitevale.\r\rThe trail got its name from the planned community of Seaton, which was envisioned in the 1970?s to accompany the new airport planned for the area. The airport has not been built and the community is just now coming to reality, but the Seaton Trail has been there all this time.\r\rThe trail was created by the Ontario government in cooperation with the Metropolitan Toronto and Region Conservation Authority (now the TRCA) in the 1970?s and was built by high school and university students. The trail was maintained for a good many years by the Boy Scouts located at Camp Pidaca (near 3rd Concession).\r\rDespite the Seaton Trail?s popularity, it has not enjoyed the consistent protection and care from a community volunteer group. The Friends of Seaton Trail (FOST) was formed in 2009 to change this.\r\rSeaton Trail signHikers on the Seaton Trail\r\rThe majority of the creek valley is owned and operated by the Ontario Realty Corporation (ORC), with smaller parts by the Town of Pickering and the Toronto & Region Conservation Authority (TRCA).\r\rThe Ontario Realty Corporation has responsibility for land procured by the Province of Ontario. Under contract, DEL Management Solutions performs monitoring, repairs and maintenance on provincial lands.\r\rThe TRCA owns several parcels between Whitevale and Concession 3. The TRCA has managed these properties. The province is funding TRCA through 2010 for work on the Seaton lands, including trail parking lots, restoration, plantings, public consultation and trail improvements.\r\rThe City of Pickering owns and manages the Whitevale Community Park and Grand Valley Park.\r\rThe trail crosses additional small land parcels near the southern end of the trail, owned by the City of Toronto, Ontario Hydro and Canadian Pacific Railway.\r",
    "directions": "Check it out here:\rhttp://www.seatontrail.org/",
    "geohash": "dpz",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/ON/7157/long_IMG-4981-51989.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/7157/reg_IMG-4978-51989.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/7157/reg_PB130001-25047.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/7157/narrow_IMG-4982-51989.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/seaton-hiking-trail-near-pickering-on-7157",
    "stats": {
        "Activities": "mtn-bike ski-xc hike snowshoe",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "13 km",
        "Town": "Pickering, ON",
        "Type": "out-and-back"
    },
    "title": "Seaton Hiking Trail",
    "trail_id": "7157"
}