{
    "description": "This is one of the most popular gateway routes that provides the adventurer access to Mount Katahdin, the main attraction in the park. The trail runs along a brook that can flow high or low depending on the time of year, or recent precipitation. I went in October a few days after some heavy rains, and the brook was swollen. Consequently, the trail, in a few places was flooded, though passable.\nDue to recent administrative changes in Baxter State Park, you now need to reserve a parking space to gain access to the trails. It's how they control the volume of trail users in any given region of the park. Reservations can be done on-line (www.baxterstateparkauthority.com) When the park is busy (summer and fall) it pays to plan in advance to avoid disappointment. A small fee is required to reserve the space. See their website for details. Otherwise, it's first come, first serve, for what ever is left over.\nThe Chimney pond trailhead is located at Roaring Brook campground, but the drive to reach it from the park's south entrance is still a long haul. Come winter, even longer, since they don't plow the roads. Backcountry skiing is in order when there's snow, and snowshoeing is the best way to travel along the trail proper, because of the large boulders that scatter the path, making skiing difficult. When there's enough snow, skiing with skins is an alternative, but snowshoes prove useful elsewhere, so they're good to have.\nThe path gains elevation as you go along. Starting at 1,500 feet ASL at Roaring Brook, you land at the campground at basin Pond at 2,800 feet, which is another reason to travel with snowshoes come winter.\nThe path is a rewarding hike in the Fall, because of the mix of hardwood and connivers. There are numerous bridges and boardwalks to walk along too, but like many of Baxter State Park's trails, the path is strewn with rocks, so proper footwear that protects your toes is necessary.\nSome notable landmarks along the way include the trail junction to Helon Taylor which takes you to Pamola Peak and onto the Knife Edge, the junction of North Basin trail that takes you to the Basin ponds. the trail goes right past Basin Ponds, and Chimney Pond and its associated campground at the end of the route. Due to the fragile eco system in this region, tent camping is not permitted. Lean-tos and a bunkhouse are the camping options here.\nThere is a warden's hut located here too where weather, wind and trail access info can be obtained. Weather conditions can close the trails that ascend Mount Katahdin, and that info is good to know before hand.\nFrom Roaring Brook trail's terminus, there are hiking trails and rock & ice climbing routes that ascend the mountain. Cathedral trail is the route we chose to ascend Katahdin, and access the Knife edge traverse. Alternatives include Hamlin ridge, Saddle Trail, Dudley Trail and",
    "directions": "From Millinocket, drive for 45 minutes along highway 11 to the national park gate. From there, another 18 miles along the dirt road at 20 miles an hour gets you to roaring Brook campground. In busy seasons, enter the park by or before 7am to ensure your reserved spot. After that, the parking lot is free to everyone else.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/ME/7158/reg_katahdin-2010-003-6702.jpg",
        "https://trailpeak.com/storage//content/trails/US/ME/7158/reg_katahdin-2010-006-6702.jpg",
        "https://trailpeak.com/storage//content/trails/US/ME/7158/reg_katahdin-2010-008-6702.jpg",
        "https://trailpeak.com/storage//content/trails/US/ME/7158/reg_katahdin-2010-010-6702.jpg",
        "https://trailpeak.com/storage//content/trails/US/ME/7158/narrow_katahdin-2010-004-6702.jpg",
        "https://trailpeak.com/storage//content/trails/US/ME/7158/narrow_katahdin-2010-005-6702.jpg",
        "https://trailpeak.com/storage//content/trails/US/ME/7158/narrow_katahdin-2010-007-6702.jpg",
        "https://trailpeak.com/storage//content/trails/US/ME/7158/narrow_katahdin-2010-011-6702.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/chimney-pond-trail-baxter-state-park-near-millinocket-me-7158",
    "stats": {
        "Activities": "hike snowshoe",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "5 km",
        "Town": "Millinocket, ME",
        "Type": "out-and-back"
    },
    "title": "Chimney Pond Trail, Baxter state park",
    "trail_id": "7158"
}