{
    "description": "UPDATE:  Closed until further notice as government of B.C. considers conservation management plan update. (as of Nov 2012).The trail is not the reward here; it's the view from beneath of the most amazing pinnacles and rock formations and fossil beds just off Hwy 1 between Cache Creek and Kamloops.The first time I drove this way some years ago, I noticed the pinnacles and the \"Utah\" like desert geography.  I didn't visit, but I stopped to take a picture of the cliffs, not knowing about the fossil beds.  I was loving the change of scenery, and this gave me that \"Arizona\" feeling. The area around Cache Creek has much more in common with Arizona or Utah than coastal B.C.  One is desert, one is rainforest, but only five hours drive apartThis time around, I followed a sign alerting the public to safety, access, and that fossil hunting is allowed. The sign is not visible from the highway; you have to ascend to the open gate area. Here at the fossil beds, you will be treated to hoodoos and pinnacles or red rock and shale.  You'll see cactus along the way (not Arizonian cactus, but 3 to 4 inch high prickly pear cactus).The walk up is steep and the sun is hot, so be prepared--but it's only a kilometer or so, and the view back down to your parking area is very rewarding.Access is a bit tricky, you have to know where to stop along the highway, then carefully pull into the gated area, unhook the gate, and park just on the inside, remembering to close the gate.  As to where to stop, see the directions below. There is GPS data attached to this trail (see \"download GPS\"), which if loaded into your GPS can help you find route points.",
    "directions": "Driving East from Cache Creek to Kamloops roughly 15 km, and perhaps 5 km or so from \"Deadman's River\" (or bend--you'll see a sign on the highway), you will see some noticeable pinnacles jutting out from the cliffs on the left hand side of the road, up 500m or so from the highway.  Follow the double-track road up to the cliffs; it gets steep, and here you will see a sign with more information. It?s best to hike from the valley below.The exact position is marked by the GPS waypoint attached.  You'll know you are in the right area because it is the most prominent set of pinnacles along the way, WAYPOINT is: WGS84 10U  631062.4  5628487.8.  It's also just before Juniper Beach Provincial Park.There are jeep roads leading up either side of the pinnacles (e.g. Battle Creek), with no doubt lots of interesting terrain to explore above.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/716/long_fossilmap.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/716/reg_0329091006a-21271.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/716/reg_0329091025-21271.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/716/reg_0329091025b-21271.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/716/reg_pinnacles2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/716/topo_pinnacles1.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/zugg-fossil-beds-and-hike-near-kamloops-bc-716",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 3,
        "Time": "1 hrs",
        "Total Distance": "1 km",
        "Town": "Kamloops, BC",
        "Type": "out-and-back"
    },
    "title": "Zugg Fossil Beds and Hike",
    "trail_id": "716"
}