{
    "description": "The Larch Hills cross-country ski area, 20 km from Salmon Arm, is home to some of B.C.'s finest ski trails. With 125 km of trails, about 43km of which are track set, there is no shortage of variety for the cross-country ski enthusiast - classic, skating, and backcountry/unset.\r\rThe Larch Hills Nordic Society maintains a chalet next to the parking lot, Cec's Cabin about 6K up Larch Hills Road and Tom's Shelter about 4K up Woodlot Ramble. We also maintain all the tracksetting equipment including a Pisten Bully 200 and safety toboggans. There are no trail fees but donations are encouraged to help with these expenses. Membership to the Club is the preferred way to go - very reasonable and practical.\r\rAll information taken from Larch Hills Nordic Ski Club\rhttp://www.skilarchhills.ca/index.shtml\r\rGps Map compiled from Google Earth Overlay from their site\rhttp://www.skilarchhills.ca/maps.htm\r\rI can't verify accuracy of the data so please contact if you find it in error.",
    "directions": "*\r\r      From Salmon Arm, drive east on Highway 1.\r    *\r\r      Turn right on to Highway 97B and drive toward Enderby for 5K past Mellor's Store and gas station to Grandview Bench Rd. Watch for the first Larch Hills Ski Area Sign on the right before you reach the Grandview Bench Rd. junction on the left.\r    *\r\r      Turn left on Grandview Bench Rd. (at the junction there's a small sawmill and if you look closely a sandwich board sign shows LHNS events and trail conditions) and drive east for 5K until you see a second Larch Hills Ski Area Sign near the Edgar Rd. junction with its cluster of mail boxes.\r    *\r\r      Turn left on Edgar Rd. and drive 3K past farm fields until you see the third Larch Hills Ski Area Sign on the right. Turn gentle left on Larch Hills Rd. which climbs steadily past several houses and John's Ski Shack for about 3K to the Larch Hills Parking Lot.\r    *\r\r      The Larch Hills Ski Chalet is located at the top end of the Parking Lot.",
    "geohash": "c352",
    "photos": [],
    "source_url": "https://trailpeak.com/trails/larch-hills-ski-trails-near-salmon-arm-bc-7163",
    "stats": {
        "Activities": "mtn-bike ski-xc ski-bc hike snowshoe",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 4,
        "Time": "21 hrs",
        "Total Distance": "125 km",
        "Town": "Salmon Arm, BC",
        "Type": "out-and-back"
    },
    "title": "Larch Hills Ski Trails",
    "trail_id": "7163"
}