{
    "description": "Nickel Plate Provincial Park About This ParkSecluded and serene, the main attractions at this semi-wilderness park are fishing, hiking and winter recreation. Nearby is Lookout Mountain that overlooks the glaciated Nickel Plate Lake. At the north end of the lake, dotting the shoreline, are fascinating, huge boulders (erratics) deposited by receding glacial ice. The park also provides opportunities for Nordic skiing and snowmobiling.Park Size: 105 hectaresLocation and MapsLocation Map From Green Mountain Road, follow Apex Mountain Road through Apex Mountain Village to the Hedley Creek/ Nickel Plate Forest Service road. Follow this for about 4.5 km. Turn at the big rock and follow this road for 1/2km to reach the camping area. Access by four-wheel drive vehicles only.Nature and CultureHistory - Established December 14, 1938. Nickel Plate Lake has been the site of management activities by local rod and gun clubs and government agencies since the 1940?s. For many years it had been a popular fishing spot for residents of Hedley and nearby mining communities like Mascot. The first recorded management activity was the introduction of a freshwater shrimp species in 1944 by the Nickel Plate Rod and Gun Club. Subsequent actions by the club, and overseen by a game warden, included an extensive program to introduce new species of aquatic vegetation in 1950. Conservation - In the surrounding forests, one can pick blueberries and other edible berries. Labrador tea, with its white blossoms and fuzzy, undersized leaves, can be found here. This plant was used by natives and early settlers to brew a relaxing drink.Fishing Nickel Plate Lake has been a fishing destination since the 1940?s. It is stocked with rainbow trout by the Summerland Trout Hatchery. Anyone fishing or angling in British Columbia must have an appropriate licence. There are ice fishing opportunities on Nickel Plate Lake. Pets on Leash Pets/domestic animals must be on a leash at all times and are not allowed in beach areas or park buildings. You are responsible for their behaviour and must dispose of their excrementBackcountry areas are not suitable for dogs or other pets due to wildlife issues and the potential for problems with bears. Cross-country skiing is popular in the area and the Nickelplate Cross-country Ski Club operates groomed runs nearby.There are snowshoeing opportunities in the park though there are no designated trails.The area is used for snowmobiling and to access Sheep Rock in Brent Mountain Protected Area.There are ice fishing opportunities on Nickel Plate Lake.Facilities Available at this ParkBoat Launch Boat access to the lake is made available by a rough gravel boat launch at the north end of the dam, although the gravel does not extend to the water's edge when lake levels are low. Light boats are commonly launched down the face of the dam. Pit or Flush Toilets This park only has pit toilets ? no flush toilets. Walk-In/Wilderness Camping Wilderness, backcountry or walk-in camping is allowed, but no facilities are provided. Bike shop / rentals: Freedom Bike Shop Accomodations: Summerland Resort",
    "directions": "From Green Mountain Road, follow Apex Mountain Road through Apex Mountain Village to the Hedley Creek/ Nickel Plate Forest Service road. Follow this for about 4.5 km. Turn at the big rock and follow this road for 1/2km to reach the camping area. Access by four-wheel drive vehicles only.",
    "geohash": "c2f9",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/7164/reg_npl-11997.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/nickel-plate-lake-near-penticton-bc-7164",
    "stats": {
        "Activities": "snowshoe hike ski-xc mtn-bike",
        "From": "",
        "Seasons": "winter fall summer",
        "Stars": 5,
        "Time": "1 hrs",
        "Total Distance": "3 km",
        "Town": "Penticton, BC",
        "Type": "out-and-back"
    },
    "title": "Nickel Plate Lake",
    "trail_id": "7164"
}