{
    "description": "This trail is accessed from Roaring Brook Trail, and is a common route of ascension to Baxter Peak. Note that this is a one-way  street, as descending it, due to its steepness, is a hazardous venture.The Trailhead is located at the Chimney Pond campground area which offers fantastic 360 degree views of the mountain skyline of both Baxter peaks to the south, and Hamlin / Howe Peaks to the North-east.Very soon after leaving the ranger station, you get a major taste of what lies ahead. After all, you are climbing a mountain, so you have to expect to climb some rocks. What you climb is in fact, rubble from rock slides. Huge rock slides.The path is marked with paint on the rocks, and gives you a conceptual route. You can choose your own path, but it's always wise not to stray too far from the markers. When I hiked it, there was a lot of mist, making much of the rock wet with dew, and the views rather limited.  Case in point, a fellow who went to pass us to the far right at one point, was going merrily along, until he suddenly disappeared. He had slipped and fell down a slope of rock for about 15 feet, with some small trees to break his fall. Luckily, he was quite shaken, but unharmed.There are three sets of cathedrals which is where the trail gets its name. These are outcrops of solid rock are visual highlights when fog, cloud and mist don't enshroud them. I saw one or two of them, but their grandeur was lost on me due to the weather. (I put the rock climbing designation here because these cliffs could and likely have been climbed)Some of the scrambles you do are quite a vertical stretch, and even a challenge for the more skilled hiker. Poles really do help on some places, and in others, they're best stowed on your pack.Eventually the route begins to level away to a more gradual slope, and the rocks get vastly smaller. Here, the terrain remiinded me of Newfoundland's Gros Morne and of Alpine tundra. Cairns begin to mark the way, as any path along the ground would probably go undetected; especially in poor visibility. For a short length, Cathedral trail hooks up to the Saddle Trail on the way to the top.Before you know it, depending on the season, you approach an area with a small crowd of people. This would likely be Baxter Peak, the highest point in the park and the state. Pat your self on the back and get your picture taken at the summit point. You've made it!",
    "directions": "Within the park, take the Roaring Brook Road from the park's South gate. You can access this trail from Roaring Brook trail, which starts from the road, and same named campground.",
    "geohash": "f2nvp",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/ME/7167/reg_katahdin-2010-015-6702.jpg",
        "https://trailpeak.com/storage//content/trails/US/ME/7167/reg_katahdin-2010-016-6702.jpg",
        "https://trailpeak.com/storage//content/trails/US/ME/7167/reg_katahdin-2010-017-6702.jpg",
        "https://trailpeak.com/storage//content/trails/US/ME/7167/reg_katahdin-2010-019-6702.jpg",
        "https://trailpeak.com/storage//content/trails/US/ME/7167/reg_katahdin-2010-022-6702.jpg",
        "https://trailpeak.com/storage//content/trails/US/ME/7167/reg_katahdin-2010-026-6702.jpg",
        "https://trailpeak.com/storage//content/trails/US/ME/7167/reg_katahdin-2010-030-6702.jpg",
        "https://trailpeak.com/storage//content/trails/US/ME/7167/reg_katahdin-2010-031-6702.jpg",
        "https://trailpeak.com/storage//content/trails/US/ME/7167/reg_katahdin-2010-034-6702.jpg",
        "https://trailpeak.com/storage//content/trails/US/ME/7167/reg_katahdin-2010-036-6702.jpg",
        "https://trailpeak.com/storage//content/trails/US/ME/7167/reg_katahdin-2010-039-6702.jpg",
        "https://trailpeak.com/storage//content/trails/US/ME/7167/reg_katahdin-2010-041-6702.jpg",
        "https://trailpeak.com/storage//content/trails/US/ME/7167/narrow_katahdin-2010-013-6702.jpg",
        "https://trailpeak.com/storage//content/trails/US/ME/7167/narrow_katahdin-2010-024-6702.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/cathedral-trail-baxter-state-park-near-millinocket-me-7167",
    "stats": {
        "Activities": "climb hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "2 km",
        "Town": "Millinocket, ME",
        "Type": "out-and-back"
    },
    "title": "Cathedral Trail, Baxter State Park",
    "trail_id": "7167"
}