{
    "description": "*************** Note: from Trailpeak Regional Trail Editor (BC): Due to the comments and confusion concerning this listing, on Aug 31/2013, I hiked the Cliff South route creating a new GPS track, pictures and have edited the listing to conform to the possibilities of this route. There will be two (2) listing for the Mara Mountain(s). What I would determine as South, uses the Mara Trail or road to the summit and is accessed from Tranquille Rd. This route will be listed as Mara Mountain Cliffs South. The other will be labeled as Mara Mountain Summit East and will be the route from the Bachelor Heights side of Lac du Bois. I have hiked and marked the East trail with Orange ribbon, as the trail is very sketchy. I was unable to find a route across the deep ravine between the Cliffs and the East side suitable for bikes.The road to the left side of the dried up pond from the South side and the East side road are signed with ?No Trespassing? signs. Parks have confirmed that the sign on the ?South was erected by a private person and the East was Grandfathered from 1996 before the Park existed. The actual private property on the East side, doesn?t start for 600m up the road. The East trail will start just to the left of the gate. Having said that, I encourage all persons to use caution when using the routes crossing these roads. Trailpeak assumes no liability for anyone accessing this area and each person should confirm their rights with BC Parks and the BC Forest Service.***********************************************************Mara Mountain Cliffs South is both a hike and a extreme mountain bike ride. The route to the summit is a constant climb and in a lot of places, very steep and only an experienced biker should attempt it. Hikers will get a workout, but there is a view from the cliffs that go 100km in any direction, on a clear day. Mara Mountain Cliffs South is all desert at low-levels, treating visitors to cactus, sage, sunbaked rock and on occasion, snake(s). As you climb, you enter into a Ponderosa forest, and while still dry, the vegetation shifts from cactus and sage to forest and 'grassland'. Mara Mountain is part of the Lac Du Bois protected grassland area, but down at river level it is baking desert.",
    "directions": "From Kamloops, travel out Tranquille Rd towards the Airport. Just past the Airport entrance, measure 5.8km from the intersection of Tranquille and Ord Rd. Just across the tracks, the hike itself begins on the right. You may either take the trail to the right or the road to the left. For the purpose of the GPS track, I have taken the trail going up and the road back down.If you are taking the trail, continue up until it meets the road then go right up the road. If you are taking the road, just continue on. After a fair hike/ride, you will come to a large dried up pond. The road to the left is posted and closed. To the right, the road continues up a steep hill. Follow this road to the summit. The road does stay very steep to the summit. When I crested the summit, I was greeted by a loud ?CRASH? in the trees to the side of the trail. Well, the bear spray was out right away! But, I wanted to log the whole route so I continued and once I got around the trees a bit, I discovered about 8 Mountain Sheep (sheep not goats) and they were crashing into each other like they do. Just before the cliffs, the same thing happened and I saw a good dozen more sheep. They generally ignored me except for moving off the trail a bit. Very beautiful animals and more impressive than the goats we see everywhere. On the road going back, I happened on a rattlesnake about 16? and maybe 4 years old. All good things to watch for, but add to the experience.My stats:Distance:15.12kmTotal time: 3:42Moving time: 3:13Average pace: 4.1km/hTotal ascent: 679m (2228ft)",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/717/long_Mara-Mountain-route-14696.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/717/reg_DSC00136-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/717/reg_DSC00141-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/717/reg_DSC00143-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/717/reg_DSC00144-5599_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/717/reg_DSC00145-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/717/reg_DSC00146-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/717/reg_DSC00147-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/717/reg_DSC00148-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/717/reg_DSC00150-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/717/reg_DSC00154-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/717/reg_P5290166-9970.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/717/reg_P5310090-9970.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/717/reg_bench.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/717/reg_bridge-29121.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/717/reg_hikeview.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/717/reg_kam_DCP_0076.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/717/reg_kam_DCP_0079.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/717/reg_startTH.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/717/topo_MtMaraMain.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mara-mountain-cliffs-south-near-kamloops-bc-717",
    "stats": {
        "Activities": "hike mtn-bike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "5 hrs",
        "Total Distance": "15 km",
        "Town": "Kamloops, BC",
        "Type": "out-and-back"
    },
    "title": "Mara Mountain Cliffs South",
    "trail_id": "717"
}