{
    "description": "This is a good hike to add to your journey when you are visiting the Cuties Hollow Falls  (described previously) in the James River Wilderness Area.  The turning point in this hike are a series of 3 waterfalls, one of which is at least 70ft high.  \nLooking at my GPS track, you can see that I tried two routes to get to these ghost falls.  I call them that because in dry times, these falls will be running dry.  The route I took to get to the ghost falls was the one running along the top of the ravine of the James River.  As you make your way past Cuties Hollow fall on the ATV trail, it will disappear after 200m or so.  Make your way up the ridge line and follow the top contour line of the ravine.  There are two or three small depressions created by small brooks that you will cross on your way to the ghost falls.  There are certain areas where evergreen have been growing really thick after a few trees have fallen ?try to circumvent those if you can or push through them if that is your cup of tea.  The forest in this area is a mixture of evergreen and mature deciduous trees.  \nAfter 1.6km from Cuties Hollow Fall, you will finally arrive at the top of the ghost falls.  I managed to spot a distinct trail running from the North which makes me believe there might be another way that local people use to get to these falls.  The top waterfall is quite nice and has a good 30ft drop into a small pool.  Downstream from this, and be careful has this part is very steep and exposed, there is the second waterfall which is running on top of the rock face.  There are no trees around this part of the fall and the view to the James River ravine is magnificent.  You can also see that in this area and further downstream, in certain times of the year, these falls will be very wide and impressive as the rock face is completely devoid of vegetation from the scouring of water.\nThe third waterfall is the tallest and run uninterrupted at least 70ft!  Make your way to the base of the third waterfall to capture some nice pictures.  Then instead of climbing back to the top of the ravine, follow the James River upstream all the way to the Cuties Hollow fall.  I thought that this would be hard but it turned out to be the easiest route.  There is only one or two spots where you have to climb onto the slopes of the ravine to avoid some rock face that plunge right into the river.  Once you are back at the cuties Hollow fall, climb up the ravine and follow the ATV trail back to your car.  BTW someone has kindly perched a metal culvert between alders to cross the main tributary to the James River located 1.25km from the starting point.",
    "directions": "Highway 104 to Marshy Hope, turn onto Strathglass Rd and drive onto it as it becomes Browns Moutain Rd.  Park by the old school located just after a bridge over the James River(N45 37 29.8 W62 09 58.7)",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/7172/narrow_DSC-0047-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/7172/reg_DSC-0050-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/7172/reg_DSC-0054-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/7172/narrow_DSC-0048-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/7172/narrow_DSC-0067-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/ghost-falls-near-antigonish-ns-7172",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "6 km",
        "Town": "Antigonish, NS",
        "Type": "out-and-back"
    },
    "title": "Ghost Falls",
    "trail_id": "7172"
}