{
    "description": "You?ll get a good view of Kamloops Lake and the Thompson River without having to negotiate a steep trail, boulders or climb to dizzying heights--that?s the 1.5-hour return hike up to the top of Battle Bluffs and back. Starting from Frederick Road (1.5 km from the Frederick Road turnoff), head south towards the small ridge across the field where you pick up an old road leading you up the ridge. Continue along this path as it winds down towards the lake. You can see your destination to the left and back to the southeast. Going east, the road will soon turn into a well-kept ?real? trail. You?ll notice leftovers of the former railway telegraph lines as the trail gradually climbs into a small saddle. It?s all uphill from here, another 30 minutes or so of gradual ascent will take you to the top of the bluff. To descend, retrace your ascent route. Note that above stated hiking time is approximate for a round trip.",
    "directions": "Zero your odometer on the main road at the turnoff to the Kamloops Airport. Go west, towards the Tranquille Farm. After 5.6 km, at the junction to the farm, stay right, cross the railroad tracks and head up Criss Creek Road. Continue on the gravel road, and cross Tranquille Creek. The road starts to climb out of the valley, over a cattle guard and continues upward to kilometre 9.9 (from the Airport turnoff). Go straight, onto Frederick Road, and enter the Dewdrop Valley. Continue on Frederick Road for another 1.5 km (from the Frederick Road turnoff), and park your vehicle well off the side of the road. This is where you start your hike.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/718/reg_BattleBluffs.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/718/reg_IMG-2652-62622.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/718/reg_IMG-2952-28805.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/718/reg_IMG-2953-28805_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/718/reg_PICTt0004-13902.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/718/reg_PICTt0006-13902.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/718/reg_bluffs.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/718/reg_frommara.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/718/topo_wifeonbluffs.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/battle-bluff-near-kamloops-bc-718",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "4 km",
        "Town": "Kamloops, BC",
        "Type": "out-and-back"
    },
    "title": "Battle Bluff",
    "trail_id": "718"
}