{
    "description": "Cross-Country ski trails that provide endless rolling mountain bike trails (and hiking) in the summer.  Trail rating obviously goes way up in winter, as these ski trails are extensive and varied and ideal for cross-country hounds.\nIn the summer, there are perhaps better alternatives for  the intermediate to advanced mountain-biker - as most trails here are rather overgrown grassy double-track. However, they do provide solitude for endless hours of easy biking, and are well marked.  I saw a few other bikers and hikers while visiting.\nFor the ?Kamloopian?, this is a nice treat away from the desert sage and dust.  For the visitor from wet Vancouver or Seattle seeking dry-terrain, this area is passable; as they have plenty of evergreen trails closer to home.\n  Yet for the beginner, this set of trails is good because of the sheer number of well-marked easy trails.  Each junction has a trail map!  Other alternatives in my opinion are Lac Du Bois Grasslands, and Kenna Cartwright trails right in town, just as extensive. \nI followed the trails Ponderosa, Hoss, and Drifter, but wasn't too impressed; perhaps other 'blue' trails like Rustler, Rattler, and Cowpoke are more interesting?  Or it could have been the mosquitoes that turned me away. \nMcConnell Hill is the highest point, and an investment in riding out to this area would have been worthwhile if I had more time. It would be great if someone could ride the whole network and post some pictures of the better stuff / views. \nIf so, look for Sidewinder, the direct and steepest route to McConnell Lookout, and let us know. Comments from regular users would be welcome.\nThere is GPS data attached to this trail (see \"download GPS\"), which if loaded into your GPS can help you find route points.",
    "directions": "Either take the Coquihalla (Hwy 5) South about 35 km and take the 2nd exit to the \"Lac Le Jeune\" area.  Then back-track 6 km on Lac Le Jeune (follow signs), or take the Lac Le Jeune road 29 km straight out of Kamloops at the Copperhead Drive exit, exit 366.  Stake Lake is right off Lac Le Jeune Rd.  You park near Stake Lake, and then access the trails to your right.  There are Cowpoke, Rattler, Hoss, and lots of other trails.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/719/reg_Imported-Photos-00000-26608.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/719/reg_Imported-Photos-00004-26608.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/719/reg_kam_DCP_0102.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/719/topo_map.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/719/Kamloops-bike-008-12473.JPG"
    ],
    "source_url": "https://trailpeak.com/trails/stake-lake-trails-near-kamloops-bc-719",
    "stats": {
        "Activities": "hike ski-xc mtn-bike",
        "From": "",
        "Seasons": "spring summer",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "0 km",
        "Town": "Kamloops, BC",
        "Type": "out-and-back"
    },
    "title": "Stake Lake Trails",
    "trail_id": "719"
}