{
    "description": "Kenna Cartwright trails are in town and very extensive.  You won't think you are hiking or riding in a municipal park encompassing 800 hectares. This is a well known favourite for intermediate mountain bikers, and it delivers rolling single-track, some steep sections, amazing views, and is so close to town.  In the park you'll find delicate grassland vegetation like sagebrush, prickly pear cactus, and bluebunch wheat grass.  Please stay on the trails, and bring water and sunscreen.\r\n\r\nFor those spending more time in Kamloops, do this hike/bike first and climb the tower trail to the viewpoint.  You'll see most other local area hikes and attractions from here, including Mara Mtn. (picture below), Grasslands (Lac Du Bois Provincial Park), Mt Paul and Mt. Peter (must ask permission from local first nations), and the city of Kamloops itself.  This trail network used to be called Dufferin; in fact Mt. Dufferin is the highest point in the park at the Telus tower. Access is simple, and maps and map-boards are available at the parking area.  The picture of the map-board here shows you the extent of the trails.\r\n\r\nI enjoyed the ridge trail that starts at the tower; it has some nice roller-coaster sections, and great views.  You can also descend onto lower trails on the North side; lots to explore.  There is GPS data attached to this trail (see \"download GPS\"), which if loaded into your GPS can help you find route points.",
    "directions": "Just off exit 366 Copperhead exit from Hwy #1 West, as you exit on the right, turn left and it's just up a few hundred meters.  There is a large sign with the park?s name on it.\r",
    "geohash": "c342",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/721/reg_kam_DCP_0097.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/721/reg_kam_DCP_0098.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/721/reg_map.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/721/topo_Kenna.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/kenna-cartwright-trails-kamloops-near-kamloops-bc-721",
    "stats": {
        "Activities": "hike mtn-bike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "10 km",
        "Town": "Kamloops, BC",
        "Type": "out-and-back"
    },
    "title": "Kenna Cartwright Trails - Kamloops",
    "trail_id": "721"
}