{
    "description": "A ban on motorized vehicles has left countless Lac Du Bois Grasslands trails  to roam in.  Owing to the rolling hills and somewhat overgrown double-track - creating a 'cushion' like ride--this may be the closest thing to snowboarding for mountain bikers.  It's smooth, and where we started, not that hard; it just rolls through endless grasslands, incredibly scenic at sunset -- and it?s all yours.  There are 15,000 hectares in the Grasslands Park, perhaps the most significant in Western America. We saw no one, and it's only minutes from downtown.  You have to drive a few kilometers along Lac Du Bois road to get away from the noisy dirt-bikes and their super-cargo 4x4s, however the Lac Du Bois Provincial Park is huge, and once you get inside, you have a sea of grassland solitude..I was thoroughly enjoying riding through the sage and grasslands, but when I stopped I was surprised at the symphony of bird-song, which I completely missed while crunching along on fat-tires.  Take time to stop and listen, and stay to existing double-track or trail to preserve the grasslands habitat. You basically follow along 'Lac Du Bois' Road, just out of town, and then pick the place to park, and start walking or biking.  For a mountain biker, the appeal is not stunts or technical trail riding; it is simply the off-road experience in an incredible landscape, second to none in beauty.  Turn off the gizmos, turn down the adrenalin pump, and just enjoy. The rolling hills will give intermediate bikers enough joy. Downhillers can get something out of it though, continue along to WestSyde ridges, and look for various downhill options into the North Thompson River valley.Ask for the McQueen Lake area trails, further along Lac Du Bois gravel road.  Waypoints are attached. Bachelor Heights are closer to town and provide a quick fix of the grasslands, either left or right once up on Lac Du Bois Road. For us, the rolling hills at sunset were a nice touch after a long day of downhill at Sunpeaks.  We stopped at mile marker (kilometer marker) #8, parked, got out and rode.  You'll see road-side markers in yellow; it's that simple. You'll notice that dirt-bike activity stops are mm #2, and the first real opportunity to park on the East side (right) of the road is mm #4, although various double-track exists on the left; just explore!   Some of the pictures above are from waypoint 'grssprk'.  While it looks flat, continuing on to WestSyde ridges and beyond would put you on serious downhill. For the hikers, there's the 3 km trip to Long Lake which gives home to many winged inhabitants. To get to the lake you start by heading east and down a dirt road. After approximately 15 minutes of walking, you'll come to a trail branching off northeast. Take this route, and you'll soon get to Long Lake.If you've come to Kamloops to experience the unique 'dry' geography, this is it.  The cactus grows at lower elevations, just off the river; these grasslands are different again, a sea of 'sage' and grass on rolling hill. While you may take many thoughts away from the expanse of the grasslands, your worries won't come back with you. The grasslands have been protected. Please do your part when visiting to stay on trails or double-track. There is GPS data attached to this trail (see \"download GPS\"), which if loaded into your GPS can help you find route points.",
    "directions": "From Kamloops North Shore (using a street map from the visitor info (center), follow 8th Street to the intersection where Bachelor Hills Rd. continues.  Follow up Bachelor Hills as it climbs and eventually becomes Lac du Bois Road, which will turn to gravel.  Follow along into the park, and stop where you please, or as directed above, or go all the way to McQueen Lake.  The WestSyde ridges are available at many points and run parallel to the road.  See attached waypoints.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/722/long_overview.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/722/reg_DSC00279-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/722/reg_DSC00280-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/722/reg_DSC00281-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/722/reg_DSC00282-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/722/reg_DSC00283-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/722/reg_DSC00285-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/722/reg_DSC00286-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/722/reg_DSC00287-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/722/reg_DSC00288-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/722/reg_DSC00289-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/722/reg_DSC00290-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/722/reg_DSC00291-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/722/reg_DSC00292-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/722/reg_DSC00293-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/722/reg_DSC00294-5599.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/722/reg_bikesok.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/722/reg_map.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/722/reg_quiet.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/722/topo_kam_DCP_0128.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/grasslands-westsyde-lac-du-bois-near-kamloops-bc-722",
    "stats": {
        "Activities": "hike mtn-bike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "0 km",
        "Town": "Kamloops, BC",
        "Type": "out-and-back"
    },
    "title": "Grasslands - WestSyde (Lac Du Bois)",
    "trail_id": "722"
}