{
    "description": "Watching Creek is worth watching. Just to the north of the bridge is a cattle guard. On the east side of the road the fence comes down to meet the road there and just behind that fence is where you?ll start your ascent. The trail joins a gravel road that heads east and parallel to the Tranquille River. You may have to share this road with ATV?s, though. There is a y intersection where the read splits. Going right leads you down to the river and a campsite. However, you take the left, as this is the route towards Watching Creek. About 45 minutes later, you?ll come to a clearing where the road ends. This is your destination, providing fine views of Watching Creek.",
    "directions": "Zero your odometer on the main road at the turnoff to the Kamloops Airport. Go west, towards the Tranquille Farm, which you pass on your left. After 5.6 km, turn right and head up the Criss Creek Road. Climb out of the valley as you go towards Red Lake. After the hill, the road drops into the Tranquille/Watching Creek valley. Cross the Tranquille River at kilometre 22. You?ll see the Tranquille Crossing Recreation Site on your left; that?s where you park your car. Cross the road to the Watching Creek trailhead right at the North cattleguard.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/723/reg_P6260121-9970.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/723/reg_PICT0002-13902.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/723/reg_kam_DCP_0110.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/723/reg_kam_DCP_0114.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/723/topo_bighorn.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/723/narrow_PICT0003-13902.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/723/narrow_start.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/watching-creek-near-kamloops-bc-723",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 3,
        "Time": "4 hrs",
        "Total Distance": "10 km",
        "Town": "Kamloops, BC",
        "Type": "out-and-back"
    },
    "title": "Watching Creek",
    "trail_id": "723"
}