{
    "description": "Inks Lake is full of dirt-bike trails, which could pose some difficulty on busy days, but generally offers some fine singletrack, some rocks and roots, and good XC cardio style riding. This is another vast network of trails near Kamloops.  Kamloops seems to have no end of XC riding options, including nearby Stake Lake, to desert rides like Kenna Cartwright (right in town but huge), Batchelor Heights, RazorBack, and others.\r\n\r\nTrails of interest include Moose Loop, Timber Lake Loop, Heinz 57, Reggie's Roost, and Hidden Valley. Moose Loop offers climbing, single-track, and some downhill. To get to Moose Loop, follow 1 km from the parking lot taking Inks lake road.  At the first major dirt road intersection, turn left.  You ride up for about 6.5 km.  Many trails branch off this road, so go exploring if you want.  When the road forks, take the left, then another 150 feet in take another left.  It's a short climb now to the start of the single track, which is off to the right.  You are not going down yet; you still have to climb!  Downhillers will of course avoid this; it's too much work.  But once you reach the top, follow the single track left.  Climb a bit more, and then the trail starts to descend.  When you make it to the lake, look for the trail going right.  You now have another climb taking you to a marked motorcycle trail; go left to return to the parking area.  Or explore what else is around.\r\n\r\nMind the dirt-bikers if visiting Inks Lake--it's probably become busier in recent years, but motorbikers are sure to have created some fun twisty and flumey rides for you.  It wouldn't be on my favourite list, but those who know the trails well might want to fill in some detail for us. There is GPS data attached to this trail (see \"download GPS\"), which if loaded into your GPS can help you find route points.",
    "directions": "You'll see a gravel truck station on the left, and the Inks Lake Road on the right.  Park here or just in from the cattle guard where other dirt bikers park.  The freeway exit and parking area are GPS'd.\r",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/724/reg_kam_DCP_0099.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/inks-lake-near-kamloops-bc-724",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 4,
        "Time": "0 hrs",
        "Total Distance": "0 km",
        "Town": "Kamloops, BC",
        "Type": "out-and-back"
    },
    "title": "Inks lake",
    "trail_id": "724"
}