{
    "description": "Few trails in B.C. allow you to enjoy beautiful sub-alpine meadows so easily. In late June or July, when the glacier lilies bloom, they are a flush of gold; later in early August, the same meadows are transformed into a rainbow of colours, when Indian paintbrush, mountain daisy, arctic lupine and a variety of other flowers bloom.  From the parking lot, you enter the alpine meadows after a 45 minute, 1 km walk along a gently ascending trail. The trail winds its way through old-growth stands of spruce and sub-alpine fir, crossing several small streams before breaking out into the open of the meadows. The elevation gain is approx. 200m. The trail continues another 1.5 hours across lichen-encrusted rocks to Sheila Lake (6 km round trip). The trail ends at this lake, but another hour of uphill climbing will get you to the panoramic views of Skyline Ridge at an elevation of more than 8,200 feet (12 km round trip from the parking lot).For guided trips (3-7 days) in this wilderness area, check out www.skihike.com, a description of the selected  trails / routing each day of the trip can also be found as a trailpeak trail entry here.",
    "directions": "From the junction at Highway #5 and the Information Centre, go north on the Clearwater Valley Road (Wells Gray Park Road) for 11.8 km. Just after you pass Spahats Creek campground, turn right onto the gravel road, and continue for 1.7 km. Take your left onto Road 10, and continue Road 10 for another 3.1 km, before turning right onto Road 201. Ignore the small roads branching off as you travel 4.4 km along Road 201 to its end with the parking lot. The trail to the meadows begins to the left of the parking area.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/729/long_IMG-6065sm-37359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/729/reg_Clearwater-Valley-from-Trophy-Mnt-MG-4504-5290_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/729/reg_DSCF0012.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/729/reg_IMG-6075sm-37359.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/729/reg_P7200098-22689.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/729/reg_P7200139-22689.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/729/reg_P7210148-22689.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/729/reg_Raft-Mnt-MG-4539-copy-5290.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/729/reg_Tent-at-trophy-MG-4483-copy-5290.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/729/reg_Trophies09-002-21577.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/729/reg_Trophy-Meadows-Trail-21577.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/trophy-meadows-to-sheila-lake-wells-gray-near-kamloops-bc-729",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 4,
        "Time": "4 hrs",
        "Total Distance": "6 km",
        "Town": "Kamloops, BC",
        "Type": "out-and-back"
    },
    "title": "Trophy Meadows to Sheila Lake (Wells Gray)",
    "trail_id": "729"
}