{
    "description": "Sweeping grassland vistas, cool, dry forests, secret ponds and small lakes await visitors of the Lac du Bois Grasslands protected area. It rises north and westward from the hot, dry Thompson valleys through three grassland communities to the forested hills above. Nowhere else in western North America will you find these grassland communities in such close proximity to each other. The grasslands are home to a variety of wildlife: California bighorn sheep, mule deer, moose and waterfowl are common residents and visitors, while the western rattlesnake, sharp-tailed grouse and flammulated owl live more secretive lives within its boundaries. \r\n\r\nIsobel Lake is a pleasant lake with a surface area of 14 ha., and stocked with brook trout, Isobel provides good fall and winter ice fishing. The Isobel Lake Interpretive Trail is set up as a demonstration forest, ideal for a family trip with children. Along the way, you?ll come upon a number of signs identifying the varieties of tree and plants in the area.\r\n\r\nStarting the loop in a counterclockwise direction, you?ll come to Forest Inn after about a forty minute walk. Forest Inn is an open shelter with a fire pit, and picnic tables. Also, toilets are located at the site. At the south end of the lake, there?s also a campground, although the number of sites is limited. The loop around Isobel Lake is about 5 km, so allow 1-2 hours. \r\n\r\nNote that there are many stretches of private land within the boundaries of the park and adjacent to it. Specific written permission must be obtained from the landowner before carrying out any activities on private property. Also most activities in Lac du Bois Grasslands Park require a permit and/or authorization from BC Parks, since the area is so sensitive to disturbances. Check the BC parks website before going. \r\n\r",
    "directions": "\r\nFrom Kamloops, after crossing the Thompson River, drive north on Tranquille Rd., continue on 8th St., and drive up through the Bachelor Hills onto Lac du Bois Road. The surface turns into gravel about 2 km above Bachelor Hills. Keep to the left at the first major intersection. Approx. 16 km from the bottom of Bachelor Heights, turn right onto the McQueen Lake Forest Service Road (watch for logging trucks!). There's a sign pointing out Isobel Lake to the right. Continue on this road for another 3.6 km, until you reach the Isobel Lake Interpretative Sign on the right. \r\n\r",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/730/reg_P4060035-9970.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/730/topo_isobellake.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/730/narrow_DSC01535-27047.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/730/narrow_DSC01564-27047.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/730/narrow_P4060033-9970.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/730/narrow_heron.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/isobel-lake-lac-du-bois-grasslands-near-kamloops-bc-730",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "5 km",
        "Town": "Kamloops, BC",
        "Type": "out-and-back"
    },
    "title": "Isobel Lake (Lac du Bois Grasslands)",
    "trail_id": "730"
}