{
    "description": "This province has many natural wonders--the Hoodoos are definitely among the most exotic ones. More than 10,000 years ago, the clay benches along the South Thompson River formed the bottom and shoreline of glacial Lake Thompson. Centuries of erosion have created these intriguing rock formations, referred to as Hoodoos, only a short distance from the center of Kamloops. The valley in which these majestic sandstone structures are located is easily accessible and can be reached in less than an hour. Take your camera, it?s well worth recording this example of Mother Nature?s wonders.",
    "directions": "NEW INFORMATIONParks and CP no longer want you to cross the railroad tracks. There is a safer way.Zero your odometer on the main road leading into the Kamloops Airport. Go west, towards the Tranquille Farm for 2.5 km. Turn Right onto Ord Rd and cross the tracks. PLEASE DRIVE SLOWLY ON THIS SECTION, AS THE ROAD IS DUSTY AND THERE ARE RESIDENCES CLOSE TO THE ROAD. If you see him, please wave to the nice man who has cleared this part of ORD road for our safety. Follow Ord Rd to the end, where there is a cul-de-sac. Park here, at GPS coordinates 50.7188717, -120.4735067 or somewhere along that loop. Those coordinates, at the north of the loop, mark the trailhead. About 60 meters from the trailhead, keep to the right. About 200 meters from the trailhead, keep left for the hoodoos hike, climbing towards the sandstone hills directly ahead.The trail into the canyon is off and up to the right. The initial climb is steep for about 5-10 minutes. After this section, the route drops down into the canyon and follows the riverbed heading north into the gorge.The hoodoos are another 10 - 15 minutes along the river. Depending on the season, the dried up riverbed may allow you to go on for several kilometres, especially in mid-summer or fall. Total hiking distance for the round trip is between 6 and 10 km, so allow 1 ¾ to 3 hours.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/731/long_Hike-184-28485.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/731/reg_IMG-1826-62780.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/731/reg_IMG-2325-62622.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/731/reg_P1070876-9970.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/731/reg_P2160916-9970.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/731/reg_P2160920-9970.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/731/reg_PICT0010-13902.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/731/reg_PICT0014-13902.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/731/reg_PICT0015-13902.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/731/reg_hoodoos19-9970.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/731/reg_hoodoos25-9970_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/731/topo_kamloopsnw.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/731/narrow_P2160929-9970.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/731/narrow_f1000031.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/cinnamon-ridge-hoodoos-near-kamloops-bc-731",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "10 km",
        "Town": "Kamloops, BC",
        "Type": "out-and-back"
    },
    "title": "Cinnamon Ridge Hoodoos",
    "trail_id": "731"
}