{
    "description": "NTS Map:92D13.  The 750 hectare Cowichan River Provincial Park has 20 kilometres of trails that follow the Cowichan River from Skutz Falls to Stoltz Pool. The park offers hiking, kayaking, tubing, and mountain biking. While on the trails, GPS coverage is sketchy at best, but is fairly good in the wide clearings at parking lots and along the riverbank. Waypoints are provided for the main access points, and the North Side and Cowichan River Footpath at Mayo Road. \r\n\r\nFor hikers, there are three well developed trails to chose from, all can be accessed from the Mayo Road parking lot on Riverbottom Road:\r\nOn the south side of the river between Skutz Falls and Holt Creek, the Cowichan River Footpath.\r\nOn the north side of the river between Skutz Falls and the 66 Mile Trestle, the North Side trail.\r\nCrossing from the north to south side of the river at 66 Mile Trestle, part of the Cowichan Valley section of the Trans Canada Trail takes you from Skutz Falls to the Glenora trailhead at Holt Creek, crossing to the south side of the river at the 66 Mile Trestle.\r\n\r\nThe Cowichan River Footpath is a 20-km historical trail winding its way alongside the river, connecting all of the river's parks. This is an easy to moderate level of hiking, and you should allow about 6 hours to hike its length. The main trail is well marked, but several older secondary routes still exist, and these are not sign-posted or maintained.  Downstream of Skutz Falls Road Forest Road Bridge is fairly well brushed out, upstream to Skutz falls is more overgrown. Although the trail is well signposted, there are many unmarked branch trails. \r\n\r\nThe North Side Trail is the roughest and most scenic of the trails. This trail hugs the river, and affords fantastic views of the river and access to swimming holes.\r\n\r\nThe Trans Canada Trail is the widest and flattest of the three trails. Its hard packed gravel base is suitable for bikes, strollers, and wheelchairs. This is also the shortest route to connect the park areas; for example, from Skutz Falls to the 66 Mile Trestle is a 5.5 kilometre slog along the North Side Trail, vs a 1.6 kilometre stroll along the Trans Canada Trail. From the Mayo Road trail junction, Marie Canyon is 2.5 km, and Stoltz Pool is 6.5 km, one way. Highlights include the 90 metre long Mile 66 Trestle over Marie Canyon, and the 73 metre long 64.4-Mile Trestle over Holt Creek.\r\n\r\nPaddling from Skutz Falls to Marie Canyon is approximately 10 kilometres and you might have to portage around Marie Canyon, depending on the water level. Hazards include rapid water level changes, log jams and rapids. The Cowichan River has a gradient of 7 metres per kilometre, and is rated as Class II/III at a flow of 85 cubic metres per second, and Class IV at higher flow levels during spring run off and the winter rainy season. The water level and flow rates can fluctuate rapidly on the river; check station 08HA011 - at http://scitech.pyr.ec.gc.ca/waterweb/formnav.asp?lang=0 for real-time flow rate data.\r\n\r\nAt low flows, Skutz Falls is a good starting point for beginner to intermediate level runs. A short run through a bedrock canyon passes under the Skutz Falls Road Forest Road Bridge, and leads into class II/III rapids. The river then opens slightly in a swift section without any significant rapids as you approach Marie Canyon. \r\n\r\nSmall surf waves mark the entrance to the bedrock gorge that forms Marie Canyon, where you will find several ledges as the river drops into the S-Bend, and then heads under the 66 Mile Trestle. Shortly past of the trestle, the Double Whammy has more surf waves. The Last Drop, the last set of rapids, is downstream a short distance from the Double Whammy.\r\n\r\nThere are several well marked take-out trails on the left bank of the river, all within a short distance of parking lots. Riverbottom Road connects with all the parking lots, campsites, and trail access points.\r\n\r\nCamping is available at Horseshoe Bend Group Campsite, Skutz Falls Campground, Stoltz Pool Campground and Group Campsite.\r\n\r\nThere is GPS data attached to this trail (see \"download GPS\"), which if loaded into your GPS can help you find route points.\r",
    "directions": "There are three main access points to this Cowichan River Provincial Park:\r\n\r\nSkutz Falls Road/West Access: Located off Highway 18, Skutz Falls Road provides access to Skutz Falls Campground, Skutz Falls Day-Use area, Horseshoe Bend Group Campsite, Marie Canyon Day-Use area and the Skutz Falls Trailhead of the Cowichan River Trail. Follow signs from Skutz Falls Road via Cowichan Lake Road and Mayo Road to Riverbottom Road.\r\n\r\nHighway 18 Connector/Middle Access: Located off Highway 18, the Highway 18 Connector provides access to the Stoltz Pool Campground, Group Campsite and Day-Use areas. Follow signs to Riverbottom Road.\r\n\r\nRobertson Road/South East Access: Located on Robertson Road in the Glenora area south of Duncan. To access this point proceed west on Glenora Road, turn right onto Vaux Road and continue down Vaux Road, as it leads into Robertson Road. This provides access to the Glenora Trailhead of the Cowichan River Trail.\r",
    "geohash": "c0xv",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/739/narrow_Cowichan-Valley-016-12342.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/739/narrow_Cowichan-Valley-021-12342.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/739/narrow_cr1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/739/narrow_cr2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/739/narrow_cr3.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/739/narrow_cr4.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/739/narrow_cr5.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/cowichan-river-provincial-park-near-nanaimo-bc-739",
    "stats": {
        "Activities": "river-kayak hike mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "7 hrs",
        "Total Distance": "13 km",
        "Town": "Nanaimo, BC",
        "Type": "out-and-back"
    },
    "title": "Cowichan River Provincial Park",
    "trail_id": "739"
}