{
    "description": "NTS Map:92B11.  Island View Beach Regional Park has a long expanse of sheltered beach suitable for hiking, swimmers, and beachcombing.  Kayakers can use the park as a starting point for quick trips to nearby James and Sidney Islands, or further into Cordova Channel and Haro Strait.  \r\n\r\nStarting at the boat launch parking lot, you can explore the 41.7 hectare park by heading along the beach to the south or north, or head east onto the water. Heading south, you quickly come to the southern boundary of the park, but can continue along at low tides to clay cliffs at Cowichan Head. \r\n\r\nTo the north, you can take an inland trail through saltmarsh and backdunes, or walk along the beach; both ways meet shortly before the northern boundary of the park. Heading past the northern boundary to the northern tip of Cordova Spit is an easy 6 kilometre round trip, and passes through the East Saanich Indian Reserve. \r\n\r\nFrom the boat launch ramp at the parking lot, the southern tip of James Island is 4.8 kilometres (474360E 5381654N), the southern tip of Sidney Island is 5.6 kilometres (478399E 5831495N), and the western tip of D'Arcy Island is 6 kilometres (478974E 5379275N).\r\n\r\nThe park has picnic tables and washrooms, a boat launch ramp and ample parking. There is GPS data attached to this trail (see \"download GPS\"), which if loaded into your GPS can help you find route points.",
    "directions": "Take the Pat Bay Highway to Island View Road; turn onto Homathko Road, and follow it to the park entrance.\r",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/743/narrow_P7140038.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/743/narrow_P7140040.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/743/narrow_P7140047.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/743/narrow_P7140060.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/743/narrow_P7140067.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/island-view-beach-near-victoria-bc-743",
    "stats": {
        "Activities": "river-canoe sea-kayak hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "6 km",
        "Town": "Victoria, BC",
        "Type": "out-and-back"
    },
    "title": "Island View Beach",
    "trail_id": "743"
}