{
    "description": "NTS Map: 92J15. A gorgeous trail that clambers through the rounded rust/blue/grey mountains between the Coast Mountains and the Chilcotin plain. The trail begins on a logging road with some greenery along the edges to break the monotony. The 5 km mark (from where you must abandon a 2wd car) crosses Taylor creek and finds you at a cozy 2 or 3 tent stopover site. At this point the trail is in forest and much more pleasant. 6 km from the campsite you arrive at Taylor Basin cabin - scary on the outside, cozy on the inside, with lots of room for tents. From the cabin you can explore the countless peaks and ridges throughout the valley, or follow the trail (another 11 km) to the next valley over and the gorgeous Spruce Lake. Allow at least 3 or 4 days to explore this amazing landscape! There is GPS data attached to this trail (see \"download GPS\"), which if loaded into your GPS can help you find route points.",
    "directions": "From Lillooet follow Hwy 40 toward Gold Bridge. After the hydro dam, follow the road along Downton Lake approx. 50 km, and turn right onto the well-maintained dirt road signed for Tyax Lodge and Tyaughton Lake. Keep following the signs for Tyax, but stay left at the fork that is the resort driveway. Stay on the main road until you reach a 3-way fork, the middle of which is a dead end.  The right is Mudd Creek FS road; the left (leading upwards) is the road you want. The road is good, but cut with water gutters every few hundred meters which can be negotiated with SLOW driving and decent vehicle clearance. Do not be sucked in to following the new road up the mountain.  Keep an eye out for a sharp turn left and up, where a slightly grassy, almost hidden road down and to the right is the one you are supposed to follow (2wd may want to park here - except maybe rentals!)  Take care, the new road is not on the current Forest Services Map. At the first T-intersection turn right, and at the next one right again. Technically a good, high 4wd can drive this road right up to the bridge over Taylor creek, others may be comfortable parking at the 2nd turn-off, about 2 km from the first wilderness camp site.",
    "geohash": null,
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/745/reg_Taylortopo.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/745/reg_blueridge.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/745/reg_marmotclosereduced.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/745/reg_sunsetbasin.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/745/reg_taylor.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/745/topo_eannetteridgewalk.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/taylor-basin-spruce-lake-near-lillooet-bc-745",
    "stats": {
        "Activities": "hike mtn-bike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 5,
        "Time": "21 hrs",
        "Total Distance": "22 km",
        "Town": "Lillooet, BC",
        "Type": "out-and-back"
    },
    "title": "Taylor Basin/ Spruce Lake",
    "trail_id": "745"
}