{
    "description": "NTS Map:92B5.  Mount Maguire  (East Sooke Park; Anderson Cove parking lot to Mount Maguire)\r\n\r\nThis trail takes you  from sea level at Anderson Cove to 272 m at the summit of Mount Maguire. The round trip is approximately 7 km (1.5-2 hr each way), moderate to difficult in places. Intersecting trails are marked (in an odd and somewhat misleading sort of way) but the park brochure map is inaccurate and confusing. Make sure to bring a compass, and don't rely completely on the map for guidance. There are no facilities in the park, except for a washroom at the parking lot, and water is not available, so be sure to bring enough. \r\n\r\nThe trail rises and falls repeatedly--from the parking lot to the summit of Mount Maguire takes you over approx 3.5 km, but in terms of a straight-line distance, this represents 2.2 km. Due to the terrain and grade, this trail could be hazardous in wet weather, and is not suitable for children. There are portions of the trail that might be flooded in the winter, and in wet conditions, the already slippery trail up Mount Maguire could become dangerously slick. In the summer, this area is very dry and the fire hazard extreme.\r\n\r\nFrom Anderson Cove, the trailhead starts off with a fairly steep grade;  sharply rising and falling sections are interspersed with level portions of the trail. The majority of the fairly wide trail is hard packed forest-floor type dirt, with stretches over boardwalks, a rubbly dried up streambed, and loose rock over the final ascent. Almost the entire way, the trees provide shade from the sun, and surrounding the path is a virtual carpet of ferns.\r\n\r\nOnce past the final steep ascent, you can rest on a bench at the summit and savour the magnificent views of the Strait of Juan de Fuca, a most gratifying reward for the hike. The Olympics seem bigger and closer, and definitely clearer, and the crisp white of the clouds, the deep green of the forest below, the brilliant blue of the sky and ocean make for a stunning postcard-worthy vista. If there are no low-lying clouds hanging about, Donaldson Island (also known as Secretary Island) can be seen below, as can parts of Possession Point and Iron Mine Bay.\r\n\r\nGPS coverage over the first part of the trail (approximately 0.5 km) was nonexistent; for the next 2 km sporadic 2D fixes with a radial error of between 16 and 40 metres were typical. As the elevation increased and the tree canopy thins on the final approach to the summit, good 3D fixes were available with a few areas where the rocks blocked all signals. On the way back, the satellite geometry improved, and decent 3D fixes were available on the majority of the trail. Although the GPS data and map image have waypoints for the last four trail signs, the GPS coverage in the area is sketchy enough that I would stress the importance of knowing where you are hiking and not blindly marching towards a waypoint. \r\n\r\nProbably the best guide to the trail is the image of the six trail markers, shown sequentially on the route from the Anderson Cove parking lot to the summit of Mount Maguire. None of the trail markers indicate any of the trail names that are shown on the \"official\" CRD maps or signs for the area, and none of the trail markers indicate which trail or trail segment you are on. At the first sign, take the Coast Trail branch, and then stay on the main trail, no matter how inviting the other branches look; branch off only when you encounter the other five signs and then take the indicated branch to Mount Maguire. There is GPS data attached to this trail (see \"download GPS\"), which if loaded into your GPS can help you find route points.",
    "directions": "Old Island Highway to Sooke Road. Follow Sooke Road (#14) towards Sooke, to Gillespie Road, turn left and continue down Gillespie Road. Turn Right on East Sooke Road, and follow it to Anderson Cove parking lot.\r",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/748/reg_DSC04173-25456.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/748/reg_trailsigns.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/748/narrow_DSC04157-25456.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/748/narrow_DSC04166-25456.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/748/narrow_P7180024.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/748/narrow_P7180032.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/748/narrow_P7180042.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mount-maguire-near-victoria-bc-748",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter summer",
        "Stars": 4,
        "Time": "4 hrs",
        "Total Distance": "7 km",
        "Town": "Victoria, BC",
        "Type": "out-and-back"
    },
    "title": "Mount Maguire",
    "trail_id": "748"
}