{
    "description": "NTS Map:92B14.  Beaumont Provincial Marine Park is located in Bedwell Harbour, on the west shore of South Pender Island. The 58 hectare park offers 15 campsites, pit toilets and a hand pump for fresh water, making it a great base for water based exploration of the Penders and Saturna Islands.\r\n\r\nThe closest vehicle approach to Beaumont Provincial Marine Park is from the parking lot for Mount Norman Regional Park on Ainslie Point Road, just over the Canal Bridge that connects North and South Pender Islands. The Mount Norman and Beaumont Marine Park trails both begin at the parking lot. From the parking lot, a 30 minute hike along a well marked trail takes you to the shell beaches on Bedwell Harbour; head up the Mount Norman trail, and then the branch trail to Beaumont. The trail is steep, and will take 40 minutes on the way back. You can also drive further up Canal Road to the Mount Norman parking lot, and then hike down to the beach. The 244 metre summit of Mount Norman is well worth the walk for the views of the Gulf Islands, the mainland of Vancouver, and Mount Baker.\r\n\r\nKayaks and canoes can be launched at the Port Browning Marina, the Bedwell government dock on Egeria Bay, or at Medicine Beach on North Pender Island. The Port Browning marina is a 4 km paddle to the park; Medicine Beach and the government dock are a 1.5 kilometre paddle.  The Port Browning marina on North Pender offers full facilities (great pub) and is within walking distance of a large grocery store. Clearance under the wooden bridge over Pender Channel connecting North and South Pender Islands is 8m at high tide, not a concern for kayaks.\r\n\r\nCamping in Beaumont Provincial Marine Park can be described as \"rustic\", but it is beautiful, peaceful, quiet, and the views are fantastic. If you have a support boat with you, or have traveled by boat, 15 mooring buoys are available to the east of Skull Islet and they are in a fantastic location.\r\n\r\nBedwell Harbour is a wonderful place to explore; the contrast between trees, rocky shores and sandy beaches results in a never ending change of vista as the sun sets, and again as the sun rises and morning fog develops. It would be easy to spend several days exploring Bedwell Harbour, yet it is possible to see much of the area with a bit of planning. Highlights that are well worth the trip are:  Ainslie Point, Razor Point, Peter Cove, and the fantastic beaches around the Skull Islets. Chart 347701 - Plans Gulf Islands is probably your best bet for this area in terms of detail and the big picture, but it is a plan chart and not useable as an electronic chart for planning. If you want to use an electronic chart, use chart 344201.\r\n There is GPS data attached to this trail (see \"download GPS\"), which if loaded into your GPS can help you find route points. \r\n\r",
    "directions": "BC Ferries from Swartz Bay to Otter Bay Ferry Terminal on North Pender Island. MacKinnon Road from the terminal, left onto South Otter Bay Road, right onto Bedwell Harbour Road. Bedwell Harbour Road turns into Canal Road; cross over the wooden bridge and turn right onto Ainslie Point Road. Canal Road continues on to the east entrance for Mount Norman Regional Park. GPS waypoints are included for the road turns driving from the ferry.\r",
    "geohash": null,
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/749/narrow_2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/749/narrow_26.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/749/narrow_27.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/749/narrow_34.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/749/narrow_48.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/beaumont-marine-park-near-victoria-bc-749",
    "stats": {
        "Activities": "river-canoe sea-kayak hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 5,
        "Time": "2 hrs",
        "Total Distance": "10 km",
        "Town": "Victoria, BC",
        "Type": "out-and-back"
    },
    "title": "Beaumont Marine Park",
    "trail_id": "749"
}