{
    "description": "NTS Map:92G4.  Cable Bay is a small bay opening onto Stewart Channel, a short distance from Duke Point and Gabriola Island. The bay is well named; numerous pieces of rusting steel cable from the areas log booming grounds days are scattered along the mucky shore. The sand stone rock formations along the bay and the views of the area make this short hike very interesting. \r\n\r\nAlthough the trail ends at the Cable Bay bridge, there is a rough trail that follows the shoreline along Stewart Channel to Dodd Narrows. Heading past Dodd Narrows, you can take a steep downhill branch trail to a small cobble beach, or head up hill back towards the parking lot. The trail ends abruptly at a gravel road, where\r\nyou have the choice of heading left or right--the GPS track is the result of heading right, an easy walk with a 50 metre push through moderate brush to rejoin the trail heading back to the parking lot.\r\n\r\nHeading back from the Cable Bay bridge to the parking lot on the main trail is a 4.2 kilometre hike.  Heading past the bridge to Dodd's Narrows and beyond is 4.7 kilometres and will take about 2 hours.\r\n\r\nAt low tides, you can explore Cable Bay itself, and the walk along the sandstone banks towards Dodd's Narrows. The current \r\nthrough Dodd's Narrows is strong, making it hazardous for swimming, \r\nand impassable for canoes and kayaks when opposing the current. Consulting the tide tables will enable a short but rapid and thrilling ride through the rocky passage.\r\n\r\nThe signage on the Cable Bay trail is poor; just stay on the main trail at all intersections.\r\n\r\n There is GPS data attached to this trail (see \"download GPS\"), which if loaded into your GPS can help you find route points.",
    "directions": "Trans-Canada Highway to Cedar Road exit, south of Nanaimo.  Follow Cedar Road until it turns into Harmac Road. Take Harmac Road to Holden Corso Road (sign indicates Cable Bay park at elevated crossing over Highway 19--Duke Point Highway).  Holden Corso Road eventually turns into Barnes Road; turn left onto Nicola Road. The parking lot is at end of Nicola Road.\r",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/750/narrow_P7200040.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/750/narrow_P7200047.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/750/narrow_P7200053.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/750/narrow_P7200069.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/750/narrow_P7200074.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/cable-bay-near-nanaimo-bc-750",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "5 km",
        "Town": "Nanaimo, BC",
        "Type": "out-and-back"
    },
    "title": "Cable Bay",
    "trail_id": "750"
}