{
    "description": "NTS Map:92F1.  Colliery Dam Park is a small park that is a very popular swimming location in the summer. Slightly over 2.5 kilometres of trails loop through dense wooded sections of the 28 hectare park, and around two man-made lakes. The lakes were formed when a dam was created to provide fresh water for the Harewood No.1 Mine, and are separated by a concrete dam and spillway. The upper lake has three small swimming beaches. Caves formed during the ice age are accessible from the main park trail, but expect to have to do a bit of scrambling through brush to access them.\r\n\r\nThe trails are mostly bark mulch with the occasional rocky sections, stairs, and boardwalks. Looping through all of the trails is a moderate 1.5 hour hike. There are no trail signs, markers, or facilities in the park.\r\n\r\nUTM for parking lot: 10 U E429450  N5444479  \r\n\r",
    "directions": "From Highway 19A - west on Pine Street, turn left onto 5th Street, left onto Harewood Road. Harewood Road turns into Nanaimo Lakes Road, adjacent to DND property. Follow this to the parking lot on the left, just before the Highway 19 underpass.\r\n\r\n\r\nFrom Highway 19, Nanaimo Bypass, go east at the 5th Street exit, and turn onto Wakesiah Avenue.  Turn right onto Nanaimo Lakes Road at  the four way intersection. Follow the road to the parking lot on the right, just before the Highway 19 underpass.\r",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/751/reg_DSC-0014-47128.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/751/reg_fall-colors-20572.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/751/narrow_P7200002.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/751/narrow_P7200004.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/751/narrow_P7200011.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/751/narrow_P7200012.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/751/narrow_P7200013.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/colliery-dam-park-near-nanaimo-bc-751",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "0 km",
        "Town": "Nanaimo, BC",
        "Type": "out-and-back"
    },
    "title": "Colliery Dam Park",
    "trail_id": "751"
}