{
    "description": "NTS Map:92F1.  Protection Island can be explored by a 4 kilometre hike along the shore, using the local roads as shortcuts, or by following the local walking trails throughout the island. \r\n\r\nHeading around the island, there are many superb beach areas, including Billy Bones Bay, Blunderbuss Bay, Long John Silver Bay, and Corsair Bay. At low tides, it is a quick wade from Pirate's causeway on Billy Bones Bay to the east shore of Newcastle Island. On the beach section between Stuart Point and Gallows Point, many artifacts from the industrial days of the island can still be discovered.\r\n\r\nThe island is an easy 1 kilometre paddle from Nanaimo across McKay channel. Exploring from the water, the west and south sides of the island are sheltered, but can be quite busy with seaplane and marine traffic. \r\n\r\nAfter a day of hiking around the island, you can catch a drink or meal at the Dinghy Dock Pub while waiting for the return ferry to Nanaimo.\r\n\r\n\r\n There is GPS data attached to this trail (see \"download GPS\"), which if loaded into your GPS can help you find route points.",
    "directions": "Passenger ferry to Good Point wharf on Protection Island runs from the Commercial Bay public wharf at the foot of Wharf Street, off Front Street in Nanaimo.  \r",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/755/reg_prot6.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/755/reg_prot7.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/755/reg_prot8.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/755/narrow_prot20.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/755/narrow_prot21.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/protection-island-near-nanaimo-bc-755",
    "stats": {
        "Activities": "river-canoe sea-kayak hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "7 hrs",
        "Total Distance": "4 km",
        "Town": "Nanaimo, BC",
        "Type": "out-and-back"
    },
    "title": "Protection Island",
    "trail_id": "755"
}