{
    "description": "NTS Map:92F1.  The 20 hectares of Drumbeg Provincial Park contain approximately 2 km of easy hiking trails. The trails follow the shoreline, through Garry oaks, and open meadows with views of Gabriola Passage, the Strait of Georgia, Coast Mountains, and surrounding Gulf Islands. The park has a one kilometer long sand and pebble beach, with amazing sandstone and conglomerate rock formations that can be explored at low tide. \r\n\r\nThere are many areas to explore by kayak and canoe. To the north, Sear, Tugboat, Bath and Saturnina Islands, all part of the Flat Top Islands, is a 2 kilometre paddle. 800 metres to the east, passing around Rogers Reef, you find Breakwater Island. To the west on Valdes, Cordero Point and Wakes Cove, and the narrow Kendrick Island on the east coast of Valdes.  Strong tidal flows through Gabriola Passage make this an area is for experienced kayakers only. The GPS data file has waypoints for the nearest edge of the areas islands, reefs and points.\r\n\r\nUnderwater enthusiasts can dive from the shores of the park, or head out to Rogers Reef (10U 449742E 5442177N) by boat and still stay out of the strong currents that run through Gabriola Passage. \r\n \r\nThis park contains a plant called Giant Hogweed. Touching any part of this plant, followed by exposure to sunlight produces painful blisters or burns up to 48 hours after contact. Contact with eyes can cause temporary or permanent blindness. If you do come in contact with the plant, you are advised to wash the affected areas immediately, keep them out of direct sunlight and seek medical advice. Giant Hogweed is originally from Asia and was introduced as a garden ornamental plant. It grows to 5-7 meters (15-20 feet) and a width of 1.7 meters (5 feet). The thick, hollow stems have reddish-purple spots and bristles. The large leaves are similar to shape to maple leaves, with hairs on the undersurface.\r\n\r\n There is GPS data attached to this trail (see \"download GPS\"), which if loaded into your GPS can help you find route points.",
    "directions": "BC Ferries from Nanaimo.  From the Gabriola ferry terminal, take South Road to Stalker Road and follow signs to the park.\r",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/756/narrow_drumbeg11.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/756/narrow_drumbeg17.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/756/narrow_drumbeg18.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/756/narrow_drumbeg19.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/756/narrow_drumbeg20.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/drumbeg-provincial-park-near-nanaimo-bc-756",
    "stats": {
        "Activities": "river-canoe sea-kayak hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "4 hrs",
        "Total Distance": "4 km",
        "Town": "Nanaimo, BC",
        "Type": "out-and-back"
    },
    "title": "Drumbeg Provincial Park",
    "trail_id": "756"
}