{
    "description": "NTS Map:92F1.  Gabriola Sands Provincial Park is one of three provincial parks on Gabriola Island. The 6 hectare park features two sandy beaches and large grassy fields. \r\n\r\nThe park's two sandy beaches form an isthmus that divides Taylor Bay and Pilot Bay. This isthmus and sandy beach are relatively uncommon in the rocky Gulf Islands, and provide important ecosystems for migratory and breeding shorebirds and many marine invertebrates that live in the sand.\r\n\r\nThe beaches on Pilot Bay and Tayler Bay are ideal launching points for canoeing or kayaking Fairway Channel and Northumberland Straight. \r\n\r\nFrom Pilot Bay, you can head east to Clark Bay and round Orlebar Point to head into Leboeuf Bay and Sandwell Provincial Park on Lock Bay (4.9 kilometres one way). The lighthouse on Entrance Island Light is an interesting side trip. \r\n\r\nFrom Taylor Bay, heading west past Malaspina Point gives you the option of heading to Newcastle and Protection Islands (4.5 kilometres one way), Cable Bay, Joan Point and Mudge Island (10 kilometres one way). If you head to Mudge Island, beware of the strong currents in Dodd Narrows, between Joan Point and Purvis Point.\r\n \r\n There is GPS data attached to this trail (see \"download GPS\"), which if loaded into your GPS can help you find route points.",
    "directions": "BC Ferries from Nanaimo. From the Gabriola ferry terminal, turn left on Taylor Bay Road and follow it until you see signs for Gabriola Sands Provincial Park, located on Decourcy Drive.\r",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/757/narrow_gabs10.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/757/narrow_gabs12.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/757/narrow_gabs16.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/757/narrow_gabs18.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/gabriola-sands-provincial-park-near-nanaimo-bc-757",
    "stats": {
        "Activities": "river-canoe sea-kayak hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "4 hrs",
        "Total Distance": "0 km",
        "Town": "Nanaimo, BC",
        "Type": "out-and-back"
    },
    "title": "Gabriola Sands Provincial Park",
    "trail_id": "757"
}