{
    "description": "NTS Map:92B11.  The 1,219 hectare Gowlland Todd Provincial Park offers more than 25 kilometers of multi-use trails with spectacular views. The park encompasses nearly the entire east side of Saanich Inlet, from Goldstream to Brentwood Bay. Gowlland Range towers 430 meters over Finlayson Arm, a unique fjord that only replenishes its marine waters once a year.\r\n\r\nThe park preserves a large part of the Gowlland Range green space, and the shoreline and uplands of Tod Inlet.  The Gowlland Range is a rich area of biodiversity, with over 150 animal and plant species. The protected area preserves a rare, dry coastal Douglas fir habitat that features grassy meadows, rocky knolls and old-growth forest.\r\n\r\nThere are three trailheads for day-use access; Tod Inlet off Wallace Drive in Brentwood Bay, Mackenzie Bight off Rossdurrance Road, and Caleb Pike on Caleb Pike Road, off Millstream Road.  Gowlland Todd Park can also be accessed from the water on Tod Inlet. Mountain biking is allowed on most trails leading from the Caleb Pike and Mackenzie Bight trailheads.\r\n\r\nTrails located around the Wallace Drive/Tod Inlet point are gentle and pass through old Vancouver Portland Cement Company settlements on the way to the shores of Tod Inlet. The parking at the Tod Inlet trailhead is limited to a small amount of roadside parking.\r\n\r\nThe Mackenzie Bight and Caleb Pike Trailheads lead to well maintained trails through mature forest and along the water. The majority of the trails extend from Mackenzie Bight to Caleb Pike, with cross trails to Mount Finlayson in Goldstream Provincial Park. \r\n\r\nHeading west from the McKenzie Bight trailhead, McKenzie Bight is a 1.2 kilometre hike, and Jocelyn Peak is a 6.5 kilometre five hour hike. Both routes are moderate to difficult hikes, requiring hiking boots. Heading further north along Willis Point past the parking lot for the trailhead, you can connect with the trails leading to Partridge Hill--these trails are not signed or maintained but offer great views of Tod Inlet.\r\n\r",
    "directions": "Tod Inlet off Wallace Drive in Brentwood Bay, Mackenzie Bight off Rossdurrance Road, and Caleb Pike on Caleb Pike Road, off Millstream Road.\r",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/758/reg_Gowland-Tod-Trail-007-46378.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/758/reg_Gowland-Tod-Trail-030-46378.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/758/reg_Tod-Gowland-Park-021-46378.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/758/reg_Tod-Gowland-Park-031-46378.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/758/narrow_GowllandPark1-12324.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/758/narrow_GowllandPark2-12324.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/758/narrow_todd67.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/758/narrow_todd69.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/758/narrow_todd70.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/758/narrow_todd71.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/758/narrow_todd72.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/gowland-todd-provincial-park-near-victoria-bc-758",
    "stats": {
        "Activities": "hike mtn-bike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "7 hrs",
        "Total Distance": "12 km",
        "Town": "Victoria, BC",
        "Type": "out-and-back"
    },
    "title": "Gowland Todd Provincial Park",
    "trail_id": "758"
}