{
    "description": "NTS Map:92C10.  Bounded to the south by a bridge at Harris Cove, and Gordon River to the north, Mile beach is a 2 kilometre long crescent shaped beach that opens onto Port San Juan, just outside of Port Renfrew. The beach features numerous ocean front campsites, all within walking distance to the trailhead for the Coast Trail, and the general store in Port Renfrew.\r\n\r\nWalking along the entire 4 kilometre length of the sandy beach will take you through land that forms part of the Gordon River and Pachena bands, and the Pacific Rim National Park Reserve. At the far north end of the beach you are literally a stones throw from the start of the West Coast Trail, but make sure you stop at the registration center for your trail use permit and to arrange for transportation across the river. \r\n\r\nKayaks and canoes are a great way to explore the waters of Port San Juan, and the rivers that flow into the bay. Although there seems to always be a good ground swell running directly onto the shore, the waters of San Juan River, Gordon River and Haird Creek provide hours of scenic and serene paddling.\r\n\r\nBotanical Beach and the West Coast Trail sometimes overshadow Mile Beach, but this is a superb place to stop for a picnic, a day, or a week--and you can't beat the price of accommodations.There is GPS data attached to this trail (see \"download GPS\"), which if loaded into your GPS can help you find route points.",
    "directions": "Sooke Highway to Port Renfrew; turn right at bridge.\r",
    "geohash": "c0xs",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/763/narrow_mile401.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/763/narrow_mile406.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/763/narrow_mile407.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/763/narrow_mile411.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/763/narrow_mile414.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mile-beach-to-wct-trailhead-near-victoria-bc-763",
    "stats": {
        "Activities": "river-kayak river-canoe sea-kayak hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "4 km",
        "Town": "Victoria, BC",
        "Type": "out-and-back"
    },
    "title": "Mile Beach to WCT trailhead",
    "trail_id": "763"
}