{
    "description": "NTS Map:92F4.  The 1 kilometre Schooner Beach Trail is the northernmost trail in the Pacific Rim National Park Reserve.  The trail takes you through mature cedar-hemlock rainforest, over mossy streams on boardwalks, and down a series of stairs to the secluded beach on Schooner Cove.  At the end of the trail, Box Island is directly across the wide sandy beach, and is accessible at low tides. Schooner Cove is around the headland, immediately to the southwest. Old-growth Sitka spruce forest hugs the shoreline; a stark contrast to the bleached white sands of the beach. \r\n\r\nFrom Schooner Bay, you can walk to Half Moon Bay, almost 19 kilometres to the west. Walking along the beach you will pass Long Beach, Combers Beach, Wickaninnish Beach, and Florencia Bay. \r\n\r\nThe GPS data file has waypoints for: the west end of Schooner Cove (SCVWST), Bix Island (BOXISL), the trail parking lot (PRKNG), the beach end of the trail (SCTHD), three picnic areas, Green Point and Campground (GRPNT and GPCAMP). \r\n There is GPS data attached to this trail (see \"download GPS\"), which if loaded into your GPS can help you find route points.\r",
    "directions": "Highway 4 between Tofino and the Ucluelet-Tofino-Port Alberni road junction. The trailhead is located north of Long Beach and the Green Point Campground.\r",
    "geohash": null,
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/765/narrow_schooner80.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/765/narrow_schooner83.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/765/narrow_schooner87.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/765/narrow_schooner89.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/765/narrow_schooner94.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/schooner-cove-pacrim-near-tofino-bc-765",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 5,
        "Time": "4 hrs",
        "Total Distance": "8 km",
        "Town": "Tofino, BC",
        "Type": "out-and-back"
    },
    "title": "Schooner Cove - PACRIM",
    "trail_id": "765"
}