{
    "description": "NTS Map:92C8.  Located at kilometer 37.6 of the Juan de Fuca Marine Trail, Parkinson Creek trailhead provides access to a 10 kilometre 4 to 6 hour hike west to Botanical Beach or a 9 kilometre 4 to 5 hour hike east to Sombrio Beach. This is a moderate to difficult section of the Juan de Fuca Marine trail, leading through mature forest, and along sections of sand beach and rocky shoreline. Campsites are located at Payzant Creek  at kilometer 40 and at Little Kuitsche Creek at kilometer 33.5.\r\n\r\nThe seal grotto and caves along the shoreline of the Juan de Fuca Straight at Parkinson Creek are described in \"Giant Cedars, White Sands\" as being a 10-minute walk from the trailhead parking lot. After crashing through dense brush for 20 minutes along what could be called a trail, we came to a high bluff over looking the ocean; a nice spot but no seals. \r\n\r\nThe road to the parking lot is a gravel/rock/pothole combination that lures you into a series of steep, winding and quite scary downhill turns; a lovely road that is best suited to tanks and four wheel drive vehicles.\r\n\r\n There is GPS data attached to this trail (see \"download GPS\"), which if loaded into your GPS can help you find route points.",
    "directions": "Highway 14 towards Port Renfrew from Sooke; south onto gravel road at 10U 399352E 5377275N.\r",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/767/narrow_pic0437.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/767/narrow_pic0440.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/767/narrow_pic0441.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/767/narrow_pic0461.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/767/narrow_pic0464.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/parkinson-creek-near-victoria-bc-767",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring summer",
        "Stars": 1,
        "Time": "3 hrs",
        "Total Distance": "2 km",
        "Town": "Victoria, BC",
        "Type": "out-and-back"
    },
    "title": "Parkinson Creek",
    "trail_id": "767"
}