{
    "description": "Savary Island has the \"Hawaii of BC\" moniker, and indeed, beaches are sandy, waters are warmer, but be warned; there are no public toilets on Savary, and there is limited camping owing to beach house community at each end.  Savary Island is an easy 45 minute paddle out of Lund B.C., which is just a 30 minute drive north of Powell River.  Lund is also the launching point for the Copeland Islands, and Desolation Sound (as is Okeover inlet).  Powell River Sea Kayaking will rent you doubles and singles for either launch point.A good reason to go to Savary is to see the sandiest beaches in the region, since nearby Desolation Sound has great kayaking and a marine park setting but is otherwise very rocky. Savary Island's south beaches are renowned, and most of the Island is ringed with white sandy beaches and very shallow (warmish) water. Combined with the canceling tidal action of this region, ocean water is warmer than one would expect -- no wetsuit needed for swimming.  And Savary itself is an easy paddle.  However it is also 50% ringed with housing and beach homes, leaving only a few \"uninhabited\" stretches ideal for camping; we found one stretch, but there are others. It's pretty easy to camp--no one will hassle you. Our camp spot is marked in the attached GPS data (002), and the pictures are mostly of our camp spot.  At high tide, on this shore, we had only several feet of safety!  But at low tide, 40 feet of beach, and another 200 or more of tidal flats ideal for clam and mussel collecting.  These same flats can make landing at low-tide an issue.  If you don't time it right you may have a long walk with your kayak up to the high-tide mark. My back still hurts. Check the tides.Savary is a long and narrow island that runs more east/west than north/south.  We camped on the northerly shore, west of the government docks, past 'second point' and close to the fire hall or Indian Springs area (see attached waypoints).  We didn't have enough daylight to reach the famed south shore -- so this was our beach. The whole island is only 5 miles long, so one can circumnavigate Savary on a long day trip. But a more relaxed pace would include an evening on a local Savary beach coupled with a visit to the nearby Copeland islands, just minutes from Lund. Beware the heavy boat traffic out of Lund.On a long weekend, we found most visitors to Savary were likely residents or visitors who took the short water taxi from Lund or ferried themselves over in little power boats.  As a result, the lee-side ends of the island are crowded with anchored power boats.  Another vote for the south side. Lund is a picturesque burg with in-town camping, marina, kayak rental, and a great cafe on the water called 'Starboard cafe', which is reasonably priced with awesome seafood.  The campground we stayed at, SunLund by the Sea (604-483-9220), is $15 a night, and our spot was a 50 yard dash to the Marina and the cafe, where a fine meal was had at a funky dockside restaurant.  A Neil Young song wafted out from the kitchen area -- you get the sense this is a relaxed place. Owing to the unique geography, there are plant species here that are only found on tropical islands. Warm is relative, so keep that in mind--it's still B.C.WAYPOINTS:001 - Government docks on Savary002 - beach camping, North shore003- return point, LundThere is GPS data attached to this trail (see \"download GPS\"), which if loaded into your GPS can help you find route points.",
    "directions": "Take the Horseshoe Bay to Langdale Ferry, and drive to the next Ferry at Saltery Bay.  Then drive north to Powell River and another 30 km or so to Lund.  Rent kayaks and launch from Lund.  It was $45 for a 2-sailing ferry (i.e. to get to Lund) and another $45 to get back to Vancouver.  On a long-weekend, showing up at reasonable times, we didn't have any ferry waits, but the ferries were all running late.  So plan on a day to get there, possibly launching in the early evening or next day.Paddling out of Lund, kayak south until you are directly opposite the nearest point on Savary, and then make a beeline across, being very careful with local boating traffic.  You'll spot the Government docks just up island, and if you dock nearby, there is even a general store 10 minutes up the road.  Savary Islanders will remind you that there are no public washrooms (the General Store may be kind enough), and certainly no fires are permitted on the beaches in summer. Early mornings are best for crossings.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/773/reg_camp2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/773/reg_camp3.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/773/reg_day.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/773/reg_map.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/773/reg_sunset.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/773/topo_beachcamp_best1_.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/savary-island-near-powell-river-bc-773",
    "stats": {
        "Activities": "sea-kayak",
        "From": "",
        "Seasons": "summer",
        "Stars": 3,
        "Time": "7 hrs",
        "Total Distance": "15 km",
        "Town": "Powell River, BC",
        "Type": "out-and-back"
    },
    "title": "Savary Island",
    "trail_id": "773"
}