{
    "description": "The section of track from the Summerland south to Trout Creek has been recreated and has a replica KVR passenger train that runs in the summer months. Past Trout Creek the KVR trail runs on top of clay cliffs overlooking Okanagan Lake, before dipping down into the city of Penticton. Leaving Vancouver Place (at the northeast edge of Penticton) toward Naramata expect to pass over Andrew McCulloch trestle with some beautiful views of the Okanagan Valley. Between these two communities there are nine little wineries and vineyards to take in along the way.Bike shop and rentals at: Freedom Bike Shop in Penticton.Accomodations: Summerland Resort (10 minutes north of Penticton) on the lake.",
    "directions": "Penticton can be used as a hub to access three direction of the Kettle Valley Rail trail. To get to Summerland from Penticton using this trail, park on Green Mountain Road west of Highway 97 just after crossing the Okanagan River Channel. Follow the Channel Pathway north to where this trail transects the KVR. An old bridge over the channel, which is now removed, makes this location quite distinct. At this point turn west which will take you to Summerland. Traveling south will take you to Kaleden.While in Pentiction, to travel to Naramata via the KVR trail, turn onto Westminster Ave off Highway 97 and continue through town up Vancouver Ave and turn left onto Vancouver Place. Starting your hike from Naramata the best place to park your vehicle is at the junction of Smethurst Road and the KVR off Naramata Road.",
    "photos": [],
    "source_url": "https://trailpeak.com/trails/kettle-valley-railway-penticton-near-penticton-bc-778",
    "stats": {
        "Activities": "hike mtn-bike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 1,
        "Time": "5 hrs",
        "Total Distance": "40 km",
        "Town": "Penticton, BC",
        "Type": "out-and-back"
    },
    "title": "Kettle Valley Railway - Penticton",
    "trail_id": "778"
}