{
    "description": "Steep ! Steep !  Steep !  Did I mention that the Williamson Ridge hike is steep?  This trail is a real pipe-opener.  You will gain 1400m in a very short distance.  The average grade of this hike is 26.1% keeping in mind that once on the ridge there are many flat spots, thus bringing down the average.  The great news is that you feel very accomplished when you get up there and the views are beautiful.  The trail is well marked on the way up, but pay closer attention once on the ridge. The trip down seems to take the wind out of your sails as the steep trail is murder on the knees.  Just keep telling yourself \"Hiking is fun\"",
    "directions": "Traveling east on Hwy 1, take exit 119A (Sardis, Cultus Lake). Drive south through Sardis and Vedder Crossing to the bridge over the river which is known as Chilliwack River up stream and Vedder River down stream.  Turn left and zero your odometer here.  This is Chilliwack Lake Road.  Drive east for 34km.  Pass the Centre Creek corrections facility on your right and 500m further on your left is the trailhead. A number of old trails and logging roads start from the same point so pay attention at first in following the orange markers, especially at a point about 90m into the bush where the trail forks left from the logging road and into the trees.  Remember, when you reach the top of the ridge to turn right to continue this hike.  Enjoy!!",
    "geohash": "c29x",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/780/reg_WR2-11395.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/780/reg_stream-11395.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/780/narrow_WR-11395.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/780/narrow_WR3-11395.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/780/narrow_summit-11395.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/williams-ridge-near-chilliwack-bc-780",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 4,
        "Time": "8 hrs",
        "Total Distance": "11 km",
        "Town": "Chilliwack, BC",
        "Type": "out-and-back"
    },
    "title": "Williams Ridge",
    "trail_id": "780"
}