{
    "description": "This is definitely the heart of Garibaldi Provincial Park. The forces of both glaciation and volcanism have shaped the landscape here forming scenes of incredible diversity and beauty. You can enjoy it all within a small area: big trees, big glaciers, and ?look-at-that\" views of Black Tusk, Helm Glacier, the Sphinx, Panorama Ridge, Sentinel and Sphinx Glacier, as well as down on the turquoise glacial waters of Garibaldi Lake. \r\nYou'll wander through expansive alpine meadows, and cross the volcanic landscape of cinder flats. The beauty is raw, but it's easily accessible, and the trails are well-maintained. Try to make it a mid-week trip; even then, you probably won't be on your own.",
    "directions": "You can start this hike from either direction: To do Helm Creek ? Cinder Flats ? Taylor Meadows, park at the Cheakamus Lake parking lot.  Drive Hwy 99 north towards Whistler, and about 10 km after the Brandywine Falls Provincial Park, turn east off the highway onto a logging road. Stay right at the beginning, and after about 0.5 km turn left onto dirt and go for another 7 km to the Cheakamus Lake trailhead. To hike the other direction, drive to the Rubble Creek parking lot which you reach by going north on Hwy 99 and following the signs to Garibaldi / Black Tusk. Hike up the 9 km (3500ft elevation gain) to the Taylor Meadows campsite. The Helm Creek Trail is very well marked from either approach, so there's no chance that you'll miss it.\r\nThe whole trip, from either parking lot, is about 25 km, whereas the section in between the two campsites is about 10 km long. NTS Map: 92J3. \r",
    "geohash": "c2b",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/784/long_Helm-Creek-2015-010-14798.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/784/long_Helm-Creek-2015-013-14798.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/784/long_Helm-Creek-2015-015-14798.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/784/long_Helm-Creek-2015-020-14798.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/784/long_Helm-Creek-2015-023-14798.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/784/long_Helm-Creek-2015-024-14798.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/784/reg_reg_DSCF0024.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/784/topo_reg_DSCF0034.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/784/narrow_Helm-Creek-2015-011-14798.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/taylor-meadows-cinder-flats-helm-creek-near-squamish-bc-784",
    "stats": {
        "Activities": "snowshoe hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 5,
        "Time": "8 hrs",
        "Total Distance": "25 km",
        "Town": "Squamish, BC",
        "Type": "out-and-back"
    },
    "title": "Taylor Meadows - Cinder Flats - Helm Creek",
    "trail_id": "784"
}