{
    "description": "You have to hand it to Washington State trails. We hiked in comfort along an extremely well maintained trail (with one notable exception) almost all the way to the Ruth glacier. An alder and brush free zone ran for 5 feet on either side of the trail and we had superb views of Nooksack Ridge, Ruth Mountain, waterfalls & wildflowers almost every step of the way. The trail follows the Ruth Creek valley all the way to Hannegan Pass, gaining elevation gradually, mostly after the first 2 miles with only 2 or 3 switchbacks. There is no shortage of campsites near the Pass, some with spectacular 360 degree views of Mount Shuksan and of the Border Peaks, Larrabee, Tomyhoi, Slesse, Challenger and many other peaks.",
    "directions": "Take I-5 to Bellingham then head east on WA 542/Mount Baker Highway for close to an hour. Once past the town of Glacier, by about 13 miles, take a left onto the Nooksack River Road 32. This is a dirt road just before the Nooksack River Bridge. If you find yourself driving with the Nooksack River on your left, or if you arrive at the Mt. Baker ski area, you've gone too far. Drive up the Nooksack River Road and at about a mile and a half take the uphill branch (FR 402) to the left. Proceed for about four miles to the end where there is a large parking lot with restrooms and a campground. Here you will find the Hennegan Pass trailhead.",
    "geohash": null,
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/WA/785/reg_16.jpg",
        "https://trailpeak.com/storage//content/trails/US/WA/785/reg_20.jpg",
        "https://trailpeak.com/storage//content/trails/US/WA/785/reg_23.jpg",
        "https://trailpeak.com/storage//content/trails/US/WA/785/reg_24.jpg",
        "https://trailpeak.com/storage//content/trails/US/WA/785/narrow_1.jpg",
        "https://trailpeak.com/storage//content/trails/US/WA/785/narrow_22.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/hannegan-pass-wa-near-maple-falls-wa-785",
    "stats": {
        "Activities": "climb snowshoe hike ski-xc",
        "From": "",
        "Seasons": "winter summer",
        "Stars": 4,
        "Time": "7 hrs",
        "Total Distance": "13 km",
        "Town": "Maple Falls, WA",
        "Type": "out-and-back"
    },
    "title": "Hannegan Pass (WA)",
    "trail_id": "785"
}