{
    "description": "Harper Mountain is one of the best rides in the Kamloops area.  Wow! This is the best up to date all-condition single and double track trail network around.  From 2 footers to 15 footers, this area has so much variety and different ride types, you will be blown away. But please don't ride these stunts if you are not a hard-core rider. This area also offers some great fast downhill rips. You can ride this area all day. Be aware of wild life and other fellow riders driving up the road as the trail does cross the road. Keep your head up. From the top to bottom, this is about a 1-hour downhill experience. We have found about 4 main trails with a 1/2 a dozen spurs. This area rocks over Sun Peaks and Rosehill. There will be a lot of local riders in the area. Ask for directions at first.  Yes! you can get lost. Better yet, visit Kamloopsbikecamp for a guided experience. These guys meet at Full Boar Bike Shop, and run regular clinics at Harper and know all the trail areas such as Rose Hill and Razorback. Be wise or otherwise.",
    "directions": "After 20 minutes on the Paul Lake road you will come to the first fork on the road--take the Paul Lake road (right turn). The left is Mt. Lolo. At the second fork, again turn right.  This will take you to the west side of the lake. There is a parking area, where you can park and leave your pick up vehicle (in other words--this is a shuttle). Continue to head up the road, keeping right at the third fork. You will be on a gravel road at this time. Follow this road for about 4 to 5 kms until you pass a paintball staging area. On top of the hill you will come to a road to your right once again. Turn off the road and follow the power-line until you come to the only road turning left. Follow this road.  You will see the bike trail crossing this road a few times.  You will also see a series of drops, stunts and bridges. The road will end and you can start riding from there.  Or you can get in on a tour by Kamloopsbikecamp .  Call Mark or Chuck to see when they are going next--it's one of their favs, and they head out from Full Boar Bike Shop in Kamloops.",
    "geohash": "c348",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/786/reg_IMG-1482-51538.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/786/reg_air1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/786/reg_airramp.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/786/reg_ramp700.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/786/topo_spiral.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/786/narrow_air2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/786/narrow_rockface_best1_.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mt-harper-kamloops-near-kamloops-bc-786",
    "stats": {
        "Activities": "mtn-bike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 5,
        "Time": "4 hrs",
        "Total Distance": "5 km",
        "Town": "Kamloops, BC",
        "Type": "out-and-back"
    },
    "title": "Mt. Harper - Kamloops",
    "trail_id": "786"
}