{
    "description": "The boulder-strewn gorge at the end of the forest trail has been dubbed \"gates of Shangri-la\" for a reason. After a short (3 km), steep (300m), marked trail through a berry-rich forest you find yourself at a wilderness campsite with a rustic cabin a few minutes beyond. This is merely base camp for some of the most spectacular ramble-ground in the coastals. The marked trail ends at the cabin and good route-finding skills (map and compass) are recommended despite the well-defined footpaths leading away. The paths are many and sprawl, spider-like, across the area, and are often lost under great boulder fields. But you are now in the alpine, and the gentle ridges and wide meadows are yours to explore. There is something for everyone; amazing wildflowers (late bloom - August/sept); fascinating rocks and rock formations; glaciers; and (my favourite) magnificent lakes and tarns! The path to Tundra, the most stunning of the lakes, lies beyond two ridges and is a solid 20 km (round) day-trip from the cabin. Only those with an aversion to unmarked paths and boulder-hopping should stay away... otherwise... welcome to Shangri-la.",
    "directions": "Heading north from Whistler follow the signs to Pemberton until you reach the junction just before town; continue on #99 toward Mt. Currie/Lillooet. After Mt. Currie you will see Lillooet Lake on your right, just as the highway turns sharply uphill and away from the lake there will be a wide dirt road leading straight ahead along the lakeshore (on maps marked \"in-shuck-ch FSR). You should see a sign for Lillooet Lake Lodge and a warning about no gas stations. It is a good dirt road and no problem for 2wd vehicles AT THIS POINT. Follow the road to the 16 km sign post, and just after a sign for Lizzie Bay recreation site you will cross a small bridge.  Right away on your right is another dirt road heading away from the lake. The sign says \"4wd only\", but a hardy 2wd will make it most of the way up. The road has loose rock in places, and several run-off ditches cutting across it, but my Festiva made it 8 of the 11 km and parked beside a Subaru and an Accord. It really depends on how long you plan to own your car. The first fork involves a steep, rarely-used road hooking up and to the left.  Stay on the more obvious right track. After the 8 km mark, the road becomes steep and loose--a 2wd would truly struggle. About 200m after a widening in the road, where 3 cars can conveniently bail out, there is another fork.  This time stay left.  3 km later you will reach the parking lot/trailhead and Lizzie Lake. The trail is well-blazed right up to the cabin.",
    "geohash": "c2bv",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/787/reg_shieldovermeadow.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/787/reg_tarn.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/787/topo_arrowhead.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/lizzie-laketundra-lake-near-pemberton-bc-787",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 5,
        "Time": "21 hrs",
        "Total Distance": "26 km",
        "Town": "Pemberton, BC",
        "Type": "out-and-back"
    },
    "title": "Lizzie Lake/Tundra Lake",
    "trail_id": "787"
}