{
    "description": "This is a hike full of views and amazing scenery! The views begin before you even get to the trailhead, but they grow even more spectacular after you've laced up your boots and hit the trail. Start at the 'Bagley Lake' parking lot-this is where the 'Wild Goose' trailhead is also located. The trail first contours along Bagley Lakes before it ascends in long, sweeping switchbacks to the saddle of Mt. Herman (5,400 feet). To reach the saddle, you'll gain approx. 1,100 feet elevation and you'll have gorgeous views all along the trail. Once you reach this rocky pass, the views are tough to top anywhere else in the Cascades: high jagged peaks of Mt. Shuksan (east), snow covered Mt. Baker to the west, and looking down, you'll see the turquoise glacial water of Iceberg Lake. Iceberg Lake, at 4,800 feet, is the largest of the four lakes in that valley. In heavy snow years the lake may not thaw completely, and you may see icebergs floating on it. As you descend towards the lakes, you'll pass beautiful alpine flowers and pristine water streams. Please, obey all signs and stay on the trail only, since this is a very fragile ecosystem. Camping spots are limited and allowed only in designated sites: Four of them are located at Hayes Lake.  Mazama Lake can accommodate another four tents. These sites also have pit toilets. Having passed Mazama Lake, you'll start climbing again, crossing several talus slopes (very easy), and have more 'look-at-those-views' of Mt. Baker, Table Mountain, moraines, extensive valleys and the surrounding peaks and ridges. Pass the Ptarmigan Ridge Trail junction, as the trail contours along the south side of Table Mountain. Below are more meadows, moraines, and in late summer, lingering snow patches. About 2 km from this junction, pass the 'Mt. Baker Wilderness' sign. Soon, you'll reach Artist Point parking area, from which you can do a short 2.5 km scramble up to Table Mountain (if you feel like it). Walk along the road for about 100m, and branch off to your left to pick up the trail again. Look for the cairns with the 'goose' sign.",
    "directions": "The access is easy, and all on paved road. From Vancouver, go east on Hwy 1, and cross the Canada/US-border at Sumas. Follow Hwy 542 (Mt. Baker Hwy.) past the ski area. It's an amazingly scenic drive. Park at the \"Bagley Lakes Parking\" lot--also the \"Wild Goose Trail\" starts here. Before you start, get a parking pass ($5 US per day per vehicle, or $30 US for a transferable yearly pass). Passes can be bought at the Ranger Station at Mt. Baker Hwy, or at the Heather Visitor Centre. The hike is almost completely in the open, so bringing a hat and lots of sunscreen is very helpful. Also, we were surprised (pleasantly), with how few bugs we had to fight. Then again, it was an early September visit. Very nice!!",
    "geohash": "c29m",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/WA/792/reg_DSCN6269-9505.jpg",
        "https://trailpeak.com/storage//content/trails/US/WA/792/reg_mtbaker.jpg",
        "https://trailpeak.com/storage//content/trails/US/WA/792/reg_tablemtnglowing.jpg",
        "https://trailpeak.com/storage//content/trails/US/WA/792/reg_volcanic.jpg",
        "https://trailpeak.com/storage//content/trails/US/WA/792/topo_MtShuksanhikein_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/US/WA/792/narrow_campreduced.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/chain-lakes-loop-mt-baker-near-maple-falls-wa-792",
    "stats": {
        "Activities": "snowshoe hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 5,
        "Time": "4 hrs",
        "Total Distance": "11 km",
        "Town": "Maple Falls, WA",
        "Type": "out-and-back"
    },
    "title": "Chain Lakes Loop - Mt. Baker",
    "trail_id": "792"
}