{
    "description": "NTS Map: 092G07\nThe Seymour bike trail network has all of the classic rides that the North Shore has become known for.  Together with the rides on Grouse Mountain, these rides are very popular with North Shore riders.  At this time, we are providing a description of the basic trail network, and some of the popular trails.  Most trails are reachable from the lower parking lot just off Mount Seymour road, at the turn-off to the Northlands golf course.  This area is just North of the Mall at the intersection of Mount Seymour Parkway.  The UTM co-ordinate given above marks the parking lot. It is usually busy with riders getting ready to take the OLD BUCK trail up to the other trails, or, riders who are preparing to shuttle to the upper parking lot.  For those just beginning to tackle the North Shore, we recommend Bridle Path, and then exploring some of the lower trails, such as \"Will's way\", dumping you out on Hyannis Drive for the pavement ride back to your car, or, just take Bridle path back.  Once you are comfortable with that, we recommend Ned's Atomic Dustbin, or, Severed Dick.  Both are plenty of fun and are good for building North Shore skills.  Not too many ladders and tricks, just steep at times, and, lots of natural obstacles.  Access to Ned's is via the upper parking lot, or by riding up Old Buck, riding past the turn-off to Severed Dick.   Instead of turning off to follow Baden-Powell (and Severed), you continue on past the intersection of the power line jeep road, scrambling up a rocky trail until you get to the old mushroom parking lot.  The trail starts with a sign that is still marked, \"trail ends here\".  If accessing from the upper parking lot, ride back to the entrance of the parking lot, cross the highway, and, travel to the right until you enter an access trail just before the concrete barrier.  That will lead you directly to the start of the trail.  Always lots of riders up there, either use our GPS co-ordinates, or, ask another rider.  For Severed Dick, ride up OLD BUCK and turn left onto Baden-Powell as you would for Ned's, however instead of following on to cross the power lines, look for where the Baden-Powell turns left (marked by a silver plate with trail-name describing the lower Seymour trails - see pic below), and, ride that for a few hundred meters until you get to a fork in the trail where the Baden-Powell goes right, you go left (a plate marked good Samaritan trail is there).  Follow left onto ?dick? until it dumps you out on Bridle Path, where you can return to the lower parking lot, or, dabble in some of the lower trails.In time, we'll break each of the trails out into a separate description with particular instructions but there are lots of other riders to talk to and get directions.  Rides like corkscrew, Team Pangor, Boogeymen and others are favourites. CBC is a new trail that is quite muddy off-season so consider other trails. Please stay on the trails, and please be considerate to Hikers and other riders.  Have fun. \nTrail descriptions for Mount Seymour mountain biking trails can be found here\nDirections from Vancouver:Take 2nd narrows bridge to North Van, Shortly after crossing, look for signs to Mt. Seymour Parkway, on the right, Follow along Mt. Seymour Parkway, approx 5km, looking for Mt. Seymour Road (takes you up to the ski hill if you were to take it all the way). There is a mall - Northhlands mall, at the intersection,Just under a kilometer up Mt. Seymour Road, look for a turnoff on the left for \"Northlands Golf Course\".On the immediate right, is the parking lot, probably full of riders.For shuttlers, leave one car here and take the other up to the upper parking lots (above Neds), or further, abive CBC!",
    "directions": "See description and / or GPS",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/8/3D_FinalSymr.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/8/long_PIC3.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/8/reg_best1_SeveredTH.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/8/reg_roadmap.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/8/topo_topo_topofinal.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mt-seymour-a-mountain-biking-overview-near-north-vancouver-bc-8",
    "stats": {
        "Activities": "mtn-bike",
        "From": "",
        "Seasons": "fall summer",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "30 km",
        "Town": "North Vancouver, BC",
        "Type": "out-and-back"
    },
    "title": "Mt. Seymour - A Mountain Biking Overview",
    "trail_id": "8"
}