{
    "description": "Diez Vistas trail is aptly named - it boasts 10 beautiful viewpoints. An excellent day trip from Vancouver, you can hike the 15km-route all the way around Buntzen Lake or simply hike to the first few peaks.\nThe RewardOnce you reach the high point, the trail meanders along the ridge with sensational views of the city and Vancouver Island in the distance, Deep Cove, the snow-covered North Shore mountains, and various views up Indian Arm. \nMap: NTS Map 92G7 \nDescription: The first bit is uphill... to get you nicely warmed up. After awhile, heading left at the fork (marked Diez Vistas Trail, you'll soon cross an open power-line (2.25 kilometres), then duck under the old pipeline and continue.There are a number of switchbacks to the high-point of 560 metres. The trail forks right before the first viewpoint (it's quite steep) but joins again farther up - it's worth trying both routes for different but spectacular views. Lots of people just go to the first viewpoint and return,but if you continue the views just get better, so persevere, you have done most of the uphill.\nThe trail meanders along the ridge with sensational views of the city and Vancouver Island in the distance. Deep Cove, the snow-covered North Shore mountains, and various views up Indian Arm splendid on a clear day.  Continue downhill to open bluffs and lake views meeting with an old BC Hydro access road. This takes you back to the north side of Buntzen Lake via a neat suspension bridge. \nAt the lake have a snack and lay in the sun at the picnic area before continuing on.  You can get back to the parking lot at the south end of the lake by taking the trail on either the east or west side of the lake (4 kilometres). The terrain is a bit more rugged on the west side. Unless it's  been a cold winter, there's very seldom snow up top, making it a great year-round trail. If you like rugged trail running, this is a great trail!\nThe attached GPS data (click on \"download/GPS\" above to see a plot) names the peaks, and is a very complete track.  Download that into your GPS and use it to find and stay on the trail.\nDirections\nHead east through Port Moody/Coquitlam either from Highway 7a (from the Trans Canada) or from the Barnet Highway from Hastings Street and turn left onto Ioco Drive. Follow Ico Drive around the north shore of Burrard Inlet and follow the signs for Anmore  and Buntzen Lake. Once at the parking lot, park near the southwest corner. Take the wide graded trail south through the forest. Cross the floating bridge over the south end of Buntzen Lake, and cross the gravel road to start the trail proper.  Or download our waypoints by clicking on \"Download GPS\" above and find the trail using your GPS.\nMore\nIf you like rugged trail running, this is a great trail!  One can complete the circuit in about 3 1/2 hours (medium speed!). Unless it's a cold winter, there's very seldom snow up top, making it a great year round trail.\nNote if you click on 'download GPS' above, you will see the GPS points for the beginning part of this trail, and, you can download this into your GPS unit to get started and find the trail, even though you can do just fine with the above directions.Elevation Gain\t440 MetresHigh Point\t\t560 metresMap Federal Topographic 1:50.000 Port Coquitlam 92G/ 7",
    "directions": "See description and / or GPS",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/80/long_P1050908-32833.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/80/long_PANO-20120729-144855-32833.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/80/reg_DSCF1818-31731.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/80/reg_DSCF1820-31731.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/80/reg_DSCF1822-31731.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/80/reg_DSCF1823-31731.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/80/reg_IMG-6353-32170.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/80/reg_IMG-6356-32170.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/80/reg_best1_reg_best1_diez_016.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/80/reg_diez_001.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/80/reg_diez_010.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/80/reg_diez_019.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/80/reg_diez_022.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/80/reg_diez_023.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/80/narrow_DSCF1817-31731.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/80/narrow_IMG-1383-40535.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/80/narrow_mapnew.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/80/narrow_n515132084-1916310-4766623-20919.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/80/narrow_n515132084-1916317-6342386-20919.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/buntzen-lake-diez-vistas-near-vancouver-bc-80",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 4,
        "Time": "5 hrs",
        "Total Distance": "15 km",
        "Town": "Vancouver, BC",
        "Type": "out-and-back"
    },
    "title": "Buntzen Lake Diez Vistas",
    "trail_id": "80"
}