{
    "description": "This section of the KVR (Trans Canada Trail) goes around orchards and follows city streets and paved pathways through Penticton.  It then crosses the Okanagan River before beginning its climb up the sage-covered clay cliffs overlooking Okanagan Lake on the way to Summerland.  Just before it reaches Trout Creek you can take a diversion from it to tour the botanical gardens at the Pacific Agri-Food Research Centre (formerly the Federal Summerland Research Station), including the new xeriscape demonstration garden (gardening with minimal or no watering).  Have your picnic on the lawns after you inspect the gardens.  Here, the trail crosses Trout Creek over the highest steel trestle bridge of its type in North America, before entering West Summerland Station.  From the Trout Creek Trestle to Faulder Station is the only section with train tracks remaining.  The Kettle Valley Steam Train carries visitors along the route from the Research Station through Summerland and then Prairie Valley.  The route then follows Trout Creek up a steady incline through the historic stations of Faulder, Crump, Kirton and Demuth to Thirsk.  Here a chain of little lakes, Thirsk, Osprey, Link and Chain, feature BC Forest Service recreation sites and good fishing.  From Osprey Station through Jellicoe, Erris, Jura and Belfort the route is downhill again into Princeton.Bike shop and rentals at: Freedom Bike Shop in Penticton.Accomodations: Summerland Resort (10 minutes north of Penticton) on the lake.",
    "directions": "Penticton can be used as a hub to access three directions of the Kettle Valley Rail trail.  To get to Summerland from Penticton using this trail, park on Green Mountain Road west of Highway 97 just after crossing the Okanagan River Channel.  Follow the Channel Pathway north to where this trail transects the KVR.  An old bridge over the channel, which is now removed, makes this location quite distinct.",
    "geohash": "c2ff",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/811/reg_PacificAgriFood_VirusOrchard.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/kettle-valley-railway-penticton-near-penticton-bc-811",
    "stats": {
        "Activities": "hike mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 5,
        "Time": "5 hrs",
        "Total Distance": "18 km",
        "Town": "Penticton, BC",
        "Type": "out-and-back"
    },
    "title": "Kettle Valley Railway - Penticton",
    "trail_id": "811"
}