{
    "description": "The Kettle Valley Railway right-of-way has become a favourite travel route because of its easy grades and spectacular scenery.  The rock ovens, two tunnels and the cool oasis of Chute Lake Resort are highlights of this trail loop. Rock Oven Park contains several interesting features of historical significance. The rock ovens were constructed along the Kettle Valley right-of-way above Naramata, built between 1911 and 1915.  To locate them, watch for a wide spot in the grade just before it enters a rock cut.  You can follow a fairly well-used trail up the hillside to a fine specimen of the rock ovens that once served the railway construction crews.  One of the most spectacular viewpoints is at the mouth of Little Tunnel.  Below to the south, the scattered ponderosa pine and bunchgrass gives way to the neatly manicured orchards of Naramata and then the beaches and cityscape of Penticton.  Skaha Lake disappears around the bend on the horizon.The 489 metre long Adra Tunnel carves a curve within the mountain and a weak spot in the roof near the mid-point is slowly caving in.  The tunnel is barricaded and a hiking/biking trail bypasses it.Excerpts quoted from Okanagan Trips & Trails, A Guide to Backroads and Hiking Trails in BCs Okanagan-Similkameen Region.  Bike shop and rentals at: Freedom Bike Shop in Penticton.Accomodations: Summerland Resort (10 minutes north of Penticton) on the lake.",
    "directions": "Travel to Penticton via Highway 97, turn east onto Westminster Avenue and follow this road through to Naramata.  There are many access points for this section of the trail.  The best place to connect with the Kettle Valley Rail in this area is at Smethurst Road located east off Naramata Road, just past the main turnoff down to Naramata.  A second access point is at Arawana Road also located east of Naramata Road.  An access point further down the line is located where the KVR transects Chute Lake Road at the three km mark.",
    "geohash": "c2f",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/812/reg_erris2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/812/reg_image004.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/812/reg_image010.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/812/reg_image014.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/812/narrow_image002.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/kettle-valley-railway-naramata-near-penticton-bc-812",
    "stats": {
        "Activities": "hike ski-xc mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 5,
        "Time": "4 hrs",
        "Total Distance": "60 km",
        "Town": "Penticton, BC",
        "Type": "out-and-back"
    },
    "title": "Kettle Valley Railway - Naramata",
    "trail_id": "812"
}