{
    "description": "NTS Map: 082J15This is a loop ride on Fire Road (outward) and singletrack (back). It's number 50 in Doug Eastcott's Backcountry Biking in the Canadian Rockies (waypoints in GPS data correspond to descriptions in the book). Starting at Cobble Flats picnic area, cross the Elbow River and head left on Fire Road. This road climbs gradually up the valley of Quirk Creek. It is on the edge of the McLean Creek off-road area, so there is some motorized traffic. Turn left at the T intersection at 8.7 km. After the bridge at 9.6 km (the second bridge in a row) turn right onto a less evident road at the top of the small hill 9.7 km. From here it is mostly singletrack. The turn around point is the spectacularly and deep Threepoint Canyon. On the way back retrace the trail till the junction at 15.9 km (this is more obvious on the way back). From here there are no real navigational difficulties as you climb on the sweet singletrack of Wildhorse Trail, before descending back to the Elbow river and the starting point. \nFor some reason Quirk Creek Trail is not indicated on the Kananaskis maps that are on Wildhorse trail. \nThere is GPS data attached to this trail (see \"download GPS\"), which if loaded into your GPS can help you find route points.",
    "directions": "Park at the signposted Cobble Flats picnic area off Highway 66 SW of Bragg Creek. Find a suitable place to ford the Elbow River, and turn left.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/814/reg_PICT0585.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/814/reg_PICT0586.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/814/reg_map.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/814/topo_PICT0580.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/814/narrow_P7060322-10796.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/814/narrow_P7060323-10796.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/quirk-creek-wildhorse-trails-near-calgary-ab-814",
    "stats": {
        "Activities": "mtn-bike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 3,
        "Time": "3 hrs",
        "Total Distance": "28 km",
        "Town": "Calgary, AB",
        "Type": "out-and-back"
    },
    "title": "Quirk Creek & Wildhorse Trails",
    "trail_id": "814"
}