{
    "description": "Left Vancouver at 8:00 am and we were 1 km below the trailhead by 10:40. You'll need all-wheel drive or four-wheel drive to get there but the road is good. The last km got a little rougher and had some big sharp looking rocks. Changing a tire on a rough uphill grade did not appeal to me so we parked just below the actual trailhead in an obvious pullout. Started hiking at 11:10. At the actual trailhead there were a couple of SUV's and a Subaru... all with tires intact. \r\n\r\n103 Hikes warns that the trial to the first lake is muddy but after the summer we've had I figured it wouldn't be too bad. BOY did I figure wrong. This trail is truly disgusting. I can't even imagine what it would be like in the spring or fall. Wear gaiters or better yet, HIP WADERS! The trail follows High Falls Creek through a narrow valley & pretty meadows. It?s not a hard trail. The incline is gentle, getting a little steeper in the last kilometre. \r\n\r\nWe were at Cypress lake by 12:30. It was so nice to be on solid ground again. The lake is beautiful and you have views of the surrounding peaks. You could spend a pleasant weekend here, camping at the lake and exploring the surrounding area.\r\n\r\nHike up to the second lake for more views. It?s only another 10 minutes away. We saw a black bear at the second lake before continuing on to the peak. \r\n\r\nAccess to the third lake is a little tricky and requires some scrambling over large loose boulders. Read my \"Tricouni Peak\" trip report in Trailpeak for more details.",
    "directions": "Zero your odometer at the Cleveland Avenue traffic lights in Squamish. Drive north on H highway 99 for 10 km (6.2 mi) and turn left onto Squamish Valley Road. Keep left at the fork at 13 km (8.1 mi). At 33 km (20 mi) the gravel surface starts and you will see that the distance signs on this road, which is called S-Main, are in miles from Squamish. At 38 km (24 mi), about 1.4 km (.09 mi) after High Falls Creek bridge, Branch 200 starts uphill on your right. Zero your odometer again here. At the 2.3 km (1.4 mi) fork, go right. As you lose elevation at 5.1 km (3.2 mi), the High Falls Creek Trail comes in from the right. At the 6.0 km (3.7 mi) fork, go right. Do not go left at 6.5 km (4.0 mi) or 6.8 km (4.2 mi); but do go left at 6.9 km (4.3 mi). If you go too far you will come to the bridge over High Falls Creek in 200m (650 ft). The road has recently been cleared; so at 8.0 km (5.0 mi) swing left onto an older road. High-clearance 2 WDs should drive 1 km (0.6 mi) to just before a creek crossing. A rugged 4 WD may be able to drive to the landing at 10.5 km (6.5 mi). \r\nDirections from 103 Hikes\r",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/817/reg_31.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/817/reg_4.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/817/reg_IMG-0454-12993.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/817/narrow_1.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/817/narrow_2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/817/narrow_7.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/817/narrow_DSC-9185-12993.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/tricouni-meadows-near-squamish-bc-817",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 3,
        "Time": "3 hrs",
        "Total Distance": "14 km",
        "Town": "Squamish, BC",
        "Type": "out-and-back"
    },
    "title": "Tricouni Meadows",
    "trail_id": "817"
}