{
    "description": "A new hiking trail gives easy access to the alpine below the summits of Yak and Nak Peaks. \r\n\r\nFor directions to find the Trail see below.\r\n\r\nAt first, the trail leads down the embankment, crosses a creek which flows here in the middle of a swampy perimeter, and then enters the mature forest. The trail climbs in the trees to the tongue of a talus slope that drops from near the start of the popular 'Yak Crack' rock-climbing route. Cairns along the far (west) side of the scree slope mark the easiest ascent option. Climb to the very top of the talus where a short trail through heather gives access to the very base of the magnificent granite face.\r\n\r\nAs you turn the corner and begin to follow the trench between the wall and the slide alder, watch for climbers overhead who may accidentally dislodge small rocks. The trench holds a stream during run-off or after heavy rain. Short detours bypass the wettest and waterfall-type sections. The trail leads eventually away from the wall, cuts up through some patches of alder, and arrives at the base of a separate small granite slab. This slab can be friction climbed directly when the rock is dry, or else, a swath exists through krummholz to the left of the slab. Above this section, the route follows an obvious draw until it emerges near the foot of a hanging basin. Several large cairns and many ribbons on nearby trees mark this spot. The route becomes sketchy from here on up with the terrain wide open. So don't proceed in whiteout conditions unless you are very confident that you can find the locality again on your descent. It is a classic place where, once off-route going down, you can get into a dangerous situation.\r\n\r\nA few more ribbons continue up through the middle of the slope, touch a corner in the vegetation, then lead toward the broad ridge. From here, it is rambling along the ridge, over a hump, and on to the summit of Nak Peak. There is no trail but the few bushes do not pose much of a problem. To gain the summit of the closer Yak Peak, hikers must be prepared to climb an intervening, permanent snowfield safely. It is only about 40m wide, but steep enough that a short slip can result in serious injury. Scrambling up steep rock on the south side sometimes avoids the snow (This snow field had melted completely during the summer of 2001). A short excursion leads left to the top of the false summit. This is a good place to get a feeling what it is like to climb the face; just don't lean over the edge too far! For the true summit, return to the broad col and ascend near the edge of the trees.\r\n\r\nMuch of the trail is covered by snow well into the summer, making this a spectacular late summer and autumn hike. It is only about two to three hours up from the cars.",
    "directions": "The trail starts not far from the Zopkios Ridge rest area on the Coquihalla Highway. From Vancouver, take the 2nd exit before the tollbooth; proceed through the underpass to the north side of the highway, then straight ahead into the upper lot where there are picnic tables. To find the trail, walk east up the ramp and start counting lampposts as you continue beside a concrete divider. Near the fifth lamppost a large stone cairn marks the beginning of the trail.\r",
    "geohash": "c2cf",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/842/long_11-cornis-c-8084.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/842/long_14-false-summit-c-8084.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/842/reg_100-0245-11335.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/842/reg_100-0247-11335.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/842/reg_DSCF0799-11335.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/842/reg_DSCF0818-11335.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/842/reg_DSCN2553JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/842/reg_Yak.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/842/narrow_7-water-fall-8084.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/yak-and-nak-trail-near-hope-airport-bc-842",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall",
        "Stars": 5,
        "Time": "6 hrs",
        "Total Distance": "0 km",
        "Town": "Hope Airport, BC",
        "Type": "out-and-back"
    },
    "title": "Yak and Nak Trail",
    "trail_id": "842"
}