{
    "description": "This trail has a difficult rating since it takes 3 hours to get to the top and it?s on a logging road so the pitches certainly add to the workload.  The trail isn't marked (yet) but it is pretty easy to see--just follow the clearing for the logging road. Your starting point depends upon your vehicle--if you can get further up the road, you'll be in the snow sooner. \nThe initial part of the trail isn't much to write home about, but persist and you'll get to some great views of Howe sound at about 5,000 feet. The snow gets thicker as you climb and it would be great to bring some skis or a board to come down on. It takes about 1 1/2 hours to get down; much easier than going up. The top on a clear day will give you some great views that are probably not taken advantage of often enough.",
    "directions": "Take Highway 99 north of Vancouver and turn right at the Mamquam Forest Service Road just after the Chief parking lot.  There will be a yellow gate that is open.  Take that road.  If you come to the traffic lights on Hwy 99 you just missed the turn, so turn around. The service road is traveled quite frequently so keep a look out. Stay on the road, as it heads northeast.  At a fork in the road, turn right, going up the mountain beside a power station of some kind. There are markers along the way in miles.  At the 5 mile marker turn right.  The trail is the logging road as it goes up and  turns sharply around a right-hand bend. Like I said, if you have 4WD, you'll start hiking it later than sooner.  But still, you?ll have a good time.",
    "photos": [],
    "source_url": "https://trailpeak.com/trails/mt-alpen-near-squamish-bc-851",
    "stats": {
        "Activities": "snowshoe hike ski-bc ski-xc",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 4,
        "Time": "4 hrs",
        "Total Distance": "20 km",
        "Town": "Squamish, BC",
        "Type": "out-and-back"
    },
    "title": "Mt Alpen",
    "trail_id": "851"
}