{
    "description": "The Stony Swamp is a trail network snaking through the Ottawa Greenbelt.  Most trails are very easy, but you can get a good clip going.  There are so many loops and runs, that it's almost impossible to map them all.  \r\n\r\nThe Stony Swamp Trail Network is located in the Stony Swamp Conservation Area. This network which has the same name of the Area are not the same thing. The Stony Swamp Trail Network is not part of Jack Pine Trail Network (South Loop and Nature Loop/Jack Pine Trail), neither part of the North Loops.  \r\n\r\nThe Stony Swamp Trail Network is located between Moodie Drive, Richmond Road. It can be accessed via P8 and P10 for parking. Also users can enter via 2 access on Richmond Rd. It is possible to park at P6 on Richmond Rd and enter in the Stony Swamp Trail Network.\r\n\r\nThe Stony Swamp Trail network is composed of the Beaver Trail, the Chipmunk Trail. There are no trail indicated on the NCC map but some work need to be done. \r\n\r\nThere is a Historic site called Lime Kiln by close to the parking P10. The trail is called Lime Kiln Trail. Once you are at the Lime Kiln Historic Site, you will see an entrance for a trail which is not shown on any official map of the city, neither of the NCC. The community call this trail Lime Kiln. But it is not the same trail like Lime Link Trail which is on the map. So we need to make a distinction if we do not want to get confuse for those who are visiting and wants to find those trails. Why not calling this trail Lime Kiln Technical since it is a very technical one. This Lime Kiln Technical could be classified in the difficult.  The trail is not shown on the map. This technical trail will connect from the Lime Kiln Historic site to the connection of 2 trails which has no number on the map. Not easy !! Courage. You can enter in this Lime Kiln Technical Trail via the Lime Kiln Trail from P10.\r\nGood Luck and enjoy.\r\n\r",
    "directions": "From Ottawa: 416 South to Huntclub.  Go West on Huntclub for about 2 km, turn in at P10 and you're there! Richmond Rd and Moodie Drive.\r",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/ON/854/reg_P7050260-21856.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/854/reg_P7050283-21856.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/854/reg_feb-10-065-12165.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/854/reg_feb-10-067-12165.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/854/reg_stony1-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/854/reg_stony2-5.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/854/narrow_In-the-woods-21856.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/ON/854/narrow_P7240593-21856.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/stony-swamp-near-ottawa-on-854",
    "stats": {
        "Activities": "ski-xc mtn-bike",
        "From": "",
        "Seasons": "winter fall summer",
        "Stars": 3,
        "Time": "4 hrs",
        "Total Distance": "15 km",
        "Town": "Ottawa, ON",
        "Type": "out-and-back"
    },
    "title": "Stony Swamp",
    "trail_id": "854"
}