{
    "description": "This beautifully scenic hike was a favourite of the gold rush miners of the 1860s, and has continued to be popular amongst the locals ever since. Groundhog Lake, with its impressive views of Mt. Agnes, is a great picnic spot.  Elevation gain is about 650 m.  The trail is fairly well marked and well described in  Hiking the Cariboo Goldfields, by Edwards, Funk and Stoker (excellent book!  Take it along.).  This trail has great historical significance in relation to the 1860s gold rush, and offers incredible vistas of the Bowron Lake area and even the distant Rockies.  The trail is generally well marked, but disappears at times in the meadows.  Weather changes quickly, and it can be very cold on top of Bald Mountain, so plan accordingly.  \r\nIncidentally, the top of Bald Mountain or Groundhog Lake would be great spots to camp.  There is plenty of other camping available right at Barkerville.  There is GPS data attached to this trail (see \"download GPS\") which if loaded into your GPS can help you find route points.",
    "directions": "\r\n\r\n Barkerville  \r\nis situated 80 km east of Quesnel, on the way to Bowron Lake.  The trail starts at the top end of the main street of Barkerville and follows the old Cariboo Waggon Road to Summit Rock (4.5 km).  At this point the trail branches to the left across a meadow and follows an old goldfields ditchline to a deserted cabin (COOPER CBN) at 6.7 km.  Groundhog Lake is reached at 8.4 km, after a bit of a steep stretch up an old road.  The trail continues on the Mt. Agnes Traverse over to the summit of Bald Mountain, and when it disappears in the meadows (LOST TRAIL) you will want to head for ATV TRACK which will lead you to the top of Bald Mountain.  Signage may not indicate your return route, but you take the Powderhouse Trail (PDR SIGN) back to Summit Rock (3.8 km from the summit) and then retrace your steps back to Barkerville.\r",
    "geohash": null,
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/857/reg_GroundhogLake.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/857/reg_baldmountain2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/857/reg_mt.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/857/reg_summitrock2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/857/narrow_map.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/barkerville-to-groundhog-lake-and-bald-mountain-near-quesnel-airport-bc-857",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 5,
        "Time": "7 hrs",
        "Total Distance": "21 km",
        "Town": "Quesnel Airport, BC",
        "Type": "out-and-back"
    },
    "title": "Barkerville to Groundhog Lake and Bald Mountain",
    "trail_id": "857"
}