{
    "description": "Mt. Murray is the prominent mountain visible when looking down the main street of  Barkerville , about 80 km east of Quesnel. Its summit offers impressive views of Barkerville, Wells, Bowron Lake Park and many local well-known peaks. There are two routes to the summit of Mt. Murray, both having a total elevation gain of about 700 m. The route described here goes up the Jubilee trail and descends on the Yellowhawk, both trailheads being very well marked with parking available at both. There is a 2.8 km stretch of the Bowron Lake Road that separates the two trailheads?you could make this a walk, bike or vehicle shuttle at the beginning or the end of the trip. \r\n\r\nThere is GPS data attached to this trail (see \"download GPS\") which if loaded into your GPS can help you find route points.\r",
    "directions": "\r\nTo get to the Jubilee trailhead, turn left off the paved road from Wells to Barkerville just past the Barkerville airstrip, onto the gravel Bowron Lake Road. At about 3.5 km you?ll pass the Yellowhawk trailhead, and at about 6.3 km you?ll arrive at the Jubilee trailhead (MURRAY TH). Park on the shoulder on the south side of the road. This trail, which is described in detail in  Hiking the Cariboo Goldfields, by Edwards, Funk and Stoker (a book well worth taking along), climbs steadily along an old road for the first 2.5 km and then switchbacks through the forest until you reach a sign indicating the end of the marked trail (a definite trail does continue for several hundred yards beyond this point?MKD TR END). From here, simply head to the top. The small tarn just below the summit is swimmable, but the bottom is very gooey. The return trail winds around the south side of Mt. Murray, and descends towards Yellowhawk Creek?look for trail signs on posts and trees. \r\nNotes of caution: If you do the trail in the reverse direction, starting at the Yellowhawk trailhead, it may be a little difficult to pick out the top of the Jubilee Trail on your descent (where the previously mentioned sign is). There IS a white sign visible with binoculars from near the top, but it could be hard to spot. Other than this short section of the hike, the entire trail is well marked.  The weather can turn quickly and it can be very cold on top, even in the middle of summer.  Also, this is grizzly country so take the necessary precautions.\r",
    "geohash": null,
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/860/reg_hikemap.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/860/reg_sign.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/860/reg_summitmicrotower.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/860/topo_MtMurrayView.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mt-murray-near-quesnel-airport-bc-860",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 5,
        "Time": "5 hrs",
        "Total Distance": "11 km",
        "Town": "Quesnel Airport, BC",
        "Type": "out-and-back"
    },
    "title": "Mt. Murray",
    "trail_id": "860"
}