{
    "description": "92J8. The Blowdown Pass entrance to the Stein Valley is hard to get to and requires some route finding. However, time spent in the alpine is well worth the effort, especially if you intend to hike out via Lytton. From the pass itself there are several accessible scrambles - Gott Peak being just one - and many interesting route options as well.\r\nI rated this trail as difficult not because of its technical nature but because of its relative remoteness and length. Assuming you have a 4x4 that will get you to the pass, Blowdown to the Lytton trailhead is around 50 kilometres. On the way you will encounter deadfall and deteriorating trail. If you can distract yourself from the beauty of your surroundings remember that this is bear country (grizzlies in the alpine, black in the valley) so HANG YOUR FOOD! Also, don't expect huge crowds, we pulled into every campsite anticipating company and didn't see a soul for five days straight - highly unusual in BC.",
    "directions": "Exact directions can be found in the book 'Stein Valley Wilderness Guidebook' by Gordon White. The book is outdated and may be hard to find but where there is a will ?.. \r\nThis is where it gets ugly! This is what the book doesn't tell you. The drive requires a 4x4 vehicle. When I say 4x4 I mean it, so take me seriously or prepare to leave your car in the wilderness. This very old logging road has not been maintained and some of the treats along the way include massive boulders, wide ditches and steep drop-offs. We did it in an already beat up Isuzu Trooper and were passed at speed by a Toyota Forerunner. \r\nThe road begins a good fifty kilometres past Pemberton on the Duffy Lake Road.\r",
    "photos": [],
    "source_url": "https://trailpeak.com/trails/stein-valleyblowdown-pass-near-pemberton-bc-864",
    "stats": {
        "Activities": "river-kayak hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 4,
        "Time": "35 hrs",
        "Total Distance": "0 km",
        "Town": "Pemberton, BC",
        "Type": "out-and-back"
    },
    "title": "Stein Valley/Blowdown Pass",
    "trail_id": "864"
}