{
    "description": "This is a short but challenging trail that starts at the Shannon Falls parking lot and heads north to connect with the Squamish Chief trails.  The first kilometre is fine hiking but then the trail starts to climb for a crossing of Oleson creek.  A short scramble and some steps will get you to the bridge.  If the weather is icy or snowy, you might want to call this scenic lookout your turnaround point; otherwise you can make this a loop by crossing the bridge.  You then come to a junction.  Going right, up the stairs will lead you to the Chief, Squaw and Upper Shannon trails.  Turning left and heading down the stairs (which will be slippery in wet or icy weather) will bring you to the old parking area for the Chief and the walk-in campsites.  Continue through the campsite and down to the highway and it's a short walk back to your trailhead at Shannon Falls.\r\nThis trail could also be done in reverse order--some may prefer that as most of the steps require an uphill slog.",
    "directions": "Take the Sea to Sky Highway to Shannon Falls parking lot just south of Squamish and head for the viewpoint trail.  Take in the view, and then follow the well-marked trail to the Chief junction.\r\n\r\nThere is an alternate access from the Squamish Chief Provincial Park parking area, from which, depending on time of year, you may have to walk a little further to the trailhead.  It's well marked.\r\n\r",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/873/reg_IMG-20110619-00204-45804.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/873/reg_ShannonFallsloopJan.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/873/narrow_ShannonFallsloopJan.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/lower-shannon-falls-loop-near-squamish-bc-873",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 3,
        "Time": "3 hrs",
        "Total Distance": "4 km",
        "Town": "Squamish, BC",
        "Type": "out-and-back"
    },
    "title": "Lower Shannon Falls Loop",
    "trail_id": "873"
}