{
    "description": "Sat. - June 14, 2003 - I took the 211 Seymour CMBC bus to it's terminus at Gallant Ave in Deep Cove. From there it is a 2 & 1/2 block walk North to the trailhead on Panorama Drive. The trail climbs fairly steeply in places here (quite an abrupt elevation gain) until you top out near the cliff viewpoints overlooking Indian Arm towards Buntzen Lake. The forest opens out in several places here and the views are stellar! I wish I had taken my camera at this point!! Great picnic spot in nice weather. \r\n\r\nBack into the forest fringe you follow a scramble over boardwalks & bridges & streams & stairs to the hydro power lines. From here the hike is a fairly gentle grade. Watch for the blazes to take you to the trail to Indian River Road & turn right on the road. About 100 metres south, the trail picks up across the road. It gets a bit rougher in here until you top out at the Mt. Seymour Road. Lots of climbing up & down. In fact, if you have much of a pack this would be graded more towards the ?difficult? rating. \r\n\r\nOnce across the Mt. Seymour road the walking becomes fairly average. The trail is varied, some of it being nicely graded and finely graveled, to being rutted & pitted from run-off & strewn with fist-sized cobble. Mountain bikes are plentiful here so watch for them. All kinds of trails (Old Buck, Buck, Mushroom Parking Lot) hook into the Baden Powell here and you could hike this area for the full day. Coming down off Mt. Seymour towards Hyannis Road there are some steep sections again and with a 40 lb pack it can be tricky in spots--watch your step. Once down into the flats the walking becomes quite pleasant with the odd stream & boardwalk & bright greenery. In fact a beautiful stream parallels the trail until you get to Hyannis Drive. It takes about 4 - 5 hrs to walk this stretch. \r\n\r\nIf you want, a short detour (15-30 min) up Hyannis to Hill Drive, then up to Blairview Road will reward you with awesome scenic views of the Harbour & across the Strait of Georgia. Once across Hyannis the trail trends down fairly gently to the Seymour River. Here a lot of trail runners will monopolize the trail over to Lynn Canyon. Keep an eye open as they overtake you quickly. Crossing the pipeline bridge across the Seymour you are straight into a hefty stair climb and some steep grade. This is a tough bit even though the trail is in good shape. Once you top out on the ridgeline running E - W below Lynn Peak, it opens out and the walking is easy again. Then you scramble back down across Lillooet & into Lynn Canyon. Again at times quite steep, the forest is fairly open. You can hear Lynn Creek and at the bottom there are boardwalks in wet places. \r\n\r\nThere are also some great little beach areas in here where you can stop & soak your feet. People also swim their dogs here and there are ducks swimming in the broad calm sections between cliffs rising up out of the creek. You parallel Lynn Creek as you wind northwards with its magical views & pools, tall majestic trees & falls, until you get to the suspension bridge. There are other crossings but the suspension bridge is worth the wait. If you don't take too long a break at the beach at the bottom to the ridge you can walk this in about 2-3 hrs.",
    "directions": "I took the 211 Seymour CMBC bus (or you can take the 212 Dollarton) to it's terminus at Gallant Ave in Deep Cove. From there it is a 2 & 1/2 block walk North, past the beach access & park, to the trailhead on the West side of Panorama Drive. There isn't much parking available here for passenger vehicles and what there is will be competed for avidly.",
    "photos": [],
    "source_url": "https://trailpeak.com/trails/badenpowell-deep-cove-lynn-canyon-near-vancouver-bc-877",
    "stats": {
        "Activities": "hike mtn-bike",
        "From": "",
        "Seasons": "spring summer",
        "Stars": 4,
        "Time": "7 hrs",
        "Total Distance": "13 km",
        "Town": "Vancouver, BC",
        "Type": "out-and-back"
    },
    "title": "BadenPowell - Deep Cove-Lynn Canyon",
    "trail_id": "877"
}