{
    "description": "The trail slowly winds upwards past small waterfalls, large forested regions, and some small rocky scrambles.  There are 3 viewpoints along the way and the trail is slightly overgrown in places and requires some climbing over and under some fallen logs that block the trail.  After a few hours, the trail winds back down to the marsh.  You need to cross the footbridge, which was broken on one side but scalable without having to wade in the marsh.  Then turn right and follow the Mountain Dike until you hit a T-junction where you turn left and retrace your path to the parking lot. Note that the Mountainside Trail has some challenging sections and is not a hike for small children.\r\n\r\n* editor's note: Nick Bogod, who sent this trail in, provided a very nice GPS plot of the hike, which you can see if you click on \"Download GPS\" above.  You can insert this data into your own GPS to find the trail.",
    "directions": "Lougheed Highway, Coquitlam, to Pitt Meadows.  After the Pitt River Bridge turn left on Dewdney Trunk Road, then left on Harris Road, right on McNeill Road, and left on Rannie Road.  Follow to the end and park in the Grant Narrows lot. Walk along the dike for 20-30 minutes. The dike ends and you continue walking towards the wooden lookout.  Shortly after a narrow trail bears right and heads towards the trees.  This is where the Mountainside Trail begins.  Follow the square silver trail markers and (sometimes excessive amounts of) fluorescent pink tape that mark the trail.\r",
    "geohash": "c2bb",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/898/reg_PittLake.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/898/reg_hikesendhaiku.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/898/reg_lookatthetopleftofthispicture.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/898/reg_waterandlookout.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/pitt-wildlife-area-mountainside-trail-near-vancouver-bc-898",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 5,
        "Time": "5 hrs",
        "Total Distance": "12 km",
        "Town": "Vancouver, BC",
        "Type": "out-and-back"
    },
    "title": "Pitt Wildlife Area / Mountainside Trail",
    "trail_id": "898"
}