{
    "description": "The Fort to Fort Trail is a pleasant 4 seasons trail linking Fort Langley to Derby Beach Regional Park.  It can be combined with other trails and roads for a longer ride.Starting at the Fort Langley Historical site, head west on the road following the distinctive sign posts past the old CN station. You will soon reach the Fraser River.  Stop and enjoy the views of Mt. Baker and Golden Ears.On the good gravel trail, you soon reach Allard Crescent.  The trail follows the road for a distance before heading back towards the river and into the heritage part of the Derby Beach Regional park.  At this junction you will see a sign indicating the Edgewater Bar trail.  Follow it to the main park and camping area.For a quick return, turn left leading out of the park and follow Allard Crescent back to Fort Langley. On this ride I went right along Allard to a left turn onto 208th, then left on 96th and back to the Fort.  I even had to ride the last few kilometres with a slow leak in my front tire.",
    "directions": "Take Highway 1 to 200th street exit north and then right onto 96th and follow the signs to Fort.Langley, or take Lougheed Highway to the Albion Ferry and park at Albion and get on the bike and ride into town and the start of the trail.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/936/long_ForttoForttrailMarch212004032jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/936/reg_ForttoForttrailMarch212004009jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/936/reg_ForttoForttrailMarch212004026jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/936/reg_ForttoForttrailMarch212004031jpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/936/narrow_ForttoForttrailMarch212004006jpg.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/fort-to-fort-near-langley-bc-936",
    "stats": {
        "Activities": "hike mtn-bike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "11 hrs",
        "Total Distance": "15 km",
        "Town": "Langley, BC",
        "Type": "out-and-back"
    },
    "title": "Fort to Fort",
    "trail_id": "936"
}