{
    "description": "NTS Map: 082N09Elevation Gain: 650 mThe Dolomite Peak Circuit is an excellent ski traverse starting from Helen Creek North of Lake Louise on Hwy 93.  Park just after the Helen Creek Bridge at a small parking lot on the east side of the highway.  You can either leave a second car at the Mosquito Creek trailhead or hitch hike back to your car.\r\n\r\nThe trail ascends steeply up the treed slope behind the parking lot for a short distance before turning northwest to parallel the creek.  After about one kilometre the trail descends to the creek and crosses it.  Continue northwest along fairly flat terrain until the trail crosses the drainage from Katherine Lake.  The trail then starts to climb the treed slope between Helen Creek and the drainage from Lake Katherine until the terrain opens up.  Ahead of you will be a broad un-named peak south of Cirque Peak.  Contour around the southeast shoulder.  Before you will be a short descent to a flat section and then a short climb through a notch to the first high point.  From here descend across Lake Katherine, past some large boulders that have fallen from the North side of Dolomite Peak.  Not staying too high, work your way around Dolomite Peak until you descend a short distance to the flats on the northeast side.  Travel in a SSW direction to ascend the next pass.  Descend from this pass trending toward the south until the terrain opens up.  Avoid the large avalanche paths to your right but do not descend too far towards the creek.   As you approach the point were the slope steepens towards Mosquito Creek, work your way directly south towards Hwy 93 along the southeast shoulder of Dolomite Peak.  Descend through the trees towards the highway.  There is GPS data attached to this trail (see \"download GPS\"), which if loaded into your GPS can help you find route points.\r\n\r\nIn winter please check the Avaluator\r\n(Online Trip Planner) rating is: \r\n Complex.  \r\nSee more trip planner route details here.\r\n\r\n\r\n    \r\n        \r\n      \t\r\n\r\n\r",
    "directions": "30 kilometres North of Lake Louise on Hwy 93. Park at the Helen Creek trailhead.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/948/reg_Dolomiteflats.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/948/reg_IMG-5270-42936.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/948/reg_lookingback.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/948/reg_map.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/948/reg_skiingdownpass.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/948/topo_DolomitePeak.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/dolomite-peak-circuit-near-banff-ab-948",
    "stats": {
        "Activities": "snowshoe ski-bc",
        "From": "",
        "Seasons": "spring winter",
        "Stars": 4,
        "Time": "7 hrs",
        "Total Distance": "19 km",
        "Town": "Banff, AB",
        "Type": "out-and-back"
    },
    "title": "Dolomite Peak Circuit",
    "trail_id": "948"
}