{
    "description": "Princess Margaret Marine Park is located on Portland Island, east of Satellite Channel and north of Sidney on Vancouver Island. Portland Island was presented to Princess Margaret in 1958 to commemorate her visit to British Columbia. In 1967 the princess returned it to the province for it to be created as a marine park.\r\nThere are several middens in the park that indicate native use of the land going back over 3,000 years. Middens are refuse heaps of castaway shells left by centuries of harvesting the island's waters.\r\n\r\nClassified as archaeological sites, the middens are protected under British Columbia law and may not be disturbed.\r\n\r\nPortland Island was named after the H.M.S Portland, the flagship of Rear-Admiral Moresby, commander-in-chief of the Pacific Station from 1850 to 1853. The island was named in 1859 by Captain G.H Richards of the H.M.S Plumper.\r\n\r\nBald Eagles, Turkey Vultures and Red-tailed Hawks are often seen overhead, and Oystercatchers and the Great Blue Heron frequent the island's shoreline. Black-tailed Deer, Mink and River Otters are amongst the animals sighted on the island. Raccoons are numerous on Portland Island, so be sure to secure all food supplies in containers - a tent is not a secure container! There are several trails for an energetic hike or you can simply explore the beautiful beaches and bays. Swimming, diving, kayaking and fishing are other recreational options.\r\n\r\nBC's first artificial reef, the sunken freighter G.B. Church, lies off the northeast shore of Portland Island. The scuttled ship now serves as a haven for marine organisms and is an attraction for Scuba divers.\r\n\r\nThis picturesque 194-hectare park has three wilderness campsites for overnight use: Arbutus Point, Shell Beach opposite Brackman Island, and Princess Bay campground and day-use area. Fresh water is available, and toilet facilities are located at all campgrounds and the day-use area. Open year round, fees are collected from May 1 to September 30. From October 1, the park is open with no services and no fees.\r\n\r",
    "directions": "We made our way from Vancouver via the Twassann ferry terminal, walking on with all our gear in tow on a dolly and in a rolling hockey bag. Catching a ferry to Swartz Bay on Vancouver Is. From here we stepped onto a smaller ferry and landed in Fulford Harbour on Saltspring Is. The kayak rental is right there and the owner gladly stored our dolly and bag for us. Ferry Schedule link www.bcferries.ca",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/963/reg_PDRM0655JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/963/reg_PDRM0664JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/963/reg_PDRM0687JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/963/narrow_PDRM0649JPG.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/963/narrow_PDRM0651JPG.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/portland-is-via-saltspring-is-near-victoria-bc-963",
    "stats": {
        "Activities": "sea-kayak",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "0 km",
        "Town": "Victoria, BC",
        "Type": "out-and-back"
    },
    "title": "Portland Is. via Saltspring Is",
    "trail_id": "963"
}