{
    "description": "FRANCAIS(english follows)Montée raide de trois heures avec de beaux points de vue. Au sommet, vous aurez plusieurs opportunités de vois des caribous. La descente prends 5h30 et se fait tout au long de la rivière Ste-Anne ainsi que de plusieurs chutes.ENGLISH - REVISEDThis is one of the showcase day hike options you can take in the Gaspesie National park, and is a must do option recommended by the park info people.Due to its central starting point, access is easy. It originates across the road from the visitor info center, or the cabins / local campgrounds, and, if you do this in a counter clockwise manner, puts the hardest portions of the hike at the beginning, when you have the freshest legs.We started with what might be considered a winter snowshoe route, or a steep look off climb called La Saillie. It's a 5.7K route written up elsewhere on the site. It reaches a point where a platform offers a view back over the Gite and the peaks of the McGarigle range to the East.In the summer months, it is permitted to continue upward along a steep route to its plateau. the trees change quickly from being 30-40 footers to the stunted sorts along with the moss and lichen associated with arctic tundra.Shortly after topping out (the trail doesn't really take you to either the Southern or Northern high points) you will arrive at a shelter where you can observe the flat 20 square kms of Mont Albert's plateau, as well as a few ponds, red oxidized rocks, boardwalks, bogs and caribou. Off in the distance, you can see bits of La Grande Cuve, a dramatic and majestic change in landscape.The boardwalk section takes you further into the plateau, unless you choose to turn back and hike back down the way you ascended. Taking the boardwalk reveals the varied terrain on this mountain top. Without the boardwalk, you'd sink well past your knees in the bogs and damage the delicate plant life. This next km leads to the Grande Cuve, which is an immense creek and glacial carved valley. (The source of Ruisseau Du Diable.) Here you descend along the waterfall path onto the valley floor. the sense of scale is amazing.At this point, the hardest parts of the hike are finished, as you are now hugging the base of Mont Albert, following the topo lines and dropping far more subtly toward Lac du Diable. There is a junction allowing you to tour Mont Olivine, but we kept to the trail proper. Lac du Diable is a well photographed scene where on the left, reflects the trees and slope of Mont Olivine, and in the far opposite shore, the distinct monolith of Mont Hog's Back. In the calm waters, it conveys a sense of serenity.Heading back northward, the trail looses its rugged nature, and the tree cover comes back to shelter a weary hiker. The path widens, and the surface is smoother. The last highlight is a lookoff platform showcasing a waterfall called Chute du Diable. Afterward, the trail follows the creek back to the bridge where we started the trail.In all, if you can handle distances like these, this trail rewards you several times along the way. If you're blessed with a nice day, hike the the trail's full length. If you have the legs and the daylight, hike Mont Olivine's spine as well. The Tour du Mont Albert will be a highlight of your stay in the Chic Chocs.Steep climb of three hours with great views. Opportunities to see caribou on the summit. The descent takes 5h30 along waterfalls and the Ste-Anne river.",
    "directions": "FRANCAISDirigez vous vers Ste-Anne des Monts puis suivez les indications pour le Mont Albert.ENGLISHGo to St-Anne des Mont, Quebec, and follow directions to mont Albert.www.SEPAQ.com",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/QC/976/long_diable-sml-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/976/reg_caribou-sml-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/976/reg_grande-cuve-sml-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/976/reg_rocks-small-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/976/reg_untitled2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/976/topo_viewQue.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/976/narrow_scan0004jpg.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/tour-du-la-mont-albert-parc-national-de-la-gaspesie-near-matane-pq-976",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer",
        "Stars": 4,
        "Time": "6 hrs",
        "Total Distance": "17 km",
        "Town": "Matane, PQ",
        "Type": "out-and-back"
    },
    "title": "Tour du la Mont Albert (Parc National de la Gaspésie)",
    "trail_id": "976"
}