{
    "description": "This trail climbs gradually for the first hour on a rocky, dusty trail. Once you get to the first viewpoint of Okanagan Lake, kelowna and the floating bridge the trail continues and the viewpoints only get better. There was still some snow in April. You can also make a loop around the Peters Station which is about 20km back to your car. This is a very rewarding hike as there is different terrain, bridges and creeks to cross.",
    "directions": "Going north in Westbank on Hwy 97 turn left on Bartley Rd. Follow the road straight to a gravel road, you will be on private property for 2km. Park on the right just before the cattleguard and the trail starts here.  \nAdditional info from smoke\nA great trail that can be either shuttled or ridden. The climb is not great, as it's a typical old doubletrack for about 11 km. However, once you reach the ridge (which you can access via a long shuttle around the back) you get some excellent sub-alpine XC to play on. The descent is textbook Okanagan flowy singletrack, which even top downhillers will have a hard time completing in under 40 minutes.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/987/reg_Mountain-Biking-007.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/987/reg_MountainBiking011.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/987/topo_mcdougall2.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/987/narrow_hayman-cliffs-rose-valley-view-10650.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/987/narrow_hayman-point-10650.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/mcdougall-rim-near-kelowna-bc-987",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 4,
        "Time": "4 hrs",
        "Total Distance": "10 km",
        "Town": "Kelowna, BC",
        "Type": "out-and-back"
    },
    "title": "McDougall Rim",
    "trail_id": "987"
}