{
    "description": "For the Ottawa/Hull region, this would be considered a '10' for hiking options. Other than driving to Mt. Ste. Marie an hour North, or, 3 hours South to the 5,000 foot peaks near Lake Placid, the Gatineau Park just north of Ottawa has a few bottom-to-top hikes worth checking into.  This is one of the best.On this NCC (National Capital Commission) maintained hike along a set of waterfalls to the Firetower high up in the Gatineau park, you will experience large pine, rushing falls, wildlife, exposed rock, and great views.  You will also work.At first, the hike is steep, you are taken close to the rushing \"Chutes de Lusk\" many times to view worn Canadian shield that tumbles water along various rock walls, and into deep pools.  The water has worn the rock smooth.You will in fact find lots of rock, exposed in many places to give you great views, and opportunities to stop for lunch, or just laze in sun as you stare out onto the expansive Ottawa river.  Our GPS told us the altitude gain was roughly 900 feet, but as you explore across each side of the falls, with the peak elevation being about 1,250 feet above sea level.  Not bad, and the steepness of it gives you some cardio, it feels like a real mountain hike.Once up top, you can explore the ridge line and rock, enjoying great views back on the Ottawa valley, or, continue along the well worn trail to the firetower.  There are signs in place. Past the firetower, you can reach a nice cabin for lunch about 2 km away.  All told, you will have hiked 9-10 km up and down if go to the cabin along the flat maintenance road. We saw beaver dams, woodpeckers, and, someone said they saw a bear, perhaps a bit groggy from its winter nap. We didn't see mosquitoes or black flies, since it was just April 24 but the bugs can be bad here any other time besides spring and fall.Climbers and other intrepid hikers hike up the next \"falls\" over (to the right if looking at the escarpment from the bottom), past the NCC laneway where most people walk to the start of the Lusk falls hike.  one can actually do a loop along the top of the escarpment, and down the trail that is well worn once you reach that rushing creek / canyon.  The route along the top is not an official trail.",
    "directions": "Cross the river from Ottawa at Champlain bridge, or, from Hull, get on hwy #148 going West towards Luskville and Quyon, passing through the village of Aylmer.  Before you get to the hamlet (village) of Lusk along 148 (closer to 15km from Aylmer), maybe a few hundred meters before the turnoff to Lusk, you'll see a sign on the right hand side of the road, a brown NCC sign indicating \"Gatineau Park\" access. It's a simple Cul de Sac laneway that also leads to the \"Ranche Chutes\" which has horse rides and a sign that says camping, $120 (we hope that includes horse rides for a couple of days - or perhaps the owners are tired of people asking to camp). All told about a half hour drive once you are on the Quebec side.About 500m down that gravel NCC road, just before you reach 'le ranch', you'll see a gated laneway leading to the parking area for the hike.  Some go to the end of the Cul De Sac and take the path less travelled, straight past the cul de Sac where you will see another waterfalls and some rock scrambling to be had.",
    "geohash": "f21g",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/QC/988/reg_beaverdam.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/988/reg_fallsjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/988/reg_halfviewjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/988/reg_rockwater.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/988/reg_viewjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/988/topo_Firetower.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/988/narrow_backfallsjpg.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/988/narrow_falls2jpg_best1_.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/lusk-falls-chutes-de-lusk-gatineau-park-near-gatineau-pq-988",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 5,
        "Time": "4 hrs",
        "Total Distance": "10 km",
        "Town": "Gatineau, PQ",
        "Type": "out-and-back"
    },
    "title": "Lusk Falls (Chutes de Lusk) - Gatineau Park",
    "trail_id": "988"
}