{
    "description": "0     rock lake road access gate 1495m\n1.8  junction, willow creek trail left, gradual descent through lodgepole pine  forest\n4.8   wilmore-jasper park boundry\n6.5   rock creek x-ing\n8.5   junction wolf pass left, open valley boggy willow flats\n12   willow creek warden cabin\n13.9 junction 1335m, stay left\n25.5  snake indian falls",
    "directions": "Drive to Hinton [which is on the main highway between Edmonton and Jasper] and then take hwy 40 at the west end of Hinton just out of town to the dirt road going to the Rock Lake trailhead\n?Travel time from Edmonton to Hinton is about 3 hours on very good highways.\n?Travel time from Hinton to the Willmore Trailhead is about 1.5 hours on paved hwy 40 then on 30 km [20 miles] on a gravel road.\nAs you leave Hinton on paved hwy 40, you will first cross the Athabasca River Bridge, then later the small Wildhay River Bridge. The left turn onto the gravel road to Rock Lake is about 5 km beyond the Wildhay bridge. \nIt's about 30 km to Rock Lake and the Trailhead on the gravel road which is not straight as depicted on the maps below. \nWithin a few km of the start of the gravel road, you will reach a T-intersection. Go left. Shortly afterwards, within a few km, you will reach a choice of straight ahead or a right hand turn. Go right. Don't worry if you miss this. If you go straight, you'll drop down to a dead end campground. The road continues along with some views of the wildhay and with several dirt roads going left. These all lead to casual campsites that you can use without reservations.\nAs you near Rock Lake, you will see Willmore Wilderness Park signs for right hand forks of the road. These forks will take you to the trailhead which has a parking lot and the usual trailhead map board. If you get to the Rock Lake Campground or Boat Launch, you are quite close, but likely missed the Willmore signs. Just backtrack a mile or so and you'll find them. The trailhead is NOT at the Rock Lake Campground.",
    "geohash": "c3",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/9894/reg_Rock-Lake-01-11997.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/9894/reg_Rock-Lake-02-11997.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/9894/reg_Rock-Lake-03-11997.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/9894/reg_Rock-Lake-05-11997.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/9894/reg_Rock-Lake-13-11997.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/9894/reg_Snake-Indian-Falls-2-11997.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/snake-indian-falls-via-rock-lake-near-hinton-ab-9894",
    "stats": {
        "Activities": "snowshoe hike ski-bc mtn-bike",
        "From": "",
        "Seasons": "summer",
        "Stars": 5,
        "Time": "5 hrs",
        "Total Distance": "52 km",
        "Town": "Hinton, AB",
        "Type": "out-and-back"
    },
    "title": "Snake Indian Falls via Rock Lake",
    "trail_id": "9894"
}