{
    "description": "This is one of the best X-C Ski loops I have ever done. Mostly single track trail through mature pine & spruce forest a few smaller stretches of Aspen Poplar and lovely meadows and a couple of excellent ridge views.  Approximately 1/4 is wider on some old logging roads.  There is lots of up & down but none of it really tricky.  \r\rOverall elevation gain is 430M but no really long or particularly steep sections.  An excellent intermediate trail but not for beginners.\r\rI X-C Skied the trail and really enjoyed it but the topography suggests it will also be an excellent Mtn Bike track.  Interestingly though, all the maps for Kananaskis Country, go to great lengths to point out the trails is this particular area are not maintained for summer use.  They are part of the \"West Bragg Creek X-C Ski Trails Complex\".\r\rGreat Ski, can't wait to try it out this summer on bike\r",
    "directions": "West from Bragg Creek, turn left after you cross the Elbow river at Bragg Creek follow RR232 to the end at the Trail Head parking lot.  Trail head is on the north side of the parking lot (There are lots of trail signs)",
    "geohash": "c3n",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/9897/reg_Telphone-Trail-20110102-002-32708.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/9897/reg_Telphone-Trail-20110102-004-32708.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/9897/reg_Telphone-Trail-20110102-012-s-32708.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/9897/narrow_Telphone-Trail-20110102-008-32708.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/telephone-trail-near-calgary-ab-9897",
    "stats": {
        "Activities": "mtn-bike ski-xc",
        "From": "",
        "Seasons": "summer winter",
        "Stars": 5,
        "Time": "3 hrs",
        "Total Distance": "16 km",
        "Town": "Calgary, AB",
        "Type": "out-and-back"
    },
    "title": "Telephone Trail",
    "trail_id": "9897"
}