{
    "description": "If you want a little more of a workout, you may want to consider going up to Skogan Pass from Ribbon Creek.  Towards the top there are 2 large loops that you can add for more distance.  It will give you a distance in the area of 24+km and 700+m of cumulative elevation.  The loop around the upper loop has some serious climbing (including 200m at 22% grade), be warned!\nInterestingly, I noticed on GoogleEarth one passes within meters of several logged cut blocks but you'd never notice them (I knew they were there and didn't notice them). \nMake sure you know where to turn up the Skogan Pass trail from the Nakiska utility road.  We got lost and added ~7km and 300m of elevation to our day.  The enclosed tracklog show the upper of the 2 loops, Skogan Pass itself it a further 2km past the top point (we were tired, remember the part about getting lost??).\nStarting from Ribbon Creek parking lot this trail offers some loops and an In&Out section that is all gently uphill on the way out, so you can ski until you're tired then turn around and coast back down. Good scenery and it passes through the base of Nakiska Ski area, and up some great back routes into the hills. Not all trails are track-set, but those who want something a little more adventurous, this is it!. And for those that can't live without ready access to Espresso, this trail goes right past the Nakiska Day lodge and optionally the mid-mountain lodge.\nAlternately you can park at the parking lot across the paved road, commonly used by Troll Falls hikes and dog walkers (mind the brown Klister).  It saves about a km and you don't have to cross the road.\nThe route is well signed and all maps have the little 'You are here' rivet installed. The only route finding needed is through the most populous area ironically, you have to look across the Nakiska base area to see the next couple marker signs.\nIf you go through Nakiska, you ski under a lift, then you will come to a 4-way intersection. Going left (NorthWest)gets you on to the trail to Marmot Basin trail and Skogan Pass in 1.3km. From this next Tee, 2.7km of up gets you up Marmot to the Nakiska mid-mountain lodge, or turning right (North) opens up a multitude of advanced trails and loops on the way to Skogan Pass. There is about 10km of loops and trails between you and Skogan, so it gives you a lot of flexibility in length. \nRibbon has some of the better early season snow. On the drive out we saw all brown grass and dirt on the side of Hiway 1, but Ribbon area was nicely white.",
    "directions": "Drive West of Calgary on the TransCanada Highway #1 to Hiway 40 (Kananaskis Trail) (about 60km from the lights at Calgary Olympic Park) and then go South about 25km to the well-signed Nakiska / Ribbon Creek turn. Go up the road a km or less and follow the signs to Ribbon Creek. Park in the furthest lot (past the hostel & picnic shelters).\nTrail starts just behind the biffies near the entrance to the far parking lot.",
    "photos": [],
    "source_url": "https://trailpeak.com/trails/skogan-pass-near-kananaskis-ab-9899",
    "stats": {
        "Activities": "snowshoe hike ski-bc ski-xc mtn-bike",
        "From": "",
        "Seasons": "winter fall summer",
        "Stars": 4,
        "Time": "4 hrs",
        "Total Distance": "26 km",
        "Town": "Kananaskis, AB",
        "Type": "out-and-back"
    },
    "title": "Skogan Pass",
    "trail_id": "9899"
}