{
    "description": "Leaving your car and walking on a dirt road you will soon descend a good size hill.  Since the road is often very soft and the hill is steep, I suggest you walk this part instead of taking your car.  At the bottom of the hill, you continue on the road and cross a small brook flowing on your left.  A minute afterward, you will leave this main road and turn to the right on an obvious ATV path to a large open area set by the five Mile river.  Here you find ample evidence of camping/bonfires.  \nAs of April 2011, there is an outbreak of white nose syndrome in bats in the Maritimes. Since this syndrome can wipe out whole bat population and this cave is a known bat hibernaculum, I have deleted all the coordinates that lead to this cave. I hope you all understand.\nLooking to the left you can see some really high limestone cliffs, probably the highest kinds of these cliffs in NS.  Make your way to them through a very picturesque deciduous forest.  At some point, you will need to cross the Five Mile River.  Parts of the river can be forded with some knee high rubber boots or waders.  If it?s summer, then you can go barefoot.  The entrance to the cave is located to the right of the high cliffs that are bordering the river.  You should be able to find a faint trail that people have cleared to the cave entrance.  Getting closer to the cave, you will also spot some signage to warn you about rocks falling?so be careful of those.  The entrance to the cave sits just below the cliff face on top of the scree slope.  The inside chamber is huge?probably the biggest, known, chamber in Nova Scotia.  Unfortunately, there are a few graffiti on the rock walls both inside and outside the cave entrance.  From the cave entrance you will also spot some distinct trails leading you to the top of the cliffs but be careful as there are a lot of loose rocks everywhere.",
    "directions": "Make your way to South Maitland and turn on highway 236",
    "geohash": "f84c6",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/9909/reg_DSC-0205-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/9909/reg_DSC-0206-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/9909/reg_DSC-0207-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/9909/reg_DSC-0208-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/9909/reg_DSC-0209-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/9909/reg_DSCF0888-40974.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/9909/reg_DSCF0894-40974.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/9909/reg_DSCF9658-40974.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/9909/reg_PIC-0327-40177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/9909/narrow_DSCF9663-40974.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/hayes-cave-near-truro-ns-9909",
    "stats": {
        "Activities": "snowshoe hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 5,
        "Time": "1 hrs",
        "Total Distance": "2 km",
        "Town": "Truro, NS",
        "Type": "out-and-back"
    },
    "title": "Hayes Cave",
    "trail_id": "9909"
}