{
    "description": "The Angels Landing Trail is one of the most famous and thrilling hikes in the national park system. Zion's pride and joy runs along a narrow rock fin with dizzying drop-offs on both sides. The trail culminates at a lofty perch, boasting magnificent views in every direction. Rarely is such an intimidating path so frequented by hikers. One would think that this narrow ridge with deep chasms on each of its flanks would allure only the most intrepid of hikers. Climbers scale its big wall; hikers pull themselves up by chains and sightseers stand in awe at its stunning nobility. The towering monolith is one of the most recognizable landmarks in the Southwest.\rThe first 2 miles are paved and well maintained. Most of the path is sunny, but Refrigerator Canyon offers shade and often a cool breeze. This is a good early morning hike. Make sure to allow time to be off the trail by dark if starting late in the day. The last half mile is across a narrow sandstone ridge. Anchored support chains are attached along some sections of the sheer fin. \rTrailhead: Grotto picnic area in Zion Canyon \rTrailend: Same as trailhead \r\r\rAngels Landing at Glance\r \rDistance: 5 miles \rAverage Hiking Time: 3 hours \r\r",
    "directions": "Grotto Canyon Trail head",
    "geohash": "9qx",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/UT/9912/reg_100-5129-6425.jpg",
        "https://trailpeak.com/storage//content/trails/US/UT/9912/reg_100-5138-6425.jpg",
        "https://trailpeak.com/storage//content/trails/US/UT/9912/reg_100-5142-6425.jpg",
        "https://trailpeak.com/storage//content/trails/US/UT/9912/reg_100-5153-6425.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/angels-landing-near-springdale-ut-9912",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "fall",
        "Stars": 5,
        "Time": "3 hrs",
        "Total Distance": "8 km",
        "Town": "Springdale, UT",
        "Type": "out-and-back"
    },
    "title": "Angels Landing",
    "trail_id": "9912"
}