{
    "description": "It's always nice to be able to find new places to ice climb in the province of New Brunswick, and this coastal cliff line is just one more to add to the ever growing list. \nLocated on a Peninsula around Rockport, our trek edged along Shepody Bay, and the views on the opposite shore were dominated by Shepody Mountain.\nThe total hike was 5K to the last ice line we climbed, but probably three and a half K were done by snowshoes. Because of the rolling nature of the terrain, you could also ski in for a faster approach. (had I known!) We ditched our modes of transport at the beach and continued to hike along the rocks to the ice.\nThese lines were \"discovered\" only a few years ago (this being 2011), and one of the climbers who came with us was the one who had done the discovering. In fact, two routes we did this day were previously unlead, and thus were in line for naming.\nIt was a great day of climbing, though the ice looked dirty from the surrounding rock. Much of the cliffs and flows are in the 15-20 meter range. Two groups would lead routes to establish an anchored top rope, and then move on to new routes with new ropes.  We'd each climb the WI 3's and 4's, clean the anchors and follow along. this meant very little waiting, and a fulfilling day.\nThe temps this mid January afternoon were only -4C but with the water close by, it made it a cold place to play. Be sure to bring a fine working glove system, and a puffy jacket. I sure needed them!\nThe of routes range in level of difficulty from WI 3-4. Some lines were too thin to climb, and others had delicate starting points. Later in the year, things might fatten up. That's the thing with ice; it's ever changing by the climate. The GPS file contains the hike in, as well as waypoints for the dominant routes we saw.",
    "directions": "From Sackville, follow route 935 to its end at Johnson's Mills. Park there, and follow a long plowed lane, south-southwest. It will eventually turn into a cart path that mostly keeps to the woods, but follows the shore line. It will lead to an opening to the beach, where you can continue on the shore at low tide to see the numerous ice lines. You will have to lead to establish anchors.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NB/9919/reg_dorchester-cape-004-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/9919/reg_dorchester-cape-005-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/9919/reg_dorchester-cape-008-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/9919/reg_shepody-hills-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/9919/narrow_dorchester-cape-003-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NB/9919/narrow_dorchester-cape-009-6702.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/cape-maringuin-ice-climbing-near-sackville-nb-9919",
    "stats": {
        "Activities": "climb snowshoe ski-bc ski-xc",
        "From": "",
        "Seasons": "winter",
        "Stars": 3,
        "Time": "5 hrs",
        "Total Distance": "5 km",
        "Town": "Sackville, NB",
        "Type": "out-and-back"
    },
    "title": "Cape Maringuin Ice Climbing",
    "trail_id": "9919"
}