{
    "description": "The Misthorns at 1880 meters is not a frequented mountain judging from the summit registry but is a fantastic destination.  Of the three peaks, the summit is in the middle.  It takes about 2-3 days to bag this mountain.  You take the flower ridge trail all the way up to the ridge.  Once on the ridge, after a few hours you will be greeted by the SeptimusRosseauMisthorns massif.  It's truly awesome, which makes this approach to the Misthorns very enjoyable.  All along the ridge you are out in the open and are treated to beautiful views.  Even if you don't want to climb the Misthorns the trail along Flower Ridge is a worthy destination.  The first day is spent walking along the ridge until you can make camp above Green Lake or by Prices Pass (a large land bridge connecting flower ridge with the massif).  Day 2 is going down Prices Pass and summitting.  Day 3 is getting back to your vehicles.  A fast group with good conditions could do the trip in 2 days but you would have to be moving very quickly.  Water can be a problem depending on the time of year and the amount of snow so take that into consideration.  We summited on the July long weekend and there was plenty of snow, the whole ridge was covered, so bring the right equipment (snow shoes, skis, helmet, crampons, ice ax, avi beacon etc).  \r\rFrom the trailhead head across the the bridge and pickup the trail on your left.  The trail is very well marked so just follow it for the next 3 hours or so, its a steep one but just think of the great view you will have at the top.  From the ridge top head along the ridge going up and down the bumps many times.  When you get above Green Lake (hours later) this where you will need to start looking for a camp site.  Your view at this point should be amazing with the entire massif right infront of you.  You should also be able to see the Price Pass to your left.  This is your way over. To get to Price pass, head up and over the next bump and then directly down to the pass, contouring around is way more effort then heading up and over.  Make your way across Price Pass and the route should be visible now.  You will want to head up on the left side of the moutain.  The route up is straightforward and uncomplicated.  For us the conditions where excellent and we didn't need to rope up or use crampons.  From the top make your way over to the real summit and enjoy!  If the conditions are right you can even boot ski down!",
    "directions": "Take the Island highway north to Campbell River, then hang a left to Strathcona Park along highway 28. Then take Westmin Road south until you get to the flower ridge trail parking lot. It took us about 1.5 hours from Courtenay to get here.",
    "geohash": "c0y",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/9924/reg_P7020054-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/9924/reg_P7020055-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/9924/reg_P7020084-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/9924/reg_P7020090-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/9924/reg_P7030101-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/9924/reg_P7030105-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/9924/reg_P7030106-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/9924/reg_P7030111-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/9924/reg_P7030142-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/9924/reg_P7030143-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/9924/reg_P7030144-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/9924/reg_P7030148-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/9924/reg_P7030165-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/9924/reg_P7030172-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/9924/narrow_P7030117-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/9924/narrow_P7030126-Large--4612.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/the-misthorns-near-campbell-river-bc-9924",
    "stats": {
        "Activities": "ski-bc hike snowshoe",
        "From": "",
        "Seasons": "summer spring",
        "Stars": 5,
        "Time": "21 hrs",
        "Total Distance": "18 km",
        "Town": "Campbell River, BC",
        "Type": "out-and-back"
    },
    "title": "The Misthorns",
    "trail_id": "9924"
}