{
    "description": "Triple Peak at 1525 Meters is not one of the higher mountains on Vancouver Island but what it lacks in height is surpassed with an awesome approach and a very enjoyable scramble through vertical bush.  In fact this was my first time bushwacking vertically, we will see if the novelty weirs off.  the approach takes you beside a waterfall all the way up to a lake.  You cross the waterfall many times jumping back and forth, just awesome.  From the lake you go up two bumps and cross a snow field to where you reach the rock.  The summit is the middle peak even though the first one, the one on the right, looks higher.  From there head around to the left and find the gulley system that will take you to the top.  We used a rope for the scramble and for the rappel downward.  I would recommend it unless you are very comfortable with your climbing skills.  Exposure isn't bad but the black flies can be, got eaten alive while belaying.  This adventure should take about 8 hours and is 13 kms.\nFrom the trail head, pick up the trail and head down towards the stream.  Once you get to the stream cross where ever you can, then pick up the trail again.  From here on keep your eyes peeled for flagging and cairns.  At times you will be on the left of the waterfall and at others on the right.  Once you get to the top of the waterfall enjoy a break at the nice little lake (makes a very nice place to camp if you intend on doing this as an over nighter).  This area may be covered in snow and crampons and an ice axe is a good idea.  From the lake head left around and make your way up the two bumps and proceed around to the middle peak (on the left side of it).  Head left and look for an overgrown gully.  Pull your way through the vertical bush.  You may want to rope up here and use the trees for anchors.  Once out of the gully system, it is a short scramble to the summit.  Once on top sign in at the summit registry and enjoy.",
    "directions": "Drive Out of Port Alberni travel West on Hwy 4 for 46kms turn left of onto Marion Main Line. Stay on mainline and drive up to the end of the Marion Ck watershed to a Pass which then heads down the Effingham watershed roughly 10kms. Drive another 1km and take right turn at fork another 300m down on right side when road starts to turn left, look for small rock Carin and worn trail heading over the bank. Some flagging might be visible. \"WARNING\" on my last visit there I ran into road builders, sounds like work is starting in the area so before heading out make sure to check.",
    "geohash": "c0wz",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/9925/reg_P7110173-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/9925/reg_P7110175-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/9925/reg_P7110177-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/9925/reg_P7110178-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/9925/reg_P7110180-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/9925/reg_P7110186-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/9925/reg_P7110187-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/9925/reg_P7110189-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/9925/reg_P7110191-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/9925/reg_P7110192-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/9925/reg_P7110196-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/9925/reg_P7110198-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/9925/reg_P7110200-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/9925/reg_P7110201-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/9925/reg_P7110205-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/9925/narrow_P7110184-Large--4612.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/triple-peak-near-port-alberni-bc-9925",
    "stats": {
        "Activities": "climb hike",
        "From": "",
        "Seasons": "spring fall summer",
        "Stars": 5,
        "Time": "8 hrs",
        "Total Distance": "13 km",
        "Town": "Port Alberni, BC",
        "Type": "out-and-back"
    },
    "title": "Triple Peak",
    "trail_id": "9925"
}