{
    "description": "The Golden Hinde (2200 meters) is the highest mountain on Vancouver Island and because of that is on everyones must do list. Although this can be climbed in 24 hours, most people will attempt the trip from 3 to 7 days. The description here is for the the South-East Couloir, the standard route and we did it in 4 days. Day 1 for us was a slow start with an 11am trail head start and camp was made about 8 hours later somewhere along Philips Ridge. Day 2 was a 9:30 am start and saw us finish the day at 6pm just above Burman Lake (we did not drop down). Day 3 was our summit day with a 6:45 am start, on the summit by 11:30 and then we moved camp to Schjeldrup Lake (6:30pm). Day 4 was the longest day I can ever remember! I forgot to write it down but somewhere in the 10-12 hour mark. Not only is it a long time but it is just grueling. Lots and lots of elevation gain and lost, the final switchbacks from Arnica lake are a killer. But having said that, this area of the park is absolutely beautiful and the climb up the Golden Hinde is a very enjoyable one. From the parking lot, head across the road and over the gate. You will see the trail head on the right in a few minutes. With full packs it will take about 3 hours to get to Arnica lake, about 1000 metre elevation gain. You do have the option of camping here on tent platforms. Once you reach Arnica Lake head around the lake counter-clockwise and then pickup the trail heading westwards. Once you get going on Philips Ridge it is pretty hard to get lost, follow the cairns and your best judgment. One thing to keep in mind is that if it looks like there is a short cut don't be tempted, there are no shortcuts, just keep following the rock cairns. Keep making your way along the ridge. When you get to the notch that allows you to drop down to Carter lake take it. You don't want to keep going and dropping down into Schjelderup Lake, we did this route (on the way in) and the bushwack is awful, we much preffered the routes around Carter and Shjelderup. Once you make your way around Carter and Shjelderup Lakes, you can camp here if you want but I strongly suggest you push up onto the ridge. The main reason is there are less bugs, more sunlight and closer to the Golden Hinde, it won't take you long to get up here and there are some excellent camping areas with lots of water. I would also strongly suggest not to consider pushing a higher camp, the drop down to Burman Lake and up again is very tiring without a full pack. Once up from Burman lake pick up the well worn rock cairn route to a large tarn at the bottom of the Golden Hinde. Head right around the tarn and make your way up the snow field and go as high as you can and then take a gulley on the right up. Now you will be on the South-East ridge, head rightish upwards until you the prominent couloir is visible. Make your way up this snow slope until you come into contact with loose rocks. Make your way up the last section and the summit is right there. Don't forget to sign into the registry. Enjoy!",
    "directions": "From Courtenay take either the old highway or the new highway to Campbell River. Once there take Hwy 28. You will then come to a bridge, don't go over the Buttle Narrows bridge, just keep heading straight on Buttle Lake road (or Western Mines Road). Follow this road all the way through the mine and you will see parking on the right. Park here. Total time",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/9926/reg_P7310002-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/9926/reg_P7310007-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/9926/reg_P7310009-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/9926/reg_P8010010-Large--4612_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/9926/reg_P8010020-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/9926/reg_P8020035-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/9926/reg_P8020044-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/9926/reg_P8020045-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/9926/reg_P8020049-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/9926/reg_P8020055-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/9926/reg_P8020057-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/9926/reg_P8020078-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/9926/reg_P8020089-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/9926/reg_P8030096-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/9926/reg_P8030097-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/9926/reg_P8030098-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/9926/narrow_P8020034-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/9926/narrow_P8020054-Large--4612.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/golden-hinde-near-campbell-river-bc-9926",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring summer",
        "Stars": 4,
        "Time": "28 hrs",
        "Total Distance": "27 km",
        "Town": "Campbell River, BC",
        "Type": "out-and-back"
    },
    "title": "Golden Hinde",
    "trail_id": "9926"
}