{
    "description": "Elkhorn Mountain, at 2195 m, is the second highest peak on Vancouver Island. I can't talk about the awesome views from the top due to the snow storm in early June, so be prepared for all type of weather! The route described here is up the West Couloir. The approach to base camp is long and quite steep, there is section that involves using an old fixed rope up some very slimeymossey rocks. Although climbing Elkhorn can be done in a day, most parties take two days. We had a tremendous amount of snow on the ground and rainy conditions which made for very poor quality snow and made for slow going, even with snow shoes. Fortunately that night the temperature dropped to freezing which made for easier going in the morning. The West Couloir was filled with snow and required crampons, ice ax (wish I had brought a secondary tool) and a rope (we only used it for going up the chockstone). You definitely want to be comfortable on steep snow, basically you can see your partner bellow you when you look between your feet. The steepness ends at a notch from there the last little scramble to summit is uneventful. Total time is two days.From the trail head follow the trail up the Elk River. In about 45 minutes you will see a sign to your left for Elkhorn Mountain. This will involve a water crossing, hike up your pants and away you go. Once get across, just a short distance away is another water crossing. Here if you go up stream you will come across a large fallen log ( or just cross where ever you can). Pick up the trail and start heading upwards. The only thing worth mentioning on the way up is that one section involves using a very old rope up a very slimmey rock face, pay attention in this area. Once you get to the ridge follow it towards Elkhorn Mountain. It is up to you at this point and either camp around here or get as close as you can to Elkhorn and then camp. As you keep going you will come across a very large bump. Head towards the right of it and then make your way up. Once on top you will find the way down as you head towards Elkhorn. We camped just a little further from here. It will take you about 9 hours to get this far.The summit day is about 5 hours. Head west until you come to a Couloir with a very large chockstone in it. Head up this Couloir and go right when you get to the chockstone. Due to the snowyicy conditions we roped up and placed some protection as we made our way over the chockstone. Once past the chockstone we put the rope away and soloed. Crampons were a must. I really would have enjoyed a secondary tool, very intimidating when lifting your ice ax for a plunge and the only thing securing you is your two feet as you look between then at your partner! At times it felt like we were climbing a ladder. I would guess the steepness at about 60-65 degrees. After a couple of hours you will be at a notch. The top is just off to the left. Make your way and hopefully enjoy the views!",
    "directions": "Follow Hwy. 28 west from Campbell River towards Gold River. You'll see the sign for the trailhead. Park your vehicle right there.",
    "geohash": "c0y",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/BC/9927/reg_001-2-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/9927/reg_002-2-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/9927/reg_P6050002-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/9927/reg_P6050004-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/9927/reg_P6050006-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/9927/reg_P6050017-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/9927/reg_P6050019-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/9927/reg_P6060021-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/9927/reg_P6060022-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/9927/reg_P6060026-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/9927/reg_P6060031-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/9927/reg_P6060032-Large--4612.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/9927/narrow_P6050016-Large--4612_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/BC/9927/narrow_P6060025-Large--4612.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/elkhorn-mt-near-campbell-river-bc-9927",
    "stats": {
        "Activities": "climb hike",
        "From": "",
        "Seasons": "spring winter summer",
        "Stars": 5,
        "Time": "14 hrs",
        "Total Distance": "1 km",
        "Town": "Campbell River, BC",
        "Type": "out-and-back"
    },
    "title": "Elkhorn Mt.",
    "trail_id": "9927"
}