{
    "description": "I have only X-C skied and hiked this but I'm sure it'll also make a nice bike trip also.  Excellent groomed track up to about the elevation a Nakiska lodge then skier set track from there but very good. Only one quite steep pitch near the top where you need to herringbone otherwise good wax  carry you all the way up.  The loop is 17.4Km with an elevation gain of 665m (2180ft) so it's a good workout going up and a great ski or ride down.  It's all old logging road or power line service road so nothing technical but some great views higher up.  There are also a couple of very worthwhile alternate routes to Highlevel or Sunburst Lookout.  This route starts and ends at the Ribbon Creek Parking lot  or you can drop down the other side to Pigeon Mountain, Dead Man's Flats if you have another vehicle of lots of energy.",
    "directions": "West on Hwy 1 from Calgary to Kananaskis (Hwy 40).  South about 25K, take turnoff the Kananaskis Village and follow signs to Ribbon Creek parking lot.  Trail head is at the east end of the parking lot - just follow the signs - there are lots of them.Enjoy",
    "geohash": "c3n",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/AB/9946/reg_Skogan-Pass-20110202-005-s-32708.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/9946/narrow_Skogan-Pass-20110202-003-s-32708.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/9946/narrow_Skogan-Pass-20110202-007-s-32708_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/9946/narrow_Skogan-Pass-20110202-008-s-32708.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/AB/9946/narrow_Skogan-Pass-20110202-015-32708.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/skogan-pass-near-calgary-ab-9946",
    "stats": {
        "Activities": "hike ski-bc ski-xc mtn-bike",
        "From": "",
        "Seasons": "winter summer",
        "Stars": 4,
        "Time": "3 hrs",
        "Total Distance": "18 km",
        "Town": "Calgary, AB",
        "Type": "out-and-back"
    },
    "title": "Skogan Pass",
    "trail_id": "9946"
}