{
    "description": "Martock, located just outside of Windsor, Nova Scotia, is home to both Nordic and alpine skiing. During a race weekend in February, I took a morning to check out the Nordic trails.  In a relatively small space, the designers eeked outmore than a half dozon trail, most groomed for both skate skiing and Classic tracks. There is a facility for Biathalon, and in the winter of 2011, was home to the Canada Games Nordic events.\nI decided to have a go at a couple of trails, given the limited time I had, so decided to try Herman's Way, which like the rest of the trails, didn't actually start from the parking lot. A location called Crow's Foot seemed to be the central location for most of the routes.\nI spilled onto Herman's Way, and followed the orange colored route, until I reached a junction, where confusing signage directed me one way, but actually rerouted me onto Brigadoon Loop. Not a bad change in terrain, because Brigadoon has some really fun and fast rollers to really crank it on the heart rate.\nOnce I got back to Crow's Foot, I followed Herman's Way once again, this time determined to get it right back at the suspect junction. (an arrow pointed the wrong way, at least from my direction) and off I went completing the route.\nAll the loops include (from easy to expert) Easy Rider (green) Brigadoon Loop, Herman's Way, Sprint Loop and Jack Rabbit, (all intermediate) and The Climb which is rated as expert. The signage doesn't indicate distances, but Herman's way felt like 2-3K.  Also listed on the map, but not indicated as a route, is the Penalty Loop for biathlon events.\nThey charge a fee to use the trails, but given the conditions I saw, The money is well spent on pristine grooming and tracks, and fantastic routes that are full of character.\nShannon Burt, East Coast editor",
    "directions": "From Windsor, follow the signs to Martock, approx. 3K away just off Route 14, heading south-west.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/9949/reg_IMG-2909-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/9949/reg_IMG-2913-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/9949/reg_IMG-2916-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/9949/IMG_2909.JPG",
        "https://trailpeak.com/storage//content/trails/Canada/NS/9949/narrow_IMG-2911-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/9949/narrow_IMG-2912-6702.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/9949/narrow_IMG-2915-6702.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/martock-nordic-trails-near-windsor-ns-9949",
    "stats": {
        "Activities": "hike ski-xc",
        "From": "",
        "Seasons": "winter",
        "Stars": 3,
        "Time": "3 hrs",
        "Total Distance": "10 km",
        "Town": "Windsor, NS",
        "Type": "out-and-back"
    },
    "title": "Martock Nordic Trails",
    "trail_id": "9949"
}