{
    "description": "This is an alternative to the Grouse Grind Trail.  It starts and ends at almost identical points, but follows a more natural route.  You don't have the feeling of being part of a herd climbing up a stair case.  It gains around 800m over 3 kilometers, so be prepared to get your heart rate up.  It's slightly longer than the traditional grind and will take you a bit more time to complete.\r\rAs you begin following the trail to the grind, you will reach a junction shortly after.  To the left uphill is the Grouse Grind.  To the right is the Baden Powell Trail which you will follow.  It crosses a dry creek bed and after this, you'll reach another junction this time between the Baden Powell and the BCMC which goes left uphill here.  Once on the BCMC trail, you'll notice evenly spaced orange and silver markers, most of which are marked with a marker number.  There are 160 in total, so that makes around 1 marker per 20m.  The trail is pretty straight forward and well trodden.\r\rSome points of interest:\rMarker #31 - A trail goes left into the ravine here then climbs 100m to rejoin the BCMC trail.  From this side trail, you can find the start of the Flint and Feather trail as well as access to the Grouse Grind.\rMarker #46 - This is where the short side trail rejoins the BCMC\rMarker #129 - Here a viewpoint can be found off of the trail on the left side.\rMarker #135 - Another viewpoint here.  Once again it is on the left side.\rMarker #138 - Small bridge over a creek.  From here the trail has leveled off quite substantially.\r",
    "directions": "Follows the directions to Grouse Mountain.  If you're coming by the highway, this means taking exit 14.  Either way, you drive up Capilano Road to the end where the skyride is.  The trail starts at the same point as the Grouse Grind\r\rBoth the 232 and the 236 buses go up to Grouse and are an option if you aren't driving.",
    "photos": [],
    "source_url": "https://trailpeak.com/trails/bcmc-trail-near-north-vancouver-bc-9950",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "summer fall spring",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "3 km",
        "Town": "North Vancouver, BC",
        "Type": "out-and-back"
    },
    "title": "BCMC Trail",
    "trail_id": "9950"
}