{
    "description": "Camelback as it's known (or Echo Canyon as proper name / parking area) is one of Phoenix's classic hikes, likely the most popular hike in all of Arizona based on sheer numbers, this is the Grouse Grind of Phoenix, both easier and more difficult.  Given that there's about a rescue a week on the trail, I'd say it's more difficult than the Grind.  There's also a lot of rock hopping up steep vertical terrain and one incredible pitch that is a scramble if not a climb.Just after some 5 to 10 minutes of easy railway tie trail stepping and beginner'ish hiking, boom, there it is, a seeming wall placed in front of you.  When I went, you could see many people struggling to get up this steep pitch.  Fortunately, there is a guard rail for those who are more tentative, meanwhile others just scramble right up in a matter of seconds.  After gaining this section, it levels off before quickly going back to a vertical climb, and so it goes for the next hour, mostly vertical scrambling and line picking so as to avoind hikers coming down.  You'll see many wearing gloves and this is a good idea, as you'll likely use your hands on this hike, and it's easy to cut yourself on the rock.  Many people do this hike as a fitness climb, some do it every day.  One thing for certain, there are great views from the top.  It may only be 1.5 miles from start to peak (it is marked along the way) but you'll work for it.  I was blown away by how many people (regulars) have built up their rock hopping skill and balance.  Some people just flew past me on the way down, and I am a fairly good scurrier and can place me feet quickly on technical terrain.  The last quarter of the hike is quite steep, and  again steepest close to the peak before it levels off.  A great feeling to arrive, but don't expect to be alone.As any urban hike with a degree of difficulty, you've got some who hike to get fast times, others who are completely unprepared.  Even the fast fitness hikers just have to make one small mistake, and over a side they go.  Advice is to ignore those rocketing to the peak and just hike your hike.  Enjoy it, it really is a classic and you may get hooked.  If you do this for the first time, make sure you go do lots of easy hikes first, and, ensure you've got proper hiking boots or day hikers as running shoes just seem wrong on a trail like this.For guided hiking options in the area check out Arizona Outback Adventures.",
    "directions": "Echo Canyon Parking lot.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/AZ/9966/reg_DSC-0990-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/9966/reg_DSC-0991-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/9966/reg_DSC-0992-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/9966/reg_DSC-1000-5.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/9966/reg_DSC-1004-5_best1_.jpg",
        "https://trailpeak.com/storage//content/trails/US/AZ/9966/narrow_DSC-0997-5.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/camelback-echo-canyon-near-phoenix-az-9966",
    "stats": {
        "Activities": "hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 3,
        "Time": "2 hrs",
        "Total Distance": "4 km",
        "Town": "Phoenix, AZ",
        "Type": "out-and-back"
    },
    "title": "Camelback - Echo Canyon",
    "trail_id": "9966"
}