{
    "description": "The Traversee de Charlevoix covers 105 km in the mountainous Charlevoix region, at the heart of a World's biosphere reserve. Amidst breathtaking and unique panoramas of summits up to 1000 meters, the trail runs along several ecosystems. It is a seven days trek on back-country skis either in full autonomy from cabin to cabin or with your equipment carried from one cottage to the other. Log cabins only offer a wood stove while cottages have propane cooking and lighting and come equipped with pots, dishes, etc. \r\rYou can either do only part of the Traversee or the full trek. We attempted the first part in 2010. A snowfall of over 3 feet changed our plans. The first two legs of the GPS file show the terrain we were able to cover. The 2011 trek went as planned and covered the last two-thirds of the trail. Climbing skins are a must. Most of the trails are very well marked but good maps and GPS are also required since the markings may get buried deep under the snow  ;-)  \r\rLa Chouette cottage via Mount La Noyée, 17 kms:\rWe started on a location called Sortie d?Urgence (emergency exit!), where we dropped our vehicles which the Traversee staff moved to the final destination, Mont Grand-Fonds. From there, we took the long route, all the way to the top of Mount La Noyee and then down to the cottage. The view from the summit of La Noyee is a must! You can see the south shore of the St-Lawrence River, the alpine ski trails of Mont Grand-Fonds (your final destination) the valley of the Malbaie river and its Hautes-Gorges. \r\rLa Chouette to Le Geai Bleu, 20kms:\rAs soon as you leave the cottage, the steep climb will warm you up! The climbing then becomes easier but won?t stop for about  6km, followed by a good descent towards Rivière Malbaie. The last km before the bridge crossing includes a few steep and tight switchbacks. On the other side the river, the trail takes you to a beautiful ancient maple grove. Your day ends at the Geai Bleu cottage, with a beautiful view on the Rivière Malbaie. BTW, this cottage is equipped with a propane oven, so you may plan your dinner to take advantage of this luxury!\r\rLe Geai Bleu to Le Coyote, 16kms:\rExpect to climb for the first half of the day, followed by rolling hills. This is moose territory; you may see tracks all around. Many nice spots to stop for lunch, especially when the sun is out.\r\rLe Coyote to L?Épervier, 11kms:\rBecause of a recent ice storm, the trail was closed and we used snow covered foresters roads. If windy, dress up accordingly since you won?t get much protection form the wind. Good map or GPS a must, since trail markings are rare.\r\rFrom L?Épervier to Mont Grand-Fonds\rGood climbing for two kilometers then it is either flat or down. The last kilometers are on groomed trails. The Traversee de Charlevoix ends at Mont Grand-Fonds, complete with alpine skiers, snowboarders and chairlifts. Quite a contrast from the last few days? You will find your vehicle at the lower end of the parking lot and drive back to the Traversee office to shower and pick-up your extra luggage. Hope you enjoyed your trek!",
    "directions": "See the Traversee website for more info: www.traverseedecharlevoix.qc.ca",
    "geohash": null,
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/QC/9986/long_TDC-2011-1-33062.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/9986/long_TDC-2011-2-33062.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/QC/9986/reg_on-descend-33062.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/traversee-de-charlevoix-near-la-malbaie-pq-9986",
    "stats": {
        "Activities": "ski-bc",
        "From": "",
        "Seasons": "winter",
        "Stars": 5,
        "Time": "49 hrs",
        "Total Distance": "105 km",
        "Town": "La Malbaie, PQ",
        "Type": "out-and-back"
    },
    "title": "Traversée de Charlevoix",
    "trail_id": "9986"
}