{
    "description": "North Table mountain is a tall flat-topped mountain with incredibly steep \rsides overlooking the town of Golden, Colorado, and offers stunning \rviews of the city and the lowlands to the east as well as unobstructed \rviews of the foothills to the west. There are a couple trail networks \rthroughout the park, though due to the steepness of the mountain, the \rtrails circumnavigating the mountain and the ones that access the flat top \rrarely cross. \r\rThe trail is fairly easy, with the exception of the initial ascent, which is \rrather steep. Once beyond this, however, the trail undulates gently \racross the plateau and is perfect for jogging or a leisurely walk.\r\rThe mountain's location and the fact that it is almost exclusively covered \rin grassland means that exposure to the elements is high. There is no \rshade to protect against Summertime sun, nor against the wind that can \roccasionally howl through with some force, so make sure to bring plenty \rof water and wind protection. The unobstructed view does let you get a \rgood look at the herd of deer and several coyotes that inhabit the upper \rranges however.\r\rAlso, the rim rock trail terminates in a spectacular view of the cityscape \rbelow, which I highly recommend late in the afternoon so you can catch \rthe lights coming on in the dusk before sunset.\r",
    "directions": "Head North on highway 93 through Golden and take the first Right past Pine \rRidge Rd into the parking area. Signage is mediocre, so keep a sharp \rlookout for the parking access.\r\rClosest bus access is via RTD-Denver. Take the GS Boulder via GS Golden \rand get off at the Hwy 93 & Virginia St stop. Parking entrance will be two \rstreets north.",
    "photos": [
        "https://trailpeak.com/storage//content/trails/US/CO/9990/reg_img0121-20033.jpg",
        "https://trailpeak.com/storage//content/trails/US/CO/9990/reg_img016-20033.jpg",
        "https://trailpeak.com/storage//content/trails/US/CO/9990/reg_img0346-20033.jpg",
        "https://trailpeak.com/storage//content/trails/US/CO/9990/reg_img0489-20033.jpg",
        "https://trailpeak.com/storage//content/trails/US/CO/9990/reg_img0765-20033.jpg",
        "https://trailpeak.com/storage//content/trails/US/CO/9990/reg_img0836-1--20033.jpg",
        "https://trailpeak.com/storage//content/trails/US/CO/9990/reg_tablemtn-night-20033.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/north-table-mountain-near-golden-co-9990",
    "stats": {
        "Activities": "hike diving",
        "From": "",
        "Seasons": "summer fall winter spring",
        "Stars": 4,
        "Time": "2 hrs",
        "Total Distance": "9 km",
        "Town": "Golden, CO",
        "Type": "out-and-back"
    },
    "title": "North Table Mountain",
    "trail_id": "9990"
}