{
    "description": "This is a classic hike on the seafloor on the Bay of Fundy.  There are some many cool features on this hike which means that anybody will have fun on this one.  You will see on this hike, keyholes in a rock wall big enough for adults to easily go through, a troll?s hollow (explanation later), petrified wood, and a unique ?flower pot? with a natural land bridge.  Even without a geologist?s background, these are amazing sites.\r\rI had to climb down a fairly steep rock cliff to begin this hike but there are easier ways to get to these features and I have explained the easiest way in the directions paragraph.  Therefore you will notice that the GPS I uploaded does not match exactly the direction I give on how to get there. \r\rWalk along the cliffs walls until you get to the flower pot.  It?s a fairly impressive and large sea stack which as a couple of trees growing on the top.  Make sure to go around all sides of the pot since you can only see the natural land bridge from the seafloor if you are looking at the flower pot from the north.  It?s a cool looking bridge between what will eventually be two separate flower pots.  You can easily climb quite high into the crevasse in the flower pot because it is V shape.  I did not attempt to make my way to the top of the flower pot since the rock material is actively eroding.\r\rFrom there continue on a southwestern heading and watch closely the many rocks since I saw some petrified wood and some petrified sandy seafloor without locking very hard.  After a short hike you will come up to the troll?s hollow.  Somehow, a kind of hollow was created when all the lower material was dissolved or taken away by wave action but a rock roof remains in place.  What you end up with is some kind of a natural rock shelter complete with a rock roof.  The pictures I took do not show this very well but make sure you have a look before yet again this feature disappears.\r\rFrom the hollow then it?s just a short hike to the two keyholes.  I had seen the keyholes from far away while I was looking for another feature named the Johnson Cove cave (which I subsequently found).  I had promised myself I would be back to investigate these keyholes on another day when the tides would be low.  Check you tide tables in order to see all these features described in this post.  The keyholes are quite big with one being larger than the other.  They are located in a thin rock face that juts out into the bay.  The rock face is no more than 2ft thick and actively eroding so make sure to see this before it disappears.\r\r",
    "directions": "Take the Ocean Beach Road from highway 215 near Cheverie and park at the beach.  Turn to the left and follow the cliffs until you see the flower pot?\r",
    "geohash": "f8435",
    "photos": [
        "https://trailpeak.com/storage//content/trails/Canada/NS/9999/reg_DSC-0087-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/9999/reg_DSC-0092-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/9999/reg_DSC-0095-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/9999/reg_DSC-0102-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/9999/reg_DSC-0107-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/9999/reg_DSC-0110-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/9999/reg_DSC-0111-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/9999/reg_DSC-0121-27177.jpg",
        "https://trailpeak.com/storage//content/trails/Canada/NS/9999/narrow_DSC-0098-27177.jpg"
    ],
    "source_url": "https://trailpeak.com/trails/cheverie-keyholes-near-windsor-ns-9999",
    "stats": {
        "Activities": "sea-kayak hike",
        "From": "",
        "Seasons": "spring winter fall summer",
        "Stars": 5,
        "Time": "2 hrs",
        "Total Distance": "4 km",
        "Town": "Windsor, NS",
        "Type": "out-and-back"
    },
    "title": "Cheverie Keyholes",
    "trail_id": "9999"
}