{
  "center_geohash": "c3n2cjgw8ez9",
  "center_lat": 50.78955775592476,
  "center_lng": -114.91215394344181,
  "description": "Completed on July 10, 2021 in dry conditions (strong current and high water level for river crossing)\n*** Bike-N-Scramble ***\n// *** Campground gates opened from May 19 to September 19. Extra distance to cover if closed. \nEdwards Rating: II (III or IV depending on summit block route) L L \n// 6 to 9 hours\n// Elevation of 1089 m NET, 1587 m TOT (including biking, about 1141 m for hiking) & max 2700 m\n// Must-have gear for this one for us: Poles (we forgot them again…), bug repellent, bear spray, bikes, locks, tire repair kit, water shoes & helmets.\n*****\nThis is considered as a moderate to difficult scramble (we agree with this assumption) because of the summit block. Otherwise it is a steep but straightforward ascent from the river. We loved the overall experience and a bike approach is a must in my opinion. Trails and cairns are not always obvious but if you are an experienced scrambler, you’ll have no difficulty reaching your objective.\n// From the parking lot, we reached the campground road and kept going straight biking along the river for 8.8 km. There is a small clearing on the right side of the road with a cairn. We brought our bikes down to the river and locked them up here. We put water shoes on and tried to find a safe place to ford the river. It was difficult and we ended coming back to where we started, going for a wider section where we could see the bottom all the way through. Current was strong, not as safe as doing this hike in Fall, which I recommend. Once we crossed it, we came back left to reach another cairn (GR445277), again not obvious. We also saw a flag on a tree later on. We hiked up a steep slope and followed the main gully/creek on the right side, using several different faint trails, one being more obvious but disappearing once in a while. Once we got to the treeline, we should’ve turned left and go up toward the summit but we naturally kept going almost straight up toward the summit ridge (obvious brown shale). We missed our poles here… Scree is not always stable going up, sometimes we would go along the trail on ruble instead. Once on the summit ridge, we turned left and followed the trail all the way up to the obvious weakness in the middle of Remus’s summit block. We met Chris & Eddie descending this difficult section. They did well but Chris had done the crack on the right and didn’t recommend it. Eddie used the chimney on the left. Holds were good but the last portion is steep and exposed. We turned back, lost a few meters of elevation going along the block to the right until we got to next weakness on our left (GR430291). Two climbing moves and up on an unstable scree slope. I continued solo from there and traversed on that first ledge for about 5-7 metres. Then, I draw a straight line up and scrambled on rock bands and unstable scree within 10 metres width approx. I finally climbed up a small wall with good holds on the left to reach the top. I turned right to get to the summit cairn (GR429289).\n// Same way down, you absolutely need route finding experience as this not easy terrain and there are no cairns.  As I wasn’t 100% sure what my next move would be, I didn’t make any. Descent was quick and then back to that brown shale section of the ridge using wonderful scree to run down. This was fast and a lot of fun! Then, all the trails we had missed on the way up were more obvious now (as always…). But still, closer to the river, we missed a turn and ended up bushwhacking for the last 200 metres at the end. Biking back is really fast. We loved this one overall, a bit of everything to make it a great experience.",
  "directions": "From Calgary, follow Trans-Canada Highway/AB-1 W, take exit 161A for AB-22 S toward Bragg Creek/Redwood Meadows and go south for about 22 km. Turn right on AB-66 W and drive another 27 km to Powderface Trail junction. Turn left and drive another 1.2 km to the Little Elbow River parking lot.",
  "geohash": "c3n",
  "nearest_peak_geohash": "c3n31hkemyzm",
  "photos": [
    "https://trailpeak.com/storage//content/trails/Canada/AB/13496/mountremuskananaskissummitpanoramaviewromulusandfisherpeakjul102021.JPG",
    "https://trailpeak.com/storage//content/trails/Canada/AB/13496/mountremuskananaskismebikingbackospreypackjul102021.JPG",
    "https://trailpeak.com/storage//content/trails/Canada/AB/13496/mountremuskananaskismarrydownscreejul102021.JPG",
    "https://trailpeak.com/storage//content/trails/Canada/AB/13496/mountfullertontraversekananaskissummitviewremusromulusaug52017.JPG",
    "https://trailpeak.com/storage//content/trails/Canada/AB/13496/mountremuskananaskistpascentroutefromriverjul102021.JPG",
    "https://trailpeak.com/storage//content/trails/Canada/AB/13496/mountremuskananaskismefordingtheriverstrongcurrentjul102021.JPG",
    "https://trailpeak.com/storage//content/trails/Canada/AB/13496/mountremuskananaskissummitselfieospreypackjul102021.JPG",
    "https://trailpeak.com/storage//content/trails/Canada/AB/13496/mountremuskananaskismarryclimbinguptonorthroutejul102021.JPG",
    "https://trailpeak.com/storage//content/trails/Canada/AB/13496/mountremuskananaskiscairntoascentroutejul102021.JPG",
    "https://trailpeak.com/storage//content/trails/Canada/AB/13496/mountremuskananaskismarryalongslabsunderridgejul102021.JPG",
    "https://trailpeak.com/storage//content/trails/Canada/AB/13496/mountremuskananaskistpascentroutemidwayupjul102021.JPG",
    "https://trailpeak.com/storage//content/trails/Canada/AB/13496/mountremuskananaskistpdescentroutejul102021.JPG",
    "https://trailpeak.com/storage//content/trails/Canada/AB/13496/mountremuskananaskistpnorthascent.1jul102021.JPG",
    "https://trailpeak.com/storage//content/trails/Canada/AB/13496/mountremuskananaskistpnorthascent.2jul102021.JPG",
    "https://trailpeak.com/storage//content/trails/Canada/AB/13496/mountremuskananaskistpnorthascent.3jul102021.JPG",
    "https://trailpeak.com/storage//content/trails/Canada/AB/13496/mountremuskananaskistpsummitblockfromridgejul102021.JPG",
    "https://trailpeak.com/storage//content/trails/Canada/AB/13496/mountremuskananaskistpchimney.2jul102021.JPG",
    "https://trailpeak.com/storage//content/trails/Canada/AB/13496/mountremuskananaskistpchimneyjul102021.JPG"
  ],
  "source_url": "https://trailpeak.com/trails/mount-remus-near-bragg-creek-13496",
  "stats": {
    "Activities": "hike scramble mtn-bike",
    "Elevation Gain": "1600 m",
    "From": "",
    "Seasons": "summer fall",
    "Stars": 4,
    "Time": "8 hrs",
    "Total Distance": "25 km",
    "Town": "Bragg Creek, AB",
    "Type": "out-and-back"
  },
  "title": "Mount Remus",
  "trail_id": "13496"
}