{
  "description": "Elevate your coffee brewing game with the new Flow Control Filter Cap. This innovative accessory uses a pressure-actuated valve to eliminate drip through and maximize control over the brew process. Unlike others, this cap fits perfectly on AeroPress Original, AeroPress Go and AeroPress Clear coffee makers and can be used with metal and paper filters - together or separately. Now you can make espresso-like crema and experiment with coarser-ground coffee. &lt;br&gt;&lt;br&gt;&lt;br&gt;***Please Note: Not compatible with AeroPress XL coffee maker.",
  "img_hrefs": [
    "https://vpo.ca/images/product/medium/363243.jpg"
  ],
  "name": "Aeropress Flow Control Filter Cap",
  "price_cents": 3995,
  "specs": [
    {
      "key": "Complete Brew Control",
      "value": "Attach the AeroPress Flow Control Filter Cap to your AeroPress Original, AeroPress Go or AeroPress Clear coffee maker to stop drip through which allows you to extend brew time and use coarser-ground coffee like pre-ground medium"
    },
    {
      "key": "Espresso-Style Crema",
      "value": "When used with a paper filter and dark roast coffee, the AeroPress Flow Control Filter Cap uses a build up of pressure to create an espresso like crema"
    },
    {
      "key": "Filter Flexibility",
      "value": "The AeroPress Flow Control Filter Cap can be used with the AeroPress Stainless Steel Filter or AeroPress Paper Micro-Filters (or even both at once) to create a variety of delicious flavor profiles. (Filters sold separately)"
    },
    {
      "key": "Coffee Press Flexibility",
      "value": "Compatible with AeroPress Original, AeroPress Go and AeroPress Clear. Not compatible with AeroPress XL coffee maker.(Coffee press not included.) We do not recommend using the Flow Control Filter Cap on AeroPress Original coffee makers made before 2014 due to a change in material that may affect the fit of the Flow Control Filter Cap"
    }
  ],
  "url": "https://vpo.ca/product/363243/aeropress-flow-control-filter-cap"
}