{
  "description": "Say Bonjour to the all-new Mont Blanc, the ultimate long distance trail shoe inspired by the highest mountain in the Alps. This trail cruiser is designed with our Altra EGO™ MAX midsole foam and our Standard FootShape™ Fit to provide ultimate comfort and our Vibram® LiteBase outsole for traction on any terrain. We have strategically added material where it’s needed and removed material where it’s not, resulting in a lightweight, breathable design ready for all-day trail excursions.",
  "img_hrefs": [
    "https://vpo.ca/images/product/large/346466.jpg"
  ],
  "name": "Altra Mont Blanc - Mens",
  "price_cents": 2299500,
  "specs": [
    {
      "key": "Weight",
      "value": "9.9 oz"
    },
    {
      "key": "Midsole",
      "value": "Altra EGO™ MAX"
    },
    {
      "key": "Outsole",
      "value": "Vibram™ LiteBase"
    },
    {
      "key": "Cushion",
      "value": "High"
    },
    {
      "key": "Stack Height",
      "value": "30 mm"
    },
    {
      "key": "Upper",
      "value": "Ultra-lightweight, hyper-breathable"
    },
    {
      "key": "Footshape™",
      "value": "Their signature FootShape™ comfort gives your feet more space to sit naturally and is designed to address biological differences in men's and women's feet"
    },
    {
      "key": "Balanced Cushioning™",
      "value": "Their Balanced Cushioning™ platform positions your heel and forefoot at an equal distance from the ground, encouraging better alignment and better form"
    },
    {
      "key": "Altra Eego™ Max",
      "value": "Their Altra EGO™ Max midsole foam gives you all the light and luxurious performance with a little extra bounce and added durability"
    },
    {
      "key": "Vibram® LiteBase",
      "value": "According to Vibram®, Vibram® Litebase midsole reduces 30% of the overall sole weight through a reduction of the sole thickness by 50%, while maintaining Vibram quality in grip, traction, and durability"
    }
  ],
  "url": "https://vpo.ca/product/346466/mont-blanc-mens"
}