{
  "description": "A shorter 3-fingers version of Hestra's classic Heli Ski glove with the same warm properties and tough exterior. For those who ski all parts of the mountain and need a warm, reliable glove. Removeable liner aids in drying and enables you to adapt the liner depending on activity level and temperature.&lt;br&gt;&lt;br&gt;Army Leather Patrol is a warm 3-fingers ski glove with clever functions. It builds upon the same robust concept as Hestra's Heli Ski model, but is designed to be worn inside a jacket sleeve with a comfortable neoprene collar that encircles the wrist. The 3-fingers model is for those looking for a warmer glove that still maintains finger dexterity.. The fingers and palm are made of impregnated goat leather while the backhand is made using flexible and weather resistant softshell fabric. A fleece liner with synthetic insulation keeps fingers warm even at low temperatures, and can easily be removed to wash or dry.You can also exchange the insulation with a thinner liner to adjust the warmth if you are hiking and sweating more, for example. A wrist strap reduces the chances of dropping the glove if you have taken it off to adjust your equipment, for example. A carabiner is also included along with an eyelet and hanging loop, providing several attachment options. A durable and reliable companion for those spending long days outdoors in the snow and cold, and who prefer to get away from the ski resort and its comforts. Also available as mitt and 5-fingers models, as well as a women's fit.&lt;br&gt;&lt;br&gt;",
  "img_hrefs": [
    "https://vpo.ca/images/product/medium/362691.jpg"
  ],
  "name": "Army Leather Patrol 3-Finger",
  "price_cents": 17995,
  "specs": [
    {
      "key": "Outer",
      "value": "Impregnated Army Goat leather. Windproof, waterproof and breathable HESTRA Dobby Polyester Melange fabric"
    },
    {
      "key": "Insulation",
      "value": "G-Loft polyester - is a very thin 100% polyester fiber with exceptionally high insulating capacity, even in wet conditions. G-Loft is quick drying, breathable and very compressive"
    },
    {
      "key": "Lining",
      "value": "Removable 3-finger Bemberg"
    },
    {
      "key": "Activities",
      "value": "Skiing, Ski touring, Snowboard"
    }
  ],
  "url": "https://vpo.ca/product/362691/army-leather-patrol-3-finger"
}