{
  "description": "Versatile and lightweight: the avabag litric tour 40 is a ski touring backpack with a litric avalanche airbag system. From quick after-work sessions to multi-day tours: just one base can be used to attach various sizes of avabag litric tour and freeride zip attachments, each tailored to their intended use. The zip is designed in such a way that, when combined, the base and the various packs merge to form a single unit.&lt;br&gt;&lt;br&gt;The base comprises a back element and airbag system and sits comfortably thanks to the full contact light back system. The stowaway bag can be completely opened up thanks to its circumferential zipper and is equipped with all of the features you need on a tour: ski, splitboard, and rope attachments, an ice axe holder and small map compartment leave nothing to be desired. Emergency equipment can be stowed in a separate safety compartment. We have used particularly lightweight but scuff-resistant materials to keep weight down to a minimum.&lt;br&gt;&lt;br&gt;Litric, the electronic airbag system, is lightweight, reliable and easy to use. The electric system can be fully charged in approx. 25 minutes via usb-c and activation can be tested any number of times at no additional cost. The lack of a cartridge means: more space, no weighing necessary, no cartridge disposal, no travel limitations. The design is clever down to the smallest detail, supercapacitors are used instead of cartridges and the airbag is ultra-lightweight – making the system one of the lightest on the market. And the system is especially easy to use. From charging and the led display, to the activation handle, to airbag packing and the leg loop: litric avabags are absolutely intuitive to operate. One charge enables at least two activations. When switched on its operation time is approx. 60 hours, which allows for multi-day tours with no need for recharging. Its operating temperature ranges from -30°c to +45°c.",
  "img_hrefs": [
    "https://vpo.ca/images/product/medium/349390.jpg"
  ],
  "name": "Avabag Litric Tour 40 (Includes Avabag Unit)",
  "price_cents": 175000,
  "specs": [
    {
      "key": "Base",
      "value": "Polyamide 420 D CORDURA"
    },
    {
      "key": "Zip-On",
      "value": "Polyamide 400 D"
    },
    {
      "key": "Volume",
      "value": "40 L"
    },
    {
      "key": "Length",
      "value": "Regular"
    },
    {
      "key": "Weight",
      "value": "2460 g (Includes Ava-bag Unit)"
    },
    {
      "key": "Access to main compartment",
      "value": "front"
    }
  ],
  "url": "https://vpo.ca/product/349390/avabag-litric-tour-40-includes-avabag-unit"
}