{
  "description": "A multi-talented touring boot, the all-round Atomic Backland XTD Carbon 115 W is the ultimate answer for female skiers who demand powerful skiing performance in a boot that can climb anything. Designed to drive wider touring skis and walk with efficiency, the 100mm medium last is constructed with Prolite, which uses the slimmest profile possible and then reinforces key power zones to create a supremely lightweight, stable boot for hard charging skiers. The open-throat and semi-overlap shell construction improves step-in/out and foot wrapping while Memory Fit provides advanced heating technology to allow for a fully personalized shell, cuff, and liner. A breathable, washable, PVC free 3D Platinum Tour Liner surrounds the foot for a premium, long-lasting fit. A full-rubber touring norm sole makes it compatible with Atomic Shift, and all MN, MNC and Pin bindings. With epic natural movement and 74º of cuff rotation that allows the foot to move naturally yet retains a secure and powerful foot hold, the hard-flexing Backland XTD Carbon 115 W offers the best skiing and most versatility of any women’s Backland boot.",
  "img_hrefs": [
    "https://vpo.ca/images/product/medium/362345.jpg"
  ],
  "name": "Backland XTD Carbon 115 Ski Boots - Womens",
  "price_cents": 99995,
  "specs": [
    {
      "key": "Memory Fit",
      "value": "Advanced heat-fitting technology creates a fully personalized shell, cuff and liner in minutes"
    },
    {
      "key": "Hybrid Overlap",
      "value": "An open-throat and semi-overlap shell construction that improves step-in"
    },
    {
      "key": "Dry Fit Foam",
      "value": "Dry Fit Foam uniformly envelops the foot for the best fit and offers resistance to packing out"
    },
    {
      "key": "Washable",
      "value": "Hand-wash safe and quick drying liner"
    },
    {
      "key": "100mm Medium Touring Last",
      "value": "This medium 100mm last allows the foot to move naturally while touring yet with secure foot hold"
    },
    {
      "key": "Prolite",
      "value": "Revolutionary light construction with supportive reinforcements in key zones"
    },
    {
      "key": "Frictionless Mirror Pivots",
      "value": "Symmetric and parallel pivots deliver 74° of super smooth, unimpeded cuff movement while touring"
    },
    {
      "key": "Free/Lock 4.5",
      "value": "Atomic's sturdiest ski"
    },
    {
      "key": "Energy Backbone",
      "value": "Reinforcement in key zones giving extra strength and edge grip for powerful skiing"
    },
    {
      "key": "Carbon Loaded PA",
      "value": "Carbon loaded polyamide plastic delivers incredible stiffness at minimal weight"
    },
    {
      "key": "Weight / Boot (Size)",
      "value": "1290 g"
    },
    {
      "key": "Boot Fit",
      "value": "Medium"
    },
    {
      "key": "Skill Level",
      "value": "Expert"
    }
  ],
  "url": "https://vpo.ca/product/362345/backland-xtd-carbon-115-ski-boots-womens"
}