{
  "description": "The perfect choice for female all-round ski tourers seeking the ideal balance of efficient climbing and reliable handling on the downhill, the Atomic Backland Pro W does it all. Prolite construction keeps the shell lightweight and stable while the Energy Backbone helps drive power to the skis. The Cross Lace 2.0 closure system completely wraps the foot for unparalleled foot and ankle hold by lacing a cable through the buckle for a performance fit. The Frictionless Pivot and Free/Lock 4.0 ski/walk mechanism provide for completely natural movement for effortless ascents. Offering more foot hold and customization potential, the PVC free 3D Platinum Tour is washable and breathable and comes equipped with Dura Shield, a durable TPU layer and rugged mesh textile that greatly improves the durability of the liner. This women-specific boot with a 95 flex rating also features a cuff and liner specifically shaped for women’s feet.",
  "img_hrefs": [
    "https://vpo.ca/images/product/medium/362342.jpg"
  ],
  "name": "Backland Pro Ski Boots - Womens",
  "price_cents": 89995,
  "specs": [
    {
      "key": "Memory Fit",
      "value": "Advanced heat-fitting technology creates a fully personalized shell, cuff and liner in minutes"
    },
    {
      "key": "3D Ankle &amp; Heel",
      "value": "A pre-formed, anatomical ankle and heel area provides a precise and comfortable fit"
    },
    {
      "key": "Washable",
      "value": "Hand-wash safe and quick drying liner"
    },
    {
      "key": "Cross Lace 2.0",
      "value": "Z-cable closure system through the lower buckle for improved fit and easier on"
    },
    {
      "key": "98mm Narrow Touring Last",
      "value": "This narrow 98mm last allows the foot to move naturally while touring yet with secure foot hold"
    },
    {
      "key": "Prolite",
      "value": "Revolutionary light construction with supportive reinforcements in key zones"
    },
    {
      "key": "Frictionless Pivot",
      "value": "Igus polymer bushings provide a completely natural movement for effortless ascents"
    },
    {
      "key": "Free/Lock 4.0",
      "value": "This robust ski"
    },
    {
      "key": "Energy Backbone",
      "value": "Reinforcement in key zones giving extra strength and edge grip for powerful skiing"
    },
    {
      "key": "PA / PA",
      "value": "Polyamide (PA) plastic is primarily used in touring boots for its light weight and high performance"
    },
    {
      "key": "Weight / Boot (Size)",
      "value": "1050 g"
    },
    {
      "key": "Boot Fit",
      "value": "Narrow"
    },
    {
      "key": "Skill Level",
      "value": "Advanced"
    }
  ],
  "url": "https://vpo.ca/product/362342/backland-pro-ski-boots-womens"
}