{
  "description": "A multi-talented touring boot, the hard-flexing all-round Atomic Backland XTD Carbon 120 is the ultimate answer for skiers who demand strong skiing performance in a boot that can climb anything. Designed to power wider touring skis and walk with efficiency, the 100mm medium last allows the foot to move naturally yet retains a secure and powerful foot hold. Constructed with Prolite Technology for the slimmest possible profile with reinforced areas where strength is needed, this lightweight and robust boot offers the best skiing and most versatility of any boot in the Backland Series. The open-throat and semi-overlap shell design improves step-in/out and foot wrapping while Memory Fit provides advanced heating technology to allow for a fully personalized shell, cuff, and liner. A breathable, washable, PVC free 3D Platinum Tour Liner surrounds the foot for a premium, climate-controlled fit. 74º of cuff rotation delivers epic natural movement for unimpeded walking. And a full-rubber touring norm sole makes it compatible with Atomic Shift, and all MN, MNC, as well as Pin bindings.",
  "img_hrefs": [
    "https://vpo.ca/images/product/medium/362289.jpg"
  ],
  "name": "Backland XTD Carbon 120 Ski Boots",
  "price_cents": 99995,
  "specs": [
    {
      "key": "Memory Fit",
      "value": "Advanced heat-fitting technology creates a fully personalized shell, cuff and liner in minutes"
    },
    {
      "key": "Hybrid Overlap",
      "value": "An open-throat and semi-overlap shell construction that improves step-in"
    },
    {
      "key": "Dry Fit Foam",
      "value": "Dry Fit Foam uniformly envelops the foot for the best fit and offers resistance to packing out"
    },
    {
      "key": "Washable",
      "value": "Hand-wash safe and quick drying liner"
    },
    {
      "key": "100mm Medium Touring Last",
      "value": "This medium 100mm last allows the foot to move naturally while touring yet with secure foot hold"
    },
    {
      "key": "Prolite",
      "value": "Revolutionary light construction with supportive reinforcements in key zones"
    },
    {
      "key": "Frictionless Mirror Pivots",
      "value": "Symmetric and parallel pivots deliver 74° of super smooth, unimpeded cuff movement while touring"
    },
    {
      "key": "Free/Lock 4.5",
      "value": "Atomic's sturdiest ski"
    },
    {
      "key": "Energy Backbone",
      "value": "Reinforcement in key zones giving extra strength and edge grip for powerful skiing"
    },
    {
      "key": "Carbon Loaded PA",
      "value": "Carbon loaded polyamide plastic delivers incredible stiffness at minimal weight"
    },
    {
      "key": "Weight (g) / Boot (Size)",
      "value": "1,380"
    },
    {
      "key": "Boot Fit",
      "value": "Medium - A medium fit boot is a boot with a last width of 100 millimeters (boot size MP 26"
    },
    {
      "key": "Skill Level",
      "value": "Expert"
    }
  ],
  "url": "https://vpo.ca/product/362289/backland-xtd-carbon-120-ski-boots"
}