{
  "description": "Engineered to handle long approaches where precision, durability and comfort are clutch, the Black Diamond Mission Leather is the approach shoe you want for long days in the mountains with rough terrain and off trail ascents. Designed with a durable suede and welded synthetic upper the Mission Leather slips on to provide security and comfort that lasts all day. The Mission Leather features a suede leather upper with welded TPU overlays, which is for season after season of abuse and lined for added fit and comfort. <br><br>A dual density EVA midsole provides tuned stiffness for technical edging precision with a forefoot midsole shank while providing all day comfort and forefoot protection. The Mission Leather’s high-performance BlackLabel-Mountain rubber is super sticky, enabling confident movement on committing terrain. The rubber toe protection and TPU side panels add durability and protection while multiple webbing loops give you plenty of tagging and stowing options when the approach ends and the hard climbing begins.",
  "img_hrefs": [
    "https://vpo.ca/images/product/large/337721.jpg"
  ],
  "name": "Black Diamond Mission XP Leather - Mens",
  "price_cents": null,
  "specs": [
    {
      "key": "Upper Material",
      "value": "Suede Leather upper, Full internal fit bootie, Strobel anchored webbing lace system, Welded TPU protective rand overlay, Sticky rubber toe cap"
    },
    {
      "key": "Footbed",
      "value": "Molded, Open Cell Performance EVA"
    },
    {
      "key": "Midsole",
      "value": "EVA Midsole, Dual Density Heel, Protective rockplate"
    },
    {
      "key": "Rubber",
      "value": "BD BlackLabel Mountain"
    },
    {
      "key": "Usage/ Terrain",
      "value": "Walk, Distance Approach, Climb"
    },
    {
      "key": "Last",
      "value": "BDS002 Rockered Approach"
    },
    {
      "key": "Width - Heel",
      "value": "Medium"
    },
    {
      "key": "Width- Forefoot",
      "value": "Medium"
    },
    {
      "key": "Stack Height - Forefoot/ Heel",
      "value": "15mm"
    },
    {
      "key": "Heel - Ball Drop",
      "value": "8 mm"
    },
    {
      "key": "Weight (per shoe)",
      "value": "333 g"
    }
  ],
  "url": "https://vpo.ca/product/337721/mission-xp-leather-mens"
}