{
  "description": "Engineered for precision, the Black Diamond Technician Leather is built for durability and comfort, with super sticky rubber for technical approaches. Featuring a premium suede leather upper that’s lined for fit and comfort, the Technician Leather is ultra-durable with strategically placed, welded TPU overlays for abuse on the rocks. The lightweight wrap-style tongue allows for easy on and off at the crag, and a graduated lace system goes all the way to the toe for a lockdown fit. <br><br>The Technician Leather’s tuned EVA midsole consists of a strategic stiffness-to-comfort ratio, allowing for high-performance precision where you need it, and comfort in just the right spots. The last is ideal for technical climbing, as the name implies, and the shoe’s BlackLabel-Mountain rubber provides super sticky, ultimate grip on terrain that demands precise edging and smearing you can trust your life to. Finally, the Technician Leather’s multiple webbing loops offer various tagging and stowing options for when the approach ends and the hard climbing begins.",
  "img_hrefs": [
    "https://vpo.ca/images/product/large/337756.jpg"
  ],
  "name": "Black Diamond Technician Leather - Mens",
  "price_cents": 1949500,
  "specs": [
    {
      "key": "Upper",
      "value": "Suede Leather upper, Forefoot Internal Fit Bootie, Strobel anchored microcord midfoot cage, TPU instep lace lock, Welded TPU protective rand overlay, Sticky rubber toe cap"
    },
    {
      "key": "Footbed",
      "value": "Molded, Open Cell Performance EVA"
    },
    {
      "key": "Midsole",
      "value": "Low profile EVA Midsole, Dual Density Heel"
    },
    {
      "key": "Rubber",
      "value": "BD BlackLabel Mountain"
    },
    {
      "key": "Weight",
      "value": "315 g"
    },
    {
      "key": "Heel - Drop",
      "value": "8 mm"
    },
    {
      "key": "Last",
      "value": "BD Flat Camber Approach"
    },
    {
      "key": "Stack height- Forefoot/ Heel",
      "value": "10mm"
    },
    {
      "key": "Width - Heel",
      "value": "Narrow"
    },
    {
      "key": "Width - Forefoot",
      "value": "Medium"
    },
    {
      "key": "Usage / Terrain",
      "value": "Fast and Technical Approach, Climb, Walk"
    }
  ],
  "url": "https://vpo.ca/product/337756/technician-leather-mens"
}