{
  "description": "Engineered for precision, the Black Diamond Technician is ultralight, super sticky, and durable, making it the clutch scrambling approach shoe. Featuring our signature EnduroKnit breathable upper, the Technician has superior temperature control, while remaining durable for abuse on the rocks. The lightweight half-bootie tongue allows for easy on and off at the crag, and a TPU midfoot strap and lace lock adds security while the graduated lace system goes all the way to the toe for a lockdown fit. <br><br>The Technician’s tuned EVA midsole consists of a strategic stiff ness-to-comfort ratio, allowing for high-performance precision where you need it, and comfort in just the right spots. The last is ideal for technical climbing, as the name implies, and the shoe’s Black Diamond BlackLabel-Mountain rubber provides super sticky, ultimate grip on terrain that demands precise edging and smearing you can trust your life to. Finally, the Technician’s multiple webbing loops off er various tagging and stowing options for when the approach ends and the hard climbing begins.",
  "img_hrefs": [
    "https://vpo.ca/images/product/large/327054.jpg"
  ],
  "name": "Black Diamond Technician - Mens",
  "price_cents": 1399700,
  "specs": [
    {
      "key": "Upper",
      "value": "Enduro Knit upper, Forefoot Internal Fit Bootie, Strobel anchored microcord midfoot cage, TPU instep lace lock, Welded TPU protectiverand overlay, Sticky rubber toe cap"
    },
    {
      "key": "Lining",
      "value": "Soft Touch Fully Lined"
    },
    {
      "key": "Midsole",
      "value": "Low profile EVA Midsole, Dual Density Heel"
    },
    {
      "key": "Rubber",
      "value": "BD BlackLabel Mountain"
    },
    {
      "key": "Footbed",
      "value": "Molded open cell performance EVA"
    },
    {
      "key": "Closure",
      "value": "Velcro Strap"
    },
    {
      "key": "Weight (Per Shoe)",
      "value": "315 g"
    },
    {
      "key": "Heel-Ball Drop",
      "value": "8 mm"
    },
    {
      "key": "Stack Height- Forefoot/ Heel",
      "value": "10 mm"
    },
    {
      "key": "Width-Forefoot",
      "value": "Medium"
    },
    {
      "key": "Width-Heel",
      "value": "Medium"
    },
    {
      "key": "Last",
      "value": "BD Flat Camber Approach"
    },
    {
      "key": "Usage/Terrain",
      "value": "Fast and Technical Approach, Climb, Walk"
    },
    {
      "key": "3D Wrap Construction",
      "value": "free floating compression fit"
    }
  ],
  "url": "https://vpo.ca/product/327054/technician-mens"
}