{
  "description": "Engineered for days when the word “approach” actually involves full-on climbing, the Fuel is their most technical performance shoe. The Fuel’s upper combines breathable EnduroKnit, a durable stretch woven lateral panel, and welded TPU film overlays for maximum durability and precision fit. The internally overlapping tongue allows for fewer seams and a sleek comfortable fit with minimal bulk, while the lace-to-toe construction features webbing and scalloped eyelets for variable, adjustable fit and tensioning to suit di¡erent conditions. <br><br>A climbing-specific forefoot construction allows for exceptional edge control and their BlackLabel Mountain rubber is ultra-sticky for superior grip on rock. Finally, a tag-loop on the heel and tongue gives you the option to clip the Fuels to your harness once you rope up.",
  "img_hrefs": [
    "https://vpo.ca/images/product/large/334394.jpg"
  ],
  "name": "Black Diamond Fuel - Mens",
  "price_cents": 0,
  "specs": [
    {
      "key": "Upper Material",
      "value": "Enduro Knit Upper, stretch woven quarter, Welded TPU stitch protection, Strobel construction, Seamless molded collar padding, asymmetrical overlap tongue, Sticky rubber toe cap"
    },
    {
      "key": "Footbed",
      "value": "Molded, Open Cell Performance EVA"
    },
    {
      "key": "Midsole",
      "value": "Low profile EVA Midsole, Dual Density Heel, Climbing stability formula"
    },
    {
      "key": "Rubber",
      "value": "BD BlackLabel Mountain"
    },
    {
      "key": "Weight(per shoe)",
      "value": "303 g"
    },
    {
      "key": "Last",
      "value": "BD Flat Camber Approach"
    },
    {
      "key": "Width - Heel",
      "value": "Narrow"
    },
    {
      "key": "Width- Forefoot",
      "value": "Medium"
    },
    {
      "key": "Stack Height - Forefoot/ Heel",
      "value": "10mm"
    },
    {
      "key": "Heel - Ball Drop",
      "value": "8 mm"
    },
    {
      "key": "Closure",
      "value": "Dual Velcro Strap"
    },
    {
      "key": "Climb Angle",
      "value": "Vertical"
    },
    {
      "key": "Usage/ Terrain",
      "value": "Technical approach to climb. Easy 5th class"
    }
  ],
  "url": "https://vpo.ca/product/334394/fuel-mens"
}