{
  "description": "With its 115 Flex, the LV 115 W Cabrio is the stiffest and most responsive women’s boot in the LV Cabrio series, and is geared up for descents. It combines the latest developments in ski boot technology in a model that meets the demands of experienced freeriders, while featuring excellent downhill performance plus amazing comfort and easy handling. The boot’s new 3 Density Wrap (3DWrap) is designed with Dalbello PuRE (Polyurethane Recycled Enforcement) technology and thanks to three different layers, it offers more efficient force transmission to the shell, comfort and an excellent fit – perfect for long days skiing. The Dalbello Cabrio platform with its 3-piece design allows progressive, responsive flex, harmonious damping and stable lateral and heel support for greater control during the descent. The ergonomically improved Pebax tongue with its innovative rib shape also makes it easier to get in and out thanks to greater mobility. In addition, handling is made easier thanks to the new Dynalock buckle that is part of a new locking system, and to a new Powerband with quick release function. And the Cabrio LV 115 W also scores points for sustainability: The entire inner boot is PVC-free and the outer layer is made of recycled textile and polyurethane.",
  "img_hrefs": [
    "https://vpo.ca/images/product/medium/362125.jpg"
  ],
  "name": "Cabrio LV 115 - Womens",
  "price_cents": 79995,
  "specs": [
    {
      "key": "Ski Boot Weight",
      "value": "1,780g (Size 24.5)"
    },
    {
      "key": "Size Run",
      "value": "22.5 - 27.5 Mondopoint"
    },
    {
      "key": "Construction",
      "value": "Cabrio"
    },
    {
      "key": "Flex",
      "value": "115"
    },
    {
      "key": "Last",
      "value": "99"
    },
    {
      "key": "Liner",
      "value": "3densitywrap Max W"
    },
    {
      "key": "Fit System",
      "value": "3DW"
    },
    {
      "key": "Strap",
      "value": "Power Band 50 Mm"
    },
    {
      "key": "Category",
      "value": "Freeride,Freestyle"
    },
    {
      "key": "Collection",
      "value": "Cabrio"
    },
    {
      "key": "Age",
      "value": "Adult"
    },
    {
      "key": "Gender",
      "value": "Women's"
    },
    {
      "key": "Iso (Sole Norm)",
      "value": "ISO 23223"
    }
  ],
  "url": "https://vpo.ca/product/362125/cabrio-lv-115-womens"
}