{
  "description": "The LV FREE 130 LITE Cabrio with a last width of 99 mm was designed for free-tourers who want to longer ascents, and comes as a lighter alternative to the LV FREE 130 3DWRAP Cabrio. Thanks to its grilamid shell and Instant Fit (IF Lite) liner, the boot weighs just 1,790 g. Based on the Dalbello LV Cabrio platform, the LITE also comes with the 3-piece design that gave it its name. The three-part structure provides even flex, harmonious cushioning and stable lateral and heel support. For better interaction with the shell, the tongue’s profile has been adapted, and a softer plastic has been added at key points to ensure more flexibility – removing the tongue in hike mode is a thing of the past. The IF Lite liner with the three-part Dalbello PuRE (Polyurethane Recycled Enforcement) technology was designed with a special emphasis on ascent performance, but without comprising on comfort. The new ski-walk mechanism makes it easy to switch between ascent and descent mode and a new locking system make handling even easier.",
  "img_hrefs": [
    "https://vpo.ca/images/product/medium/362214.jpg"
  ],
  "name": "Cabrio LV Free 130 Lite",
  "price_cents": 95000,
  "specs": [
    {
      "key": "Best for",
      "value": "Backcountry, Big Mountain, Freeride, Powder, Touring"
    },
    {
      "key": "Ski Boot Weight",
      "value": "1,790g (Size 26.5)"
    },
    {
      "key": "Size Run",
      "value": "24.5 - 30.5 Mondopoint"
    },
    {
      "key": "Construction",
      "value": "Cabrio"
    },
    {
      "key": "Flex",
      "value": "130"
    },
    {
      "key": "Last",
      "value": "99"
    },
    {
      "key": "Liner",
      "value": "IF LITE"
    },
    {
      "key": "Strap",
      "value": "Power Strap 40 Mm"
    },
    {
      "key": "Category",
      "value": "Freeride,Freestyle"
    },
    {
      "key": "Age",
      "value": "Adult"
    },
    {
      "key": "Gender",
      "value": "Men's"
    },
    {
      "key": "ISO (SOLE NORM)",
      "value": "ISO 23223"
    }
  ],
  "url": "https://vpo.ca/product/362214/cabrio-lv-free-130-lite"
}