{
  "description": "The LV FREE 105 W freetouring-oriented Cabrio with medium flex is specially designed for all women who enjoy the ascent, but who are looking for a ski boot that combines performance, fit and comfort for changing terrain during the descent. The Instant Fit (IF) Hike PRO W liner ensures an optimal fit, excellent heel support and ample mobility around the ankles. Made of separately produced, partially preformed individual parts, the liner is complemented by Dalbello AUTOFIT technology with a memory foam tongue, and can adapt to any foot shape. The inner workings are rounded off with PuRE (Polyurethane Recycled Enforcement) technology for more comfort and more efficient force transmission to the shell. The outer shell of the boot is based on the Dalbello LV Cabrio platform: the three-part structure of cuff, shaft and external tongue ensures uniform flex, harmonious damping and stable lateral and heel support. The new bi-injected tongue has also been made more user-friendly. Thanks to softer material in the areas that need it, it offers sufficient flexibility and the usual stability during the descent, so it no longer needs to be removed in hike mode. The 105-series boot is also easier to handle thanks to a new ski-walk mechanism so it's easy to switch between ascent and descent modes.",
  "img_hrefs": [
    "https://vpo.ca/images/product/medium/362216.jpg"
  ],
  "name": "Cabrio LV Free 105 - Womens",
  "price_cents": 75000,
  "specs": [
    {
      "key": "Best for",
      "value": "Backcountry, Powder, Touring, Big Mountain, Freeride"
    },
    {
      "key": "Ski Boot Weight",
      "value": "1780 g (Size 24.5)"
    },
    {
      "key": "Size Run",
      "value": "22.5 - 27.5 Mondopoint"
    },
    {
      "key": "Construction",
      "value": "Cabrio"
    },
    {
      "key": "Flex",
      "value": "105"
    },
    {
      "key": "Last",
      "value": "99"
    },
    {
      "key": "Liner",
      "value": "IF HIKE PRO W"
    },
    {
      "key": "Strap",
      "value": "Power strap 40 mm"
    },
    {
      "key": "Category",
      "value": "Freeride,Freestyle"
    },
    {
      "key": "Age",
      "value": "Adult"
    },
    {
      "key": "Gender",
      "value": "Women's"
    },
    {
      "key": "ISO (SOLE NORM)",
      "value": "ISO 23223"
    }
  ],
  "url": "https://vpo.ca/product/362216/cabrio-lv-free-105-womens"
}