{
  "description": "A book-and-card collection of 50 fun outdoor challenges to make any family camping trip one to remember, whatever the weather.&lt;br&gt;&lt;br&gt;Ranging from the silly to the sublime, once you’ve tried any of the 50 challenges in this brilliant book-and-card set, it will become a must-pack for all family camping trips.&lt;br&gt;&lt;br&gt;Featuring 50 boredom-busting ideas, never struggle for something to do on your next camping break with this collection of brilliant challenges. Not only will the cards keep the kids active, engaged, and laughing day or night and whatever the weather, the games are fun for grown-ups to play, too. &lt;br&gt;&lt;br&gt;Challenge themes covered include look-and-find, creative, active, LOL, and more, with each one only ever needing equipment regularly taken on a camping trip or items you can easily find in nature. So whether it’s going on a creepy crawly hunt, taking part in the sleeping bag triathlon, or trying to sing your favorite song around the campfire with eight marshmallows shoved in your mouth, kids and adults are going to love taking part.",
  "img_hrefs": [
    "https://vpo.ca/images/product/medium/362476.jpg"
  ],
  "name": "Camping Games and Activities",
  "price_cents": 2595,
  "specs": [
    {
      "key": "Publisher",
      "value": "‎DK (June 7 2022)"
    },
    {
      "key": "Language",
      "value": "English"
    },
    {
      "key": "Cards",
      "value": "96 pages"
    },
    {
      "key": "Subjects",
      "value": "Activity Cards, Sports &amp; Recreation, Camping, Travel, Special Interest - Family"
    },
    {
      "key": "ISBN-10",
      "value": "‎0744058074"
    },
    {
      "key": "ISBN-13",
      "value": "‎978-0744058079"
    },
    {
      "key": "Item weight",
      "value": "‎510 g"
    },
    {
      "key": "Dimensions",
      "value": "‎13.34 x 3.71 x 16.99 cm"
    }
  ],
  "url": "https://vpo.ca/product/362476/camping-games-and-activities"
}