{
  "description": "Whether you're making service calls or working in the wood shop, you can count on the Bull Run Chelsea for durability and comfort. It has the same rugged design as the original Bull Run, updated with slip-on construction that makes it convenient for electricians and carpenters to slip them on and off when moving from outside to inside. A full-grain leather upper is soft yet durable. The oil-and-slip-resistant outsole keeps you comfortable for long days standing on wood, tile or concrete.",
  "img_hrefs": [
    "https://vpo.ca/images/product/large/341592.jpg"
  ],
  "name": "Danner Bull Run Chelsea - Mens",
  "price_cents": 3150000,
  "specs": [
    {
      "key": "Traction",
      "value": "Oil &amp; Slip Resistant"
    },
    {
      "key": "Footbed",
      "value": "OrthoLite"
    },
    {
      "key": "Shank",
      "value": "Steel"
    },
    {
      "key": "Best For",
      "value": "Indoor Work, All-Around Work"
    },
    {
      "key": "Protection",
      "value": "EH Rated"
    },
    {
      "key": "Safety",
      "value": "ASTM F2892-18 EH"
    },
    {
      "key": "Last Type",
      "value": "503"
    },
    {
      "key": "Lining",
      "value": "Non-Waterproof"
    },
    {
      "key": "Liner",
      "value": "Unlined"
    },
    {
      "key": "Outsole",
      "value": "Danner® Wedge"
    },
    {
      "key": "Recraftable",
      "value": "Yes"
    },
    {
      "key": "Weight",
      "value": "1.4 kg"
    },
    {
      "key": "Height",
      "value": "6 in"
    },
    {
      "key": "Full-Grain, Oiled Leather Upper",
      "value": "After incorporating oil into the tanning process, we take the oiled, full-grain leather and put it through a series of rigorous testing to ensure its strength and durability. This form of leather is more resistant to water and other liquid damage and requires less maintenance over time"
    },
    {
      "key": "Unlined Leather Upper",
      "value": "Lighter weight with cool comfort in warmer temperatures, our unlined leather boots will mold perfectly to your foot"
    },
    {
      "key": "Removable OrthoLite Footbed",
      "value": "Three layers of varying density are combined for maximum cushioning and support. The entire footbed is made of open-cell polyurethane for better heat dissipation and air circulation"
    },
    {
      "key": "Danner Wedge Outsole",
      "value": "The non-marking, oil-and-slip resistant Danner Wedge outsole provides cushioning, lightweight support, traction, and won't track debris. The soft rubber compound is designed for maximum comfort for long days on smooth indoor surfaces, such as concrete and wood. Not recommended for daily use on asphalt"
    },
    {
      "key": "Stitchdown Construction",
      "value": "Handcrafted to provide a wider platform, our legendary stitchdown construction offers increased stability underfoot. Many of our stitchdown boots can be recrafted"
    }
  ],
  "url": "https://vpo.ca/product/341592/bull-run-chelsea-mens"
}