{
  "description": "From the Sierra Nevada to the North Cascades, the Pacific Crest Trail passes through some of the most stunningly beautiful alpine terrain in the world. Let the PCT's mountain passes and dramatic vistas inspire your everyday hikes in the Trail 2650 Campo. It's designed with GORE-TEX Invisible Fit technology to create a waterproof upper that's lightweight, breathable and as comfortable as your favorite pair of running shoes. A Danner Trailguard platform and Vibram Megagrip outsole work together to keep you steady on your feet as you scramble over rocky terrain.",
  "img_hrefs": [
    "https://vpo.ca/images/product/large/360072.jpg"
  ],
  "name": "Danner Trail 2650 Campo 3\" GTX - Mens",
  "price_cents": 3099500,
  "specs": [
    {
      "key": "Leather &amp; Textile Upper",
      "value": "For a highly abrasion resistant upper, we combine durable leather with lightweight, abrasion-resistant textile panels"
    },
    {
      "key": "GORE-TEX (GTX) Invisible Fit",
      "value": "100% waterproof and breathable, Invisible Fit technology bonds the GORE-TEX membrane to the upper to create the same fit, flexibility and feel as non-protected shoes"
    },
    {
      "key": "Removable OrthoLite Footbed",
      "value": "Three layers of varying density are combined for maximum cushioning and support. The entire footbed is made of open-cell polyurethane for better heat dissipation and air circulation"
    },
    {
      "key": "Danner PlyoGo Midsole",
      "value": "Ultra-lightweight EVA provides excellent cushioning with optimal weight savings"
    },
    {
      "key": "Vibram® 460 Outsole",
      "value": "Self-adapting lugs and Vibram’s specially formulated Megagrip compound provide long-wearing resilience with incredible grip on both wet and dry surfaces"
    },
    {
      "key": "EXO Heel System",
      "value": "The lightweight EXO Heel System provides a comfortable, secure fit via an external heel counter"
    },
    {
      "key": "Danner Trailguard",
      "value": "Lightweight and supportive, the Trailguard TPU shank provides stability and underfoot protection on rough, uneven terrain"
    },
    {
      "key": "Dust Gaiter Compatible",
      "value": "This style is designed for use with a dust gaiter to keep debris out of your shoes while you’re on the trail"
    },
    {
      "key": "How It Fits",
      "value": "Inspired from trail running, the DT6 last features an 8mm offset from heel to toe with slightly more width in the forefoot for stability and a good-looking, everyday-wearable aesthetic"
    },
    {
      "key": "Weight",
      "value": "24 oz per pair"
    },
    {
      "key": "Height",
      "value": "3 in"
    },
    {
      "key": "Insulation",
      "value": "Non-Insulated"
    },
    {
      "key": "Footbed",
      "value": "OrthoLite"
    },
    {
      "key": "Shank",
      "value": "TPU"
    },
    {
      "key": "Heel-to-Toe Drop",
      "value": "8mm"
    },
    {
      "key": "Last Type",
      "value": "DT-6"
    },
    {
      "key": "Lining",
      "value": "Waterproof"
    },
    {
      "key": "Liner",
      "value": "GORE-TEX Invisible Fit"
    },
    {
      "key": "Outsole",
      "value": "Vibram® 460"
    },
    {
      "key": "Recraftable",
      "value": "No"
    }
  ],
  "url": "https://vpo.ca/product/360072/trail-2650-campo-3-gtx-mens"
}