{
  "description": "Drawing on decades of experience designing premium hiking boots, Danner originally created the Vertigo boot in 2009. The Vertigo 917 combines classic styling and innovation in a new, modernized boot. The technical Vibram® midsole and outsole, full-grain leather upper and waterproof Gore-Tex® liner make the Vertigo 917 the ideal boot for the urban explorer.",
  "img_hrefs": [
    "https://vpo.ca/images/product/large/315238.jpg"
  ],
  "name": "Danner Vertigo 917 - Mens",
  "price_cents": 2999500,
  "specs": [
    {
      "key": "Full-grain Leather Upper",
      "value": "To ensure its quality, Danner puts the leather through six different tests before making a selection. Danner's full-grain leathers are the strongest and most durable form of leather"
    },
    {
      "key": "Gore-Tex (GTX)",
      "value": "100% waterproof and breathable, Gore-Tex liners ensure that no water gets in, while allowing sweat and moisture to get out"
    },
    {
      "key": "Removable Ortholite Footbed",
      "value": "Three layers of varying density are combined for maximum cushioning and support. The entire footbed is made of open-cell polyurethane for better heat dissipation and air circulation"
    },
    {
      "key": "Vibram® SPE Midsole",
      "value": "This rubberized EVA midsole maintains the same cushioning properties as traditional EVA, but is more durable and won’t break down as easily. This technology enhances rebound, comfort and support"
    },
    {
      "key": "Vibram® 917 Outsole",
      "value": "Exclusive outsole for Danner featuring XS Trek rubber compound for an optimal balance of durability and traction in wet conditions on the trail or city streets."
    },
    {
      "key": "Modernized Stitchdown Construction",
      "value": "Combining traditional stitchdown technique with cup sole construction that allows the boot to keep a wider platform while eliminating the need for a buffed sidewall. This gives these sneaker boots a modern aesthetic and lightweight, flexible finish"
    },
    {
      "key": "Weight",
      "value": "35 oz Per Pair"
    },
    {
      "key": "Height",
      "value": "5 in"
    },
    {
      "key": "Footbed",
      "value": "Ortholite"
    },
    {
      "key": "Shank",
      "value": "Nylon"
    },
    {
      "key": "Last Type",
      "value": "971 Updated"
    },
    {
      "key": "Lining",
      "value": "Waterproof"
    },
    {
      "key": "Liner",
      "value": "Gore-Tex"
    },
    {
      "key": "Outsole",
      "value": "Vibram 917"
    },
    {
      "key": "Recraftable",
      "value": "No"
    }
  ],
  "url": "https://vpo.ca/product/315238/vertigo-917-mens"
}