{
  "description": "Water bottle, check. Day-use permit, check. Dependable hiking boots, check. Designed to take you farther, the Panorama is comfortable and stable. The abrasion-resistant suede upper and Danner Dry waterproof protection keep your feet dry and happy when the trails get muddy. The cushioned EVA midsole requires minimal break-in time and is super comfortable underfoot to keep you going on the trail. A rugged, high-traction outsole keeps your footing secure on rocky or changing terrain.",
  "img_hrefs": [
    "https://vpo.ca/images/product/large/359931.jpg"
  ],
  "name": "Danner Panorama Mid 6\" - Mens",
  "price_cents": 2450000,
  "specs": [
    {
      "key": "Suede Upper",
      "value": "These uppers are made from rich, durable suede."
    },
    {
      "key": "Danner Dry",
      "value": "100% waterproof barrier allows moisture to escape without letting water in, keeping your feet dry and comfortable all day long"
    },
    {
      "key": "Removable OrthoLite Footbed",
      "value": "Three layers of varying density are combined for maximum cushioning and support. The entire footbed is made of open-cell polyurethane for better heat dissipation and air circulation"
    },
    {
      "key": "Danner® Panorama Outsole",
      "value": "The Panorama outsole wraps around the boot providing increased protection around the base of the foot. The large, deep lugs provide stability and traction, particularly in rugged terrain"
    },
    {
      "key": "Protective Rand",
      "value": "For increased durability, we've added a polyurethane-coated leather rand for protection against scuffs and abrasions on the heel and forefoot"
    },
    {
      "key": "How It Fits",
      "value": "Designed for versatility, the DPDX has a low profile for everyday wear. Whether on the trail or urban exploring, this last was built to offer enough room for comfort while maintaining a sleek profile. Ortholite footbed included"
    },
    {
      "key": "Weight",
      "value": "37 oz"
    },
    {
      "key": "Height",
      "value": "6 in"
    },
    {
      "key": "Insulation",
      "value": "Non-Insulated"
    },
    {
      "key": "Footbed",
      "value": "OrthoLite"
    },
    {
      "key": "Last Type",
      "value": "DPDX"
    },
    {
      "key": "Lining",
      "value": "Waterproof"
    },
    {
      "key": "Liner",
      "value": "Danner® Dry"
    },
    {
      "key": "Outsole",
      "value": "Danner® Panorama"
    },
    {
      "key": "Recraftable",
      "value": "No"
    }
  ],
  "url": "https://vpo.ca/product/359931/panorama-mid-6-mens"
}