{
  "description": "More than 120 deliciously modern recipes for day trips, car camping, and backcountry adventuresOffers a fun and easy approach to planning and prepping camp foodThe Dirty Gourmet authors were recently featured in Sunset magazine and other national media “Dirty Gourmet” is really a lifestyle, one that celebrates delicious food, warm company, and outdoor fun. It emerged as a website and blog when friends Aimee Trudeau, Emily Nielson, and Mai-Yan Kwan joined forces to share their love of wilderness, outdoor education experiences, and knowledge of backcountry cooking through classes, workshops, catering events, and easy yet exciting recipes.&lt;br&gt;&lt;br&gt;Now, their new book,Dirty Gourmet: Food for Your Outdoor Adventures, extends their mission to get more people to eat well outdoors and have fun doing it! It emphasizes healthy eating with fresh ingredients, efficient techniques, and global flavors. Breakfast, trail meals, sweet and savory snacks, dinners, appetizers, side dishes, desserts, even refreshing camp drinks—it’s all here! Camp cooks can choose recipes based on the type of activity they are pursuing—from picnics, day hikes, and car camping to backcountry adventures by foot, bike, or paddle—as well as find recipes perfect for large groups.&lt;br&gt;&lt;br&gt;Recipes are organized by activity:&lt;br&gt;Car campers can relax around the fire with Ember Roasted Baba Ghanoush and Mason Jar Sangria before diving into One Pot Pasta Puttanesca and Grilled Green Bean Salad, with Maple Syrup Dumplings for dessert.Day hikers will want to take a break on the trail with Spicy Tofu Jerky and Curried Chickpea Salad or maybe a Pressed Sandwich with Sundried Tomato Pesto.Backpackers can start their day with Fried Grits Scramble with Greens, Leeks, and Bacon and recharge in the evening with Soba Noodles with Sweet Chili Chicken and a Hibiscus Chia Cooler. To simplify packing and planning, each section offers a base kit checklist of needed supplies along with tips on getting organized, preparing ingredients, and cooking with different methods. Complemented by full-color photos, each recipe features insights from the authors, any additional tools needed, quick-reference icons, step-by-step instructions for what to prepare at home and in camp, plus creative variations.",
  "img_hrefs": [
    "https://vpo.ca/images/product/medium/362359.jpg"
  ],
  "name": "Dirty Gourmet",
  "price_cents": 3795,
  "specs": [
    {
      "key": "Publisher",
      "value": "‎Skipstone; Illustrated edition (April 1 2018)"
    },
    {
      "key": "Language",
      "value": "‎English"
    },
    {
      "key": "Paperback",
      "value": "‎256 pages"
    },
    {
      "key": "ISBN-10",
      "value": "‎1680511297"
    },
    {
      "key": "ISBN-13",
      "value": "978-1680511291"
    },
    {
      "key": "Item weight",
      "value": "‎635 g"
    },
    {
      "key": "Dimensions",
      "value": "‎17.78 x 1.52 x 21.34 cm"
    }
  ],
  "url": "https://vpo.ca/product/362359/dirty-gourmet"
}