{
  "description": "The new Duke PT 13 with a DIN 4-13 combines the performance of a Griffon with comfortable uphill properties of a pin binding. An absolute highlight is the innovative Ride &amp; Hike toe. For walking mode the upper part is simply unlocked and tilted forward, uncovering the pin binding. To save swing weight the upper jaw part can be taken off and stored in a backpack. The multi functional Lock &amp; Walk unit automatically locks the brakes and provides a 10° climbing aid. For downhill mode the front jaw section is clicked back onto the base plate, quadruple secured by the Auto Quad Lock technology. Now the toe piece works just like an alpine toe with all of its advantages! The heel is the latest generation of Inter Pivot heels. The low height of 24 mm allows for direct power transmission and fast edge changes. Thanks to Multinorm all Duke PT are compatible to alpine, touring and GripWalk boots.&lt;br&gt;&lt;br&gt;",
  "img_hrefs": [
    "https://vpo.ca/images/product/medium/362984.jpg"
  ],
  "name": "Duke PT 13",
  "price_cents": 89995,
  "specs": [
    {
      "key": "Hightlights",
      "value": "Duke PT"
    },
    {
      "key": "Best For",
      "value": "Freeride , Freetour"
    },
    {
      "key": "Boot Type",
      "value": "Alpine , GripWalk , Touring"
    },
    {
      "key": "Stand Height w/ Ski",
      "value": "24"
    },
    {
      "key": "AFD Gliding Plate",
      "value": "Stainless steel"
    },
    {
      "key": "Toe System",
      "value": "Ride &amp; Hike"
    },
    {
      "key": "Boot Sole Range",
      "value": "240 mm - 380 mm"
    },
    {
      "key": "Walking Modes",
      "value": "0°;10°"
    },
    {
      "key": "Heel Adjustment Range",
      "value": "60"
    },
    {
      "key": "TÜV Approved",
      "value": "Yes"
    },
    {
      "key": "Binding Weight",
      "value": "1000g (uphill) 1300g (downhill)"
    },
    {
      "key": "DIN/ISO Range",
      "value": "DIN 4.0 - 13.0"
    },
    {
      "key": "HEEL Technology",
      "value": "Inter Pivot 3"
    },
    {
      "key": "Recommended Skiers Weight",
      "value": "&lt;120 kg"
    },
    {
      "key": "Category",
      "value": "Freeride"
    },
    {
      "key": "Ride &amp; Hike Toe",
      "value": "Great Royal Family downhill performance and release function combined with pin-technology for strong uphill performance. For walking mode the upper part is simply unlocked and tilted forward, uncovering the pin binding. Thanks to this convertible toe 300g per foot can be saved for the ascent"
    },
    {
      "key": "Inter Pivot 3 Freeride Heel",
      "value": "The third and newest generation completely redone"
    },
    {
      "key": "Anti Ice Rail",
      "value": "Use the metal rail to scratch off ice and snow below your boot sole"
    },
    {
      "key": "Gliding AFD",
      "value": "All MARKER bindings are equipped with a moveable AFD (anti friction device) leading to a highly precise release almost entirely unhindered by dirt, snow and ice! Individual adjustment of the AFD to the area of application ensures perfect functionality - from racing, for children’s bindings or on ski tours"
    },
    {
      "key": "Auto Quad Lock",
      "value": "Toe part locks itself at 4 different points automatically when stepping into the binding"
    }
  ],
  "url": "https://vpo.ca/product/362984/duke-pt-13"
}