{
  "description": "Versatile and robust, Salomon's Escape Outback is a waxless backcountry ski designed to help you tackle even the most remote paths. Get them on and venture where no one else has ventured before! &lt;br&gt;&lt;br&gt;Push boundaries with gear that matches your expertise. Our high-performance skis deliver optimal glide and acceleration. Responsive boots offer superior energy transfer, while advanced bindings provide micro-adjustments. Elevate your experience with top-tier gear that lets you excel on any terrain.&lt;br&gt;&lt;br&gt;Discover efficient classic skiing with fishscale technology. Specially patterned ski base ensures reliable grip without grip wax. Experience smooth movement and traction on diverse snow. Enjoy simplified skiing with performance intact.",
  "img_hrefs": [
    "https://vpo.ca/images/product/medium/362078.jpg"
  ],
  "name": "Escape Outback 68 Posi Flat Skis",
  "price_cents": 41900,
  "specs": [
    {
      "key": "Performance Grinding",
      "value": "Low pressure, robust stone grinding for easy glide in all snow conditions"
    },
    {
      "key": "Mid Length",
      "value": "More control and stability, especially when descending out of the tracks"
    },
    {
      "key": "S-Cut",
      "value": "Light carving sidecut behind the foot and a wider platform at the frontfoot provide more control and stability, especially when descending out of the tracks"
    },
    {
      "key": "Steel Edge",
      "value": "The full-steel edges offer extra stability when venturing out of track"
    },
    {
      "key": "G1 base",
      "value": "Solid base"
    },
    {
      "key": "WoodCore",
      "value": "Stable wood core with plastic reinforcement and fiberglass wrap"
    },
    {
      "key": "Posigrip",
      "value": "Embossed pattern for secure grip"
    },
    {
      "key": "Tip",
      "value": "68mm"
    },
    {
      "key": "Waist",
      "value": "60mm"
    },
    {
      "key": "Tail",
      "value": "65mm"
    },
    {
      "key": "Weight",
      "value": "2.06 kg, Pair with plate"
    }
  ],
  "url": "https://vpo.ca/product/362078/escape-outback-68-posi-flat-skis"
}