{
  "description": "&lt;p&gt;Salomon's Escape Outback Vario is a lightweight, reliable, aluminum pole with easy-to-adjust height designed to help you make the most of your touring adventures. It features a comfortable grip and all-conditions basket so you can stay comfortable even on longer outings. &lt;br&gt;&lt;br&gt;Nordic backcountry poles, are designed for off-trail and backcountry skiing adventures. They are robust and provide enhanced stability and support for maneuvering through deep snow conditions. They are usually made of durable materials like aluminum or high-strength composite materials to withstand the rigors of BC skiing.&lt;/p&gt; &lt;p&gt;Experience harmonious skiing with balanced pendulum poles. These poles offer refined forward and backward movement, ensuring smooth and controlled strides. Perfect for skiers aiming to enhance their technique and rhythm on varied terrains. Elevate your performance with poles that offer a harmonious skiing experience.&lt;br&gt;&lt;br&gt;Unleash power and precision with stiff rigidity Nordic poles. Engineered for optimal power transmission, these poles provide enhanced performance for dynamic strides. Perfect for skiers aiming to maximize their speed and efficiency. Elevate your skiing with poles that match your drive for peak performance.&lt;br&gt;&lt;/p&gt;",
  "img_hrefs": [
    "https://vpo.ca/images/product/medium/362348.jpg"
  ],
  "name": "Escape Outback Vario Poles",
  "price_cents": 12900,
  "specs": [
    {
      "key": "Asymetrical basket",
      "value": "This off-centered basket is the ideal choice for Nordic backcountry skiing"
    },
    {
      "key": "ALU*** 16 - Alu*** 14/11",
      "value": "The shaft is split in two"
    },
    {
      "key": "EVA Escape",
      "value": "The Eva Grip with foam on the handle guarantees a more comfortable grip during your Nordic escapes"
    },
    {
      "key": "Weight (Pair)",
      "value": "235 g"
    },
    {
      "key": "Skill Level",
      "value": "Intermediate"
    }
  ],
  "url": "https://vpo.ca/product/362348/escape-outback-vario-poles"
}