{
  "description": "Designed for cold environments, anywhere from mountain climbs to trail walks.&lt;br&gt;&lt;br&gt;A boot sock for mountain hikers and walkers who enjoy the trails when the mercury plummets, the Explorer Merino Comfort provides all the support and warmth you need for cold-weather adventures. With thick cushioning for warmth, a soft-knit cuff for comfort and double density pads beneath your feet for all-day impact resistance. Featuring Merino Comfort Fusion Technology that creates a soft, fast-drying, unrestrictive and durable sock. Their Comfort Fit features a super stretchy ribbed cuff around your calf allowing the sock to be worn comfortably up or down. The toe box is closed with an almost invisible Flat Toe Seam minimising bulk around your toes whilst the sock is kept securely in place with an Elasticated Arch and 3D-shaped heel cup. Built on a structure of Lycra®, allows their Thermo Fit process to ensure the sock returns to its original shape and size after every wash. This is the perfect sock for exploring hills and mountains in sub-zero temperatures. &lt;br&gt;&lt;br&gt;Explorer Socks:&lt;br&gt;Their Explorer socks is designed to be worn in the coldest conditions where warmth, cushioning and comfort are vital. Fusion Technology provides remarkable insulation while wicking moisture away from the feet. Explorer is not just for winter walkers and mountaineers it is also produced with the outdoor professional mind who demands the most comfortable socks in the coldest, harshest conditions. This range is best suited to Winter walkers, Alpine mountaineers, Winter explorers and anyone who is outdoors in subzero temperature.",
  "img_hrefs": [
    "https://vpo.ca/images/product/medium/362709.jpg"
  ],
  "name": "Explorer Heavyweight Merino Comfort Boot Socks - Mens",
  "price_cents": 3995,
  "specs": [
    {
      "key": "Materials",
      "value": "30% Merino Wool , 45% Coolmax®"
    },
    {
      "key": "Fit",
      "value": "Boot"
    }
  ],
  "url": "https://vpo.ca/product/362709/explorer-heavyweight-merino-comfort-boot-socks-mens"
}