{
  "description": "Warm women's ski glove in a shorter mitten model, a favourite with many freeriders looking for a mitten that fits handily inside a jacket sleeve. Sewn in treated cowhide with warming synthetic insulation, it's equally comfortable on and off-piste, from pre-season to hiking tours in spring. This mitt has a 5-finger lining.&lt;br&gt;&lt;br&gt;The Fall Line Mitt is a warm mitten for freeriding, here in a women's version with a slimmer cut to fit women's narrower hands. The mitten version is ideal if you need an extra warm glove, and it's sewn in hardwearing treated cowhide* with a pre-curved fit for comfort and good pole grip. The inside is in soft fleece with warming synthetic insulation, while foam panels provide extra warmth and stability. Technical details contribute to practical functionality on the mountain. For example, there is a wrist strap to reduce the risk of dropping a glove if you need to take it off. And an included carabiner enables the gloves to be secured to a jacket or backpack when not in use. Perfect for those who prefer on-piste just as much as off-piste and aren't afraid of a bit of a hike to get off the beaten track. Also available in a 5-finger model, and in a man's version. &lt;br&gt;&lt;br&gt;* Colour 000 white is sewn in goatskin leather.&lt;br&gt;&lt;br&gt;",
  "img_hrefs": [
    "https://vpo.ca/images/product/medium/360609.jpg"
  ],
  "name": "Fall Line Mitts - Womens",
  "price_cents": 19995,
  "specs": [
    {
      "key": "Outer",
      "value": "Impregnated cowhide"
    },
    {
      "key": "Insulation",
      "value": "G-loft polyester - G-Loft is a very thin 100% polyester fiber with exceptionally high insulating capacity, even in wet conditions. G-Loft is quick drying, breathable and very compressive"
    },
    {
      "key": "Lining",
      "value": "Durable lining with a soft feeling. The brushed surface binds more air which provides a better insulation. 100% polyester"
    },
    {
      "key": "Activities",
      "value": "Skiing, Ski touring, Snowboard"
    }
  ],
  "url": "https://vpo.ca/product/360609/fall-line-mitts-womens"
}