{
  "description": "The Fieldsheer® powered by Mobile Warming® heating technology Backcountry Men's Heated Vest is their new synthetic down puffer Heated Vest available in 2 color options and featuring a new low-profile 7.4-volt battery. With a Waterpell™ water-resistant nylon outer shell, and at its core, our tried and true Mobile Warming® 7.4-volt heating system is enhanced with Primaloft® synthetic down insulation. Primaloft® is a down alternative made from recycled materials into ultra-fine insulative fibers. <br><br>The Backcountry is stylish enough to wear on its own during day-to-day use, but light and amply compressible to also wear as a base layer under your favorite rain or snow Heated Vest. The Backcountry 7.4-volt heating system can provide heating temperatures ranging from 135°F on high to 90°F on low. On high, expect up to 2+ hours of heat, and on low it can heat up to 10 hours! Temperature control is simple with 2 ways to adjust the heat. First, the built-in waterproof touch control button. With a simple button push, it lets you choose from 4 instant heat settings with multi-colored LED indicator. Plus, we’ve incorporated Bluetooth® control with our proprietary, free to download via App Store® or Google Play Store®, MW Connect™ app. Through the free MW Connect™ app, you can quickly toggle through all connected Fieldsheer® powered by Mobile Warming® technology garments and adjust individual heat levels to your liking. MW Connect™ app allows you to get real-time updates on battery levels and update your garments when new firmware becomes available. The Backcountry comes as a complete package with a 7.4-volt battery, charger, and stow bag. The Backcountry provides instant heat when the weather turns cold, keeping you outdoors and enjoying your favorite activity.<br><br>The Backcountry Heated Vest is powered by our Powersheer™ 7.4-volt Rechargeable Lithium-Ion Battery (7.4V 2200mAh) – Reliable power in a compact streamlined package. The Universal Micro USB (5V@2A) to USB cable allows for convenient charging anywhere you go. The 7.4V DC output port is compatible with all of our 7.4V heated gear.",
  "img_hrefs": [
    "https://vpo.ca/images/product/large/341673.jpg"
  ],
  "name": "Fieldsheer Canada Backcountry Heated Vest - Mens",
  "price_cents": 2299500,
  "specs": [
    {
      "key": "Multi-Zone Heat Zones",
      "value": "Left &amp; Right Chest, Upper Back"
    },
    {
      "key": "Footnote",
      "value": "Charge time is based off using a USB-A wall charger that delivers 5V@2.1A"
    }
  ],
  "url": "https://vpo.ca/product/341673/backcountry-heated-vest-mens"
}