{
  "description": "The Fieldsheer® powered by Mobile Warming® heating technology Peak BT Heated Vest is a low-cost unisex Heated Vest that is favored by many for its light design that allows it to function as either an outer shell or a baselayer. Engineered to keep outside elements out, the Peak Heated Vest is constructed with Windshark®, a Fieldsheer® fabric technology designed to take on moderate weather, and a comfortable 4-way stretch material. Look to this highly breathable lightweight Heated Jacket to provide a water- and wind-resistant shell. The mid-weight Peak BT Heated Vest is thick enough to be worn as your outer layer and thin enough to be used under a larger ski Heated Jacket or heavy work coat.<br><br>The Peak BT Heated Vest has integrated, concealed heating panels powered by a sturdy yet lightweight 7.4-volt Mobile Warming® heating system. The 7.4-volt system has 3 heating zones, one on the back and 2 on the chest, that add heat to critical areas that keep your core warm. The Peak BT 7.4-volt heating system can provide temperatures ranging from 135°F on high to 90°F on low. On high, expect up to 2 hours of heat on high, and on low, the Peak BT can provide heat for up to 10 hours! The Peak BT has 2 ways to adjust the temperature. First, the built-in waterproof touch control button. With a simple button push, it lets you choose from 4 instant heat settings with multi-colored LED indicator. Plus,&nbsp;they've incorporated Bluetooth® control with our proprietary, free to download via App Store® or Google Play Store®, MW Connect™ app. Through the free MW Connect™ app, you can quickly toggle through all connected Fieldsheer® powered by Mobile Warming® technology garments and adjust individual heat levels to your liking. MW Connect™ app allows you to get real-time updates on battery levels and update your garments when new firmware becomes available. Throw it on under your camo, snow-Heated Jacket, uniform, or just wear it to the next ball game. The Peak BT Heated Vest is ready for any event.<br><br>The Peak Heated Vest is powered by our Powersheer™ 7.4-volt Rechargeable Lithium-Ion Battery (7.4V 2200mAh) – Reliable power in a compact streamlined package. The Universal Micro USB (5V@2A) to USB cable allows for convenient charging anywhere you go. The 7.4V DC output port is compatible with all of our 7.4V heated gear. <br><br>**This garment runs small.&nbsp;Fieldsheer recommends you consult their size charts before purchasing and consider sizing up.",
  "img_hrefs": [
    "https://vpo.ca/images/product/large/341675.jpg"
  ],
  "name": "Fieldsheer Canada Peak Heated Vest",
  "price_cents": 1599500,
  "specs": [
    {
      "key": "Footnote",
      "value": "Charge time is based off using a USB-A wall charger that delivers 5V@2.1A"
    }
  ],
  "url": "https://vpo.ca/product/341675/peak-heated-vest"
}