{
  "description": "Wind and water-resistant three-layer shell trousers for year-round use in changeable weather conditions. Made from stretchy Eco-Shell for high performance and the lowest possible environmental impact. The fabric is hardwearing at the same time as it follows body movements and ventilates out moisture that builds up inside when you are active. A perfect choice for trekking and summit touring in difficult terrain – the minimalistic design makes moving forward easier while you have complete protection from the elements.<br><br>The cut is carefully thought through and pre-shaped knees and rear give maximum freedom of movement. The cut is adapted so they can be worn over a pair of trekking trousers made from G-1000, for example. Long two-way water-resistant zippers at the sides release excess heat and make putting on/taking off easy. The waist has a velcro adjustment at the side and a belt with an easy-to-handle flat buckle that sits well under a climbing harness or backpack hipbelt.<br><br>Two pockets with zippers keep small items close at hand. Cordura reinforcements at the leg endings and on the inside lower legs protect against wear from boots and crampons. At the bottom there is a button and a hidden drawstring to adjust the width of the legs.<br><br>Eco-Shell is a water-resistant, breathable and sustainable hardshell fabric that is treated with fluorocarbon-free impregnation. Eco-Shell is made from recyclable polyester (both recycled and new), and all emissions during production and transport are climate compensated.",
  "img_hrefs": [
    "https://vpo.ca/images/product/large/313441.jpg"
  ],
  "name": "Fjallraven Keb Eco-Shell Trousers - Mens",
  "price_cents": 5250000,
  "specs": [
    {
      "key": "Main",
      "value": "Eco-Shell 3-layer Stretch"
    },
    {
      "key": "Membrane",
      "value": "100% polyester"
    },
    {
      "key": "Water column",
      "value": "30,000 mm"
    },
    {
      "key": "Breathability",
      "value": "26,000 g"
    },
    {
      "key": "Weight",
      "value": "660 g"
    },
    {
      "key": "Reinforcements",
      "value": "Yes"
    },
    {
      "key": "Inseam",
      "value": "Regular"
    },
    {
      "key": "Leg ending",
      "value": "Fixed length"
    },
    {
      "key": "Leg type",
      "value": "Full Leg"
    }
  ],
  "url": "https://vpo.ca/product/313441/keb-eco-shell-trousers-mens"
}