{
  "description": "Pliant, technical jacket for demanding adventures in changeable weather conditions all year round. Made from stretchy Eco-Shell for high performance and low environmental impact. The material is hardwearing at the same time as it naturally follows the movement of the body and ventilates out moisture that builds up inside when you are active. A perfect choice for trekking and ski touring, where the jacket’s minimalistic design facilitates the push forward at the same time as you have reliable protection even in really bad weather. The cut is carefully worked through for a perfect fit and freedom of movement. The well-fitting hood has room for a helmet and can be adjusted for good protection without limiting vision or movement of the head. The jacket opening has a two-way water-resistant zipper with an inside protective flap, which is easy to open at both ends for ventilation. The spacious chest pockets with hidden bellows are accessible even when you are wearing a climbing harness or backpack with hipbelt, and they have elastic mesh inner pockets that keep a mobile phone and other small items in place. Two-way zippers at the sides release excess heat. The hem can be adjusted with a draw-cord and the sleeve cuffs with Velcro. Eco-Shell is a waterproof, breathable and sustainable hardshell fabric that is treated with fluorocarbon-free impregnation. Eco-Shell is made from recyclable polyester (both recycled and new), and all emissions during production and transport are climate compensated.",
  "img_hrefs": [
    "https://vpo.ca/images/product/large/313439.jpg"
  ],
  "name": "Fjallraven Keb Eco-Shell Jacket - Mens",
  "price_cents": 6250000,
  "specs": [
    {
      "key": "Material",
      "value": "Eco-Shell 3-layer Stretch"
    },
    {
      "key": "Membrane",
      "value": "100% polyester"
    },
    {
      "key": "Water column",
      "value": "30,000 mm"
    },
    {
      "key": "Breathability",
      "value": "26,000 g"
    },
    {
      "key": "Weight",
      "value": "520 g"
    }
  ],
  "url": "https://vpo.ca/product/313439/keb-eco-shell-jacket-mens"
}