{
  "description": "Maximum safety with optimal freedom of movement. The Free Vest 15 Removable Airbag 3.0 is lightweight, compact and has room for the equipment you need to stay safe when freeriding. Our Airbag System 3.0 is dependable, long-lasting and one of the lightest on the market. Orange elements make you more visible from a distance. The vest fits tightly to keep the weight from bouncing around while still allowing you to move freely. &lt;br&gt;&lt;br&gt;The 3D-molded back panel ensures excellent comfort and a perfect fit. Attach your skis or snowboard using the pull straps. Keep your safety equipment in the high-visibility orange main compartment. The vest is PFC-free, and both the outer fabric and lining are made of recycled material. To top it all off, the Free Vest 15 has useful features that include a helmet holder, side compression straps and loops for poles. Feel safe. Feel free. The pleasure of untracked powder.&lt;br&gt;&lt;br&gt;***Note: Cartridge sold separately",
  "img_hrefs": [
    "https://vpo.ca/images/product/medium/350285.jpg"
  ],
  "name": "Free Vest 15 Removable Airbag 3.0 - XS-M (Cartridge Not Included)",
  "price_cents": 101500,
  "specs": [
    {
      "key": "Materials",
      "value": "420D Nylon Oxford HD"
    },
    {
      "key": "Airbag system",
      "value": "Removable Airbag System"
    },
    {
      "key": "Filling time",
      "value": "3 sec"
    },
    {
      "key": "Cartridge included",
      "value": "No"
    },
    {
      "key": "Capacity",
      "value": "15 L"
    },
    {
      "key": "Length",
      "value": "10 cm"
    },
    {
      "key": "Height",
      "value": "52 cm"
    },
    {
      "key": "Back Length",
      "value": "43.5 cm"
    },
    {
      "key": "Width",
      "value": "28 cm"
    },
    {
      "key": "Backpack only",
      "value": "1255 g"
    },
    {
      "key": "Backpack and Airbag",
      "value": "1955 g"
    },
    {
      "key": "Backpack contains Removable Airbag System 3.0 (compressed air cartridge not included)",
      "value": "dependable, light and compact system with height-adjustable deployment handle and vibrant orange airbag balloon. System transferable between compatible backpacks."
    }
  ],
  "url": "https://vpo.ca/product/350285/free-vest-15-removable-airbag-30-xs-m-cartridge-not-included"
}