{
  "description": "Modern styling, light and multifunctional – the Blueridge Low ES is a lightweight hiking shoe for a range of uses, loaded with innovative sustainability features. Such as the use of durable, highest-quality Perwanger leather for the upper, or the `Global Recycling Standard´100% recycled fabric element of the upper, and the PFC-free waterproof membrane. <br><br>Waterproof, breathable, sustainable – HANWAG designed its proprietary PU membrane based on a complex, hydrophilic system that achieves waterproofing and breathability without the use of fluorocarbons. This is applied in a sturdy three-layer laminate. All materials are sourced from European suppliers and the shoe is made entirely in Europe. But durability and sustainability don’t have to come at the cost of functionality and comfort. And the Blueridge Low ES’s perfect fit and newly developed midsole proves it! <br><br>The raised edge of the sole made of stabilising PU offers greater support on all sides and at the heel. With a non-slip ‘Terragrip’ outsole with four-millimetre-deep tread, extra-large lugs and wider contact area, the heel strike and roll-off performance are effortless and smooth. This makes the modern-styled Blueridge Low ES at home on a range of hiking trails – from damp, autumnal foothills through to sandy, Mediterranean coastal hikes.<br><br>*** All Hanwag boots are sold under UK sizing - Please see size chart for details/conversion",
  "img_hrefs": [
    "https://vpo.ca/images/product/large/344419.jpg"
  ],
  "name": "HanWag Blueridge Low ES - Mens",
  "price_cents": 2080000,
  "specs": [
    {
      "key": "Membrane",
      "value": "EcoShell Footwear"
    },
    {
      "key": "Upper material",
      "value": "Suede, Textile"
    },
    {
      "key": "Outer sole",
      "value": "Hanwag Hike Pro"
    },
    {
      "key": "Lining",
      "value": "EcoShell Footwear"
    },
    {
      "key": "Weight",
      "value": "2 lbs 2.5 oz"
    },
    {
      "key": "Field of Application",
      "value": "Hike, Trekking"
    },
    {
      "key": "Cut",
      "value": "Low"
    },
    {
      "key": "ABCD Category",
      "value": "AB"
    },
    {
      "key": "Materials",
      "value": "High-quality Perwanger leather and robust polyamide upper fabric"
    }
  ],
  "url": "https://vpo.ca/product/344419/blueridge-low-es-mens"
}