{
  "description": "The Makra Light GTX from Hanwag’s Makra family is an agile all-rounder in the ideal height for via ferratas and straightforward alpine tours. And it’s very versatile too. Because footwear to see you safely over iron pins, ladder rungs and rocky ledges has to be particularly solid to be able to withstand the constant loading. At the same time, it has to provide the wearer with a good ‘feel’ for the terrain underfoot. And if it’s going to be comfortable going uphill and downhill, then it has to be built on a well cushioned base that promotes good roll-off performance. <br><br>But that’s not all the mid-cut Makra Light GTX can do. It’s designed for mountain enthusiasts who appreciate the benefits of a low-cut model on the ascents but are unwilling to do away with the additional stability offered by a mid-cut design on the descents. By incorporating a special 2-zone lacing system with mechanical lace lock system, the upper is easily adapted to the demands of the terrain in question. Unlike conventional clamping lace hooks, this mechanical style of lace lock won’t slip once it’s locked in place – it requires manual intervention to unlock it. <br><br>This makes it possible to have tighter lacing at the ankle and more relaxed lacing at the upper section of the boot, for instance, for greater freedom of movement on ascents or when climbing. While on the descents, the entire lacing can be locked down above the ankle too, for greater stability. In addition to a flexible, adjustable upper, the Makra Light GTX also has a particularly lightweight, cushioning midsole that provides the stability required for demanding terrain.<br><br>*** All Hanwag boots are sold under UK sizing - Please see size chart for details/conversion",
  "img_hrefs": [
    "https://vpo.ca/images/product/large/344415.jpg"
  ],
  "name": "HanWag Makra Light GTX - Mens",
  "price_cents": 3900000,
  "specs": [
    {
      "key": "Membrane",
      "value": "Gore-Tex"
    },
    {
      "key": "Upper material",
      "value": "Suede, Textile"
    },
    {
      "key": "Outer sole",
      "value": "Vibram®Makra EVA"
    },
    {
      "key": "Lining",
      "value": "Gore-Tex"
    },
    {
      "key": "Weight",
      "value": "2 lbs 3.3 oz"
    },
    {
      "key": "Field of Application",
      "value": "Rockclimbing"
    },
    {
      "key": "Cut",
      "value": "Mid"
    },
    {
      "key": "Robust material mix",
      "value": "Perwanger split leather and TPU toe protection"
    }
  ],
  "url": "https://vpo.ca/product/344415/makra-light-gtx-mens"
}