{
  "description": "Modern styling, light and multifunctional – the Blueridge ES is a lightweight hiking shoe for a range of uses, loaded with innovative sustainability features. Such as the use of durable Perwanger leather for the upper, or the `Global Recycling Standard´ 100% recycled fabric element of the upper, and the PFC-free waterproof membrane. Waterproof, breathable, sustainable – HANWAG designed its proprietary PU membrane based on a complex, hydrophilic system that achieves waterproofing and breathability, without the use of fluorocarbons. This is applied in a sturdy three-layer laminate. All materials used for the Blueridge ES are sourced from European suppliers and it’s entirely made in Europe. <br><br>But durability and sustainability don’t have to come at the cost of functionality and comfort. And the Blueridge ES’s perfect fit and newly developed midsole goes to prove it! The midsole has a three-dimensional structure made of compact and expanded polyurethane that cups the foot for all-round comfort. The raised edge of the sole made of stabilising PU offers greater support on all sides and at the heel. Thermoformed PU foam in the HANWAG 3D-BreathFit tongue compensates for the anatomically asymmetrical shape of the foot with asymmetric padding and adapts to the individual shape of your feet. <br><br>With a non-slip ‘Terragrip’ outsole with four-millimetre-deep tread, extra-large lugs and wider contact area, the heel strike and roll-off performance are effortless and smooth. This makes the modern-styled Blueridge ES at home on a range of terrain – from damp, autumnal foothills through to sandy, Mediterranean coastal hikes.<br><br>*** All Hanwag boots are sold under UK sizing - Please see size chart for details/conversion",
  "img_hrefs": [
    "https://vpo.ca/images/product/large/344413.jpg"
  ],
  "name": "HanWag Blueridge ES - Mens",
  "price_cents": 3100000,
  "specs": [
    {
      "key": "Membrane",
      "value": "EcoShell Footwear"
    },
    {
      "key": "Upper material",
      "value": "Suede, Textile"
    },
    {
      "key": "Outer sole",
      "value": "Hanwag Hike Pro"
    },
    {
      "key": "Lining",
      "value": "EcoShell Footwear"
    },
    {
      "key": "Weight",
      "value": "2 lbs 7.5 oz"
    },
    {
      "key": "Activity",
      "value": "Hiking, Trekking"
    },
    {
      "key": "Cut",
      "value": "Mid"
    },
    {
      "key": "Materials",
      "value": "High-quality Perwanger leather and robust polyamide upper fabric"
    }
  ],
  "url": "https://vpo.ca/product/344413/blueridge-es-mens"
}