{
  "description": "Stiff, powerful, and designed for hard-charging skiing, the Atomic Hawx Prime 130 S GW is a medium-width ski boot for serious skiers. It features Prolite, a revolutionary light shell construction with added reinforcements in key zones for a powerful skiing performance. Customize the fit and feel with Power Shift adjustable forward lean and flex, and Mimic Platinum liners that conform to the precise shape of your foot. The 3D Stretch Toe Box brings added comfort with its “Big Toe Friendly” construction allowing extra length within the liner length where needed. Cantable GripWalk Grip Pads offer more traction for walking, while delivering the power transfer of a standard alpine sole. For strong all-mountain skiers who need the width of a 100mm last – this is a high-performance all-mountain boot.",
  "img_hrefs": [
    "https://vpo.ca/images/product/medium/362340.jpg"
  ],
  "name": "Hawx Prime 130 S GW Ski Boots - Unisex",
  "price_cents": 79995,
  "specs": [
    {
      "key": "Prolite",
      "value": "Revolutionary light construction with supportive reinforcements in key zones"
    },
    {
      "key": "Memory Fit",
      "value": "Advanced heat-fitting technology creates a fully personalized shell, cuff and liner in minutes"
    },
    {
      "key": "Power Shift",
      "value": "Independently adjust forward lean to 13° or 15° or 17° as well as the flex index"
    },
    {
      "key": "Mimic",
      "value": "Special heat-moldable plastic in heel, ankle, tongue and cuff areas mimic the shape of your foot"
    },
    {
      "key": "100mm Medium Last",
      "value": "Legendary Hawx Feel, this highly anatomical 100mm last is the gold standard for medium fit boots"
    },
    {
      "key": "Prolite",
      "value": "Revolutionary light construction with supportive reinforcements in key zones"
    },
    {
      "key": "Power Shift",
      "value": "Independently adjust forward lean to 13° or 15° or 17° as well as the flex index"
    },
    {
      "key": "Energy Backbone",
      "value": "Reinforcement in key zones giving extra strength and edge grip for powerful skiing"
    },
    {
      "key": "True Flex PU / PU",
      "value": "This Atomic-exclusive shell material provides the same flex in a wide variety of temperatures"
    },
    {
      "key": "Cantable GripWalk Grip Pads",
      "value": "Fitting current Hawx Ultra, Prime &amp; Magna, these GripWalk pads allow the use of canting shims"
    },
    {
      "key": "Weight / Boot (Size)",
      "value": "1812 g"
    },
    {
      "key": "Boot Fit",
      "value": "Medium"
    },
    {
      "key": "Skill Level",
      "value": "Expert"
    }
  ],
  "url": "https://vpo.ca/product/362340/hawx-prime-130-s-gw-ski-boots-unisex"
}