{
  "description": "The Atomic Hawx Prime XTD 115 W GW blends all mountain skiing and freeride touring into this 100mm medium last crossover boot. The stiffest and highest performing boot in the women’s Prime XTD family, it uses Prolite, a shell construction that starts with the lightest profile possible and then adds reinforcement to critical energy zones to create a super robust boot that delivers supremely powerful skiing. The heat-moldable Mimic Platinum liner and Memory Fit shell allow for complete customization of the cuff, shell and liner. The cuff offers 54º range of motion to deliver epic natural movement for easy walking and more comfort when standing upright. The removable Adaptive Fit System (AFS) Cuff spoiler increases the amount of tulip-shape and volume inside of the cuff to accommodate different sized calves. The GripWalk Sole is compatible with all GripWalk, MN, MNC and Pin bindings. Extremely powerful, this is the ideal boot for those excited to ski the entire mountain.",
  "img_hrefs": [
    "https://vpo.ca/images/product/medium/362347.jpg"
  ],
  "name": "Hawx Prime XTD 115 GW Ski Boots - Womens",
  "price_cents": 85000,
  "specs": [
    {
      "key": "Memory Fit",
      "value": "Advanced heat-fitting technology creates a fully personalized shell, cuff and liner in minutes"
    },
    {
      "key": "Adaptive Fit System (AFS) Cuff",
      "value": "A removeable cuff spoiler that increases the amount of tulip-shape and volume inside of the cuff"
    },
    {
      "key": "Mimic",
      "value": "Special heat-moldable plastic in heel, ankle, tongue and cuff areas mimic the shape of your foot"
    },
    {
      "key": "100mm Medium Last",
      "value": "Legendary Hawx Feel, this highly anatomical 100mm last is the gold standard for medium fit boots"
    },
    {
      "key": "Prolite",
      "value": "Revolutionary light construction with supportive reinforcements in key zones"
    },
    {
      "key": "Frictionless Pivot",
      "value": "Igus polymer bushings provide a completely natural movement for effortless ascents"
    },
    {
      "key": "Free/Lock 4.5",
      "value": "Atomic's sturdiest ski"
    },
    {
      "key": "Energy Backbone",
      "value": "Reinforcement in key zones giving extra strength and edge grip for powerful skiing"
    },
    {
      "key": "True Flex PU / PU",
      "value": "This Atomic-exclusive shell material provides the same flex in a wide variety of temperatures"
    },
    {
      "key": "Weight / Boot (Size)",
      "value": "1695 g"
    },
    {
      "key": "Boot Fit",
      "value": "Medium"
    },
    {
      "key": "Skill Level",
      "value": "Expert"
    }
  ],
  "url": "https://vpo.ca/product/362347/hawx-prime-xtd-115-gw-ski-boots-womens"
}