{
  "description": "Atomic Hawx Prime 115 S W GW is a high performance, sporty women’s all-mountain ski boot with a strong flex and unrivaled comfort. Designed for medium-width feet, it offers the ultimate in performance for powerful skiing. A full-featured boot built with Prolite construction using added reinforcements in key zones for extremely powerful skiing. The Mimic Platinum W liner is key in creating a comfortable fit, with a heat-moldable pre-shaped heel, ankle and tongue, the liner material mimics the precise shape of your foot for a perfect custom fit. Cantable GripWalk Grip Pads offer more traction for walking, while delivering the power transfer of a standard alpine sole. It’s 10% stiffer than the next model down – so if you’re the kind of woman who skis hard, the Hawx Prime 115 S W GW is for you.",
  "img_hrefs": [
    "https://vpo.ca/images/product/medium/362341.jpg"
  ],
  "name": "Hawx Prime 115 S GW Ski Boots - Womens",
  "price_cents": 79995,
  "specs": [
    {
      "key": "Prolite",
      "value": "Revolutionary light construction with supportive reinforcements in key zones"
    },
    {
      "key": "Memory Fit",
      "value": "Advanced heat-fitting technology creates a fully personalized shell, cuff and liner in minutes"
    },
    {
      "key": "Adaptive Fit System (AFS) Cuff",
      "value": "A removeable cuff spoiler that increases the amount of tulip-shape and volume inside of the cuff"
    },
    {
      "key": "Mimic",
      "value": "Special heat-moldable plastic in heel, ankle, tongue and cuff areas mimic the shape of your foot"
    },
    {
      "key": "100mm Medium Last",
      "value": "Legendary Hawx Feel, this highly anatomical 100mm last is the gold standard for medium fit boots"
    },
    {
      "key": "Prolite",
      "value": "Revolutionary light construction with supportive reinforcements in key zones."
    },
    {
      "key": "True Size Mondopoint 22",
      "value": "On our women's models, we offer a true shell size in MP 22 plus an appropriate liner construction"
    },
    {
      "key": "Power Shift",
      "value": "Independently adjust forward lean to 13° or 15° or 17° as well as the flex index"
    },
    {
      "key": "Energy Backbone",
      "value": "Reinforcement in key zones giving extra strength and edge grip for powerful skiing"
    },
    {
      "key": "True Flex PU / PU",
      "value": "This Atomic-exclusive shell material provides the same flex in a wide variety of temperatures"
    },
    {
      "key": "Cantable GripWalk Grip Pads",
      "value": "Fitting current Hawx Ultra, Prime &amp; Magna, these GripWalk pads allow the use of canting shims"
    },
    {
      "key": "Weight / Boot (Size)",
      "value": "1621 g"
    },
    {
      "key": "Boot Fit",
      "value": "Medium"
    },
    {
      "key": "Skill Level",
      "value": "Expert"
    }
  ],
  "url": "https://vpo.ca/product/362341/hawx-prime-115-s-gw-ski-boots-womens"
}