{
  "description": "One of the lightest, hard-flexing crossover ski boots available, the Atomic Hawx Ultra XTD 130 GW delivers the best of both worlds – alpine boot downhill performance with the walkability of a touring boot. A narrow 98mm last that’s constructed with next-generation Prolite Technology, using the lightest profile possible and then adding reinforcement in key areas to create a super robust all-mountain / freeride touring boot that is 25% more stable to deliver supremely powerful skiing. It’s equipped with Memory Fit technology in the shell and a Mimic Platinum liner, a special heat-moldable liner that molds to the exact shape of your foot. The Adaptive Fit System (AFS) Tongue can be repositioned to accommodate different foot shapes and insteps. The cuff delivers 54º range of motion for epic natural movement, easier walking and a more comfortable standing position. The highly adaptive GripWalk Sole is compatible with all GripWalk, MN, MNC and Pin bindings.",
  "img_hrefs": [
    "https://vpo.ca/images/product/medium/362343.jpg"
  ],
  "name": "Hawx Ultra XTD 130 GW Ski Boots",
  "price_cents": 95000,
  "specs": [
    {
      "key": "Memory Fit",
      "value": "Advanced heat-fitting technology creates a fully personalized shell, cuff and liner in minutes"
    },
    {
      "key": "Mimic",
      "value": "Special heat-moldable plastic in heel, ankle, tongue and cuff areas mimic the shape of your foot"
    },
    {
      "key": "Adaptive Fit System (AFS) Tongue",
      "value": "The adjustable AFS Tongue can be repositioned to accommodate different foot shapes and instep heights"
    },
    {
      "key": "98mm Narrow Last",
      "value": "Legendary Hawx Feel, this highly anatomical 98mm last delivers comfort, performance and warmth"
    },
    {
      "key": "Prolite",
      "value": "Revolutionary light construction with supportive reinforcements in key zones"
    },
    {
      "key": "Frictionless Pivot",
      "value": "Igus polymer bushings provide a completely natural movement for effortless ascents"
    },
    {
      "key": "Free/Lock 4.5",
      "value": "Atomic's sturdiest ski"
    },
    {
      "key": "Energy Backbone",
      "value": "Reinforcement in key zones giving extra strength and edge grip for powerful skiing"
    },
    {
      "key": "True Flex PU / PU",
      "value": "This Atomic-exclusive shell material provides the same flex in a wide variety of temperatures"
    },
    {
      "key": "Weight / Boot (Size)",
      "value": "1825 g"
    },
    {
      "key": "Boot Fit",
      "value": "Narrow"
    },
    {
      "key": "Skill Level",
      "value": "Expert"
    }
  ],
  "url": "https://vpo.ca/product/362343/hawx-ultra-xtd-130-gw-ski-boots"
}