{
  "description": "A comfortable and extremely powerful alpine ski boot, the Atomic Hawx Ultra 130 S GW offers a low-volume, 98mm fit to deliver performance to expert all-mountain skiers with narrower feet. By using the slimmest profile possible and then reinforcing critical power transfer zones, Prolite technology creates a lightweight and exceptionally stable boot for hard charging skiers. Completely customizable, a Mimic Platinum liner can be uniquely formed to the precise shape of the foot and Memory Fit provides advanced heating technology for a fully personalized shell and cuff. The Adaptive Fit System (AFS) Tongue can be repositioned to accommodate different foot shapes and instep heights while the 3D Stretch Toe Box allows for a little extra length. With a softer cuff compared to the Hawx Ultra 130 RS GW, the Hawx Ultra 130 S GW offers the ideal combination of effortless turn initiation, greater comfort, and better handling in a no compromise, 130 flex boot.",
  "img_hrefs": [
    "https://vpo.ca/images/product/medium/362346.jpg"
  ],
  "name": "Hawx Ultra 130 S GW Ski Boots",
  "price_cents": 79995,
  "specs": [
    {
      "key": "Memory Fit",
      "value": "Advanced heat-fitting technology creates a fully personalized shell, cuff and liner in minutes"
    },
    {
      "key": "Mimic",
      "value": "Special heat-moldable plastic in heel, ankle, tongue and cuff areas mimic the shape of your foot"
    },
    {
      "key": "Adaptive Fit System (AFS) Tongue",
      "value": "The adjustable AFS Tongue can be repositioned to accommodate different foot shapes and instep heights"
    },
    {
      "key": "3M™ Thinsulate™",
      "value": "Keeps feet warm even in extremely cold and damp conditions"
    },
    {
      "key": "98mm Narrow Last",
      "value": "Legendary Hawx Feel, this highly anatomical 98mm last delivers comfort, performance and warmth"
    },
    {
      "key": "Prolite",
      "value": "Revolutionary light construction with supportive reinforcements in key zones"
    },
    {
      "key": "Power Shift",
      "value": "Independently adjust forward lean to 13° or 15° or 17° as well as the flex index"
    },
    {
      "key": "Energy Backbone",
      "value": "Reinforcement in key zones giving extra strength and edge grip for powerful skiing"
    },
    {
      "key": "True Flex PU / PU",
      "value": "This Atomic-exclusive shell material provides the same flex in a wide variety of temperatures"
    },
    {
      "key": "Cantable GripWalk Grip Pads",
      "value": "Fitting current Hawx Ultra, Prime &amp; Magna, these GripWalk pads allow the use of canting shims"
    },
    {
      "key": "Weight / Boot (Size)",
      "value": "1822 g"
    },
    {
      "key": "Boot Fit",
      "value": "Narrow"
    },
    {
      "key": "Skill Level",
      "value": "Expert"
    }
  ],
  "url": "https://vpo.ca/product/362346/hawx-ultra-130-s-gw-ski-boots"
}