{
  "description": "The Atomic Hawx Ultra XTD 115 W GW boot is an all-mountain skiing and freeride touring powerhouse. The hard-flexing, narrow 98mm last is constructed with next-generation Prolite, which starts with the slimmest profile possible and then adds reinforcement to key areas to create a super robust boot that is 25% more stable for supremely powerful skiing. Heat-moldable Memory Fit forms the shell and the special Mimic liner molds to the exact shape of your foot. The Adaptive Fit System (AFS) Tongue can be repositioned to accommodate different foot shapes and instep heights while the Adaptive Fit System (AFS) Cuff features a removeable cuff spoiler that increases the amount of tulip-shape and volume inside the cuff. A cuff with 54º of epic natural movement provides for easy walking and more comfort when standing upright. The highly adaptive GripWalk Sole is compatible with all GripWalk, MN, MNC and Pin bindings. For the experienced mountain lover, the Hawx Ultra XTD 115 W GW offers uncompromised exploration in whatever terrain they find themselves in.",
  "img_hrefs": [
    "https://vpo.ca/images/product/medium/362344.jpg"
  ],
  "name": "Hawx Ultra XTD 115 GW Ski Boots - Womens",
  "price_cents": 89995,
  "specs": [
    {
      "key": "Memory Fit",
      "value": "Advanced heat-fitting technology creates a fully personalized shell, cuff and liner in minutes"
    },
    {
      "key": "Adaptive Fit System (AFS) Cuff",
      "value": "A removeable cuff spoiler that increases the amount of tulip-shape and volume inside of the cuff"
    },
    {
      "key": "Mimic",
      "value": "Special heat-moldable plastic in heel, ankle, tongue and cuff areas mimic the shape of your foot"
    },
    {
      "key": "Adaptive Fit System (AFS) Tongue",
      "value": "The adjustable AFS Tongue can be repositioned to accommodate different foot shapes and instep heights"
    },
    {
      "key": "98mm Narrow Last",
      "value": "Legendary Hawx Feel, this highly anatomical 98mm last delivers comfort, performance and warmth"
    },
    {
      "key": "Prolite",
      "value": "Revolutionary light construction with supportive reinforcements in key zones"
    },
    {
      "key": "Frictionless Pivot",
      "value": "Igus polymer bushings provide a completely natural movement for effortless ascents"
    },
    {
      "key": "Free/Lock 4.5",
      "value": "Atomic's sturdiest ski"
    },
    {
      "key": "Energy Backbone",
      "value": "Reinforcement in key zones giving extra strength and edge grip for powerful skiing"
    },
    {
      "key": "True Flex PU / PU",
      "value": "This Atomic-exclusive shell material provides the same flex in a wide variety of temperatures"
    },
    {
      "key": "Weight / Boot (Size)",
      "value": "1615 g"
    },
    {
      "key": "Boot Fit",
      "value": "Narrow"
    },
    {
      "key": "Skill Level",
      "value": "Expert"
    }
  ],
  "url": "https://vpo.ca/product/362344/hawx-ultra-xtd-115-gw-ski-boots-womens"
}