{
  "description": "The newest member of the YETI® Hopper® Soft Cooler family is here with the tough-as-nails Hopper® M15. Made with their durable MagShield Access, the extra-wide mouth top stays open when needed, making it easier than ever to load and unload food and drink for weekend excursions. Equipped with a strip of durable and powerful ultra-strong magnets, the top seals tight and locks cold in, while the Quick-Release Buckles add an extra layer of protection. And like the rest of their Hopper® Soft Coolers, the Hopper® M15’s built in HitchPoint™ Grid lets you attach accessories like the Rambler® Bottle Sling and SideKick Dry® Gear Case for extra utility on the go.&lt;br&gt;&lt;br&gt;WARNING: Do not leave your soft cooler open in the presence of children and animals. Entrapment and suffocation can occur.&lt;br&gt;&lt;br&gt;WARNING: Hopper® Soft Coolers are not compatible with dry ice. Use of dry ice will cause airtight vessel to explode.&lt;br&gt;&lt;br&gt;WARNING: This product contains magnets. Placing near a pacemaker may cause interference.",
  "img_hrefs": [
    "https://vpo.ca/images/product/medium/362544.jpg"
  ],
  "name": "Hopper M15",
  "price_cents": 40000,
  "specs": [
    {
      "key": "Magshield Access",
      "value": "Durable and powerful magnets create an ultra leakresistant shield that stays open when you need it and snaps closed with a gentle push"
    },
    {
      "key": "DRYHIDE™ Shell",
      "value": "High-density fabric withstands punctures and UV rays. To help extend the life of the cooler, both the interior and exterior materials are treated to be mildew resistant"
    },
    {
      "key": "Kanagroo Pocket",
      "value": "Phone, keys, wallet, or a little bit of hot sauce. Easily access all your must haves"
    },
    {
      "key": "HITCHPOINT™ GRID",
      "value": "Securely attach your SideKick Dry® Gear Case or load it up with zingers, nippers, bottle openers, and multitools"
    },
    {
      "key": "COLDCELL™ Insulation",
      "value": "Closed-cell foam offers impressive cold-holding capabilities, helping keep your frosty goods ice cold"
    },
    {
      "key": "Leakproof liner",
      "value": "RF welding used to eliminate stitching and provide leakproof seams in the interior liner"
    },
    {
      "key": "Double-Stiched Carry",
      "value": "Every pick-up point is reinforced so you can handle more weight than you'd prefer to carry"
    },
    {
      "key": "Weight",
      "value": "2.3 kg"
    },
    {
      "key": "Exterior",
      "value": "20.3w x 9.2d x 16h in"
    },
    {
      "key": "Interior",
      "value": "13w x 7d x 10.8h in"
    }
  ],
  "url": "https://vpo.ca/product/362544/hopper-m15"
}