{
  "description": "Hybrid glue technology with tried and true mixed mohair plush for Splitboards up to 180 cm. Contour's mixed mohair plush is well known for its high level of durability and good glide performance, and the Hybrid adhesive technology makes the skins super easy to use.&lt;br&gt;&lt;br&gt;Hybrid is the first ever twin layer adhesive technology for climbing skins. The upper layer sticks the skin firmly to the ski even at low temperatures. It is easy to remove and does not leave any residue on the ski base. The lower layer binds the upper layer of adhesive to the skin backing.&lt;br&gt;&lt;br&gt;The result is a unique combination of the best qualities of hot melt skins and ‘glueless’ skins:&lt;br&gt;&lt;br&gt;- Minimal effort required to separate adhesive sides from each other&lt;br&gt;- Effortless removal from the ski&lt;br&gt;- No more re-gluing needed; simply wash the adhesive layer to restore tackiness&lt;br&gt;- Excellent ski base adhesion on multiple ascents&lt;br&gt;- Excellent tack even at very low temperatures&lt;br&gt;&lt;br&gt;It is important to check the adhesive layer regularly and clean it if necessary. Dust, dirt and ski wax residue do affect the adhesive performance and require the hybrid adhesive to be cleaned.&lt;br&gt;&lt;br&gt;Set includes Tip Fix set with rivets, skin cutter, cleaning wipes and stuff sack with microfiber cloth to clean and dry ski bases before applying the skins. The adjustable Velcro tip attachment is pre-assembled.",
  "img_hrefs": [
    "https://vpo.ca/images/product/medium/362309.jpg"
  ],
  "name": "Hybrid Splitboard Skin Kit",
  "price_cents": 30995,
  "specs": [
    {
      "key": "Material",
      "value": "Mohair Blend"
    },
    {
      "key": "Adhesive",
      "value": "Hybrid"
    },
    {
      "key": "Tip Attachment",
      "value": "Velcro Buckle"
    },
    {
      "key": "Tail Attachment",
      "value": "Wire Buckle + Clamp with Rivets"
    },
    {
      "key": "Width",
      "value": "135 mm"
    },
    {
      "key": "Length",
      "value": "Universal 180 cm max"
    }
  ],
  "url": "https://vpo.ca/product/362309/hybrid-splitboard-skin-kit"
}