{
  "description": "Tucked in the southeast corner of BC, the Kootenay Rockies are one of Canada's best-kept outdoor adventure secrets. As you move west from the world-famous peaks of the Rocky Mountains, the crowds thin out and the opportunities for outdoor adventure grow. From hiking beneath towering mountain peaks and through valleys of wildflowers in Glacier National Park, Kootenay National Park, Mount Revelstoke National Park, or Yoho National Park to paddling rushing whitewater rivers or turquoise glacial lakes, there is no shortage of outdoor adventure opportunities in this beautiful region. A maze of logging roads extends deep into the backcountry, offering access to countless campsites and hiking and mountain biking trails. In the winter, the region is covered by a thick layer of dry, fluffy snow, affectionately referred to by the locals as champagne powder.&lt;br&gt;&lt;br&gt;To help you take advantage of this incredible region, the latest edition of our Kootenay Rockies Backroad Mapbook features cartography updates including new symbols for readability, updated and expanded roads and trail systems, updated fish stocking and trail charts, added overland routes, new bonus Adventure sections, and much more. The printed version of the mapbook comes in the convenient 21.5 x 28 cm (8.5 x 11 inch) mapbook format with a heavy-duty spiral-bound cover. The 224-page book includes 51 maps at a 1:200,000 scale, along with 11 main Outdoor Adventure sections, new Bonus Adventure sections, a Service Provider Directory, Map and Adventure Index, Trip Planning tools and more. With over 83,000 kilometres of roads to view including the most complete logging and industrial road coverage available, the books are ideal for navigating on road trips and planning from home.",
  "img_hrefs": [
    "https://vpo.ca/images/product/medium/363407.jpg"
  ],
  "name": "Kootenay Rockies - Spiral - 9th Edition",
  "price_cents": 2995,
  "specs": [
    {
      "key": "Released",
      "value": "2023"
    },
    {
      "key": "UPC",
      "value": "6-22098-00268-3"
    },
    {
      "key": "ISBN #",
      "value": "978-1-989175-37-8"
    },
    {
      "key": "Pages",
      "value": "224"
    },
    {
      "key": "Dimensions",
      "value": "21.5cm x 28cm (8.5\" x 11\")"
    },
    {
      "key": "Maps",
      "value": "51 maps @ 1"
    },
    {
      "key": "Map Features",
      "value": "Highways, Logging Roads, Land &amp; Water Features, Parks, Adventure Points of Interest, Campgrounds, Hiking Trails, Motorized Trails, Paddling Routes, Hunting &amp; Fishing Areas, Winter Recreation and More."
    },
    {
      "key": "Areas Covered",
      "value": "Creston, Cranbrook, Fernie, Golden, Invermere, Kaslo, Nakusp, Nelson, Radium Hot Springs, Rossland, Revelstoke, Trail, &amp; more"
    },
    {
      "key": "51 @ 1",
      "value": "200,000 Scale Maps"
    },
    {
      "key": "Backroad Adventures",
      "value": "From secluded hot springs and scenic waterfalls to historic sites and old mines, the newest edition of our Kootenay Rockies Backroad Mapbook has over 55 updated backroad attractions to check out while travelling along the region's highways and backroads. Whether you are interested in hiking to the location of an old fire tower or exploring an old ghost town, the Kootenay Rockies has an adventure for everyone!"
    },
    {
      "key": "Fishing Adventures",
      "value": "The Kootenay Rockies offer abundant fish populations in a spectacular setting, including the famous Gerrard rainbow trout as well as landlocked salmon and some of the best bass fishing in BC. In your Kootenay Rockies Backroad Mapbook, you will find 400 listings for the best lake and stream fishing in the region, complete with stocking charts and labelled fish species on the maps."
    },
    {
      "key": "Hunting Adventures",
      "value": "The Kootenay Rockies region is home to an abundance of big game and game bird hunting opportunities, including white-tail and mule deer, moose, and wild turkey. In the 9th Edition of our Kootenay Rockies Backroad Mapbook, you will find over 35 detailed descriptions for the region's main hunting areas including species, tips on how to find them and descriptions of the area's Wildlife Management Units (WMUs) and Limited Entry Hunting areas too."
    },
    {
      "key": "Paddling Adventures",
      "value": "From rushing white-water creeks and rivers to glassy lakes, there is plenty to explore in a canoe or kayak in the Kootenay Rockies. The latest edition of our Kootenay Rockies Backroad Mapbook contains over 80 detailed listings for the best places to paddle in the region, complete with put-ins and take-outs, difficulty (Grade and Class), length, highlights, backcountry campsite locations, and more."
    },
    {
      "key": "Park Adventures",
      "value": "The Kootenay Rockies region offers a network of National, Provincial, and Regional Parks that protect some of Canadaâ\u0080™s most stunning natural landscapes. Towering mountain peaks, valleys filled with wildflowers, turquoise lakes, and rushing rivers provide habitat for a variety of wildlife. In the latest edition of our Kootenay Rockies Backroad Mapbook, you will find over 100 updated listings with detailed descriptions of Provincial, National, and Regional Parks along with notable amenities, easy-to-read activity symbols, camping or day-use information, park access and more."
    },
    {
      "key": "Rec Site Adventures",
      "value": "Your Kootenay Rockies Backroad Mapbook is your ultimate guide to the region's remote and rustic camping and day-use rec sites. In this Mapbook you will find over 200 detailed recreation site listings complete with information on access, amenities, activities, reservations and more."
    },
    {
      "key": "Trail Adventures",
      "value": "From epic multi-day treks through the alpine of the Rocky Mountains to leisurely riverside strolls through a regional park, the Kootenays have a hiking trail for everyone. In the latest edition of our Kootenay Rockies Backroad Mapbook, you will find 520 multi-use trail adventures for hikers, horseback riders, mountain bikers and more, complete with distance, elevation gain, difficulty, access, highlights and more. We also include trail charts for 10 of the region's main parks including Glacier, Kootenay, and Yoho National Parks, plus the Trans Canada Trail."
    },
    {
      "key": "ATV Adventures",
      "value": "As you explore this region's sprawling network of logging roads and ATV trails, enjoy unparalleled views of mountain ranges, valleys, and rushing rivers. With a sprawling network of logging and mining roads and a ton of designated ATV areas to explore, the Kootenays offer some truly exciting motorized recreation. In the latest edition of our Kootenay Rockies Backroad Mapbook, you will find 60 detailed listings for the best places to ride your ATV or dirt bike in the region as well as the new addition of Overland Routes."
    },
    {
      "key": "Snowmobile Adventures",
      "value": "From the remote Flathead region to the endless alpine around Revelstoke, the Kootenays offer world-class snowmobiling over thousands of kilometres of snowmobile trails and backroads. In the latest edition of our Kootenay Rockies Backroad Mapbook, you will find close to 50 listings for the best places to snowmobile in the area, complete with staging areas, distance, highlights and more."
    },
    {
      "key": "Wildlife Adventures",
      "value": "From large mammals such as bears, elk, and goats to hundreds of species of waterfowl, songbirds, and raptors, the Kootenays are a wildlife watcherâ\u0080™s paradise. In the latest edition of our Kootenay Rockies Backroad Mapbook, you will find over 70 detailed listings for wildlife viewing areas, complete with access, species, best season to view wildlife, directions, and more."
    },
    {
      "key": "Winter Adventures",
      "value": "The Kootenays' already majestic scenery becomes even more impressive in winter, with a generous snowfall that can last from November well into April. Cross-country and backcountry skiers and snowshoers have fantastic trail networks to explore, and the region offers some of the best downhill skiing and snowboarding in the world. In the latest edition of our Kootenay Rockies Backroad Mapbook, you will find 75 detailed listings for the best places to get outdoors once the snow falls."
    },
    {
      "key": "Bonus Adventure Sections",
      "value": "Brand new to the 9th Edition of the Kootenay Rockies Backroad Mapbook, we have added 12 Beaches, 19 Rock Climbing areas, and 9 Scuba Diving hot spots along with the impressive list of 86 Backcountry Huts, Cabins, and Shelters. No matter where your Kootenay Rockies adventure takes you, we have you covered with some of the best places to relax in the sun, get some exercise, or explore deep underwater."
    }
  ],
  "url": "https://vpo.ca/product/363407/kootenay-rockies-spiral-9th-edition"
}