{
  "description": "Do you like Mammut's Trovat series? Then you’ll love this model. The Trovat Guide II High GTX Men is the new mountain hiking shoe in this product family, building on and improving the properties of the previous incarnation. It features almost the same last and materials as its predecessor to ensure the same excellent fit. However, the Trovat Guide II High GTX Men has been fine-tuned to unveil a fresh new look for the mountains. Base Fit® provides firm support for the heel. The selected 3D Memo Foam creates an individualized fit at the heel, while the elasticated tongue construction makes the shoe easier to put on. A shoe that will accompany you reliably through the mountains.",
  "img_hrefs": [
    "https://vpo.ca/images/product/large/337925.jpg"
  ],
  "name": "Mammut Trovat Guide II High GTX - Mens",
  "price_cents": 4250000,
  "specs": [
    {
      "key": "Main",
      "value": "Textile Full grain leather"
    },
    {
      "key": "Soles",
      "value": "Vibram® MT-Traction II"
    },
    {
      "key": "Lining",
      "value": "Gore-Tex Performance Comfort Footwear"
    },
    {
      "key": "Flex index",
      "value": "A8"
    },
    {
      "key": "Heel drop",
      "value": "13 mm"
    },
    {
      "key": "Lace system",
      "value": "3 Zone"
    },
    {
      "key": "Last index",
      "value": "backpacking"
    },
    {
      "key": "Weight (Per Shoe)",
      "value": "810 g (size UK 8.5)"
    },
    {
      "key": "Base Fit 2.0®",
      "value": "Doubled heel straps ensure excellent heel support and blister prevention"
    },
    {
      "key": "3 Zone Lacing",
      "value": "Individual 3-zone lacing. Can be adjusted to person and situation"
    },
    {
      "key": "Motion Control",
      "value": "Reinforced, flexible inside prevents you from twisting your ankle while maintaining full freedom of movement"
    },
    {
      "key": "Memo Foam",
      "value": "The high-quality three-dimensional, infinitely adjustable memo foamc ushioning provides an individual fit around the heel. This ensures a high level of comfort, maximum heel support and blister prevention"
    },
    {
      "key": "Rolling Concept®",
      "value": "Patented Mammut® sole concept"
    }
  ],
  "url": "https://vpo.ca/product/337925/trovat-guide-ii-high-gtx-mens"
}