{
  "description": "Many years of fine-tuning, testing and countless design iterations have delivered the ultimate hardshell pants for extreme alpine expeditions. The Nordwand Pro range has been meticulously crafted to take on the supreme discipline of mountaineering: north-facing ascents. And it shows – down to the very last detail. With input from the Mammut Pro Team and Swiss mountain guides, the latest edition of these pants brings together the newest technology to deliver the Nordwand Pro’s renown bombproof protection while reducing the impact on the environment. Featuring new Gore-Tex Pro fabric which offers more abrasion resistance in a pre-consumer recycled nylon face and solution dyed backer, the Nordwand Pro HS pants deliver maximum protection and durability, with minimum environmental impact. Gore-Tex Stretch technology is also used through specific sections of the pants for a superior fit. Optimized from top to bottom, the Nordwand’s cut allows maximum freedom of movement as you climb. Workmanship has been refined down to the last detail, with parts facing the most wear reinforced, and features tweaked for the most challenging ascents. Reinforced seams, Dyneema® crampon protection, detachable braces, Mammut Gaiter Solution™ for a perfect fit with mountaineering or ski boots, and water-repellent two-way, 3/4-length side zippers are just a few of the many tried and tested features. The Nordwand Pro are fully-featured and rugged pants designed to step up in the most technical alpine expeditions.",
  "img_hrefs": [
    "https://vpo.ca/images/product/large/358868.jpg"
  ],
  "name": "Mammut Nordwand Pro HS Pants, Short - Mens",
  "price_cents": 8850000,
  "specs": [
    {
      "key": "Denier (main material)",
      "value": "80D x 80D"
    },
    {
      "key": "Lining",
      "value": "Gore-tex® Pocket Liner 3-Layer"
    },
    {
      "key": "Main Fabric",
      "value": "Gore-Tex® Pro 3-Layer with Solution-Dyed Backer"
    },
    {
      "key": "Main Fabric 2",
      "value": "Gore-tex® 3-Layer with C-knit™ Technology Stretch"
    },
    {
      "key": "Cut",
      "value": "Regular Fit"
    },
    {
      "key": "Weight",
      "value": "757 g"
    },
    {
      "key": "Breathability",
      "value": "RET&lt;9 m² Pa"
    },
    {
      "key": "Water column",
      "value": "28000 mm"
    }
  ],
  "url": "https://vpo.ca/product/358868/nordwand-pro-hs-pants-short-mens"
}