{
  "description": "Many years of fine-tuning, testing and countless design iterations have delivered the ultimate hardshell jacket for extreme alpine expeditions. The Nordwand Pro has been meticulously crafted to take on the supreme discipline of mountaineering: north-facing ascents. And it shows – down to the very last detail. With input from the Mammut Pro Team and Swiss mountain guides, the latest edition of this jacket brings together the newest technology to deliver the Nordwand Pro’s renown bombproof protection while reducing the impact on the environment. Featuring new GORE-TEX Pro fabric which offers more abrasion resistance in a pre-consumer recycled nylon face and solution dyed backer, the Nordwand Pro HS delivers maximum protection and durability, with minimum environmental impact. GORE-TEX Stretch technology is also used through specific sections of the jacket for a superior fit. Optimized from top to bottom, the Nordwand’s cut allows maximum freedom of movement as you climb. Workmanship has been refined down to the last detail, with parts facing the most wear reinforced, and features tweaked for the most challenging ascents. A helmet-compatible hood with reinforced peak, underarm ventilation with a water-repellent two-way zipper, and a plethora of harness-friendly pockets are just a few of the many tried and tested features. The Nordwand Pro is a fully-featured and rugged workhorse that steps up to the challenge in the most technical alpine expeditions.",
  "img_hrefs": [
    "https://vpo.ca/images/product/large/358864.jpg"
  ],
  "name": "Mammut Nordwand Pro HS Hooded Jacket - Mens",
  "price_cents": 10650000,
  "specs": [
    {
      "key": "Denier (main material)",
      "value": "80Dx80D"
    },
    {
      "key": "Lining",
      "value": "Gore-tex® pocket liner 3-layer"
    },
    {
      "key": "Main Fabric",
      "value": "Gore-tex® pro 3-layer with solution-dyed backer"
    },
    {
      "key": "Main Fabric 2",
      "value": "Gore-tex® 3-layer with c-knit™ technology stretch"
    },
    {
      "key": "Cut",
      "value": "Regular Fit"
    },
    {
      "key": "Weight",
      "value": "622 g"
    },
    {
      "key": "Breathability",
      "value": "RET&lt;9 m² Pa"
    },
    {
      "key": "Water column",
      "value": "28000 mm"
    }
  ],
  "url": "https://vpo.ca/product/358864/nordwand-pro-hs-hooded-jacket-mens"
}