{
  "description": "This lightweight insulation jacket is made for all-year mountaineering but works perfectly for general outdoor activities ranging from trekking to ski touring. They use their AeroDownproof face fabric to provide windproofness, lightweight and soft touch, and their Thermo60 synthetic insulation which offers great warmth-to-weight values, good packability and will provide insulation even when wet. <br><br>The Thermo60 insulation used is a 60g/m2 100% recycled polyester insulation which gives great thermal insulation to help the body to maintain its temperature, hence minimizing energy loss. The main face fabric is a windproof 20D recycled nylon ripstop fabric, and the shoulders, arms, and hood are reinforced with a durable and structured 30D lightweight rip-stop nylon Cordura for extra protection and durability. Both have PFC-free DWR treatment for additional water resistance. <br><br>Main features include a helmet-compatible hood with one-hand adjustment, a chest pocket with zipper, two hand pockets, and elastic cuffs. The jacket has a technical fit with a Y-cut and articulated arms for good movement while climbing. A longer cut in the back ensures extra protection. It's made to ?t over and under the falketind Gore-Tex Jacket and is slightly short in length.",
  "img_hrefs": [
    "https://vpo.ca/images/product/large/348093.jpg"
  ],
  "name": "Norrona Falketind Thermo60 Hood - Mens",
  "price_cents": 3599500,
  "specs": [
    {
      "key": "Main",
      "value": "30D 57% recycled nylon, 43% nylon Cordura"
    },
    {
      "key": "Main 2",
      "value": "20D 100% recycled nylon"
    },
    {
      "key": "Lining",
      "value": "20D 100% recycled nylon"
    },
    {
      "key": "Insulation",
      "value": "100% recycled polyester"
    },
    {
      "key": "Inseam length",
      "value": "28 cm (size M)"
    },
    {
      "key": "Weight",
      "value": "398 g"
    }
  ],
  "url": "https://vpo.ca/product/348093/falketind-thermo60-hood-mens"
}