{
  "description": "The tamok Gore-Tex Pro Jacket is Norrona's most durable jacket for the backcountry freeriders, blending a unique look with uncompromising freeride functionality,<br><br>Made for a life riding powder, the tamok Gore-Tex Pro Jacket is the go-to jacket for everyone with the backcountry as their preferred territory. This longer cut jacket will provide superior protection from rough weather, along with great ventilation for touring and hiking missions.<br><br>It combines their minimalistic take on the original riders, the western cattlemen, with uncompromising functionality and sustainability. With its relaxed fit and feel, the jacket offers great movement and comfort down the lines and into the after-hours.<br><br>It is made in a highly durable 3-layer 70D X 160D recycled Gore-Tex Pro fabric with reinforced 200D Gore-Tex Pro fabric on shoulders and elbows.<br><br>Details include chest vents with mesh, a large napoleon pocket, hand gaiters, underarm vents, a detachable powder skirt, asymmetric cuffs with Velcro adjustment, radio/keycard pocket and a weather protecting, one hand adjustable hood that easily fits a helmet.<br><br>The spacious lower hand pockets will not interfere with a backpack harness. With its lofoten Gore-Tex Pro functionality combined with a distinct yet toned down look and natural feel, it’s the top of the line choice for the backcountry adrenaline junkie.",
  "img_hrefs": [
    "https://vpo.ca/images/product/large/327498.jpg"
  ],
  "name": "Norrona Tamok GTX Pro Jacket - Mens",
  "price_cents": 6962600,
  "specs": [
    {
      "key": "Primary",
      "value": "Gore-Tex® Pro most breathable 3-layer, 70D X 160D recycled nylon"
    },
    {
      "key": "Secondry",
      "value": "Gore-Tex® Pro most rugged 3-layer, 200D recycled nylon"
    },
    {
      "key": "Weight",
      "value": "788 g"
    },
    {
      "key": "Waterproof",
      "value": "min. 28,000 mm"
    },
    {
      "key": "Breathablility",
      "value": "High, down to 9 RET"
    },
    {
      "key": "Windproofness",
      "value": "100%"
    },
    {
      "key": "Fit",
      "value": "Technical"
    }
  ],
  "url": "https://vpo.ca/product/327498/tamok-gtx-pro-jacket-mens"
}