{
  "description": "Their most breathable insulation jacket.<br><br>This lightweight insulated jacket is made for ski touring, but is also great for general outdoor wear, especially mid to high-intensity activities due to its excellent breathing and insulation properties.<br><br>The face fabric is a lightweight double-weave recycled nylon aero100 fabric, and we use it because it provides a perfect combination of low weight, breathability, and wind protection. Plus a little bit of stretch for better movement. It's a durable 20D ripstop quality with PFC-free DWR treatment for additional water resistance.<br><br>The jacket is lined with recycled Polartec® Alpha® insulation, the world-leading breathable insulation engineered to provide consistent warmth while continuously releasing excess body heat and allowing outstanding breathability during activity. It insulates the user when they are highly active, as well as more sedentary periods.<br><br>For optimal performance, we’ve used two Polartec® Alpha® qualities: The body is lined with Polartec® Alpha® 90 (90 g/m²) made of 100% recycled polyester, while the shoulder area, which has a more demanding muscle group, is in a thicker Polartec® Alpha® 120 (120 g/m²) 100% recycled polyester quality. This is also more resistant to compression from backpack straps.<br><br>Key features include hand pockets and a chest pocket with zipper closure, a helmet-compatible hood with one-hand adjustment, a stiffer brim for better wind protection, an inner placket to prevent cold spots, and an elastic bottom hem.<br><br>The jacket has a technical fit with a Y-cut and articulated arms for good alpine movement, with slight ease to give it a more jacket-like function.",
  "img_hrefs": [
    "https://vpo.ca/images/product/large/360768.jpg"
  ],
  "name": "Norrona Lyngen Alpha100 Zip Hood - Mens",
  "price_cents": 4299500,
  "specs": [
    {
      "key": "Main",
      "value": "Pertex 20D 100% Recycled Nylon"
    },
    {
      "key": "Lining",
      "value": "78% recycled, 22% polyester"
    },
    {
      "key": "Weight",
      "value": "380 g"
    },
    {
      "key": "Fit",
      "value": "Technical"
    }
  ],
  "url": "https://vpo.ca/product/360768/lyngen-alpha100-zip-hood-mens"
}