{
  "description": "The Lofoten Primaloft80 Anorak a ski-specific, insulated Anorak made for extensive use down steep and rugged lines. Using the revolutionizing, recycled PrimaLoft Gold Aerogel insulation, the jacket offers an outstanding warmth-to-weight ratio. Aerogel is known as the world’s lightest solid, and with the PrimaLoft Gold Crosscore technology, they’ve managed to utilize its great insulation properties into outdoor gear. <br><br>The face fabric is a durable, lightweight rip-stop nylon Cordura ideal for rough surfaces and is highly windproof and water repellant. For extra protection, we’ve also added waterproof/breathable reinforcement on the shoulders, lower torso (not on women’s), and cuffs. This creates a highly functional anorak that can take a hit as a standalone insulation piece as well as a warm and protective layering piece. <br><br>There are two-way side zippers running from the bottom hem and all the way to the elbows, which provide good ventilation and makes it easy to put the piece on and off. Because synthetics don’t get soggy like down used in wet and damp conditions or when the output is high, this piece is perfect for humid conditions where you need warmth. You have plenty of room for your stuff; it has a kangaroo pocket, a chest pocket, two large napoleon pockets, and a phone pocket.",
  "img_hrefs": [
    "https://vpo.ca/images/product/large/333652.jpg"
  ],
  "name": "Norrona Lofoten Primaloft80 Anorak - Mens",
  "price_cents": 4999500,
  "specs": [
    {
      "key": "Main",
      "value": "30D 100% Nylon Cordura"
    },
    {
      "key": "Secondary",
      "value": "2-Layer 60D Recycled Nylon"
    },
    {
      "key": "Insulation",
      "value": "Primaloft® Gold With Cross Core Technology"
    },
    {
      "key": "Weight",
      "value": "658 g"
    },
    {
      "key": "Waterproof",
      "value": "min. 20,000 mm"
    }
  ],
  "url": "https://vpo.ca/product/333652/lofoten-primaloft80-anorak-mens"
}