{
  "description": "Norrona's most durable outdoor/hiking bib pants.<br><br>These durable bib pants are made for general outdoor and hiking and work well for other activities such as dry weather skiing, mountaineering, hunting, and longer expeditions.<br><br>They are made in a high-quality, rugged organic cotton/recycled polyester fabric as this material provides the optimal combination of durability, windproof ness and breathability. In addition, the pants are reinforced on knees and in the seat with a flex1 and dri2 fabric combo for waterproofness, durability, and stretch.<br><br>The main fabric is a highly durable heavy-duty (295g/m2) canvas construction consisting of 60% organic cotton and 40% recycled polyester. This mix offers the perfect balance between windproof ness, durability, and breathability in sustainable, long-lasting materials. The recycled polyester makes the fabric lighter, more durable, and also quicker drying. In addition, it has a PFC-free DWR for extra water repellency.<br><br>The reinforcing flex1 fabric is a weather-resistant 274g/m 90D 100% recycled double weaved flex1 soft shell material – a rugged quality perfect for various activities. It has a 4-ways stretch for optimal mobility and is treated with PFC-free DWR to provide extra water repellency. The 60 g/m2 dri2 fabric has a waterproofness of 20.000 mm with a 20D tricot backer to create waterproofness in the reinforced areas.<br><br>Key features include: Comfortable 38mm elasticated shoulder straps, a long, two-way front zip with snap button closure, zippered side venting, back pockets, front pockets, a hidden gaiter hook, an adjustable bottom leg with a lined gusset, belt hoops, and laminated zippers. In addition, the top bib has three zippered pockets and adjustable straps.<br><br>This bib has a regular fit that is slightly more spacious than the svalbard heavy duty pants, with articulated knees to improve mobility. They can be worn over larger hiking boots.",
  "img_hrefs": [
    "https://vpo.ca/images/product/large/352548.jpg"
  ],
  "name": "Norrona Svalbard Heavy Duty Bib - Mens",
  "price_cents": 2960000,
  "specs": [],
  "url": "https://vpo.ca/product/352548/svalbard-heavy-duty-bib-mens"
}