{
  "description": "Light weight, function and the best merino wool: with their new 120 comp light short pants for men, the naked sheep is ready for new personal bests! To follow the award-winning 230 merino competition,&nbsp;Ortovox have developed their 120 merino competition line for high-action sports in both summer and winter. Consisting of a high proportion of merino wool, this line is now even lighter! What makes their 120 comp light short pants for men so special is that they are produced using an almost entirely seamless circular knitting technique, so that different material strengths can be used in different areas. A fine ribbed structure made from 120 g/m² merino gives our three-quarter, functional long johns elasticity for maximum freedom of movement, while a particularly breathable mesh structure ensures optimum air circulation in the areas of the body that generate the most heat. This body mapping technique, in which different knit structures are used in certain zones, ensures maximum ventilation. What’s more, thanks to their close fit, their 120 comp light short pants for men are very elastic, highly breathable and quick drying, and yet still durable and long lasting. And the gentle merino fibers with a diameter of 16.5 microns feel as comfortable and soft as a second skin. The positive features of the wool fibers come into their own in this light functional underwear, because merino wool is naturally moisture and temperature regulating and neutralizes nasty odors. And it’s all “made in Europe”! Experience pure lightness with their 120 comp light short pants for men! Whether on a ski tour in winter or an alpine tour in summer, the way to your personal top performance is wide open.",
  "img_hrefs": [
    "https://vpo.ca/images/product/large/316215.jpg"
  ],
  "name": "Ortovox 120 Comp Light Short Pants - Mens",
  "price_cents": 1099500,
  "specs": [
    {
      "key": "Materials",
      "value": "70% Virgin Merino Wool, 30% Polyamide"
    },
    {
      "key": "Fit",
      "value": "Athletic"
    },
    {
      "key": "Weight",
      "value": "64 g"
    },
    {
      "key": "Leg Length",
      "value": "Short"
    }
  ],
  "url": "https://vpo.ca/product/316215/120-comp-light-short-pants-mens"
}