{
  "description": "Their new 2.5 Civetta jacket will impress you with its combination of minimal weight, 68 g/m², and its high-performance Dermizax®&nbsp;DT membrane from toray. The 2.5 layer construction features the water column, min. 10,000mm, of a hardshell and the lightness and breathability, min. 20,000g/m²/24h, of a windbreaker. Tiny, integrated beads, micro beads, in the structure mean that moisture can be more quickly absorbed and released to the membrane. This makes it feel dry against the skin. New features such as the elastic waist and the chest pocket make the merino hardshell even more functional: the jacket can now be completely stored in the inner pocket and, thanks to the loop on the inside, can be quickly fastened to a climbing harness or compressed to save space and stored in a backpack. The lightweight jacket is therefore the perfect companion on alpine tours where light weight, a small pack size and high protection are required. In addition, this highly functional jacket is equipped with a self-regulating hood. A circumferential elastic band and a reinforced peak ensure an optimum fit in wind and rain, while discreet merino cool inserts increase wear comfort around the chin and forehead area. The elastic cuffs and the elastic seam prevent any unwanted wind and moisture penetrating. There is still ample storage space in the breast pocket for a maps, trail bars or cell phone. The Ultra-Light 2.5 layer jacket for men focuses on the essentials without compromising on functionality and comfort. For the sake of the environment, it is now also completely PFC-free. Are you still not sure which hardshell jacket is right for you? We have created a direct comparison of all Ortovox hardshell jackets, taking into account the key criteria to assist you in making your decision. You can access the direct comparison here.",
  "img_hrefs": [
    "https://vpo.ca/images/product/large/343539.jpg"
  ],
  "name": "Ortovox 2.5L Civetta Jacket - Mens",
  "price_cents": 3320000,
  "specs": [
    {
      "key": "Outer",
      "value": "100% Polyamide"
    },
    {
      "key": "Membrane",
      "value": "100% Polyurethane - Toray Dermizax® DT"
    },
    {
      "key": "Details",
      "value": "85% Virgin Wool - Merino, 15% Polyamide"
    },
    {
      "key": "Weight",
      "value": "178 g"
    },
    {
      "key": "Fit",
      "value": "Regular Fit"
    }
  ],
  "url": "https://vpo.ca/product/343539/25l-civetta-jacket-mens"
}