{
  "description": "Lightweight and supple for full freedom of movement when freeriding: the 3L Deep Shell bib Pants for men offer full protection and high comfort combined with low weight.<br><br>The Wind and Waterproof Dermizax®EV high-performance membrane from Toray is lined with merino wool in areas of the body that are particularly sensitive to the cold, guaranteeing optimum heat retention and a comfortable fit. To protect the sensitive kidney area, these freeriding pants are cut especially high and can be optimally adjusted to fit using the hook and loop fastener at the waist.<br><br>These lightweight freeriding pants have anatomically shaped knees and a comfortable cut to guarantee freedom of movement in any terrain. Ventilation zippers on the sides provide additional ventilation when the going gets tough. The zippers are also set toward the back and can be opened all the way up, making comfort breaks much easier.<br><br>The spacious, extended thigh pockets ensure everything can be neatly stowed away and yet accessed quickly. The avalanche transceiver carabiner integrated into the right pocket provides a permanent place for your avalanche transceiver.<br><br>Thanks to their robust membrane and flat seams, the 3l deep shell bib pants for men are particularly durable and long-wearing. The integrated Dyneema-Cordura gaiters and sharp-edge protectors provide additional protection when freeriding. The pants are also pfc-free and climate neutral in the interest of sustainability. Green light for mindful freeriders!",
  "img_hrefs": [
    "https://vpo.ca/images/product/large/340843.jpg"
  ],
  "name": "Ortovox 3L Deep Shell Bib Pants - Mens",
  "price_cents": 6399600,
  "specs": [
    {
      "key": "Outer",
      "value": "100% polyamide"
    },
    {
      "key": "Membrane",
      "value": "100% polyurethane"
    },
    {
      "key": "Inner",
      "value": "100% polyester"
    },
    {
      "key": "Inserts",
      "value": "74% polyamide + 15% wool (OWP-Merino) + 11% elastane Inserts"
    },
    {
      "key": "Weight",
      "value": "644 g"
    },
    {
      "key": "Fit",
      "value": "Loose"
    },
    {
      "key": "Leg Length",
      "value": "Medium"
    }
  ],
  "url": "https://vpo.ca/product/340843/3l-deep-shell-bib-pants-mens"
}