{
  "description": "“The best hiking pants ever.” We’d like to leave this description at that, but since you probably want more details, we’ll dig in a bit. The Equinox Convertible Hiking Pants have everything you need in a piece of outdoor clothing. They’re breathable, they’re lightweight, they’re wind and water resistant. They also feature the perfect amount of stretch. But the goodness doesn’t stop there. For those sunny days out on the trail, these men’s hiking pants will keep your skin happy with UPF 50+ sun protection. And if the heat’s hitting hard, no sweat; you can switch to shorts using these pant’s ankle zips and Sly Thigh Zip Off™ design, which zips off at an angle to uncover a shorts-length cut hidden beneath the pant leg. <br><br>This trademarked design ensures that, unlike most zip-off hiking pants, these pants convert to shorts that are the right length, don’t have a zipper edge that’ll chafe your thighs, and do actually look good. <br><br>Bonus: these pants work great as cold-weather hiking pants too. Just put them atop the right base layers and you’ll be good to go. Next time you’re heading out for a big summit, some splitboarding, or a simple day hike, throw on these technical pants, toss your keys into their zippered left pocket, and take on that adventure like your middle name is Made for This.",
  "img_hrefs": [
    "https://vpo.ca/images/product/large/326396.jpg"
  ],
  "name": "Outdoor Research Equinox Convertible Pants, 32\" Inseam - Mens",
  "price_cents": 770000,
  "specs": [
    {
      "key": "Fabric",
      "value": "95% nylon, 5% spandex"
    },
    {
      "key": "Weight",
      "value": "269 g"
    },
    {
      "key": "Fit",
      "value": "Standard"
    },
    {
      "key": "Pant Inseam",
      "value": "32 in"
    },
    {
      "key": "Short Inseam",
      "value": "10 in"
    }
  ],
  "url": "https://vpo.ca/product/326396/equinox-convertible-pants-32-inseam-mens"
}