{
  "description": "For your best everyday runs or whatever else you can dream up, with an essential dose of utility, the Multi Trails Shorts have an 8\" inseam and are made of a lightweight 90% recycled polyester/10% spandex blend that breathes, wicks moisture and moves comfortably. Fair Trade Certified™ sewn.",
  "img_hrefs": [
    "https://vpo.ca/images/product/large/357384.jpg"
  ],
  "name": "Patagonia Multi Trails Shorts, 8\" Inseam - Mens",
  "price_cents": 990000,
  "specs": [
    {
      "key": "Body",
      "value": "2.5-oz 90% Prevented Ocean Plastic™ recycled polyester certified by OceanCycle and sourced from coastal communities at risk of plastic pollution"
    },
    {
      "key": "Liner",
      "value": "2.3-oz 100% recycled polyester double knit with miDori™ bioSoft for added wicking and softness, and HeiQ® Pure odor control"
    },
    {
      "key": "Durable Fabric with Stretch",
      "value": "Body is made of quick-drying 90% Prevented Ocean Plastic™ recycled polyester sourced from plastic waste recovered from at-risk coastal communities and certified by OceanCycle"
    },
    {
      "key": "Drawcord for Comfort",
      "value": "External drawcord for adjustability and comfort"
    },
    {
      "key": "Pocket Details",
      "value": "Two zippered front pockets; one back snap pocket that shorts stuff into for easy storage and packing on the go"
    },
    {
      "key": "Supportive, Lightweight Liner",
      "value": "Comfortable boxer-brief liner"
    },
    {
      "key": "Adjustable Waistband",
      "value": "Light and minimal elastic waistband, with good power and recovery, provides moisture management and reduces bulk"
    },
    {
      "key": "Reflective Logo and 8\" Inseam",
      "value": "Reflective logo on front-left hem; locker loop for hang drying; 8\" inseam"
    },
    {
      "key": "Supporting the People Who Made This Product",
      "value": "Fair Trade Certified™ sewn, which means the people who made it earned a premium for their labor"
    },
    {
      "key": "Weight",
      "value": "81 g"
    }
  ],
  "url": "https://vpo.ca/product/357384/multi-trails-shorts-8-inseam-mens"
}