{
  "description": "The new Quantum FREE PRO is the high-end model for all experienced backcountry touring experts who don't want to sacrifice performance and handling in both uphill and downhill situations. As a hybrid, the boot with 130 Flex combines the best of touring and freeride and is impressive in open terrain, with maximum control during the descent and an excellent fit for a smooth ascent. At the heart of FREE PRO is the redesigned durable IF Touring PRO liner, which features three-part Dalbello PuRE (Polyurethane Recycled Enforcement) technology for more efficient power transmission to the shell, firm heel grip and impressive comfort. A full-length lacing system and memory foam tongue complement each foot shape for individual adaptability and a perfect fit. The innovative two-part bonded shell construction ensures low overall weight and high rigidity. In combination with the eXtra Dual Link cuff, a more direct transmission of control impulses for the downhill descent and sufficient freedom of movement on the ascent is provided. The New Elastic Gaiter also facilitates handling and entry and exit together with the Quick-Hook-Release function on the strap. The Quantum FREE PRO features a Vibram dual-density sole that makes contact with the ground and binding, combining improved grip with no power transmission loss during descents thanks to two types of rubber of differing hardness. With a new lining made from recycled material and the PU-free outer layer of the liner, the boot also scores highly for sustainability.",
  "img_hrefs": [
    "https://vpo.ca/images/product/medium/362215.jpg"
  ],
  "name": "Quantum Free Pro - Mens",
  "price_cents": 98000,
  "specs": [
    {
      "key": "Best for",
      "value": "Backcountry, Powder, Touring"
    },
    {
      "key": "Ski Boot Weight",
      "value": "1,300g (Size 26.5)"
    },
    {
      "key": "Size Run",
      "value": "24.5 - 30.5 Mondopoint"
    },
    {
      "key": "Construction",
      "value": "Bonded Shell"
    },
    {
      "key": "Flex",
      "value": "130"
    },
    {
      "key": "Last",
      "value": "100"
    },
    {
      "key": "Liner",
      "value": "IF TOURING PRO"
    },
    {
      "key": "Fit System",
      "value": "MyFit"
    },
    {
      "key": "Strap",
      "value": "Velcro Strap 35 mm"
    },
    {
      "key": "Category",
      "value": "Touring"
    },
    {
      "key": "Age",
      "value": "Adult"
    },
    {
      "key": "Gender",
      "value": "Men's"
    }
  ],
  "url": "https://vpo.ca/product/362215/quantum-free-pro-mens"
}