{
  "description": "The versatile Quantum FREE W with 105 Flex is aimed at all female skiers with touring experience looking for a ski boot that will hold its own in backcountry situations – both uphill and downhill. Just like the men’s versions of the line, the women’s boot combines touring and freeriding in one concept and offers outstanding downhill characteristics with smooth ascent performance. Inside, the new durable IF Touring PRO liner features three-part Dalbello PuRE technology for more efficient force transmission to the shell, firm heel grip and optimal comfort. It offers a perfect fit for all foot shapes, a lacing system in collaboration with the Dalbello AUTOFIT technology with a memory foam tongue. Thanks to the two-piece bonded shell construction with anatomical heel shells, the overall weight remains low, and rigidity high, while, in combination with the eXtra Dual Link cuff, which also consists of two parts, more direct transmission of the control for the downhill and sufficient freedom of movement in the ascent is provided. The New Elastic Gaiter also facilitates handling for the entry and exit, while a Vibram Dual Density sole provides improved grip when walking with no loss of contact with the binding.",
  "img_hrefs": [
    "https://vpo.ca/images/product/medium/362218.jpg"
  ],
  "name": "Quantum Free - Womens",
  "price_cents": 79995,
  "specs": [
    {
      "key": "Best for",
      "value": "Backcountry, Powder, Touring"
    },
    {
      "key": "Ski Boot Weight",
      "value": "1,200 g (Size 24.5)"
    },
    {
      "key": "Size Run",
      "value": "22.5 - 27.5 Mondopoint"
    },
    {
      "key": "Construction",
      "value": "Bonded Shell"
    },
    {
      "key": "Flex",
      "value": "105"
    },
    {
      "key": "Last",
      "value": "100"
    },
    {
      "key": "Liner",
      "value": "IF TOURING SPORT W"
    },
    {
      "key": "Fit System",
      "value": "MyFit"
    },
    {
      "key": "Strap",
      "value": "Velcro Strap 35 mm"
    },
    {
      "key": "Category",
      "value": "Touring"
    },
    {
      "key": "Age",
      "value": "Adult"
    },
    {
      "key": "Gender",
      "value": "Women's"
    }
  ],
  "url": "https://vpo.ca/product/362218/quantum-free-womens"
}