{
  "description": "When mountain adventure meets windstorms and whiteouts, you’ll be glad of the Nebula Pro Jacket. With zoned construction and recycled PrimaLoft® insulation it’s a seriously warm layer for winter mountaineering.<br><br>The midi-baffled Nebula Pro jacket is the warmest of our recycled PrimaLoft® Silver Insulation Luxe™ jackets. Mimicking the performance of down, this 100% recycled insulation offers exceptional warmth for low weight. We've strategically placed sheets of recycled PrimaLoft® Silver Insulation across the shoulders and on the cuffs and hood for additional durability.<br><br>Built from recycled 30D Pertex® Quantum Pro ripstop nylon with a water-repellant DWR coating the Nebula Pro is robust and weather resistant. It features an adjustable helmet-compatible hood with stiffened peak and a two-way YKK® VISLON® ® front zip with insulated storm guard. Warm, fast drying and robust it's perfect for trekking and mountaineering in harsh winter weather.",
  "img_hrefs": [
    "https://vpo.ca/images/product/large/329486.jpg"
  ],
  "name": "Rab Nebula Pro Jacket - Mens",
  "price_cents": 3150000,
  "specs": [
    {
      "key": "Main",
      "value": "Recycled 30D nylon, 53g"
    },
    {
      "key": "Lining",
      "value": "Recycled 20D Atmos nylon, 41g"
    },
    {
      "key": "Insulation",
      "value": "100% recycled PrimaLoft® Silver Insulation Luxe™"
    },
    {
      "key": "Composition",
      "value": "100% recycled polyamide with polyurethane coating and 100% recycled polyamide lining"
    },
    {
      "key": "Weight",
      "value": "648 g"
    },
    {
      "key": "Center back length (Size Large)",
      "value": "30.9 in"
    },
    {
      "key": "Body mapped insulation to optimize warmth around core and durability in high wear areas. Main body",
      "value": "100% recycled PrimaLoft® Silver Insulation Luxe™"
    },
    {
      "key": "Shoulder, cuffs and hood",
      "value": "100% recycled PrimaLoft® Silver Insulation (sheet)"
    }
  ],
  "url": "https://vpo.ca/product/329486/nebula-pro-jacket-mens"
}