{
  "description": "This versatile GORE-TEX Pro Most Breathable shell is ideal for year-round walking, hiking, and trekking in the roughest weather. Its dual weight construction places tougher fabric across the shoulders and sleeves for abrasion protection from the repetitive rub of backpack straps. The lighter weight fabric around the core gives greater mobility, breathability, and reduced weight and bulk for when your waterproof needs stashed in a pack.<br><br>The Latok Mountain GTX has a stowable hood, preventing it from billowing in the wind when not in use. The two-way adjustment can be cinched in quick with one hand when you’re negotiating tricky terrain and its protective stiff peak keeps the rain off your face. Designed to move easily with your head, it won’t hinder visibility when you need it most.<br><br>Easily deflecting wind, rain, sleet, and snow, while breathing and managing moisture through your layering system, this jacket is designed to keep you comfortable when your route gets steep or deep. Dump heat quickly through the underarm vents, with two-way zips for fine air flow adjustment, and stash your map, compass, and other essentials close to hand in the three, deep zipped pockets. Perfect for dedicated mountain-goers through all four seasons and for use between mountain adventures.",
  "img_hrefs": [
    "https://vpo.ca/images/product/large/351893.jpg"
  ],
  "name": "Rab Latok Mountain GTX Jacket - Mens",
  "price_cents": 8100000,
  "specs": [
    {
      "key": "Main Fabric",
      "value": "80D Recycled GORE-TEX Pro Most Breathable 3-Layer construction with Gore DWR (154 g"
    },
    {
      "key": "Secondary Fabric",
      "value": "40D Recycled GORE-TEX Pro Most Breathable 3-Layer construction with Gore DWR (120 g"
    },
    {
      "key": "Face",
      "value": "100% Recycled Polyamide, ePTFE Membrane"
    },
    {
      "key": "Backer",
      "value": "100% Polyamide"
    },
    {
      "key": "Fit",
      "value": "Regular"
    },
    {
      "key": "Centre back length (Size M)",
      "value": "78 cm"
    },
    {
      "key": "Weight",
      "value": "505 g"
    }
  ],
  "url": "https://vpo.ca/product/351893/latok-mountain-gtx-jacket-mens"
}