{
  "description": "The warmest jacket in the Infinity range is filled with 800FP down and benefits from an ultra-protective GORE-TEX INFINIUM™ WINDSTOPPER® weather-resistant outer.<br><br>Designed for winter climbing and mountaineering the Infinity jacket is the definitive mountain down jacket for use in freezing temperatures. Made from two weights of GORE-TEX INFINIUM™ WINDSTOPPER®, the outer is reinforced in high wear areas for better protection.<br><br>Highly breathable, windproof and water repellent with a soft feel, this jacket is perfect for high energy ascents. The Infinity Jacket is engineered to maximize down lofting, retain the maximum amount of heat and minimize any water ingress. It achieves this with offset boxwall baffle construction and intelligent vertical stitching that channels water away from the down inside. The Infinity Jacket uses the highest quality, 800FP goose down treated with a Nikwax® hydrophobic finish.<br><br>Designed for vertical ascents, the down jacket has a fully adjustable, helmet compatible hood with stiffened peak, articulated sleeves for full freedom of movement, and a two-way YKK® VISLON® ® AquaGuard® front zip with insulated storm flap. It has multiple zipped pockets, including two useful inner stretch mesh pockets for swallowing up a water bottle or gloves and a relaxed fit to accommodate extra layers when the temperature starts to plummet.",
  "img_hrefs": [
    "https://vpo.ca/images/product/large/336797.jpg"
  ],
  "name": "Rab Infinity Jacket - Mens",
  "price_cents": 7000000,
  "specs": [
    {
      "key": "Main",
      "value": "Zoned Gore-Tex Infinium™ Windstopper® fabrics, 30D (64 g"
    },
    {
      "key": "Lining",
      "value": "20D recycled (38 g"
    },
    {
      "key": "Insulation",
      "value": "800FP European Goose Down with Nikwax Fluorocarbon-Free Hydrophobic Finish (250g"
    },
    {
      "key": "Weight (Size Medium)",
      "value": "805 g"
    },
    {
      "key": "Center back length (Size Medium)",
      "value": "31.1 in"
    }
  ],
  "url": "https://vpo.ca/product/336797/infinity-jacket-mens"
}