{
  "description": "Balancing protective details for the most turbulent weather with a lightweight, streamlined design, this is an essential layer for dedicated mountain runners, built with our own highly breathable, waterproof Proflex™ fabric.<br><br>Built for running days when the weather is against you, the Kinetic Ultra Jacket offers uncompromised protection in an ultra-breathable, lightweight package. The latest evolution in our Kinetic range, this jacket is engineered specifically for fast paced mountain ascents on the worst weather days, made with our own waterproof Proflex™ fabric.<br><br>Adaptable, quiet to wear, and soft to the touch, our advanced 3-layer Proflex™ provides the waterproof protection of a hardshell, with the stretch and comfort of a softshell. Highly breathable and fast wicking, it regulates your temperature and keeps you dry, now made with 100% recycled polyester on the face and backer.<br><br>The close-fitting, roll-away hood with laminated, cap style peak is designed for weather protection without limiting vision. It has a crown adjustment to secure the fit and a rear vent for air flow when the incline increases. Additional ventilation holes on the back of the upper arms help regulate your temperature and a lightweight, full length zip with a waterproof storm flap can be zipped right up to the neck to seal out the weather.<br><br>Extended cuffs protect the back of the hands with a stretch binding to secure them at the wrist. A body contouring fit ensures maximal mobility without any excess fabric while side adjusters can cinch the jacket in to seal out the wind. There’s also a handy upper arm zipped pocket to store a card, key or gels.<br><br>Form fitting, articulated, and adaptable, the Kinetic Ultra helps you find your flow in the most challenging mountain conditions.",
  "img_hrefs": [
    "https://vpo.ca/images/product/large/348923.jpg"
  ],
  "name": "Rab Kinetic Ultra Jacket - Mens",
  "price_cents": 3150000,
  "specs": [
    {
      "key": "Proflex™ 3-layer recycled polyester stretch knit face with PU membrane (120 g/m²) with Fluorocarbon-free DWR. HH",
      "value": "10,000 mm \\ MVTR"
    },
    {
      "key": "Fit",
      "value": "Regular"
    },
    {
      "key": "Centre back length (Size M)",
      "value": "74 cm"
    },
    {
      "key": "Weight",
      "value": "277 g"
    }
  ],
  "url": "https://vpo.ca/product/348923/kinetic-ultra-jacket-mens"
}