{
  "description": "Built for all-day comfort, these adaptable biking over shorts are made from a breathable softshell fabric, ideal for any riding adventure. With thigh venting zips for further ventilation and saddle reinforcements for durability.<br><br>Crafted using lightweight, breathable Matrix™ softshell fabric, these versatile bike shorts can be worn over your cargo shorts, bibs or liners and are ideally adapted for all your two-wheeled adventures, whether it’s a local loop or multi-day mission. Falling above the knee, the shorts are stylish yet perfectly tailored for days in the saddle, with a raised centre back for a comfortable on-bike fit.<br><br>Matrix™ reinforcements on the seat and rear thighs give you the durability you need to take your riding to the next level. You can ensure a secure fit using the two hook and loop waist adjustments, while an offset inseam reduces the risk of sore spots after a day of tackling big ascents. Concealed thigh venting zips provide airflow when you’re pushing up an incline, as well as access to your Rab cargo short pockets underneath. Any essentials you need closer to hand can be stored in the zipped hand pockets, which have been strategically placed so you can reach them while in the saddle.<br><br>Both the main fabric and the reinforcements are finished with a fluorocarbon-free DWR, making the Cinder Crank Shorts durable, adaptable and ready for you to hit any mountain trail.",
  "img_hrefs": [
    "https://vpo.ca/images/product/large/355982.jpg"
  ],
  "name": "Rab Cinder Crank Shorts, 12\" Inseam - Mens",
  "price_cents": 1700000,
  "specs": [
    {
      "key": "Primary",
      "value": "95% Polyamide, 5% Elastane"
    },
    {
      "key": "Secondary",
      "value": "91% Polyamide, 9% Elastane"
    },
    {
      "key": "Weight",
      "value": "233 g"
    },
    {
      "key": "Fit",
      "value": "Regular"
    }
  ],
  "url": "https://vpo.ca/product/355982/cinder-crank-shorts-12-inseam-mens"
}