{
  "description": "Built to insulate you from hostile temperatures on rugged ascents, these midlayer pants are warm when you’re static and temperature-regulating on the move. With breathable fabric and body-mapped insulation, they’re perfect for layering under shell pants on skiing and mountaineering adventures.<br><br>Expertly balancing warmth, breathability, low weight, and minimal bulk, these insulated midlayer pants are perfect for wearing under your shell pants to beat the chill on freezing days. The ¾ length is designed with ski boots in mind and is easy to layer, making them suitable for a range of pursuits and variable temperatures. Constructed with highly breathable Pertex® Quantum Air fabric, the pants are warm when you’re static and temperature-regulating when you’re battling a steep incline, ideal for ski touring, mountaineering, and other stop-start activities.<br><br>The PrimaLoft® Gold Insulation Active+ has been zoned to keep your core muscles warm while reducing bulk, giving you the mobility you need on the boot pack and on deep powder turns. Quilting across the seat and thighs keeps the insulation secure and enhances your freedom of movement, while the articulated knees and stretch fleece panels provide added comfort and optimal fit. The deep stretch waistband with drawcord adjustment will keep you comfortable and unrestricted on both the up and the down.<br><br>Built with a 100% recycled liner, 55% recycled insulation, and finished with a fluorocarbon-free DWR, the Xenair ¾ Pants are designed to manage your microclimate on challenging mountain",
  "img_hrefs": [
    "https://vpo.ca/images/product/large/357352.jpg"
  ],
  "name": "Rab Xenair 3/4 Pants - Mens",
  "price_cents": 2000000,
  "specs": [
    {
      "key": "Outer",
      "value": "100% Polyamide with Acrylic Coating"
    },
    {
      "key": "Lining",
      "value": "100% Polyamide (Recycled Fibres)"
    },
    {
      "key": "Panels",
      "value": "94% Polyester, 6% Elastane"
    },
    {
      "key": "Insulation",
      "value": "80 g"
    },
    {
      "key": "Filling",
      "value": "55% Polyester (Recycled Fibres), 45% Polyester"
    },
    {
      "key": "Fit",
      "value": "Slim"
    },
    {
      "key": "Weight",
      "value": "244 g"
    }
  ],
  "url": "https://vpo.ca/product/357352/xenair-34-pants-mens"
}