{
  "description": "Salomon's RC 10 eSKIN Vitane feature a brand-new Stringer Core to give women lighter and more performant classic skis. The eSKINGRIP+ insert delivers precise, secure and silent grip, while the Shift binding makes it easy to adjust it and fine-tune the performance of your skis. Delivered in pack, slide on the binding and go! &lt;br&gt;&lt;br&gt;Push boundaries with gear that matches your expertise. Our high-performance skis deliver optimal glide and acceleration. Responsive boots offer superior energy transfer, while advanced bindings provide micro-adjustments. Elevate your experience with top-tier gear that lets you excel on any terrain.&lt;br&gt;&lt;br&gt;Enhance classic skiing with skin grip innovation. Mohair/synthetic skin in grip zone for excellent traction and glide. Reliable propulsion on any terrain and snow type. Embrace hassle-free, high-performance skiing.&lt;br&gt;",
  "img_hrefs": [
    "https://vpo.ca/images/product/medium/362220.jpg"
  ],
  "name": "RC10 eSkin Vitane Hard + Prolink Shift - Set",
  "price_cents": 69900,
  "specs": [
    {
      "key": "Master diagonal strides on all terrains with Classic equipment",
      "value": "Long, grippy Classic Skis for reliable traction. Flexible Boots for effective striding. Stable Bindings for controlled pivoting. Elevate your classic skiing journey!"
    },
    {
      "key": "World Cup Universal Grinding",
      "value": "Developed in collaboration with our athletes, this extremely polyvalent grind provides you with the fastest glide available"
    },
    {
      "key": "Digital Grinding Measurement",
      "value": "The ski's base is digitally measured after grinding to ensure outmost precision and performance"
    },
    {
      "key": "Fluor Free Pre-Waxed by Swix",
      "value": "These skis are delivered pre-waxed with the universal fluor-free wax from Swix. * Simply scrap the wax off the base and instantly enjoy a more sustainable glide!"
    },
    {
      "key": "My Custom Ski",
      "value": "Our high-quality production process enables you to select the exact ski you need based on your bodyweight"
    },
    {
      "key": "Classic Parallel Sidecut",
      "value": "Parallel sidecut that helps skis track straight and fast"
    },
    {
      "key": "29 Universal",
      "value": "Our latest classic racing concept is designed to amplify kick and acceleration. It offers ideal press adjustment, especially in universal snow conditions"
    },
    {
      "key": "D2FC Digital Dynamic Flex Control",
      "value": "Digital control of the molding press enables the generation of optimal flex and camber for specific performance on snow. D2FC ensures also perfect ski pairing"
    },
    {
      "key": "G5 Universal base",
      "value": "World Cup base delivering maximum performance in universal conditions"
    },
    {
      "key": "Stringer Core",
      "value": "The reverse fishbone-shaped Stringer Core minimizes the volume of raw material used in the ski’s core, while maintaining the structural integrity and torsional rigidity of the ski"
    },
    {
      "key": "eSKINGRIP+",
      "value": "100% MOHAIR skin with equal balance of grip and glide. You can switch it manually if you want to use the eSKINRACE to get into racing mode!"
    },
    {
      "key": "Weight",
      "value": "1.23 kg pair with plate"
    },
    {
      "key": "Waist",
      "value": "44 mm"
    },
    {
      "key": "Tail",
      "value": "44 mm"
    }
  ],
  "url": "https://vpo.ca/product/362220/rc10-eskin-vitane-hard-prolink-shift-set"
}