{
  "description": "Built for skiers wanting performance in all conditions, Salomon's RC8 eSKIN skis offer classic performance without daily waxing. The eSKINGRIP+ insert delivers a precise, secure and silent grip, while the brand-new reverse-fishbone Stringer Core offers lightweight and a more performant ski. Delivered premounted with a Shift binding. &lt;br&gt;&lt;br&gt;Advance your skiing with gear built for performance and ease. Our responsive skis optimize control, ideal for refining your strides. Supportive boots boost edge grip, ensuring optimal power transfer. Precision bindings complete the package. Elevate your skills with equipment designed for real improvement.&lt;br&gt;&lt;br&gt;Enhance classic skiing with skin grip innovation. Mohair/synthetic skin in grip zone for excellent traction and glide. Reliable propulsion on any terrain and snow type. Embrace hassle-free, high-performance skiing.",
  "img_hrefs": [
    "https://vpo.ca/images/product/medium/362086.jpg"
  ],
  "name": "RC8 eSkin Med + Prolink Shift - Set",
  "price_cents": 47900,
  "specs": [
    {
      "key": "Classic",
      "value": "Master diagonal strides on all terrains with Classic equipment"
    },
    {
      "key": "World Cup Grinding",
      "value": "Low pressure stone grinding with light structure for fast glide in all snow conditions"
    },
    {
      "key": "My Custom Ski",
      "value": "Our high-quality production process enables you to select the exact ski you need based on your bodyweight"
    },
    {
      "key": "Classic Parallel Sidecut",
      "value": "Parallel sidecut that helps skis track straight and fast"
    },
    {
      "key": "29 Universal",
      "value": "Our latest classic racing concept is designed to amplify kick and acceleration. It offers ideal press adjustment, especially in universal snow conditions"
    },
    {
      "key": "D2FC Digital Dynamic Flex Control",
      "value": "Digital control of the molding press enables the generation of optimal flex and camber for specific performance on snow. D2FC ensures also perfect ski pairing"
    },
    {
      "key": "G4 base",
      "value": "Racing base with additive for better wax absorption and retention"
    },
    {
      "key": "Stringer Core",
      "value": "The reverse fishbone-shaped Stringer Core minimizes the volume of raw material used in the ski’s core, while maintaining the structural integrity and torsional rigidity of the ski"
    },
    {
      "key": "eSKINGRIP+",
      "value": "100% MOHAIR skin with equal balance of grip and glide. You can switch it manually if you want to use the eSKINRACE to get into racing mode!"
    },
    {
      "key": "Weight Sample size",
      "value": "1.4 kg pair with plate"
    },
    {
      "key": "Tip",
      "value": "44mm"
    },
    {
      "key": "Waist",
      "value": "44mm"
    },
    {
      "key": "Tail",
      "value": "44mm"
    }
  ],
  "url": "https://vpo.ca/product/362086/rc8-eskin-med-prolink-shift-set"
}