{
  "description": "Vibrantly illustrated guide motivates women with inspiration, tips, and advice to add more outdoor adventure to their lives&lt;br&gt;* Creative exercises to encourage action and record accomplishments&lt;br&gt;* Tips for making aspirational lists, planning to achieve goals, and tracking progress&lt;br&gt;*  Vibrant, colorful artwork engages and inspires&lt;br&gt;&lt;br&gt;Rise &amp; Roar: A Guided Journal for Outdoor Adventure meets women where they are in life, and challenges and inspires them to get outside. Encouraging women to define their motivation, examine their fears, and create their own adventure manifesto, Sharisse Steber offers tips about an abundance of new experiences: observing nature, planning a hike or backpacking trip, car camping, training for a marathon, biking on singletrack or pavement, climbing at a gym or outside, canoeing or kayaking, training and recovery, and all the ways to play in thesnow.&lt;br&gt;&lt;br&gt;Author and illustrator Sharisse Steber has hiked to Everest Base Camp, summited Kilimanjaro, backpacked on the Lares Inca Trail in Peru, caved and camped solo on Easter Island, and experienced winter camp training on frozen Minnesota lakes. Steber knows firsthand that you don't have to be super fit or have a lot of money to have amazing experiences everyone has the right and ability to live her own idea of outdoor adventure. This journal encourages women of all shapes, sizes, and colors to overcome their fears, head outside, and begin.",
  "img_hrefs": [
    "https://vpo.ca/images/product/medium/362360.jpg"
  ],
  "name": "Rise and Roar: A Guided Journal for Outdoor Adventure",
  "price_cents": 2995,
  "specs": [
    {
      "key": "Publisher",
      "value": "‎Mountaineers Books (Aug. 1 2021)"
    },
    {
      "key": "Language",
      "value": "English"
    },
    {
      "key": "Paperback",
      "value": "‎128 pages"
    },
    {
      "key": "ISBN-10",
      "value": "‎1680515225"
    },
    {
      "key": "ISBN-13",
      "value": "‎978-1680515220"
    },
    {
      "key": "Weight",
      "value": "‎399 g"
    },
    {
      "key": "Dimensions",
      "value": "‎18.39 x 1.6 x 23.01 cm"
    }
  ],
  "url": "https://vpo.ca/product/362360/rise-and-roar-a-guided-journal-for-outdoor-adventure"
}