{
  "description": "&lt;p&gt;Salomon's S/Max Skate ski set is designed to help you take your skate skiing skills to the next level and raise to any challenge you set your mind to. Made to excel in all snow conditions, it’s delivered in pack with the Prolink Shift Race binding!&lt;br&gt;&lt;br&gt;Skating: Elevate your speed and agility on groomed trails with Skate gear. Our responsive skis and supportive boots with firm soles ensure efficient power transmission. Lightweight bindings enable quick lateral movements, taking your skating experience to new heights.&lt;br&gt;&lt;br&gt;Push boundaries with gear that matches your expertise. Our high-performance skis deliver optimal glide and acceleration. Responsive boots offer superior energy transfer, while advanced bindings provide micro-adjustments. Elevate your experience with top-tier gear that lets you excel on any terrain.&lt;br&gt;&lt;br&gt;Experience classic skiing with grip zone technology. Treated base with grip wax delivers controlled glide and traction. Choose the appropriate wax according to snow conditions and elevate your skiing with precise performance adjustment.&lt;br&gt;&lt;/p&gt;",
  "img_hrefs": [
    "https://vpo.ca/images/product/medium/362089.jpg"
  ],
  "name": "S/Max Skate + Prolink Shift Race - Set",
  "price_cents": 80900,
  "specs": [
    {
      "key": "World Cup Universal Grinding",
      "value": "Developed in collaboration with our athletes, this extremely polyvalent grind provides you with the fastest glide available."
    },
    {
      "key": "Digital Grinding Measurement",
      "value": "The ski's base is digitally measured after grinding to ensure outmost precision and performance."
    },
    {
      "key": "Fluor Free Pre-Waxed by Swix",
      "value": "These skis are delivered pre-waxed with the universal fluor-free wax from Swix. Simply scrap the wax off the base and instantly enjoy a more sustainable glide!"
    },
    {
      "key": "My Custom Ski",
      "value": "Our high-quality production process enables you to select the exact ski you need based on your bodyweight."
    },
    {
      "key": "D2FC Digital Dynamic Flex Control",
      "value": "Digital control of the molding press enables the generation of optimal flex and camber for specific performance on snow. D2FC ensures also perfect ski pairing."
    },
    {
      "key": "34 Universal",
      "value": "Salomon's most polyvalent construction so far features a triangle thickness profile which improves acceleration, while the balanced camber adds stability to every stride."
    },
    {
      "key": "G5 Universal base",
      "value": "World Cup base delivering maximum performance in universal conditions."
    },
    {
      "key": "S-CORE 45",
      "value": "Blending the proven durability of Densolite with the lightness of recycled PET foam, the S-CORE 45 uses nine (201mm ski) recycled plastic bottles to make 45% of the core’s weight."
    },
    {
      "key": "Thin Ply Carbon",
      "value": "The THIN PLY Carbon optimizes the ski’s torsion, creating stability"
    },
    {
      "key": "Weight Sample size",
      "value": "1.26 kg pair with plate"
    },
    {
      "key": "Tip",
      "value": "44 mm"
    },
    {
      "key": "Waist",
      "value": "43 mm"
    },
    {
      "key": "Tail",
      "value": "44 mm"
    }
  ],
  "url": "https://vpo.ca/product/362089/smax-skate-prolink-shift-race-set"
}