{
  "description": "Built for skiers looking for race-like speed and confidence no matter the conditions, Salomon's S/Race eSKIN ski set is perfect for races and all-day events. Delivered in pack, just slide the light and performant Shift Race binding on the plate to optimize your grip and glide. &lt;br&gt;&lt;br&gt;Master diagonal strides on all terrains with Classic equipment: Long, grippy Classic Skis for reliable traction. Flexible Boots for effective striding. Stable Bindings for controlled pivoting. Elevate your classic skiing journey!&lt;br&gt;&lt;br&gt;Dominate the track with gear crafted for experts. Our racing skis combine speed and stability. Precision-engineered boots maximize power, while cutting-edge bindings ensure unmatched control. Elevate your performance with gear that meets the demands of expert cross-country skiing.&lt;br&gt;&lt;br&gt;Enhance classic skiing with skin grip innovation. Mohair/synthetic skin in grip zone for excellent traction and glide. Reliable propulsion on any terrain and snow type. Embrace hassle-free, high-performance skiing.&lt;br&gt;",
  "img_hrefs": [
    "https://vpo.ca/images/product/medium/362091.jpg"
  ],
  "name": "S/Race eSkin Hard + Prolink Shift Race - Set",
  "price_cents": 93900,
  "specs": [
    {
      "key": "Classic Parallel Sidecut",
      "value": "Parallel sidecut that helps skis track straight and fast"
    },
    {
      "key": "World Cup Universal Grinding",
      "value": "Developed in collaboration with our athletes, this extremely polyvalent grind provides you with the fastest glide available"
    },
    {
      "key": "Digital Grinding Measurement",
      "value": "The ski's base is digitally measured after grinding to ensure outmost precision and performance"
    },
    {
      "key": "Pre-waxed &amp; Brushed",
      "value": "The base is already pre-waxed and pre-brushed so you can enjoy the glide from your very first ski session"
    },
    {
      "key": "My Custom Ski",
      "value": "Our high-quality production process enables you to select the exact ski you need based on your bodyweight"
    },
    {
      "key": "Classic Parallel Sidecut",
      "value": "Parallel sidecut that helps skis track straight and fast"
    },
    {
      "key": "29 Universal",
      "value": "Our latest classic racing concept is designed to amplify kick and acceleration. It offers ideal press adjustment, especially in universal snow conditions"
    },
    {
      "key": "D2FC Digital Dynamic Flex Control",
      "value": "Digital control of the molding press enables the generation of optimal flex and camber for specific performance on snow. D2FC ensures also perfect ski pairing"
    },
    {
      "key": "G5 Universal base",
      "value": "World Cup base delivering maximum performance in universal conditions"
    },
    {
      "key": "Nomex",
      "value": "Ultra-light composite honeycomb core, combined with carbon, fiberglass wrap and thin wood sidewalls. Reduces weight and provides optimum consistency"
    },
    {
      "key": "eSKINGRIP+",
      "value": "100% MOHAIR skin with equal balance of grip and glide. You can switch it manually if you want to use the eSKINRACE to get into racing mode!"
    },
    {
      "key": "Weight Sample size",
      "value": "1.18 kg pair with plate"
    },
    {
      "key": "Tip",
      "value": "44 mm"
    },
    {
      "key": "Waist",
      "value": "44 mm"
    },
    {
      "key": "Tail",
      "value": "44 mm"
    }
  ],
  "url": "https://vpo.ca/product/362091/srace-eskin-hard-prolink-shift-race-set"
}