{
  "description": "Designed in Montebelluna, the cradle of alpine footwear craftsmanship, our MTN Trainer 2 is a hard-wearing and versatile low-cut alpine approach shoe with a high-quality 1.6-millimetre suede leather upper and a Vibram outsole. Its robust upper has a full protective rubber rand for 360° abrasion resistance in rocky terrain and foot jams, plus a fast-drying GORE-TEX® Extended Comfort lining for durable waterproofing and optimized breathability. <br><br>There is a protective stretch gaiter under the laces to keep rain and groundwater out. The improved lasted construction is 15% lighter and more flexible than the original and ensures a comfortable fit, while the expanded PU midsole provides long-lasting shock absorbency and rebound. The multifunctional Vibram outsole gives agility and stability in rugged terrain. Its deep, self-cleaning grooves and aggressive lugs guarantee good grip on rock and scree and optimal traction on mud and grass. <br><br>Under the midfoot, a special via ferrata tread zone has specific right-angled lugs that maximise the force applied through the foot for better grip on the rungs of iron ladders than a conventional shoe. Their signature 3F system connects the instep area with the sole and heel for flexibility, correct fit and support. A cushioning OrthoLite footbed wicks away moisture, helping to keep your feet cool. The climbing lacing can also be fine-tuned at the toe for greater precision and support in technical terrain. <br><br>The MTN Trainer 2 is made in Europe and offers the perfect alpine approach solution for technical hikes, via ferratas and treks in all conditions and remote terrain.",
  "img_hrefs": [
    "https://vpo.ca/images/product/large/359113.jpg"
  ],
  "name": "Salewa Mountain Trainer 2 GTX - Mens",
  "price_cents": 2999500,
  "specs": [
    {
      "key": "Footbed",
      "value": "Ortholite®"
    },
    {
      "key": "Insole",
      "value": "Mid stiff"
    },
    {
      "key": "Lining",
      "value": "Gore-Tex® Extended Comfort"
    },
    {
      "key": "Midsole",
      "value": "Expanded PU"
    },
    {
      "key": "Outsole",
      "value": "Vibram MTN Trainer Evo"
    },
    {
      "key": "Upper",
      "value": "1.6mm suede leather, 3F System with Steel Cables, 360° full rubber rand, Highly wear-resistant fabric"
    },
    {
      "key": "Drop",
      "value": "11 mm (Heel Stack Height 30 mm"
    }
  ],
  "url": "https://vpo.ca/product/359113/mountain-trainer-2-gtx-mens"
}