{
  "description": "Reliable protection<br>The Alp Trainer 2 is a progressive mid-cut hiking boot with a hard-wearing, high-quality suede and stretch fabric upper and a waterproof, breathable GORE-TEX® Extended Comfort lining that provides reliable protection for hiking in variable terrain and diverse conditions. It has a generous front rubber rand for additional rock and scree-resistant protection.<br><br>Adaptable comfort<br>Designed for step-in comfort right out of the box, it enables a precise, supportive and wrapping fit. Our proprietary, trademarked 3F System with a steel cable ensures firm ankle support and side stability, while the Flex Collar increases the ankle’s rear range of motion and comfort during descents. In addition, the customisable SALEWA® Multi Fit Footbed Plus (MFF+) has interchangeable layers that allow you to further fine-tune the volume. And the Climbing Lacing allows adjustment right down to the toe for better performance on technical sections.<br><br>Enhanced grip &amp; traction<br>Underfoot, the improved Vibram® Alpine Hiking outsole, which is exclusive to SALEWA®, provides enhanced performance and control in a wide range of mountain terrain and also excels in wet and muddy conditions thanks to its dedicated climbing, traction and braking zones and the aggressive lug pattern.<br><br>The Alp Trainer 2 is a lightweight, agile and comfortable boot that represents an excellent choice for alpine hiking-related activities.",
  "img_hrefs": [
    "https://vpo.ca/images/product/large/334178.jpg"
  ],
  "name": "Salewa Alp Trainer 2 Mid GTX - Mens",
  "price_cents": 3099500,
  "specs": [
    {
      "key": "Upper",
      "value": "3F System with Steel Cables, Protective rand, Stretch fabric, Suede 1.4-1.6 mm"
    },
    {
      "key": "Lining",
      "value": "Gore-Tex® Extended Comfort"
    },
    {
      "key": "Insole",
      "value": "Mid Stiff - Nylon"
    },
    {
      "key": "Footbed",
      "value": "MFF+"
    },
    {
      "key": "Midsole",
      "value": "EVA"
    },
    {
      "key": "Outsole",
      "value": "Vibram Alpine Hiking"
    },
    {
      "key": "Drop",
      "value": "8 mm (Heel Stack Height 24 mm"
    }
  ],
  "url": "https://vpo.ca/product/334178/alp-trainer-2-mid-gtx-mens"
}