{
  "description": "The Rapace GTX is a lightweight mountaineering boot that teams a hard-wearing nubuck and fabric upper with waterproof and breathable GORE-TEX® protection.<br><br>Secure grip meets comfort and support – SALEWA’s solution for via ferratas mountaineering. The Rapace GTX features our 3F System for ankle support, flexibility and a perfect fit, and an improved rear ankle mobility thanks to the patented Flex Collar. Its Vibram WTC outsole has an aggressive tread pattern that gives good traction, yet provides a natural feel and secure grip on rock, and it's coupled with the Bilight TPU midsole providing a long-lasting cushion compared to the traditional sole packs.<br><br>Inside the boot, SALEWA’s Bilight technology in the midsole ensures an ergonomic hold and long-lasting cushioning for extended comfort. The Rapace GTX is also stiff enough for use with semi-automatic crampons. In addition, the GORE-TEX® Performance Comfort lining delivers optimized climate comfort should the weather close in on you and there’s a full rubber rand for protection against rock and scree.",
  "img_hrefs": [
    "https://vpo.ca/images/product/large/301806.jpg"
  ],
  "name": "Salewa Rapace GTX - Mens",
  "price_cents": 3999500,
  "specs": [
    {
      "key": "CSR",
      "value": "Fair Wear Foundation"
    },
    {
      "key": "Footbed",
      "value": "MFF+"
    },
    {
      "key": "Insole",
      "value": "Bilight Midsole, Crampon Compatible, Stiff"
    },
    {
      "key": "Lining",
      "value": "GORE-TEX® Performance Comfort"
    },
    {
      "key": "Midsole",
      "value": "TPU"
    },
    {
      "key": "Outsole",
      "value": "Vibram® WTC"
    },
    {
      "key": "Upper",
      "value": "1.8mm Nubuk, 3F System with Steel Cables, 360° full rubber rand, Highly wear-resistant fabric"
    },
    {
      "key": "Drop",
      "value": "15 mm (Heel Stack Height 31 mm"
    },
    {
      "key": "Fit",
      "value": "Wide"
    }
  ],
  "url": "https://vpo.ca/product/301806/rapace-gtx-mens"
}