{
  "description": "The Pedroc PTX is designed for moving fast in and training for the mountains. It’s a lightweight, versatile and protective technical shoe that delivers the goods both in mixed mountain and urban scenarios. For additional waterproof protection and enhanced breathabilty performance, it’s equipped with a lightweight, durable and sustainable Powertex® membrane.<br><br>To protect feet in rugged terrain, the strong ripstop mesh upper and TPU rand offer high abrasion resistance, while the integrated SALEWA® 3F system improves support and stability, even on edgy surfaces.<br><br>Underfoot, the Pomoca™ Speed Hiker Pro outsole has a tread that works well on mud, grass and rock, offering the optimal combination of stability, adaptability and traction thanks to its lug geometry and S-Path Technology, while the cushioning EVA midsole delivers optimal rebound and comfort.<br><br>The Pedroc PTX is a SALEWA® Committed product manufactured according to independently-audited environmental and social responsibility standards with a PFC-free, water-repellent membrane.<br><br>Our versatile, adaptable and protective speed hiking shoe.",
  "img_hrefs": [
    "https://vpo.ca/images/product/large/354540.jpg"
  ],
  "name": "Salewa Pedroc PTX - Mens",
  "price_cents": 2499500,
  "specs": [
    {
      "key": "CSR",
      "value": "Salewa Committed"
    },
    {
      "key": "Footbed",
      "value": "MFF+"
    },
    {
      "key": "Lining",
      "value": "PowerTex"
    },
    {
      "key": "MIDSOLE",
      "value": "EVA"
    },
    {
      "key": "Outsole",
      "value": "Pomoca Speed Hiker"
    },
    {
      "key": "Upper",
      "value": "3F System with Kevlar® Cables, Cables with resistant Kevlar core, High-resistance ripstop PE, Lightweight transparent ripstop mesh PE, Protective TPU rand"
    },
    {
      "key": "Drop",
      "value": "8 mm (Heel Stack Height 30 mm"
    },
    {
      "key": "Fit",
      "value": "0"
    },
    {
      "key": "Gender",
      "value": "Male"
    },
    {
      "key": "Single shoe weight",
      "value": "345 g (9 UK)"
    },
    {
      "key": "Sole segment",
      "value": "Speed Hiking"
    }
  ],
  "url": "https://vpo.ca/product/354540/pedroc-ptx-mens"
}