{
  "description": "Engineered for moving faster and lighter on all terrain, the MTN Trainer Lite Mid also performs well on rock. Its highly wear-resistant, but lightweight, TPU-coated fabric upper has suede inserts for stability and is coupled with GORE-TEX® Extended Comfort lining for durable waterproof protection without sacrificing breathable comfort. <br><br>The unique lasted mid-cut boot construction includes our trademark 3F system that connects the instep, sole and heel to ensure a comfortable, supportive and flexible fit. This is further supported by the shock-absorbing EVA midsole for long-lasting rebound. For additional stability and protection, there is a flexible ankle cuff, heel stabilizer and rubber toe cap. Overall your foot has good freedom of movement, yet still feels well supported. <br><br>With climbing lacing right down to the toe to allow fine-tuning for greater precision in technical terrain. Underfoot, the outsole guarantees reliable grip thanks to the Pomoca compound rubber and tread pattern with deep lugs and grooves and the versatility to cope with a wide range of terrain from mud and grass to rock, ice and snow. The men’s MTN Trainer Lite Mid is a lighter mid-top, 3-season alpine footwear solution for technical hikes, and long backpacking routes in all weathers.<br>",
  "img_hrefs": [
    "https://vpo.ca/images/product/large/340710.jpg"
  ],
  "name": "Salewa Mountain Trainer Lite Mid GTX - Mens",
  "price_cents": 2999500,
  "specs": [
    {
      "key": "Footbed",
      "value": "Salewa footbed"
    },
    {
      "key": "Insole",
      "value": "Mid stiff"
    },
    {
      "key": "Lining",
      "value": "Gore-Tex® Extended Comfort"
    },
    {
      "key": "Midsole",
      "value": "EVA"
    },
    {
      "key": "Outsole",
      "value": "Pomoca MTN trainer Lite"
    },
    {
      "key": "Upper",
      "value": "Highly wear-resistant fabric, 1.6mm suede leather, 3F System with Steel Cables"
    },
    {
      "key": "Drop",
      "value": "13mm (Heel Stack Height"
    },
    {
      "key": "Fit",
      "value": "Wide"
    }
  ],
  "url": "https://vpo.ca/product/340710/mountain-trainer-lite-mid-gtx-mens"
}