{
  "description": "An ultra-technical hiking shoe that helps you achieve all your outdoor goals. Designed to adapt to all your desires, the Outpulse Gore-Tex is as versatile as it is efficient. Combining grip and protection, this model has a sole that offers exceptional energy return and cushioning thanks to our new Fuze Foam. Reinvent your outdoor adventures.",
  "img_hrefs": [
    "https://vpo.ca/images/product/large/346091.jpg"
  ],
  "name": "Salomon Outpulse GTX - Mens",
  "price_cents": 1799500,
  "specs": [
    {
      "key": "Inlay sole",
      "value": "Textile"
    },
    {
      "key": "Lining",
      "value": "Textile"
    },
    {
      "key": "Outsole",
      "value": "Rubber"
    },
    {
      "key": "Upper",
      "value": "Textile"
    },
    {
      "key": "Drop",
      "value": "10 mm"
    },
    {
      "key": "Heel stack height",
      "value": "31.7 mm"
    },
    {
      "key": "Forefoot stack height",
      "value": "21.7 mm"
    },
    {
      "key": "Weight",
      "value": "352 g"
    },
    {
      "key": "Lacing system",
      "value": "Regular laces"
    },
    {
      "key": "Waterproofness",
      "value": "GORE-TEX"
    },
    {
      "key": "Fuze Surge",
      "value": "Comprised of one of our softest EVA compound and engineered using less artificial polymers, Fuze Surge delivers a more earth-conscious, smooth yet dynamic stride"
    },
    {
      "key": "Reverse Camber",
      "value": "Inspired by Salomon's ski heritage, this curved midsole geometry helps you feel like you are floating over the ground"
    },
    {
      "key": "Energy Blade Outdoor",
      "value": "Engineered into the midsole, Energy Blade is a lightweight TPU plate works in cohesion with the soft and springy midsole to filter the ground and deliver a smooth, dynamic stride"
    },
    {
      "key": "All Terrain Contagrip®",
      "value": "Their All Terrain Contagrip® is built for the widest variety of surfaces. It delivers durability &amp; confidence on wet, dry, hard or loose surfaces"
    },
    {
      "key": "Water Repellent",
      "value": "A special treatment is applied to provide extra protection, ensuring that the fabric does not absorb water during light rain and showers"
    },
    {
      "key": "Textile lining",
      "value": "A soft, breathable lining for extreme comfort"
    },
    {
      "key": "OrthoLite® diecut sockliner",
      "value": "Cut to the shape of the inner shoe, this OrthoLite® insole provides superior cushioning, breathability and durability, upgrading the comfort and performance of the footwear"
    },
    {
      "key": "Regular laces",
      "value": "Traditional lacing system with eyelets"
    },
    {
      "key": "Recycled material",
      "value": "Materials made from recycled products such as PET bottles or material waste"
    }
  ],
  "url": "https://vpo.ca/product/346091/outpulse-gtx-mens"
}