{
  "description": "The Sense Ride 5 is equally in it’s element on short, fast trail runs as well as ultra distances. A super comfortable overachiever that easily adapts to a variety of terrains, with balanced midsole for cushioning, response and an engineered mesh upper with Sensifit for just the right amount of comfortable hold.",
  "img_hrefs": [
    "https://vpo.ca/images/product/large/356444.jpg"
  ],
  "name": "Salomon Sense Ride 5 - Mens",
  "price_cents": 1359600,
  "specs": [
    {
      "key": "Outsole",
      "value": "Their All Terrain Contagrip® adapts to a multitude of surfaces. It offers great durability and boosts your confidence on wet, dry, hard or unstable terrain"
    },
    {
      "key": "Midsole",
      "value": "Energy Foam - A lightweight, responsive foam made from a combination of EVA and Olefin [OBC] that provides long-lasting cushioning and dynamic energy return"
    },
    {
      "key": "Upper Material",
      "value": "Engineered Mesh- Thanks to its varied weave, the Engineered Mesh offers more support and resistance, or flexibility and breathability, depending on the needs of each part of the shoe"
    },
    {
      "key": "Upper",
      "value": "SensiFit™ wraps the foot from the midsole to the lacing system, providing a secure, precise and almost custom fit all around the foot"
    },
    {
      "key": "Interlay",
      "value": "The Profeel Film increases the sensations of fluidity and stability by acting as a filter between the foot and the ground."
    },
    {
      "key": "Insole",
      "value": "Textile"
    },
    {
      "key": "Lining",
      "value": "MCL textiles"
    },
    {
      "key": "Outsole",
      "value": "Rubber"
    },
    {
      "key": "Upper",
      "value": "Textile"
    },
    {
      "key": "Drop",
      "value": "8 mm"
    },
    {
      "key": "Stud depth",
      "value": "3.5mm"
    },
    {
      "key": "Heel profile height",
      "value": "29.6 mm"
    },
    {
      "key": "Forefoot profile height",
      "value": "21.3 mm"
    },
    {
      "key": "Weight",
      "value": "286 g"
    },
    {
      "key": "Lacing system",
      "value": "Quicklace™"
    },
    {
      "key": "Impermeability",
      "value": "None"
    }
  ],
  "url": "https://vpo.ca/product/356444/sense-ride-5-mens"
}