{
  "description": "Designed to power through uphills and descents, the X ULTRA is now available in an all-winter version. Just as agile as a trail-running shoe, it offers all the stability, grip and protective comfort you need to tackle wintery terrain and cold temperatures. Not to mention cozy 3M Thinsulate™ insulation.",
  "img_hrefs": [
    "https://vpo.ca/images/product/large/345677.jpg"
  ],
  "name": "Salomon X Ultra 4 Mid Winter TS CSWP - Mens",
  "price_cents": 1999500,
  "specs": [
    {
      "key": "Inlay sole",
      "value": "Textile"
    },
    {
      "key": "Lining",
      "value": "Textile 100% Polyester"
    },
    {
      "key": "Outsole",
      "value": "Rubber"
    },
    {
      "key": "Upper",
      "value": "Leather"
    },
    {
      "key": "Drop",
      "value": "11 in mm"
    },
    {
      "key": "Heel stack height",
      "value": "24 mm"
    },
    {
      "key": "Forefoot stack height",
      "value": "13 mm"
    },
    {
      "key": "Weight",
      "value": "437 g"
    },
    {
      "key": "Lacing system",
      "value": "Regular laces"
    },
    {
      "key": "Waterproofness",
      "value": "ClimaSalomon Waterproof (CSWP)"
    },
    {
      "key": "Winter Contagrip®",
      "value": "For all winter conditions, the Winter Contagrip® uses a unique compound that maintains adhesion in freezing temperatures. Lug patterns depend on usage"
    },
    {
      "key": "ClimaSalomon™ Waterproof",
      "value": "A flexible, lightweight, full waterproof bootie to ensure complete weather protection"
    },
    {
      "key": "Thinsulate™ 200gr",
      "value": "Warm, thin, light and highly breathable, 200 gram Thinsulate™ Insulation is recommended for cool conditions and high activity levels where the wearer generates a lot of body heat"
    },
    {
      "key": "EnergyCell",
      "value": "A high performance EVA foam that provides shock attenuation"
    },
    {
      "key": "PU coated leather",
      "value": "A polyurethane coated leather that protects it and makes it stronger to last longer"
    },
    {
      "key": "Water Repellent",
      "value": "A special treatment is applied to provide extra protection, ensuring that the fabric does not absorb water during light rain and showers"
    },
    {
      "key": "Faux fur lining",
      "value": "A warm, cozy, insulated lining for winter use"
    },
    {
      "key": "Gusseted tongue",
      "value": "The tongue is connected to the upper on both sides, preventing debris from entering the shoe, and keeping the tongue centered"
    },
    {
      "key": "Active Support",
      "value": "These mobile wings help hold the foot in place and accompany its movement, adapting to its shape and volume"
    },
    {
      "key": "Molded EVA sockliner",
      "value": "A molded sockliner that improves comfort by mimicking the foot's natural shape"
    },
    {
      "key": "Winter Sockliner",
      "value": "Designed for cold temperatures, this sockliner features a 4mm layer of EVA foam for increased insulation, as well as a soft cover for extra comfort"
    }
  ],
  "url": "https://vpo.ca/product/345677/x-ultra-4-mid-winter-ts-cswp-mens"
}