{
  "description": "The newest member of the award-winning Spin family, the Spin Infinity is their most cushioned offering to date. Designed for long distance trail training and ultra racing, the Spin Infinity has a dual-density EVA midsole, featuring a low density base that provides plentiful cushioning and impact absorption, and on top of that is their Foot Stabilizer Control system (FSC). <br><br>The FSC system is a firmer EVA layer that encircles the perimeter of the midsole and also spans the arch area, providing lightweight stability and torsion control. The midsoles 4mm drop encourages an efficient stride, further enhancing its long distance capabilities. Secure ground contact is assured by the Vibram® outsole, combining 4mm lugs and Megagrip rubber to optimize traction and grip. The mesh and welded PU upper with Sock-Fit construction is light and breathable but still provides foot-wrapping support and a secure fit. This combination of upper and outsole package results in the perfect blend of weight savings, cushioning, support and traction. All of these elements come together seamlessly in this high-mileage trail machine.",
  "img_hrefs": [
    "https://vpo.ca/images/product/large/343802.jpg"
  ],
  "name": "Scarpa Spin Infinity - Mens",
  "price_cents": 1592000,
  "specs": [
    {
      "key": "Upper",
      "value": "Mesh &amp; PU Film &amp; Micro Nubuck"
    },
    {
      "key": "Lining",
      "value": "Polyester"
    },
    {
      "key": "Midsole",
      "value": "2D EVA-CM"
    },
    {
      "key": "Outsole",
      "value": "Vibram® Velox Cross"
    },
    {
      "key": "Insole",
      "value": "Ortholite® Strobel and Footbed"
    },
    {
      "key": "Last",
      "value": "ARSF"
    },
    {
      "key": "Cushion",
      "value": "High"
    },
    {
      "key": "Drop",
      "value": "4 mm"
    },
    {
      "key": "Underfoot Protection",
      "value": "Moderate"
    },
    {
      "key": "Weight",
      "value": "305 g"
    },
    {
      "key": "SOCK-FIT LW",
      "value": "Stretch fabric incorporated with a minimal stretch tongue provides gentle wrapping and support, reducing bulk and enhancing fit"
    }
  ],
  "url": "https://vpo.ca/product/343802/spin-infinity-mens"
}