{
  "description": "The latest addition to the successful Rush family, the Rush Trk GTX dials up the support and protection a notch with a suede leather upper and a rubber toe rand, backed by GORE-TEX® for guaranteed protection from the elements. The upper balances the light and agile feel of a trail running shoe with the support and protection you expect from a hiking boot. Underfoot support, protection and traction come courtesy of the exclusive PRESA outsole with Interactive Kinetic System (IKS) Technology. <br><br>The IKS system features impact absorbing internal domes placed in key ground contact areas that function as mechanical shock absorbers, while out SuperGum rubber compound provides secure grip on whatever terrain you encounter. The Dynamic Stabilizer Torsion frame supports the arch and wraps the heel on both sides, providing terrific rearfoot stability and torsion control so you can confidently tackle whatever the trail has in store.",
  "img_hrefs": [
    "https://vpo.ca/images/product/large/354904.jpg"
  ],
  "name": "Scarpa Rush Trek GTX - Mens",
  "price_cents": 2990000,
  "specs": [
    {
      "key": "Upper",
      "value": "1.8mm Suede &amp; Fabric"
    },
    {
      "key": "Lining",
      "value": "GORE-TEX® Extended Comfort"
    },
    {
      "key": "Insole",
      "value": "P-Flex Lite + DST TPU Frame"
    },
    {
      "key": "Midsole",
      "value": "3D EVA CM"
    },
    {
      "key": "Outsole",
      "value": "PRESA® HIK-001"
    },
    {
      "key": "Last",
      "value": "RHA"
    },
    {
      "key": "Weight (per shoe)",
      "value": "555 g"
    },
    {
      "key": "Origin",
      "value": "Vietnam"
    },
    {
      "key": "Suede Leather Upper with GORE-TEX",
      "value": "Sueded leather upper for protection, support and abrasion resistance. GORE-TEX® Extended Comfort lining guarantees waterproof-breathable protection"
    },
    {
      "key": "3D Auto-fit Ankle Collar",
      "value": "Stretch fabric and molded foam, incorporated into the ankle collar provide a soft, comfortable fit with great support"
    },
    {
      "key": "DST Frame",
      "value": "Dynamic Stabilizer Torsion frame gives rearfoot stability and torsion control"
    },
    {
      "key": "Midsole",
      "value": "Dual-density compression molded EVA for lightweight cushioning and responsiveness"
    },
    {
      "key": "Outsole",
      "value": "PRESA® outsole works with the midsole to provide mechanical impact absorption, and our SuperGum rubber compound provides confidence-inspiring traction"
    }
  ],
  "url": "https://vpo.ca/product/354904/rush-trek-gtx-mens"
}