{
  "description": "When the temperatures drop, the Rush Polar GTX steps it up to keep you comfortable in the snow and cold. An extended ankle collar height, and a suede upper backed by GORE-TEX® Insulated Comfort technology and Primaloft® Gold Eco insulation ensure your feet stay toasty warm on winter hikes or snowshoeing trips. Underfoot support, protection and traction come courtesy of the exclusive PRESA® outsole with Interactive Kinetic System (IKS) Technology. <br><br>The IKS system features impact absorbing internal domes placed in key ground contact areas that function as mechanical shock absorbers, while our H-compound rubber provides secure grip at low temperatures. The Dynamic Stabilizer Torsion frame supports the arch and wraps the heel on both sides, providing terrific rearfoot stability and torsion control so you can confidently tackle whatever winter mission you have in mind.",
  "img_hrefs": [
    "https://vpo.ca/images/product/large/346474.jpg"
  ],
  "name": "Scarpa Rush Polar GTX - Unisex",
  "price_cents": 3690000,
  "specs": [
    {
      "key": "Upper",
      "value": "1.8mm Suede &amp; Fabric"
    },
    {
      "key": "Lining",
      "value": "GORE-TEX® Insulated Comfort + Primaloft® Gold Eco"
    },
    {
      "key": "Insole",
      "value": "P-Flex Lite + DST TPU Frame"
    },
    {
      "key": "Midsole",
      "value": "2D EVA-CM"
    },
    {
      "key": "Outsole",
      "value": "PRESA® TRK-02"
    },
    {
      "key": "Last",
      "value": "RHA"
    },
    {
      "key": "Weight (per boot)",
      "value": "680 g"
    },
    {
      "key": "Origin",
      "value": "Romania"
    },
    {
      "key": "Upper",
      "value": "Suede leather upper for protection, support and abrasion resistance. GORE-TEX® Insulated Comfort lining and Primaloft® Gold Eco insulation provide warmth and waterproof-breathable protection"
    },
    {
      "key": "Extended Ankle Collar",
      "value": "Stretch fabric tops the extended height collar, providing extra support and snow protection"
    },
    {
      "key": "DST Frame",
      "value": "Dynamic Stabilizer Torsion frame gives rearfoot stability and torsion control"
    },
    {
      "key": "Midsole",
      "value": "Dual-density compression molded EVA for lightweight cushioning and responsiveness"
    },
    {
      "key": "Outsole",
      "value": "PRESA® outsole works with the midsole to provide mechanical impact absorption, and our H-compound rubber provides confidence-inspiring traction at low temperatures"
    }
  ],
  "url": "https://vpo.ca/product/346474/rush-polar-gtx-unisex"
}