{
  "description": "All across the country, food processors, grocers, restaurants, and regular folks throw away perfectly edible food. In fact, every month nearly twenty pounds of food per person is thrown out in the United States, and we consumers are the worst offenders. However, the good news is that it’s easy to reduce waste—while saving money and eating healthier too!&lt;br&gt;&lt;br&gt;Scraps, Peels, and Stems is a comprehensive and accessible guide to how you can reduce food waste in your daily life. Food journalist Jill Lightner shows how to manage your kitchen for less waste through practical strategies, tips, and advice on food purchasing, prep, composting, and storage. From beef bones, Parmesan rinds, and broccoli stems to bruised apples and party leftovers, Jill explains what to do with unused food, and how to avoid the extras in the first place. With attitude, a sense of humor, and the acceptance that none of us are perfect, Jill helps all of us understand some of the larger social, economic, environmental, and agricultural issues around food and its exorbitant waste. Topics and features include:&lt;br&gt;70+ recipes for breakfast, lunch, dinner, snacks, and drinks as well as items for your pantryMoney-saving tips throughoutThree levels of action for every topic, to help you figure out what’s doableComposting and recycling tipsPortioning to avoid leftovers on the plateMeal planning vs. freestyle cookingGrocery shopping and dining-out tacticsStorage strategies for small, urban kitchens—and how to read expiration datesInsight into “nose to tail” and “root to stem” cooking trends Through clear advice, quick tips, useful techniques, and easy recipes,Scraps, Peels, and Stems shows how, by looking at the food waste we encounter in our daily lives, we can save money and make a difference.",
  "img_hrefs": [
    "https://vpo.ca/images/product/medium/362361.jpg"
  ],
  "name": "Scraps, Peels, and Stems",
  "price_cents": 3195,
  "specs": [
    {
      "key": "Publisher",
      "value": "‎Skipstone; Illustrated edition (Sept. 10 2018)"
    },
    {
      "key": "Language",
      "value": "‎English"
    },
    {
      "key": "Paperback",
      "value": "‎224 pages"
    },
    {
      "key": "ISBN-10",
      "value": "‎1680511483"
    },
    {
      "key": "ISBN-13",
      "value": "‎978-1680511482"
    },
    {
      "key": "Weight",
      "value": "‎590 g"
    },
    {
      "key": "Dimensions",
      "value": "‎17.53 x 1.52 x 21.34 cm"
    }
  ],
  "url": "https://vpo.ca/product/362361/scraps-peels-and-stems"
}