{
  "description": "Designed for the nomadic in nature, The Shepherd is a fine tuned extension of body and mind, a vehicle to express creativity in the wild. Its lightweight body is for those who want to reach the next ridge on the horizon while preserving energy for the descent. Couloirs, steep pitches and spines, the Shepherd inspires confidence in serious terrain, as well as adaptability wherever you may roam.. Directional camber, an early rise nose, deep sidecut, and a healthy dose of taper delivers a quick and nimble attitude to flow with the mountains and into the unknown. Equipped with our Algal Core and Algal Wall materials, you’ll also get excellent stability when it matters most. Break trail aboard the Shepherd and realize your destiny.",
  "img_hrefs": [
    "https://vpo.ca/images/product/medium/362284.jpg"
  ],
  "name": "Shepherd (Split) Camber",
  "price_cents": 129900,
  "specs": [
    {
      "key": "Flex",
      "value": "starting at the nose, the flex profile transitions from stiff to medium throughout the board's stance. The tail's flex retains stiffness as the board tapers, enhancing stability in critical situations."
    },
    {
      "key": "Profile",
      "value": "5mm directional camber with slight early rise in nose"
    },
    {
      "key": "Core Layout",
      "value": "Algal Core - Vertically laminated, domestically sourced aspen with 4 algal polyurethane foam stringers, tip to tail."
    },
    {
      "key": "Sidewall",
      "value": "Algal Wall - Seamless semi cap Algal PU sidewall. Designed to increase damping and stability."
    },
    {
      "key": "Hardware",
      "value": "Spark R&amp;D latches and clips. Fixie clips, top-mount."
    },
    {
      "key": "Artist",
      "value": "Cody Comrie"
    },
    {
      "key": "Pomoca Skin size recommendations",
      "value": "150-154cm"
    },
    {
      "key": "Lengths",
      "value": "150, 154, 158, 162, 166 cm"
    },
    {
      "key": "Radius",
      "value": "7 m @ 158 cm"
    },
    {
      "key": "Weight",
      "value": "3200 g @ 158 cm"
    }
  ],
  "url": "https://vpo.ca/product/362284/shepherd-split-camber"
}