{
  "description": "The waterproof, windproof Storm Shift Jacket is made of fully PFC-free GORE-TEX material—that means the fabric, membrane and DWR finish do not contain perfluorinated chemicals. A unique liner is warm and wicks moisture to provide lasting storm protection and comfort for skiers and boarders getting out in all types of conditions. With a refined fit, clean styling and technical features, the Storm Shift Jacket is built to complement a rider’s natural movement.",
  "img_hrefs": [
    "https://vpo.ca/images/product/medium/360052.jpg"
  ],
  "name": "Storm Shift Jacket - Womens",
  "price_cents": 62500,
  "specs": [
    {
      "key": "Shell",
      "value": "2-layer, 5.4-oz 150-denier 100% recycled polyester PFC-free GORE-TEX fabric with a PFC-free DWR finish (durable water repellent coating, fabric and membrane do not contain perfluorinated chemicals)"
    },
    {
      "key": "Lining",
      "value": "3.9-oz 100% polyester (61% recycled) zigzag tricot knit"
    },
    {
      "key": "Easy-Access Hem Adjustment",
      "value": "Drawcord on hem exits into handwarmer pockets for easy adjustment"
    },
    {
      "key": "Easy-Access Pit Zips",
      "value": "Watertight, coated zippers; pit zips quickly release heat; low-profile cuffs secure over or under gloves"
    },
    {
      "key": "Powder Gasket",
      "value": "Adjustable powder gasket can be cinched for a tight seal or lies flat when not in use; webbing loop at center back connects to any Patagonia® Snow pants"
    },
    {
      "key": "Multi-Use Pockets",
      "value": "Two zippered handwarmer pockets; zippered chest pocket; zippered forearm pocket; interior zippered pocket; interior drop-in pocket"
    },
    {
      "key": "Built-In RECCO® Reflector",
      "value": "Concealed RECCO® reflector; Fair Trade Certified™ sewn"
    },
    {
      "key": "Weight",
      "value": "723 g"
    }
  ],
  "url": "https://vpo.ca/product/360052/storm-shift-jacket-womens"
}