{
  "description": "The Strive 16 has an ultra-thin toe piece that provides a lower center of gravity. Result: improved power, control and responsiveness of the skier thanks to increased sensitivity. The binding allows you to get the most out of the ski and the slope to enjoy the day on skis even more.",
  "img_hrefs": [
    "https://vpo.ca/images/product/medium/363404.jpg"
  ],
  "name": "Strive 16 MN Bindings",
  "price_cents": 39995,
  "specs": [
    {
      "key": "Weight",
      "value": "1125 g"
    },
    {
      "key": "TRANSMISSION - Extra-wide front pedal (&gt; 60 mm)",
      "value": "Extra-wide pedal which ensures optimal lateral transmission of power from the skier to the ski. Designed for intensive freeskiing, offering impeccable stability and increased confidence."
    },
    {
      "key": "POWER - Low, direct and neutral toe stop",
      "value": "This revolutionary toe stop has a particularly low center of gravity, combined with an extra-large pedal and a neutral posture, to guarantee optimal sensations on all terrains."
    },
    {
      "key": "SAFETY - More elasticity",
      "value": "Excellent elasticity at the fins. It retains the shoe in the event of violent impacts while minimizing the risk of accidental triggering."
    },
    {
      "key": "POWER - XL Fins",
      "value": "Long fins that perfectly wrap the toe of the shoe to provide increased power transmission and confidence on freeride bindings."
    },
    {
      "key": "POWER - Low profile chassis",
      "value": "Lowered profile for better terrain feel and increased power transmission."
    },
    {
      "key": "SAFETY - Sliding front pedal",
      "value": "Specific spring-mounted pedal, which allows lateral movements with recentering. It allows the binding to be released with any shoe standard in the event of a side fall."
    },
    {
      "key": "RENTAL FEATURES - Multi-tool DIN screw",
      "value": "A screw compatible with all types of screwdrivers, for quick adjustments."
    },
    {
      "key": "MAIN MATERIAL - Fiberglass polyamide",
      "value": "Special polyamide, reinforced with fiberglass, which increases the lightness and strength of the bindings, as well as the tolerance of the skis."
    },
    {
      "key": "MAIN MATERIAL - Steel",
      "value": "Ultra-rigid, non-deformable material that meets runners' expectations in terms of power and precision."
    },
    {
      "key": "HEEL PAP - Arch heel cup",
      "value": "STRENGTH Heel arch technology for increased lateral reinforcement. POWER TRANSMISSION 73 mm wide platform for better lateral transmission."
    },
    {
      "key": "HEEL PIECE - 3-piece metal heel piece",
      "value": "Oversized 3-piece backcountry heel piece with metal lever provides extreme strength, ultra-powerful support and increased stability."
    },
    {
      "key": "COMPATIBILITY AND STANDARDS",
      "value": "MN - Adult"
    },
    {
      "key": "COMPATIBILITY AND STANDARDS - TÜV",
      "value": "Fixing tested and certified by TÜV, the benchmark safety agency for safety approval."
    }
  ],
  "url": "https://vpo.ca/product/363404/strive-16-mn-bindings"
}