{
  "description": "The Magma 2.0 Mid GTX is designed to hike, run and scramble in technical mountain terrain. It offers high-performance, weatherproof comfort and versatility in a mid-cut all-mountain shoe. Its upper is pre-shaped around an anatomical last to deliver a great feel and a perfect fit that supports the midfoot and ankle to prevent injuries in rocky terrain. The 1.6 mm suede leather enhances even more the adaptability and durability features, with the waterproof, breathable Gore-Tex® Extended Comfort lining working to keep your feet dry and comfortable in all conditions. The Magma 2.0 Mid GTX ensures superior comfort and protection thanks to its innovative anatomical last, a pre-moulded footbed and a high rebound shock-absorbing EVA midsole. <br><br>In addition, the ultra-large oversized heel with stability fins provides unparalleled braking and enhanced downhill performance. The multi-traction outsole tread made with Vibram® Litebase™ technology and Megagrip™ compound rubber, offers optimal grip on all surfaces in both dry and wet conditions. Our lightweight, waterproof, mid-cut all-mountain shoe with a new level of grip, protection and comfort.",
  "img_hrefs": [
    "https://vpo.ca/images/product/large/358421.jpg"
  ],
  "name": "Tecnica  Magma 2.0 Mid GTX - Mens",
  "price_cents": 2599500,
  "specs": [
    {
      "key": "Upper",
      "value": "1,6 mm Suede leather with liquid rubber reinforcement"
    },
    {
      "key": "Lining",
      "value": "Gore-Tex® Extended Comfort"
    },
    {
      "key": "Outsole",
      "value": "Vibram® Megagrip™ Litebase™ XO SHIELD"
    },
    {
      "key": "Midsole",
      "value": "Compression molded EVA with high rebound compound + ESS insert plate"
    },
    {
      "key": "Footbed",
      "value": "Anatomical, Ortholite®"
    },
    {
      "key": "Sizing/length adjustments",
      "value": "shorter, true to size"
    }
  ],
  "url": "https://vpo.ca/product/358421/magma-20-mid-gtx-mens"
}