{
  "description": "The Sulfur is a fast-moving technical approach shoe with a precise fit that delivers climbing precision and grip in technical terrain combined with high level of comfort and walkability all day long. The durable 1.5 mm suede leather upper is built and shaped around a specific anatomical last to deliver a precise, wrapping fit. As a result, the shoe fits like a glove around the foot. The midsole is designed with two different density areas to combine greater cushioning and smoother heel-to-toe transition while walking and torsional rigidity while climbing. This is enhanced by the TPU Edge Frame technology plate inserted at the core of the shoe that delivers support and flexibility exactly where you need. Its Vibram® Megagrip™ compound sole has a multi-directional lug pattern that readily adapts to different terrain and changing conditions, while the flat climbing zone at the toe and the rubber arch grip improve edging power and climbing precision on slabs, ledges and edges. Our performance approach shoe designed to provide wrapping fit, good support and endurance comfort to help you go for longer distances in rugged mountain terrain.",
  "img_hrefs": [
    "https://vpo.ca/images/product/large/357859.jpg"
  ],
  "name": "Tecnica  Sulfur - Mens",
  "price_cents": 2199500,
  "specs": [
    {
      "key": "Upper",
      "value": "1,5mm suede leather"
    },
    {
      "key": "Lining",
      "value": "Sock lining construction in soft mesh"
    },
    {
      "key": "Outsole",
      "value": "Vibram® Megagrip™"
    },
    {
      "key": "Midsole",
      "value": "Bi-density compression molded EVA with high rebound compound"
    },
    {
      "key": "Footbed",
      "value": "Anatomical, Ortholite®"
    },
    {
      "key": "Fast transition",
      "value": "The last, midsole toe rocker and unique rounded toe shape have been carefully designed to enhance the Sulfur’s responsiveness, grip and fast acceleration and transition in technical terrains"
    }
  ],
  "url": "https://vpo.ca/product/357859/sulfur-mens"
}