{
  "description": "Choose a brighter future with the more sustainable Terra Expedition S - made from hemp and recycled plastics. The Terra Expedition S is your preferred choice of you need a mirror sighting compass with many features. It is high performing when it comes to accuracy, precision and durability and is developed for experienced users and professionals.&lt;br&gt;&lt;br&gt;Terra Expedition S belongs to Silva Terra: a product series made of recycled materials with 90% less carbon emissions. The lid, grip ring and graduation ring on Terra Expedition S are made of REVO material.&lt;br&gt;&lt;br&gt;If the terrain demands for a mirror sighting compass Expedition S is your optimal companion. SILVA Expedition S features easy-handling housing, silicon rubber feet for precision map work, detachable safety-release scale lanyard, night-enabling luminous markings, magnifying lens, map-measuring scales in mm or inches, 1:25,000, 1:50,000 and GPS scales – plus built-in adjuster for magnetic declination (including permanent local adjustment). The Expedition S can also map-measure 1:40,000 and it comes with a clinometer for measuring slope angle and 45-degree angle assistance on the mirror-sighting function.&lt;br&gt;&lt;br&gt;This compass features a mirror that allows you to view the compass dial and the background at the same time. The fact that the compass dial can be seen at the same time the reference point is aligned makes mirror compasses more desirable for taking accurate bearings. A mirror-sighting compass is at its best in open terrain where you must determine direction over long distances.&lt;br&gt;&lt;br&gt;The slope card is great both for detecting avalanche risk and for determining how challenging your journey will be. By knowing the slope you can also judge any extra distance that you need to go due to the slope. Always take caution in steep terrain. The risk of avalanches increase if the slope is steeper than 30 degrees. The slope card will help you detect this risk.&lt;br&gt;&lt;br&gt;This compass model is equipped with a detachable scale lanyard made of recycled PET, that works like a ruler. The scale lanyard has two scales on it; 1:25, and 1:50, which makes it easier to measure the distance of your hike. Since its soft and bendable it’s easy to place directly on to your route on the map when you are out in the terrain – or when you are planning for your next adventure&lt;br&gt;&lt;br&gt;SILVA TERRA – REUSE, REDUCE, RECYCLE&lt;br&gt;&lt;br&gt;Terra means Earth, and products labelled Silva Terra have lower environmental footprint. We long for a brighter future and Silva Terra is our plan to make it happen. Our strategy is easy to understand and well known – reuse, reduce, recycle. Silva Terra is our commitment",
  "img_hrefs": [
    "https://vpo.ca/images/product/medium/362242.jpg"
  ],
  "name": "Terra Ranger S Compass",
  "price_cents": 6995,
  "specs": [],
  "url": "https://vpo.ca/product/362242/terra-ranger-s-compass"
}