{
  "description": "With over one hundred full-color photographs comes a harrowing portrait of Canada’s most devastating wildfire season ever, the effects of which could be felt and seen across the world.&lt;br&gt;&lt;br&gt;“All hell has broken loose.” That’s the phrase some fire officials use to describe the unprecedented 2023 wildfire season in Canada. Never before has the vast and rugged beauty of this country been ravaged by as many devastating wildfires. Never before have the fires been this big or moved this fast. Choking smoke blanketed the continent, including the United States, putting millions of people under air quality advisories, and even traveled as far as Norway.&lt;br&gt;&lt;br&gt;The wildfire season started in the spring with most provinces and territories facing a drought. In early May, many parts of Canada grappled with a record-breaking number of fires. By the end of August, wildfires had devoured more than 15 million hectares (37 million acres) of Canadian forest—more than six times the average usually lost to fire. Provinces such as British Columbia and Nova Scotia experienced their largest wildfires ever. Quebec, Alberta, Saskatchewan, and Northwest Territories battled their most destructive wildfires ever.&lt;br&gt;&lt;br&gt;Tens of thousands of Canadians—from coast to coast to coast—were chased from their homes by flames or the threat of flames, seeking shelter in evacuation centers across the country. People from Halifax, Yellowknife, Kelowna, Shuswap, and many other communities survived harrowing escapes along flame-lined roads, with embers raining down upon them. Thousands of firefighters from Canada and around the world risked their lives to battle the blazes, which already numbered almost 6,000 by the end of August. Four firefighters lost their lives doing so.&lt;br&gt;&lt;br&gt;The Summer Canada Burned tells the dramatic story of Canada’s wildfires in 2023—a story that provides a case study of the changing climate and its impacts on our environment. It reflects evolving attitudes about approaches to wildfires and the role all people can play in prevention. Most importantly, however, the story of Canada’s wildfires is a story of loss and of survival. From the ashes, people rise, communities rebuild and seeds of new growth sprout.&lt;br&gt;&lt;br&gt;A share of the sales from the book will be donated to the Canadian Red Cross.",
  "img_hrefs": [
    "https://vpo.ca/images/product/medium/362972.jpg"
  ],
  "name": "The Summer Canada Burned",
  "price_cents": 3495,
  "specs": [
    {
      "key": "Publisher",
      "value": "Greystone Books"
    },
    {
      "key": "Published",
      "value": "November 28, 2023"
    }
  ],
  "url": "https://vpo.ca/product/362972/the-summer-canada-burned"
}