{
  "description": "From your first 5k up to trail marathon level, this is the ultimate guide to trail running.&lt;br&gt;&lt;br&gt;From complete beginners to seasoned off-road runners, The Ultimate Trail Running Handbook has all the training and nutrition advice, skills, gear and motivation you need to become a fit and confident trail runner.&lt;br&gt;&lt;br&gt;There are training plans that take newcomers from 5k parkrun level all the way to a first trail marathon. And if you're already an experienced runner, you'll find the strength-work, injury prevention moves and training plans to take you to the next level with your best performance ever. To keep you enjoying every step, there are inspiring stories from real trail runners and the best advice from top off-road athletes, coaches and experts. Running myths are busted, excuses not to run are countered and there are great ideas to get friends and family our on the trails too.&lt;br&gt;&lt;br&gt;Keeping you going strong, there are over 30 easy recipes to fuel you both in training and racing. And if you want to explore more, the navigation and route planning information makes it easy for you to create an exciting off-road adventure.&lt;br&gt;&lt;br&gt;Trail running is such a wonderful way to see the world, so the final chapter covers the best races from all over the globe, with essential advice from the pros. This book arms you with the best possible chance of achieving your next trail running challenge, whether it's a fast time on a well-loved local hill, or a destination race to be savored in New Zealand. If you're a trail runner or would like to become one, this book is your new best friend.",
  "img_hrefs": [
    "https://vpo.ca/images/product/medium/361988.jpg"
  ],
  "name": "The Ultimate Trail Running Handbook",
  "price_cents": 3250,
  "specs": [
    {
      "key": "Paperback",
      "value": "224 pages"
    },
    {
      "key": "Publisher",
      "value": "Bloomsbury USA"
    },
    {
      "key": "Published",
      "value": "March 9, 2021"
    },
    {
      "key": "Subjects",
      "value": "Sports &amp; Recreation, Running &amp; Jogging, Outdoor Skills, Health &amp; Fitness, Exercise"
    },
    {
      "key": "EAN",
      "value": "9781472974846"
    },
    {
      "key": "Physical Dimensions",
      "value": "7.45 x 9 in"
    },
    {
      "key": "Shipping Weight",
      "value": "1.25 lbs"
    }
  ],
  "url": "https://vpo.ca/product/361988/the-ultimate-trail-running-handbook"
}