{
  "description": "The hunt for powder is now on: The Tigard 130 Unisex ski touring boot is an aggressive, technical high-end Alpine Tech Boot for maximum downhill performance on- and off piste. Fast as a snow leopard and strong as a tiger, the Tigard 130 boot combines Free Touring and Alpine skiing. The boot is the ultimate partner for all downhill-oriented athletes. It is compatible with not only frame bindings, but also tech and alpine bindings. Thanks to its low weight of just 1,550 grams and a cuff rotation of 70 degrees for extraordinary freedom of movement, you can easily conquer several hundred meters of vert – and will be the first one to drop into the perfect line, guaranteed! This boot features the patented Hoji Lock System that merges the cuff and shell on the inside of the boot into one completely interlocking unit without any play. The unique Grilamid material with carbon fibers offers very high rigidity with a progressive flex of 130 so you can enjoy your well-earned downhill to the fullest. With a last width of 101 mm, the Power Strap and four micro-adjustable buckles hold the foot snugly in place. The ski-walk mechanism is connected by a technically clever cable system that combines the uppermost buckle and the Power Strap. With just one hand motion, you can transition between uphill and downhill. In downhill mode, the Tigard 130 locks out at a max forward lean of 13 degrees, offering you a comfortable, yet still athletic and controlled ski position – whether you are pressing, carving or slashing. &lt;br&gt;&lt;br&gt;The Tigard is the first boot in the DYNAFIT collection that integrates Overlap construction. This guarantees the foot is enveloped perfectly for precision skiing and direct power transfer. Compared to alpine ski boots, entry is significantly easier with its Easy Entry features. To ensure you make your way safely over rocks and icy flanks to your line, the Tigard 130 is equipped with a sturdy, long-lasting Gripwalk sole. This offers perfect grip and ideal traction when walking out of the binding. To lend even more safety on tour, the Tigard is also compatible with fully automatic crampons. An additional special feature of the Tigard 130 is the optional thermo-moldable Dynafitter 15 boot liner. Thanks to PrimaLoft, your feet stay comfy even in icy temperatures. At the same time, the liner lends the highest comfort and rigidity at a light weight. As with all DYNAFIT ski touring boots, the Tigard is made by hand in Italy’s Montebelluna and includes a lifetime guarantee. Tigard 130 – First up. First down.&lt;br&gt;",
  "img_hrefs": [
    "https://vpo.ca/images/product/medium/360825.jpg"
  ],
  "name": "Tigard 130 Boots - Unisex",
  "price_cents": 99995,
  "specs": [
    {
      "key": "Shell",
      "value": "Grilamid®"
    },
    {
      "key": "Cuff",
      "value": "Grilamid® Loaded with Carbon Fibers"
    },
    {
      "key": "Spoiler",
      "value": "Grilamid®"
    },
    {
      "key": "Liner",
      "value": "Dynafitter 15"
    },
    {
      "key": "Weight",
      "value": "1550 g"
    },
    {
      "key": "Size",
      "value": "25-31.5 MP"
    },
    {
      "key": "Last Width",
      "value": "101 mm"
    },
    {
      "key": "Best For",
      "value": "Freeride"
    },
    {
      "key": "Boot sole",
      "value": "Gripwalk Sole"
    },
    {
      "key": "Closure System",
      "value": "HOJI Lock"
    },
    {
      "key": "Cuff rotation",
      "value": "70 °"
    },
    {
      "key": " Flex",
      "value": "130"
    },
    {
      "key": "Forward Lean",
      "value": "12° - 15° + Release for Walking"
    }
  ],
  "url": "https://vpo.ca/product/360825/tigard-130-boots-unisex"
}