{
  "description": "A hardwearing, warm freeride glove all in leather. This 3-finger design long popular with Japanese snowboarders has now made its way across the ocean to a wider audience. The removable liner with synthetic insulation keeps hands warm while an adjustable neoprene cuff comfortably encases the wrist. &lt;br&gt;&lt;br&gt;Whether you prefer skis or a snowboard, you’ll love this sound freeride glove for its durability and sensitivity. The Topo 3 Finger is sewn entirely in treated cowhide* to protect against the elements and provide grip, while also being hardwearing and supple. The 3-finger design means a bit more warmth while retaining some freedom of movement – practical when you need to sort out your equipment, for example.&lt;br&gt;The liner is detachable and easy to take out and dry after a day’s skiing. The microfleece lining is comfortable against the skin, and the synthetic insulation both insulates and wicks away moisture. A neoprene cuff at the inside wrist makes for a comfortable fit and the width is adjusted with Velcro.&lt;br&gt;All in all, the Topo is a hardwearing, warm glove that works equally well in light, cold January powder as it does in varying conditions later in the season. From Japan to all the snow-clad mountains of the world.&lt;br&gt;* Colour 060060 is sewn in chrome-free treated goatskin. * Colour 700701 has a backhand in chrome-free, undyed Ecocuir cowhide.",
  "img_hrefs": [
    "https://vpo.ca/images/product/medium/360567.jpg"
  ],
  "name": "Topo 3-Finger",
  "price_cents": 19995,
  "specs": [
    {
      "key": "Outer Material",
      "value": "Impregnated Cowhide (Col. 400 With Backhand in Chrome-free Ecocuir Cowhide)"
    },
    {
      "key": "Insulation",
      "value": "G-loft - a very thin 100% polyester fiber with exceptionally high insulating capacity, even in wet conditions. G-Loft is quick drying, breathable and very compressive"
    },
    {
      "key": "Lining",
      "value": "Bemberg- Durable medium heavy 100 % polyester fleece lining, with soft and comfortable brushed surface"
    }
  ],
  "url": "https://vpo.ca/product/360567/topo-3-finger"
}