{
  "description": "Skratch Labs Vegan Recovery Sport Drink Mix provides the proper balance of plant-based proteins, fats, and carbohydrates to speed your recovery. It offers the same nutritional profile as our dairy milk-based sport recovery mix, just vegan.&lt;br&gt;&lt;br&gt;Vegan Recovery Sport Drink Mix is for vegan athletes who need something delicious and convenient to drink immediately after emptying the tank in long, hard workouts, we created Vegan Recovery Sport Drink Mix. When you shake up this frothy, smooth drink, its chocolatey aroma may just conjure up memories of opening your favorite candy bar as a kid. You’ll taste the robust cocoa flavor that comes from real chocolate and the delicious sweetness of cane sugar. As with all of Skratch products, our Vegan Recovery Sport Drink Mix does not contain any artificial sweeteners or flavoring agents, something rare in the vegan protein space.&lt;br&gt;&lt;br&gt;Made with only plant-based protein, a serving of Vegan Recovery Sport Drink Mix has what you need to rapidly refuel, rehydrate, and rebuild so you can go big again tomorrow. Its 4:1 carbohydrate to protein ratio speeds up recovery faster than protein alone by replacing your glycogen stores. The 10 grams of pea and rice protein provide the complete essential amino acid profile to accelerate muscle repair and growth, plus 1 billion probiotic cultures to support digestive health. This vegan protein mix is delicious, easy to drink, and easy on the gut. &lt;br&gt;&lt;br&gt;And ya, it’s Non-GMO, Gluten Free, Dairy Free, and Kosher too.",
  "img_hrefs": [
    "https://vpo.ca/images/product/medium/363247.jpg"
  ],
  "name": "Vegan Recovery Sport Drink Mix - 708g",
  "price_cents": 4995,
  "specs": [
    {
      "key": "Ingredients",
      "value": "Cane Sugar, Dextrose, Pea Protein, Medium Chain Triglycerides (Derived from Coconut), Cocoa Powder, Rice Protein, Cocoa Extract, Gum Acacia, Salt, Vanilla Extract, Bacillus coagulans GBI-30 6086 (Probiotic)"
    },
    {
      "key": "To prepare",
      "value": "Simply add one serving (2 heaping scoops) to 12 fl oz of water and shake (don't stir)."
    }
  ],
  "url": "https://vpo.ca/product/363247/vegan-recovery-sport-drink-mix-708g"
}