{
  "description": "All new for 23/24, The Vital 98 pays homage to its predecessor by improving upon its precise, stable, and award-winning platform. They further optimized its strength-to-weight ratio and tightened the turn radius for added engagement when you need it most. By slightly increasing the Vital’s tip stiffness and extending the running surface, stability at speed has been improved. The inclusion of their Spiral Plate creates a more even flex from tip to tail, while the Algal Core and Algal Wall reduce weight and vibration. An updated tail block improves tail clip retention and easily punches through stubborn layers in the snowpack - a massive benefit to anchor building or tail jab kick turns in steep terrain.",
  "img_hrefs": [
    "https://vpo.ca/images/product/medium/362283.jpg"
  ],
  "name": "Vital 98 Ski Camber",
  "price_cents": 103900,
  "specs": [
    {
      "key": "Flex",
      "value": "Progressive - The tail begins with a medium to stiff flex, transitioning to stiffer through the mid section and decreasing gradually toward the tip. This flex pattern creates a solid platform for stability in the tail and underfoot while the medium tip flex handles crud and variable conditions with ease. Due to its narrower width, the torsional stiffness of the Vital 98 is the strongest, allowing for optimal edge hold and stability in variable conditions."
    },
    {
      "key": "Profile",
      "value": "Camber - for versatility, greater edge contact on piste and a more traditional feel | Reverse - for the ultimate in playful, off-piste float, charging and pivotability."
    },
    {
      "key": "Intended Use",
      "value": "All Mountain, Boiler Plate to Boot Top Pow"
    },
    {
      "key": "Artist",
      "value": "Christian Johansen"
    },
    {
      "key": "Lengths",
      "value": "159, 165, 171, 177, 183, 189 cm"
    },
    {
      "key": "Dimensions (Tip-Waist-Tail)",
      "value": "126-98-117 mm"
    },
    {
      "key": "Radius",
      "value": "19.5 m @ 183 cm"
    },
    {
      "key": "Weight (per ski)",
      "value": "1750 g @ 183 cm"
    }
  ],
  "url": "https://vpo.ca/product/362283/vital-98-ski-camber"
}