{
  "description": "From Canada’s most accomplished adventurer and storyteller comes a gripping journey into the vastness of Canada’s landscape and history.&lt;br&gt;&lt;br&gt;Looking out his porch window one spring morning, Adam Shoalts spotted a majestic peregrine falcon flying across the neighbouring fields near Lake Erie. Each spring, falcons migrate from southernmost Canada to remote arctic mountains. Grabbing his backpack and canoe, Shoalts resolved to follow the falcon’s route north on an astonishing 3,400-kilometre journey to the Arctic.&lt;br&gt;&lt;br&gt;Along the way, he faces a huge variety of challenges and obstacles, including storms on the Great Lakes, finding campsites in the urban wilderness of Toronto and Montreal, avoiding busy commercial freighter traffic, gale force winds, massive hydroelectric dams, bushwhacking without trails, dealing with hunger, multiple bear encounters, and navigating white-water rapids on icy northern rivers far from any help.&lt;br&gt;&lt;br&gt;In his signature style, Shoalts roams as much across space as he does time, winding his way through a stunning diversity of landscapes ranging from lush Carolinian forests to lonely windswept mountains, salty seas to trackless swamps, pristine lakes to glittering mega-cities, as well as the sites of long ago battles, shipwrecks, forgotten forts, and abandoned trading posts. Through his travels, he reveals how interconnected wild places are, from the loneliest depths of the northern wilderness to busy urban parks, and the vital importance of these connections.&lt;br&gt;&lt;br&gt;Where the Falcon Flies invites readers on an extraordinary armchair adventure that spans five ecoregions and centuries of fascinating history, and is a masterwork by one of Canada’s most successful and audacious authors.&lt;br&gt;",
  "img_hrefs": [
    "https://vpo.ca/images/product/medium/362477.jpg"
  ],
  "name": "Where the Falcon Flies",
  "price_cents": 3595,
  "specs": [
    {
      "key": "Hardcover",
      "value": "368 pages"
    },
    {
      "key": "Publisher",
      "value": "Penguin Canada"
    },
    {
      "key": "Published",
      "value": "October 3, 2023"
    },
    {
      "key": "Subjects",
      "value": "Biography &amp; Autobiography, Adventurers &amp; Explorers, Environmentalists &amp; Naturalists, History, Expeditions &amp; Discoveries"
    },
    {
      "key": "EAN",
      "value": "9780735241015"
    },
    {
      "key": "ISBN-10 ‏",
      "value": "‎ 0735241015"
    },
    {
      "key": "ISBN-13 ‏",
      "value": "‎ 978-0735241015"
    },
    {
      "key": "Physical Dimensions",
      "value": "6.24 x 9.3 in"
    },
    {
      "key": "Weight",
      "value": "1.32 lbs"
    }
  ],
  "url": "https://vpo.ca/product/362477/where-the-falcon-flies"
}