{
  "description": "The Dolomites have such classic climbs, the crags really need no introduction: Tre Cime, Marmolada, Cinque Torri… say no more.&lt;br&gt;&lt;br&gt;The Wildfire 2 Gore-Tex® shoe is a precise-fitting, women’s tech approach shoe with a high-grip POMOCA outsole for climbing performance and fast mountain approaches, technical scrambles and easy alpine climbs. The upper is made from recycled breathable mesh with a stretch gaiter tongue and a waterproof, breathable GORE-TEX® Extended Comfort membrane, for weather protection. The technical construction ensures an improved precise fit thanks to its network of Kevlar cables that wraps the foot for flexibility, fit and firm ankle and heel support. In addition, the Wildfire 2 is equipped with our unique Switchfit adjustment that instantly adapts from hiking mode to climbing mode and with the Multi Fit Footbed Plus (MFF+) for a customizable fit.&lt;br&gt;&lt;br&gt;The Pomoca Speed MTN outsole has a climbing zone at the toe and ensures good edging performance and S-Path technology to promote natural roll-off. Its POMOCA rubber provides better grip on rock in both dry and wet conditions, while the aggressive tread lugs offer good traction on mud and softer terrain.&lt;br&gt;&lt;br&gt;A high-performance, adaptable shoe for scrambling and technical approaches.",
  "img_hrefs": [
    "https://vpo.ca/images/product/medium/362239.jpg"
  ],
  "name": "Wildfire 2 GTX - Womens",
  "price_cents": 22995,
  "specs": [
    {
      "key": "Footbed",
      "value": "MFF+"
    },
    {
      "key": "Lining",
      "value": "GORE-TEX® Extended Comfort"
    },
    {
      "key": "Midsole",
      "value": "EVA"
    },
    {
      "key": "Outsole",
      "value": "Pomoca Speed Mtn"
    },
    {
      "key": "Upper",
      "value": "3F System with Kevlar® Cables, Protective TPU rand, Recycled breathable mesh"
    },
    {
      "key": "Drop",
      "value": "11 mm"
    },
    {
      "key": "Fit",
      "value": "0"
    },
    {
      "key": "Gender",
      "value": "Female"
    },
    {
      "key": "Shoelaces",
      "value": "Short Round Shoelace"
    },
    {
      "key": "Single shoe weight",
      "value": "348 g (size 5 UK)"
    },
    {
      "key": "Sole segment",
      "value": "Tech approach"
    },
    {
      "key": "Used For",
      "value": "Climbing, Trekking"
    }
  ],
  "url": "https://vpo.ca/product/362239/wildfire-2-gtx-womens"
}