{
  "description": "Aeropress' iconic coffee press, made with the same patented technology, now with double the capacity. Includes a 20 oz carafe made of crystal-clear shatterproof Tritan™.&lt;br&gt;&lt;br&gt;3-in-1 brew technology combines the best of several brew methods into one easy to use, very portable device. No more average joe from fancy, expensive machines. Smooth, rich, grit-free coffee with a delicious, full-bodied finish that lingers well after your last sip.&lt;br&gt;&lt;br&gt;Compact, durable and lightweight so you can pack it in your bag and take it on the road. No more mediocre (at best) coffee from the hotel, office, Airbnb, ski lodge, camper.",
  "img_hrefs": [
    "https://vpo.ca/images/product/medium/363182.jpg"
  ],
  "name": "XL Aeropress Coffee &amp; Expresso Maker",
  "price_cents": 8995,
  "specs": [
    {
      "key": "Capacity",
      "value": "4 cups"
    },
    {
      "key": "AeroPress XL Chamber, Plunger, Filter Cap &amp; Seal",
      "value": "For brewing the most delicious coffee ever"
    },
    {
      "key": "AeroPress Carafe",
      "value": "Crystal clear, shatterproof, lightweight, and made with Tritan™"
    },
    {
      "key": "Paper Micro-Filters",
      "value": "Includes 100 replacement AeroPress XL paper micro-filters. Micro-filters remove grit from your coffee, unlike other press-type coffee makers"
    },
    {
      "key": "Stirrer",
      "value": "Designed to be the perfect length for the AeroPress XL"
    },
    {
      "key": "Scoop",
      "value": "Scoop measures just the right amount of coffee for delicious, easy AeroPress recipes"
    },
    {
      "key": "3-in-1 Brewing",
      "value": "Immersion, aeration and pressure combine for exceptional, one of a kind flavor and versatility. Make American, cold brew, espresso and lattes, all in about a minute. Experiment with temperature, grind size and immersion time to create your own 3 in 1 flavor - rich like espresso, smooth like a pour-over and full bodied like a french press"
    },
    {
      "key": "Fast Immersion",
      "value": "Presses don’t normally include filtration, but ours does. You can now use finer grind coffee which brews faster for less acidity, no bitterness and no grit"
    },
    {
      "key": "Air Pressure",
      "value": "Our unique plunge system uses gentle pressure to push water through the grinds, aerating and extracting only the purest, freshest flavors for a cup with body and finish not normally found in coffee"
    }
  ],
  "url": "https://vpo.ca/product/363182/xl-aeropress-coffee-expresso-maker"
}