{
  "center_geohash": "c2uq11ts8b4g",
  "center_lat": 50.282450267113745,
  "center_lng": -117.72190317045897,
  "description": "From the local authority's www: (http://nakusparrowlakes.com/uploads/chamber/TrailMaps/kuskanax-creek-nakusp-hot-springs-trail.pdf)This all-season trail provides great spring, summer and fall hiking, biking and horseback riding and some winter snowshoeing. The trail meanders along the side slope above the Kuskanax Creek from just outside Nakusp up the valley to the Nakusp Hotsprings, following the pioneers? original packhorse route of 1912. The first three or four kms wander through lofty cedar and hemlock stands, which thrive in the ideal moist habitat created by rain from eastbound clouds crossing the Selkirk Mountains. Under the towering canopy exists a diverse undergrowth of mosses, Western yew, Devil?s club, huckleberry, oak fern, lady fern, maidenhair fern and smaller wild ginger, sarsaparilla, fairy slipper, Queen?s cup and wintergreen. Remnants of burnt out tree stumps stand like sentinel ghosts from times past, providing evidence of the natural fires that used to regularly sweep through BC?s interior valleys. Recent logging near the beginning of the trail attempted to minimize the impact of the small clear-cut  harvest to the trail?s integrity. An hour?s hiking leads to the bluffs, laden with maidenhair ferns and ginger, where views extend to the creek far below and to the lake  (GPS point 2 on the map). Continuing on through the forest, log bridges cross the many small creeks. Upon approaching the next rest stop  (GPS point 3), decadent hemlock, fir and cedar tower nearly 40 metres above, shading the forest floor and creating a magnificent, mossy  bowl. The benches, outhouse and hitching post built long ago by pioneers have been recreated, so hikers can enjoy the enchanting rest spot. Marshy ground is criss-crossed with boardwalks; hanging moss gardens dangle from elevated tree branches, and overgrown trail-blazes  display more evidence of the trail?s history. Further up the valley, a keen eye will spot the Nakusp Hotsprings across Kuskanax Creek (GPS Point 4). After passing a rundown cabin  and corral, the trail branches to the hotsprings source (.8 kms) and the Kimbol Lake trail (GPS Point 5). For a therapeutic soak, cross the  suspension bridge over Kuskanax Creek, and follow the path to the Nakusp Hotsprings.",
  "directions": "From Nakusp, head south on Highway 6 toward Nelson for 2 km. Turn left  onto Alexander Road at Carson?s Corner Store, drive for 2.3 kms  to the brown wooden Kuskanax Ck. Tr sign on the right. Follow the logging  road for 1.4 km to a fork, veer right and bump along until the next fork, then head to the left. After the first 1.4 km, the road is quite overgrown and rough, park at the fork if you are wary of your paint or suspension. From the parking area (GPS P ), follow the path through the logged area to the trailhead (GPS Point 1). For convenience, shuttle a second vehicle to the Nakusp Hotsprings before you begin hiking or arrange to be picked up about 4 hours after you begin hiking.",
  "geohash": "c2u",
  "nearest_peak_geohash": "c2umcnjj4umu",
  "photos": [],
  "source_url": "https://trailpeak.com/trails/kuskanax-creek-near-nakusp-bc-10999",
  "stats": {
    "Activities": "hike mtn-bike",
    "From": "",
    "Seasons": "fall summer",
    "Stars": 3,
    "Time": "2 hrs",
    "Total Distance": "16 km",
    "Town": "Nakusp, BC",
    "Type": "out-and-back"
  },
  "title": "Kuskanax Creek",
  "trail_id": "10999",
  "waypoints": [
    [
      {
        "alt": null,
        "lat": 50.268741957843304,
        "lng": -117.7644248586148
      },
      {
        "alt": null,
        "lat": 50.269307903945446,
        "lng": -117.75912732817233
      },
      {
        "alt": null,
        "lat": 50.27616203762591,
        "lng": -117.73907261900604
      },
      {
        "alt": null,
        "lat": 50.286600440740585,
        "lng": -117.71977471187711
      },
      {
        "alt": null,
        "lat": 50.29339171014726,
        "lng": -117.68704388290644
      },
      {
        "alt": null,
        "lat": 50.29615857638419,
        "lng": -117.67938148230314
      }
    ],
    [
      {
        "alt": 760.0,
        "lat": 50.26944444514811,
        "lng": -117.7591666392982
      }
    ],
    [
      {
        "alt": 800.0,
        "lat": 50.276666628196836,
        "lng": -117.73861111141741
      }
    ],
    [
      {
        "alt": 960.0,
        "lat": 50.286944434046745,
        "lng": -117.71944446489215
      }
    ],
    [
      {
        "alt": 560.0,
        "lat": 50.2938889246434,
        "lng": -117.68638892099261
      }
    ],
    [
      {
        "alt": null,
        "lat": 50.296666687354445,
        "lng": -117.67888887785375
      }
    ],
    [
      {
        "alt": 1890.0,
        "lat": 50.268611116334796,
        "lng": -117.76444447226822
      }
    ]
  ]
}