{
  "center_geohash": "f85nsss3w7zx",
  "center_lat": 46.167576242,
  "center_lng": -63.077381004,
  "description": "This was on the \"I see it, I want to paddle out there\" list of trips I had. So when a friend of mine mentioned she had Friday off, I suggested that we paddle out to Governor's Island, according to my map, a 7K B-line from a popular launching spot outside of Charlottetown.\r\n\r\nThe weather that morning was a little dicey, with winds and a fun bit of chop. We plowed through the waves, and headed toward the island. \r\n\r\nA couple of years ago, a pair of guys on the same route in an open canoe ran into trouble when they capsized their boat en route. On a clear calm day, canoeing this would be no problem though. The weather must have changed on them.\r\n\r\nOur paddle out was uneventful except for the sounds we heard out in the distance, and the indestinguishable objects on the horizon. Once reaching the island, we would then find out just what they really were. Actually upon getting close to the island, we were given a pretty good hint at that all the racket was about.\r\n\r\nOff to our left, we saw fat bodies waddling off the shore edge and into the water. They drew nearer, bobbing their heads curiously around us. Some even jumping almost clear out of the water. Seals! A friend of mine who did the trip not too long before us, told me he'd seen a bunch of seals out there. \r\n\r\nAfter taking in the antics of the near by seals, we beached and pulled up our kayaks so they wouldn't be washed away by a rising tide. We explored the coast line and some of the deserted man made reminants close to shore. A friend tells me that there was a drilling platform there originally, and at one point, was the largest in North America many years ago. It ended up being dry of course.\r\n\r\nWe lounged around for a bit, and shared an orange before making our way back to our boats. Over looking the water, we could see a huge group of seals out on a shallow section in the water. They were making all the noise we heard on our arrival. \r\n\r\nThe little island had meadow areas with tall grasses and wild roses. I didn't venture in enough to see any evidence of foundations, but I'm sure there are some. I would also liked to have paddled around it, but we didn't have time that day. Maybe a camp over some night would be fun. Even an Island hop, staying here one night, and then paddling over to St. Peter's Island for the next. However, another friend told me that This island is haunted. Great. Just what I need to know...\r\n\r\nAnyway, with a rising tide, our way home went very quickly. There's a feature out in the water, according to my topo of some sort of rock. I marked it on my GPS, but upon paddling around the spot, saw nothing but deep water. Maybe it's something visible from the air, or better seen at really low tide.\r\n\r\nThe water on our return really settled down. It was almost like glass. More of what Janice prefers than the lively chop we went through on our way over. We were home by 1 and lunching at a thai restaurant soon after. What a great day!\r\n\r\nshannon Burt\r\nEast coast editor.",
  "directions": "Head over the bridge from Charlottetown to Stratford, and take the Kinlock road. When you reach the intersection for the Kepoch road, turn right to the little community park and boat launch. You'll see the island from there too.",
  "geohash": "f85n",
  "nearest_peak_geohash": "f85nv56yqk3y",
  "photos": [
    "https://trailpeak.com/storage//content/trails/Canada/PE/1933/reg_Dsc00003.jpg",
    "https://trailpeak.com/storage//content/trails/Canada/PE/1933/reg_Dsc00007.jpg",
    "https://trailpeak.com/storage//content/trails/Canada/PE/1933/reg_Dsc00008.jpg",
    "https://trailpeak.com/storage//content/trails/Canada/PE/1933/reg_Dsc00015.jpg",
    "https://trailpeak.com/storage//content/trails/Canada/PE/1933/reg_topo.jpg",
    "https://trailpeak.com/storage//content/trails/Canada/PE/1933/topo_Dsc00004.jpg"
  ],
  "source_url": "https://trailpeak.com/trails/governors-island-near-charlottetown-pe-1933",
  "stats": {
    "Activities": "hike sea-kayak",
    "From": "",
    "Seasons": "summer fall",
    "Stars": 4,
    "Time": "4 hrs",
    "Total Distance": "14 km",
    "Town": "Charlottetown, PE",
    "Type": "out-and-back"
  },
  "title": "Governor's Island",
  "trail_id": "1933",
  "waypoints": [
    [
      {
        "alt": null,
        "lat": 46.19841121,
        "lng": -63.084590676
      },
      {
        "alt": null,
        "lat": 46.198088675,
        "lng": -63.085041218
      },
      {
        "alt": null,
        "lat": 46.193818722,
        "lng": -63.085492113
      },
      {
        "alt": null,
        "lat": 46.190772353,
        "lng": -63.085298187
      },
      {
        "alt": null,
        "lat": 46.187575274,
        "lng": -63.084440581
      },
      {
        "alt": null,
        "lat": 46.184377615,
        "lng": -63.083130854
      },
      {
        "alt": null,
        "lat": 46.179785831,
        "lng": -63.081821802
      },
      {
        "alt": null,
        "lat": 46.177661069,
        "lng": -63.081607467
      },
      {
        "alt": null,
        "lat": 46.17384205,
        "lng": -63.08074937
      },
      {
        "alt": null,
        "lat": 46.173219547,
        "lng": -63.080320944
      },
      {
        "alt": null,
        "lat": 46.172619243,
        "lng": -63.08032007
      },
      {
        "alt": null,
        "lat": 46.171996738,
        "lng": -63.079891659
      },
      {
        "alt": null,
        "lat": 46.167276353,
        "lng": -63.078367959
      },
      {
        "alt": null,
        "lat": 46.164528921,
        "lng": -63.077939201
      },
      {
        "alt": null,
        "lat": 46.162233595,
        "lng": -63.077059081
      },
      {
        "alt": null,
        "lat": 46.160409407,
        "lng": -63.07686614
      },
      {
        "alt": null,
        "lat": 46.158413632,
        "lng": -63.076200244
      },
      {
        "alt": null,
        "lat": 46.157512708,
        "lng": -63.076222312
      },
      {
        "alt": null,
        "lat": 46.150174411,
        "lng": -63.074269745
      },
      {
        "alt": null,
        "lat": 46.146375881,
        "lng": -63.073624971
      },
      {
        "alt": null,
        "lat": 46.142856771,
        "lng": -63.072316429
      },
      {
        "alt": null,
        "lat": 46.139810283,
        "lng": -63.07079374
      },
      {
        "alt": null,
        "lat": 46.13903757,
        "lng": -63.070149285
      },
      {
        "alt": null,
        "lat": 46.137063348,
        "lng": -63.069483917
      },
      {
        "alt": null,
        "lat": 46.137063478,
        "lng": -63.069270299
      },
      {
        "alt": null,
        "lat": 46.136741274,
        "lng": -63.069269895
      }
    ],
    [
      {
        "alt": null,
        "lat": 46.136345144,
        "lng": -63.059933792
      }
    ],
    [
      {
        "alt": null,
        "lat": 46.198250593,
        "lng": -63.085151635
      }
    ],
    [
      {
        "alt": null,
        "lat": 46.144388435,
        "lng": -63.073966744
      }
    ]
  ]
}