{
  "center_geohash": "f85xf773krbp",
  "center_lat": 46.3804149195,
  "center_lng": -62.47460244,
  "description": "Eastern Prince Edward Island by bicycle, great views, PEI at it's best, road shoulders, friendly cyclists ...\nTrip summary:\nnote: this trail features attached GPS data.\nDay 1~78K from Charlottetown to Naufrage\nDay 2~122 K from Naufrage to Brudenell\nDay 3 ~57 K from Brudenell to Charlottetown\nthings I really liked during the trip:\n-Great views that capture the uniqueness of the Island and moderately challenging terrain\n-Shoulders on the road for most of the trip\n-The tail-wind wake from passing traffic\n-Meeting and chatting with fellow cyclists and tourists\n-Freshly pressed coffee every morning\n-Beautiful weather\n-Discovering Naufrage\n-Using a truely great pannier system\n-Spending the evenings with my girlfriend ;~)\nThings I didn't like during the trip:\n-The headwinds I encountered.\n-Not going to Panmure Island\n-The really hot weather on day 2\n-Almost getting killed at the end of day 2\n-Having my trip come to a finish!\nThe trip log:\nThe eastern wedge of PEI is lined in undulating hills, red cliff shorelines and sandy beaches meeting sky-blue ocean. What better way to explore the terrain and see the sights than by a fully loaded self-sustained bike tour! I scheduled three days for my trip and planned to do a loop leaving from Charlottetown, tuesday morning, and arriving back home thursday sometime. A focus of my trip was to revisit an area that I had cycled  5 years ago, plus I had new-to-me panniers that I wanted to try. (Arkel tandem sized units that I bought from a friend) I thought I would document the trip for Trailpeak with a journal, some photos and some GPS waypoints of interest.  \nTuesday morning wasn't looking all that great. Steady rain with reports of it easing up by noon at the very least. If I were at a campground, leaving in the wet stuff wouldn't have been so bad, but leaving from home where everything is dry and warm to go and get soaked just seems to have a lesser appeal. Consequently, I lazily packed up my things and loaded up the bike. I was amazed at how much I could get into these panniers. They were build to hold enough for two people, but I got everything into them and the front units so that I needed to put nothing on top of my rack afterward. What a sleek, self-contained system. I use to use a packing list showing what was to go in each of the four top loading panniers, but list be damned, with these things, you can easily visualize how it will all fit. These units have the fronts that zipper open revealing  everything laid out in its place. I use to use the list so that I could find things faster, but no need for the list now.\nBy the time I had finished packing the bike, the rain stopped! It was around 10:30, and the only thing I was concerned about was loosing the couple of hours of cycle time. With the group I go with, the usual show-up time is 8 AM, but I was doing this one solo, so I was on my own schedule. Leaving later ended up working for the better anyway.\nThe day was to be cloudy and cool, so that was ideal for biking. I left charlottetown, and soon enough, I was putting on the miles. On my last trip, I really hurt my knee, so this time, I was going to be vigilant about how much stress I put it under. So far so good. My first stop was going to be a lunch break in Mount Stewart. There, exists a nice little attraction called the Trailside Cafe. They are situated along the Confederation Trail, and as a result, rent bikes, and have a great restaurant. The food there is awesome, and the entertainment they bring in can make for a really special occasion.\nParallel to the highway (route 2 East), runs the Hillsborough River. It's a heritage river system that people will often paddle for a day trip back to Charlottetown. I have never done it, but it's on my list! The confederation trail runs along side it for quite a spell as well. There are interpretive sites all along the way.\nI reached Mount Stewart by around 1pm and ate my lunch. I talked to some tourists who were visiting form the states, and were there to rent bikes and ride the trail. I noticed across the street a new building. It was an eco interpretive center and museum. All the other times I had been in the area, it was closed, so I decided to check it out. It still wasn't completely organized, but there were artifacts and some displays in a beautiful space. What I noticed most of all was this birch bark canoe suspended from the rafters. It was neat to see.\nWell, enough resting. It was time to press on. My next community to roll through would be Saint Peters. That would be around another 30-35 K away. No problem. I was making steady time, actually too good a time. At the rate was going, I might reach Naufrage (my first night) too early. So I slowed it down and and took it easy. I took more pictures and looked around more instead of staring at my front tire or top tube of my bike the whole way.\nI kept to the highway, but it is worthy to note that the confederation trail section that spans from mt. Stewart through to St. Peters is probably the most attractive part of the trail system. It goes along the St. Peters bay area, and even has a nice bridge to cross. The views there are really nice. You can see the mussels beds all lined up on buoys in the water, and fishing boats harvesting them.\nIn St. Peters, I left highway 2 and took route 16. This is would take me along the edge of the eastern tip of the province. The hills roll, but there is a constant view of the ocean,  the occasional fishing community and fields of potatoes and grain.\nMy plan for my first night was to reach Naufrage (a quaint fishing village) and tent the night in the back yard of a restaurant called the shipwreck point cafe. I had already arranged the stay, and I knew they didn't mind. Upon arriving, I would call my girlfriend, and she would drive up with the kayaks and we would do dinner and kayak the coastal area until near dark. Great plan eh?\nI reached Naufrage at about 4 pm. I was nearing the turn off when I saw cyclists coming the other way. What's so appealing to me about going by bike is that it provides the opportunity to stop and chat to people. It seems that the ones you get to chat with most are like minded cyclists! This was a couple of girls form halifax who came over and rented bikes in Charlottetown. They were B&B-ing their way along the area. If you can afford it, it's a lighter way to go than camping. Right after chatting with them, a larger group of supported riders came through out of Naufrage. They were a group with the same bikes (VLB?) and were seniors from the states. Great to see people of all ages tour riding.\nWhen I reached Naufrage, it was still early, but what the heck. I could kill some time by journal writing and eating something. I was craving french fries and a well deserved cold beer at the cafe. (www.shipwreckpoint.com) I ended up getting a great deal on my order when I combined it with the special of the day. Don't know how that happened, but I guess the waitress liked me! Eventually I was able to reach my girlfriend and she appeared with kayaks! I put all my panniers into the car and hid my bike. Off we went for a paddle in some aggressive 2 meter swells. Surf city!\nDay 2.\nI woke up to a dewy tent but a beautiful sunny morning. I packed up and by around 8:30 was off to rejoin route 16 and continue along the coast. This day would cover the majority of the coastal riding. The day's highlights would be the views at campbell's cove, North Lake, East point light house, Red Point, and Souris.\nComing out of Naufrage, I was peddling along, and coming up from behind was a guy riding a litespeed roadbike. He was from halifax and was staying with his family at a cottage in Red Point. He was out for a ride before his kids and wife awoke. Great plan, I thought. I recalled him mentioning that there weren't any stores along the way until Red Point, and that wasn't good because I needed to stock up on food energy for snacks and my lunches. We rode for about a half hour and then he went on his way.\nCampbell's Cove came up next, and would have been my first night's destination had Naufrage not caught my appeal so much. At only 20 K past Naufrage, it's a logical first night. It's a small campground / provincial park, but the views there are big. I stopped just to take a picture.\nWhen I reached North Lake, I figured that I could get some cheese from a restaurant there, and that would complement the kielbasa I had with me. I found signs pointing to the wharf area advertising fresh coffee and pizza, so I thought that would be a definite score for cheese. There I found I was in luck, but besides that, it was a really neat little spot offering a niche food item probably compared to the restaurant's offerings. The place had the same quaintness, but not to the same degree as Naufrage. Further up the road was a huge building that probably housed a fish plant. Had I taken it, I would have found a shorter way back to the highway, and cut off around 5-7 K off my day's total. I believe that North Lake was deemed the tuna capital of the world. Pretty good thing to lay claim to I guess.\nThe wind for the day was blowing pretty steadily and prior to reaching East Point, existed as a tailwind. I went in to check out the lighthouse and refill my water. East point holds a lot of history centering around lighthouse keepers, and shipwrecks. It's funny to note that the last lighthouse keeper was retired in the 70's and currently lives right next door. If you go, You'd probably see him on his back deck waving back. East point is also geographically significant because of its outer most point of land on this part of the island. If you visit North point, and then East Point, they give you a tip-to-tip certificate. Kind of cool, though purely touristy.\nThe road abruptly turned to the right as I got back on the 16. (I guess it had to, otherwise I'd go off a small cliff and get wet) Now the breezes turned to headwinds, and that pretty much spelled the forces I would contend with for the rest of the day. The head winds and the longer rolling to the hills would make this a long day of riding. I guess the winds kept me cool because it was a really nice but hot day. I figured that the temps were around 26 - 27 degrees C. I was drinking water and Gatorade at a rapid rate. Progress was somewhat slow but steady. I did notice that with a harder struggle, I had far less ambition to pull off and explore the beaches and the parks. I wanted to get to Souris by lunch time if I could, and it seemed to be taking forever to get there. Otherwise I would have liked to have visited Basin Head, and Singing Sands. There the silica in the sand is such that when you walk on it, it squeaks.\nUltimately I was traveling to either Brudenell or Panmure Island for my second night. I figured that to Brudenell, it would be around 110 Km, and with the little extra travels I'd done into North Lake and also to East Point, would make the total distance even more. If I had a tailwind the whole way, then Panmure Island would be achievable, but in the heat and the headwinds, Brudenell would be fine. Maybe We'd take the kayaks to Panmure Island and explore there when she came with the kayaks that evening. We would see.\nI finally made it to Souris by about a quarter to one, and found a Visitor Information Center that was air conditioned. Well, I didn't want to leave! They had internet access as well as Island-wide free long distance phone calling. Pretty sweet. I made some calls and checked my e-mail while I was there. I was also hoping on meeting up with a kayak outfitter who runs an operation in the area. He was detained for the lunch hour and couldn't meet up, so I continued on to the Souris beach area to eat my lunch in the shade of some tourist buildings. \nLeaving Souris, the road became the Route 2 again and I started heading inland. This would conclude the coastal portion of my tour. I was hoping that it also meant the end of those nasty headwinds too. I was having quite the reunion with my granny if you know what I mean, getting my rig up some of those hills in the wind. Despite the added work, my knees were doing very well. \nThe highway proceeded as route 2 and then turned into route 4 as it forked left toward Montague. I didn't need to follow my map, simply watching for the signs was enough. On route 4, I met up with some heavy construction and had to ride on a dirt road. I should have got a photo of the red treads on my wheels from the road dust.\nThings went fairly well from there until I reached the VIC at Pool's Corner. There I would be turning toward Brudenell Provincial Park and golf academy. (Yup, a golf course where they also provide major lessons)\nI pretty much did the same thing at that VIC. I called my girlfriend to let her know I had made it, and also checked a few internet things. I also checked ahead with the campground to see if there was availability. You can pretty much take for granted that there would be room if you're booking during the weekdays. Once again, I was right, and they had plenty of room.\nAt about half way toward the campground, I was riding along, when this idiot car coming the other way decides to pass a car who was turning off the road. the lines were solid and I was about four feet into the road space. I had my head turned around to look at something behind me, and when I turned to look ahead (probably to see what the acceleration noise was about) I saw this car pulling out and heading right for me. I was pretty shaken by this near miss. I could feel the wind from his front bumper breeze by my legs. But, it was a miss luckily, and I was able to shake it off. A miss is a miss. Nothing happened.\nI got to the campground and got to my site. I saw two 50-something women from Michigan at the site beside me, and felt right at home among fellow cyclists. First thing we started chatting about was gear! Are we all like that?\n I got my tent set up and was preparing for a nap. it was around a quarter to five, and would have plenty of time to rest up. They had great showers there too, and after that long scorching 122 Km day, it sure felt good. I managed to change and rest after that in my spacious site.\nWhen my girlfriend came, we thought we'd go for supper first, and then try out the horse back riding that they offered at the park. We've always wanted to go, but never took the opportunity. When we returned from supper, it was too late to get on one of their tours. Next time I guess. We got some firewood and and made acquaintances with a bottle of volpechella she brought along. A relaxing evening was well on its way.\nDay 3 the ride home.\nIt turned out that where I camped, there were two sites next to me with cyclists. There were two couples another spot over who were from Quebec. So we all chatted for a while in the morning retelling our experiences and locations of interest we'd encountered. I spent the rest of the morning writing up my journal from yesterday's trek, and continued to lavish my freshly pressed coffee. (another luxury item; GSI's Java Press) It was around 10 or so when I finally packed up and departed.\nMy last day was a short haul. I'd be continuing inland taking Route 3 towards Charlottetown. Interestingly enough, the route is also a marathon running route that goes from Montague to just outside of Charlottetown, so I estimated that the trip would be a bit longer than 42 K. Certainly a leisurely go this time. The problem was that from where I stayed that night, there were few options for variety to getting back home. Anything that would have been more exciting would have required me to add an extra day at least to my trip. A suggested route if you had 4-5 days would include staying at Panmure Island on day three, and then on day four, contunuing to skirt the coast on route 17 and go through Murray River, then along the coast to hit Little Sands where there is a small German winery called Rosignal. Continuing from there, one could stay at Northumberland campground, located just near Wood Islands where the NS ferry is situated. to wrap it up, a nice half day+ ride would get you back into charlottetown. None the less, I took the straight and consedrvative route back home.\nI encountered only one other cyclist headed the other way that day. She was a roady, and given the tailwind she had, was just cruising. Not likely to stop and chat. A wave and a \"hi\" would serve well enough.\nNear Cherry Valley, at the marathon's half way point, there is a huge church and graveyard. I stopped there for a snack and a break. Two motorcyclists from quebec stopped there too for some map reading and a chat. I spoke with them briefly, and then headed back onto the road. One nice scene I passed was a u-pick sunflower site. A huge plot of sunflowers was growing in a field along side the road. Worthy of a shot at least.\nWhen I reached the TCH (route 1) I turned and headed for home. It wouldn't be too long before I would hit charlottetown, and I was wanting to make the ride a bit more interesting scenically as well as challenging. So when a side route came along near Alexandra, I took it. Route 1A rolls through Tea hill and the Stratford communities, while skirting the water's edge. It's a much prettier path than taking the TCH and B-lining it to town.\nI reached home around 1 PM, and unloaded my gear. It was a short but nice way to end my three day adventure.\n~~~\nIf you were interested in cycling the island you could fly into charlottetown, go to Smooth Cycle www.smoothcycle.com or another bike shop to rent a bike. I'd pre-book my tenting accomodations if you're coming from a far, and then do a round trip.  Other things worthy of checking out: Confederation trail system. Also, Gary Conrad offers tours in the atlantic provinces. www.atlanticcanadacycling.com. He's based in Halifax, NS.",
  "directions": "found in the log.",
  "geohash": "f8",
  "nearest_peak_geohash": "f85rwzd3bce6",
  "photos": [
    "https://trailpeak.com/storage//content/trails/Canada/PE/1190/reg_1mtstewart.jpg",
    "https://trailpeak.com/storage//content/trails/Canada/PE/1190/reg_4harshconditions.jpg",
    "https://trailpeak.com/storage//content/trails/Canada/PE/1190/reg_5u-pick.jpg",
    "https://trailpeak.com/storage//content/trails/Canada/PE/1190/reg_neighbor_srig.jpg",
    "https://trailpeak.com/storage//content/trails/Canada/PE/1190/reg_potatosandgrain.jpg",
    "https://trailpeak.com/storage//content/trails/Canada/PE/1190/topo_DSC00001JPG.jpg"
  ],
  "source_url": "https://trailpeak.com/trails/eastern-pei-near-charlottetown-pe-1190",
  "stats": {
    "Activities": "sea-kayak mtn-bike",
    "From": "",
    "Seasons": "summer",
    "Stars": 4,
    "Time": "21 hrs",
    "Total Distance": "260 km",
    "Town": "Charlottetown, PE",
    "Type": "out-and-back"
  },
  "title": "eastern PEI",
  "trail_id": "1190",
  "waypoints": [
    [
      {
        "alt": 31.849121,
        "lat": 46.342757071,
        "lng": -62.967044718
      },
      {
        "alt": -0.354736,
        "lat": 46.366510151,
        "lng": -62.869755662
      },
      {
        "alt": 32.810547,
        "lat": 46.41292341,
        "lng": -62.640245369
      },
      {
        "alt": 34.733154,
        "lat": 46.468820787,
        "lng": -62.419960377
      },
      {
        "alt": 4.451782,
        "lat": 46.470687597,
        "lng": -62.41594824
      },
      {
        "alt": -1.31604,
        "lat": 46.470644621,
        "lng": -62.414231944
      },
      {
        "alt": 0.606567,
        "lat": 46.470279469,
        "lng": -62.410948258
      },
      {
        "alt": 0.606567,
        "lat": 46.469786177,
        "lng": -62.40813752
      },
      {
        "alt": 4.451782,
        "lat": 46.469721721,
        "lng": -62.403180813
      },
      {
        "alt": 4.932373,
        "lat": 46.469635683,
        "lng": -62.402043349
      },
      {
        "alt": 5.413086,
        "lat": 46.469421049,
        "lng": -62.401270702
      },
      {
        "alt": 2.048584,
        "lat": 46.470343851,
        "lng": -62.399275514
      },
      {
        "alt": 3.490478,
        "lat": 46.470279951,
        "lng": -62.398932347
      },
      {
        "alt": 3.009766,
        "lat": 46.469357259,
        "lng": -62.398889102
      },
      {
        "alt": 2.529175,
        "lat": 46.46918559,
        "lng": -62.39876074
      },
      {
        "alt": 3.009766,
        "lat": 46.469034947,
        "lng": -62.398352109
      },
      {
        "alt": 2.529175,
        "lat": 46.469228102,
        "lng": -62.394876181
      },
      {
        "alt": 3.009766,
        "lat": 46.46946401,
        "lng": -62.394898314
      },
      {
        "alt": 2.048584,
        "lat": 46.46961445,
        "lng": -62.395777152
      },
      {
        "alt": 2.048584,
        "lat": 46.469764725,
        "lng": -62.399875837
      },
      {
        "alt": -0.354736,
        "lat": 46.470129598,
        "lng": -62.40425355
      },
      {
        "alt": 3.490478,
        "lat": 46.469957869,
        "lng": -62.409317053
      },
      {
        "alt": 1.567871,
        "lat": 46.470151325,
        "lng": -62.411055146
      },
      {
        "alt": 0.125977,
        "lat": 46.469850049,
        "lng": -62.413372986
      },
      {
        "alt": 0.125977,
        "lat": 46.469743447,
        "lng": -62.415755145
      },
      {
        "alt": 0.606567,
        "lat": 46.470107944,
        "lng": -62.416462428
      },
      {
        "alt": 0.606567,
        "lat": 46.470000256,
        "lng": -62.416699337
      },
      {
        "alt": -0.354736,
        "lat": 46.469700654,
        "lng": -62.416892706
      },
      {
        "alt": 1.567871,
        "lat": 46.468992569,
        "lng": -62.417106064
      }
    ],
    [
      {
        "alt": 31.860718,
        "lat": 46.342757071,
        "lng": -62.967044718
      },
      {
        "alt": 26.092896,
        "lat": 46.342777765,
        "lng": -62.967023914
      }
    ],
    [
      {
        "alt": 16.479736,
        "lat": 46.366467001,
        "lng": -62.869798666
      },
      {
        "alt": -0.343384,
        "lat": 46.366510151,
        "lng": -62.869755662
      },
      {
        "alt": 6.385864,
        "lat": 46.366467852,
        "lng": -62.869755762
      },
      {
        "alt": 9.269897,
        "lat": 46.366467878,
        "lng": -62.869777863
      }
    ],
    [
      {
        "alt": 28.976929,
        "lat": 46.412880188,
        "lng": -62.640524103
      },
      {
        "alt": 28.976929,
        "lat": 46.412965843,
        "lng": -62.640288029
      },
      {
        "alt": 28.015503,
        "lat": 46.412966608,
        "lng": -62.640245085
      },
      {
        "alt": 33.302856,
        "lat": 46.412945009,
        "lng": -62.640245227
      },
      {
        "alt": 32.822266,
        "lat": 46.41292341,
        "lng": -62.640245369
      }
    ],
    [
      {
        "alt": 52.529175,
        "lat": 46.468841703,
        "lng": -62.420003138
      },
      {
        "alt": 34.744873,
        "lat": 46.468820787,
        "lng": -62.419960377
      },
      {
        "alt": 34.26416,
        "lat": 46.468820787,
        "lng": -62.419960377
      }
    ],
    [
      {
        "alt": 35.706055,
        "lat": 46.470644046,
        "lng": -62.416055514
      },
      {
        "alt": 4.463257,
        "lat": 46.470687597,
        "lng": -62.41594824
      },
      {
        "alt": 3.501953,
        "lat": 46.470730375,
        "lng": -62.415689878
      },
      {
        "alt": 3.02124,
        "lat": 46.470730311,
        "lng": -62.415325165
      },
      {
        "alt": 1.098633,
        "lat": 46.470666019,
        "lng": -62.414896013
      },
      {
        "alt": -0.343384,
        "lat": 46.470666153,
        "lng": -62.414746219
      },
      {
        "alt": -1.304688,
        "lat": 46.470644621,
        "lng": -62.414231944
      },
      {
        "alt": -1.785278,
        "lat": 46.470601922,
        "lng": -62.413802563
      },
      {
        "alt": 1.579346,
        "lat": 46.470473194,
        "lng": -62.413094059
      },
      {
        "alt": 1.098633,
        "lat": 46.470387329,
        "lng": -62.412321274
      },
      {
        "alt": 2.060058,
        "lat": 46.470279738,
        "lng": -62.411699819
      },
      {
        "alt": 0.618042,
        "lat": 46.470279469,
        "lng": -62.410948258
      },
      {
        "alt": 1.098633,
        "lat": 46.470214939,
        "lng": -62.410476134
      },
      {
        "alt": 1.098633,
        "lat": 46.470129595,
        "lng": -62.409982093
      },
      {
        "alt": 2.060058,
        "lat": 46.470022333,
        "lng": -62.409252532
      },
      {
        "alt": 2.540649,
        "lat": 46.469915055,
        "lng": -62.408694908
      },
      {
        "alt": 0.618042,
        "lat": 46.469786177,
        "lng": -62.40813752
      },
      {
        "alt": 2.540649,
        "lat": 46.469785876,
        "lng": -62.4075579
      },
      {
        "alt": 3.501953,
        "lat": 46.469764883,
        "lng": -62.406806571
      },
      {
        "alt": 3.501953,
        "lat": 46.469743192,
        "lng": -62.406442099
      },
      {
        "alt": 3.501953,
        "lat": 46.469765042,
        "lng": -62.405970348
      },
      {
        "alt": 4.943848,
        "lat": 46.469743132,
        "lng": -62.405390963
      },
      {
        "alt": 3.02124,
        "lat": 46.469743488,
        "lng": -62.404940286
      },
      {
        "alt": 4.943848,
        "lat": 46.46976488,
        "lng": -62.404554505
      },
      {
        "alt": 4.943848,
        "lat": 46.469764556,
        "lng": -62.404146818
      },
      {
        "alt": 5.424561,
        "lat": 46.469743418,
        "lng": -62.403717216
      },
      {
        "alt": 4.463257,
        "lat": 46.469721721,
        "lng": -62.403180813
      },
      {
        "alt": 5.424561,
        "lat": 46.469657385,
        "lng": -62.402579751
      },
      {
        "alt": 4.943848,
        "lat": 46.469635683,
        "lng": -62.402043349
      },
      {
        "alt": 4.463257,
        "lat": 46.469442988,
        "lng": -62.40150752
      },
      {
        "alt": 5.424561,
        "lat": 46.469421049,
        "lng": -62.401270702
      },
      {
        "alt": 4.463257,
        "lat": 46.469571573,
        "lng": -62.400970775
      },
      {
        "alt": 3.501953,
        "lat": 46.469743243,
        "lng": -62.400584647
      },
      {
        "alt": 1.579346,
        "lat": 46.470108061,
        "lng": -62.399790004
      },
      {
        "alt": 2.060058,
        "lat": 46.470343851,
        "lng": -62.399275514
      },
      {
        "alt": 3.982666,
        "lat": 46.470300984,
        "lng": -62.39899594
      },
      {
        "alt": 3.501953,
        "lat": 46.470279951,
        "lng": -62.398932347
      },
      {
        "alt": 3.982666,
        "lat": 46.470279951,
        "lng": -62.398932347
      },
      {
        "alt": 3.501953,
        "lat": 46.47021515,
        "lng": -62.398931758
      },
      {
        "alt": 3.02124,
        "lat": 46.46959305,
        "lng": -62.398889111
      },
      {
        "alt": 3.02124,
        "lat": 46.469357259,
        "lng": -62.398889102
      },
      {
        "alt": 2.540649,
        "lat": 46.46918559,
        "lng": -62.39876074
      },
      {
        "alt": 3.02124,
        "lat": 46.469034947,
        "lng": -62.398352109
      },
      {
        "alt": 1.579346,
        "lat": 46.469013678,
        "lng": -62.397901676
      },
      {
        "alt": 1.098633,
        "lat": 46.469078236,
        "lng": -62.397172862
      },
      {
        "alt": -0.343384,
        "lat": 46.46907766,
        "lng": -62.3967222
      },
      {
        "alt": 2.060058,
        "lat": 46.469120724,
        "lng": -62.396185091
      },
      {
        "alt": 2.060058,
        "lat": 46.469185608,
        "lng": -62.395520092
      },
      {
        "alt": 2.060058,
        "lat": 46.469184918,
        "lng": -62.39521922
      },
      {
        "alt": 2.540649,
        "lat": 46.469228102,
        "lng": -62.394876181
      },
      {
        "alt": 3.02124,
        "lat": 46.469292558,
        "lng": -62.394811643
      },
      {
        "alt": 2.540649,
        "lat": 46.469378056,
        "lng": -62.394811998
      },
      {
        "alt": 3.02124,
        "lat": 46.46946401,
        "lng": -62.394898314
      },
      {
        "alt": 2.060058,
        "lat": 46.469549975,
        "lng": -62.395327193
      },
      {
        "alt": 2.060058,
        "lat": 46.46961445,
        "lng": -62.395777152
      },
      {
        "alt": 3.982666,
        "lat": 46.469571842,
        "lng": -62.396400228
      },
      {
        "alt": 3.02124,
        "lat": 46.469657018,
        "lng": -62.396851261
      },
      {
        "alt": 4.943848,
        "lat": 46.469678965,
        "lng": -62.397258709
      },
      {
        "alt": 5.424561,
        "lat": 46.469700353,
        "lng": -62.397901919
      },
      {
        "alt": 3.982666,
        "lat": 46.469742999,
        "lng": -62.398481072
      },
      {
        "alt": 3.501953,
        "lat": 46.469786202,
        "lng": -62.398824463
      },
      {
        "alt": 3.02124,
        "lat": 46.469764382,
        "lng": -62.399296217
      },
      {
        "alt": 2.060058,
        "lat": 46.469764725,
        "lng": -62.399875837
      },
      {
        "alt": 1.098633,
        "lat": 46.469786327,
        "lng": -62.400219467
      },
      {
        "alt": 1.098633,
        "lat": 46.469807477,
        "lng": -62.400477134
      },
      {
        "alt": 1.098633,
        "lat": 46.469850226,
        "lng": -62.401078432
      },
      {
        "alt": 2.060058,
        "lat": 46.469893755,
        "lng": -62.40165758
      },
      {
        "alt": 3.02124,
        "lat": 46.469914784,
        "lng": -62.402236975
      },
      {
        "alt": 1.098633,
        "lat": 46.469936597,
        "lng": -62.402622284
      },
      {
        "alt": 0.137451,
        "lat": 46.470000599,
        "lng": -62.403159529
      },
      {
        "alt": 0.137451,
        "lat": 46.470021852,
        "lng": -62.403438039
      },
      {
        "alt": 0.618042,
        "lat": 46.470064708,
        "lng": -62.403717615
      },
      {
        "alt": -0.343384,
        "lat": 46.470129598,
        "lng": -62.40425355
      },
      {
        "alt": -0.343384,
        "lat": 46.470107871,
        "lng": -62.404747447
      },
      {
        "alt": -0.343384,
        "lat": 46.470150941,
        "lng": -62.405068703
      },
      {
        "alt": 0.618042,
        "lat": 46.470151133,
        "lng": -62.40579812
      },
      {
        "alt": 1.098633,
        "lat": 46.470107901,
        "lng": -62.406485026
      },
      {
        "alt": 0.137451,
        "lat": 46.47010787,
        "lng": -62.406999527
      },
      {
        "alt": 1.098633,
        "lat": 46.470065086,
        "lng": -62.407600459
      },
      {
        "alt": 1.098633,
        "lat": 46.470021968,
        "lng": -62.408137569
      },
      {
        "alt": 1.579346,
        "lat": 46.469957466,
        "lng": -62.408716592
      },
      {
        "alt": 3.501953,
        "lat": 46.469957869,
        "lng": -62.409317053
      },
      {
        "alt": 2.540649,
        "lat": 46.469979417,
        "lng": -62.410004556
      },
      {
        "alt": 1.579346,
        "lat": 46.470043949,
        "lng": -62.410476678
      },
      {
        "alt": 1.579346,
        "lat": 46.470108257,
        "lng": -62.410905819
      },
      {
        "alt": 1.579346,
        "lat": 46.470151325,
        "lng": -62.411055146
      },
      {
        "alt": -0.343384,
        "lat": 46.470107635,
        "lng": -62.41148415
      },
      {
        "alt": -0.343384,
        "lat": 46.470086097,
        "lng": -62.412021026
      },
      {
        "alt": -1.304688,
        "lat": 46.47002204,
        "lng": -62.412515375
      },
      {
        "alt": -1.304688,
        "lat": 46.469914885,
        "lng": -62.413029724
      },
      {
        "alt": 0.137451,
        "lat": 46.469850049,
        "lng": -62.413372986
      },
      {
        "alt": 0.137451,
        "lat": 46.469828628,
        "lng": -62.413758764
      },
      {
        "alt": 0.618042,
        "lat": 46.469786268,
        "lng": -62.414273716
      },
      {
        "alt": 1.579346,
        "lat": 46.469764497,
        "lng": -62.414767606
      },
      {
        "alt": 2.060058,
        "lat": 46.469807765,
        "lng": -62.415133152
      },
      {
        "alt": 1.579346,
        "lat": 46.469786338,
        "lng": -62.415518929
      },
      {
        "alt": 0.137451,
        "lat": 46.469743447,
        "lng": -62.415755145
      },
      {
        "alt": 0.137451,
        "lat": 46.469742986,
        "lng": -62.415841117
      },
      {
        "alt": 0.618042,
        "lat": 46.469786401,
        "lng": -62.415883636
      },
      {
        "alt": 1.579346,
        "lat": 46.46995759,
        "lng": -62.416098024
      },
      {
        "alt": 0.618042,
        "lat": 46.470107944,
        "lng": -62.416462428
      },
      {
        "alt": 0.618042,
        "lat": 46.470000256,
        "lng": -62.416699337
      },
      {
        "alt": -0.343384,
        "lat": 46.469700654,
        "lng": -62.416892706
      },
      {
        "alt": 0.137451,
        "lat": 46.469249746,
        "lng": -62.417064243
      },
      {
        "alt": 1.098633,
        "lat": 46.469013274,
        "lng": -62.417107145
      },
      {
        "alt": 1.579346,
        "lat": 46.468992569,
        "lng": -62.417106064
      },
      {
        "alt": 3.02124,
        "lat": 46.469014061,
        "lng": -62.417084994
      }
    ],
    [
      {
        "alt": 34.744873,
        "lat": 46.475472583,
        "lng": -62.13755578
      },
      {
        "alt": 35.706055,
        "lat": 46.475386187,
        "lng": -62.137555843
      },
      {
        "alt": 32.341553,
        "lat": 46.475407626,
        "lng": -62.137534661
      },
      {
        "alt": 32.822266,
        "lat": 46.475407626,
        "lng": -62.137534661
      }
    ],
    [
      {
        "alt": 52.529175,
        "lat": 46.450066947,
        "lng": -61.982160162
      },
      {
        "alt": 29.93811,
        "lat": 46.450217156,
        "lng": -61.982352673
      },
      {
        "alt": 26.573609,
        "lat": 46.450216638,
        "lng": -61.982395651
      }
    ],
    [
      {
        "alt": 39.55127,
        "lat": 46.404747587,
        "lng": -62.078289955
      },
      {
        "alt": 24.651001,
        "lat": 46.404726544,
        "lng": -62.078247377
      },
      {
        "alt": 24.170288,
        "lat": 46.404726544,
        "lng": -62.078247377
      }
    ],
    [
      {
        "alt": 26.573609,
        "lat": 46.354772953,
        "lng": -62.209761101
      },
      {
        "alt": 12.6344,
        "lat": 46.354772579,
        "lng": -62.210618969
      },
      {
        "alt": 11.673218,
        "lat": 46.354751792,
        "lng": -62.211650004
      },
      {
        "alt": 14.557007,
        "lat": 46.354730129,
        "lng": -62.212293712
      },
      {
        "alt": 18.402344,
        "lat": 46.354708447,
        "lng": -62.213066099
      },
      {
        "alt": 20.324951,
        "lat": 46.354687086,
        "lng": -62.213624016
      }
    ],
    [
      {
        "alt": 53.009766,
        "lat": 46.286387233,
        "lng": -62.566215651
      },
      {
        "alt": 38.109375,
        "lat": 46.286044323,
        "lng": -62.566924557
      },
      {
        "alt": 36.186768,
        "lat": 46.285657467,
        "lng": -62.567675342
      },
      {
        "alt": 36.667481,
        "lat": 46.285400215,
        "lng": -62.568190134
      },
      {
        "alt": 36.667481,
        "lat": 46.285378856,
        "lng": -62.568253911
      },
      {
        "alt": 35.706055,
        "lat": 46.285357256,
        "lng": -62.56825408
      },
      {
        "alt": 35.706055,
        "lat": 46.285357256,
        "lng": -62.56825408
      }
    ],
    [
      {
        "alt": 32.329834,
        "lat": 46.475414914,
        "lng": -62.13754627
      }
    ],
    [
      {
        "alt": 31.608887,
        "lat": 46.45019393,
        "lng": -61.982271076
      }
    ],
    [
      {
        "alt": 28.965332,
        "lat": 46.404708715,
        "lng": -62.078268493
      }
    ],
    [
      {
        "alt": 32.329834,
        "lat": 46.412934238,
        "lng": -62.640254406
      }
    ],
    [
      {
        "alt": 50.594726,
        "lat": 46.468829298,
        "lng": -62.419863902
      }
    ],
    [
      {
        "alt": 26.802246,
        "lat": 46.342778663,
        "lng": -62.967016116
      }
    ],
    [
      {
        "alt": 5.413086,
        "lat": 46.366478661,
        "lng": -62.869763537
      }
    ]
  ]
}