{
  "description": "<p>Ski boots that climb like technical alpine boots. Arc'teryx built the Procline AR with an equal focus on climbing and skiing. The upper cuff uses 2 pivoting pieces to create an exceptional range of motion. Place your crampon points precisely and get lots of skin surface on the snow when traversing gets technical. In ski mode, the spoiler snugs the upper cuff to prevent the lateral movement that's only useful when climbing. Fully snowproof and highly water-resistant, the shells are equipped with a hybrid closure system to distribute pressure and keep you locked in. Procline Support liners are warm and heat-mouldable, giving aggressive skiers the drive to climb and conquer couloirs.</p><ul><li>Cuff is made of stiff, light and durable Grilamid-injected carbon fibre</li><li>Shell is made of Ultramid and Spoiler is 60% fibreglass with Grilamid for optimal weight to stiffness ratio</li><li>Light and stiff tongue increases the skiing performance without hindering climbing range of motion</li><li>360° rotating cuff offers 77° of vertical rotation and 23° and 12° of internal and external rotation, respectively</li><li>Hybrid closure system pairs the load-spreading ability of cable systems with an aluminum buckle to secure the tension</li><li>Closure system keeps buckles out of the way in tight places</li><li>Cam Lock power strap is secure, powerful and doesn't use abrasive Velcro®, so it won't shred your pants</li><li>Full-coverage gaiter made of SOFTSTRECH® with TPU reinforcement keeps snow and water out</li><li>Fully mouldable Lite AR Liner uses Ultralon foam to create a supportive and powerful ride</li><li>Reduced shell length, rockered sole and a crampon-optimized toe offer great climbing performance</li><li>Rubber toecap provides protection and added grip when climbing</li><li>Tech inserts are Dynafit Certified</li><li>Vibram TOP85 Touring sole is grippy and light</li><li>Toe and heel welt are compatible with automatic or semi-automatic crampons</li><li>Boot is compatible with tech bindings only</li></ul>",
  "img_hrefs": [
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/42099/images/171746/5060515_BP000__45154.1698784632.1280.1280.jpg?c=1"
  ],
  "name": "Arc'teryx Procline AR Carbon Boots - Women's",
  "price_cents": 67993,
  "specs": [
    {
      "key": "Weight",
      "value": "2.4kg (25)"
    },
    {
      "key": "Ideal for",
      "value": [
        "Alpine touring",
        "Ski mountaineering"
      ]
    },
    {
      "key": "Boot/binding compatibility",
      "value": [
        "Tech"
      ]
    },
    {
      "key": "Buckles",
      "value": "2"
    },
    {
      "key": "Lower shell material",
      "value": [
        "Ultramid"
      ]
    },
    {
      "key": "Shell cuff material",
      "value": [
        "Grilamid",
        "Carbon fibre"
      ]
    },
    {
      "key": "Sole type",
      "value": [
        "Tech"
      ]
    },
    {
      "key": "Forward lean",
      "value": "14º"
    },
    {
      "key": "Range of motion",
      "value": "77º"
    },
    {
      "key": "Flex index",
      "value": "100"
    },
    {
      "key": "Last width",
      "value": "98mm"
    },
    {
      "key": "Lace-up option",
      "value": "Yes"
    },
    {
      "key": "Hike mode",
      "value": "Yes"
    },
    {
      "key": "Thermoformable inner boot",
      "value": "Yes"
    },
    {
      "key": "Made in",
      "value": "Romania"
    }
  ],
  "url": "https://www.mec.ca/en/product/5060-515/procline-ar-carbon-boots"
}