{
  "description": "<p>Powerful, durable and weather-resistant, the BC Link 2.0 takes a great backcountry communication tool and makes it even better. Whether you're looking for the best possible ski line or trying to keep your ski group together in touchy terrain, having 2-way communication makes your day easier and more fun. With a battery that lasts for days, you can go on hut trips without waking up to a dead device. The microphone grill is faceplant-ready and won't pack up with snow, helping keep communication clear.</p><ul><li>Base unit stows inside your pack or clips to your belt to keep it warm and protected, while the mic clips to your shoulder strap for easy access</li><li>Mic has glove-friendly controls including push-to-talk, volume and channel selection so you can communicate without fumbling in your pack</li><li>Smart Mic grill is designed to avoid snowpacking</li><li>2 Watts of power ensures clear communication and increased useable range</li><li>Battery power percentage display takes the guesswork out of evaluating battery level</li><li>Integrated 2300mAh lithium ion battery lasts about 80 hours of normal use, 400 hours in standby mode</li><li>Uses standard FRS and GMRS channels for compatibility with other standard radios</li><li>22 channels and 121 sub-channels allow your group to find a free one</li><li>Useable range of 9.5km line of sight. Maximum range of 64km line of sight</li><li>Updated cable connection to the base unit is solid and durable</li><li>Waterproof to IP56 standard</li><li>Radios sold individually</li><li>Only approved for use in North America</li></ul>",
  "img_hrefs": [
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/54152/images/251033/5060855_BK000__28481.1699438002.1280.1280.jpg?c=1"
  ],
  "name": "Backcountry Access BC Link 2.0",
  "price_cents": 22995,
  "specs": [
    {
      "key": "Ideal for",
      "value": [
        "Backcountry skiing"
      ]
    },
    {
      "key": "Made in",
      "value": "China"
    }
  ],
  "url": "https://www.mec.ca/en/product/5060-855/bc-link-2.0"
}