{
  "description": "<p>When you find yourself surrounded by darkness and you’re far from home (or camp, or the finish line), this powerful headlamp will light your way, it even gives you options. The low-profile light head has 3 LEDs to choose from, white spotlight, white floodlight, and red floodlight. Outfitted with constant lighting mode, you get a regulated output that won’t dim for a set amount of time. Intuitive 2-button controls take you through the modes and lets you toggle constant lighting mode on or off. Burst mode gives you direct access to 800 darkness melting lumens in 30 second increments, great for seeing a little further down the trail or illuminating things that go bump in the night. USB-C charging does away with annoying “still good” batteries, making it easy to keep your headlamp topped-up and ready to go. And, if you have an all night epic, use the included run forever cable to connect the 800 Pro to a powerbank and get longer runtimes. When using this cable, you get a pass-through charge, meaning your powerbank charges and powers your light.</p><ul><li>Constant lighting mode provides regulated brightness for a set amount of time, 2 hours in high (500 lumens), 4 hours in medium (250 lumens) and 150 hours in low (5 lumens). After that set amount of time, the headlamp gradually dims as the battery drains</li><li>8 different modes, front: spot, flood, spot + flood, flashing, and red light flood, rear: red strobe, red flood</li><li>Burst button gives you direct access to 800 lumens, 30 seconds at a time</li><li>Dimmable in all modes, making it easy to find your perfect brightness</li><li>Reserve mode gives you 8+ hours at 5 lumens</li><li>Red flood light is great for stealthy late-night bathroom runs</li><li>Rear facing red lights help keep you seen</li><li>Tilt-able light lets you aim the light</li><li>2-button controls let you cycle through modes, turn constant lighting on and off, and are easy to use, with or without gloves</li><li>Lock-out mode prevents accidental activation</li><li>Low-profile design doesn’t bounce around like so many other headlamps</li><li>Moisture wicking head strap</li><li>IPX4 water proofing means the light keeps shining even when Mother Nature has other ideas</li><li>Operational temperature range: 50º C to -20º C (low-temperature shut-off protects the battery)</li><li>USB-C charging makes it easy to top up your headlamp, going from 0-100% in about 2.5 hours</li><li>Included 90cm power cable allows pass-through charging, letting you charge and power your light via a connected powerbank</li><li>4 level LED fuel indicator lets you know how much power your battery has left</li><li>In the box: headlamp, 90cm Run Forever cable, USB-C charging cord and documentation</li></ul>",
  "img_hrefs": [
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/51135/images/227161/6025563_MGY03__61892.1698784475.1280.1280.jpg?c=1"
  ],
  "name": "BioLite Headlamp 800 Pro",
  "price_cents": 12994,
  "specs": [
    {
      "key": "Weight",
      "value": "150g (Midnight Grey)"
    },
    {
      "key": "Ideal for",
      "value": [
        "Camping and hiking",
        "Travel",
        "Everyday use"
      ]
    },
    {
      "key": "Light modes",
      "value": "8 modes"
    },
    {
      "key": "Beam distance - boost",
      "value": "135m"
    },
    {
      "key": "Beam distance - low",
      "value": "15m"
    },
    {
      "key": "Beam distance - high",
      "value": "100m"
    },
    {
      "key": "Boost mode",
      "value": "Yes"
    },
    {
      "key": "Light source",
      "value": [
        "2 LEDs",
        "4 red LEDs"
      ]
    },
    {
      "key": "Burn time - low",
      "value": "150 h"
    },
    {
      "key": "Burn time - med",
      "value": "8.5 h"
    },
    {
      "key": "Burn time - high",
      "value": "7 h"
    },
    {
      "key": "Max light output",
      "value": "800 lumens"
    },
    {
      "key": "Beam pattern",
      "value": [
        "Spot",
        "Wide"
      ]
    },
    {
      "key": "IPX rating",
      "value": "IP X4"
    },
    {
      "key": "Rechargeability",
      "value": "Rechargeable"
    },
    {
      "key": "Flash mode",
      "value": "Yes"
    },
    {
      "key": "Red light mode",
      "value": "Yes"
    },
    {
      "key": "Regulated output",
      "value": "Yes"
    },
    {
      "key": "Batteries",
      "value": "Lithium-ion 3000mAh (included)"
    },
    {
      "key": "Product sustainability",
      "value": [
        "Rechargeable batteries"
      ]
    },
    {
      "key": "Made in",
      "value": "China"
    }
  ],
  "url": "https://www.mec.ca/en/product/6025-563/headlamp-800-pro"
}