{
  "description": "<p>Whether working on the adventure van, taking your 4-legged friend out for a walk, or navigating your campsite, this lightweight headlamp will come in handy. Perhaps best known for the stove that can charge your phone, BioLite also makes some very cool lights, like the fully dimmable Headlamp 325. Built with the same sleek, low-profile design as it predecessors, the 325 headlamp weighs next to nothing and won’t take up much room in your pack or pocket. Equipped with a moisture wicking ergonomic head strap the streamlined light head is less likely to bounce about when on the move. Micro-USB charging does away with annoying “still good” batteries, making it easy to keep your headlamp topped-up and ready to go. And, the intuitive 1-button control makes it easy to cycles through the modes.</p><ul><li>Dimmable in both red and white lighting modes let you find that perfect brightness</li><li>Red flood light is great for stealthy late-night bathroom runs, or just reading when everyone else goes to sleep</li><li>12-hour brightness memory brings the headlamp back on in the last mode used, after 12-hours the light with start in red</li><li>Tilt-able light housing lets you aim the light right where you need it</li><li>1-button controls are easy to use, with or without gloves</li><li>Lock-out mode prevents accidental activation, letting you toss your light in you pack with confidence</li><li>Low-profile streamlined design doesn’t bounce around like so many other headlamps</li><li>Moisture wicking head strap has a reflective strip to help keep you seen</li><li>IPX4 water proofing means the light keeps shining even when Mother Nature has other ideas</li><li>Operational temperature range: 45º C to -10º C (low-temperature shut-off protects the battery)</li><li>Micro-USB charging makes it easy to top up your headlamp, going from 0-100% in about 3 hours</li><li>In the box: headlamp, micro-USB charging cord and documentation</li></ul>",
  "img_hrefs": [
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/51156/images/227197/6025560_MGY03__90775.1698784475.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/51156/images/227211/6025560_OCT06__88763.1698784476.1280.1280.jpg?c=1"
  ],
  "name": "BioLite Headlamp 325",
  "price_cents": 5995,
  "specs": [
    {
      "key": "Weight (Midnight Grey)",
      "value": "50g"
    },
    {
      "key": "Weight (Ocean Teal)",
      "value": "50g"
    },
    {
      "key": "Weight (Ember Yellow)",
      "value": "50g"
    },
    {
      "key": "Ideal for",
      "value": [
        "Camping and hiking",
        "Travel",
        "Everyday use"
      ]
    },
    {
      "key": "Light modes",
      "value": "4 modes"
    },
    {
      "key": "Beam distance - low",
      "value": "10m"
    },
    {
      "key": "Beam distance - high",
      "value": "70m"
    },
    {
      "key": "Boost mode",
      "value": "No"
    },
    {
      "key": "Light source",
      "value": [
        "2 LEDs"
      ]
    },
    {
      "key": "Burn time - low",
      "value": "40 h"
    },
    {
      "key": "Burn time - high",
      "value": "3 h"
    },
    {
      "key": "Max light output",
      "value": "325 lumens"
    },
    {
      "key": "Beam pattern",
      "value": [
        "Spot"
      ]
    },
    {
      "key": "IPX rating",
      "value": "IP X4"
    },
    {
      "key": "Rechargeability",
      "value": "Rechargeable"
    },
    {
      "key": "Flash mode",
      "value": "Yes"
    },
    {
      "key": "Red light mode",
      "value": "Yes"
    },
    {
      "key": "Regulated output",
      "value": "No"
    },
    {
      "key": "Batteries",
      "value": "Lithium-ion 700mAh (included)"
    },
    {
      "key": "Product sustainability",
      "value": [
        "Rechargeable batteries"
      ]
    },
    {
      "key": "Made in",
      "value": "China"
    }
  ],
  "url": "https://www.mec.ca/en/product/6025-560/headlamp-325"
}