{
  "description": "<p>Take your remote office, really remote. With more than enough power to keep both office essentials, and good times essentials powered, the BaseCharge 600 lets you take the best of the grid with you. With years of creating clever off-grid power solutions and powerbanks, BioLite has created a line of all-in-one power station that lets you plug-in your favourite at home electronics, wherever you roam. The onboard digital display provides you with all the information you need: input/output Watts, battery capacity, runtimes, charge times, and more. Wireless charging and plenty of female charging ports, including 12V (car cigarette lighter), 2 x USB type C (one is even set-up for USB-PD), 2 x USB type A, and 2 x AC that accepts grounded and ungrounded plugs, mean that if you can recharge it, you can probably recharge it with the BaseCharge.</p><ul><li>LCD power status display tells you how much power you're getting and using, as well as battery charge capacity and time remaining under current load. Resettable energy odometer lets you track your power usage, making it easy to manage remaining power</li><li>Wireless charging via the top mounted charging panel (1 device at a time, 10W max)</li><li>Charges easily via included wall charger, going from 0 to full in 7 hours, USB-C PD in 5 hours, combine a wall charger and USB-C PD to charge in 3.5 hours, or 6 hours from a compatible solar panel (6 hours is the power from 1 SolarPanel 100 in ideal conditions)</li><li>MPPT (Maximum Power Point Tracker) technology enables a 30% more efficient charging via solar panels in low-light conditions</li><li>12 checkpoint safety system constantly monitors all incoming and outgoing power, battery’s status, and provides over-charge and under-charge protection</li><li>Li-NMC (lithium nickel manganese cobalt oxide) battery offers a longer life than standard lithium-ion batteries and better inherent safety</li><li>Battery can be kept plugged into a power source during storage, or fully-charge your BaseCharge every 3-6 months and store in a cool, dry place</li><li>Peak capacity is 622Wh (21.6V, 28.8Ah) and lasts through hundreds of cycles</li><li>4 USB ports (output): 2 x type-A at 5V, up to 3A, 1 x USB-C 5V up to 3A, USB-C PD 5-20V up to 5A (100W max), All ports are regulated</li><li>12V car port (regulated output): 12V (120W max)</li><li>12V barrel port (output): 12V (120W max) 5.5mm OD and 2.1mm ID</li><li>AC inverter: 2 x 110V (600W, 1000W surge)</li><li>Provides pass-through power, so you can plug your BaseCharge into the wall and then your device into your BaseCharge, making sure your device stays powered should the power go out</li><li>Charging ports: wall/solar input, 120W (12-30V DC), up to 10A max, and USB-C PD 100W</li><li>Not waterproof and should not be used in the rain</li><li>Operating temp is 0-40°C</li><li>In the box: BaseCharge, wall charger, documentation</li></ul>",
  "img_hrefs": [
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/50349/images/219652/6019038_NOC02__04040.1664874477.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/50349/images/219645/6019038_NOC02_ALT-E__93399.1664874476.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/50349/images/219638/6019038_NOC02_ALT-D__68196.1664874476.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/50349/images/219632/6019038_NOC02_ALT-C__19600.1664874475.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/50349/images/219624/6019038_NOC02_ALT-B__91704.1664874475.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/50349/images/219618/6019038_NOC02_ALT-A__73049.1664874474.1280.1280.jpg?c=1"
  ],
  "name": "BioLite BaseCharge 600",
  "price_cents": 89995,
  "specs": [
    {
      "key": "Weight",
      "value": "5.9kg (No colour SKU)"
    },
    {
      "key": "Ideal for",
      "value": [
        "Travel",
        "Emergency preparedness",
        "Frontcountry camping"
      ]
    },
    {
      "key": "Chemistry",
      "value": "Lithium nickel manganese cobalt oxide "
    },
    {
      "key": "Output voltage",
      "value": "110volts"
    },
    {
      "key": "Capacity",
      "value": "28.8Ah"
    },
    {
      "key": "Dimensions",
      "value": "30.9 x 20.1 x 20cm (No colour SKU)"
    },
    {
      "key": "Rechargeable",
      "value": "Yes"
    },
    {
      "key": "Made in",
      "value": "China"
    }
  ],
  "url": "https://www.mec.ca/en/product/6019-038/basecharge-600"
}