{
  "description": "<p>Stay connected with the whole family, from across the campground, playing field, or cruise ship. With more than 25km of range, the RX100 makes it easy to let everyone know when lunch is ready. There are 22 channels and more than 100 different privacy codes, so you can have dedicated channels for kids, parents, or any group you want. The compact design fits in a pocket or pack strap easily. High visibility colours are easy to see in low light, and do away with games of “who’s radio is this?”</p><ul><li>26km range (in ideal conditions) gives you plenty of range</li><li>Roger beep tone lets other know when it is clear to talk, reducing the chances of talking over each other</li><li>22 channels let you designate channels to specific groups or find your own in crowded areas</li><li>10 channel weather radios for current conditions and to stay informed of potential storms</li><li>Power saver mode puts the radio into standby when not in use, but keeps it ready to receive or transmit</li><li>LED flashlight feature helps when hikes take longer than expected</li><li>3 AAA batteries required. AAA are the second most commonly used and easiest to find batteries in the world</li><li>Includes: 4 RX100 2-way FRS radios, 4 colour matched pocket clips, and a manual</li></ul>",
  "img_hrefs": [
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/50059/images/217443/6023508_GOR16__77268.1662544437.1280.1280.jpg?c=1"
  ],
  "name": "Cobra RX100-4 Family Walkie Talkie 4-Pack",
  "price_cents": 9995,
  "specs": [
    {
      "key": "Ideal for",
      "value": [
        "Frontcountry camping",
        "Travel",
        "Day hiking"
      ]
    },
    {
      "key": "Dimensions",
      "value": "3.75 x 7 x 20cm"
    },
    {
      "key": "USB output",
      "value": "No"
    },
    {
      "key": "Weather band",
      "value": "Yes"
    },
    {
      "key": "AUX input",
      "value": "No"
    },
    {
      "key": "AC input",
      "value": "No"
    },
    {
      "key": "Batteries",
      "value": "3 AAA (included)"
    },
    {
      "key": "AM/FM",
      "value": "No"
    },
    {
      "key": "Battery charge indicator",
      "value": "Yes"
    },
    {
      "key": "Solar power charger",
      "value": "No"
    },
    {
      "key": "Headphone jack",
      "value": "No"
    },
    {
      "key": "Hand crank",
      "value": "No"
    },
    {
      "key": "Light",
      "value": "Yes"
    },
    {
      "key": "Made in",
      "value": "China"
    }
  ],
  "url": "https://www.mec.ca/en/product/6023-508/rx100-4-family-walkie-talkie-4-pack"
}