{
  "description": "<p>Redeemable for products or services available at MEC.</p>\n<ul>\n<li>E-gift cards are emailed to the recipient(s) specified, usually within about an hour (unless it&rsquo;s the middle of the night, when we&rsquo;re off dreaming of mountain adventures). If you select a future delivery date, expect the card to arrive on the day you specify. Your credit card will be charged on the purchase date.</li>\n<li>You can select up to 5 recipients per order. Each recipient will receive one e-gift card of the specified amount. To send different amounts to different people, add them to your cart one at a time.</li>\n<li>Recipient&rsquo;s email address will not be added to any mailing lists.</li>\n<li>Please enter email address carefully. To confirm that your gift has arrived, contact recipients directly.</li>\n<li>If you are worried that delivery may be prevented by the recipient&rsquo;s spam filters, you could send them a hint about expecting a nice email from MEC.</li>\n<li>To redeem online, select gift card as a payment type during checkout, and enter both the gift card number and PIN.</li>\n<li>Our Service Centre staff will contact you if your gift cannot be delivered.</li>\n<li>Terms and conditions: Full terms at mec.ca/gift-cards. MEC gift cards are redeemable for products or services purchased online at mec.ca, by phone, or at MEC stores. Gift cards cannot be redeemed or exchanged for cash, unless required by law. MEC is not responsible for lost, stolen, or damaged cards. Protect your card number like cash. Gift cards have no associated fees or expiration dates. Gift cards are issued by MEC Mountain Equipment Company Ltd.</li>\n</ul>",
  "img_hrefs": [
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/45198/images/197001/GiftCards-MountainLake__78384.1663106737.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/45198/images/197005/GiftCards-ForestIsland__09251.1663106737.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/45198/images/197002/GiftCards-Montie__98092.1663106737.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/45198/images/197003/GiftCards-Forest__86402.1663106737.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/45198/images/197004/GiftCards-ForestFriends__61445.1663106737.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/45198/images/197006/GiftCards-Bear__07275.1663106737.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/45198/images/197007/GiftCards-Waves__11294.1663106737.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/45198/images/197010/GiftCards-Holiday__31807.1663106737.1280.1280.jpg?c=1"
  ],
  "name": "E-Gift Card",
  "price_cents": 2500,
  "specs": [
    {
      "key": "Made in",
      "value": "Canada"
    }
  ],
  "url": "https://www.mec.ca/en/product/5027-227/E-Gift-Card"
}