{
  "description": "<p>The ergonomic and rugged Keb 52 backpack is designed for year-round use, featuring Fjällräven’s  award-winning wooden frame and sustainable, long-lasting materials ideal for any terrain your adventures take you on. Its slim profile ensures freedom of movement, and well-organized compartments make gear management a breeze – including a front pocket that accommodates extra gear or layers. The carrying system efficiently distributes heavy loads and can be easily adjusted for varying back lengths, ensuring a comfortable and tailored fit.</p><ul><li>Durable G-1000 HeavyDuty S fabric in recycled polyester and organic cotton</li><li>Waterproof Bergshell fabric for the base and sides, crafted from recycled nylon</li><li>Fjällräven’s innovative wooden frame reduces CO2 emissions by 90% over the standard aluminum frame</li><li>Comfortable and robust carrying system with an adjustable harness and sternum strap for a customized fit</li><li>Main compartment has two side access zippers, zippered bottom access and a zippered inside pocket</li><li>Detachable top lid with a zippered pocket</li><li>Supportive hipbelt offers a comfortable carry while pockets stash snacks and other small essentials</li><li>Dual side water bottles pockets</li><li>Attachment points for skis, ice axes, and poles, along with loops for toboggans</li><li>Hydration system compatible with hose port and routing strap (reservoir sold separately)</li></ul>",
  "img_hrefs": [
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/53625/images/249717/6024328_ODF16__17672.1698310397.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/53625/images/249705/6024328_ODF16_ALT-A__00391.1698310396.1280.1280.jpg?c=1"
  ],
  "name": "Fjallraven Keb 52 Backpack - Unisex",
  "price_cents": 37495,
  "specs": [
    {
      "key": "Ideal for",
      "value": [
        "Backpacking"
      ]
    },
    {
      "key": "Made in",
      "value": "Viet Nam"
    }
  ],
  "url": "https://www.mec.ca/en/product/6024-328/keb-52-backpack"
}