{
  "description": "<p>Alpine heel piece plus tech toe piece with lateral release – that's what the Tecton is all about. With side release at the toe, it can add a very stable heel piece that doesn't rotate and lose efficiency or power. It uses the same toe piece as the Fritschi Vipec EVO (easy, intuitive clip in, and smooth release when falling forward) but pairs it with a heel piece designed for boots with Tech fittings. Power Rails locks your boot in place by filling the space associated with heel tech fittings. Transitions from touring to skiing and back are fast and can be done without stepping out of your bindings.</p><ul><li>Awarded TUV DIN certification and adjustable to DIN value 5-13</li><li>Micro-adjustable toe-piece wings allow for compatibility with any model of tech inserts</li><li>Lateral safety release at toe has 13mm of elasticity to prevent pre-release</li><li>Adjustable vertical heel release with 9mm of elasticity</li><li>Alpine style heel tracks allow the ski to flex naturally and eliminate pre-release</li><li>Toe piece is designed to release after the heel in the event forward fall</li><li>Step-in guides and trigger ensure easy step in and step out</li><li>New lever-locking heel system for added safety and security</li><li>Power rails engages with tech inserts in the heel for more lateral stability</li><li>Mounting screw pattern in the torsion-resistant toe piece and torsion-resistant plate mounted to the ski under the heel piece provide stability and transmission of power from boot to ski</li><li>Ski-pole activation lets you easily switch from ski to walk mode without stepping out of the bindings</li><li>2 heel risers for uphill touring comfort and ease</li><li>Available in 3 brake sizes. There is some variation in the way brakes are measured. European manufacturers' brake measurement (e.g., Fritschi) generally skis 5-8mm larger. North American manufacturers' measurements (eg. Black Diamond) are closer to the actual ski width</li><li>Brakes can also be removed or purchased separately</li></ul>",
  "img_hrefs": [
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/52938/images/245366/6025807_NOC02__73244.1695323198.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/52938/images/245071/6025807_NOC02_ALT-C__00492.1694856709.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/52938/images/245060/6025807_NOC02_ALT-B__57096.1694856708.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/52938/images/245044/6025807_NOC02_ALT-A__61908.1694856708.1280.1280.jpg?c=1"
  ],
  "name": "Fritschi Tecton 13 Bindings - Unisex",
  "price_cents": 84995,
  "specs": [
    {
      "key": "Weight",
      "value": "1.1kg (110mm)"
    },
    {
      "key": "Ideal for",
      "value": [
        "Freeride and freeskiing",
        "Alpine touring"
      ]
    },
    {
      "key": "Boot/binding compatibility",
      "value": [
        "Tech"
      ]
    },
    {
      "key": "Maximum compatible brake",
      "value": "120mm"
    },
    {
      "key": "Release setting",
      "value": "5-13"
    },
    {
      "key": "Crampon compatible",
      "value": "Yes"
    },
    {
      "key": "Brake compatible",
      "value": "Yes"
    },
    {
      "key": "Mode change without exit",
      "value": "Yes"
    },
    {
      "key": "Made in",
      "value": "China"
    }
  ],
  "url": "https://www.mec.ca/en/product/6025-807/tecton-13-bindings"
}