{
  "description": "<p>Dynamic design gives these intuitive freeride bindings some extra oomph. Charge the descent with power thanks to a forward pressure and wide mount. No need to ski with your toes locked out, sleek toe jaw dynamics squeeze your boot with high force and absorb significant energy. Step-in and brake features deliver real rip-and-ride performance in a seriously light package. Freeride performance provides more power and a consistent release. Only a single tool is needed for mounts and adjustments, and a tried and true, fully retractable brake works for even bigger freeride skis.</p><ul><li>High and wide fulcrum position for toe arms squeeze your boot tight and absorb more energy so you can power up easily</li><li>Forward pressure absorbs energy and vibrations at high speeds and on landings</li><li>Wide freeride mount transfers power to edges and enhances the rigidity of the binding for superior pull-out resistance</li><li>Snow clearing channel prevents snow buildup and avoids unwanted pre-releases</li><li>QuickFlick heel lifts are easy to grab with pole or hand for quick exits and uphill travel</li><li>Heel rotation turns in either direction to lock for touring with either hand; no “wrong way” to spin it</li><li>A single tool (Pozi Drive #3) is needed for all mounts and adjustments– no need for a heel spacer</li><li>Fully retractable and spring-loaded brake stops even big freeride skis</li><li>Heel anti-friction device ensures consistent release</li><li>22mm length adjustability</li></ul>",
  "img_hrefs": [
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/50544/images/221091/6022601_NOC02__27643.1666429821.1280.1280.jpg?c=1"
  ],
  "name": "G3 Ion 12 Bindings With Brakes - Unisex",
  "price_cents": 72995,
  "specs": [
    {
      "key": "Weight",
      "value": "1.17kg (100mm)"
    },
    {
      "key": "Ideal for",
      "value": [
        "Alpine touring",
        "Freeride and freeskiing"
      ]
    },
    {
      "key": "Boot/binding compatibility",
      "value": [
        "Tech"
      ]
    },
    {
      "key": "Maximum compatible brake",
      "value": "130mm"
    },
    {
      "key": "Release setting",
      "value": "5-12"
    },
    {
      "key": "Crampon compatible",
      "value": "Yes"
    },
    {
      "key": "Brake compatible",
      "value": "Yes"
    },
    {
      "key": "Mode change without exit",
      "value": "Tour to ski only"
    },
    {
      "key": "Made in",
      "value": "Taiwan"
    }
  ],
  "url": "https://www.mec.ca/en/product/6022-601/ion-12-bindings-with-brakes"
}