{
  "description": "<p>Never underestimate the power of an “I made it” text. The inReach Messenger refines the core features of the inReach line, into an easy to use off-grid communicator. Taking the inReach’s already impressive battery to new heights, the Messenger’s battery lets you go nearly a month between charges. By tapping into the power of Iridium’s® satellite constellation, you can send and receive text messages anywhere on the planet, staying connected even where there’s no phone coverage. Should things take a turn for the worse, a dedicated SOS button lets you call for help, no matter where you are. If you get turned around, TracBack® has you covered, displaying a path that will take you right back to where you started. The internal GPS can also imbed your location in each message, so your followers don’t have to guess where you made camp. When paired with the free Garmin Messenger® app you can use your phone to send and receive messages. Great for setting up a group chat to keep family and friends up to date on your adventures.</p><ul><li>Stores customized and pre-set quick-response text messages for anticipated situations</li><li>Preset messages do not count against your plan’s text message allotment</li><li>Uses Iridium’s constellation of 66 satellites for coverage of the Earth's entire surface. Messages are buffered for up to a day</li><li>Iridium’s worldwide coverage lets you send texts and emails from anywhere in the world. Your plan determines how many you can send and how detailed they are. Note – some jurisdictions regulate or prohibit the use of satellite communication devices</li><li>Rechargeable internal battery pack delivers up to 28 days of battery life with 10-minute tracking, or 48 days with 30-minute tracking (battery life varies depending on settings and overhead interference, e.g., tree canopy, ravines, etc.)</li><li>TracBack mode navigates you safely back to where you started</li><li>Reverse charging allows you to charge your phone for 20 minutes from the inReach's USB-C port, enough time to check your map or send a longer, custom message. Note - reverse charging only works when your inReach has more than 25% battery</li><li>Bluetooth Smart and ANT+ compatibility lets you explore smarter with compatible wearables, activity sensors, and accessories</li><li>Connects via Bluetooth to phones/tablets running the free inReach Messenger app. When paired with the Messenger app you gain access to your phone’s keyboard, contacts and group text capabilities. Texts sent via the Messenger app over cellular or Wi-Fi, can only be received by other Garmin Messenger users</li><li>Smart network switching technology sends and receives your messages via the most reliable available network, helping ensure your messages get though, and you only use your satellite subscription when you need it</li><li>Garmin Explore™ website helps plan your trip and sync important details to your device</li><li>GPS tracking feature allows your friends and community to follow your progress via a personalized MapShare® page</li><li>World coverage SOS feature gives you a confirmation message from the International Emergency Response Coordination Center (IERCC) if you use it to send an SOS. 2-way texting allows you to stay in contact with rescue personnel</li><li>SOS messages are received by IERCC, a worldwide emergency response coordination center with 24/7/365 staffing</li><li>SOS button has a hard plastic cover, greatly reducing chances of an accidental activation</li><li>Messages have your GPS location embedded for faster finding in emergencies</li><li>GPS, GLONASS, BeiDou and QZSS satellite constellation support for strong signal anywhere</li><li>Optional weather forecasting service sends detailed weather data for your location, a specific waypoint or a GPS coordinate directly to your inReach, paired smartphone or tablet</li><li>SOS/PLB functionality and all off-grid communication requires a separate satellite plan to activate, GPS functionality works all the time, no plan required</li><li>Monthly plans are available, as well as seasonal hibernation options that allow you to pay a minimal fee during months when you are not using the device</li><li>Rugged housing is IPX7 water-resistant, dustproof and has a high-contrast display</li><li>Intuitive 3 button interface</li><li>In the box: inReach Messenger, USB-C charging and data cable, and documentation</li></ul>",
  "img_hrefs": [
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/50258/images/219164/6024762_BK000__45923.1664287474.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/50258/images/219159/6024762_BK000_ALT-I__40968.1664287474.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/50258/images/219154/6024762_BK000_ALT-H__36615.1664287474.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/50258/images/219149/6024762_BK000_ALT-G__03675.1664287474.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/50258/images/219144/6024762_BK000_ALT-F__07342.1664287474.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/50258/images/219139/6024762_BK000_ALT-E__43562.1664269691.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/50258/images/219133/6024762_BK000_ALT-D__90688.1664287474.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/50258/images/219124/6024762_BK000_ALT-C__04461.1664287474.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/50258/images/219121/6024762_BK000_ALT-B__66877.1664269689.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/50258/images/219115/6024762_BK000_ALT-A__84801.1664287474.1280.1280.jpg?c=1"
  ],
  "name": "Garmin inReach Messenger",
  "price_cents": 39999,
  "specs": [
    {
      "key": "Weight",
      "value": "114g (Black)"
    },
    {
      "key": "Ideal for",
      "value": [
        "Emergency preparedness",
        "Camping and hiking",
        "Mountain biking"
      ]
    },
    {
      "key": "Satellite network used",
      "value": "Iridium"
    },
    {
      "key": "Battery life (operating)",
      "value": "72-1104 h"
    },
    {
      "key": "IPX rating",
      "value": "IP X7"
    },
    {
      "key": "Storage temperature",
      "value": "-20 to 60°C"
    },
    {
      "key": "Dimensions",
      "value": "7.8 x 6.4 x 2.3cm"
    },
    {
      "key": "Replaceable batteries",
      "value": "No"
    },
    {
      "key": "Rechargeability",
      "value": "Rechargeable"
    },
    {
      "key": "GPS data sent in SOS",
      "value": "Yes"
    },
    {
      "key": "Batteries",
      "value": "Rechargeable battery pack (non-removable)"
    },
    {
      "key": "Barometric altimeter",
      "value": "No"
    },
    {
      "key": "Basemap",
      "value": "No"
    },
    {
      "key": "Electronic compass",
      "value": "No"
    },
    {
      "key": "Floats",
      "value": "No"
    },
    {
      "key": "Check-in feature",
      "value": "Yes"
    },
    {
      "key": "Lanyard attachment",
      "value": "Yes"
    },
    {
      "key": "Delivery confirmation",
      "value": "Yes"
    },
    {
      "key": "Product sustainability",
      "value": [
        "Rechargeable batteries"
      ]
    },
    {
      "key": "Made in",
      "value": "Taiwan"
    }
  ],
  "url": "https://www.mec.ca/en/product/6024-762/inreach-messenger"
}