{
  "description": "<p>Combining the powerful Edge 1040 with 3 of Garmin’s most popular sensors, this bundle helps you make the most out of your time in the saddle. Sensors track speed, heart rate and cadence on the go, or at home on your trainer. An improved GPS chipset takes care of all of your speed and distance data. Free detailed maps make planning routes for your next ride, or your next tour, nice and simple. And an updated user interface and faster processor have made swiping through the 1040 more intuitive than ever. Longtime Garmin users will appreciate little touches, like a machined aluminum quarter-turn mount, and the change to USB-C. When connected to the free Garmin Connect™ app you can use your favourite fitness apps, receive notifications, download training plans and personalize daily workouts, review activities, and even keep an eye on the weather.</p><ul><li>Free global maps, with North America preloaded and more regions downloadable, for turn-by-turn routing to local points of interest, including cycling specific features like bike shops</li><li>Point of interest navigation lets you search for places like restaurants, attractions, hospitals, accommodation and more</li><li>Up ahead feature offers at a glance a summary of upcoming ride features, like cafes, viewpoints, etc. and provides an ETA</li><li>Popularity routing uses Garmin Connect’s database of rider’s routes and tracks to let you ride local, anywhere you go</li><li>Cycling ability and course demands uses data from previous rides on the 1040 to classify your ability level, when you load a course the course demands will compare that level to the course’s terrain, giving you an idea of how hard or how easy you'll find the ride</li><li>ClimbPro™ mode shows grade, total ascent, remaining ascent and elevation profile</li><li>Mountain biking dynamics include specific metrics, jumps: hangtime, distance and speed, grit: overall trail difficulty, and flow: a score of how smoothly you rode the trail</li><li>TrailForks™ integration for access to TrailForks trail database without a cell connection</li><li>ForkSight mode uses TraliForks data when you get to a fork, telling about your choices, e.g., trail rating, distance, elevation, etc</li><li>Strava Segment integration (requires premium) preloaded or on-the-fly through your phone, shows starred segments and results</li><li>LiveTrack share your course with contacts</li><li>GroupTrack displays the location and telemetry of contacts using compatible Garmin devices, you can even send pre-set messages within your group</li><li>Training plan takes you through the details of your ride: weather – including the recommended clothing for the conditions, food and water requirements based on your fitness levels – even providing reminders of when you should drink and eat, and much more</li><li>Environmental factors like heat and altitude acclimation are taken into consideration when calculating performance and recovery metrics</li><li>Training status and daily suggested workouts help you optimize your training, guiding you where you need to push and where you may need to dial it back</li><li>Physiological metrics includes VO2 max estimate, lactate threshold, race predictor, recovery advisor and performance indicator (requires included heartrate chest strap)</li><li>Incident detection uses accelerometers to detect accident and uses you phone to send a signal to predefined emergency contacts</li><li>inReach® compatibility provides messaging and SOS support when you ride takes you away from cell signal</li><li>Multiband signal reception and expanded GNSS support (GPS, GLONASS, and Galileo) and caches satellite positions, giving you a fast connection and a strong GPS signal anywhere</li><li>Shimano Steps e-bike integration displays, range, battery status, gearing, and more</li><li>Trainer support provides ride data during your indoor training sessions when using a compatible smart trainer</li><li>Connect IQ support allows you to download apps, templates, data fields, and other features</li><li>Soft (ANT+ & Bluetooth) heart rate chest strap is comfortable and accurate</li><li>Speed and Cadence sensors use Bluetooth™ and ANT+™ transmission technology</li><li>Speed sensor tracks rides, even when you aren’t using your phone or Edge computer. Sensor starts when you start rolling or stop, synching that ride to your phone (running Garmin Connect) or computer when in range</li><li>Sensors attach with no magnets or exposed parts, making them easy to install, maintain and move between bikes</li><li>Speed Sensor attaches to a standard hub on either wheel and self-calibrates for accurate speed and distance while stationary (on a trainer) or on the move</li><li>Cadence Sensor fastens to any crank arm size and measures pedal strokes per minute</li><li>Barometric altimeter helps you track your ascents, descents, and total elevation changes</li><li>In the box: Edge 1040, HRM Dual heart rate sensor, cadence sensor, speed sensor, mounts (standard and extended out-front), USB cable, tether and manuals</li></ul>",
  "img_hrefs": [
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/49136/images/210717/6023429_NOC02__47586.1654938531.1280.1280.jpg?c=1"
  ],
  "name": "Garmin Edge 1040 Bundle",
  "price_cents": 93999,
  "specs": [
    {
      "key": "Weight",
      "value": "201g (No colour SKU)"
    },
    {
      "key": "Ideal for",
      "value": [
        "Cycle touring",
        "Trail riding",
        "Gravel riding"
      ]
    },
    {
      "key": "Built-in memory",
      "value": "32GB"
    },
    {
      "key": "IPX rating",
      "value": "IP X7"
    },
    {
      "key": "Dimensions",
      "value": "11.8 x 5.9 x 2cm"
    },
    {
      "key": "Countdown timer",
      "value": "No"
    },
    {
      "key": "Stopwatch",
      "value": "Yes"
    },
    {
      "key": "Calorie consumption",
      "value": "No"
    },
    {
      "key": "Calories in real time",
      "value": "No"
    },
    {
      "key": "Speed/cadence sensor",
      "value": "Included"
    },
    {
      "key": "Coded signal",
      "value": "Yes"
    },
    {
      "key": "Data card",
      "value": "Not accepted"
    },
    {
      "key": "Workout history",
      "value": "Yes"
    },
    {
      "key": "Touch screen",
      "value": "Yes"
    },
    {
      "key": "Heart rate in real time",
      "value": "No"
    },
    {
      "key": "Interval training",
      "value": "Yes"
    },
    {
      "key": "Batteries",
      "value": "Rechargeable battery pack (non-removable)"
    },
    {
      "key": "Auto pause",
      "value": "Yes"
    },
    {
      "key": "Power meter",
      "value": "Sold separately"
    },
    {
      "key": "Distance/time alarm",
      "value": "Yes"
    },
    {
      "key": "Pause timer",
      "value": "Yes"
    },
    {
      "key": "Battery life",
      "value": "35-90 h"
    },
    {
      "key": "Barometric altimeter",
      "value": "Yes"
    },
    {
      "key": "Basemap",
      "value": "Yes"
    },
    {
      "key": "Wireless sync",
      "value": "Yes"
    },
    {
      "key": "Routes",
      "value": "200"
    },
    {
      "key": "ANT+ compatible",
      "value": "Yes"
    },
    {
      "key": "Virtual partner",
      "value": "Yes"
    },
    {
      "key": "Metric/imperial units format",
      "value": "Yes"
    },
    {
      "key": "App compatibility",
      "value": [
        "Garmin Connect",
        "Third party apps"
      ]
    },
    {
      "key": "Waypoints",
      "value": "200"
    },
    {
      "key": "Foot pod",
      "value": "Not compatible"
    },
    {
      "key": "Custom POI",
      "value": "Yes"
    },
    {
      "key": "Interface",
      "value": [
        "USB",
        "Wireless"
      ]
    },
    {
      "key": "Button lock",
      "value": "Yes"
    },
    {
      "key": "Chest strap",
      "value": "Sold separately"
    },
    {
      "key": "Programmable workouts",
      "value": "Advanced"
    },
    {
      "key": "New lap auto start",
      "value": "Yes"
    },
    {
      "key": "Electronic compass",
      "value": "No"
    },
    {
      "key": "Area calculation",
      "value": "No"
    },
    {
      "key": "Add maps capability",
      "value": "Yes"
    },
    {
      "key": "Pace alarm",
      "value": "Yes"
    },
    {
      "key": "WiFi",
      "value": "Yes"
    },
    {
      "key": "Bluetooth",
      "value": "Yes"
    },
    {
      "key": "Battery power indicator",
      "value": "Yes"
    },
    {
      "key": "Heart rate monitor",
      "value": "No"
    },
    {
      "key": "Low battery warning",
      "value": "Yes"
    },
    {
      "key": "Unit to unit transfer",
      "value": "No"
    },
    {
      "key": "Haptic feedback",
      "value": "No"
    },
    {
      "key": "Heart rate target zones",
      "value": "No"
    },
    {
      "key": "Product sustainability",
      "value": [
        "Rechargeable batteries"
      ]
    },
    {
      "key": "Made in",
      "value": "Taiwan"
    }
  ],
  "url": "https://www.mec.ca/en/product/6023-429/edge-1040-bundle"
}