{
  "description": "<p>After thousands of hours of testing, Garmin’s newest family of power meters is burlier and more reliable than ever. Building on the technology of the Vector 3, the Rally makes it easy to add watts to your training data. With an industry-leading 1% accuracy and measurements taken at the pedals, you can confidently say that you earned every watt it picks up. The low-profile design houses a lot of technology within the surprisingly normal-looking pedal – no external pods or new cranks needed. Bluetooth and ANT+ communication means the rally works with your smart trainer, sending data right to your favourite training app. Travelling with these pedals is now easier than ever, as you'll need nothing but a standard pedal wrench to get these on your bike – no need for a torque wrench or an annoying trip to an unfamiliar bike shop. If you’re looking to optimize your riding efficiency, the Rally is the right tool for the job.</p><ul><li>SPD-SL® ecosystem lets you use your favourite road shoes with these power meters</li><li>Pedal sensors have an industry-leading +/-1% accuracy</li><li>Built-in accelerometers track your cadence and wake the power meter up as soon as you start riding, no need to turn them on or off</li><li>All data is transmitted wirelessly via ANT+ and Bluetooth Smart</li><li>For use with compatible Edge® cycling computers, Fenix® watches, Forerunner® watches, and other ANT+ enabled head units</li><li>Compatible with most smart trainers and many apps like Zwift®, Strava® and Trainer Road®</li><li>Real-time pedaling cycling dynamics are available when paired to a compatible Garmin Edge computer</li><li>Detailed power metrics and graphs available through Garmin Connect software</li><li>O-ring sealed, updated battery caps thread into metal spindles, offering serious weather protection</li><li>Bulled about wake sleep updates for more reliable info in all conditions</li><li>Lightweight composite bodies with stainless steel wear-plate blends durability and lightweight</li><li>Pedal installation is quick and requires nothing but a pedal wrench</li><li>User-replaceable batteries (4xLR44/SR44 or 2x CR1/3N) provides 120 hours of use</li><li>Firmware can be updated wirelessly via a Garmin Edge, or a phone</li><li>Power meter technology is all contained in the spindle, letting you swap cleat ecosystems with a simple upgrade kit (sold separately), letting you add power metrics to 2 or more bikes without having to buy 2 or more power meters</li><li>In the box: Rally RS100 pedals (1 with power meter and 1 without), cleats, 55mm Q-factor washers and documentation</li></ul>",
  "img_hrefs": [
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/45918/images/187175/6017568_NOC02__41571.1652864980.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/45918/images/186889/6017568_NOC02_ALT-E__41729.1649187762.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/45918/images/186885/6017568_NOC02_ALT-D__04545.1649187761.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/45918/images/186881/6017568_NOC02_ALT-C__15547.1649187759.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/45918/images/186875/6017568_NOC02_ALT-B__92648.1649187758.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/45918/images/186869/6017568_NOC02_ALT-A__72714.1649187756.1280.1280.jpg?c=1"
  ],
  "name": "Garmin Rally RS100 Power Meter Pedal",
  "price_cents": 87999,
  "specs": [
    {
      "key": "Weight",
      "value": "328g (No colour SKU)"
    },
    {
      "key": "Ideal for",
      "value": [
        "Road cycling",
        "Cycle training"
      ]
    },
    {
      "key": "Type",
      "value": [
        "3-hole clipless"
      ]
    },
    {
      "key": "Body",
      "value": [
        "Composite",
        "Steel"
      ]
    },
    {
      "key": "Degrees of float",
      "value": "Cleat dependent"
    },
    {
      "key": "Made in",
      "value": "Taiwan"
    }
  ],
  "url": "https://www.mec.ca/en/product/6017-568/rally-rs100-power-meter-pedal"
}