{
  "description": "<p>Packed with all the life saving and messaging capabilities of its predecessor, the inReach Mini 2 adds improved GPS reception and a longer battery life. By tapping into the power of Iridium’s® satellite constellation, you can send and receive text messages and emails anywhere on the planet, staying connected even where there’s no phone coverage. Should things take a turn for the worse, a dedicated SOS button lets you call for help, no matter where you are. The upgraded GPS chipset allows improved navigation to pre-set waypoints and breadcrumb style routing. If you get turned around on a hike, TracBack® has you covered, displaying an onscreen path that will take you right back to the trailhead. The onboard GPS also helps you stay connected, imbedding your location with each message, letting your followers track your adventures. When paired with the free Garmin Explore® app you can use your phone to plan trips, access topographical maps, create waypoints and then sync routes to your Mini.</p><ul><li>Rugged housing is IPX7 water-resistant, dustproof and has an easy-to-read display</li><li>TracBack mode navigates you safely back to where you started</li><li>Compass helps keep you headed in the right direction, even when you’re stopped</li><li>Bluetooth Smart and ANT+ compatibility lets you explore smarter with compatible activity sensors and accessories</li><li>Garmin Explore™ website and app let you sync routes, tracks and waypoints to your device. You can download map data to your phone, use your phone to plan routes and tracks, and then send those plans to your inReach Mini 2, all without cell reception</li><li>Breadcrumb trails track your trek, navigate you to a saved location or entered coordinate (there are no maps for routing), or navigate you on the trail you took back to where you started</li><li>Uses Iridium’s constellation of 66 satellites for coverage of the Earth's entire surface. Messages are buffered for up to a day</li><li>Iridium’s worldwide coverage lets you send texts and emails from anywhere in the world. Your plan determines how many you can send and how detailed they are</li><li>GPS tracking feature allows your friends and community to follow your progress via a personalized MapShare® page</li><li>World coverage SOS feature gives you a confirmation message from the International Emergency Response Coordination Center (IERCC) if you use it to send an SOS. 2-way texting allows you to stay in contact with rescue personnel</li><li>SOS messages are received by IERCC, a worldwide emergency response coordination center with 24/7/365 staffing</li><li>SOS button has a hard plastic cover, greatly reducing chances of an accidental activation</li><li>Messages have your GPS location embedded</li><li>GPS enables basic on-screen grid navigation</li><li>GPS, GLONASS, BeiDou and QZSS satellite constellation support for strong signal anywhere</li><li>Optional weather forecasting service sends detailed weather data for your location, a specific waypoint or a GPS coordinate directly to your inReach, paired smartphone or tablet</li><li>Connects via Bluetooth to phones/tablets running the free Explore app. Allowing you to download maps and nautical charts, enabling detailed mapping and easier messaging – directly through your contacts</li><li>Downloaded maps are stored in your phone and are available even if there is no cell phone signal</li><li>Rechargeable internal battery pack delivers up to 14 days of battery life with 10-minute tracking, or 30 days with 30-minute tracking (battery life varies depending on settings and overhead interference, e.g., tree canopy, ravines, etc.)</li><li>SOS/PLB functionality and all off-grid communication requires a separate satellite plan to activate, GPS functionality works all the time, no plan required</li><li>Monthly plans are available, as well as seasonal hibernation options that allow you to pay a minimal fee during months when you are not using the device</li><li>In the box: inReach Mini 2, carabiner for use with the Mini’s swivelling attachment loop, USB-C charging and data cable, and documentation</li></ul>",
  "img_hrefs": [
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/46917/images/193360/6021964_BK000__66497.1693300545.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/46917/images/193200/6021964_BK000_ALT-F__39284.1664296099.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/46917/images/193195/6021964_BK000_ALT-E__69611.1664296099.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/46917/images/193186/6021964_BK000_ALT-D__34896.1664296099.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/46917/images/193172/6021964_BK000_ALT-C__58207.1664296099.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/46917/images/193160/6021964_BK000_ALT-B__47821.1649187794.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/46917/images/193152/6021964_BK000_ALT-A__32591.1664296099.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/46917/images/193203/6021964_FLM00_ALT-A__63845.1699089013.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/46917/images/193205/6021964_FLM00_ALT-B__86498.1699089014.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/46917/images/193206/6021964_FLM00_ALT-C__71645.1699089014.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/46917/images/193209/6021964_FLM00_ALT-D__51198.1699089014.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/46917/images/193363/6021964_FLM00__57450.1699089012.1280.1280.jpg?c=1"
  ],
  "name": "Garmin inReach Mini 2",
  "price_cents": 53999,
  "specs": [
    {
      "key": "Weight (Black)",
      "value": "100g"
    },
    {
      "key": "Weight (Flame Red)",
      "value": "100g"
    },
    {
      "key": "Ideal for",
      "value": [
        "Emergency preparedness",
        "Camping and hiking",
        "Mountain biking"
      ]
    },
    {
      "key": "Satellite network used",
      "value": "Iridium"
    },
    {
      "key": "Battery life (operating)",
      "value": "48-720 h"
    },
    {
      "key": "Battery life (standby)",
      "value": "8760 h"
    },
    {
      "key": "IPX rating",
      "value": "IP X7"
    },
    {
      "key": "Storage temperature",
      "value": "-20 to 60°C"
    },
    {
      "key": "Dimensions",
      "value": "5.2 x 2.6 x 9.9cm"
    },
    {
      "key": "Replaceable batteries",
      "value": "No"
    },
    {
      "key": "Rechargeability",
      "value": "Rechargeable"
    },
    {
      "key": "GPS data sent in SOS",
      "value": "Yes"
    },
    {
      "key": "Batteries",
      "value": "Lithium-ion (included)"
    },
    {
      "key": "Barometric altimeter",
      "value": "No"
    },
    {
      "key": "Basemap",
      "value": "No"
    },
    {
      "key": "Electronic compass",
      "value": "Yes"
    },
    {
      "key": "Floats",
      "value": "No"
    },
    {
      "key": "Check-in feature",
      "value": "Yes"
    },
    {
      "key": "Lanyard attachment",
      "value": "Yes"
    },
    {
      "key": "Ability to test",
      "value": "Yes"
    },
    {
      "key": "Delivery confirmation",
      "value": "Yes"
    },
    {
      "key": "Product sustainability",
      "value": [
        "Rechargeable batteries"
      ]
    },
    {
      "key": "Made in",
      "value": "Taiwan"
    }
  ],
  "url": "https://www.mec.ca/en/product/6021-964/inreach-mini-2"
}