{
  "description": "<p>Enjoy bike GPS goodness in the backcountry. This kit bundles the 830 with Garmin’s Edge remote and mountain bike mount so you always where you’re going. Get phone-free, turn-by-turn point of interest navigation, and worldwide trail maps on a compact, touchscreen GPS. Select where you want to go, by address, or browse  categories (restaurants, locations, attractions). Garmin’s Trendline routing looks at other Garmin Connect user’s data to find the best rides and most efficient routes. Real-time Strava segment integration speaks to your competitive side, displaying nearby segments, showing how you compare to your PR and the current KOM or QOM. Live Tracking continues to evolve, with rider-to-rider pre-set messaging and real-time location. When connected to your phone via the free Garmin Connect app, you can receive texts, social media alerts, emails, download training plans, review activities, keep an eye on the weather and more.</p><ul><li>Searchable maps (North America) let you enter an address just like you would in your phone or in-car GPS. Once the 830 knows where you want to go, it will navigate you there and it will even re-route you if you get off course</li><li>Point of interest navigation includes restaurants, attractions, hospitals, accommodation and more</li><li>Trendline™ routing uses Garmin Connect’s database of rider’s routes and tracks to find popular routes</li><li>ClimbPro™ mode breaks down the climbs, letting you know grade, total ascent, remaining ascent and elevation profile, so you get an idea of how to pace yourself</li><li>Mountain biking dynamics include 3 new metrics, jumps: number of jumps, hangtime, distance and speed, grit: overall trail difficulty, and flow: a score of how smoothly you rode the trail e.g. did you over brake in a corner</li><li>TrailForks™ integration lets you access and navigate through the immense TrailForks trail database without needing a cellular connection. You can even log into your account and save rides, check-in on trails, etc., all from your Edge!</li><li>ForkSight mode uses TraliForks data when you get to a fork in the trail, telling about your choices, e.g. trail rating, distance, elevation</li><li>Strava Segment integration (requires premium) preloaded or on-the-fly through your phone, shows starred segments and instantaneous results as segments end</li><li>Live Tracking during activities (through a connected smartphone) allows you to share your location, speed, and more</li><li>GroupTrack™ displays the location and telemetry of up to 50 of your contacts that are using compatible Garmin devices</li><li>Pre-set messaging between compatible Edge units, when combined with Live Tracking, means real-time location and messaging, no more stopping to check your phone</li><li>Find my Edge feature sends a lost-connection alert with location and exact GPS coordinates. Once in Bluetooth™ range you can trigger an alarm on your device to find it</li><li>Training plan takes you through the details of your ride: weather – including the recommended clothing for the conditions, food and water requirements based on your fitness levels – even providing reminders of when you should drink and eat, and much more</li><li>Environmental factors like heat and altitude acclimation are taken into consideration when calculating performance and recovery metrics</li><li>Training status helps you optimize your training, guiding you where you need to push and where you may need to dial it back</li><li>Bike alarm mode adds a bit of peace of mind to pit stops</li><li>Incident detection uses the Edge’s accelerometers to detect if an accident has occurred.  In the case of an accident the unit will send a signal through your paired smartphone to predefined emergency contacts</li><li>Included Edge remotes lets you navigate your 830 without ever taking your hands off the bars</li><li>Included mountain bike mount is designed for bikes with short stems, and lets you choose if you want your 830 out front of the bars, or tucked behind, in line with the stem</li><li>Speed sensor track your rides even when you aren’t using your phone or bike computer. Sensor start a session when you start and stop rolling, synching to your phone (running Garmin Connect) or computer when next in range</li><li>Speed Sensor attaches to a standard hub on either wheel and self-calibrates for accurate speed and distance while stationary (on a trainer) or on the move</li><li>Improved processor lets you spend less time fiddling with the computer and more time riding</li><li>Barometric altimeter helps you track your total elevation changes</li><li>Customizable screens let you choose what you want to see where</li><li>included out the front mount holds the Edge flush with the handlebars, and allows the connection to the external battery pack (sold separately)</li><li>In the box: Edge 830, mounts (MTB and standard), Edge remote, Speed Sensor 2, silicone case, USB cable, tether and manuals</li></ul>",
  "img_hrefs": [
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/26000/images/210424/6005144_BK000__61995.1654881029.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/26000/images/114388/6005144_BK000_ALT-GPS__04010.1654881029.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/26000/images/114239/6005144_BK000_ALT-TRAINING3__16512.1654881029.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/26000/images/114068/6005144_BK000_ALT-LEFT__71980.1654881029.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/26000/images/113576/6005144_BK000_ALT-TRAINING4__26545.1654881029.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/26000/images/113281/6005144_BK000_ALT-TRAINING2__73788.1654881029.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/26000/images/112978/6005144_BK000_ALT-TRAINING__19482.1654881029.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/26000/images/112690/6005144_BK000_ALT-BACK__96655.1654881029.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/26000/images/112381/6005144_BK000_ALT-RIGHT__22067.1654881029.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/26000/images/112110/6005144_BK000_ALT-ASSISTANCE__21897.1654881029.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/26000/images/111853/6005144_BK000_ALT-ANGLERIGHT__87378.1654881029.1280.1280.jpg?c=1"
  ],
  "name": "Garmin Edge 830 MTB Bundle",
  "price_cents": 62999,
  "specs": [
    {
      "key": "Ideal for",
      "value": [
        "Mountain biking",
        "Cross-country riding",
        "Road cycling",
        "Cycle touring"
      ]
    },
    {
      "key": "Built-in memory",
      "value": "16GB"
    },
    {
      "key": "IPX rating",
      "value": "IP X7"
    },
    {
      "key": "Dimensions",
      "value": "8.2 x 5 x 2cm"
    },
    {
      "key": "Countdown timer",
      "value": "Yes"
    },
    {
      "key": "Stopwatch",
      "value": "Yes"
    },
    {
      "key": "Calorie consumption",
      "value": "No"
    },
    {
      "key": "Calories in real time",
      "value": "No"
    },
    {
      "key": "Coded signal",
      "value": "Yes"
    },
    {
      "key": "Touch screen",
      "value": "Yes"
    },
    {
      "key": "Heart rate in real time",
      "value": "No"
    },
    {
      "key": "Interval training",
      "value": "Yes"
    },
    {
      "key": "Batteries",
      "value": "Lithium-ion (included)"
    },
    {
      "key": "Auto pause",
      "value": "Yes"
    },
    {
      "key": "Distance/time alarm",
      "value": "Yes"
    },
    {
      "key": "Battery life",
      "value": "20 h"
    },
    {
      "key": "Barometric altimeter",
      "value": "Yes"
    },
    {
      "key": "Basemap",
      "value": "Yes"
    },
    {
      "key": "Wireless sync",
      "value": "Yes"
    },
    {
      "key": "Routes",
      "value": "100"
    },
    {
      "key": "ANT+ compatible",
      "value": "Yes"
    },
    {
      "key": "Metric/imperial units format",
      "value": "Yes"
    },
    {
      "key": "Waypoints",
      "value": "200"
    },
    {
      "key": "Interface",
      "value": [
        "USB",
        "Wireless"
      ]
    },
    {
      "key": "Button lock",
      "value": "Yes"
    },
    {
      "key": "New lap auto start",
      "value": "Yes"
    },
    {
      "key": "Pace alarm",
      "value": "Yes"
    },
    {
      "key": "Bluetooth",
      "value": "Yes"
    },
    {
      "key": "Battery power indicator",
      "value": "Yes"
    },
    {
      "key": "Low battery warning",
      "value": "Yes"
    },
    {
      "key": "Speed/cadence sensor",
      "value": "Sold separately"
    },
    {
      "key": "Workout history",
      "value": "Yes"
    },
    {
      "key": "Power meter",
      "value": "Sold separately"
    },
    {
      "key": "Pause timer",
      "value": "Yes"
    },
    {
      "key": "Virtual partner",
      "value": "Yes"
    },
    {
      "key": "App compatibility",
      "value": [
        "Garmin Connect",
        "Third party apps"
      ]
    },
    {
      "key": "Custom POI",
      "value": "Yes"
    },
    {
      "key": "Chest strap",
      "value": "Sold separately"
    },
    {
      "key": "Programmable workouts",
      "value": "Advanced"
    },
    {
      "key": "Area calculation",
      "value": "No"
    },
    {
      "key": "Add maps capability",
      "value": "Yes"
    },
    {
      "key": "WiFi",
      "value": "Yes"
    },
    {
      "key": "Heart rate monitor",
      "value": "Sold separately"
    },
    {
      "key": "Unit to unit transfer",
      "value": "Yes"
    },
    {
      "key": "Haptic feedback",
      "value": "No"
    },
    {
      "key": "Heart rate target zones",
      "value": "No"
    },
    {
      "key": "Made in",
      "value": "Taiwan"
    }
  ],
  "url": "https://www.mec.ca/en/product/6005-144/edge-830-mtb-bundle"
}