{
  "description": "<p>Same great features, no tools needed. This updated version of Garmin’s feature-packed heart rate strap allows tool-free battery swaps. The HRM-Pro Plus still has all the same great running dynamic features from the HRM Run strap, plus the pool-time memory and data upload from the HRM Swim and Tri, and daily in activity tracking. Garmin has made their most powerful heart rate strap, a little more user friendly.</p><ul><li>Real-time heart rate data is transmitted to compatible devices, equipment and apps</li><li>Internal accelerometer measures torso movement to calculate pace (Garmin watch exclusive), cadence in steps per minute, vertical oscillation of your torso (measured in centimeters), ground contact time measured in milliseconds, and activity tracking data</li><li>Memory stores training and daily activity data, great for pools or activities where a watch cannot be worn – data is uploaded to your device when in range</li><li>CR2032 battery runs for 1 year with 1 hour of training per day, and battery status is displayed in Garmin Connect™</li><li>Tool-free battery changing</li><li>Supports heart rate variability and advanced heart rate features</li><li>Communicates via Bluetooth™ (5.0) and ANT+ (2.5GHz)</li><li>Supports stand-alone activity monitoring (steps, all-day heart rate, calories and intensity minutes) and TrueUp™</li><li>Strap dimensions are 64.0 to 109 x 3 x 1.2cm, fits torsos from 64–109cm in circumference</li><li>Soft rounded edges are comfortable to wear</li><li>Water resistant to 50m</li></ul>",
  "img_hrefs": [
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/51025/images/225549/6025498_BK000__20910.1675419278.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/51025/images/225548/6025498_BK000_ALT-A__55421.1675419277.1280.1280.jpg?c=1"
  ],
  "name": "Garmin HRM-Pro Plus Chest Strap - Unisex",
  "price_cents": 17999,
  "specs": [
    {
      "key": "Weight",
      "value": "52g (Black)"
    },
    {
      "key": "Ideal for",
      "value": [
        "Running, fitness and training",
        "Swim training",
        "Sport road cycling",
        "Cycle training"
      ]
    },
    {
      "key": "Bluetooth",
      "value": "Yes"
    },
    {
      "key": "ANT+ compatible",
      "value": "Yes"
    },
    {
      "key": "Made in",
      "value": "Taiwan"
    }
  ],
  "url": "https://www.mec.ca/en/product/6025-498/hrm-pro-plus-chest-strap"
}