{
  "description": "<p>In a world where something always needs charging, wouldn’t it be nice if your Edge didn’t? By incorporating efficient solar technology into these Edge units, Garmin lets you spend more time riding and less time charging. Building on GPS technology from the Fenix line, the latest Edge computers give you access to more satellites and more signals than ever before. These updates give you a stronger GPS connection anywhere you ride, from forests, to valleys of glass and steel. Free detailed maps provide turn-by-turn directions to local points of interest, so if there is gelato close by, you’ll find it. Garmin has incorporated their popularity routing into the latest map set, letting you ride the local’s favourite roads and trails, anywhere you go. Pre-loaded with TrailForks, you get access to incredible trail maps right on your Edge. Real-time Strava segment integration displays nearby segments, showing how you compare to your PR and the current KOM or QOM. And if you’re the “never enough data” type, you can pair your Edge to a range of additional sensors to optimize your time in the saddle. When connected to your phone via the free Garmin Connect app, you can receive notifications, download training plans, review activities, keep an eye on the weather and more.</p><ul><li>Power Glass™ solar panels let you go longer between charges, from 6 to 18 hours longer – on daytime rides, solar can add up to 25 minutes per hour in battery saver mode. Runtime is feature and weather dependent</li><li>Solar panels collect energy until the battery is full, even when the unit is asleep or off</li><li>Post ride summary includes solar intensity and the amount of time your battery gained from that solar energy</li><li>Updated bike type specific mapping uses Garmin Connect’s database of rider’s routes and tracks, finding you the most popular way to get where you’re going, on road or off</li><li>Free global maps, with North America on the device and more regions downloadable for free from Garmin Express™, providing turn-by-turn routing</li><li>Point of interest navigation lets you search for places like restaurants, attractions, hospitals, accommodation, and more</li><li>Multi-band signal reception and expanded GNSS support (GPS, GLONASS, Galileo, QZSS and IRNSS) provide faster and more accurate positioning and elevation data</li><li>Satellite caching gives you a fast connection and a strong GPS signal</li><li>ClimbPro™ mode breaks down the climbs in your ride, letting you know the grade, the total ascent, remaining ascent, and displays an elevation profile (no course required)</li><li>Power specific features like targeted coaching: how you’re performing on that ride and at that moment, on-the-fly recommended power targets, and cycling ability information that highlights strengths and weaknesses. Note – these features require a not included power meter</li><li>Mountain biking dynamics include specific metrics, jumps: hangtime, distance and speed, grit: overall trail difficulty, and flow: a score of how smoothly you rode the trail</li><li>TrailForks™ integration for access to TrailForks trail database without a cell connection</li><li>Strava Segment integration (requires premium) preloaded or on-the-fly via your phone, shows starred segments and results</li><li>Live Tracking during activities (via phone) allows you to share your location, speed, course and more, with friends, family, or coaches</li><li>Training plan takes you through the details of your ride: weather conditions, food and water requirements based on your fitness levels – with reminders when you should drink and eat, and more</li><li>Environmental factors like heat and altitude acclimation are taken into consideration when calculating performance and recovery metrics</li><li>Training status and daily suggested workouts help you optimize your training, guiding you where you need to push and where you may need to dial it back</li><li>Physiological metrics includes VO2 max estimate, lactate threshold, race predictor, recovery advisor and performance indicator (requires not included heartrate chest strap)</li><li>Bike alarm mode sounds a loud, shrill, attention getting alarm if your bike is touched</li><li>Incident detection uses accelerometers to detect accident and uses you phone to send a signal to predefined emergency contacts</li><li>inReach® compatibility, connect to an inReach for messaging and SOS support when off the grid</li><li>Simplified user interface puts less in between you and that first ride</li><li>Connect IQ support allows you to download apps, templates, data fields, and other features</li><li>Free Garmin Connect app lets you review activities, receive texts, social media alerts, emails, etc., download training plans, keep an eye on the weather and more</li><li>Rechargeable lithium-ion battery lasts up to 32 hours in with full GPS and sensor support, or up to 60 in battery saver mode</li><li>In the box: Edge 540 Solar, mounts (flush out-front and standard), USB-C cable, tether and documentation</li></ul>",
  "img_hrefs": [
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/51585/images/231478/6026461_NOC02__14512.1681290546.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/51585/images/231467/6026461_NOC02_ALT-H__47300.1681290546.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/51585/images/231456/6026461_NOC02_ALT-G__92919.1681290545.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/51585/images/231445/6026461_NOC02_ALT-F__49617.1681290545.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/51585/images/231438/6026461_NOC02_ALT-E__72747.1681290544.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/51585/images/231427/6026461_NOC02_ALT-D__29050.1681290544.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/51585/images/231417/6026461_NOC02_ALT-C__62534.1681290543.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/51585/images/231406/6026461_NOC02_ALT-B__73224.1681290543.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/51585/images/231395/6026461_NOC02_ALT-A__40534.1681290542.1280.1280.jpg?c=1"
  ],
  "name": "Garmin Edge 540 Solar",
  "price_cents": 59999,
  "specs": [
    {
      "key": "Weight",
      "value": "85g (No colour SKU)"
    },
    {
      "key": "Ideal for",
      "value": [
        "Road cycling",
        "Mountain biking",
        "Cross-country riding",
        "Cycle touring"
      ]
    },
    {
      "key": "Built-in memory",
      "value": "16GB"
    },
    {
      "key": "IPX rating",
      "value": "IP X7"
    },
    {
      "key": "Dimensions",
      "value": "8.5 x 6 x 2cm"
    },
    {
      "key": "Countdown timer",
      "value": "Yes"
    },
    {
      "key": "Stopwatch",
      "value": "Yes"
    },
    {
      "key": "Calorie consumption",
      "value": "No"
    },
    {
      "key": "Calories in real time",
      "value": "No"
    },
    {
      "key": "Speed/cadence sensor",
      "value": "Sold separately"
    },
    {
      "key": "Coded signal",
      "value": "Yes"
    },
    {
      "key": "Workout history",
      "value": "Yes"
    },
    {
      "key": "Touch screen",
      "value": "No"
    },
    {
      "key": "Heart rate in real time",
      "value": "No"
    },
    {
      "key": "Interval training",
      "value": "Yes"
    },
    {
      "key": "Batteries",
      "value": "Lithium-ion (included)"
    },
    {
      "key": "Auto pause",
      "value": "Yes"
    },
    {
      "key": "Power meter",
      "value": "Sold separately"
    },
    {
      "key": "Distance/time alarm",
      "value": "Yes"
    },
    {
      "key": "Pause timer",
      "value": "Yes"
    },
    {
      "key": "Battery life",
      "value": "32-60 h"
    },
    {
      "key": "Barometric altimeter",
      "value": "Yes"
    },
    {
      "key": "Basemap",
      "value": "Yes"
    },
    {
      "key": "Wireless sync",
      "value": "Yes"
    },
    {
      "key": "Routes",
      "value": "100"
    },
    {
      "key": "ANT+ compatible",
      "value": "Yes"
    },
    {
      "key": "Virtual partner",
      "value": "Yes"
    },
    {
      "key": "Metric/imperial units format",
      "value": "Yes"
    },
    {
      "key": "App compatibility",
      "value": [
        "Garmin Connect",
        "Third party apps"
      ]
    },
    {
      "key": "Waypoints",
      "value": "200"
    },
    {
      "key": "Custom POI",
      "value": "Yes"
    },
    {
      "key": "Interface",
      "value": [
        "USB",
        "Wireless"
      ]
    },
    {
      "key": "Button lock",
      "value": "Yes"
    },
    {
      "key": "Chest strap",
      "value": "Sold separately"
    },
    {
      "key": "Programmable workouts",
      "value": "Advanced"
    },
    {
      "key": "New lap auto start",
      "value": "Yes"
    },
    {
      "key": "Area calculation",
      "value": "No"
    },
    {
      "key": "Add maps capability",
      "value": "Yes"
    },
    {
      "key": "Pace alarm",
      "value": "Yes"
    },
    {
      "key": "WiFi",
      "value": "Yes"
    },
    {
      "key": "Bluetooth",
      "value": "Yes"
    },
    {
      "key": "Battery power indicator",
      "value": "Yes"
    },
    {
      "key": "Heart rate monitor",
      "value": "Sold separately"
    },
    {
      "key": "Low battery warning",
      "value": "Yes"
    },
    {
      "key": "Unit to unit transfer",
      "value": "Yes"
    },
    {
      "key": "Haptic feedback",
      "value": "No"
    },
    {
      "key": "Heart rate target zones",
      "value": "No"
    },
    {
      "key": "Product sustainability",
      "value": [
        "Rechargeable batteries"
      ]
    },
    {
      "key": "Made in",
      "value": "Taiwan"
    }
  ],
  "url": "https://www.mec.ca/en/product/6026-461/edge-540-solar"
}