{
  "description": "<p>Bring the luxury of power to your adventure van, base camp or remote cabin. Known for its reliable and rugged power solutions, Goal Zero is a household, van-hold and yurt-hold name among off-grid adventurers. The Yeti 1500X lives up to expectations, using lightweight (vs. lead-acid) lithium batteries to give you on-grid convenience no matter where you are, without any of the fumes or noise of a generator. Wifi integration lets you use the free Yeti app to check charge and discharge rates, turn ports on or off, monitor temperatures, update firmware and much more, from anywhere you have a signal. The onboard digital display shows you the same information, in case you don't want to reach for your phone. Tons of female charging ports, including 12V (car cigarette lighter), 6mm plug, power pole plug, 2 x USB type C (one is even set-up for USB-PD), 2 x USB type A, and 2 x AC that accepts grounded and ungrounded plugs, let you charge or run almost anything, from blenders and freezers for backcountry margaritas, to a to laptop and projector for wall-sized movies at the cabin.</p><ul><li>Wifi lets you control the Yeti 1500X remotely to check charging and discharging status, update firmware, turn ports on or off and much more</li><li>LCD power status display tells you how much power you're getting and using, as well as battery charge capacity and time remaining under current load</li><li>Charges easily via included wall charger, going from 0 to full in 14 hours, or 3-72 hours from compatible solar panels (bigger and more efficient panels take less time)</li><li>MPPT (Maximum Power Point Tracker) technology enables a 30% more efficient charging via Goal Zero solar panels in low-light conditions</li><li>Li-NMC (lithium nickel manganese cobalt oxide) battery offers a longer life than standard lithium-ion batteries and better inherent safety</li><li>Battery can be kept plugged into a power source during storage, or fully charge your Yeti 1500X every 3-6 months and store in a cool, dry place</li><li>Peak capacity is 1516Wh (10.8V, 140.4Ah), which lasts through hundreds of cycles</li><li>Smart management system provides charging (solar or mains) and built-in low-battery protection</li><li>4 USB ports (output): 2 x type-A at 5V, up to 2.4A (12W max), USB-C 5-12V up to 3.0A (18W max), USB-C PD 5-20V up to 3.0A (60W max), All ports are regulated</li><li>6mm port (output): 12V, up to 10A (120W max)</li><li>12V car port (output): 12V, up to 13A (160W max)</li><li>12V power pole port (output): 12V, up to 30A (360W max)</li><li>AC inverter (output, 60Hz, pure sine wave): 120VAC, 16.5A (2000W, 3500W surge)</li><li>Provides pass-through power, so you can plug your Yeti into the wall and then your device into your Yeti, making sure your device stays charged should the power go out</li><li>Charging port (input, 8mm):14-50V, up to 10A (120W max)</li><li>Power pole charging port (input): 14-50V, up to 50A (600W max)</li><li>Expansion port in the storage compartment for use ONLY with Goal Zero modules</li><li>Storage compartment keeps cables and adapters close at hand</li><li>Operating temp is 0-40°C</li><li>In the box: Goal Zero Yeti 1500X Lithium Power Station with Wifi and a wall charger</li><li>DO NOT ATTEMPT TO CHARGE YOUR YETI LITHIUM FROM A 12V SOURCE. Doing so may cause damage to the unit</li></ul>",
  "img_hrefs": [
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/14437/images/66837/6013463_NOC02__11611.1652864975.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/14437/images/66390/6013463_NOC02_ALT-BACK__94180.1649187753.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/14437/images/66167/6013463_NOC02_ALT-ANGLELEFT__18204.1649187751.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/14437/images/65936/6013463_NOC02_ALT-INSITU__09734.1649187750.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/14437/images/66615/6013463_NOC02_ALt-ANGLERIGHT__59146.1652864974.1280.1280.jpg?c=1"
  ],
  "name": "Goal Zero Yeti 1500X Portable Power Station",
  "price_cents": 279995,
  "specs": [
    {
      "key": "Weight",
      "value": "20.7kg (No colour SKU)"
    },
    {
      "key": "Ideal for",
      "value": [
        "Frontcountry camping",
        "Everyday use",
        "Emergency preparedness",
        "Emergency preparedness"
      ]
    },
    {
      "key": "Chemistry",
      "value": "Lithium nickel manganese cobalt oxide "
    },
    {
      "key": "Output voltage",
      "value": "5-120volts"
    },
    {
      "key": "Capacity",
      "value": "140.4Ah"
    },
    {
      "key": "Dimensions",
      "value": "39 x 35 x 26cm (No colour SKU)"
    },
    {
      "key": "Rechargeable",
      "value": "Yes"
    },
    {
      "key": "Product sustainability",
      "value": [
        "Rechargeable batteries"
      ]
    },
    {
      "key": "Made in",
      "value": "China"
    }
  ],
  "url": "https://www.mec.ca/en/product/6013-463/yeti-1500x-portable-power-station"
}