{
  "description": "<p>These burly, supportive backpacking boots are engineered to eat up miles of rugged terrain. They’ll excel on rocky or heavily rooted trails, boulder fields, steep slopes and terrain that requires precise foot placements and cushioned stability.</p><ul><li>Leather Working Group certified suede and fabric upper</li><li>Leather Working Group judges and classifies tanneries based on energy use, waste production and water treatment</li><li>Gore-Tex waterproof-breathable membrane keeps feet dry and comfortable in all weather conditions</li><li>Spacious forefoot area suits hikers with wider feet</li><li>2 independent lacing zones and Click Clamp eyelets let you fine-tune the fit</li><li>Cushioning midsole with reinforced polyurethane wedge for smooth roll-off and shock absorption</li><li>Flex-point upper design for natural walking motion</li><li>TPU frame provides torsional rigidity between the midfoot and ankle</li><li>Lateral Flex Technology (LFX) cuff design supports and stabilizes the foot</li><li>Vibram® Integral Light rubber outsole with 3D PrismBase technology provides traction in rough terrain</li></ul>",
  "img_hrefs": [
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/48966/images/209519/6019517_BK342__18764.1653988142.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/48966/images/209522/6019517_BK342_ALT-A__18551.1653988143.1280.1280.jpg?c=1"
  ],
  "name": "Hanwag Alverstone II Gore-Tex Backpacking Boots - Men's",
  "price_cents": 49495,
  "specs": [
    {
      "key": "Weight",
      "value": "1.46kg (9)"
    },
    {
      "key": "Ideal for",
      "value": [
        "Backpacking",
        "Day hiking"
      ]
    },
    {
      "key": "Upper material",
      "value": [
        "Suede"
      ]
    },
    {
      "key": "Closure",
      "value": [
        "Lace-up"
      ]
    },
    {
      "key": "Rand",
      "value": "Toecap"
    },
    {
      "key": "Removable insole",
      "value": "Yes"
    },
    {
      "key": "Waterproof",
      "value": "Yes"
    },
    {
      "key": "Made in",
      "value": "Croatia"
    }
  ],
  "url": "https://www.mec.ca/en/product/6019-517/alverstone-ii-gore-tex-backpacking-boots"
}