{
  "description": "<p>Originally produced as a fundraiser for an around-the-world cruise on a Viking long ship, the Viking knife is just as useful today as it was 1000 years ago. Using a 3-layer carbon steel, the rugged blade retains its edge well and is easy to sharpen when the time comes. The barrel-shaped curly birch handle is comfortable in a variety of grips. A simple leather sheath keeps the knife close at hand while you're in the field.</p><ul><li>Helle laminated steel sandwiches a hard steel between two softer steel sides, giving the blade an excellent mix of toughness and edge retention without making it hard to sharpen</li><li>Scandinavian (Scandi) grind excels at bushcraft tasks</li><li>Comfortable barrel-shaped handle is sculpted out of curly birch</li><li>Leather sheath is embossed with traditional designs and hangs on a leather strap, placing the knife below the belt-line</li><li>Since 1932, Helle knives have been made in a small Norwegian village nestled between the mountains and fjords. Each Helle knife has passed through experienced hands on its way to your belt</li><li>Each knife has its own personality, and variations in colour and patterns mean no two are alike</li></ul>",
  "img_hrefs": [
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/31864/images/135165/5059526_NOC02__80795.1652865031.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/31864/images/134973/5059526_NOC02_ALT-SHEATH__34689.1649187812.1280.1280.jpg?c=1"
  ],
  "name": "Helle Viking Knife",
  "price_cents": 16995,
  "specs": [
    {
      "key": "Weight",
      "value": "154g (No colour SKU)"
    },
    {
      "key": "Ideal for",
      "value": [
        "Backpacking",
        "Day hiking"
      ]
    },
    {
      "key": "Sheath material",
      "value": [
        "Leather"
      ]
    },
    {
      "key": "Handle material",
      "value": [
        "Wood"
      ]
    },
    {
      "key": "Blade material",
      "value": "Carbon steel"
    },
    {
      "key": "Blade edge type",
      "value": [
        "Straight"
      ]
    },
    {
      "key": "Knife length (open)",
      "value": "21.5cm"
    },
    {
      "key": "Blade length",
      "value": "11cm"
    },
    {
      "key": "Sheath included",
      "value": "Yes"
    },
    {
      "key": "Made in",
      "value": "Norway"
    }
  ],
  "url": "https://www.mec.ca/en/product/5059-526/viking-knife"
}