{
  "description": "<p>Your bike means a lot to you, it’s also worth a lot to crooks, so protect it. Angle grinders are the #1 choice of lock-defeating tools, so Hiplok set out to design a lock that could defeat an angle grinder. The key to the D1000’s ultimate level of protection lies in its hardened graphene steel composite. This composite material takes 20 times longer to cut through with an angle grinder than conventional hardened steel. Every aspect of this lock’s construction has been optimized to protect your property, from its square shackle, to its compact lock opening. Whether you’re protecting a pedal bike, an e-bike, or a motorbike, the D1000 is some of the best protection you can buy.</p><ul><li>Rated Diamond level protection (that’s the best) by Sold Secure – an independent 3rd party lock testing group. This means it can withstand more than 90 seconds of an attack by an angle grinder, and if you look at the videos, it lasts a lot longer than that</li><li>20mm graphene reinforced premium hardened steel shackle is incredibly strong and destroys cutting discs</li><li>15.5 x 9.2cm opening leaves room for you bike and what you’re locking it to, with no room leftover for leverage tools</li><li>Silicone sleeve on the shackle protects your bike’s paint</li><li>3 coded keys are included</li></ul>",
  "img_hrefs": [
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/51277/images/228484/6025006_BK000__25413.1681248396.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/51277/images/228471/6025006_BK000_ALT-A__26358.1681248396.1280.1280.jpg?c=1"
  ],
  "name": "Hiplok D1000 Anti Angle-Grinder U-Lock",
  "price_cents": 41995,
  "specs": [
    {
      "key": "Weight",
      "value": "3.8kg (Black)"
    },
    {
      "key": "Ideal for",
      "value": [
        "Cycle commuting",
        "Urban cycling"
      ]
    },
    {
      "key": "Type",
      "value": [
        "U-Lock"
      ]
    },
    {
      "key": "Material",
      "value": "Hardened steel"
    },
    {
      "key": "Locking mechanism",
      "value": "Key"
    },
    {
      "key": "Dimensions",
      "value": "22.5 x 15.5cm (Black)"
    },
    {
      "key": "Number of keys",
      "value": "3"
    },
    {
      "key": "Mounting bracket",
      "value": "No"
    },
    {
      "key": "Made in",
      "value": "Taiwan"
    }
  ],
  "url": "https://www.mec.ca/en/product/6025-006/d1000-anti-angle-grinder-u-lock"
}