{
  "description": "<p>Sub-600g make these some of the lightest splitboard bindings available anywhere. The best part is that the weight reduction doesn't come at the cost of performance. Carbon fiber, aluminum and titanium do stiff and light just right. Take them to your favourite stash, ride spines in AK or swim in the bottomless snow of Japan, they'll keep you grinning all year.</p><ul><li>Carbon fiber, titanium, 7000-series aluminum, stainless steel and Dupont Zytel attest to this binding's durability</li><li>Carbon fiber high back has a great strength to weight ratio</li><li>AirForm ankle and choice of AirForm and AirStrap toe straps provides a snug fit</li><li>Flick the lever to transition from tour to ride</li><li>Standard spiltboard mounting hole pattern</li><li>2-setting heel risers are wide and easy to adjust with your pole basket</li><li>Heel lockdown is perfect for skating long flat sections</li><li>Open chassis doesn't interfere with your board flex</li><li>Stance width adjusts in 1/4in. increments and accommodates angles from 30 to -30 degrees</li><li>Compatible with board inserts of 3¼ to 3½in</li><li>Forward lean is set to -8 degrees in tour mode</li><li>Ride mode offers 2 adjustable modes from 0 to 22 (2-degree increments) and 0 or 11-degree</li><li>Compatible with Karakoram Quiver-Connector, so you can use these bindings on multiple boards</li></ul>",
  "img_hrefs": [
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/41436/images/170750/5054992_TEL22__01031.1652865056.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/41436/images/170644/5054992_TEL22_ALT-SET__31140.1649187845.1280.1280.jpg?c=1"
  ],
  "name": "Karakoram Prime X-Carbon Splitboard Bindings - Women's",
  "price_cents": 78585,
  "specs": [
    {
      "key": "Weight",
      "value": "1.19kg (Medium)"
    },
    {
      "key": "Ideal for",
      "value": [
        "Snowboarding"
      ]
    },
    {
      "key": "Made in",
      "value": "United States of America"
    }
  ],
  "url": "https://www.mec.ca/en/product/5054-992/prime-x-carbon-splitboard-bindings"
}