{
  "description": "<p>When you have to head out into the cold, this cozy parka will help you make the best of it. Quilted with layers of PrimaLoft insulation, the Voss parka lets you hold onto your natural warmth. Water repellent and windproof construction keeps you safe from gusty winter weather. And the insulated collar and hood mean you don’t need a scarf and toque to stay comfortable. The Voss parka has lots of little features to make frigid weather more bearable, like the like the magnetic storm flap that snaps together on its own, giving you one less thing to think about when rushing from the warm house to the chilly car.</p><ul><li>Recycled polyester blend shell is water repellant and stops wind in its tracks</li><li>Recycled polyester blend lining glides smoothly for easy layering</li><li>PrimaLoft® synthetic insulation holds onto warm air, is light and packable, and even stay warm when wet</li><li>BIONIC-FINISH® ECO fluorocarbon-free water and dirt repellent finish helps keep kids clean and dry</li><li>Seam sealed in the most exposed areas for even more weather protection</li><li>Insulated high collar and hood keep your head and neck warm</li><li>2-way zipper adds mobility without having to expose your upper body</li><li>Magnetic storm flap keeps the cold from creeping in</li><li>Zippered hand pockets keep your hands out of the weather and your phone close</li><li>OEKO-TEX 100 certified fabric adds confidence that what's next to your skin is made with the utmost care</li></ul>",
  "img_hrefs": [
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/54041/images/250881/6029015_TAU00__75347.1698915460.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/54041/images/250887/6029015_TAU00_ALT-A__51815.1698915461.1280.1280.jpg?c=1"
  ],
  "name": "Kari Traa Voss Parka - Women's",
  "price_cents": 34494,
  "specs": [
    {
      "key": "Ideal for",
      "value": [
        "Casual wear"
      ]
    },
    {
      "key": "Type",
      "value": [
        "Insulated synthetic"
      ]
    },
    {
      "key": "Technology",
      "value": [
        "PrimaLoft"
      ]
    },
    {
      "key": "Waterproofness",
      "value": "Waterproof with critically taped seams"
    },
    {
      "key": "Windproofness",
      "value": "Windproof"
    },
    {
      "key": "Made in",
      "value": "Hong Kong"
    }
  ],
  "url": "https://www.mec.ca/en/product/6029-015/voss-parka"
}