{
  "description": "<p>Take your toddler to the trails with this shred-ready balance bike. Kids Ride shotgun brings the joy of mountain biking to littlest riders in your family. The Dirt Hero line has enduro ready features and geometry, giving it a safer and more stable ride on rough terrain. Outfitted with a rear hydraulic disc brake, new riders get a lot of stopping power from little squeeze – great when you don’t have a lot of hand strength. More than just a stand-in for training wheels, balance bikes are a lot of fun on, and off road.</p><ul><li>Magura MT4 hydraulic disc brake on the back wheel for reliable braking in any conditions</li><li>Magura HC1 brake lever has an easily adjustable reach to fit all sizes of growing hands</li><li>Stable mountain bike geometry, with a slack front end and lower center of gravity than traditional balance bikes</li><li>Vee Crown Gem pneumatic trail tires are heavily lugged for great grip on the straights and in the corners</li><li>Front fender helps keep the trail off the rider</li><li>Sealed cartridge bearings can stand up to trail muck</li><li>Comes with 14in. wheels, but also accepts 12in. wheels, making it hand-me-down ready</li><li>Best suited for ages 3-5 years – minimum inseam of 36.7cm (14.4in.)</li><li>Includes Shred ‘til Bed animal stickers for a little customization</li></ul>",
  "img_hrefs": [
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/54690/images/254722/6028624_ASW00__78790.1702978658.1280.1280.jpg?c=1"
  ],
  "name": "Kids Ride Shotgun 14 Dirt Hero Off-Road Balance Bike with Brake - Children",
  "price_cents": 58895,
  "specs": [
    {
      "key": "Weight",
      "value": "4.6kg (One Size)"
    },
    {
      "key": "Ideal for",
      "value": [
        "Trail riding"
      ]
    },
    {
      "key": "Recommended age",
      "value": "3-5"
    },
    {
      "key": "Frame",
      "value": "Aluminum 6061 alloy"
    },
    {
      "key": "Made in",
      "value": "China"
    }
  ],
  "url": "https://www.mec.ca/en/product/6028-624/14-dirt-hero-off-road-balance-bike-with-brake"
}