{
  "description": "<p>Our bikes are our transport, our recreation, our toys, and Knog has found a sneaky way to help protect them. The Scout is the sleek little alarm and Bluetooth tracking unit that mounts to your bike’s water bottle mount - or under your water bottle cage. You arm the Scout via a small side mounted button, through the app, or when your Apple device, running the free iOS app, walks away from your bike. Once armed, the motion sensitive device sounds a piercing siren and sends you an alert, if someone other than you, moves your bike. Should your bike be stolen, the Knog app will track your bike’s location, so you can get it back.</p><ul><li>Tracking is done via Apple’s Find My network, triangulating your bike’s location via the Scout’s Bluetooth™ connection pinging off of other Apple devices</li><li>Only works with iOS devices</li><li>Motion sensor gives a warning beep for little movements, if your bike keeps moving, the Scout sounds the alarm and lets you know via an app notification</li><li>Armed via an onboard button, with the app, or through proximity to an iPhone running the free app</li><li>Includes a high visibility cover, should you want to advertise your security system</li><li>Battery lasts for 6 months and takes only 4 hours to recharge (via USB-C)</li><li>LEDs let you know battery and alarm status</li><li>IP66 weather protection means the scout isn’t bother by rainstorms or dust storms</li><li>Includes tamper resistant screws for mounting the Scout on its own and not under a water bottle cage</li><li>Updatable firmware keeps your alarm up to date and reliable</li></ul>",
  "img_hrefs": [
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/50943/images/224970/6024879_NOC02__02685.1674555096.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/50943/images/224967/6024879_NOC02_ALT-E__35858.1674555096.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/50943/images/224962/6024879_NOC02_ALT-D__77742.1674555096.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/50943/images/224960/6024879_NOC02_ALT-C__26953.1674555095.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/50943/images/224957/6024879_NOC02_ALT-B__88377.1674555095.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/50943/images/224953/6024879_NOC02_ALT-A__03757.1674555094.1280.1280.jpg?c=1"
  ],
  "name": "Knog Scout Bike Alarm  & Finder",
  "price_cents": 7495,
  "specs": [
    {
      "key": "Weight",
      "value": "21g (No colour SKU)"
    },
    {
      "key": "Ideal for",
      "value": [
        "Cycle commuting",
        "Urban cycling",
        "Road cycling",
        "Mountain biking"
      ]
    },
    {
      "key": "Product sustainability",
      "value": [
        "Rechargeable batteries"
      ]
    },
    {
      "key": "Made in",
      "value": "China"
    }
  ],
  "url": "https://www.mec.ca/en/product/6024-879/scout-bike-alarm-&-finder"
}