{
  "description": "<p>The innovative Kingpin redefines the performance standard for Alpine touring bindings. Ease of use and great power transmission while on the descent means you can have that perfect day in the backcountry. The latest version now includes a two-spring toe, saving 80g per binding without losing performance. With an easy conversion from walk to ski mode it really is a quiver-of-one binding option.</p><ul><li>Pivot point is pushed toward the toe to let the foot roll naturally</li><li>ISI Toe has a larger contact area and requires less force when stepping in</li><li>Pins click directly into the boot to reduce lifting force required to walk</li><li>Steel springs offer great energy absorption and have high compression value</li><li>XXL Power Transmitter for minimum friction and maximum centering for the lateral movement of the heel</li><li>Removable brakes are self-locking in walk mode and activate when you switch to ski mode</li><li>Anti Ice Pads in the base of toe prevents icing in critical areas</li><li>Ski aggressively or on hard surfaces in the unlocked position without risking accidental release</li><li>2-position heel lifts operate with poles</li><li>Compatible with all ski boots featuring DIN ISO PinTech inserts</li><li>Adjustable DIN ISO setting</li><li>Integrated crampon adapter (crampons available separately) slide onto the toe piece without stepping out of your skis</li></ul>",
  "img_hrefs": [
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/50505/images/220713/6022884_BK048__60181.1666170720.1280.1280.jpg?c=1"
  ],
  "name": "Marker Kingpin 13 Bindings",
  "price_cents": 81995,
  "specs": [
    {
      "key": "Weight",
      "value": "1.43kg (100mm-125mm)"
    },
    {
      "key": "Ideal for",
      "value": [
        "Alpine touring",
        "Freeride and freeskiing"
      ]
    },
    {
      "key": "Boot/binding compatibility",
      "value": [
        "Tech"
      ]
    },
    {
      "key": "Maximum compatible brake",
      "value": "125mm"
    },
    {
      "key": "Release setting",
      "value": "6-13"
    },
    {
      "key": "Crampon compatible",
      "value": "Yes"
    },
    {
      "key": "Brake compatible",
      "value": "Yes"
    },
    {
      "key": "Mode change without exit",
      "value": "Yes"
    },
    {
      "key": "Made in",
      "value": "Czechia"
    }
  ],
  "url": "https://www.mec.ca/en/product/6022-884/kingpin-13-bindings"
}