{
  "description": "<p>The legendary Kingpin Bindings use a conventional tech toe piece with an alpine-style heel that has no tech pins. The result is a lightweight frameless tech binding for resort skiing, touring or skiing lift-accessed sidecountry runs. A very stiff, carbon-reinforced front with wide footprint and ISI toe piece makes the binding easier to step into. The wide hole pattern and XXL power transmitters delivers direct power transmission for the utmost control and fun on the descent.</p><ul><li>Carbon reinforced toe is stiff and light</li><li>ISI Toe Piece intuitive step-in uses a wide platform and integrated stop to automatically position and align your boot</li><li>Pivot point is pushed toward the toe to let the foot roll naturally</li><li>Pins click directly into the boot to reduce lifting force required to walk</li><li>Toe springs offer great energy absorption, contact pressure and have high compression value</li><li>XXL Power Transmitter heel has contact points that are wide and far apart, so it holds the boot heel along a broad surface of the outer edge for direct power transmission to your ski</li><li>Anti Ice Pads in the base of the toe and heel prevent icing in critical areas</li><li>Brakes are self-locking in walk mode and activate when you switch to ski mode. Brakes are also removable</li><li>Release function is comparable to alpine bindings. Side release occurs at the heel. Toe releases when the heel does</li><li>2-position heel lifts operate with poles</li><li>Compatible with all ski boots featuring DIN ISO PinTech inserts. You don’t need tech fittings at the heel, but the ledge at the heel needs to be a standard ski boot shape or you’ll need an adapter (available separately)</li><li>Adjustable DIN ISO setting</li><li>Compatible with Kingpin Alpinist crampons (available separately)</li></ul>",
  "img_hrefs": [
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/50636/images/221875/6022885_BK048__03031.1667553073.1280.1280.jpg?c=1"
  ],
  "name": "Marker Kingpin 10 Bindings",
  "price_cents": 76995,
  "specs": [
    {
      "key": "Weight",
      "value": "1.39kg (100mm-125mm)"
    },
    {
      "key": "Ideal for",
      "value": [
        "Alpine touring",
        "Freeride and freeskiing"
      ]
    },
    {
      "key": "Boot/binding compatibility",
      "value": [
        "Tech"
      ]
    },
    {
      "key": "Maximum compatible brake",
      "value": "125mm"
    },
    {
      "key": "Release setting",
      "value": "5-10"
    },
    {
      "key": "Crampon compatible",
      "value": "Yes"
    },
    {
      "key": "Brake compatible",
      "value": "Yes"
    },
    {
      "key": "Mode change without exit",
      "value": "Yes"
    },
    {
      "key": "Made in",
      "value": "Czechia"
    }
  ],
  "url": "https://www.mec.ca/en/product/6022-885/kingpin-10-bindings"
}