{
  "description": "<p>This Scully 30 Dry Duffle is second quality as the snaps that hold the roll-top closure strips in places can sometimes break off. (you can still use the Duffle without the snaps, so we’re offering them at a discount for you to enjoy) Unstrapped from a roof rack, tossed in a cargo hold, and splashed onto the floor of a canoe – just another day for this rugged expedition dry bag. The rectangular shape is stable, stackable and makes it easy to find small items. The upper flap unzips to reveal a wide roll-top closure that can be sealed to keep water out, or strapped out of the way for use as a conventional duffle. Multiple lash points let you secure the Scully to any surface. The 30L version fits on a bike or motorcycle rack, and holds enough gear for minimalist overnights or day trips in unpredictable weather.</p><ul><li>Coated nylon fabric is super rugged and PVC-free</li><li>Top flap zipper has oversized pull loops to accommodate gloved hands or chilled fingers</li><li>Inside top flap has a zippered mesh pocket for quick-access items</li><li>Snaps hold the wide roll-top closure strips in place to ensure easy rolling and an effective seal</li><li>Purge valve allows air evacuation to make the bag as small as possible</li><li>Carrying options include top, side and end handles or comfortable, stow-away shoulder straps</li><li>All materials are PVC-free except for the purge valve, which is hard PVC. Hard PVC contains fewer eco-hazardous plasticizers than soft PVC, and is fully recyclable</li><li>Note: these dry bags do not provide submersible waterproof protection or impact protection. For electronics, we recommend hard cases with gasket seals</li><li>Rocksolid Guarantee still applies, however returns will not be accepted for missing snaps</li></ul>",
  "img_hrefs": [
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/52565/images/239967/6028402_BK000__61998.1690622792.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/52565/images/239977/6028402_BK000_ALT-OPEN__97561.1690363057.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/52565/images/239971/6028402_BK000_ALT-BACKPACK__08798.1690558133.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/52565/images/239981/6028402_OR007__35691.1690622793.1280.1280.jpg?c=1"
  ],
  "name": "MEC Scully 30 Dry Duffle *Seconds",
  "price_cents": 11996,
  "specs": [
    {
      "key": "Weight (Black)",
      "value": "770g"
    },
    {
      "key": "Weight (Zinnia)",
      "value": "770g"
    },
    {
      "key": "Ideal for",
      "value": [
        "Watersports",
        "Travel"
      ]
    },
    {
      "key": "Closure",
      "value": [
        "Roll-top and lid"
      ]
    },
    {
      "key": "Material",
      "value": [
        "PU-coated nylon"
      ]
    },
    {
      "key": "Ruggedness",
      "value": "Exceptional"
    },
    {
      "key": "Waterproofness",
      "value": "Waterproof"
    },
    {
      "key": "Submersible",
      "value": "No"
    },
    {
      "key": "Length",
      "value": "23cm"
    },
    {
      "key": "Width",
      "value": "47cm"
    },
    {
      "key": "Depth",
      "value": "29cm"
    },
    {
      "key": "Volume",
      "value": "30L"
    },
    {
      "key": "IPX rating",
      "value": "Not IPX rated"
    },
    {
      "key": "Made in",
      "value": "Philippines"
    }
  ],
  "url": "https://www.mec.ca/en/product/6028-402/scully-30-dry-duffle-*seconds"
}