{
  "description": "<p>An evolution of the first-generation Provincial Trail, this bike is here for your summer bike packing trips, weekend gravel grinds, and maybe even the odd cross or road race. If you're keen to leave traffic behind and explore gravel roads, the Provincial Trail 2 is the tool for the job. Built on fast rolling 700C wheels wearing 42mm wide tires, this bike delivers the grip and comfort of a gravel bike, and the potential speed of road bike. Equipped with SRAM’s gravel focused 12-speed Apex groupset, you get tons of mechanical advantage to help flatten out the climbs. By moving to a 1x12 drivetrain, we have removed a potential point of failure in the front, derailleur, giving you the durability enjoyed by mountain bikers for years. While the Provincial Trail Bike is outfitted with everything you need to go on your next gravel epic, turning this adventure bike into a Gran Fondo–capable one is quite easy. Get yourself a set of 700C slick tires and you'll maintain the same geometry you’re used to, but in an even faster package.</p><ul><li>Light and strong 6000-series aluminum frame has a stable trail-ready geometry</li><li>Internal cable routing uses alloy cable-stops that allow you to customize your setup and add a dropper post should you wish to do so</li><li>Carbon fibre fork with aluminum steerer features internal cable routing to keep things looking clean</li><li>Front fork features fender mounts and internal cable routing for a clean and snag-free look</li><li>Frame is equipped with eyelets for fenders, a rear rack, and 3 bottle cages for those long adventures</li><li>12x100mm thru-axle fork and 12x142mm frame makes it easy to switch between these adventure-ready wheels and road-specific ones</li><li>Frame and fork clearance allows for tires that measures up to 45mm in width</li><li>SRAM Apex 1x12 gruppo yields fast shifts and solid braking in a lightweight package</li><li>DoubleTap system, shifting up or down is done with a short sweep of your fingers</li><li>SRAM Apex hydraulic disc brakes provide outstanding power and modulation regardless of weather</li><li>SRAM Centerline 160mm rotors provide plenty of stopping power</li><li>SRAM Apex 1 crankset uses X-Sync™ chainring technology for excellent chain retention in rough terrain</li><li>WTB ST i23 rims are tubeless ready and designed for the rigours of gravel grinds</li><li>WTB Resolute tires are tubeless ready and have evenly spaced square lugs that bite into soft trails and clear mud with ease. Lugs carry up the sidewall for grip in corners and when running tubeless at lower pressures</li><li>MEC carbon fibre seat post and fork help soak up vibration for a comfortable ride</li><li>Fizik Terra Alpaca X5 is 145mm wide, comfortably cradling your sit bones on rough terrain and long rides</li><li>Bikes are covered by MEC's Rocksolid Guarantee and Bike Service Agreement. You can bring your bike to any MEC bike shop for free adjustments and minor maintenance for a year after purchase</li><li>MEC bikes are designed in Canada. Everything from the frames to the graphics are developed at the MEC Head Office in Vancouver, BC</li><li>Due to challenges with supply chain, components may be substituted for comparable parts at any time. The listed build is how MEC intended your bike to arrive, though the manufacturer may need to make a tweak or two to get you riding sooner</li></ul>",
  "img_hrefs": [
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/54769/images/255022/6015895_STR09__63363.1704361679.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/54769/images/255056/6015895_STR09_ALT-E__96923.1704361682.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/54769/images/255050/6015895_STR09_ALT-D__67892.1704361681.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/54769/images/255043/6015895_STR09_ALT-B__77768.1704361681.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/54769/images/255034/6015895_STR09_ALT-A__06941.1704361680.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/54769/images/255027/6015895_STR09_ALT-C__84299.1704361680.1280.1280.jpg?c=1"
  ],
  "name": "MEC Provincial Trail 2 Bicycle - Unisex",
  "price_cents": 279995,
  "specs": [
    {
      "key": "Ideal for",
      "value": [
        "Bikepacking",
        "Cycle touring",
        "Cyclocross",
        "Sport road cycling"
      ]
    },
    {
      "key": "Frame",
      "value": "MEC tapered 6061 aluminum"
    },
    {
      "key": "Fork",
      "value": "Carbon with aluminum steerer"
    },
    {
      "key": "Stem",
      "value": "Easton EA50 31.8mm"
    },
    {
      "key": "Seatpost",
      "value": "MEC carbon"
    },
    {
      "key": "Headset",
      "value": "FSA NO. 42-ACB"
    },
    {
      "key": "Handlebars",
      "value": "Easton EA50 31.8mm"
    },
    {
      "key": "Grips/tape",
      "value": "Velo Shockproof"
    },
    {
      "key": "Brakes",
      "value": [
        "SRAM Apex (hydraulic disc)"
      ]
    },
    {
      "key": "Brake levers",
      "value": "SRAM Apex"
    },
    {
      "key": "Shifters",
      "value": "SRAM Apex"
    },
    {
      "key": "Derailleur (front)",
      "value": "N/A"
    },
    {
      "key": "Derailleur (rear)",
      "value": "SRAM Apex"
    },
    {
      "key": "Crank + rings",
      "value": "SRAM Apex 40T"
    },
    {
      "key": "Bottom bracket",
      "value": "SRAM BB BSA"
    },
    {
      "key": "Pedals",
      "value": "Sold separately"
    },
    {
      "key": "Hub (front)",
      "value": "Formula CL-712"
    },
    {
      "key": "Hub (rear)",
      "value": "Formula RX-142"
    },
    {
      "key": "Cassette",
      "value": "SRAM PG 1231 XPLR 12-speed 11-44T"
    },
    {
      "key": "Chain",
      "value": "SRAM APEX"
    },
    {
      "key": "Spokes",
      "value": "DT Champion"
    },
    {
      "key": "Rims",
      "value": "WTB ST i23 TCS"
    },
    {
      "key": "Tires",
      "value": [
        "WTB Resolute Comp 700 x 42"
      ]
    },
    {
      "key": "Saddle",
      "value": "Fizik Terra Alpaca X5"
    },
    {
      "key": "Made in",
      "value": "Taiwan"
    }
  ],
  "url": "https://www.mec.ca/en/product/6015-895/provincial-trail-2-bicycle"
}