{
  "description": "<p>Designed around your next adventure, the Provincial Trail Bicycle is much more than a road bike with big tires. If you're keen to leave traffic behind and explore gravel roads, this bike is the tool for the job. Its geometry is designed around the 650b wheels and 47mm-wide tires to provide the comfort of bigger-volume tires without messing up the feel of the bike. From the height of the bottom bracket to the shaping of the 7000-series aluminum tubing, no detail was overlooked. Outfitted with Shimano's GRX  groupset, designed specifically for the demands of gravel riding. While the Provincial Trail Bike is outfitted with everything you need to go on your next gravel epic, turning this adventure bike into a Gran Fondo–capable one is quite easy. Get yourself a set of 700c road disc wheels with 28mm slick tires and you'll maintain the same bike geometry, but in a fast package that'll help you get your personal best.</p><ul><li>Light, strong and reliable 7005-series frame is built around a 650B wheelset for a stable and confidence-inspiring ride</li><li>Internal cable routing uses alloy cable-stops that allow you to customize your setup and add a dropper post should you wish to do so</li><li>Carbon fibre fork with aluminum steerer features internal cable routing to keep things looking clean</li><li>Front fork features fender mounts and internal cable routing for a clean and snag-free look</li><li>Frame is equipped with eyelets for fenders, a rear rack, and 3 bottle cages for those long adventures</li><li>12x100mm thru-axle fork and 12x142mm frame makes it easy to switch between these adventure-ready wheels and road-specific ones</li><li>Frame and fork clearance of 60mm allows for tires that measures up to 50mm in width</li><li>PF30 bottom bracket shell provides more room for internal cable routing and makes for a future-proof ride</li><li>Shimano 11-speed GRX drivetrain (600 and 800) pairs 46-30T chain rings with an 11-34T cassette</li><li>Shimano GRX 400 hydraulic disc brakes provide outstanding power and modulation regardless of weather</li><li>SLX 160mm rotors use Shimano’s ICE technology, sandwiching an aluminum core between 2 layers of stainless steel for greatly improved cooling, meaning more stopping power</li><li>GRX 46/30 crank is designed with tighter gear steps to make it easier to maintain and even cadence on the uneven terrain of gravel rides</li><li>650b Alex Boondocks 3 wheels are tubeless ready and designed for the rigours of gravel grinds</li><li>Kenda Alluvium Pro tires are tubeless ready and use a tread that has been designed to maximize handling and speed on mixed terrain, like unpaved roads or potholed city streets</li><li>MEC carbon fibre post soaks up vibration for a comfortable ride</li><li>Fizik Aliante R5 saddle helps keep the ride comfortable on long days</li><li>Bikes are covered by MEC's Rocksolid Guarantee and Bike Service Agreement. You can bring your bike to any MEC bike shop for free adjustments and minor maintenance for a year after purchase</li><li>MEC bikes are designed in Canada. Everything from the frames to the graphics are developed at the MEC Head Office in Vancouver, BC</li><li>Due to challenges with supply chain, components may be substituted for comparable parts at any time. The listed build is how MEC intended your bike to arrive, though the manufacturer may need to make a tweak or two to get you riding sooner</li></ul>",
  "img_hrefs": [
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/45380/images/218478/6011130_GRY23__40324.1663233173.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/45380/images/218503/6011130_GRY23_ALT-SHIFTER__77539.1663233175.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/45380/images/218500/6011130_GRY23_ALT-HANDLE__78623.1663233174.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/45380/images/218496/6011130_GRY23_ALT-DRIVETRAIN__01711.1663233174.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/45380/images/218492/6011130_GRY23_ALT-CRANK__89968.1663233173.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/45380/images/218484/6011130_GRY23_ALT-ANGLE__66746.1663233173.1280.1280.jpg?c=1"
  ],
  "name": "MEC Provincial Trail Bicycle - Unisex",
  "price_cents": 212494,
  "specs": [
    {
      "key": "Ideal for",
      "value": [
        "Bikepacking",
        "Cycle touring",
        "Cyclocross",
        "Sport road cycling"
      ]
    },
    {
      "key": "Frame",
      "value": "MEC Provincial Trail tapered 7005 aluminum"
    },
    {
      "key": "Fork",
      "value": "Carbon with aluminum steerer"
    },
    {
      "key": "Stem",
      "value": "FSA Gossamer"
    },
    {
      "key": "Seatpost",
      "value": "MEC carbon"
    },
    {
      "key": "Headset",
      "value": "FSA NO. 42-ACB"
    },
    {
      "key": "Handlebars",
      "value": "FSA Adventure Compact 31.8mm"
    },
    {
      "key": "Grips/tape",
      "value": "Velo Shockproof"
    },
    {
      "key": "Brakes",
      "value": [
        "Shimano GRX 400 (hydraulic disc)"
      ]
    },
    {
      "key": "Brake levers",
      "value": "Shimano GRX 600"
    },
    {
      "key": "Shifters",
      "value": "Shimano GRX 600"
    },
    {
      "key": "Derailleur (front)",
      "value": "Shimano GRX 800"
    },
    {
      "key": "Derailleur (rear)",
      "value": "Shimano GRX 800"
    },
    {
      "key": "Crank + rings",
      "value": "Shimano GRX 600 46-30T"
    },
    {
      "key": "Bottom bracket",
      "value": "FSA PF30"
    },
    {
      "key": "Pedals",
      "value": "Sold separately"
    },
    {
      "key": "Cassette",
      "value": "Shimano CS-HG700 11-speed 11-34T"
    },
    {
      "key": "Chain",
      "value": "Shimano HG601-11"
    },
    {
      "key": "Tires",
      "value": [
        "Kenda Alluvium Pro 650 x 45"
      ]
    },
    {
      "key": "Wheel",
      "value": "Alex Boondocks 3"
    },
    {
      "key": "Saddle",
      "value": "Fizik Aliante R5"
    },
    {
      "key": "Made in",
      "value": "Taiwan"
    }
  ],
  "url": "https://www.mec.ca/en/product/6011-130/provincial-trail-bicycle"
}