{
  "description": "<p>Sometimes you’re on a trail, sometimes you’re forging your own trails. Built for all-day comfort, these snowshoes are made for efficient travel and can also handle off-trail exploring. Heel lifts give you a boost on climbs, and extra rigidity built into the nose supports your strong kicksteps into the slope.</p><ul><li>ExoTract deck has steel around the perimeter for traction, and plastic as the deck material for flexibility and great performance in the cold</li><li>Updated HyperLink adjustable binding system has an intuitive and fast ratchet system that accommodates a wide range of boot sizes</li><li>EVA foam cushioned binding cradle eliminates pressure points</li><li>Pivot crampons are a single piece with 2 points for traction</li><li>Ergo Televator heel lifts reduce fatigue and improve traction while climbing, and are easily engaged with your pole</li><li>Compatible with MSR Revo Tails (sold separately) when you need additional flotation for heavier loads or less supportive snow</li><li>Low-profile, narrower bindings are ideal for women or those with a smaller feet</li></ul>",
  "img_hrefs": [
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/40157/images/168178/5055473_COR18__72142.1698784603.1280.1280.jpg?c=1"
  ],
  "name": "MSR Revo Explore Snowshoes - Women's",
  "price_cents": 35995,
  "specs": [
    {
      "key": "Weight (22in)",
      "value": "1.71kg"
    },
    {
      "key": "Weight (25in)",
      "value": "1.86kg"
    },
    {
      "key": "Ideal for",
      "value": [
        "General snowshoeing",
        "Mountain snowshoeing"
      ]
    },
    {
      "key": "Dimensions (22in)",
      "value": "8x22 in.in."
    },
    {
      "key": "Dimensions (25in)",
      "value": "8x25 in.in."
    },
    {
      "key": "Max recommended load (22in)",
      "value": "180lb."
    },
    {
      "key": "Max recommended load (25in)",
      "value": "120-210lb."
    },
    {
      "key": "Heel lift",
      "value": "Yes"
    },
    {
      "key": "Made in",
      "value": "United States of America"
    }
  ],
  "url": "https://www.mec.ca/en/product/5055-473/revo-explore-snowshoes"
}