{
  "description": "<p>A waist-worn tow system for sea kayakers, it features a bag that unfurls to almost flat and an internal anchor point offset from centre, so it doesn't bucket and retain water. It can be pulled in rapidly for fast reuse or repacking. The tow line has a pliable float, a shock absorbing system that can adjusted or removed, a large stainless steel carabiner and an internal secondary attachment that allows a variety of flexible towing solutions.</p><ul><li>Tow line pouch lays nearly flat when opened</li><li>Static floating H2Pro Line is 35ft. x ¼in</li><li>Mesh drainage prevents water collection and reduces drag, allowing fast retrieval after jettison</li><li>Attachment point for the rope/webbing allows the jettisoned bag to drag less in the water and as it's pulled back</li><li>Daisy chain loop allows the rope to be attached for a shorter tow</li><li>Pliable high-friction float can be moved or removed to accommodate towing more than one boat</li><li>Float can be slid up the line for multi-boat tows rather than tied off with an overhand knot to speed up tow rigging,</li><li>Shock-absorbing bungee is easily added or removed to either end of the tow rope. It can be opened and lengthened then hitched to reduce the force needed to engage it</li><li>Reflective details add visibility</li><li>External anchoring point allows immediate access to the carabiner</li></ul>",
  "img_hrefs": [
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/44113/images/176197/5036965_BK059__14991.1652865061.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/44113/images/175977/5036965_BK059_ALT-CLOSED__33018.1649187851.1280.1280.jpg?c=1"
  ],
  "name": "North Water Dynamic Tow Line Pro 35'",
  "price_cents": 16995,
  "specs": [
    {
      "key": "Weight",
      "value": "585g (Black/Yellow)"
    },
    {
      "key": "Ideal for",
      "value": [
        "Kayak touring"
      ]
    },
    {
      "key": "Rope length",
      "value": "10.67m"
    },
    {
      "key": "Rope diameter",
      "value": "6.4mm"
    },
    {
      "key": "Made in",
      "value": "Canada"
    }
  ],
  "url": "https://www.mec.ca/en/product/5036-965/dynamic-tow-line-pro-35'"
}