{
  "description": "<p>Bring another safety buffer on your backcountry winter endeavours. It's rigged with ski touring features so you can carry a helmet and skis, board or snowshoes, with a separate front compartment for your avi gear. A padded back panel and contoured hip fins offer comfort for touring and keep weight balanced and centred when it's time to make some turns. Plus, the airbag system can be activated again and again allowing you to practice activation before an emergency.</p><ul><li>LiTRIC™ supercapacitator system for powerful and repeatable airbag deployment in the event of an avalanche</li><li>High-speed supercapacitor rapidly inflates the airbag without the need for heavy canisters</li><li>Deployment system recharges via USB in approximately 25 minutes</li><li>One charge enables at least two activations with an operation time of approximately 60 hours</li><li>Zip On-System lets you attach various sizes of bags, each tailored to their intended use. (sold seperately)</li><li>Water resistant zippers keep snow out</li><li>Padded and shaped foam shoulder straps, hip fins and backpanel distribute the load</li><li>Safety accessory leg loop keep the pack in place during an avalanche</li><li>Large main compartment is accessed via C-shaped perimeter zipper</li><li>Dedicated front compartment holds your avalanche gear</li><li>Top accessory pocket has a key clip</li><li>Adjustable sternum strap with safety whistle</li><li>Lots of external carrying capacity: dual ice axe loops, rope, helmet holder, diagonal ski carry straps and webbing to hold a snowboard or snowshoes</li><li>Airbag system has a lightweight and compact design that removes and installs quickly</li><li>Ice axe and trekking pole loops</li><li>Airbag has welded seams, resistant to leaks and light compared to traditional sewn, seam-sealed designs</li><li>Release handle is height adjustable and ergonomically shaped so it's grab-able with gloves, and with either hand</li><li>Hydration system compatible. (reservoir sold separately)</li></ul>",
  "img_hrefs": [
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/54539/images/253144/6021692_DES10__47478.1700907400.1280.1280.jpg?c=1"
  ],
  "name": "Ortovox LITRIC TOUR 30 AVALANCHE BAG - Unisex",
  "price_cents": 167495,
  "specs": [
    {
      "key": "Weight",
      "value": "2.41kg (30L)"
    },
    {
      "key": "Ideal for",
      "value": [
        "Backcountry skiing",
        "Snowboarding",
        "Freeride and freeskiing"
      ]
    },
    {
      "key": "Access",
      "value": [
        "Front"
      ]
    },
    {
      "key": "Volume",
      "value": "30L"
    },
    {
      "key": "Carry-on sized",
      "value": "Yes"
    },
    {
      "key": "Carries",
      "value": [
        "Skis - A-frame",
        "Skis - diagonal",
        "Snowboard - A-frame",
        "Snowboard - vertical",
        "Snowshoes"
      ]
    },
    {
      "key": "Additional feature(s)",
      "value": [
        "Helmet attachment",
        "Ice axe/pole attachment",
        "Hydration compatible (reservoir sold separately)",
        "Compression straps",
        "Airbag included"
      ]
    },
    {
      "key": "Deployment System",
      "value": "High-speed fan"
    },
    {
      "key": "Made in",
      "value": "Viet Nam"
    }
  ],
  "url": "https://www.mec.ca/en/product/6021-692/litric-tour-30-avalanche-bag"
}