{
  "description": "<p>Don’t let a little dark get in the way of your next PB or adventure-race finish. With a night-defying output of up to 2800 lumens and 3 different beam patterns, the Duo RL has the power to remove the obstacle of darkness. Peztl’s reactive lighting technology adjusts your headlamp’s beam pattern and light output for you. An onboard sensor reads the ambient light of your environment and uses that info decide how bright your light should be. With reactive lighting you can let your light pick the right mode and you can stay focused on the trail. The rear-mounted battery pack has a remaining power display, so you always know how long you've got, and when it's time to recharge. IP67 dust and water protection means the Duo RL stands up to pretty much any weather you’re willing to suffer through.</p><ul><li>Reactive lighting customizes your headlamp’s output to best match your current conditions, from how bright the light is, to what type of beam it uses – flood light, spotlight or a combination</li><li>Reactive lighting sensor will also turn your light off for you when it detects there is enough ambient light</li><li>Maximum brightness mode fires up all LEDs at once, for 2800 lumens of dark-defying light</li><li>8 different modes, 5 constant light modes, 2 survival modes, and reactive mode</li><li>Customized beam patterns give you the right type of light for any activity, from close-up detail work (flood), to moving fast (mix of flood and spot), to scanning the distance (spot)</li><li>Rear-mounted battery pack balances out weight</li><li>Easily rechargeable battery pack has a 4-level power display</li><li>Battery recharges from empty in only 4 hours</li><li>Removeable battery pack makes it easy to swap to a spare in the field. Additional battery packs sold separately</li><li>Aluminum light head is rugged and dissipates heat quickly</li><li>IP67 dust and water protection means it handles rainstorms and puddles like a pro</li><li>Survival modes ensures you are not left in the dark, with up to 3 days or light at 20 lumens</li><li>Large control knob is easy to use with gloves on</li><li>Lockout mode prevents accidental activation</li><li>Includes the R2 Lithium-Ion rechargeable battery (3200mAh) and 110/240 V charger</li></ul>",
  "img_hrefs": [
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/50740/images/242090/6011856_NOC02__79115.1692437636.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/50740/images/222696/6011856_NOC02_ALT-C__24513.1669716580.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/50740/images/222694/6011856_NOC02_ALT-B__12409.1669716580.1280.1280.jpg?c=1"
  ],
  "name": "Petzl Duo RL Headlamp - Unisex",
  "price_cents": 103995,
  "specs": [
    {
      "key": "Ideal for",
      "value": [
        "Trail running",
        "Trail riding"
      ]
    },
    {
      "key": "Light modes",
      "value": "8 modes"
    },
    {
      "key": "Beam distance - low",
      "value": "16m"
    },
    {
      "key": "Beam distance - high",
      "value": "255m"
    },
    {
      "key": "Boost mode",
      "value": "No"
    },
    {
      "key": "Light source",
      "value": [
        "3 LEDs"
      ]
    },
    {
      "key": "Burn time - low",
      "value": "24 h"
    },
    {
      "key": "Burn time - high",
      "value": "1.5 h"
    },
    {
      "key": "Max light output",
      "value": "2800 lumens"
    },
    {
      "key": "Beam pattern",
      "value": [
        "Spot",
        "Wide"
      ]
    },
    {
      "key": "IPX rating",
      "value": "IP X7"
    },
    {
      "key": "Rechargeability",
      "value": "Rechargeable"
    },
    {
      "key": "Flash mode",
      "value": "No"
    },
    {
      "key": "Red light mode",
      "value": "No"
    },
    {
      "key": "Regulated output",
      "value": "Yes"
    },
    {
      "key": "Batteries",
      "value": "Lithium-ion 3200mAh (included)"
    },
    {
      "key": "Product sustainability",
      "value": [
        "Rechargeable batteries"
      ]
    },
    {
      "key": "Made in",
      "value": "France"
    }
  ],
  "url": "https://www.mec.ca/en/product/6011-856/duo-rl"
}