{
  "description": "<p>This pump-free system is gravity fed and offers a high-flow capacity. Fill the unfiltered water reservoir, raise, and hang it. You'll have 4L of clean water in under 3 minutes.</p><p>The fibres in this filter are slightly more brittle than other types. Although the cartridge is encased in a protective rubber shell, and drop-tested to seven feet, consider carrying a spare cartridge on long trips – they are small, light, and relatively inexpensive.</p><ul><li>Filters 4L of water in less than 3 minutes (depends on water quality)</li><li>Hollow fibre filter has a high surface-area that allows water to flow quickly through a 0.2 micron effective pore size</li><li>Do not allow the cartridge to freeze after initial use</li><li>Nominal 1500L filter life is for clear water, turbidity will reduce the useful life of any filter</li><li>Maintain a high flow rate in the field by holding the clean water reservoir above the unfiltered reservoir. No disassembly required</li><li>Unfiltered reservoir has a webbing handle for carrying and hanging. Quick-disconnect valve automatically cuts the flow of water when the hose is disconnected. Hose connection on the side won't collect silt and debris</li><li>Clean reservoir has a webbing loop and a simple hose connection, and no top zipper, so it won't pop open while in use</li><li>Reservoirs are made of silver ion-treated polyethylene film that doesn't pick up tastes</li><li>Clip-style shut-off valve on output hose between reservoirs</li><li>Silicone tubing</li></ul>",
  "img_hrefs": [
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/30877/images/132121/5035528_NOC02__20569.1652865029.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/30877/images/131952/5035528_NOC02_ALT-INSITU__70513.1649187809.1280.1280.jpg?c=1"
  ],
  "name": "Platypus GravityWorks 4.0L Filter System",
  "price_cents": 18495,
  "specs": [
    {
      "key": "Weight (No colour SKU)",
      "value": "326g"
    },
    {
      "key": "Weight (No Colour SKU 2024)",
      "value": "326g"
    },
    {
      "key": "Ideal for",
      "value": [
        "Camping and hiking"
      ]
    },
    {
      "key": "Filter type",
      "value": "Hollow fibre technology"
    },
    {
      "key": "Filter size",
      "value": "0.2microns"
    },
    {
      "key": "Cartridge life",
      "value": "1500L"
    },
    {
      "key": "Output",
      "value": "1.75L/min"
    },
    {
      "key": "Dimensions",
      "value": "4.5 x 14.7cm"
    },
    {
      "key": "Effective against viruses",
      "value": "No"
    },
    {
      "key": "Effective against particulate",
      "value": "Yes"
    },
    {
      "key": "Effective against protozoa",
      "value": "Yes"
    },
    {
      "key": "Effective against bacteria",
      "value": "Yes"
    },
    {
      "key": "Made in",
      "value": "United States of America"
    }
  ],
  "url": "https://www.mec.ca/en/product/5035-528/gravityworks-4.0l-filter-system"
}