{
  "description": "<p>If you've ever thought about taking your hiking two wheels, this reliable hardtail is a great place to start. From exploring your local trails, to checking out the local cross-country scene, the Xtrada 7 is capable and comfortable. Outfitted with SR Suntour front suspension, you get the best of both worlds, with a lockout for the climbs and rebound adjustment for the descents. The 12-speed Shimano Deore drivetrain has plenty of mechanical advantage, making even the steepest climbs a little less miserable. From its modern geometry, to its grippy WTB tires, this hardtail is a solid way to start exploring the world of mountain biking.</p><ul><li>ALX Alloy frame is uses hydro-formed, triple butted 6061 aluminum that has been heat treated for improved strength and durability</li><li>Tapered head tube broadens towards the bottom leading to better force transfer from the fork to the frame. The increased stiffness of the tapered head tube provides improved handling</li><li>SR Suntour front for has 120mm of air-sprung travel, a lockout for climbing and rebound adjustment for that glued to the ground feeling</li><li>Shimano Deore 1 x 12 drivetrain is rugged, reliable, and affordable, providing fast accurate shifts even in rough terrain</li><li>Shimano hydraulic disc brakes offer precise speed control in all conditions</li><li>Internal cable routing keeps your cables safe from trail hazards and has a nice clean look</li><li>Polygon’s wheel fit system equips small bikes with 27.5in. wheels, and medium to extra large bikes with 29in. wheels. Polygon feels this balance offers the rider the most efficient power delivery and ergonomics for their size</li><li>Entity XL2 aluminum wheels are tubeless ready</li><li>Boost rear hub spacing offers improved rigidity and strength, and paves the way for easy upgrades down the road</li><li>WTB Trail Boss tires use aggressive, directional lugs that offer low rolling resistance, but dig in under breaking and cornering. These tires excel on loose terrain and packed dirt</li><li>Short chainstays make the bike feel nimble on the trail and flickable in the corners</li><li>Bikes are covered by MEC's Rocksolid Guarantee and Bike Service Agreement. You can bring your bike to any MEC bike shop for free adjustments and minor maintenance for a year after purchase</li><li>Based in Indonesia, Polygon has been making bikes for more than 25 years. Polygon makes all of their own frames in-house, allowing them to control the design and construction of their bikes from inception to shipping. You will find Polygons ridden in the Red Bull Rampage, UCI Downhill World Cup, and other major mountain bike events all around the world</li><li>Due to challenges with supply chain, components may be substituted for comparable parts at any time. The listed build is how MEC intended your bike to arrive, though the manufacturer may need to make a tweak or two to get you riding sooner</li></ul>",
  "img_hrefs": [
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/48682/images/206949/6019470_PUW00__38267.1652864923.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/48682/images/206942/6019470_PUW00_ALT-C__98745.1651828081.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/48682/images/206935/6019470_PUW00_ALT-B__17768.1651828080.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/48682/images/206927/6019470_PUW00_ALT-A__98638.1651828080.1280.1280.jpg?c=1"
  ],
  "name": "Polygon Xtrada 7 Bike - Unisex",
  "price_cents": 115994,
  "specs": [
    {
      "key": "Ideal for",
      "value": [
        "Cross-country riding",
        "Trail riding"
      ]
    },
    {
      "key": "Frame",
      "value": "Polygon ALX XC Trail 6061 aluminum"
    },
    {
      "key": "Fork",
      "value": "SR Suntour XCR 32 AIR LOR"
    },
    {
      "key": "Front travel",
      "value": "120mm"
    },
    {
      "key": "Stem",
      "value": "Entity Expert 31.8mm"
    },
    {
      "key": "Seatpost",
      "value": "Entity Expert 27.2mm"
    },
    {
      "key": "Headset",
      "value": "ZS Tapered"
    },
    {
      "key": "Handlebars",
      "value": "Entity Expert 31.8mm"
    },
    {
      "key": "Grips/tape",
      "value": "Polygon"
    },
    {
      "key": "Brakes",
      "value": [
        "Shimano BR-MT201 (hydraulic disc)"
      ]
    },
    {
      "key": "Brake levers",
      "value": "Shimano MT201 Disc"
    },
    {
      "key": "Shifters",
      "value": "Shimano Deore SL"
    },
    {
      "key": "Derailleur (front)",
      "value": "N/A"
    },
    {
      "key": "Derailleur (rear)",
      "value": "Shimano Deore"
    },
    {
      "key": "Crank + rings",
      "value": "Shimano Deore 32T"
    },
    {
      "key": "Bottom bracket",
      "value": "BSA"
    },
    {
      "key": "Pedals",
      "value": "Plastic flats"
    },
    {
      "key": "Cassette",
      "value": "Shimano Deore 12-speed 10-51T"
    },
    {
      "key": "Chain",
      "value": "KMC X12"
    },
    {
      "key": "Spokes",
      "value": "Stainless"
    },
    {
      "key": "Tires",
      "value": [
        "WTB Trail Boss 27.5 x 2.25",
        "WTB Trail Boss 29 x 2.25"
      ]
    },
    {
      "key": "Wheel",
      "value": "Entity XL2"
    },
    {
      "key": "Saddle",
      "value": "Entity Void"
    },
    {
      "key": "Made in",
      "value": "Indonesia"
    }
  ],
  "url": "https://www.mec.ca/en/product/6019-470/xtrada-7-bike"
}