{
  "description": "<p>If pumping into berms and hucking off drops brings a smile to your face, this well specced full-suspension bike is worth a look. Designed to meet the needs of the modern trail rider, the Siskiu T8 doesn't shy away from the gnar. Outfitted with Fox suspension both front and rear, this bike stays glued to the ground through rollers and techie rock gardens. The SLX drivetrain enjoys many of the benefits seen on its XT sibling – like a rear derailleur clutch and 2-way release shifters – but comes in at a fraction of the cost and weight. Powerful 4-piston brakes from Tektro keep your velocity exactly where you want it, so those screaming descents don't have to be so screaming.  And, dialed in geometry delivers a natural riding position that feels great in the climbs, and is confidence inspiring in the descents.</p><ul><li>Fox 34 Rhythm front fork with the Grip damper has three settings: open for descending, medium for flowy flats, and firm for climbing. With 10 clicks of low-speed rebound adjustment you can set your preferred tracking</li><li>Fox float DPS rear shock is custom tuned to match the Siskiu T8’s geometry and Polygon’s Faux Bar linkage. DPS damper settings: open, medium, and firm</li><li>One piece suspension linkage increases stiffness while reducing weight. Delivering a ride that is poppy and supportive, with excellent small bump compliance, yet is still efficient in the climbs</li><li>12-speed Shimano SLX drivetrain is rugged, reliable, and lighter than Deore counterpart</li><li>Tektro Orion 4-piston brakes offer plenty of stopping power and precise speed control in all conditions</li><li>Tektro Orion levers have adjustable reach</li><li>ALX Alloy frame is uses hydro-formed, triple butted 6061 aluminum that has been heat treated for improved strength and durability</li><li>FWG frame geometry optimized for aggressive trail riding, steep descents, and comfortable climbs</li><li>Tapered head tube broadens at the bottom for better force transfer from fork to frame, plus stiffness to improve handling</li><li>Internal cable routing keeps your cables safe from trail hazards and has a nice clean look</li><li>Wheel fit system equips small bikes with 27.5in. wheels, and medium to extra large bikes with 29in. wheels. Polygon feels this balance offers the rider the most efficient power delivery and ergonomics for their size</li><li>Suspension travel varies by size, with the 29in. having 140mm of travel up front and 135mm of rear travel, and the 27.5in. 150mm of travel up front and 140mm of rear travel</li><li>Tranz-X dropper posts with internal cable routing, give you somewhere to sit when you need it and get your seat out of the way when you don't. 29in. – 170mm drop. 27.5in. – 150mm drop</li><li>Entity XL2 aluminum wheels are tubeless ready</li><li>Boost hub spacing offers improved rigidity and strength, and paves the way for easy upgrades down the road</li><li>Short chainstays make the bike feel nimble on the trail and flickable in the corners</li><li>Bikes are covered by MEC's Rocksolid Guarantee and Bike Service Agreement. You can bring your bike to any MEC bike shop for free adjustments and minor maintenance for a year after purchase</li><li>Based in Indonesia, Polygon has been making bikes for more than 25 years. All frames are made in-house, so design and construction are controlled from inception to shipping. You'll see them ridden in the Red Bull Rampage, UCI Downhill World Cup, and major mountain bike events around the world</li><li>Due to challenges with supply chain, components may be substituted for comparable parts at any time. The listed build is how MEC intended your bike to arrive, though the manufacturer may need to make a tweak or two to get you riding sooner</li></ul>",
  "img_hrefs": [
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/48689/images/236788/6019468_CHA00__88121.1695115723.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/48689/images/236807/6019468_CHA00_ALT-E__75290.1686214495.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/48689/images/236805/6019468_CHA00_ALT-D__41998.1686214495.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/48689/images/236804/6019468_CHA00_ALT-C__17505.1686214494.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/48689/images/236801/6019468_CHA00_ALT-B__07414.1686214493.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/48689/images/236796/6019468_CHA00_ALT-A__51621.1686214492.1280.1280.jpg?c=1"
  ],
  "name": "Polygon Siskiu T8 Bike - Unisex",
  "price_cents": 299995,
  "specs": [
    {
      "key": "Weight",
      "value": "15.2kg (Medium)"
    },
    {
      "key": "Ideal for",
      "value": [
        "Trail riding",
        "Enduro",
        "Cross-country riding"
      ]
    },
    {
      "key": "Frame",
      "value": "Polygon ALX Trail 6061 aluminum"
    },
    {
      "key": "Fork",
      "value": "Fox Rhythm 34"
    },
    {
      "key": "Rear shock",
      "value": "Fox Float DPS 3 Pos"
    },
    {
      "key": "Stem",
      "value": "Entity Expert 35mm"
    },
    {
      "key": "Seatpost",
      "value": "TranzX dropper 150mm travel"
    },
    {
      "key": "Headset",
      "value": "ZS Tapered"
    },
    {
      "key": "Handlebars",
      "value": "Entity Expert 35mm"
    },
    {
      "key": "Grips/tape",
      "value": "Polygon"
    },
    {
      "key": "Brakes",
      "value": [
        "Tektro HD-M745 (hydraulic disc)"
      ]
    },
    {
      "key": "Brake levers",
      "value": "Tektro"
    },
    {
      "key": "Shifters",
      "value": "Shimano SLX"
    },
    {
      "key": "Derailleur (front)",
      "value": "N/A"
    },
    {
      "key": "Derailleur (rear)",
      "value": "Shimano SLX"
    },
    {
      "key": "Crank + rings",
      "value": "Shimano Deore 32T"
    },
    {
      "key": "Bottom bracket",
      "value": "BSA"
    },
    {
      "key": "Pedals",
      "value": "Sold separately"
    },
    {
      "key": "Cassette",
      "value": "Shimano SLX 12-speed 10-51T"
    },
    {
      "key": "Chain",
      "value": "KMC X12"
    },
    {
      "key": "Spokes",
      "value": "Stainless"
    },
    {
      "key": "Wheel",
      "value": "Entity XL2"
    },
    {
      "key": "Saddle",
      "value": "Entity Xtent"
    },
    {
      "key": "Made in",
      "value": "Indonesia"
    }
  ],
  "url": "https://www.mec.ca/en/product/6019-468/siskiu-t8-bike"
}