{
  "description": "<p>Dialing in the perfect fit is just cooler than tying a bow, and there are no laces to get attacked by hungry chainrings. Outfitted with the BOA fit system, getting your shoes on is as easy as fitting our helmet; slip on, click into place, and roll out. The Tallac are clip-in trail shoes that don’t look like they’re part of a whole Spandex outfit. Designed to work with 2-hole cleat, these shoes are comfy on and off the bike. Rugged construction can handle dropping into the gnarliest rock gardens, and even the odd pedal bite (better the shoe than you). A stiff shank and deep cleat box offer excellent power transfer on the ups and the downs, and provides a confident connection when things get techie, or airborne.</p><ul><li>BOA® fit system and strap for dialing in the perfect fit</li><li>Deep cleat box has a ramped entry and exit, making sure nothing gets between you and clipping in</li><li>Cleat box has index marking for dialing in the perfect cleat placement</li><li>Tough Cordura® uppers dry quickly and let your feet breathe</li><li>Added TPU protection at the base of the shoe</li><li>Hook-and-loop strap across the laces help hold your foot in</li><li>Elastic lace pouch keeps your laces out of your drivetrain</li><li>D3O® zone tech insoles add extra protection under the heel and ball of the foot</li><li>Antibacterial mesh helps keep the funk to a minimum</li><li>Fully gusseted tongue keeps debris out</li><li>Low-volume design with tailored padding around the toe and collar</li><li>Stiffer platform and wider toe box for improved efficiency and comfort</li><li>Works with SPDs and Crank Brothers cleats</li><li>Stiff shank for maximized power transfer</li><li>Deeply lugged sole with reverse lugs at the heel and toe for comfortable walking and traction while hike-a-biking</li></ul>",
  "img_hrefs": [
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/52330/images/237665/6019937_EAH02__73959.1698485896.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/52330/images/237663/6019937_EAH02_ALT-D__64734.1698485910.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/52330/images/237662/6019937_EAH02_ALT-C__38701.1698485906.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/52330/images/237660/6019937_EAH02_ALT-B__06154.1698485903.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/52330/images/237658/6019937_EAH02_ALT-A__18419.1698485899.1280.1280.jpg?c=1"
  ],
  "name": "Ride Concepts Tallac Clip BOA Cycling Shoes - Men's",
  "price_cents": 17993,
  "specs": [
    {
      "key": "Ideal for",
      "value": [
        "Enduro",
        "Trail riding",
        "Freeride and downhill riding"
      ]
    },
    {
      "key": "Upper material",
      "value": [
        "Nylon",
        "Polyurethane"
      ]
    },
    {
      "key": "Outsole",
      "value": [
        "Rubber"
      ]
    },
    {
      "key": "Pedal compatibility",
      "value": [
        "2-hole clipless"
      ]
    },
    {
      "key": "Waterproof",
      "value": "No"
    },
    {
      "key": "Made in",
      "value": "China"
    }
  ],
  "url": "https://www.mec.ca/en/product/6019-937/tallac-clip-boa-cycling-shoes"
}