{
  "description": "<p>Give your world a soundtrack without blocking it out. A solid playlist provides that extra bit of energy you need to train at your best, but it's not always safe to focus entirely on your music. Bone conduction technology sends sound vibrations directly to your inner ear, leaving your ear canal free to take in the world around you. OpenMove headphones let you listen to music and make and answer phone calls without interrupting your workout, and their dual inline microphones filter out noise pollution to deliver clear calls in nearly any environment.</p><ul><li>Bone conduction sends sound vibrations directly to your inner ear. This leaves your ear canal free and clear so you can hear your music as well as what's going on around you</li><li>PremiumPitch 2.0™ 7th generation bone conduction technology produces crisp clear sound and bass you can feel</li><li>Dual noise-cancelling microphones help remove noise pollution, making voices crisp and clear</li><li>Equalizer pre-sets help you fine-tune your listening experience</li><li>Titanium band is lightweight, strong and provides an even, comfortable pressure</li><li>Bluetooth 5.1 is easy on your battery, has multi-point pairing and a 40m range</li><li>IP55 weatherproofing shrugs off sweat, rain, and almost everything else Mother Nature might throw at you</li><li>6 hours of playback or 10 days of stand-by from a single charge</li><li>Integrated USB-C charging, fully charges in 2 hours (1A/5V max)</li><li>LED power indicator lets you know how your battery is doing</li><li>Integrated buttons let you answer calls, control your music and more</li><li>In the box: headphones, storage pouch, earplugs, USB-C charging cable and documentation</li></ul>",
  "img_hrefs": [
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/48212/images/203128/6022624_GRY00__66166.1652865012.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/48212/images/203124/6022624_GRY00_ALT-D__16398.1649187798.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/48212/images/203114/6022624_GRY00_ALT-C__92015.1649187796.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/48212/images/203106/6022624_GRY00_ALT-B__78452.1649187795.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/48212/images/203097/6022624_GRY00_ALT-A__29631.1649187793.1280.1280.jpg?c=1"
  ],
  "name": "Shokz OpenMove Headphones",
  "price_cents": 9995,
  "specs": [
    {
      "key": "Ideal for",
      "value": [
        "Fitness and training",
        "Running",
        "Everyday use"
      ]
    },
    {
      "key": "Microphone",
      "value": [
        "Internal mic"
      ]
    },
    {
      "key": "Frequency response",
      "value": "20Hz-20kHz"
    },
    {
      "key": "Inline control",
      "value": "Yes"
    },
    {
      "key": "Bluetooth",
      "value": "Yes"
    },
    {
      "key": "Product sustainability",
      "value": [
        "Rechargeable batteries"
      ]
    },
    {
      "key": "Made in",
      "value": "China"
    }
  ],
  "url": "https://www.mec.ca/en/product/6022-624/openmove-headphones"
}