{
  "description": "<p>Smaller size, bigger sound. At 20% smaller than any other headphone in the Shokz line, the OpenRun Pro are forgettably comfortable. Bone conduction technology lets you hear your music and your world. The streamlined design makes room for dual bass enhancers, so you can feel your workout playlist. The OpenRun design has proven itself, with users loving its comfort and stability when on the move. Carefully aimed transducers provide improved sound quality, with natural sounding highs and impactful bass. The right track can get you closer to your next PR, but it is not always safe to hear only your tunes. That is where bone conduction headphones come in, sound vibrations are sent directly to your inner ear, leaving your ear canal clear to take in the world around you.</p><ul><li>Bone conduction sends sound vibrations directly to your inner ear. This leaves your ear canal free and clear, letting your music be the soundtrack to your world, not all that you hear</li><li>TurboPitch™ 9th generation bone conduction technology produces the most natural sound yet and improves low-frequency bass</li><li>Dual noise cancelling microphones help remove noise pollution, making voices crisp and clear</li><li>Titanium band is lightweight, strong and provides an even, comfortable pressure</li><li>Bluetooth 5.1 is easy on your battery, has multi-point pairing and a 10m range</li><li>IP55 water resistance isn’t bothered by sweat, rain or anything else Mother nature might throw at you</li><li>10 hours of playback or 12 days of stand-by from a single 1.5 hour charge</li><li>Quick charge gives you 90 minutes of music with just a 5 minute charge</li><li>Included magnetic charging cable fully charges in 2 hours</li><li>LED power indicator lets you know how your battery is doing</li><li>Integrated buttons let you answer calls, control your music and more</li><li>In the box: headphones, carrying case, magnetic USB charging cable and documentation</li></ul>",
  "img_hrefs": [
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/48239/images/203025/6022623_BK000__77402.1652865012.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/48239/images/203022/6022623_BK000_ALT-E__15664.1649187799.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/48239/images/203019/6022623_BK000_ALT-D__53762.1649187798.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/48239/images/203015/6022623_BK000_ALT-C__46865.1649187796.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/48239/images/203012/6022623_BK000_ALT-B__92070.1649187795.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/48239/images/203010/6022623_BK000_ALT-A__54279.1649187793.1280.1280.jpg?c=1"
  ],
  "name": "Shokz OpenRun Pro Headphones",
  "price_cents": 22995,
  "specs": [
    {
      "key": "Ideal for",
      "value": [
        "Fitness and training",
        "Running",
        "Everyday use"
      ]
    },
    {
      "key": "Microphone",
      "value": [
        "Internal mic"
      ]
    },
    {
      "key": "Frequency response",
      "value": "20Hz-20kHz"
    },
    {
      "key": "Inline control",
      "value": "Yes"
    },
    {
      "key": "Bluetooth",
      "value": "Yes"
    },
    {
      "key": "Product sustainability",
      "value": [
        "Rechargeable batteries"
      ]
    },
    {
      "key": "Made in",
      "value": "China"
    }
  ],
  "url": "https://www.mec.ca/en/product/6022-623/openrun-pro-headphones"
}