{
  "description": "<p>Hear your music and your world. Tipping the scales at only 26g the OpenRun are Shokz lightest pair of bone conduction headphones to date. Refined design streamlines the chassis for increased comfort and stability when on the go. By adjusting the angles on the transducers, the OpenRun deliver improved sound quality, with higher highs and thumping bass. The right track can get you closer to your next PR, but it is not always safe to hear only your tunes. That is where bone conduction headphones come in, sound vibrations are sent directly to your inner ear, leaving your ear canal clear to take in the world around you.</p><ul><li>Bone conduction sends sound vibrations directly to your inner ear. This leaves your ear canal free and clear, letting your music be the soundtrack to your world, not all that you hear</li><li>PremiumPitch 2.0+™ 8th generation bone conduction technology produces deep immersive sound and bass you can feel</li><li>Dual noise cancelling microphones help remove noise pollution, making voices crisp and clear</li><li>Titanium band is lightweight, strong and provides an even, comfortable pressure</li><li>Bluetooth 5.1 is easy on your battery, has multi-point pairing and a 10m range</li><li>Waterproof design isn’t bothered by sweat, rain or anything else Mother nature might throw at you</li><li>8 hours of playback or 10 days of stand-by from a single charge</li><li>Quick charge gives you 90 minutes of music with just a 10 minute charge</li><li>Included magnetic charging cable fully charges in 2 hours</li><li>LED power indicator lets you know how your battery is doing</li><li>Integrated buttons let you answer calls, control your music and more</li><li>In the box: headphones, storage pouch, magnetic USB charging cable and documentation</li></ul>",
  "img_hrefs": [
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/48215/images/203120/6022619_BK000__80851.1652865012.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/48215/images/203110/6022619_BK000_ALT-D__40389.1649187798.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/48215/images/203094/6022619_BK000_ALT-C__06997.1649187796.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/48215/images/203087/6022619_BK000_ALT-B__55788.1649187795.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/48215/images/203077/6022619_BK000_ALT-A__87895.1649187793.1280.1280.jpg?c=1"
  ],
  "name": "Shokz OpenRun Headphones",
  "price_cents": 16995,
  "specs": [
    {
      "key": "Ideal for",
      "value": [
        "Fitness and training",
        "Running",
        "Everyday use"
      ]
    },
    {
      "key": "Microphone",
      "value": [
        "Internal mic"
      ]
    },
    {
      "key": "Frequency response",
      "value": "20Hz-20kHz"
    },
    {
      "key": "Inline control",
      "value": "Yes"
    },
    {
      "key": "Bluetooth",
      "value": "Yes"
    },
    {
      "key": "Product sustainability",
      "value": [
        "Rechargeable batteries"
      ]
    },
    {
      "key": "Made in",
      "value": "China"
    }
  ],
  "url": "https://www.mec.ca/en/product/6022-619/openrun-headphones"
}