{
  "description": "<p>Enjoy your favourite playlists, without shutting off the world. Like Shockz other earphones, the OpenFit let you hear your music and your environment, it’s like having a custom soundtrack.  However, unlike Shockz previous earphones, the OpenFit don’t use bone conduction. Each earphone contains a custom speaker that focuses your music right into your ear. This compact speaker design delivers immersive sound quality with crisp highs and thumping lows. And the free Shockz app even lets you customize the equalizer; so you can have one sound profile for podcasts and another for your Eye of the Tiger playlist.</p><ul><li>Ultralight design, only 8.4g per ear, keeps things comfortable during long listening sessions</li><li>DirectPitch™ focuses sound directly into your ear canal, resulting in clean sound and rich bass</li><li>Focused speaker design keeps your music, yours, without sharing it with those around you</li><li>18x11mm custom drivers used carbon fibre to keep weight low and sound precise</li><li>Dual noise cancelling microphones help remove noise pollution, making voices crisp and clear</li><li>Silicone ear cushion provides a soft and secure fit</li><li>Dolphin ear hook has an internal memory wire that provides an ergonomic fit with gentle pressure on the back of the ear</li><li>Bluetooth 5.2 is easy on your battery, has multi-point pairing and a 10m range</li><li>IP54 water resistance isn’t bothered by sweat, rain or anything else Mother nature might throw at you. Case is not water resistant</li><li>Up to 7 hours of music or talk time, and the carrying case charges the earphones for another 21 hours</li><li>10 hours of standby time</li><li>Charge times from 0% to 100%: earphones = 1 hour, case = 2h</li><li>Case charges via USB-C</li><li>Quick charge gives you 60 minutes of music with just a 5 minute charge</li><li>Free Shockz app lets you customize your earphone’s sound profile and set personal EQ modes</li><li>LED power indicator lets you know how your battery is doing</li><li>Integrated buttons let you answer calls, control your music and more</li><li>In the box: earphones, charging carrying case, USB-C charging cable and documentation</li></ul>",
  "img_hrefs": [
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/52611/images/240527/6028050_BK000__07325.1691052836.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/52611/images/240525/6028050_BK000_ALT-F__64867.1691052836.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/52611/images/240520/6028050_BK000_ALT-E__67180.1691052835.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/52611/images/240516/6028050_BK000_ALT-D__54577.1691052834.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/52611/images/240512/6028050_BK000_ALT-B__74454.1691052834.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/52611/images/240508/6028050_BK000_ALT-A__35870.1691052833.1280.1280.jpg?c=1"
  ],
  "name": "Shokz OpenFit",
  "price_cents": 22995,
  "specs": [
    {
      "key": "Weight (Beige)",
      "value": "74g"
    },
    {
      "key": "Weight (Black)",
      "value": "74g"
    },
    {
      "key": "Ideal for",
      "value": [
        "Fitness and training",
        "Running",
        "Everyday use"
      ]
    },
    {
      "key": "Microphone",
      "value": [
        "Internal mic"
      ]
    },
    {
      "key": "Frequency response",
      "value": "50Hz-16kHz"
    },
    {
      "key": "Inline control",
      "value": "Yes"
    },
    {
      "key": "Bluetooth",
      "value": "Yes"
    },
    {
      "key": "Product sustainability",
      "value": [
        "Rechargeable batteries"
      ]
    },
    {
      "key": "Made in",
      "value": "China"
    }
  ],
  "url": "https://www.mec.ca/en/product/6028-050/openfit"
}