{
  "description": "<p>For focused workouts that yield results, you can't beat the consistency and accuracy of power-based training. And this unit is as low-profile and lightweight as a power meter gets – 15 grams, with a minimal housing and sleek front profile. You can expect wattage readings to be accurate within 1.5%. ANT+ and Bluetooth Smart compatibility make it good to go with pretty much any major GPS or cycling computer on the planet. Using a compact, easy-to-source coin cell battery, its battery life is over 200+ hours, and you can swap it out quickly without tools.</p><ul><li>Comes pre-mounted to Shimano's Ultegra R8000 non-drive crank arm. Be sure to select the correct length</li><li>Compatible with all Shimano Hollowtech II road drivetrains</li><li>Same low-profile case as the previous version, with upgraded electronics for improved signal strength</li><li>LED indicator displays battery level at start up and confirms calibration</li><li>Fully sealed unit with IPX 7 waterproofing</li><li>Power is measured in kilograms via strain gages and mathematically converted to Watts</li><li>Active temperature compensation allows accurate readings regardless of weather</li><li>Accelerometer-based cadence readings keep your bike free of wires, magnets, zip-ties and other hardware</li><li>Specifications: accuracy: ± 1.5%, power range (Watts): 0 to 5000, cadence range (rpm): 10-220</li><li>Wireless firmware upgrades keep the unit future-proof</li><li>ANT+ and Bluetooth Smart compatibility</li><li>Software compatibility: Stages Link, Training Peaks, Strava, Garmin Training Center and others</li><li>CR2032 battery lasts 200+ hours and is user-replaceable without tools</li><li>Fits most bike frames; check Stages fit guide for details</li></ul>",
  "img_hrefs": [
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/16625/images/75048/5060797_GRY00__07081.1652864979.1280.1280.jpg?c=1"
  ],
  "name": "Stages Power LFT Ultegra R8000 Power Meter",
  "price_cents": 53995,
  "specs": [
    {
      "key": "Weight (172.5 mm)",
      "value": "15g"
    },
    {
      "key": "Weight (172.5mm)",
      "value": "15g"
    },
    {
      "key": "Ideal for",
      "value": [
        "Road cycling",
        "Cycle training"
      ]
    },
    {
      "key": "Length (170mm)",
      "value": "170cm"
    },
    {
      "key": "Length (175mm)",
      "value": "175cm"
    },
    {
      "key": "Length (172.5 mm)",
      "value": "172.5cm"
    },
    {
      "key": "Length (172.5mm)",
      "value": "172.5cm"
    },
    {
      "key": "Bottom bracket included",
      "value": "No"
    },
    {
      "key": "Made in",
      "value": "United States of America"
    }
  ],
  "url": "https://www.mec.ca/en/product/5060-797/power-lft-ultegra-r8000-power-meter"
}