{
  "description": "<p>Loaded with more than 80 activity profiles, the Spartan is ready to push limits. With an optical heartrate monitor, information comes straight off your wrist, and the included Smart Sensor monitor adds a new level of precision to your training data.  Internal GPS provides speed and distance information, while an accelerometer translates your movement into performance enhancing data. Connecting to both standard GPS and GLONASS satellites, you get a fast and accurate signal. When paired with a compatible smartphone running the Movescount app, the Spartan’s capabilities are greatly increased.  Through Movescount you can transfer completed activities, receive smart notifications, plan routes using heatmap information, and more. Heatmaps are one of the coolest features of the Spartan line.  They display other Movescount user’s activities over local maps, making it easier to find the best runs, rides, trails, or swims, wherever you are.  Activity tracker functionality keeps track of your steps and gives you an estimate of calories burnt throughout the day. Taking all activity into consideration when calculating recovery times and tracking progress.</p><ul><li>Valencell’s optical heartrate monitor provides reliable constant heartrate data, and allows you to train without a chest strap</li><li>Optical heartrate sensors measure changes in blood volume under the skin, and work best when worn snuggly, 1 to 3 finger-widths above your wrist bone</li><li>Spot check your heartrate and receive a graph of 10 minutes or 12 hours of heart data. During activity heartrate data is collected every second</li><li>Includes Suunto Smart Sensor to capture precise heart data</li><li>Smart sensor stores heart rate data when underwater; forwarding this data to your Spartan Sport once you are out of the water</li><li>Movescount web interface allows customization of modes and display, as well as competition and comparison of activities with other Movescount users, letting you race against friends from all over the world</li><li>Movescount enables sharing your metrics with coaches and personal trainers, opening up a whole world of digital training plans and tips</li><li>Keeps track of your up-to-date on your personal bests by sport.  As well as showing progress trends for activities like: running, cycling, swimming, and many more, seeing trends is a quick and easy way to gauge the effectiveness of your training</li><li>Loaded with 80 different sport modes, from running, swimming, cycling and many more, there is a sport specific mode for nearly every activity</li><li>FusedSpeed™ combines GPS and accelerometer data to provide a more stable running pace</li><li>24/7 activity tracking provides a daily step goal and estimate of calories burnt</li><li>Breadcrumb style navigation tracks your route, which you can overlay in a variety of map apps.  You can even download other routes from Movescount</li><li>Integrated antenna for outstanding signal reception from GPS and GLONASS satellites</li><li>Tilt compensated digital compass helps keep you headed in the right direction</li><li>Bluetooth Smart connects to a myriad of fitness sensors, from power meters to footpods, as well as smartphones featuring Bluetooth 4.0</li><li>Automatically syncs data to paired smartphones running the free Suunto Movescount app</li><li>Smart notifications (emails, texts, alerts and more) via Bluetooth connection to a compatible smartphone</li><li>Free software updates add functionality and improve performance</li><li>In the box: Suunto Spartan Sport Wrist HR, Suunto Smart Sensor and heart rate belt (size M), USB cable, quick guide, warranty leaflet</li></ul>",
  "img_hrefs": [
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/25897/images/111258/5055696_BK000__32116.1652865012.1280.1280.jpg?c=1"
  ],
  "name": "Suunto Spartan Sport Wrist Heart Rate Watch with Belt",
  "price_cents": 54995,
  "specs": [
    {
      "key": "Weight (Black)",
      "value": "111g"
    },
    {
      "key": "Weight (Blue)",
      "value": "111g"
    },
    {
      "key": "Weight (Sakura)",
      "value": "111g"
    },
    {
      "key": "Ideal for",
      "value": [
        "Running",
        "Swim training",
        "Fitness and training",
        "Road cycling"
      ]
    },
    {
      "key": "Wrist strap material",
      "value": "Silicone"
    },
    {
      "key": "Face material",
      "value": "Mineral crystal glass"
    },
    {
      "key": "IPX rating",
      "value": "IP X8"
    },
    {
      "key": "Dimensions",
      "value": "5 x 5 x 1.7cm"
    },
    {
      "key": "Snooze",
      "value": "Yes"
    },
    {
      "key": "Countdown timer",
      "value": "No"
    },
    {
      "key": "Stopwatch",
      "value": "Yes"
    },
    {
      "key": "Calorie consumption",
      "value": "Yes"
    },
    {
      "key": "Calories in real time",
      "value": "Yes"
    },
    {
      "key": "Coded signal",
      "value": "Yes"
    },
    {
      "key": "Touch screen",
      "value": "Yes"
    },
    {
      "key": "Heart rate in real time",
      "value": "Yes"
    },
    {
      "key": "Interval training",
      "value": "Yes"
    },
    {
      "key": "Batteries",
      "value": "Rechargeable battery pack (non-removable)"
    },
    {
      "key": "Auto pause",
      "value": "Yes"
    },
    {
      "key": "Distance/time alarm",
      "value": "Yes"
    },
    {
      "key": "Battery life",
      "value": "6 - 240 h"
    },
    {
      "key": "Barometric altimeter",
      "value": "No"
    },
    {
      "key": "Basemap",
      "value": "No"
    },
    {
      "key": "Wireless sync",
      "value": "No"
    },
    {
      "key": "ANT+ compatible",
      "value": "No"
    },
    {
      "key": "Metric/imperial units format",
      "value": "Yes"
    },
    {
      "key": "Interface",
      "value": [
        "USB",
        "Wireless"
      ]
    },
    {
      "key": "Button lock",
      "value": "Yes"
    },
    {
      "key": "New lap auto start",
      "value": "No"
    },
    {
      "key": "Pace alarm",
      "value": "No"
    },
    {
      "key": "12/24 hour format",
      "value": "Yes"
    },
    {
      "key": "Bluetooth",
      "value": "Yes"
    },
    {
      "key": "Battery power indicator",
      "value": "Yes"
    },
    {
      "key": "Low battery warning",
      "value": "Yes"
    },
    {
      "key": "Case diameter",
      "value": "50mm"
    },
    {
      "key": "Speed/cadence sensor",
      "value": "Sold separately"
    },
    {
      "key": "Workout history",
      "value": "Yes"
    },
    {
      "key": "Replaceable wrist strap",
      "value": "Yes"
    },
    {
      "key": "Power meter",
      "value": "Sold separately"
    },
    {
      "key": "Pause timer",
      "value": "Yes"
    },
    {
      "key": "Virtual partner",
      "value": "Yes"
    },
    {
      "key": "App compatibility",
      "value": [
        "Suunto",
        "Movescount"
      ]
    },
    {
      "key": "Foot pod",
      "value": "Sold separately"
    },
    {
      "key": "Custom POI",
      "value": "Yes"
    },
    {
      "key": "Chest strap",
      "value": "Included"
    },
    {
      "key": "Programmable workouts",
      "value": "Advanced"
    },
    {
      "key": "Electronic compass",
      "value": "Yes"
    },
    {
      "key": "Add maps capability",
      "value": "No"
    },
    {
      "key": "WiFi",
      "value": "No"
    },
    {
      "key": "Heart rate monitor",
      "value": "Yes"
    },
    {
      "key": "Unit to unit transfer",
      "value": "No"
    },
    {
      "key": "Haptic feedback",
      "value": "Yes"
    },
    {
      "key": "Heart rate target zones",
      "value": "Yes"
    },
    {
      "key": "Made in",
      "value": "Finland"
    }
  ],
  "url": "https://www.mec.ca/en/product/5055-696/spartan-sport-wrist-heart-rate-watch-with-belt"
}