{
  "description": "<p>Hone KGS Swiss Diamond stones provide a complete progression from x-coarse to x-fine grit for a smooth mirror finish. Polishing and de-burring ability of a stone combined with the cutting ability of a file. Unique diamond cluster pattern lasts longer than conventional diamond sheet.</p><ul><li>100 grit x-coarse may be used in place of a smooth (fine) finishing file. Perfect deburring stone for removing hardening from edges caused by hitting rocks or grinding machines and ideal for de-tuning shovel and tail</li><li>200 grit coarse is the perfect maintenance and deburring stone for sharp, smooth edges. Typically used as a second stone in progression from x-coarse to x-fine grit</li><li>400 grit medium is the perfect all-round maintenance and polishing stone for sharp, smooth edges. Typically used as the third stone in progression from x-coarse to x-fine grit</li><li>800 grit fine is the perfect first stone for final polishing after edge bevel and sharpness have been established. Typically used as the fourth stone in progression from x-coarse to x-fine grit</li><li>1500 grit x-fine is the perfect stone for establishing a mirror finish and ultimate edge smoothness through final polishing</li></ul>",
  "img_hrefs": [
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/53251/images/246601/6026636_NOC02__05802.1696066324.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/53251/images/248648/6026636_NOC02_ALT-D__70733.1697101989.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/53251/images/247689/6026636_NOC02_ALT-B__46382.1696624780.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/53251/images/247688/6026636_NOC02_ALT-A__68605.1696624780.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/53251/images/247687/6026636_NOC02_ALT-C__57146.1696624780.1280.1280.jpg?c=1"
  ],
  "name": "Tools4Boards Hone Diamond Stone",
  "price_cents": 2995,
  "specs": [
    {
      "key": "Ideal for",
      "value": [
        "Alpine touring",
        "Snowboarding",
        "Backcountry skiing"
      ]
    },
    {
      "key": "Made in",
      "value": "Switzerland"
    }
  ],
  "url": "https://www.mec.ca/en/product/6026-636/hone-diamond-stone"
}