{
  "description": "<p>Mounted on a 5.5mm thick, precision cast-aluminum backer, the Diamond Disc Stones are the perfect tool to get your edges polished. While these can be handheld, they're the perfect companions to the Tools4Boards Switch system. The full range of grits take care of everything from deburring edges after filing to polishing and smoothing for a mirror finish.</p><ul><li>Diamond sheet is mounted on a flat, precision die-cast aluminum alloy backer</li><li>Extra-thick 5.5mm backer dampens vibration and will not flex and roll over to dull the cutting surface of the ski or snowboard edge</li><li>Unique diamond cluster pattern lasts longer than conventional diamond sheet</li><li>Use 100 extra-coarse grit in place of a smooth (fine) finishing file for deburring and removing case hardening from edges caused by hitting rocks. It's also ideal for de-tuning the shovel and tail</li><li>Use 200 coarse grit as the second stone as you progress from coarse to fine grit while deburring and smoothing your edges</li><li>Use 400 medium grit (usually as a third stone) for all-around maintenance and polishing for sharp, smooth edges</li><li>Use 800 fine grit as the first stone of final polishing after edge bevel and sharpness are established</li><li>Use 1500 X-fine grit for establishing a mirror finish and ultimate edge smoothness through final polishing</li></ul>",
  "img_hrefs": [
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/42784/images/173523/5061419_NOC02__12487.1652865058.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/42784/images/173427/5061419_NOC02_ALT-200GRIT__16085.1649187852.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/42784/images/173343/5061419_NOC02_ALT-800GRIT__35474.1649187850.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/42784/images/173259/5061419_NOC02_ALT-400GRIT__84165.1649187849.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/42784/images/173163/5061419_NOC02_ALT1500GRIT__85960.1649187848.1280.1280.jpg?c=1"
  ],
  "name": "Tools4Boards Puck Swiss Diamond Disc Stone",
  "price_cents": 3195,
  "specs": [
    {
      "key": "Ideal for",
      "value": [
        "Backcountry skiing",
        "Snowboarding",
        "Off-track touring",
        "Downhill skiing"
      ]
    },
    {
      "key": "Made in",
      "value": "Switzerland"
    }
  ],
  "url": "https://www.mec.ca/en/product/5061-419/puck-swiss-diamond-disc-stone"
}