{
  "description": "<p>A grade simulator unlike any other, the Wahoo Kickr Climb Simulator raises the front of your bike to match the incline or your training routes. If you want to get better at riding hills, you have to ride hills, and that means changing your posture and grip to engage different muscles and use different pedalling techniques. The added benefit is that you relieve pressure regularly, so your indoor training becomes less of a grind on your sit bones and soft tissue. Compatible with third-party apps and training platforms, the Kickr Climb brings an immersive verisimilitude to virtual courses so you feel more than just a resistance change on hill climbs, rollers and descents. The world isn’t flat – and now, neither is your living room.</p><ul><li>Real-time grade changes allows for up to 20% inclines and 10% descent simulations</li><li>Compatible with the Wahoo Kickr and Kickr Snap (2017 editions)</li><li>Uses grade information from Kickr and Kickr Snap to adjust steepness</li><li>Manual grade adjustment with remote control for full customization</li><li>Automatic mode matches grade information from Zwift, Trainer Road and other platforms</li><li>Can be controlled by Wahoo Elemnt and Wahoo Bolt bike computers</li><li>Compatible with thru-axle and quick-release–equipped bikes</li></ul>",
  "img_hrefs": [
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/15602/images/72273/5058100_NOC02__54505.1652864977.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/15602/images/72093/5058100_NOC02_ALT-LEFT__94878.1649187757.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/15602/images/71890/5058100_NOC02_ALT-ONBIKE__27581.1649187756.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/15602/images/71702/5058100_NOC02_ALT-TOP__68487.1649187754.1280.1280.jpg?c=1"
  ],
  "name": "Wahoo Fitness Kickr Climb Indoor Trainer Grade Simulator",
  "price_cents": 97995,
  "specs": [
    {
      "key": "Weight",
      "value": "7.7kg (No colour SKU)"
    },
    {
      "key": "Ideal for",
      "value": [
        "Cycle training"
      ]
    },
    {
      "key": "Maximum slope simulation",
      "value": "20%"
    },
    {
      "key": "External power supply required",
      "value": "Yes"
    },
    {
      "key": "Made in",
      "value": "China"
    }
  ],
  "url": "https://www.mec.ca/en/product/5058-100/kickr-climb-indoor-trainer-grade-simulator"
}