{
  "description": "<p>Trusted by pro teams all over the world, Wahoo’s KICKR provides one of the most immersive and realistic rides you can have, from the comfort of home. With all the important features of the 5 generations that came before, the new KICKR gets the addition of WiFi. By adding WiFi to the mix, your favourite training apps have even more ways to send course data to your trainer, giving you the option of saving your Bluetooth and ANT+ signals for sensors. Works with a wide range of training apps to battle with friends while it storms outside. Power accuracy stays constant at an impressive +/- 1%, incline simulation of up to 20% keeps your legs challenged, and with 2200W, you’ll tap out long before the Kickr does. Don't expect the noise of this trainer to drown out your heavy breathing, either – it's a virtually silent ride.</p><ul><li>WiFi integration makes set up easier than ever and allows automatic firmware updates</li><li>Direct-drive trainer accounts for every Watt you generate</li><li>Power reading accuracy of +/- 1% for precise training</li><li>Maximum brake power of 2200W</li><li>Heavy 7.25kg (16lbs.) flywheel ensures a smooth, authentic ride</li><li>Heavy-duty frame built for years of use</li><li>Compatible with 12x142mm and 12x148mm thru axles, as well as 130mm and 135mm quick-release axles</li><li>Realistic slope simulation of up to 20% and down to -10%</li><li>ERG mode maintains a certain effort level regardless of your cadence</li><li>ERG Easy Ramp mode gradually transitions back into ERG mode over 10 seconds, so if you have to stop for some reason starting again feels natural</li><li>Compatible with road and mountain bike wheel sizes of 24in, 650c, 700c, 26in, 27.5in, 29in</li><li>Front wheel support sold separately</li><li>Includes an 11-speed 11-28T ratio cassette. Compatible with 8, 9, 10, 11, and 12 speed Shimano and SRAM cassette drivetrains</li><li>Up to 5º of sway to respond naturally to rider tempo and changes in body position</li><li>Axis feet mimic on the bike movement and help get you into the rhythm of your ride</li><li>Integrated padding within the trainer’s feet reduce noise on hard floors</li><li>Fully compatible with Wahoo Kickr Climb, Wahoo Axis and Wahoo Kickr Headwind accessories, sold separately</li><li>Continuous automatic calibration keeps races honest and accurate</li><li>Clearance is compatible with disc brakes</li><li>Wired connection eliminates signal interference</li><li>Controllable with Wahoo app, Zwift, TrainerRoad, Kinomap and many others</li><li>WiFI, FE-C and Bluetooth smart control allows you to focus on your training and let the app of your choice change the resistance</li><li>LEDs confirm WiFi and Bluetooth connection. (up to 3 Bluetooth connections simultaneously)</li><li>Internal odometer gives you a bit more data, great for bragging rights or providing trainer info, should you decide to sell it</li><li>Wahoo X app trial includes direct access to multiple indoor cycling modes, when you register your KICKR in the Wahoo Fitness app</li><li>Footprint 54 x 71cm (20 x 28in)</li><li>In the box: KICKR, AC power adapter, axis feet - hard, medium, easy, quick release skewer, drive side adapter for 130mm and 135mm QR, reversible hub spacer for 130mm and 135mm QR, drive side adapter for 12x142 and 12x148 thru axle, reversible hub spacer for thru axle, 1.8mm cassette spacer, and disc brake caliper spacer</li><li>Maximum rider weight: 113kg (250lbs)</li></ul>",
  "img_hrefs": [
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/50535/images/221358/6024896_BK000__68773.1666688933.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/50535/images/221353/6024896_BK000_ALT-A__05808.1666688932.1280.1280.jpg?c=1"
  ],
  "name": "Wahoo Fitness Kickr Power V6 Bike Trainer",
  "price_cents": 187995,
  "specs": [
    {
      "key": "Weight",
      "value": "22kg (Black)"
    },
    {
      "key": "Ideal for",
      "value": [
        "Cycle training"
      ]
    },
    {
      "key": "Resistance type",
      "value": [
        "Electromagnetic"
      ]
    },
    {
      "key": "Broadcast communication protocol",
      "value": [
        "ANT+",
        "Bluetooth Smart",
        "WiFi"
      ]
    },
    {
      "key": "Wireless resistance control",
      "value": [
        "ANT+ FE-C",
        "Bluetooth Smart",
        "WiFi"
      ]
    },
    {
      "key": "Data type",
      "value": [
        "Power",
        "Speed",
        "Cadence"
      ]
    },
    {
      "key": "Maximum slope simulation",
      "value": "20%"
    },
    {
      "key": "Maximum resistance at 40Km/h",
      "value": "2200W"
    },
    {
      "key": "Dimensions",
      "value": "54 x 71 x 55cm"
    },
    {
      "key": "External power supply required",
      "value": "Yes"
    },
    {
      "key": "Adjustable resistance",
      "value": "Yes"
    },
    {
      "key": "Folding",
      "value": "Yes"
    },
    {
      "key": "Zwift Certified",
      "value": "Yes"
    },
    {
      "key": "Made in",
      "value": "China"
    }
  ],
  "url": "https://www.mec.ca/en/product/6024-896/kickr-power-v6-bike-trainer"
}