{
  "description": "<p>Outfitted with a dual-band GPS, more memory, and an improved screen, Wahoo has made a good computer even better. With its intuitive navigation and preloaded maps, the ROAM lets you spend less time in menus and more time riding. Standby features like the quick-read LED bezel, Strava segment integration and sleek out the front mount, make the ROAM a formidable addition to your cockpit. The dual-band GPS gives your computer more satellites than even to choose from, so you get a strong signal nearly anywhere. GPS provides speed and distance information, while a barometric altimeter covers ascent, decent, and grade. Equipped with ANT+, Bluetooth Smart and WiFi, there are a wide variety of sensors that can tell you more about how you ride. When trainer season rolls around the ROAM is ready. Seamless smart trainer integration means the ROAM can take control of your smart trainer and help keep you in shape during the off-season. The free companion app makes set-up and customization easy. The app lets you choose how and where your rides are uploaded, what notifications are sent to your ROAM, what maps you have on your device and more.</p><ul><li>Preloaded with a fully routable mapset, including street and trail names. Enter a course or destination and the ELEMNT ROAM will navigate you there</li><li>Detailed re-routing is there for you should you get off course with turn-by-turn directions to get you back on track</li><li>Route-to-start mode finds the shortest way back to where you started or to where your planned ride begins</li><li>Summit mode displays the climbs on your route, displaying the grade, the total ascent, your real-time progress and an elevation profile</li><li>Dual-band signal reception and expanded GNSS support (GPS, GLONASS, BEIDOU, Galileo, QZSS, SBAS, NavIC) provide faster and more accurate positioning and elevation data</li><li>Free ELEMNT companion app lets you set-up different profiles, customize your ELEMNT ROAM and greatly opens up functionality, allowing you to synch routes, use apps (Strava, RideWithGPS, BestBikeSplit, Komoot, etc.) relay notifications, import .GPX, .TCX, or .FIT files and much more</li><li>Strava Live Segment integration lets you know when your starred segments (via your phone) are about to begin and shows instantaneous data.  Showing your performance in the moment, and how it compares to your PR and the current KOM or QOM, and then provides results (Strava premium required)</li><li>Live Tracking during activities (via your phone running the ELEMNT app) allows you to share your location, speed, and more</li><li>Compatible with downloadable planned workouts that will take you through various tests or training rides</li><li>Preloaded with 5 structured workouts for you to do indoors or outdoors – 2 FTP tests and 3 workouts</li><li>TrainerRoad, TrainingPeaks and Today’s Plan are fully integrated with ELEMNT ROAM, allowing you to download and upload rides and workouts</li><li>Pre-loaded with maps of North America, Europe, Asia, Oceania, South America, and Africa. Maps for Russia and China can be downloaded over WiFi</li><li>Route sharing with other ELMNT users, letting you easily send planned routes on the fly</li><li>Group ride functionality displays other ELEMNT users on the map</li><li>Mountain bike features allow you to synch your To-Do List from MTB Project and your Wishlist from Singletracks to your ELEMNT ROAM from your phone over WiFi or Bluetooth</li><li>Configurable 12 LED display can relay various information, from navigation cues, power and heart rate zones, to acting as an alert light for notifications</li><li>Trainer support lets you control your smart trainer, with specific modes for Wahoo smart trainers. Non-Wahoo smart trainers equipped with ANT+ FE-C can also be controlled</li><li>Compatible with Supersapiens continuous glucose monitor and other ANT+ and Bluetooth Smart sensors, letting you greatly increase your available metrics</li><li>Works with electronic shifting systems: Shimano Di2, SRAM eTAP, FSA WE, and Campagnolo EPS</li><li>6.9cm 64 colour display protected by a tough, non-reflective Gorilla Glass© screen</li><li>IPX7 weatherproofing fends off even the heaviest downpour</li><li>Integrated out-the-front mount has a sleek, aerodynamic profile</li><li>USB rechargeable battery has up to 17 hours of battery life while running GPS and external sensors</li></ul>",
  "img_hrefs": [
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/52353/images/237805/6026031_BK000__78443.1687337679.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/52353/images/237816/6026031_BK000_ALT-A__68531.1687337679.1280.1280.jpg?c=1"
  ],
  "name": "Wahoo Fitness Elemnt Roam V2",
  "price_cents": 54995,
  "specs": [
    {
      "key": "Weight",
      "value": "94g (Black)"
    },
    {
      "key": "Ideal for",
      "value": [
        "Road cycling",
        "Cycle touring",
        "Cross-country riding",
        "Cycle training"
      ]
    },
    {
      "key": "Built-in memory",
      "value": "32GB"
    },
    {
      "key": "IPX rating",
      "value": "IP X7"
    },
    {
      "key": "Dimensions",
      "value": "9 x 6 x 2cm"
    },
    {
      "key": "Snooze",
      "value": "No"
    },
    {
      "key": "Countdown timer",
      "value": "No"
    },
    {
      "key": "Stopwatch",
      "value": "Yes"
    },
    {
      "key": "Calorie consumption",
      "value": "No"
    },
    {
      "key": "Calories in real time",
      "value": "No"
    },
    {
      "key": "Speed/cadence sensor",
      "value": "Sold separately"
    },
    {
      "key": "Coded signal",
      "value": "Yes"
    },
    {
      "key": "Workout history",
      "value": "Yes"
    },
    {
      "key": "Touch screen",
      "value": "No"
    },
    {
      "key": "Heart rate in real time",
      "value": "No"
    },
    {
      "key": "Interval training",
      "value": "No"
    },
    {
      "key": "Batteries",
      "value": "Lithium-ion (included)"
    },
    {
      "key": "Auto pause",
      "value": "Yes"
    },
    {
      "key": "Power meter",
      "value": "Sold separately"
    },
    {
      "key": "Pause timer",
      "value": "Yes"
    },
    {
      "key": "Battery life",
      "value": "17 h"
    },
    {
      "key": "Barometric altimeter",
      "value": "Yes"
    },
    {
      "key": "Basemap",
      "value": "Yes"
    },
    {
      "key": "Wireless sync",
      "value": "Yes"
    },
    {
      "key": "ANT+ compatible",
      "value": "Yes"
    },
    {
      "key": "Virtual partner",
      "value": "No"
    },
    {
      "key": "Metric/imperial units format",
      "value": "Yes"
    },
    {
      "key": "App compatibility",
      "value": [
        "Wahoo Fitness",
        "Third party apps"
      ]
    },
    {
      "key": "Foot pod",
      "value": "Not compatible"
    },
    {
      "key": "Custom POI",
      "value": "Yes"
    },
    {
      "key": "Interface",
      "value": [
        "USB",
        "Wireless"
      ]
    },
    {
      "key": "Chest strap",
      "value": "Sold separately"
    },
    {
      "key": "Programmable workouts",
      "value": "Advanced"
    },
    {
      "key": "New lap auto start",
      "value": "Yes"
    },
    {
      "key": "Electronic compass",
      "value": "Yes"
    },
    {
      "key": "Area calculation",
      "value": "No"
    },
    {
      "key": "Add maps capability",
      "value": "Yes"
    },
    {
      "key": "Pace alarm",
      "value": "No"
    },
    {
      "key": "WiFi",
      "value": "Yes"
    },
    {
      "key": "Bluetooth",
      "value": "Yes"
    },
    {
      "key": "Battery power indicator",
      "value": "Yes"
    },
    {
      "key": "Heart rate monitor",
      "value": "Sold separately"
    },
    {
      "key": "Low battery warning",
      "value": "Yes"
    },
    {
      "key": "Unit to unit transfer",
      "value": "Yes"
    },
    {
      "key": "Heart rate target zones",
      "value": "No"
    },
    {
      "key": "Product sustainability",
      "value": [
        "Rechargeable batteries"
      ]
    },
    {
      "key": "Made in",
      "value": "China"
    }
  ],
  "url": "https://www.mec.ca/en/product/6026-031/elemnt-roam-v2"
}