{
  "description": "<p>These classic hiking boots combine old world craftsmanship and design with modern materials. The entire midsole and outsole construction is lighter, better cushioned, and more comfortable out of the box than traditional Norwegian welted boots, yet can still be resoled. The end result is a beautiful, rugged hiking and backpacking boot that you can keep going for years.</p><ul><li>Uppers are Zamberlan Hydrobloc full-grain leather, treated for water repellancy and durability</li><li>Ankle flex zones ease movement for comfort</li><li>GORE-TEX® waterproof-breathable membrane adds weatherproofness</li><li>Polyethylene insole glued to thermoplastic rubber lasting boards, moulded with a stitching edge to which the upper is attached using traditional Norwegian welt stitched construction</li><li>Rubber toe rand is both bonded to the leather upper and stitched to the lasting board</li><li>Lightweight dual-density PU wedge midsole provides durable underfoot cushioning and support</li><li>Vibram® rubber outer sole with multi-directional lugs provides good traction on a variety of surfaces</li></ul>",
  "img_hrefs": [
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/20596/images/85477/5024120_WXB01__03953.1652864990.1280.1280.jpg?c=1",
    "https://cdn11.bigcommerce.com/s-xw5rh7060c/products/20596/images/85340/5024120_WXB01_ALT-SOLE__06352.1649187764.1280.1280.jpg?c=1"
  ],
  "name": "Zamberlan Tofane NW Gore-Tex Backpacking Boots - Men's",
  "price_cents": 55995,
  "specs": [
    {
      "key": "Weight",
      "value": "1.74kg (43)"
    },
    {
      "key": "Ideal for",
      "value": [
        "Backpacking"
      ]
    },
    {
      "key": "Upper material",
      "value": [
        "Full-grain leather"
      ]
    },
    {
      "key": "Closure",
      "value": [
        "Lace-up"
      ]
    },
    {
      "key": "Rand",
      "value": "Toecap"
    },
    {
      "key": "Removable insole",
      "value": "Yes"
    },
    {
      "key": "Waterproof",
      "value": "Yes"
    },
    {
      "key": "Made in",
      "value": "Italy"
    }
  ],
  "url": "https://www.mec.ca/en/product/5024-120/tofane-nw-gt-backpacking-boots"
}