{
  "center_geohash": "f9pt5wmevxet",
  "center_lat": 51.53892345,
  "center_lng": -56.7915223,
  "description": "This trail is complete using sections of ATV trail in the middle, but may undergo re-routing to keep the hiker footpath closer to the traditional path along the cliff side (check with visitor centre in L'Anse Au Clair, the town close to the ferry terminus in Blanc Sablon and your starting point for the Labrador Pioneer Footpath).\nHiker?s hiking in the direction of L?Anse Au Clair to Forteau, then Point Amour lighthouse and into L'Anse Au Loup will face this as the next leg.  Unfortunately the Battery trail exits along the top of the Battery along the highway (at present). The climb from parking area (at the end of Brook road just before the highway climbs out of town) will be steep but not that long.  As you get a little cardio and your climb levels off, you should have great views back to the ocean (we hiked on a foggy day).  However not long after gaining the height of land (the highest point in the area) the trail unexpectedly veers away from the ocean views and onto ATV trail which is not ideal.  This will be disappointing for some hikers, not to mention black flies that are ever present if a strong wind isn't up.  Since it was quite windy (and usually is) up on \"the Battery\" as it?s known, it may not be too bad but a bug net is recommended for anyone hiking this coastal route ijust in case it's one of those days.  We only had one such day where it was really bad.\nEventually one does make their way back to the original cliff side trail (the traditional community to community footpath used by locals from the 1800s to the 1960s).  Today, locals use the traditional path mostly for berry pickingm bakeapples being worth their weight in gold it seems, so make sure to eat a few ripe ones as you hike (hint: ripe ones have turned yellow).  The path stays close to the cliffs because the best partridge berries were often there, whereas the bakeapple berries are more in boggy areas.  \nShortly after you reach the cliff side trail, there is a plaque commemorating a dramatic cliff side rescue of a woman who had taken a fall while collecting berries.  Your route is marked every 100 metres or so by the trademark footpath markers.  However, you?ll have to keep a keen eye out in the fog. If you don't see a trail marker post, return to your last one and try again.  Because the current hiker?s route veers off the traditional footpath (you can see evidence of the old footpath) we had simply continued along what naturally felt was the trail and oops - no more markers.  So we went back and found the left the trail had taken.  We had GPS with us, making it easy to retrace our steps as well.  With a few hiker cairns, and perhaps more frequent markers on the Battery, the old pole path would be my preferable route providing views out over the ocean.  For that reason this was my least favourite leg of the Labrador Pioneer Footpath when it could have been the best.\nThe wind was howling along the cliffs and the trail was only 10 feet from the edge but we enjoyed the views tremendously.  One can always keep a few feet further away from the cliffs.  The trail standard (with a few more official trail markers and hiker cairns perhaps) would work well up here along the traditional footpath. I am sure this leg will be worked on by the time hikers hit the Labrador Pioneer Footpath in 2012.\nThe exit for us was another roadside pullout where we had parked a second vehicle in order to shuttle this hike, least you walk 4 to 5km on the highway to get into L'Anse Au Diable. The  are obvious and marked on the map, see the google map (and downloadable GPS/GPX) and the directions section below for details. \nThrough hikers would have to continue walking on the highway from the gravel parking area trailhead, on to L?Anse Au Diable, but keep checking in with the visitor center, I feel confident routing changes will be made on this segment of the Labrador Pioneer Footpath.  Hikers love elevation gain, views, and in a perfect world, no bugs.\nnote: attached GPS data has a dozen waypoints including trailheads and points of interest.  The attached GPS data however was collected in reverse direction (see playback when clicking EXPAND+ at right).",
  "directions": "Leaving L?Anse au Loup, look for Brook road on the right before the highway climbs \"the Battery\" (named for WWII gun turret on cliffs).  Go down this dirt road with hosues on the right and park at the parking area at the very end (a dead end turnaround).  The beginning of the trail is visible via a Labrador Pioneer Footpath marker (a 3 foot high post with the brand logo of the trail, a footprint) that is sitting on the steep bank on the same side as the parking area (and opposite the homes on the shore side).  Simply start climbing, the trail is rough initially, it?s been cleared, but you will at times climb hand to foot, make sure you are comfortable with a steep initial climb.  It doesn?t take that long to gain some elevation, then just follow the trail marker posts with logo.  Always keep an eye out for them. Even in dense fog as we had, you can still see the next one.  The exit to the Battery trail as the trail currently goes is up top the Battery coming out at the highway.  It's a long way from here to the town of L'Anse Au Diable still, so the recommendation is park a second vehicle at the trailhead on the Battery, or, tough it out on the highway walking into town.",
  "geohash": "f9pt",
  "nearest_peak_geohash": "f9pt75255xwd",
  "photos": [
    "https://trailpeak.com/storage//content/trails/Canada/NL/10233/reg_-DSC1170-5.jpg",
    "https://trailpeak.com/storage//content/trails/Canada/NL/10233/reg_-DSC1178-5.jpg",
    "https://trailpeak.com/storage//content/trails/Canada/NL/10233/narrow_-DSC1173-5.jpg",
    "https://trailpeak.com/storage//content/trails/Canada/NL/10233/narrow_-DSC1179-5.jpg"
  ],
  "source_url": "https://trailpeak.com/trails/labrador-pioneer-footpath-battery-trail-near-lanse-au-loup-nf-10233",
  "stats": {
    "Activities": "hike",
    "From": "",
    "Seasons": "spring fall summer",
    "Stars": 3,
    "Time": "2 hrs",
    "Total Distance": "5 km",
    "Town": "L'Anse-au-Loup, NF",
    "Type": "out-and-back"
  },
  "title": "Labrador Pioneer Footpath - Battery Trail",
  "trail_id": "10233"
}